
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если НЕ Параметры.Свойство("ОбъектСсылка", ОбъектСсылка) Тогда Отказ = Истина; Возврат; КонецЕсли;

СчетГУИД = Параметры.СчетГУИД;
Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда
	Счет = Неопределено;
ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	Счет = Неопределено;
ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
	НайденныеСтроки = ОбъектСсылка.Счета.НайтиСтроки(ОтборСтроки);
	
	Счет = НайденныеСтроки[0]; 
Иначе
	Отказ = Истина; Возврат;
КонецЕсли;

Контрагент = PayKeeperСервер.Контрагент(ОбъектСсылка, Счет);
EMail = Контрагент.ЭлПочта;
Телефон = Контрагент.Телефон;

Элементы.EmailОтправить.Доступность = ЗначениеЗаполнено(EMail);

ЭтоЮрЛицо = (Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо);
Если ЭтоЮрЛицо Тогда  
	ТелефонДоступность = Ложь;
Иначе
	ТелефонДоступность = ЗначениеЗаполнено(Телефон);
КонецЕсли;	
Элементы.ТелефонОтправить.Доступность = ТелефонДоступность; 

PayKeeperВыводНаЭкран = Константы.PayKeeperВыводНаЭкран.Получить();
Элементы.ЭкранОтправить.Видимость = PayKeeperВыводНаЭкран; 

ЕстьОтправка = ЕстьОтправка();	
Элементы.ГруппаПовторнаяОтправка.Видимость = ЕстьОтправка;	
КонецПроцедуры

&НаСервере
Функция ЕстьОтправка()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	PayKeeperПлатежи.ИД_Платежа КАК ИД_Платежа
                      |ИЗ
                      |	РегистрСведений.PayKeeperПлатежи КАК PayKeeperПлатежи
                      |ГДЕ
                      |	PayKeeperПлатежи.НомерСчета = &НомерСчета");	
	
Запрос.УстановитьПараметр("НомерСчета", НомерСчетаPayKeeper);

Резльтат = Запрос.Выполнить();

Возврат НЕ Резльтат.Пустой();
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
Результат = Новый Структура("EmailОтправить, ТелефонОтправить, ЭкранОтправить, ЕстьОтправка, ПовторнаяОтправка"
	, EmailОтправить, ТелефонОтправить, ЭкранОтправить, ЕстьОтправка, ПовторнаяОтправка);
	
Закрыть(Результат);	
КонецПроцедуры

