
Процедура ПриЗаписи(Отказ)
Если ЭтотОбъект.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли; 	
	
ОбновитьКомплектацииГорничные(ЭтотОбъект);
КонецПроцедуры

Процедура ОбновитьКомплектацииГорничные(ТекущийОбъект)
ОбменСГорничными = Константы.ОбменСГорничными.Получить();	
Если НЕ ОбменСГорничными Тогда Возврат; КонецЕсли; 
	
Соединение = ОбменГорничныеСервер.Соединение();
Если Соединение = Неопределено Тогда Возврат; КонецЕсли;

КомлектацияДанные = Новый Структура;
КомлектацияДанные.Вставить("Код", ТекущийОбъект.Код);
КомлектацияДанные.Вставить("Наименование", ТекущийОбъект.Наименование);
КомлектацияДанные.Вставить("ПометкаУдаления", ТекущийОбъект.ПометкаУдаления);
КомлектацияДанные.Вставить("НеИспользуется", ТекущийОбъект.НеИспользуется);
КомлектацияДанные.Вставить("Сортировка", ТекущийОбъект.Сортировка);

Попытка 
	Соединение.ОбменГорничныеСервер.ОбновитьКомплектацияГорничные(КомлектацияДанные);
Исключение
	Сообщить("Ошибка записи в БД Горничные. ОбновитьКомплектацияГорничные. " + ОписаниеОшибки());   	
КонецПопытки;

КонецПроцедуры
