
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ЗапросТекущихОстатков=Новый Запрос("ВЫБРАТЬ
	                                   |	ОстаткиПродукцииОстатки.Товар,
	                                   |	ОстаткиПродукцииОстатки.КоличествоОстаток,
	                                   |	ЕСТЬNULL(СебестоимостьТоваровСрезПоследних.Себестоимость, 0) КАК СебестоимостьОстаток
	                                   |ИЗ
	                                   |	РегистрНакопления.ОстаткиПродукции.Остатки(&ДТ, Товар В (&Товар)) КАК ОстаткиПродукцииОстатки
	                                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьТоваров.СрезПоследних(&дт, Товар В (&Товар)) КАК СебестоимостьТоваровСрезПоследних
	                                   |		ПО ОстаткиПродукцииОстатки.Товар = СебестоимостьТоваровСрезПоследних.Товар");
	ЗапросТекущихОстатков.УстановитьПараметр("Товар",Товары.ВыгрузитьКолонку("Товар"));
	ЗапросТекущихОстатков.УстановитьПараметр("ДТ",Дата);
	ТЗТек=ЗапросТекущихОстатков.Выполнить().Выгрузить();
	
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		// регистр ОстаткиПродукции Приход
		Движение = Движения.ОстаткиПродукции.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
		ДвижениеС = Движения.СебестоимостьТоваров.Добавить();
        ДвижениеС.Период=Дата;
		ДвижениеС.Товар=ТекСтрокаТовары.Товар;
		// усредняем себестоимость
		Поиск=ТЗТек.Найти(ТекСтрокаТовары.Товар,"Товар");
		Попытка
		Если Поиск<>Неопределено тогда
			ДвижениеС.Себестоимость=((Поиск.КоличествоОстаток*Поиск.СебестоимостьОстаток)+(ТекСтрокаТовары.Количество*ТекСтрокаТовары.Цена))/(ТекСтрокаТовары.Количество+Поиск.КоличествоОстаток);
		иначе
			ДвижениеС.Себестоимость=ТекСтрокаТовары.Цена;
		конецесли;
	Исключение
			ДвижениеС.Себестоимость=ТекСтрокаТовары.Цена;
		КонецПопытки;		
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
