
Функция ПроверкаНомераТелефона(НомерТелефона) Экспорт
Ответ = Новый Структура("ТелефонНомер, КодОшибки", "", 0);

Если СтрДлина(НомерТелефона) = 0 Тогда
	Ответ.КодОшибки = 1;
	Возврат Ответ;
КонецЕсли;

НомерТелефона_П = "";
Для НомерСимвола = 1 по СтрДлина(НомерТелефона) Цикл 
	Символ = Сред(НомерТелефона, НомерСимвола, 1);
	Если СтрНайти("+0123456789", Символ) > 0 Тогда 
		НомерТелефона_П = НомерТелефона_П + Символ; 
	КонецЕсли;
КонецЦикла;

Символ = Лев(НомерТелефона_П, 1);
Если Символ = "+" Тогда 
	ТелефонНомер = Символ; 
	Если Сред(НомерТелефона_П, 2, 1) = "8" Тогда
		ТелефонНомер = ТелефонНомер + "7";
		Начало = 3;	
	Иначе
		Начало = 2;	
	КонецЕсли;	
ИначеЕсли Символ = "8" Тогда 
	ТелефонНомер = "+7"; 
	Начало = 2;	
Иначе	
	ТелефонНомер = "+7"; 
	Начало = 1;	
КонецЕсли;

Для НомерСимвола = Начало по СтрДлина(НомерТелефона_П) Цикл 
	Символ = Сред(НомерТелефона_П, НомерСимвола, 1);
	Если СтрНайти("0123456789", Символ) > 0 Тогда 
		ТелефонНомер = ТелефонНомер + Символ; 
	КонецЕсли;
КонецЦикла;	

//Если СтрДлина(ТелефонНомер) < 10 
//ИЛИ СтрДлина(ТелефонНомер) > 12 
//Тогда 
//	Ответ.КодОшибки = -1;
//	Возврат Ответ;
//КонецЕсли;
Если СтрДлина(ТелефонНомер) <> 12 Тогда 
	Ответ.КодОшибки = -1;
	Возврат Ответ;
КонецЕсли;


Ответ.ТелефонНомер = ТелефонНомер;
Возврат Ответ;
КонецФункции

Функция ПроверкаНомераТелефона_1(НомерТелефона) Экспорт
Ответ = Новый Структура("ТелефонНомер, КодОшибки", "", 0);

Если СтрДлина(НомерТелефона) = 0 Тогда
	Ответ.КодОшибки = 1;
	Возврат Ответ;
КонецЕсли;
		
Символ = Лев(НомерТелефона, 1);
Если Символ = "+" Тогда 
	ТелефонНомер = Символ; 
Иначе	
	ТелефонНомер = ""; 
КонецЕсли;

Для НомерСимвола = 1 по СтрДлина(НомерТелефона) Цикл 
	Символ = Сред(НомерТелефона, НомерСимвола, 1);
	Если СтрНайти("0123456789", Символ) > 0 Тогда 
		ТелефонНомер = ТелефонНомер + Символ; 
	КонецЕсли;
КонецЦикла;	

Если СтрДлина(ТелефонНомер) < 10 
ИЛИ СтрДлина(ТелефонНомер) > 12 
Тогда 
	Ответ.КодОшибки = -1;
	Возврат Ответ;
КонецЕсли;

Ответ.ТелефонНомер = ТелефонНомер;
Возврат Ответ;
КонецФункции
