
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
УстановитьПараметрыВыбораКомиссияСчета();
КонецПроцедуры

&НаКлиенте
Процедура ГрупповойСчетПриИзменении(Элемент)
УстановитьПараметрыВыбораКомиссияСчета();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораКомиссияСчета()
Массив = Новый Массив;
Если ЗначениеЗаполнено(ГрупповойСчет) Тогда
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Контрагент", ГрупповойСчет.Контрагент);
	Массив.Добавить(НовыйПараметр);
	ФиксированныйМассив = Новый ФиксированныйМассив(Массив);
	Элементы.КомиссияСчета.ПараметрыВыбора = ФиксированныйМассив; 	
Иначе
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Неопределено);
	Массив.Добавить(НовыйПараметр);
	ФиксированныйМассив = Новый ФиксированныйМассив(Массив);
	Элементы.КомиссияСчета.ПараметрыВыбора = ФиксированныйМассив; 

//Иначе
//	ФиксированныйМассив = Новый ФиксированныйМассив(Массив);
//	Элементы.Контрагент.ПараметрыВыбора = ФиксированныйМассив; 	
КонецЕсли;
Конецпроцедуры

&НаКлиенте
Процедура ЗаполнитьГрупповойСчетКомиссияСчета(Команда)
	ЗаполнитьГрупповойСчетКомиссияСчетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрупповойСчетКомиссияСчетаНаСервере()
Если НЕ ЗначениеЗаполнено(ГрупповойСчет) Тогда Возврат; КонецЕсли;	
Если НЕ ЗначениеЗаполнено(КомиссияСчета) Тогда Возврат; КонецЕсли;	
	
ГрупповойСчетОбъект	= ГрупповойСчет.ПолучитьОбъект();
Если ГрупповойСчетОбъект.КомиссияДокументыДолги.Количество() > 0 Тогда
	Сообщить("КомиссияДокументыДолги уже загружена");
	
	Возврат;
КонецЕсли;

КомиссияСчетаОбъект	= КомиссияСчета.ПолучитьОбъект();
Если КомиссияСчетаОбъект.ДокументыДолги.Количество() = 0 Тогда
	Сообщить("ДокументыДолги - пусто");
	
	Возврат;
КонецЕсли;

//
Для Каждого Строка Из КомиссияСчетаОбъект.ДокументыДолги Цикл
	НоваяСтрока = ГрупповойСчетОбъект.КомиссияДокументыДолги.Добавить();
	
	НоваяСтрока.ДокументДолг = Строка.ДокументДолг; 
КонецЦикла;

ГрупповойСчетОбъект.ПроцентКомиссии_НеИспользуется = КомиссияСчетаОбъект.ПроцентКомиссии;
ГрупповойСчетОбъект.СуммаКомиссииКонтрагента = КомиссияСчетаОбъект.СуммаКомиссииКонтрагента;
//

ГрупповойСчетОбъект.Записать(РежимЗаписиДокумента.Проведение);	
КонецПроцедуры





