
Функция ПолучитьТехническиеНеисправности(ТехническиеНеисправности, ТехническиеНеисправностиПримечание) Экспорт
СтрокаТехническиеНеисправности = "";
Для Каждого Строка Из ТехническиеНеисправности Цикл
	СтрокаТехническиеНеисправности = СтрокаТехническиеНеисправности + Строка.ТехническаяНеисправность + ", ";
КонецЦикла;

Если СтрокаТехническиеНеисправности <> "" Тогда
	СтрокаТехническиеНеисправности = Лев(СтрокаТехническиеНеисправности, СтрДлина(СтрокаТехническиеНеисправности) - 2) + ".";
КонецЕсли;

СтрокаТехническиеНеисправности = СтрокаТехническиеНеисправности + ТехническиеНеисправностиПримечание;

Возврат СтрокаТехническиеНеисправности;
КонецФункции
