
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ВызовИзДокумента", ВызовИзДокумента);

Параметры.Свойство("Бронирует", Бронирует);
Если ЗначениеЗаполнено(Бронирует) Тогда
	КонтрагентОтбор = Бронирует;
	Элементы.Бронирует.ТолькоПросмотр = Истина; 
КонецЕсли;

Параметры.Свойство("ДатаСОтбор", ДатаОтбораС);
Если ЗначениеЗаполнено(ДатаОтбораС) Тогда Элементы.ДатаОтбораС.ТолькоПросмотр = Истина; КонецЕсли;
	
Параметры.Свойство("ДатаПоОтбор", ДатаОтбораПо);
Если ЗначениеЗаполнено(ДатаОтбораПо) Тогда Элементы.ДатаОтбораПо.ТолькоПросмотр = Истина; КонецЕсли;

Неоплачено = Истина;

УсловноеОформлениеЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(КонтрагентОтбор);
Если ВызовИзДокумента Тогда 
	ОтобратьНаСервере();
КонецЕсли;		
КонецПроцедуры

//
&НаСервере
Процедура УсловноеОформлениеЗагрузить()
ЭлементыТабНаФормеИмя = Элементы.ТаблицаОтбора.Имя;

ПутьКПолюОтбора = "ТаблицаОтбора.Отметка";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;

УсловноеОформление.Элементы.Очистить();

ПравоеЗначение = Истина;
Web_Цвета = WebЦвета.БледноЗолотистый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление,
	ЭлементыТабНаФормеИмя,ПутьКПолюОтбора,Вид_Сравнения, ПравоеЗначение, Web_Цвета );
КонецПроцедуры
//

//

&НаКлиенте
Процедура БронируетПриИзменении(Элемент)
КонтрагентОтбор = Бронирует;
КонтрагентОтборПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОтборПриИзменении(Элемент)
ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(КонтрагентОтбор);

//Если ЮрЛицо Тогда ИПустые = Ложь; КонецЕсли;
//Элементы.ИПустые.Доступность = НЕ ЮрЛицо;

//ОтобратьНаСервере();
КонецПроцедуры
//


//
&НаКлиенте
Процедура Отобрать(Команда)
Если ПроверкаОтбораПредупреждение() Тогда Возврат; КонецЕсли;
	
ОтобратьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтобратьНаСервере()
Запрос = Новый Запрос;
			   
Запрос.Текст = ГрупповойСчетСервер.ЗапросТекстОтборЗаявокКомиссияСчет();

Запрос.УстановитьПараметр("КонтрагентОтбор", КонтрагентОтбор);
Запрос.УстановитьПараметр("РезервС", ДатаОтбораС);

Если ЗначениеЗаполнено(ДатаОтбораПо) Тогда ДатаОтбораПо_П = ДатаОтбораПо; Иначе ДатаОтбораПо_П = '30010101'; КонецЕсли;
Запрос.УстановитьПараметр("РезервПо", ДатаОтбораПо_П);

Запрос.УстановитьПараметр("Все", Ложь);

ТЗРезультат = Запрос.Выполнить().Выгрузить();

ТаблицаОтбора.Очистить();
Для Каждого Строка Из ТЗРезультат Цикл
	//Если Неоплачено тогда
	//	Если НЕ Строка.СуммаОплаты = 0 Тогда Продолжить; КонецЕсли;
	////Иначе 
	////	Если Строка.СуммаОплаты > 0 Тогда Продолжить; КонецЕсли;
	//КонецЕсли;
	
	Если Строка.СуммаПроживание = 0 Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = ТаблицаОтбора.Добавить();
	НоваяСтрока.ЗаявкаНаБронирование = Строка.Ссылка;
	НоваяСтрока.Оплачивает = Строка.Оплачивает;
	НоваяСтрока.Проживает = Строка.Клиент;
	НоваяСтрока.Бронирует = Строка.Бронирует;
	НоваяСтрока.РезервС = Строка.РезервС;
	НоваяСтрока.РезервПо = Строка.РезервПо;
	НоваяСтрока.Номер = Строка.НомерВРезерв;
	НоваяСтрока.СуммаПроживание = Строка.СуммаПроживание;
	НоваяСтрока.СуммаОплачено = Строка.ОплатаПроживание;
	
	НоваяСтрока.ДатаЗаявки = Строка.Дата;
	НоваяСтрока.НомерЗаявки = Строка.Номер;
	
	//НоваяСтрока.ПроцентКомиссии = Строка.ПроцентКомиссии;
	НоваяСтрока.ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(НоваяСтрока.Бронирует, НоваяСтрока.ЗаявкаНаБронирование.РезервС); //, НоваяСтрока.ЗаявкаНаБронирование.В2В);
	НоваяСтрока.ПроцентВ2В = ДокументыСервер.ПроцентВ2В(НоваяСтрока.Бронирует, НоваяСтрока.ЗаявкаНаБронирование.РезервС); 
	
	//НоваяСтрока.СуммаКомиссии = Строка.СуммаКомиссии;
	НоваяСтрока.СуммаКомиссии = Окр(НоваяСтрока.СуммаПроживание * НоваяСтрока.ПроцентКомиссии / 100, 2) ;
КонецЦикла;	

ТаблицаОтбора.Сортировать("РезервС, ЗаявкаНаБронирование"); 
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтметитьВсе(Команда)
Для Каждого Строка Из ТаблицаОтбора Цикл
	Строка.Отметка = Истина;	
КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтметкиВсе(Команда)
Для Каждого Строка Из ТаблицаОтбора Цикл
	Строка.Отметка = Ложь;	
КонецЦикла;	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ТаблицаОтбораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтбораПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТекущиеДанные = ТаблицаОтбора.НайтиПоИдентификатору(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура();
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ЗаявкаНаБронирование);

ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы .БлокироватьОкноВладельца);
КонецПроцедуры
//

////////

//
&НаКлиенте
Функция ПроверкаОтбораПредупреждение()
	
ТекстПредупреждения = "";
Если НЕ ЗначениеЗаполнено(Бронирует) Тогда 
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			, "Заполните реквизит 'Бронирует'", Символы.ПС);
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ДатаОтбораС) Тогда 
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			, "Заполните реквизит 'Дата отбора Резерв С'", Символы.ПС);
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ДатаОтбораПо) Тогда 
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			, "Заполните реквизит 'Дата отбора Резерв По'", Символы.ПС);
КонецЕсли;

Если НЕ ТекстПредупреждения = "" Тогда 
		ПоказатьПредупреждение(, ТекстПредупреждения);
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции
//

&НаКлиенте
Процедура ОтменаКоманда(Команда)
Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаявки(Команда)
МассивЗаявок = МассивЗаявок();
Если МассивЗаявок.Количество() = 0 Тогда 
		ПоказатьПредупреждение(, "Ничего не отмечено.");
	Возврат;
КонецЕсли;

ТекстПредупреждения = "";
Если НЕ ЗначениеЗаполнено(Бронирует) Тогда 
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			, "Заполните реквизит 'Бронирует'", Символы.ПС);
			
		ПоказатьПредупреждение(, ТекстПредупреждения); 	
		Возврат;			
КонецЕсли;

ПараметрыЗакрытия = Новый Структура("Бронирует, ДатаС, ДатаПо, МассивЗаявок"
	, Бронирует, ДатаОтбораС, ДатаОтбораПо, МассивЗаявок); 
	
Закрыть(ПараметрыЗакрытия);   
КонецПроцедуры

&НаСервере
Функция МассивЗаявок()
ТаблицаОтбораПараметр = ТаблицаОтбора;	
МассивЗаявок = Новый Массив;
	
ОтборСтроки = Новый Структура("Отметка", Истина);
МассивОтборЗаявок = ТаблицаОтбора.НайтиСтроки(ОтборСтроки);
Если МассивОтборЗаявок.Количество() = 0 Тогда 
	Возврат МассивЗаявок; 
КонецЕсли; 

ТаблицаЗаявок = ТаблицаОтбора.Выгрузить(МассивОтборЗаявок);
ТаблицаЗаявок.Сортировать("РезервС, ЗаявкаНаБронирование");

Для Каждого Строка Из ТаблицаЗаявок Цикл
	Данные = Новый Структура();
	Данные.Вставить("ЗаявкаСсылка", Строка.ЗаявкаНаБронирование);
	
	МассивЗаявок.Добавить(Данные);
КонецЦикла;

Возврат МассивЗаявок;
КонецФункции












// ++++++++++++++++++++++++++++++++++++++++++++++++++++



