
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Поля = Новый Массив;
Поля.Добавить("Заявка");

Список.УстановитьОграниченияИспользованияВГруппировке(Поля);
Список.УстановитьОграниченияИспользованияВОтборе(Поля);
Список.УстановитьОграниченияИспользованияВПорядке(Поля);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
Запрос = Новый Запрос(	"ВЫБРАТЬ
                      	|	ЗаявкаНаБронирование.Ссылка КАК Заявка
						|ИЗ
                      	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      	|ГДЕ
                      	|	ЗаявкаНаБронирование.Ссылка В(&Заявки)");

Ключи = Строки.ПолучитьКлючи();
Заявки = Новый Массив;
КлючиЗаявки = Новый Массив;

УникальныйИдентификаторПустой = ОбщийФункционалСервер.УникальныйИдентификаторПустой();
Для Каждого Строка Из Ключи Цикл
	Если Строка.ЗаявкаГУИД = УникальныйИдентификаторПустой Тогда Продолжить; КонецЕсли;
	
	ЗаявкаСсылка = Документы.ЗаявкаНаБронирование.ПолучитьСсылку(Строка.ЗаявкаГУИД);
	
	ЗаявкаОбъект = ЗаявкаСсылка.ПолучитьОбъект();
	Если ЗаявкаОбъект = Неопределено Тогда Продолжить; КонецЕсли;
	
	Заявки.Добавить(ЗаявкаСсылка);
	КлючиЗаявки.Добавить(Строка);
КонецЦикла;

Запрос.УстановитьПараметр("Заявки", Заявки);

ТЗ = Запрос.Выполнить().Выгрузить();
ТЗ.Колонки.Добавить("ГУИД");
Для Каждого Строка Из ТЗ Цикл
	Строка.ГУИД = Строка.Заявка.УникальныйИдентификатор(); 	
КонецЦикла;

Индекс = 0;
Пока Индекс < КлючиЗаявки.Количество() Цикл
	Ключ = КлючиЗаявки[Индекс];
	СтрокаСписка = Строки[Ключ];
	
	НайденнаяСтрока = ТЗ.Найти(Ключ.ЗаявкаГУИД, "ГУИД");
	Если НайденнаяСтрока <> Неопределено Тогда 
		СтрокаСписка.Данные["Заявка"] = НайденнаяСтрока.Заявка;
	КонецЕсли; 
	
	Индекс = Индекс + 1;
КонецЦикла;
КонецПроцедуры

