
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = Истина;
	
Параметры.Свойство("ОтКого", КонтрагентыОтбор);
Параметры.Свойство("СуммаКОплате", СуммаКОплате);

Если КонтрагентыОтбор.Количество() = 0 Тогда
	Отказ = Истина; Возврат;
КонецЕсли;

КонтрагентТолькоПросмотр = Неопределено;
Параметры.Свойство("КонтрагентТолькоПросмотр", КонтрагентТолькоПросмотр);
Если КонтрагентТолькоПросмотр = Неопределено Тогда КонтрагентТолькоПросмотр = Истина; КонецЕсли; 
Элементы.Контрагент.ТолькоПросмотр = КонтрагентТолькоПросмотр;	

Если КонтрагентыОтбор.Количество() = 1 Тогда
	Контрагент = КонтрагентыОтбор[0].Значение;
	
	НаименованиеЮрЛица = Контрагент.НаименованиеЮрЛица;
	Элементы.НаименованиеЮрЛица.Видимость = КлиентыСервер.ЭтоЮрЛицо(Контрагент);
	
	КонтрагентНаименование = КлиентыСервер.КлиентПредставление(Контрагент);
КонецЕсли;

Список.Параметры.УстановитьЗначениеПараметра("ОтКого", КонтрагентыОтбор); 
Список.Параметры.УстановитьЗначениеПараметра("Все", Все); 
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
НаименованиеЮрЛица = Контрагент.НаименованиеЮрЛица;
Элементы.НаименованиеЮрЛица.Видимость = КлиентыСервер.ЭтоЮрЛицо(Контрагент);
	
КонтрагентыОтбор.Очистить();
КонтрагентыОтбор.Добавить(Контрагент);

Список.Параметры.УстановитьЗначениеПараметра("ОтКого", КонтрагентыОтбор);
Список.Параметры.УстановитьЗначениеПараметра("Все", Все); 
КонецПроцедуры

&НаКлиенте
Процедура ВсеПриИзменении(Элемент)
Список.Параметры.УстановитьЗначениеПараметра("ОтКого", КонтрагентыОтбор); 
Список.Параметры.УстановитьЗначениеПараметра("Все", Все); 

Элементы.ОтКого.Видимость = Все;
Элементы.НаименованиеЮрЛица.Видимость = Все;

//Элементы.ОтКогоНаименование.Видимость = Все;
КонецПроцедуры



// + Не используется Пока
&НаКлиенте
Процедура КонтрагентНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_КонтрагентНаименованиеНачалоВыбора", ЭтаФорма);

ОткрытьФорму("Справочник.Клиенты.Форма.ФормаВыбора", , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_КонтрагентНаименованиеНачалоВыбора(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

Контрагент = Результат;
КонтрагентНаименование = КлиентыСервер.КлиентПредставление(Результат);

КонтрагентПриИзмененииНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ПараметрыФормы = Новый Структура("Ключ", Контрагент);

ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
// - Не используется Пока
