//Перем ПеретН,ПеретК,ТекКоорд,ТЗШахм,Ошибка,ТекДатаШахматки;
Перем ПеретН, ПеретК, ТекКоорд, Ошибка;  

//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Коворкинг = Константы.Коворкинг.Получить();
Элементы.ПодменюКоворкинг.Видимость = Коворкинг;

Если НЕ НастройкиСервер.ТекущийПользовательКодРавноАдминистратор() Тогда
	Минибар_Нет = Константы.Минибар_Нет.Получить();
	ЕстьПраво = НастройкиСервер.ПользовательЕстьПраво(Перечисления.ПраваПользователя.МинибарРасчет);
	
	Минибар_Видимость = (НЕ Минибар_Нет) И ЕстьПраво; 
	Элементы.ПодменюМинибар.Видимость = Минибар_Видимость;	
	
	ЕстьПраво = НастройкиСервер.ПользовательЕстьПраво(Перечисления.ПраваПользователя.Горничные);
	Элементы.ПодменюГорничные.Видимость = ЕстьПраво;
	
	ОбменСГорничными = Константы.ОбменСГорничными.Получить();
	Если ОбменСГорничными Тогда
		//Если ЕстьПраво Тогда
			//Помещения_Есть = Константы.Помещения_Да.Получить();
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ГорничныеПомещения.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Справочник.ГорничныеПомещения КАК ГорничныеПомещения
			                      |ГДЕ
			                      |	ГорничныеПомещения.ПометкаУдаления = ЛОЖЬ");
			
			Результат = Запрос.Выполнить();
			Помещения_Есть = НЕ Результат.Пустой(); 
			
			Элементы.ОтчетГорничныеПомещения.Видимость = Помещения_Есть;
		//КонецЕсли;
		
		Элементы.ГорничныеПомещенияСправочник.Видимость = Ложь;
	Иначе
		//Элементы.ПодменюГорничные.Видимость = Ложь;
		
		Элементы.ГорничныеПомещенияСправочник.Видимость = Истина;
		
		Элементы.ОтчетПоГорничнымКоманда.Видимость = Ложь;
		
		Элементы.ОтчетПоГорничнымКоманда_Подменю.Видимость = Ложь;
		Элементы.ОтчетГорничныеПомещения.Видимость = Ложь;
		Элементы.ОтчетГорничныеЗакрытиеСмены.Видимость = Ложь;
	КонецЕсли;	
	
	Если НастройкиСервер.ЭтоДомСоветов() 
	ИЛИ НастройкиСервер.ЭтоСтритАрт()
	Тогда
		Элементы.ГорничныеПрачечная.Видимость = Ложь;
	КонецЕсли;
	
	ЕстьПраво = НастройкиСервер.ПользовательЕстьПраво(Перечисления.ПраваПользователя.Администраторы);
	Элементы.ПодменюЗарплатаАдминистраторы.Видимость = ЕстьПраво;
	
	ЭтоАдминистратор = НастройкиСервер.ЭтоАдминистратор();
	Элементы.ПодменюКалендарьЦен.Видимость = ЭтоАдминистратор;
	
	ЕстьПраво = НастройкиСервер.ПользовательЕстьПраво(Перечисления.ПраваПользователя.СписаниеДолгов);
	Элементы.ПодменюЗакрытие.Видимость = ЕстьПраво;
	
	ЕстьПраво = НастройкиСервер.ПользовательЕстьПраво(Перечисления.ПраваПользователя.Бухгалтерия);
	Элементы.Бухгалтерия.Видимость = ЕстьПраво;
	
	//Если НастройкиСервер.ЭтоРеноме()
	//ИЛИ НастройкиСервер.ЭтоДомСоветов()
	//Тогда
	//	Элементы.БезналРаспределениеКоворкинг.Видимость = Ложь;
	//	Элементы.БезналРаспределениеОтель.Видимость = Ложь;
	//	
	//	Элементы.ПодменюКоворкингОперации.Видимость = Ложь;
	//Иначе
	//	Элементы.БезналРаспределение.Видимость = Ложь;
	//	
	//	//Если НЕ НастройкиСервер.ЭтоСтритАрт() Тогда
	//		Элементы.ПодменюКоворкингОперации.Видимость = Ложь;
	//	//Иначе
	//		//ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
	//		//КоворкингОрганизацияЕсть = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущаяОрганизация, "КоворкингОрганизацияЕсть");
	//		//Элементы.ПодменюКоворкингОперации.Видимость = КоворкингОрганизацияЕсть;
	//	//КонецЕсли;
	//КонецЕсли;
	
	Элементы.БезналРаспределениеКоворкинг.Видимость = Ложь;
	Элементы.БезналРаспределениеОтель.Видимость = Ложь;
	Элементы.ПодменюКоворкингОперации.Видимость = Ложь;
	
	Если НастройкиСервер.ЭтоСтритАрт() Тогда
		Разрешено = НастройкиСервер.ЭтоАдмин();
		Если Разрешено Тогда
			Элементы.ЧекПроизвольный.Видимость = Истина;
		Иначе	
			Элементы.ЧекПроизвольный.Видимость = Ложь;
		КонецЕсли;
	Иначе	
		Элементы.ЧекПроизвольный.Видимость = Ложь;
	КонецЕсли;
	
	Если НастройкиСервер.ЭтоРеноме() 	
	ИЛИ НастройкиСервер.ЭтоЧехов() 
	ИЛИ НастройкиСервер.ЭтоСтритАрт() 
	Тогда
		Элементы.СайтЗаявки.Видимость = Истина;
	Иначе
		Элементы.СайтЗаявки.Видимость = Ложь;
	КонецЕсли;
	
	Если НастройкиСервер.ЭтоЛайв() Тогда
		Элементы.ОтчетТрэвелЛайн.Видимость = Истина;
	Иначе
		Элементы.ОтчетТрэвелЛайн.Видимость = Ложь;
	КонецЕсли;
	
	Если НастройкиСервер.ЭтоРеноме() Тогда
		Элементы.ЕжедневныйОтчетФактСводный.Видимость = Истина;
	Иначе
		Элементы.ЕжедневныйОтчетФактСводный.Видимость = Ложь;
	КонецЕсли;	
	
	//Если НЕ НастройкиСервер.ЭтоСтритАрт() Тогда
	//	Элементы.ЗаполнитьДанныеОрганизацияСДанныхКоворкинг.Видимость = Ложь;		
	//КонецЕсли;
	
КонецЕсли;
КонецПроцедуры
//


//// + Переговорная
&НаСервере
Функция ВывестиШахматкуЧасы(ДатаС, ДатаПо)

ТЗШахматкаЧасы.Очистить();

//ДатаС=?(Детализация="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
ДатаС = НачалоЧаса(ДатаС);
ДатаПо = НачалоЧаса(ДатаПо);

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	ЗанятостьНомеровКоворкинг.Регистратор КАК Регистратор,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингЗаявка.КоворкингНомер КАК КоворкингНомер,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингЗаявка.Клиент КАК Клиент,
                    |	ЗанятостьНомеровКоворкинг.ПериодРезерва КАК ПериодРезерва,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.Сумма КАК СуммаСчета,
                    |	Оплаты.СуммаРаспределено КАК СуммаРаспределено
                    |ИЗ
                    |	РегистрСведений.ЗанятостьНомеровКоворкинг КАК ЗанятостьНомеровКоворкинг
                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                    |			КоворкингСчетаДокументыОплаты.Ссылка КАК СчетСсылка,
                    |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                    |		ИЗ
                    |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                    |		
                    |		СГРУППИРОВАТЬ ПО
                    |			КоворкингСчетаДокументыОплаты.Ссылка) КАК Оплаты
                    |		ПО ЗанятостьНомеровКоворкинг.Регистратор.Ссылка = Оплаты.СчетСсылка
                    |ГДЕ
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ПочасоваяОплата = ИСТИНА
                    |	И ТИПЗНАЧЕНИЯ(ЗанятостьНомеровКоворкинг.Регистратор) = ТИП(Документ.КоворкингСчета)
                    |	И ЗанятостьНомеровКоворкинг.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо");

Запрос.УстановитьПараметр("ДатаС",ДатаС);						
Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
ТЗЗапроса = Запрос.Выполнить().Выгрузить(); 

ТЗЗапроса.Колонки.Добавить("Статус");
Для Каждого Строка Из ТЗЗапроса Цикл
	//Если Строка.СуммаСчета = Null Тогда
	//	Строка.Статус = "НЕТ СЧЕТОВ";
	//Иначе
		Если Строка.СуммаРаспределено = Null Тогда
			Строка.Статус = "НЕТ ОПЛАТ";
		ИначеЕсли Строка.СуммаРаспределено = 0 Тогда
			Строка.Статус = "НЕТ ОПЛАТ";
		ИначеЕсли Строка.СуммаРаспределено < Строка.СуммаСчета Тогда
			Строка.Статус = "ЧАСТИЧНО ОПЛАЧЕНО";
		Иначе
			Строка.Статус = "ОПЛАЧЕНО";
	    КонецЕсли;
	//КонецЕсли;
КонецЦикла;

ТЗКлиентов = ТЗЗапроса.Скопировать();
ТЗКлиентов.Свернуть("Клиент, Регистратор, Статус") ;
ТЗКлиентов.Колонки.Добавить("Цвет");

Сч=0;

//Если ТипЗнч(ТекРегистратор) = Тип("ДокументСсылка.КоворкингЗаявка") Тогда
//	Цвет_П = Новый Цвет(210, 245, 220); 
//	ШрифтПолужирный_П = Ложь;
//ИначеЕсли СтрокаСчета.РегистраторСуммаРаспределено = 0 Тогда
//	Цвет_П = Новый Цвет(220, 220, 220); 
//	ШрифтПолужирный_П = Истина;
//ИначеЕсли СтрокаСчета.РегистраторСумма > СтрокаСчета.РегистраторСуммаРаспределено Тогда
//	Цвет_П = Новый Цвет(200, 240, 240); 
//	ШрифтПолужирный_П = Истина;
//Иначе
//	Цвет_П = WebЦвета.Белый;  				
//	ШрифтПолужирный_П = Истина;
//КонецЕсли;

Для каждого Клиент Из ТЗКлиентов Цикл	
	Если Клиент.Статус = "ОПЛАЧЕНО" тогда
		Клиент.Цвет=Новый Цвет(255,255,255);
	иначеесли Клиент.Статус = "ЧАСТИЧНО ОПЛАЧЕНО" тогда
		Клиент.Цвет=Новый Цвет(200, 240, 240);
	иначеесли Клиент.Статус = "НЕТ ОПЛАТ" тогда
		Клиент.Цвет=Новый Цвет(220, 220, 220);   
	иначе
		Если Клиент.Клиент.ЦветR<>0 Или  Клиент.Клиент.ЦветG<>0 или  Клиент.Клиент.ЦветB<>0 тогда	
			Клиент.Цвет=Новый Цвет(Клиент.Клиент.ЦветR,Клиент.Клиент.ЦветG,Клиент.Клиент.ЦветB);
		иначе
			Клиент.Цвет = СлучайныйЦвет(ТЗКлиентов);
		КонецЕсли;
	конецесли;
КонецЦикла; 

ПолеШахматкиЧасы.Очистить();

ИмяОбработки = ОбщийФункционалКлиентСервер.ИмяОбработки(ЭтаФорма);
//Макет = Обработки.КоворкингШахматка.ПолучитьМакет("МакетШахматкаДни");
Макет = Обработки[ИмяОбработки].ПолучитьМакет("МакетШахматкаДни");

НачальныйЧас = Константы.КоворкингНачальныйЧас.Получить();
Если НачальныйЧас = 0 Тогда НачальныйЧас = 8; КонецЕсли;

КонечныйЧас = Константы.КоворкингКонечныйЧас.Получить() - 1;
Если КонечныйЧас = 0 Тогда КонечныйЧас = 21; КонецЕсли;
КонечныйЧас = КонечныйЧас - 1;

ТемпС = ДатаС;
ТемпПо = ДатаПо;

ТабДок=Новый ТабличныйДокумент;
Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
ТабДок.Присоединить(Обл);

ТЗОбъеденения=Новый ТаблицаЗначений();
ТЗОбъеденения.Колонки.Добавить("КолонкаС");
ТЗОбъеденения.Колонки.Добавить("КолонкаПо");
ТЗОбъеденения.Колонки.Добавить("ДТ");

Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");

Нов=ТЗОбъеденения.Добавить();
Нов.КолонкаС=2;
Нов.КолонкаПо=2;

ТемпДень=НачалоДня(ТемпС);
Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");

ТекКол=2;

Пока ТемпС<=ТемпПо цикл
	Час = Час(ТемпС);
	Если Час >= НачальныйЧас И Час <= КонечныйЧас Тогда 
		Если НачалоДня(ТемпС)>ТемпДень тогда
			// новый день
			Нов.КолонкаПо=ТекКол-1;
			Нов=ТЗОбъеденения.Добавить();
			Нов.КолонкаС=ТекКол;
			Нов.КолонкаПо=ТекКол+1;
			ТемпДень=НачалоДня(ТемпС);
			Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");	
		конецесли;
	
		//Обл.Параметры.Период = Формат(ТемпС, "ДФ='HH:mm'");
		Обл.Параметры.Период = Формат(ТемпС, "ДФ='HH'");
		ТабДок.Присоединить(Обл);
	
		ТекКол=ТекКол+1;
	КонецЕсли; 	
	
	//ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
	ТемпС = ТемпС + 3600;
КонецЦикла;

Нов.КолонкаПо=ТекКол-1;
Для каждого Об Из ТЗОбъеденения Цикл
	ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаС+1).Текст=Об.ДТ;
	
	ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаПо+1).Объединить();
КонецЦикла; 

ПолеШахматкиЧасы.Вывести(ТабДок);
////// + Вывод Верхних строк с датами

//Возврат Неопределено;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК Ссылка,
                      |	КоворкингНомера.Наименование КАК Наименование,
                      |	КоворкингНомера.ОписаниеНомера КАК ОписаниеНомера,
                      |	КоворкингНомера.ЦветНомераB КАК ЦветНомераB,
                      |	КоворкингНомера.ЦветНомераG КАК ЦветНомераG,
                      |	КоворкингНомера.ЦветНомераR КАК ЦветНомераR
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингНомера.ПочасоваяОплата = ИСТИНА");
СпрНомеров = Запрос.Выполнить().Выбрать();

Х=0;
У=0;

Пока СпрНомеров.Следующий() цикл
	//Если СпрНомеров.ПометкаУдаления Тогда Продолжить; КонецЕсли;
	
	У=У+1;
	
	ТабДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
	Обл.Параметры.Номер=СпрНомеров.Наименование;
	Если Не СпрНомеров.ЦветНомераB+СпрНомеров.ЦветНомераG+СпрНомеров.ЦветНомераR=0 тогда
		Обл.Область(1,2,1,2).ЦветФона=Новый Цвет(СпрНомеров.ЦветНомераR,СпрНомеров.ЦветНомераG,СпрНомеров.ЦветНомераB);
		Обл.Область(1,2,1,2).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,2,1,2).ЦветФона);
	конецесли;
	
    Обл.Область(1,1,1,1).Расшифровка=СпрНомеров.ОписаниеНомера;
	ТабДок.Присоединить(Обл);
	
	ТемпКл=Справочники.Клиенты.ПустаяСсылка();
	
	ТемпРегистратор=Документы.КоворкингСчета.ПустаяСсылка();
	
	СписОб=Новый СписокЗначений;                            
	Сч=2;
	НачИ=3;	
	Х=0;
	
	ТемпС=ДатаС;
	ТемпПо=ДатаПо;
	
	Пока ТемпС<=ТемпПо цикл
		//Х=Х+1;	
		
		ПС = НачалоЧаса(ТемпС);
		ПК = КонецЧаса(ТемпС);
		
		Час = Час(ПС); 
		Если Час >= НачальныйЧас И Час <= КонечныйЧас Тогда 
		
			Х=Х+1;	
			
			Отбор=Новый Структура("ПериодРезерва, КоворкингНомер", ПС, СпрНомеров.Ссылка);
			СтрокиНом=ТЗЗапроса.НайтиСтроки(Отбор);
			Обл=Макет.ПолучитьОбласть("Строка|СтрПериод");

			Если СтрокиНом.Количество() <> 0 тогда
				ТекКл = СтрокиНом[0].Клиент;
				ТекРегистратор = СтрокиНом[0].Регистратор;
				
				//ТекСтатус = СтрокиНом[0].Статус;
				
				ОтборСтроки = Новый Структура("Клиент, Регистратор", ТекКл, ТекРегистратор); 
				НайденныеСтроки = ТЗКлиентов.НайтиСтроки(ОтборСтроки);
				КлСтат = НайденныеСтроки[0];
				Цв = КлСтат.Цвет;
				
				Обл.Область(1,1,1,1).ЦветФона=Цв;
				Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
					
				ШрифтПолужирный_П = (КлСтат.Статус <> "НЕТ СЧЕТОВ");  
				ШрифтТекста = Новый Шрифт(Обл.Область(1,1,1,1).Шрифт,,,ШрифтПолужирный_П);
				Обл.Область(1,1,1,1).Шрифт = ШрифтТекста;
			
				Обл.Параметры.Период=ТекКл.Наименование;
				
				НовШ=ТЗШахматкаЧасы.Добавить();
				НовШ.Х=Х;
				НовШ.У=У;
				НовШ.Клиент=ТекКл;
				НовШ.Номер=СпрНомеров.Ссылка;
				
				НовШ.Регистратор = ТекРегистратор;
				НовШ.Счет = НовШ.Регистратор;
				
				НовШ.Период = НачалоЧаса(ТемпС);
			иначе
				ТекКл=Справочники.Клиенты.ПустаяСсылка();			
			конецесли;
			
			Если ТекКл<>ТемпКл 
			ИЛИ ТекРегистратор <> ТемпРегистратор 
			//ИЛИ ТекСчет <> ТемпСчет 
			тогда
				
				НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
				СписОб.Добавить(НовОб);
				
				ТемпКл=ТекКл;
				ТемпРегистратор = ТекРегистратор;
				//ТемпСчет = ТекСчет;
				
				НачИ=Сч+1;
			конецесли;
			
			ТабДок.Присоединить(Обл);
		
			сч=сч+1;
		КонецЕсли;
			
		ТемпС=ТемпС + 3600;
	КонецЦикла;
	
	НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
	СписОб.Добавить(НовОб);
	
	Первый=Истина;
	Для каждого Об Из СписОб Цикл
		если Первый Тогда Первый=Ложь; Продолжить; конецесли;
		
		Если Об.Значение.ТекКл=Справочники.Клиенты.ПустаяСсылка() тогда	Продолжить; конецесли; 
		
		ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
	КонецЦикла; 
	
	ПолеШахматкиЧасы.Вывести(ТабДок);
КонецЦикла;

КоличествоДней = (НачалоДня(ДатаПо) - НачалоДня(ДатаС)) / (60 * 60 * 24);

КоличествоКолонокЧасов = (КоличествоДней + 1) * (КонечныйЧас - НачальныйЧас + 1);

Час = Час(ДатаС);
Если Час > НачальныйЧас Тогда
	КоличествоКолонокЧасов = КоличествоКолонокЧасов - (Час - НачальныйЧас);
КонецЕсли;

Час = Час(ДатаПо);
Если Час < КонечныйЧас Тогда
	КоличествоКолонокЧасов = КоличествоКолонокЧасов - (КонечныйЧас - Час);
КонецЕсли;
	
ШиринаТаблицы = 150;
ШиринаКолонки = ШиринаТаблицы / КоличествоКолонокЧасов;

Если ШиринаКолонки < 2.5 Тогда
	 ШиринаКолонки = 2.5;
КонецЕсли;

//ПолеШахматкиЧасы.Область(,3,,КоличествоКолонокЧасов + 2).ЦветФона = Новый Цвет(100, 100, 100);

ПолеШахматкиЧасы.Область(,3,,КоличествоКолонокЧасов + 2).ШиринаКолонки = ШиринаКолонки;	

ПолеШахматкиЧасы.Область(,3,,КоличествоКолонокЧасов + 2).РастягиватьПоГоризонтали = Истина;

ПолеШахматкиЧасы.ФиксацияСлева=2;
ПолеШахматкиЧасы.ФиксацияСверху=2;

ПолеШахматкиЧасы.Область(1, , 1).Видимость = Ложь;
//ПолеШахматкиЧасы.УстановитьРастягиваниеПоГоризонтали(Истина);
КонецФункции

&НаКлиенте
Процедура ОбновитьШахматкуЧасы()
ВывестиШахматкуЧасы(НачалоДня(ЧасыДата) - 2 * 24 * 60 * 60, НачалоДня(ЧасыДата) +  2 * 24 * 60 *60);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингОбновить(Команда)
ОбновитьШахматкуЧасы();
КонецПроцедуры

//
&НаКлиенте
Процедура ЧасыТекущаяДата(Команда)
ЧасыДата = НачалоДня(ТекущаяДата());

ОбновитьШахматкуЧасы();
КонецПроцедуры

&НаКлиенте
Процедура ЧасыДниВперед(Команда)
ЧасыДата = ЧасыДата + 3 * 24 * 60 *60;

ОбновитьШахматкуЧасы();
КонецПроцедуры

&НаКлиенте
Процедура ЧасыДниНазад(Команда)
ЧасыДата = ЧасыДата - 3 * 24 * 60 *60;

ОбновитьШахматкуЧасы();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЧасыВстатьНаДату(Команда)
Дата = ТекущаяДата(); 
Обещание = ВвестиДатуАсинх(Дата, "Дата", ЧастиДаты.Дата);
Результат = Ждать Обещание;

Если НЕ ЗначениеЗаполнено(Результат) тогда Возврат; КонецЕсли;
	
ЧасыДата = НачалоДня(Результат);

ОбновитьШахматкуЧасы();
КонецПроцедуры
//

&НаКлиенте
Процедура КоворкингДокументыКоманда(Команда)
ПараметрыФормы = Новый Структура("ТолькоПочасоваяОплата", Истина);	
	
ОткрытьФорму("Обработка.КоворкингЗаявкаОбработка.Форма.Форма", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингСчетаКоманда(Команда)
ПараметрыФормы = Новый Структура("ТолькоПочасоваяОплата", Истина);	
	
ОткрытьФорму("Документ.КоворкингСчета.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингЗаявкиКоманда(Команда)
ПараметрыФормы = Новый Структура("ТолькоПочасоваяОплата", Истина);	
	
ОткрытьФорму("Документ.КоворкингЗаявка.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

//// - Переговорная


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
Если ИмяСобытия = "ИзменениеЗаявкиНаБронирование" Тогда
	ВыводШахматки();
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПриАктивизации(Элемент)
ДанныеВыбора = ПолеОтчета.ТекущаяОбласть.Имя;

МассивЧисел = НайтиЧислаВСтроке(ДанныеВыбора);

Если МассивЧисел.Количество() = 2 Тогда
	МассивЧисел.Добавить(МассивЧисел[0]);	
	
	МассивЧисел.Добавить(МассивЧисел[1]);	
КонецЕсли;	

Если МассивЧисел[0] <> МассивЧисел[2] Тогда
		
	Возврат;	
КонецЕсли;	

НомерСтроки = МассивЧисел[0]; 
НачалоНомерСтолбца = МассивЧисел[1];
КонецНомерСтолбца = МассивЧисел[3];

ОграничениеНомераСтроки = (НомерСтроки >= ВысотаПолеОтчетаМинимум) И  (НомерСтроки < ВысотаПоляОтчетаМаксимум);
ОграничениеНомераСтолбца = (НачалоНомерСтолбца > ШиринаПолеОтчетаМинимум) И  (КонецНомерСтолбца <= ШиринаПоляОтчетаМаксимум);

Элементы.ПолеОтчетаКонтекстноеМенюПолеОтчетаКонтекст.Видимость = ОграничениеНомераСтроки И ОграничениеНомераСтолбца;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаКонтекст(Команда)
//Сообщить(ПолеОтчета.ТекущаяОбласть.Имя);

ДанныеВыбора = ПолеОтчета.ТекущаяОбласть.Имя;

МассивЧисел = НайтиЧислаВСтроке(ДанныеВыбора);

Если МассивЧисел.Количество() = 2 Тогда
	МассивЧисел.Добавить(МассивЧисел[0]);	
	
	МассивЧисел.Добавить(МассивЧисел[1]);	
КонецЕсли;	

Если МассивЧисел[0] <> МассивЧисел[2] Тогда
		
	Возврат;	
КонецЕсли;	

НомерСтроки = МассивЧисел[0]; 
НачалоНомерСтолбца = МассивЧисел[1];
КонецНомерСтолбца = МассивЧисел[3];

Результат = ПолеОтчетаКонтекстНаСервере(НомерСтроки, НачалоНомерСтолбца, КонецНомерСтолбца);

Если Результат = Неопределено Тогда 
	Возврат; 
ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда 
	ПоказатьПредупреждение(, Результат);
	
	Возврат;
КонецЕсли;

Форма = ПолучитьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента");
Форма.Объект.РезервС = Результат.РезервС;
Форма.Объект.РезервПо = Результат.РезервПо;
Форма.Объект.ВремяЗаезда = Результат.ВремяЗаезда;
Форма.Объект.ВремяВыезда = Результат.ВремяВыезда;
Форма.Объект.НомерВРезерв = Результат.НомерВРезерв;

КатегорияНомера = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Результат.НомерВРезерв, "КатегорияНомера");
Форма.Объект.КатегорияНомера = КатегорияНомера;

ОткрытьФорму(Форма);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКонтекстноеМеню(Команда)
Сообщить(ПолеОтчета.ТекущаяОбласть.Имя);

ДанныеВыбора = ПолеОтчета.ТекущаяОбласть.Имя;

МассивЧисел = НайтиЧислаВСтроке(ДанныеВыбора);

Если МассивЧисел.Количество() = 2 Тогда
	МассивЧисел.Добавить(МассивЧисел[0]);	
	
	МассивЧисел.Добавить(МассивЧисел[2]);	
КонецЕсли;	

Если МассивЧисел[0] <> МассивЧисел[2] Тогда
		
	Возврат;	
КонецЕсли;	

НомерСтроки = МассивЧисел[0]; 
НачалоНомерСтолбца = МассивЧисел[1];
КонецНомерСтолбца = МассивЧисел[3];

КонецПроцедуры

&НаКлиенте
Функция НайтиЧислаВСтроке(Строка) 

МассивЧисел = Новый Массив; // сюда поместим все найденные числа. В данном примере в массив должно попасть 3 числа: 234224, 555 и 1

СтрокаЧисел = "";
Для Индекс = 1 По СтрДлина(Строка) Цикл
	Символ = Сред(Строка, Индекс, 1); // Перебираем все сиволы из нашей строки

	Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
		СтрокаЧисел = СтрокаЧисел + Символ;
	ИначеЕсли СтрДлина(СтрокаЧисел) > 0 Тогда
		МассивЧисел.Добавить(Число(СтрокаЧисел));
	  	СтрокаЧисел = "";
	КонецЕсли;
КонецЦикла;

Если СтрДлина(СтрокаЧисел) > 0 Тогда
	МассивЧисел.Добавить(Число(СтрокаЧисел));
КонецЕсли;

Возврат МассивЧисел;

КонецФункции

&НаСервере
Функция ПолеОтчетаКонтекстНаСервере(НомерСтроки, НачалоНомерСтолбца, КонецНомерСтолбца)
// + НомерВРезерв	
НомерИмяЯчейки = "R" + Строка(НомерСтроки) + "C1";
НомерИмяЯчейки = НомерИмяЯчейки + ":" + НомерИмяЯчейки;
ОбластьНомера = ПолеОтчета.ПолучитьОбласть(НомерИмяЯчейки);
	
Если ТипЗнч(ОбластьНомера.ТекущаяОбласть.Расшифровка) = Тип("СправочникСсылка.НомернойФонд") Тогда	
	НомерВРезерв = ОбластьНомера.ТекущаяОбласть.Расшифровка;
Иначе
	Возврат Неопределено;
КонецЕсли;
// - НомерВРезерв	

// + Начало	
НомерИмяЯчейки = "R3"  + "C" + Строка(НачалоНомерСтолбца);
НомерИмяЯчейки = НомерИмяЯчейки + ":" + НомерИмяЯчейки;
ОбластьВремя = ПолеОтчета.ПолучитьОбласть(НомерИмяЯчейки);
Если ОбластьВремя.ТекущаяОбласть.Текст = "00:00" Тогда 
	ВремяЗаезда = Перечисления.ВремяЗаезда.Вр0;
	
	НачалоНомерСтолбцаДата = НачалоНомерСтолбца;	
ИначеЕсли ОбластьВремя.ТекущаяОбласть.Текст = "06:00" Тогда 
	ВремяЗаезда = Перечисления.ВремяЗаезда.Вр6;
	
	НачалоНомерСтолбцаДата = НачалоНомерСтолбца - 1;	
ИначеЕсли ОбластьВремя.ТекущаяОбласть.Текст = "14:00" Тогда 
	ВремяЗаезда = Перечисления.ВремяЗаезда.Вр14;
	
	НачалоНомерСтолбцаДата = НачалоНомерСтолбца - 2;	
ИначеЕсли ОбластьВремя.ТекущаяОбласть.Текст = "18:00" Тогда 
	ВремяЗаезда = Перечисления.ВремяЗаезда.Вр18;
	
	НачалоНомерСтолбцаДата = НачалоНомерСтолбца - 3;	
Иначе
	Возврат Неопределено;
КонецЕсли;	

НомерИмяЯчейки = "R2"  + "C" + Строка(НачалоНомерСтолбцаДата);
//НомерИмяЯчейки = НомерИмяЯчейки + ":" + НомерИмяЯчейки;
НомерИмяЯчейки = НомерИмяЯчейки + ":" + "R2"  + "C" + Строка(НачалоНомерСтолбцаДата + 3);;
ОбластьНомера = ПолеОтчета.ПолучитьОбласть(НомерИмяЯчейки);

//Год = Год(ТекущаяДата());
Год = Год(ТекДатаШахматки);

Текст = ОбластьНомера.ТекущаяОбласть.Текст;
Индекс = СтрНайти(Текст, ".");

День = Число(Лев(Текст, Индекс - 1)); 
Месяц = Число(Сред(Текст, Индекс + 1)); 

РезервС = Дата(Год, Месяц, День); 
// - Начало	

// + Конец	
НомерИмяЯчейки = "R3"  + "C" + Строка(КонецНомерСтолбца);
НомерИмяЯчейки = НомерИмяЯчейки + ":" + НомерИмяЯчейки;
ОбластьВремя = ПолеОтчета.ПолучитьОбласть(НомерИмяЯчейки);
//Если ОбластьВремя.ТекущаяОбласть.Текст = "00:00" Тогда 
//	ВремяВыезда = Перечисления.ВремяВыезда.Вр0;
//	
//	НачалоНомерСтолбцаДата = КонецНомерСтолбца;	
//ИначеЕсли ОбластьВремя.ТекущаяОбласть.Текст = "06:00" Тогда 
//	ВремяВыезда = Перечисления.ВремяВыезда.Вр6;
//	
//	НачалоНомерСтолбцаДата = КонецНомерСтолбца - 1;	
//ИначеЕсли ОбластьВремя.ТекущаяОбласть.Текст = "14:00" Тогда 
//	ВремяВыезда = Перечисления.ВремяВыезда.Вр12;
//	
//	НачалоНомерСтолбцаДата = КонецНомерСтолбца - 2;	
//ИначеЕсли ОбластьВремя.ТекущаяОбласть.Текст = "18:00" Тогда 
//	ВремяВыезда = Перечисления.ВремяВыезда.Вр18;
//	
//	НачалоНомерСтолбцаДата = КонецНомерСтолбца - 3;	
//Иначе
//	Возврат Неопределено;
//КонецЕсли;	

Если ОбластьВремя.ТекущаяОбласть.Текст = "00:00" Тогда 
	ВремяВыезда = Перечисления.ВремяВыезда.Вр6;
	
	НачалоНомерСтолбцаДата = КонецНомерСтолбца;	
ИначеЕсли ОбластьВремя.ТекущаяОбласть.Текст = "06:00" Тогда 
	ВремяВыезда = Перечисления.ВремяВыезда.Вр12;
	
	НачалоНомерСтолбцаДата = КонецНомерСтолбца - 1;	
ИначеЕсли ОбластьВремя.ТекущаяОбласть.Текст = "14:00" Тогда 
	ВремяВыезда = Перечисления.ВремяВыезда.Вр18;
	
	НачалоНомерСтолбцаДата = КонецНомерСтолбца - 2;	
ИначеЕсли ОбластьВремя.ТекущаяОбласть.Текст = "18:00" Тогда 
	ВремяВыезда = Перечисления.ВремяВыезда.Вр0;
	
	НачалоНомерСтолбцаДата = КонецНомерСтолбца - 3;	
Иначе
	Возврат Неопределено;
КонецЕсли;	

НомерИмяЯчейки = "R2"  + "C" + Строка(НачалоНомерСтолбцаДата);
//НомерИмяЯчейки = НомерИмяЯчейки + ":" + НомерИмяЯчейки;
НомерИмяЯчейки = НомерИмяЯчейки + ":" + "R2"  + "C" + Строка(НачалоНомерСтолбцаДата + 3);;
ОбластьДата = ПолеОтчета.ПолучитьОбласть(НомерИмяЯчейки);

//Год = Год(ТекущаяДата());
Год = Год(ТекДатаШахматки);

Текст = ОбластьДата.ТекущаяОбласть.Текст;
Индекс = СтрНайти(Текст, ".");

День = Число(Лев(Текст, Индекс - 1));

Месяц = Число(Сред(Текст, Индекс + 1)); 

РезервПо = Дата(Год, Месяц, День); 
//Если ВремяВыезда = Перечисления.ВремяВыезда.Вр0 Тогда
//	РезервПо = РезервПо + 60*60*24;
//КонецЕсли;
// - Конец

Ответ = ДокументыСервер.ЗанятостьНомераПроверить(РезервС, РезервПо, ВремяЗаезда, ВремяВыезда
	, НомерВРезерв, Ложь, Неопределено);
Если Ответ.Результат Тогда 
	Текст = "Номер занят. " + Ответ.Регистратор;
	
	Возврат Текст;
КонецЕсли;	

Результат = Новый Структура("РезервС, РезервПо, ВремяЗаезда, ВремяВыезда, НомерВРезерв"
	, РезервС, РезервПо, ВремяЗаезда, ВремяВыезда, НомерВРезерв); 
	
Возврат Результат;	
КонецФункции


//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
Если ЗавершениеРаботы Тогда Возврат; КонецЕсли;

ТекПол = ОбщийФункционалСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
ТекПолАдмин = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(ТекПол,"Админ"); 
//Если НЕ ТекПол.Админ тогда
Если  НЕ ТекПолАдмин тогда
	ЗавершитьРаботуСистемы();
конецесли;

Оповещение = Новый ОписаниеОповещения("ЗавершениеРаботыСистемы", ЭтаФорма);
ПоказатьВопрос(Оповещение, "Завершить работу системы ?", РежимДиалогаВопрос.ДаНет);

Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРаботыСистемы(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Нет Тогда Возврат; КонецЕсли;   

ЗавершитьРаботуСистемы();
КонецПроцедуры


//
&НаКлиенте
Процедура ПриОткрытии(Отказ)

УстановитьНачальныеЗначения();

//ТекПолАдмин = НастройкиСервер.ЭтоАдмин();
//Элементы.БанковскиеВыписки.Доступность = ТекПолАдмин;

ПоказатьОповещенияПриОткрытии();

ВывестиШахматку(НачалоНедели(ТекущаяДата()),КонецНедели(ТекущаяДата()),"Час");

//
Если НастройкиСервер.ЭтоРеноме() Тогда
	ШахматкаЧасы = Истина;
Иначе
	ШахматкаЧасы = Ложь;
КонецЕсли;	

Если ШахматкаЧасы Тогда
	Элементы.ГруппаШахматкаЧасы.Видимость = Истина;
	
	ЧасыДата = НачалоДня(ТекущаяДата());

	ОбновитьШахматкуЧасы();
Иначе
	Элементы.ГруппаШахматкаЧасы.Видимость = Ложь;
КонецЕсли;	

//

ТекДатаШахматки=ТекущаяДата();
ПересеченияНомеров(НачалоНедели(ТекДатаШахматки),КонецНедели(ТекДатаШахматки));	

ЛистОжиданияКнопкаКоличество();
ЖурналЛистОжиданияКомандаКоличество();

ПодключитьОбработчикОжидания("ВыводШахматки", 120);

ПодключитьОбработчикОжидания("ПредупреждениеЛистОжидания", 30*60*10);

ПоказатьДниРождения(Истина);

//
ПредупреждениеАсинх_ПриОткрытии();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНачальныеЗначения()
ТекКоорд=Новый Структура("Х,У",0,0);
ПеретН=Новый Структура("Х,У",0,0);
ПеретК=Новый Структура("Х,У",0,0);

Ошибка = Истина;
Конецпроцедуры	

&НаКлиенте
Асинх Процедура ПредупреждениеАсинх_ПриОткрытии()
	
Если ИмяПользователя() <> "Администратор" тогда
	КаталогИБ = ОбщееСервер.КаталогИБ();
	Если СтрНайти(КаталогИБ, "Выгрузка") > 0 Тогда
		Обещание = ПредупреждениеАсинх( "ДОСТУП К БАЗЕ ЗАПРЕЩЕН !!!
		|
		|Это служебная база.
		|
		|Для доступа к данным базы скопируйте базу в папку с именем НЕ содержащим 'Выгрузка'", 30); 
		
		Результат = Ждать Обещание; 
		
		ЭтаФорма.Закрыть();	

		Возврат;
	КонецЕсли;
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеЛистОжидания()
Количество = ЛистОжиданияКоличество();
Если Количество = 0 Тогда Возврат; КонецЕсли;

ПоказатьПредупреждение(, "ВНИМАНИЕ !!! 
						|
						|Есть Заявки в Листе ожидания", 60*2);
Конецпроцедуры	
//

// + Обработчик Ожидания 
&НаКлиенте
Функция ВыводШахматки()
ПересеченияНомеров(НачалоНедели(ТекДатаШахматки),КонецНедели(ТекДатаШахматки));	

ЛистОжиданияКнопкаКоличество();
ЖурналЛистОжиданияКомандаКоличество();

ПоказатьОповещенияВыводШахматки();

ВывестиШахматку(НачалоНедели(ТекДатаШахматки),КонецНедели(ТекДатаШахматки),"Час");	

//Если Не ТекПол.Админ тогда
//	ЗапросЗамечаний=Новый Запрос("ВЫБРАТЬ
//	                             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Замечания.Ссылка) КАК Ссылка
//	                             |ИЗ
//	                             |	Документ.Замечания КАК Замечания
//	                             |ГДЕ
//	                             |	Замечания.Кому = &Кому
//	                             |	И Замечания.ОтветАдминистратора = &ОтветАдминистратора");	
//								 ЗапросЗамечаний.УстановитьПараметр("Кому",ТекПол);
//								 ЗапросЗамечаний.УстановитьПараметр("ОтветАдминистратора","");
//	ТЗ=ЗапросЗамечаний.Выполнить().Выгрузить();
//	Если ТЗ.Количество()<>0 тогда
//		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Замечания.Текст="Замечания (" + Строка(ТЗ[0].Ссылка)+")";
//	ИНаче
//		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Замечания.Доступность=Ложь;
//	конецесли;
//	
//конецесли;

УстановитьЗаголовкиКнопкиЗамечания();

//
Если ШахматкаЧасы Тогда
	ОбновитьШахматкуЧасы();
КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПоказатьОповещенияВыводШахматки()
СообщениеКомуСсылка = ПолучитьОповещенияНаСервере();
Если СообщениеКомуСсылка <> Неопределено Тогда
	Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыОповещениеПриОткрытии", ЭтаФорма);
	Парам = Новый Структура("ТекСообщение", СообщениеКомуСсылка);
	ОткрытьФорму("Обработка.Интерфейс.Форма.Оповещение", Парам, ЭтаФорма
		,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
Конецесли;
КонецПроцедуры	

&НаСервере
Процедура УстановитьЗаголовкиКнопкиЗамечания()
ТекПол = ПараметрыСеанса.ТекущийПользователь;

Если Не ТекПол.Админ тогда
	ЗапросЗамечаний=Новый Запрос("ВЫБРАТЬ
	                             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Замечания.Ссылка) КАК Ссылка
	                             |ИЗ
	                             |	Документ.Замечания КАК Замечания
	                             |ГДЕ
	                             |	Замечания.Кому = &Кому
	                             |	И Замечания.ОтветАдминистратора = &ОтветАдминистратора");	
								 ЗапросЗамечаний.УстановитьПараметр("Кому",ТекПол);
								 ЗапросЗамечаний.УстановитьПараметр("ОтветАдминистратора","");
	ТЗ=ЗапросЗамечаний.Выполнить().Выгрузить();
	Если ТЗ.Количество()<>0 тогда
		//ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Замечания.Текст="Замечания (" + Строка(ТЗ[0].Ссылка)+")";
		Элементы.ЗамечанияКоманда.Заголовок = "Замечания (" + Строка(ТЗ[0].Ссылка)+")";
	ИНаче
		//ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Замечания.Доступность=Ложь;
		Элементы.ЗамечанияКоманда.Доступность=Ложь;
	конецесли;
конецесли;
КонецПроцедуры
// - Обработчик Ожидания 


//
&НаСервере
Функция ПоказатьОповещения___()
	 ////ТекПол
	 //
	 //ТекПол = ПараметрыСеанса.ТекущийПользователь;
	 //ЗапросОповещений=Новый Запрос("ВЫБРАТЬ
	 //                              |	СообщениеКому.Ссылка
	 //                              |ИЗ
	 //                              |	Документ.Сообщение.Кому КАК СообщениеКому
	 //                              |ГДЕ
	 //                              |	СообщениеКому.ВремяСледующегоПоказа < &ТекВремя
	 //                              |	И СообщениеКому.Пользователь = &Пользователь
	 //                              |	И СообщениеКому.Ссылка.Актуально = ИСТИНА");
	 //   						   
	 //   ЗапросОповещений.УстановитьПараметр("ТекВремя",ТекущаяДата());
	 //   ЗапросОповещений.УстановитьПараметр("Пользователь",ТекПол);
	 //   ТЗ=ЗапросОповещений.Выполнить().Выгрузить();
	 //   
	 //   
	 //   Если ТЗ.Количество()>0 тогда
	 //   	ТекСооб=ТЗ[0].Ссылка;
	 //   	ФормаС=ПолучитьФорму("Оповещение");
	 //   	ФормаС.ТекСообщение=ТекСооб;
	 //   	ФормаС.ЭлементыФормы.Надпись1.Заголовок=ТекСооб.Текст;
	 //   	Если НЕ ФормаС.Открыта() тогда
	 //   		ФормаС.ОткрытьМодально();
	 //   	конецесли;
	 //   конецесли;
	 //   
	 //
КонецФункции

&НаКлиенте
Функция ПоказатьОповещенияПриОткрытии()
СообщениеКомуСсылка = ПолучитьОповещенияНаСервере();

Если СообщениеКомуСсылка <> Неопределено Тогда
	Парам = Новый Структура("ТекСообщение", СообщениеКомуСсылка);
	ОткрытьФорму("Обработка.Интерфейс.Форма.Оповещение", Парам, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);  
	Возврат Неопределено;	
Конецесли;
		
//Если СообщениеКомуСсылка <> Неопределено Тогда
//	Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыОповещениеПриОткрытии", ЭтаФорма);
//	Парам = Новый Структура("ТекСообщение", СообщениеКомуСсылка);
//	ОткрытьФорму("Обработка.Интерфейс.Форма.Оповещение", Парам, ЭтаФорма
//		,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
//	Возврат Неопределено;	
//Конецесли;
//		
//ЗакрытиеФормыОповещениеПриОткрытии(Неопределено, Неопределено);		
КонецФункции

&НаСервере
Функция ПолучитьОповещенияНаСервере()
 //ТекПол
 
 ТекПол = ПараметрыСеанса.ТекущийПользователь;
 ЗапросОповещений=Новый Запрос("ВЫБРАТЬ
               |	СообщениеКому.Ссылка
               |ИЗ
               |	Документ.Сообщение.Кому КАК СообщениеКому
               |ГДЕ
               |	СообщениеКому.ВремяСледующегоПоказа < &ТекВремя
               |	И СообщениеКому.Пользователь = &Пользователь
               |	И СообщениеКому.Ссылка.Актуально = ИСТИНА");
							   
ЗапросОповещений.УстановитьПараметр("ТекВремя",ТекущаяДата());
ЗапросОповещений.УстановитьПараметр("Пользователь",ТекПол);
ТЗ=ЗапросОповещений.Выполнить().Выгрузить();

Если ТЗ.Количество()>0 тогда
	ТекСооб=ТЗ[0].Ссылка;
	
	Возврат ТекСооб;
конецесли;

Возврат Неопределено;
КонецФункции
//
 
//
&НаСервере
Функция СлучайныйЦвет(ТЗКлиентов)      
Случай=Новый ГенераторСлучайныхЧисел();
СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
Если ТЗКлиентов.Найти(НовЦвет,"Цвет")<>Неопределено тогда   
	//Случай=Новый ГенераторСлучайныхЧисел();
	Случай=Новый ГенераторСлучайныхЧисел(Случай.СлучайноеЧисло(0, 100));
	СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
	СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
	СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
	НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
КонецЕсли;

Возврат НовЦвет;
КонецФункции

&НаСервере
Функция ВывестиШахматку(ДатаС,ДатаПо,Детализация)
// + ПСН Перенесено в ПриОткрытии и в ВыводШахматки  	
	//ПоказатьОповещения();
// - ПСН ПСН Перенесено в ПриОткрытии и в ВыводШахматки  	

	ТЗШахм.Очистить();
	ДатаС=?(Детализация="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗанятостьНомеров.Клиент КАК Клиент,
	                    |	ЗанятостьНомеров.Регистратор.Статус КАК Статус,
	                    |	ЗанятостьНомеров.Регистратор КАК Регистратор
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА
	                    |	И ЗанятостьНомеров.Регистратор.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	Клиент");	
	
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
	ТЗКлиентов=Запрос.Выполнить().Выгрузить();
	ТЗКлиентов.Колонки.Добавить("Цвет");
	
	Сч=0;
	////СписокЦветов=Новый СписокЗначений;
	Для каждого Клиент Из ТЗКлиентов Цикл	
		Если Клиент.Статус=Перечисления.СтатусБрони.Проживает тогда
			Клиент.Цвет=Новый Цвет(255,255,255);
		иначеесли Клиент.Статус=Перечисления.СтатусБрони.Выехал тогда
			Клиент.Цвет=Новый Цвет(231, 227, 217);
		иначеесли Клиент.Статус=Перечисления.СтатусБрони.ОтказОтБронирования тогда
			Клиент.Цвет=Новый Цвет(233, 150, 122);   // Лосось темный
		иначе
			Если Клиент.регистратор.ЦветR<>0 Или  Клиент.регистратор.ЦветG<>0 или  Клиент.регистратор.ЦветB<>0 тогда	
				Клиент.Цвет=Новый Цвет(Клиент.регистратор.ЦветR,Клиент.регистратор.ЦветG,Клиент.регистратор.ЦветB);
			ИначеЕсли Клиент.Клиент.ЦветR<>0 Или  Клиент.Клиент.ЦветG<>0 или  Клиент.Клиент.ЦветB<>0 тогда	
				Клиент.Цвет=Новый Цвет(Клиент.Клиент.ЦветR,Клиент.Клиент.ЦветG,Клиент.Клиент.ЦветB);
			иначе
				Клиент.Цвет = СлучайныйЦвет(ТЗКлиентов);
			КонецЕсли;
		конецесли;
	КонецЦикла; 
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗанятостьНомеров.Номер КАК Номер,
	                    |	ЗанятостьНомеров.Клиент КАК Клиент,
	                    |	ЗанятостьНомеров.ПериодРезерва КАК ПериодРезерва,
	                    |	ЗанятостьНомеров.Регистратор КАК Регистратор,
	                    |	ЗанятостьНомеров.БонШанс КАК БонШанс
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА
	                    |	И ЗанятостьНомеров.Регистратор.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)");	
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
	ТЗЗапроса=Запрос.Выполнить().Выгрузить();
	
	ПолеОтчета.Очистить();
	
//// + Вывод Верхних строк с датами		
	ТемпС=ДатаС;
	ТемпПо=ДатаПо;
	
	//Макет = Обработки.Интерфейс.ПолучитьМакет("Макет");
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОтчетОбъект.ПолучитьМакет("Макет");

	ТабДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
	ТабДок.Присоединить(Обл);
	
	ТЗОбъеденения=Новый ТаблицаЗначений();
	ТЗОбъеденения.Колонки.Добавить("КолонкаС");
	ТЗОбъеденения.Колонки.Добавить("КолонкаПо");
	ТЗОбъеденения.Колонки.Добавить("ДТ");
	
	Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");
	ТемпДень=НачалоДня(ТемпС);
	Нов=ТЗОбъеденения.Добавить();
	Нов.КолонкаС=2;
	Нов.КолонкаПо=2;
	Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");
	ТекКол=2;
	
	ШиринаПолеОтчетаМинимум = 2;
	ШиринаПоляОтчетаМаксимум = 2;
	Пока ТемпС<=ТемпПо цикл
		Если НачалоДня(ТемпС)>ТемпДень тогда
			// новый день
			Нов.КолонкаПо=ТекКол-1;
			Нов=ТЗОбъеденения.Добавить();
			Нов.КолонкаС=ТекКол;
			Нов.КолонкаПо=ТекКол+1;
			ТемпДень=НачалоДня(ТемпС);
			Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");	
		конецесли;
		
		// + ПСН  Замена 12:00 на 14:00
		//Обл.Параметры.Период=Формат(ТемпС, ?(Детализация="День","ДФ='dd.MM'","ДФ='HH:mm'"));
		Если Детализация="День" Тогда 
			Обл.Параметры.Период=Формат(ТемпС, "ДФ='dd.MM'");
		Иначе	
			ТемпС_Период = Формат(ТемпС, "ДФ='HH:mm'");		
			Если Лев(ТемпС_Период, 2) = "12" Тогда
				ТемпС_Период = СтрЗаменить(ТемпС_Период, "12", "14");
			КонецЕсли;
			Обл.Параметры.Период = ТемпС_Период;
		КонецЕсли;
		// - ПСН  Замена 12:00 на 14:00
		
		ТабДок.Присоединить(Обл);
		ТемпС=ТемпС+?(Детализация="День", 86400, 3600*6);
		ТекКол=ТекКол+1;
		
		ШиринаПоляОтчетаМаксимум = ШиринаПоляОтчетаМаксимум + 1;
	КонецЦикла;
	
	Нов.КолонкаПо=ТекКол-1;
	Для каждого Об Из ТЗОбъеденения Цикл
		ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаС+1).Текст=Об.ДТ;
		
		ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаПо+1).Объединить();
	КонецЦикла; 
	
	ПолеОтчета.Вывести(ТабДок);
//// + Вывод Верхних строк с датами	
	
	СпрНомеров=Справочники.НомернойФонд.Выбрать();
	Х=0;
	У=0;
	
	ВысотаПолеОтчетаМинимум = 4;
	ВысотаПоляОтчетаМаксимум = 4;
	Пока СпрНомеров.Следующий() цикл
		Если СпрНомеров.ПометкаУдаления Тогда продолжить; КонецЕсли;
				
		ВысотаПоляОтчетаМаксимум = ВысотаПоляОтчетаМаксимум + 1;
		
		У=У+1;
		
		ТабДок=Новый ТабличныйДокумент;
		
		ТемпС=ДатаС;
		ТемпПо=ДатаПо;
		
		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
		Обл.Параметры.Номер=СпрНомеров.Наименование + ?(СпрНомеров.РаздельныеКровати, " / РК","")+ ?(СпрНомеров.Балкон, "/ Б ","");
		Если Не СпрНомеров.ЦветНомераB+СпрНомеров.ЦветНомераG+СпрНомеров.ЦветНомераR=0 тогда
			//Обл.Область(1,2,1,2).ЦветФона=Новый Цвет(СпрНомеров.ЦветНомераR,СпрНомеров.ЦветНомераG,СпрНомеров.ЦветНомераB);
			//Обл.Область(1,2,1,2).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,2,1,2).ЦветФона);
			Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(СпрНомеров.ЦветНомераR,СпрНомеров.ЦветНомераG,СпрНомеров.ЦветНомераB);
			Обл.Область(1,1,1,2).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,2,1,2).ЦветФона);
		конецесли;
		
		//Обл.Область(1,1,1,1).Расшифровка = СпрНомеров.ОписаниеНомера;
	    Обл.Область(1,1,1,1).Расшифровка = СпрНомеров.Ссылка;
		////Обл.Область(1,1,1,1).ИспользованиеРасшифровки=ИспользованиеРасшифровкиТабличногоДокумента.
		ТабДок.Присоединить(Обл);
		
		ТемпКл=Справочники.Клиенты.ПустаяСсылка();
		
		//// + ПСН 25.04.22
		ТемпРегистратор=Документы.ЗаявкаНаБронирование.ПустаяСсылка();
		//// - ПСН 25.04.22
		
		СписОб=Новый СписокЗначений;                            
		Сч=2;
		НачИ=3;	
		Х=0;
		
		Пока ТемпС<=ТемпПо цикл
			Х=Х+1;			
			ПС=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			//ПК=?(Детализация="День",КонецДня(ТемпС),КонецЧаса(ТемпС));
			
			Отбор=Новый Структура("ПериодРезерва,Номер",ПС,СпрНомеров.Ссылка);
			СтрокиНом=ТЗЗапроса.НайтиСтроки(Отбор);
			
			Обл=Макет.ПолучитьОбласть("Строка|СтрПериод");
			
			//// + ПСН 25.04.22
			//Политов
			//если  СпрНомеров.КатегорияНомера.Наименование="Переговорная" тогда
			//	Обл.Область(1,1,1,1).ЦветФона=Новый Цвет(184, 184, 184);
			//	Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
			//КонецЕсли;
			//Политов
			//// - ПСН 25.04.22

			////Если ТЗЗапроса.Количество()<>0 тогда
			Если СтрокиНом.Количество() <> 0 тогда
				////ТекКл=ТЗЗапроса[0].Клиент;
				////// + ПСН 25.04.22
				//ТекКл=СтрокиНом[0].Клиент;
				//
				//ТекРегистратор=СтрокиНом[0].Регистратор;
				////// - ПСН 25.04.22
				
				//Если СтрокиНом[0].Клиент.Наименование = "Оксана" ТОгда
				//	ш = 1;
				//КонецЕсли;
				
				Если СтрокиНом.Количество() > 1 Тогда 
					ТекКл = СтрокиНом[0].Клиент;
					
					//// + ПСН 25.04.22
					ТекРегистратор = СтрокиНом[0].Регистратор;
					//// - ПСН 25.04.22
					
					ТекСтатус = Неопределено; 
					ТекРегистратор = Неопределено;
					
					Обл.Параметры.Период = "Б/Ш " + Строка(СтрокиНом.Количество());
					Цв = Новый Цвет(0, 0, 255);
					
					////НовШ.Документ=СтрокиНом[0].Регистратор;
				Иначе	
					ТекКл=СтрокиНом[0].Клиент;
					
					//// + ПСН 25.04.22
					ТекРегистратор=СтрокиНом[0].Регистратор;
					//// - ПСН 25.04.22
					
					////	КлСтат=ТЗКлиентов.Найти(ТЗЗапроса[0].Клиент,"Клиент");
					КлСтат=ТЗКлиентов.Найти(СтрокиНом[0].Регистратор,"Регистратор");
					Цв=КлСтат.Цвет;
					
					Если ТекКл = ТемпКл Тогда
						Если ТекРегистратор <> ТемпРегистратор Тогда
							ЦветR = Цв.Красный  + 5;
							Если ЦветR > 255 Тогда
								ЦветR = ЦветR - 10;
							КонецЕсли;
									
							Цв = Новый Цвет(ЦветR, Цв.Зеленый, Цв.Синий);
						КонецЕсли;	
					КонецЕсли;	
					
					Обл.Параметры.Период=ТекКл.Наименование;
					
					ТекСтатус = КлСтат.Статус; 
				КонецЕсли;	
				
				Обл.Область(1,1,1,1).ЦветФона=Цв;
				Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);

				//Если КлСтат.Статус=Перечисления.СтатусБрони.Проживает тогда
				Если ТекСтатус = Перечисления.СтатусБрони.Проживает тогда
					Обл.Область(1,1,1,1).Шрифт=Новый Шрифт(Обл.Область(1,1,1,1).Шрифт,,,Истина);
				КонецЕсли;
				
				//Обл.Параметры.Период=ТекКл.Наименование;
				
				НовШ=ТЗШахм.Добавить();
				НовШ.Х=Х;
				НовШ.У=У;
				НовШ.Клиент=ТекКл;
				НовШ.Номер=СпрНомеров.Ссылка;
				////НовШ.Документ=ТЗЗапроса[0].Регистратор;
				
				ДокументМассив = Новый СписокЗначений; 
				Для Каждого СтрокаДанные Из СтрокиНом Цикл
					ДокументМассив.Добавить(СтрокаДанные.Регистратор); 
				КонецЦикла;
				НовШ.Документ=ДокументМассив;
				
				НовШ.Период=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			иначе
				ТекКл=Справочники.Клиенты.ПустаяСсылка();			
			конецесли;
			
			//// + ПСН 25.04.22
			//Если ТекКл<>ТемпКл тогда
			Если ТекКл<>ТемпКл 
			ИЛИ ТекРегистратор <> ТемпРегистратор 
			тогда
			//// - ПСН 25.04.22
				
				НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
				СписОб.Добавить(НовОб);
				
				ТемпКл=ТекКл;
				//// + ПСН 25.04.22
				ТемпРегистратор = ТекРегистратор;
				//// - ПСН 25.04.22
				
				НачИ=Сч+1;
			конецесли;
			
			ТабДок.Присоединить(Обл);
			
			// + ПСН 07.06.2022
			//ТемпС = ТемпС + ?(Детализация="День", 86400, 3600*6);
			
			Если Час(ТемпС) = 6 Тогда
				ТемпС = ТемпС + ?(Детализация="День", 86400, 3600*8);
			Иначе				
				ТемпС = ТемпС + ?(Детализация="День", 86400, 3600*6);
			КонецЕсли;
			
			сч=сч+1;
		КонецЦикла;
		
		НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
		СписОб.Добавить(НовОб);
		
		Первый=Истина;
		Для каждого Об Из СписОб Цикл
			если Первый Тогда
				Первый=Ложь;
				Продолжить;
				
			конецесли;
			Если Об.Значение.ТекКл=Справочники.Клиенты.ПустаяСсылка() тогда
				Продолжить;
			конецесли;
			
			ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
		КонецЦикла; 
		
		ПолеОтчета.Вывести(ТабДок);
	КонецЦикла;
	
	ПолеОтчета.ФиксацияСлева=2;
	ПолеОтчета.ФиксацияСверху=3;
	
	ПолеОтчета.Область(1, , 1).Видимость = Ложь;

	ПолеОтчета.УстановитьРастягиваниеПоГоризонтали(Истина);
КонецФункции

&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.НомернойФонд") Тогда
	СтандартнаяОбработка = Ложь;	
	
	ОбменСГорничными = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("ОбменСГорничными");
	Если ОбменСГорничными Тогда
		ПараметрыФормы = Новый Структура("Номер", Расшифровка);
		ОткрытьФорму("ОбщаяФорма.СостояниеНомера", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе	
		ОписаниеНомера = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Расшифровка, "ОписаниеНомера");	
		Если НЕ ЗначениеЗаполнено(ОписаниеНомера) Тогда
			ОписаниеНомера = "Описание номера отсутствует";
		КонецЕсли;
		ПоказатьЗначение(,ОписаниеНомера);
	КонецЕсли;	
КонецЕсли;		
КонецПроцедуры
//

&НаКлиенте
Процедура ДниРожденияКоманда(Команда)
ПоказатьДниРождения(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДниРождения(Вызов)
ПараметрыФормы = Новый Структура; 	
Если Вызов Тогда	
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс; 	
	ПараметрыФормы.Вставить("Вызов", Истина);	
Иначе
	РежимОткрытия = РежимОткрытияОкнаФормы.Независимый; 	
КонецЕсли;	
ОткрытьФорму("Обработка.ДниРождения.Форма.Форма", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытия);
КонецПроцедуры	

//
&НаКлиенте
Процедура ПересеченияНомеров__(ДН,ДК,Вывести=Ложь)
//	Запрос=Новый Запрос("ВЫБРАТЬ
//	                    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗанятостьНомеров.Регистратор) КАК Регистратор,
//	                    |	ЗанятостьНомеров.Номер,
//	                    |	ЗанятостьНомеров.ПериодРезерва
//	                    |ПОМЕСТИТЬ ТЕМП
//	                    |ИЗ
//	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
//	                    |ГДЕ
//	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &П1 И &П2
//	                    |
//	                    |СГРУППИРОВАТЬ ПО
//	                    |	ЗанятостьНомеров.Номер,
//	                    |	ЗанятостьНомеров.ПериодРезерва
//	                    |;
//	                    |
//	                    |////////////////////////////////////////////////////////////////////////////////
//	                    |ВЫБРАТЬ
//	                    |	КОЛИЧЕСТВО(ТЕМП.Регистратор) КАК Регистратор,
//	                    |	ТЕМП.Номер КАК Номер,
//	                    |	НАЧАЛОПЕРИОДА(ТЕМП.ПериодРезерва, ДЕНЬ) КАК ПериодРезерва
//	                    |ПОМЕСТИТЬ ТЕМП2
//	                    |ИЗ
//	                    |	ТЕМП КАК ТЕМП
//	                    |ГДЕ
//	                    |	ТЕМП.Регистратор > 1
//	                    |
//	                    |СГРУППИРОВАТЬ ПО
//	                    |	ТЕМП.Номер,
//	                    |	НАЧАЛОПЕРИОДА(ТЕМП.ПериодРезерва, ДЕНЬ)
//	                    |;
//	                    |
//	                    |////////////////////////////////////////////////////////////////////////////////
//	                    |ВЫБРАТЬ
//	                    |	ТЕМП2.Номер,
//	                    |	ТЕМП2.ПериодРезерва как Дата
//	                    |ИЗ
//	                    |	ТЕМП2 КАК ТЕМП2
//	                    |ГДЕ
//	                    |	ТЕМП2.Регистратор > 1");
//Запрос.УстановитьПараметр("П1",ДН);
//Запрос.УстановитьПараметр("П2",ДК);

//ТЗ=Запрос.Выполнить().Выгрузить();

//ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПересеченияНомеров.Текст="Пересечения броней (" + Строка(ТЗ.Количество())+")";
//Если Вывести тогда
//	Макет=ПолучитьМакет("Пересечения");
//	ТабДок=новый ТабличныйДокумент;
//	Обл=Макет.ПолучитьОбласть("Шапка");
//	ТабДок.Вывести(Обл);
//	Для каждого Стр Из ТЗ Цикл
//	
//		Обл=Макет.ПолучитьОбласть("Строка");
//		Обл.Параметры.Заполнить(Стр);
//	ТабДок.Вывести(Обл);
//	
//	
//КонецЦикла; 
//Табдок.Показать();
//конецесли;

КонецПроцедуры                                

&НаКлиенте
Процедура ЛистОжиданияКоманда(Команда)
ЛистОжиданияКнопкаКоличество();

ПараметрыФормы = Новый Структура("ЛистОжидания", Истина);	
ОткрытьФорму("Документ.ЗаявкаНаБронирование.ФормаСписка", ПараметрыФормы, ЭтаФорма); 	
КонецПроцедуры 

&НаСервере
Процедура ЛистОжиданияКнопкаКоличество()
//Запрос=Новый Запрос("ВЫБРАТЬ
//                    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК Количество
//                    |ИЗ
//                    |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
//                    |ГДЕ
//                    |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
//                    |	И ЗаявкаНаБронирование.ЛистОжидания = ИСТИНА
//                    |	И ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)");

//ТЗ=Запрос.Выполнить().Выгрузить();
//Если ТЗ.Количество() = 0 Тогда 
//	Количество = 0; 
//Иначе
//	Количество = ТЗ[0].Количество;
//КонецЕсли;

Количество = ЛистОжиданияКоличество();

Элементы.ЛистОжиданияКоманда.Заголовок = "Лист ожидания (" + Строка(Количество)+")";
Если Количество > 0 Тогда 
	Элементы.ЛистОжиданияКоманда.ЦветТекста = Новый Цвет(240, 255, 255);
	Элементы.ЛистОжиданияКоманда.ЦветФона = Новый Цвет(255, 0, 0);
Иначе
	Элементы.ЛистОжиданияКоманда.ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
	Элементы.ЛистОжиданияКоманда.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
КонецЕсли;
КонецПроцедуры                                

&НаСервере
Функция ЛистОжиданияКоличество()
Запрос=Новый Запрос("ВЫБРАТЬ
                    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК Количество
                    |ИЗ
                    |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                    |ГДЕ
                    |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                    |	И ЗаявкаНаБронирование.ЛистОжидания = ИСТИНА
                    |	И ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)");

ТЗ=Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда 
	Количество = 0; 
Иначе
	Количество = ТЗ[0].Количество;
КонецЕсли;

Возврат Количество;
КонецФункции                                

&НаСервере
Процедура ЖурналЛистОжиданияКомандаКоличество()
Запрос=Новый Запрос("ВЫБРАТЬ
                    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК Количество
                    |ИЗ
                    |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                    |ГДЕ
                    |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                    |	И ЗаявкаНаБронирование.ЛистОжидания = ИСТИНА
                    |	И ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)");

ТЗ=Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда 
	Количество = 0; 
Иначе
	Количество = ТЗ[0].Количество;
КонецЕсли;

Элементы.ЖурналЛистОжиданияКоманда.Заголовок = "Лист ожидания (" + Строка(Количество)+")";
Если Количество > 0 Тогда 
	Элементы.ЖурналЛистОжиданияКоманда.ЦветТекста = Новый Цвет(240, 255, 255);
	Элементы.ЖурналЛистОжиданияКоманда.ЦветФона = Новый Цвет(255, 0, 0);
Иначе
	Элементы.ЖурналЛистОжиданияКоманда.ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
	Элементы.ЖурналЛистОжиданияКоманда.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
КонецЕсли;
КонецПроцедуры                                

&НаКлиенте
Процедура ПересеченияНомеров(ДН, ДК, Вывести=Ложь)
Табдок = ПересеченияНомеровНаСервере(ДН, ДК, Вывести); 
Если НЕ Табдок = Неопределено тогда
	Табдок.Показать("Пересечения номеров");
конецесли;
КонецПроцедуры                                

&НаСервере
Функция ПересеченияНомеровНаСервере(ДН,ДК,Вывести=Ложь)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗанятостьНомеров.Регистратор) КАК Регистратор,
	                    |	ЗанятостьНомеров.Номер,
	                    |	ЗанятостьНомеров.ПериодРезерва
	                    |ПОМЕСТИТЬ ТЕМП
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &П1 И &П2
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ЗанятостьНомеров.Номер,
	                    |	ЗанятостьНомеров.ПериодРезерва
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	КОЛИЧЕСТВО(ТЕМП.Регистратор) КАК Регистратор,
	                    |	ТЕМП.Номер КАК Номер,
	                    |	НАЧАЛОПЕРИОДА(ТЕМП.ПериодРезерва, ДЕНЬ) КАК ПериодРезерва
	                    |ПОМЕСТИТЬ ТЕМП2
	                    |ИЗ
	                    |	ТЕМП КАК ТЕМП
	                    |ГДЕ
	                    |	ТЕМП.Регистратор > 1
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ТЕМП.Номер,
	                    |	НАЧАЛОПЕРИОДА(ТЕМП.ПериодРезерва, ДЕНЬ)
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ТЕМП2.Номер,
	                    |	ТЕМП2.ПериодРезерва как Дата
	                    |ИЗ
	                    |	ТЕМП2 КАК ТЕМП2
	                    |ГДЕ
	                    |	ТЕМП2.Регистратор > 1");
Запрос.УстановитьПараметр("П1",ДН);
Запрос.УстановитьПараметр("П2",ДК);

ТЗ=Запрос.Выполнить().Выгрузить();

//ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПересеченияНомеров.Текст="Пересечения броней (" + Строка(ТЗ.Количество())+")";
Элементы.ПересеченияНомеровКоманда.Заголовок = "Пересечения броней (" + Строка(ТЗ.Количество())+")";

Если Вывести тогда
	//Макет=ПолучитьМакет("Пересечения");
	Макет = Обработки.Интерфейс.ПолучитьМакет("Пересечения");
	
	ТабДок=новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Обл);
	Для каждого Стр Из ТЗ Цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(Стр);
		ТабДок.Вывести(Обл);
	КонецЦикла; 
	
	Возврат ТабДок;
	//Табдок.Показать();
конецесли;

Возврат Неопределено;

КонецФункции                                
//


// + Выбор
&НаКлиенте
Процедура ПолеОтчетаВыбор__(Элемент, Область, СтандартнаяОбработка)
	////Тек=ОпределитьПоКоординатам(Область.Лево-1,Область.Верх-3);	
	//Тек=ОпределитьПоКоординатам(Область.Лево-2,Область.Верх-3);	
	////Сообщить(Тек.Клиент);
	//Если Тек.Документ<>Документы.ЗаявкаНаБронирование.ПустаяСсылка() тогда
	//	ОбДок=Тек.документ.получитьОбъект();
	//	ОбДок.получитьФорму("ФормаДокумента").Открыть();
	//конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаВыбор(Элемент, Область, СтандартнаяОбработка)
	////Тек=ОпределитьПоКоординатам(Область.Лево-1,Область.Верх-3);	
	Тек=ОпределитьПоКоординатам(Область.Лево-2,Область.Верх-3);	
	////Сообщить(Тек.Клиент);
	Если Тек.Документ = Неопределено тогда Возврат; КонецЕсли;
	
	Если Тек.Документ.Количество() = 1 тогда
		//ОбДок=Тек.документ.получитьОбъект();
		//ОбДок.получитьФорму("ФормаДокумента").Открыть();
		
		ДокументСсылка = Тек.Документ[0].Значение;
		ПараметрыФормы = Новый Структура("Ключ", ДокументСсылка);
		//ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПарамФормы, ЭтаФорма
		//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.Независимый);
			
		//ОбДок=Тек.документ.получитьОбъект();
		//ОбДок.получитьФорму("ФормаДокумента").Открыть();
		
	ИначеЕсли Тек.Документ.Количество() > 1 тогда
		//ОбДок=Тек.документ.получитьОбъект();
		//ОбДок.получитьФорму("ФормаДокумента").Открыть();
		
		ПараметрыФормы = Новый Структура("Регистраторы", Тек.Документ);
		//ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПарамФормы, ЭтаФорма
		//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ОткрытьФорму("Обработка.Интерфейс.Форма.ФормаВыбораБонШанс", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		//ОбДок=Тек.документ.получитьОбъект();
		//ОбДок.получитьФорму("ФормаДокумента").Открыть();
		
	конецесли;
КонецПроцедуры

&НаКлиенте
Функция ОпределитьПоКоординатам(х,у)
Отбор=Новый Структура("Х,У",Х,У);
Стр=ТЗШахм.НайтиСтроки(Отбор);

ВозврСтр=Новый Структура("Клиент,Номер,Период,Документ"
	,ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка")
	,ПредопределенноеЗначение("Справочник.НомернойФонд.ПустаяСсылка")
	,ТекущаяДата()
	,Неопределено);
	//,ПредопределенноеЗначение("Документ.ЗаявкаНаБронирование.ПустаяСсылка"));
	
Если Стр.Количество()=0 тогда
	Возврат ВозврСтр;
иначе
	ВозврСтр.Клиент=Стр[0].Клиент;
	ВозврСтр.Номер=Стр[0].Номер;
	ВозврСтр.Период=Стр[0].Период;
	ВозврСтр.Документ=Стр[0].Документ;
	Возврат ВозврСтр;
КонецЕсли;
КонецФункции
// - Выбор

//// + Командная панель Формы
&НаКлиенте
Процедура ОбновитьФормуКоманда(Команда)
ВыводШахматки();
КонецПроцедуры


//
&НаКлиенте
Процедура КлиентыКоманда(Команда)
//ОткрытьФорму("Справочник.Клиенты.ФормаСписка", ,ЭтаФорма
//	, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
ОткрытьФорму("Справочник.Клиенты.ФормаСписка", ,ЭтаФорма
	, , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
//

// + БРОНЬ 
&НаКлиенте
Процедура БроньКоманда(Команда)
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры
// - БРОНЬ 

//
&НаКлиенте
Процедура ЖурналБронированияКоманда(Команда)
//ОткрытьФорму("Документ.ЗаявкаНаБронирование.ФормаСписка",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//ОткрытьФорму("Документ.ЗаявкаНаБронирование.ФормаСписка",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.Независимый);
	
ОткрытьФорму("Документ.ЗаявкаНаБронирование.ФормаСписка");
КонецПроцедуры
//

&НаКлиенте
Процедура ПоискКоманда(Команда)
//ОткрытьФорму("Обработка.ПоискДанных.Форма.Форма",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
ОткрытьФорму("Обработка.ПоискДанных.Форма.Форма",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
// - Кнопка6

&НаКлиенте
Процедура ЖурналПодтвержденияКоманда(Команда)
//ОткрытьФорму("Документ.ПодтверждениеБронирования.ФормаСписка",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
ОткрытьФорму("Документ.ПодтверждениеБронирования.ФормаСписка",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеКоманда(Команда)
//ОткрытьФорму("Отчет.ОтчетПоДнямРождения.Форма.ФормаОтчета",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
ОткрытьФорму("Отчет.ОтчетПроживающие.Форма.ФормаОтчета",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

// + Не найдена кнопка на форме
&НаКлиенте
Процедура ТарифыНажатие___(Элемент)
	//Справочники.Тариф.ПолучитьФормуСписка().Открыть();
КонецПроцедуры
// - Не найдена кнопка на форме

&НаКлиенте
Процедура ЖурналЛистОжиданияКоманда(Команда)
//ОткрытьФорму("Документ.ЛистОжидания.ФормаСписка",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

//ОткрытьФорму("Документ.ЛистОжидания.ФормаСписка",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.Независимый);
	
ПараметрыФормы = Новый Структура("ЛистОжидания, ТолькоЛистОжидания", Истина, Истина);	
ОткрытьФорму("Документ.ЗаявкаНаБронирование.ФормаСписка", ПараметрыФормы, ЭтаФорма); 
КонецПроцедуры

//
&НаКлиенте
Процедура ЗакрытиеСменыКоманда(Команда)
	ОчиститьСообщения();

	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросЗакрытиеСмены", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Подтвердите закрытие смены ...", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросЗакрытиеСмены(Результат, ДопПараметры) Экспорт
Если Результат <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
ДопПараметры = Новый Структура;

//Ответ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
//Кассир = Ответ.Кассир;

Кассир = ФУ_Сервер.Кассир(Ложь);

ДопПараметры.Вставить("Кассир",Кассир);
ДопПараметры.Вставить("КассирИНН","");

ОповещениеЗавершение = Новый ОписаниеОповещения("Завершение_ЗакрытиеСменыКоманда", ЭтаФорма);

ФУ_Клиент.ЗакрытьСмену(ЭтаФорма, ОповещениеЗавершение, ДопПараметры); 
КонецПроцедуры

&НаКлиенте
Процедура Завершение_ЗакрытиеСменыКоманда(Результат, ДополнительныеПараметры) Экспорт
Сообщить(Результат.ТекстСообщения);
КонецПроцедуры
//

//
&НаКлиенте
Процедура БезГашенияКоманда(Команда)
ДопПараметры = Новый Структура;

//Ответ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
//Кассир = Ответ.Кассир;

Кассир = ФУ_Сервер.Кассир(Ложь);
 
ДопПараметры.Вставить("Кассир",Кассир);
ДопПараметры.Вставить("КассирИНН","");

ОповещениеЗавершение = Новый ОписаниеОповещения("Завершение_ОтчетБезГашенияКоманда", ЭтаФорма);

ФУ_Клиент.ОтчетБезГашения(ЭтаФорма, ОповещениеЗавершение, ДопПараметры); 
КонецПроцедуры

&НаКлиенте
Процедура Завершение_ОтчетБезГашенияКоманда(Результат, ДополнительныеПараметры) Экспорт
Сообщить(Результат.ТекстСообщения);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОткрытиеСменыКоманда(Команда)
ДопПараметры = Новый Структура;

//Ответ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
//Кассир = Ответ.Кассир;
Кассир = ФУ_Сервер.Кассир(Ложь);

ДопПараметры.Вставить("Кассир",Кассир);
ДопПараметры.Вставить("КассирИНН","");

ОповещениеЗавершение = Новый ОписаниеОповещения("Завершение_ОткрытиеСменыКоманда", ЭтаФорма);

ФУ_Клиент.ОткрытьСмену(ЭтаФорма, ОповещениеЗавершение, ДопПараметры);  

КонецПроцедуры

&НаКлиенте
Процедура Завершение_ОткрытиеСменыКоманда(Результат, ДополнительныеПараметры) Экспорт
Сообщить(Результат.ТекстСообщения);
КонецПроцедуры
// 


&НаКлиенте
Процедура ФинансыКоманда(Команда)
	ТекПол = ОбщийФункционалСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
	ТекПолАдмин = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(ТекПол,"Админ");
	Если ТекПолАдмин тогда
		//ПолучитьФорму("ФормаФинансы").Открыть();
		ОткрытьФорму("Обработка.Интерфейс.Форма.ФормаФинансы_Старая", , ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.Независимый);   
	иначе
		ОткрытьФорму("Обработка.Интерфейс.Форма.ФормаФинансы", , ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.Независимый);   
	конецесли;
КонецПроцедуры

//// - Командная панель Формы



//// + Командная панель

//
&НаКлиенте
Процедура КалендарьЦенНаМесяцКоманда(Команда)
ТабДок = КалендарьЦенНаМесяцКомандаНаСервере();

//ТабДок.Показать("Календарь цен");

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "КалендарьЦенНаМесяц"); 
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, , Истина);
КонецПроцедуры

&НаСервере
Функция КалендарьЦенНаМесяцКомандаНаСервере()
Макет=Обработки.Интерфейс.ПолучитьМакет("КалендарьЦен");

ТабДок=Новый ТабличныйДокумент;

//ТабДок.Защита = Истина;
ТабДок.ОтображатьЗаголовки = Ложь;
ТабДок.ТолькоПросмотр = Истина;

Обл=Макет.ПолучитьОбласть("Шапка|СтолбецДата");
ТабДок.Вывести(Обл);

КатегорияНомера = Справочники.КатегорииНомеров.Выбрать();
Пока КатегорияНомера.Следующий() Цикл
	Если КатегорияНомера.ПометкаУдаления Тогда Продолжить; КонецЕсли;  
	
	Обл=Макет.ПолучитьОбласть("Шапка|СтолбецКатегория");
	КатегорияНомераНаименование = КатегорияНомера.Наименование;
	Обл.Параметры.КатегорияНомера = КатегорияНомераНаименование;
	ТабДок.Присоединить(Обл);
КонецЦикла;	

ДТН=НачалоДня(ТекущаяДата());
ДТК=НачалоДня(ТекущаяДата() + 86400*30);

Пока ДТН<ДТК цикл
	Вых=?(ДеньНедели(ДТН)>=5,Истина,Ложь);
	
	Обл=?(Вых,Макет.ПолучитьОбласть("СтрокаВых|СтолбецДата"), Макет.ПолучитьОбласть("Строка|СтолбецДата"));
	Обл.Параметры.ДТ=Формат(ДТН, "ДФ=dd.MM.yy");
	ТабДок.Вывести(Обл);
	
	КатегорияНомера = Справочники.КатегорииНомеров.Выбрать();
	Пока КатегорияНомера.Следующий() Цикл
		Если КатегорияНомера.ПометкаУдаления Тогда Продолжить; КонецЕсли;  
		
		КатегорияНомераСсылка = КатегорияНомера.Ссылка;
		Если КатегорияНомера.ТолькоОдноместный Тогда
			ЦенаДвух = 0;
		Иначе
			ЦенаДвух = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомераСсылка, Ложь, Истина);
		КонецЕсли;	
		//ЦенаДвух = ДокументыСервер.ОкруглитьЦену(ЦенаДвух); 
		
		Если КатегорияНомера.ТолькоОдноместный Тогда
			ЦенаБезЗавтракаДвух = 0;
		Иначе
			ЦенаБезЗавтракаДвух = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомераСсылка, Истина, Истина);
		КонецЕсли;	
		//ЦенаБезЗавтракаДвух = ДокументыСервер.ОкруглитьЦену(ЦенаБезЗавтракаДвух); 
		
		Цена = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомераСсылка, Ложь, Ложь);
		//Цена = ДокументыСервер.ОкруглитьЦену(Цена); 
		
		ЦенаБезЗавтрака = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомераСсылка, Истина, Ложь);
		//ЦенаБезЗавтрака = ДокументыСервер.ОкруглитьЦену(ЦенаБезЗавтрака); 
		
		Обл=?(Вых,Макет.ПолучитьОбласть("СтрокаВых|СтолбецКатегория"), Макет.ПолучитьОбласть("Строка|СтолбецКатегория"));
		//Дт	СТ_1	СТ_2	СТ_В_1	СТ_В2	ПЛ_1	ПЛ_2	ПЛ_В_1	ПЛ_В_2	Л_1	Л_2	Л_В_1	Л_В_2
		Если Не Вых тогда
			Обл.Параметры.СТ_1 = Формат(Цена, "ЧДЦ=2") + " / " + Формат(ЦенаБезЗавтрака, "ЧДЦ=2");
			Если НЕ КатегорияНомера.ТолькоОдноместный Тогда
				Обл.Параметры.СТ_2 = Формат(ЦенаДвух, "ЧДЦ=2") + " / " + Формат(ЦенаБезЗавтракаДвух, "ЧДЦ=2");
			КонецЕсли;
		иначе
			Обл.Параметры.СТ_В_1=Формат(Цена, "ЧДЦ=2") + " / " + Формат(ЦенаБезЗавтрака, "ЧДЦ=2");
			Если НЕ КатегорияНомера.ТолькоОдноместный Тогда
				Обл.Параметры.СТ_В_2=Формат(ЦенаДвух, "ЧДЦ=2") + " / " + Формат(ЦенаБезЗавтракаДвух, "ЧДЦ=2");
			КонецЕсли;
		конецесли;
		
		ТабДок.Присоединить(Обл);
	КонецЦикла;
	
	ДТН=ДТН+86400;		
КонецЦикла;

Возврат  ТабДок;
КонецФункции
//

// 
&НаКлиенте
Процедура РасчитатьПроживаниеКоманда(Команда)
ОткрытьФорму("Обработка.РасчетПроживания.Форма.Форма", 
	,,,,,, РежимОткрытияОкнаФормы.Независимый);	
КонецПроцедуры

//
&НаКлиенте
Процедура ОсновныеДействияФормыЗагрузкаСканов(Кнопка)
	//Обработки.ЗагрузкаСканов.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаСкановКоманда(Команда)
ОткрытьФорму("Обработка.ЗагрузкаСканов.Форма.Форма",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//


//
&НаКлиенте
Процедура ВыгрузкаВФМСКоманда(Команда)
ОткрытьФорму("Обработка.ВыгрузкаДляФМС.Форма.Форма",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//

////

//
&НаКлиенте
Процедура ВозвратОплаты(Команда)
Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ЧекВозврат", ЭтаФорма);  

ОткрытьФорму("ОбщаяФорма.ЧекВозврат", , 
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_ЧекВозврат(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли; 	

ОчиститьСообщения();  

ФУ_Клиент.ПоказатьПодтверждениеСообщение(Результат);
//ЭтаФорма.Прочитать();	
КонецПроцедуры

&НаКлиенте
Процедура КопияЧека(Команда)
ДокументыОплатыОтбор = Новый СписокЗначений;
ПараметрыФормы = Новый Структура("ДокументыОплатыОтбор", ДокументыОплатыОтбор);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ФормаВыбораКопияЧек", ЭтаФорма);  
ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаВыбораКопияЧек", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_ФормаВыбораКопияЧек(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда	Возврат; КонецЕсли;

ОплатыЧекКлиент.КопияЧекаДействие(Результат, ЭтаФорма);
Возврат;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОсновныеДействияФормыДолгиЗаМинибар(Кнопка)
	//Отчеты.ДолгиЗаМинибар.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДолгиЗаМинибарКоманда(Команда)
ОткрытьФорму("Отчет.ДолгиЗаМинибар.Форма",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ПересеченияНомеровКоманда(Команда)
	ПересеченияНомеров(НачалоНедели(ТекДатаШахматки),КонецНедели(ТекДатаШахматки),Истина);	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОсновныеДействияФормыЗабытыеВещи___(Кнопка)
//	Обработки.ФиксацияЗабытыеВещи.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗабытыеВещиКоманда(Команда)
ОткрытьФорму("Обработка.ФиксацияЗабытыеВещи.Форма.Форма",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОсновныеДействияФормыМиниБар___(Кнопка)
	//Обработки.ФиксацияПоказанийМиниБара.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ФиксацияПоказанийМиниБараКоманда(Команда)
//ОткрытьФорму("Обработка.ФиксацияПоказанийМиниБара.Форма.Форма", , ЭтаФорма);
КонецПроцедуры



//
&НаКлиенте
Процедура ОсновныеДействияФормыПерейтиНаДату(Кнопка)
	//НовДата=ТекущаяДата();
	//ВвестиЗначение(НовДата,"Выберите дату");
	//ТекДатаШахматки=НовДата;
	//ВыводШахматки();

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаДатуКоманда(Команда)
	НовДата=ТекущаяДата();
	//ВвестиЗначение(НовДата,"Выберите дату");
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВводЗначенияНовДата", ЭтаФорма); 
	
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
    ОписаниеДаты = Новый ОписаниеТипов("Дата", , ,КвалификаторыДаты);
	
	ПоказатьВводЗначения(Оповещение, НовДата, "Выберите дату", ОписаниеДаты); 
	
	ТекДатаШахматки=НовДата;
	ВыводШахматки();
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьВводЗначенияНовДата(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
	ТекДатаШахматки = Результат;
	ВыводШахматки();
КонецПроцедуры
//

//
Процедура ОсновныеДействияФормыЗамечания___(Кнопка)
	//Документы.Замечания.ПолучитьФормуСписка(?(ТекПол.Админ,"ФормаСписка","ФормаСписка1")).Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗамечанияКоманда(Команда)
//Документы.Замечания.ПолучитьФормуСписка(?(ТекПол.Админ,"ФормаСписка","ФормаСписка1")).Открыть();
ТекПол = ОбщийФункционалСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
ТекПолАдмин = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(ТекПол, "Админ");

Если ТекПолАдмин Тогда
	ФормаИмя = "Документ.Замечания.Форма.ФормаСписка";
Иначе
	ФормаИмя = "Документ.Замечания.Форма.ФормаСписка1";
КонецЕсли;	

ОткрытьФорму(ФормаИмя, ,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ТекущаяНеделяКоманда(Команда)
	ТекДатаШахматки=ТекущаяДата();
	ВыводШахматки();
КонецПроцедуры
//

//
&НаКлиенте
Процедура НеделяНазадКоманда(Команда)
	ТекДатаШахматки=ТекДатаШахматки-7*86400;
	ВыводШахматки();
КонецПроцедуры
//

//
&НаКлиенте
Процедура НеделяВпередКоманда(Команда)
	ТекДатаШахматки=ТекДатаШахматки+7*86400;
	ВыводШахматки();
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОсновныеДействияФормыЗаменаНомеров__(Кнопка)
	//Док1=Документы.ЗаявкаНаБронирование.ПустаяСсылка();
	//Док2=Документы.ЗаявкаНаБронирование.ПустаяСсылка();
	//ВвестиЗначение(Док1,"Выберите первый номер");
	//ВвестиЗначение(Док2,"Выберите второй номер");

	//Если Док1<>Документы.ЗаявкаНаБронирование.ПустаяСсылка() и Док2<>Документы.ЗаявкаНаБронирование.ПустаяСсылка() и Док1<>Док2 тогда
	//	ОбДок1=Док1.ПолучитьОбъект();
	//	ОбДок2=Док2.ПолучитьОбъект();
	//	ОбДок1.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	ОбДок2.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	
	//	Темп=ОбДок1.НомерВРезерв;
	//	ОбДок1.НомерВРезерв=ОбДок2.НомерВРезерв;
	//	ОбДок2.НомерВРезерв=Темп;
	//	ОбДок1.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	//	ОбДок2.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	//	Предупреждение("Номера заменены");
	//	ВыводШахматки();
	//иначе
	//	Сообщить("Ошибка выбора!");
	//конецесли;
	//

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаНомеровКоманда(Команда)
	Док1=ПредопределенноеЗначение("Документ.ЗаявкаНаБронирование.ПустаяСсылка");
	
	//ВвестиЗначение(Док1,"Выберите первый номер");
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВводЗначенияПервыйНомер", ЭтаФорма);
	ПоказатьВводЗначения(Оповещение, Док1, "Выберите первый номер"); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводЗначенияПервыйНомер(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

	Док2=ПредопределенноеЗначение("Документ.ЗаявкаНаБронирование.ПустаяСсылка");
	
	ДопПараметры = Новый Структура("Док1", Результат); 
	//ВвестиЗначение(Док1,"Выберите первый номер");
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВводЗначенияВторойНомер", ЭтаФорма, ДопПараметры );
	ПоказатьВводЗначения(Оповещение, Док2, "Выберите второй номер"); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводЗначенияВторойНомер(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

	Док1=ДополнительныеПараметры.Док1;
	Док2=Результат;
	
	Если Док1 <> ПредопределенноеЗначение("Документ.ЗаявкаНаБронирование.ПустаяСсылка") 
	И Док2 <> ПредопределенноеЗначение("Документ.ЗаявкаНаБронирование.ПустаяСсылка") 
	И Док1<>Док2 тогда  
		ПерезаписатьДокументыБронирования(Док1, Док2);
		
		ВыводШахматки();
		ПоказатьПредупреждение(,"Номера заменены");
	иначе
		Сообщить("Ошибка выбора!");
	конецесли;

КонецПроцедуры


&НаСервере
Процедура ПерезаписатьДокументыБронирования(Док1, Док2)
	
		ОбДок1=Док1.ПолучитьОбъект();
		ОбДок2=Док2.ПолучитьОбъект();
		ОбДок1.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ОбДок2.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		Темп=ОбДок1.НомерВРезерв;
		ОбДок1.НомерВРезерв=ОбДок2.НомерВРезерв;
		ОбДок2.НомерВРезерв=Темп;
		ОбДок1.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		ОбДок2.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);

КонецПроцедуры


//
&НаКлиенте
Процедура БанковскиеВыписки(Команда)
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаСписка", ,ЭтаФорма
	, , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КассовыеДокументы(Команда)
ПараметрыФормы = Новый Структура;
//ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);

ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма
	, , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
//


&НаКлиенте
Процедура ГрупповыеСчета(Команда)
ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаСписка", ,ЭтаФорма
	, , , , , РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры


//// + Горничные
&НаКлиенте
Процедура ОтчетПоГорничнымКоманда(Команда)
ОткрытьФорму("Отчет.ОбщийОтчетПоГорничным.Форма.ФормаОтчета", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетГорничныеПомещения(Команда)
ОткрытьФорму("Отчет.ОтчетГорничныеПомещения.Форма.ФормаОтчета",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетГорничныеСмены(Команда)
ОткрытьФорму("Отчет.ОтчетГорничныеСмены.Форма.ФормаОтчета",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры


// + Зарплата
&НаКлиенте
Процедура ГорничныеСправочник(Команда)
ОткрытьФорму("Справочник.Горничные.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеСтоимостьУборок(Команда)
ОткрытьФорму("Справочник.ГорничныеСтоимостьУборок.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеЗарплата(Команда)
ОткрытьФорму("Документ.ГорничныеЗарплата.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеПрачечная(Команда)
ОткрытьФорму("Документ.ГорничныеПрачечная.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеПомещенияСправочник(Команда)
ОткрытьФорму("Справочник.ГорничныеПомещения.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеОбщийКвиток(Команда)
ОткрытьФорму("Документ.ГорничныеОбщийКвиток.ФормаСписка");
КонецПроцедуры

// - Зарплата
//// - Горничные

//// + Справочники

&НаКлиенте
Функция ПараметрыФормыСправочник()
ТекущийПользователь = ОбщийФункционалСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
ТолькоПросмотр = НЕ ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(ТекущийПользователь, "Админ"); 
ПараметрыФормыСправочник = Новый Структура("ТолькоПросмотр", ТолькоПросмотр);	
Возврат ПараметрыФормыСправочник;
КонецФункции

&НаКлиенте
Процедура СправочникДопУслуги(Команда)
ПараметрыФормы = ПараметрыФормыСправочник();
ОткрытьФорму("Справочник.ДопУслуги.ФормаСписка", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СправочникНомернойФонд(Команда)
ПараметрыФормы = ПараметрыФормыСправочник();
ОткрытьФорму("Справочник.НомернойФонд.ФормаСписка", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СправочникОрганизация(Команда)
ПараметрыФормы = ПараметрыФормыСправочник();
ОткрытьФорму("Справочник.Организации.ФормаСписка", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СправочникКатегорииНомеров(Команда)
ПараметрыФормы = ПараметрыФормыСправочник();
ОткрытьФорму("Справочник.КатегорииНомеров.ФормаСписка", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СправочникТарифныеПланы(Команда)
ПараметрыФормы = ПараметрыФормыСправочник();
ОткрытьФорму("Справочник.ТарифныеПланы.ФормаСписка", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура АгентстваСтатистикаПоНомерам(Команда)
ОткрытьФорму("Справочник.СтатистикаПоНомерамАгентства.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПользователиКоманда(Команда)
ОткрытьФорму("Справочник.Пользователи.ФормаСписка", ,ЭтаФорма);
КонецПроцедуры

//
&НаКлиенте
Процедура Должности(Команда)
ОткрытьФорму("Справочник.Должности.ФормаСписка", ,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТипыДолжностей(Команда)
ОткрытьФорму("Справочник.ТипыДолжностей.ФормаСписка", ,ЭтаФорма);
КонецПроцедуры
//
//// - Справочники

//// + Отчеты
&НаКлиенте
Процедура ОтчетКассовыеСмены(Команда)
ОткрытьФорму("Отчет.ОтчетКассоваяСмена.Форма.ФормаОтчета",,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСтатистикаПоНомерам(Команда)
ОткрытьФорму("Отчет.СтатистикаПоНомерам.Форма.ФормаОтчета", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоЗагрузкеНомеров(Команда)
ОткрытьФорму("Обработка.ОтчетПоЗагрузкеНомеров.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйРезультатОтель(Команда)
ОткрытьФорму("Обработка.ФинансовыйРезультатОтель.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйРезультат(Команда)
ОткрытьФорму("Обработка.ФинансовыйРезультат.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйРезультат_Расширенный(Команда)
ОткрытьФорму("Обработка.ФинансовыйРезультат_Расширенный.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДолгиЗаявки(Команда)
ОткрытьФорму("Обработка.ОтчетДолгиЗаявки.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВыписка(Команда)
ОткрытьФорму("Обработка.ОтчетВыписка.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСМС(Команда)
ОткрытьФорму("Обработка.ОтчетСМС.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура Ф_РаспределениеОплат(Команда)
ОткрытьФорму("Обработка.Ф_РаспределениеОплат.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура РасходМинибар(Команда)
ОткрытьФорму("Отчет.РасходМинибар.Форма.ФормаОтчета", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаКоманла(Команда)
ОткрытьФорму("Обработка.Статистика.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаОплаты(Команда)
ОткрытьФорму("Отчет.СтатистикаОплаты.Форма.ФормаОтчета", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаБронирование(Команда)
ОткрытьФорму("Отчет.СтатистикаБронирования.Форма.ФормаОтчета", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетТрэвелЛайн(Команда)
ОткрытьФорму("Отчет.ОтчетВТрэвелЛайн.Форма.ФормаОтчета", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ПрогнозТурНалог(Команда)
ОткрытьФорму("Обработка.ПрогнозТурНалог.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура ЕжедневныйОтчетФакт(Команда)
ОткрытьФорму("Обработка.ЕжедневныйОтчетФакт.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура ЕжедневныйОтчетФактСводный(Команда)
ОткрытьФорму("Обработка.ЕжедневныйОтчетФактСводный.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

//
&НаКлиенте
Процедура ОтчетГлубинаБронирования(Команда)
ОткрытьФорму("Обработка.ГлубинаБронирования.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура Мероприятия(Команда)
ОткрытьФорму("Справочник.Мероприятия.Форма.ФормаСписка", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ТипыМероприятий(Команда)
ОткрытьФорму("Справочник.ТипМероприятия.ФормаСписка", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

//// - Отчеты

&НаКлиенте
Процедура БезналРаспределение(Команда)
ПараметрыФормы = Новый Структура("КоворкингФорма", 0);
	
ОткрытьФорму("ОбщаяФорма.БезналРаспределение", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура БезналРаспределениеОтель(Команда)
ПараметрыФормы = Новый Структура("КоворкингФорма", 1);
	
ОткрытьФорму("ОбщаяФорма.БезналРаспределение", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

// + Коворкинг 
&НаКлиенте
Процедура КоворкингШахматка(Команда)
ОткрытьФорму("Обработка.КоворкингШахматка.Форма.Форма", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингДокументы(Команда)
ОткрытьФорму("Обработка.КоворкингЗаявкаОбработка.Форма.Форма", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры/////// ++++++++

&НаКлиенте
Процедура КоворкингЗаявки(Команда)
ОткрытьФорму("Документ.КоворкингЗаявка.Форма.ФормаСписка", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингСчета(Команда)
ОткрытьФорму("Документ.КоворкингСчета.Форма.ФормаСписка", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйРезультатКоворкинг(Команда)
ОткрытьФорму("Обработка.ФинансовыйРезультатКоворкинг.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйРезультатКоворкинг_Расширенный(Команда)
ОткрытьФорму("Обработка.ФинансовыйРезультатКоворкинг_Расширенный.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингДопУслуги(Команда)
ОткрытьФорму("Справочник.КоворкингУслуги.ФормаСписка", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингРабочиеМеста(Команда)
ОткрытьФорму("Справочник.КоворкингНомера.ФормаСписка", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

// - Коворкинг 

// + ЭТ
&НаКлиенте
Процедура УправлениеЭТ(Команда)
ОткрытьФорму("ОбщаяФорма.УправлениеЭТ",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

//ОткрытьФорму("ОбщаяФорма.УправлениеЭТерминалом_Новый",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЭТСписок(Команда)
ОткрытьФорму("РегистрСведений.ОперацииЭТ.Форма.ФормаСпискаЭТ",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СверкаИтоговЭТ(Команда)
ОткрытьФорму("ОбщаяФорма.СверкаИтоговЭТ",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СверкиИтоговЭТСписок(Команда)
ПараметрыФормы = Новый Структура;	
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);

ОткрытьФорму("РегистрСведений.ЭТСверкиИтогов.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
// - ЭТ

// + Ценовая политика
&НаКлиенте
Процедура ЦеноваяПолитикаКоманда(Команда)
////	Если ТекПол.Админ тогда                  
Если НастройкиСервер.ЭтоАдминистратор() Тогда 
	ОткрытьФорму("Обработка.КалендарьЦен.Форма.Форма",, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.Независимый);

	иначе
		ПоказатьПредупреждение(,"Нет доступа");
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияЦены(Команда)
//ОткрытьФорму("Документ.ИзменениеЦены.ФормаСписка",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
ОткрытьФорму("Обработка.КалендарьЦен.Форма.ФормаОтчетПоИзменениям");
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеБазовойЦены(Команда)
ОткрытьФорму("Документ.ИзменениеБазовойЦены.ФормаСписка",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура БонШансЦены(Команда)
ОткрытьФорму("РегистрСведений.ЦеныБонШанс.ФормаСписка",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЦеныКонкурентов(Команда)
ОткрытьФорму("Обработка.ЦеныКонкурентов.Форма.Форма",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ЦеныКонкурентовАналитика(Команда)
ОткрытьФорму("Документ.ЦеныКонкурентовАналитика.Форма.ФормаСписка", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
//ОткрытьФорму("Обработка.КалендарьЦенЗаданиеНаЦены.Форма.Форма",, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура Активность(Команда)
ОткрытьФорму("Обработка.АктивностиКалендарь.Форма.Форма",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
// - Ценовая политика


// + Минибар
&НаКлиенте
Процедура МинибарОбработка(Команда)
ОткрытьФорму("Обработка.Минибар.Форма.Форма",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура НомеклатураБара(Команда)
ПараметрыФормы = ПараметрыФормыСправочник();
ОткрытьФорму("Справочник.НоменклатураМиниБара.ФормаСписка", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура МинибарПриход(Команда)
ОткрытьФорму("Документ.МинибарПриход.ФормаСписка",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура МинибарРасход(Команда)
ОткрытьФорму("Документ.МинибарРасход.ФормаСписка",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеОбслуживаниеНомеров(Команда)
ОткрытьФорму("Документ.ГорничныеОбслуживаниеНомера.ФормаСписка",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ТипыСписанийМинибар(Команда)
ОткрытьФорму("Справочник.ТипСписанияМинибар.ФормаСписка",, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура МинибарДолги(Команда)
ОткрытьФорму("Отчет.МинибарДолги.Форма.ФормаОтчета");	
КонецПроцедуры
// - Минибар


// + Закрытие документов
&НаКлиенте
Процедура ЗакрытиеДокументов(Команда)
ОткрытьФорму("Обработка.ЗакрытиеДокументов.Форма.Форма");	
КонецПроцедуры

&НаКлиенте
Процедура СписаниеДолговДопУслуги(Команда)
ОткрытьФорму("Документ.СписаниеДопУслуг.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФинансовогоПериода(Команда)
ОткрытьФорму("Обработка.ЗакрытиеФинансовогоПериода.Форма.Форма");	    
КонецПроцедуры

// - Закрытие документов

&НаКлиенте
Процедура РассылкиWhatsApp_Сайт(Команда)
ОткрытьФорму("Обработка.РассылкаWhatsApp_Сайт.Форма.Форма");	
КонецПроцедуры

&НаКлиенте
Процедура РассылкиWhatsApp_ДеньРождения(Команда)
ОткрытьФорму("Обработка.РассылкаWhatsApp_ДеньРождения.Форма.Форма");	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗарплатаАдминистраторы(Команда)
ОткрытьФорму("Документ.АдминистраторыЗарплата.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура АдминистраторыСправочник(Команда)
ОткрытьФорму("Справочник.Администраторы.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура АдминистраторыТабель(Команда)
ОткрытьФорму("Обработка.АдминистраторыТабель.Форма.Форма");
КонецПроцедуры
//

//
&НаКлиенте
Процедура АдминистраторыЗарплата_Версия(Команда)
ОткрытьФорму("Документ.АдминистраторыЗарплата_Версия.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура АдминистраторыСправочник_Версия(Команда)
ОткрытьФорму("Справочник.Администраторы_Версия.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура АдминистраторыСуммаЗаЗавтраки_Версия(Команда)
ОткрытьФорму("РегистрСведений.АдминистраторыСуммаЗаЗавтраки_Версия.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура АдминистраторыСуммаЗаПроживающих_Версия(Команда)
ОткрытьФорму("РегистрСведений.АдминистраторыСуммаЗаПроживающих_Версия.ФормаСписка");	
КонецПроцедуры
//


&НаКлиенте
Процедура АнкетыГостя(Команда)
Если НастройкиСервер.ЭтоРеноме() ИЛИ НастройкиСервер.ЭтоЧехов() Тогда
	ОткрытьФорму("Документ.АнкетаНовая.ФормаСписка", , ЭтаФорма);
Иначе		
	ОткрытьФорму("Документ.Анкета.ФормаСписка", , ЭтаФорма);
КонецЕсли;	
КонецПроцедуры

////

&НаКлиенте
Процедура БезналРаспределениеКоворкинг(Команда)
ПараметрыФормы = Новый Структура("КоворкингФорма", -1);
ОткрытьФорму("ОбщаяФорма.БезналРаспределение", ПараметрыФормы, ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингОткрытьСмену(Команда)
ДопПараметры = Новый Структура;

//Ответ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
//КассирКоворкинг = Ответ.КоворкингКассир;
КассирКоворкинг = ФУ_Сервер.Кассир(Истина);

ДопПараметры.Вставить("Кассир",КассирКоворкинг);
ДопПараметры.Вставить("КассирИНН","");
ДопПараметры.Вставить("ЭтоКоворкинг",Истина);

ОповещениеЗавершение = Новый ОписаниеОповещения("Завершение_ОткрытиеСменыКоманда", ЭтаФорма);

ФУ_Клиент.ОткрытьСмену(ЭтаФорма, ОповещениеЗавершение, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингЗакрытьСмену(Команда)
	ОчиститьСообщения();

	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросЗакрытиеСменыКоворкинг", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Подтвердите закрытие смены КОВОРКИНГ ...", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросЗакрытиеСменыКоворкинг(Результат, ДопПараметры) Экспорт
Если Результат <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
ДопПараметры = Новый Структура;

//Ответ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
//КассирКоворкинг = Ответ.КоворкингКассир;
КассирКоворкинг = ФУ_Сервер.Кассир(Истина);

ДопПараметры.Вставить("Кассир", КассирКоворкинг);
ДопПараметры.Вставить("КассирИНН","");
ДопПараметры.Вставить("ЭтоКоворкинг",Истина);

ОповещениеЗавершение = Новый ОписаниеОповещения("Завершение_ЗакрытиеСменыКоманда", ЭтаФорма);

ФУ_Клиент.ЗакрытьСмену(ЭтаФорма, ОповещениеЗавершение, ДопПараметры); 
КонецПроцедуры

&НаКлиенте
Процедура БезГашенияКоворкинг(Команда)
ДопПараметры = Новый Структура;

//Ответ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
//КассирКоворкинг = Ответ.КоворкингКассир;
КассирКоворкинг = ФУ_Сервер.Кассир();

ДопПараметры.Вставить("Кассир",КассирКоворкинг);
ДопПараметры.Вставить("КассирИНН","");
ДопПараметры.Вставить("ЭтоКоворкинг",Истина);

ОповещениеЗавершение = Новый ОписаниеОповещения("Завершение_ОтчетБезГашенияКоманда", ЭтаФорма);

ФУ_Клиент.ОтчетБезГашения(ЭтаФорма, ОповещениеЗавершение, ДопПараметры); 
КонецПроцедуры

&НаКлиенте
Процедура КоворкингВозвратОплаты(Команда)
ПараметрыФормы = Новый Структура("ЭтоКоворкинг", Истина);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ЧекВозврат", ЭтаФорма);  

ОткрытьФорму("ОбщаяФорма.ЧекВозврат", ПараметрыФормы, 
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	// Вставить содержимое обработчика.
КонецПроцедуры

//
&НаКлиенте
Процедура КоворкингУправлениеЭТ(Команда)
ПараметрыФормы = Новый Структура("ЭтоКоворкинг", Истина);

ОткрытьФорму("ОбщаяФорма.УправлениеЭТ", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

//ОткрытьФорму("ОбщаяФорма.УправлениеЭТерминалом_Новый", ПараметрыФормы, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингСверкаИтоговЭТ(Команда)
ПараметрыФормы = Новый Структура("ЭтоКоворкинг", Истина);

ОткрытьФорму("ОбщаяФорма.СверкаИтоговЭТ", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
//

&НаКлиенте
Процедура ЧекПроизвольный(Команда)
ОткрытьФорму("ОбщаяФорма.ЧекПроизвольный", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СайтЗаявки(Команда)
ОткрытьФорму("Документ.ЗаявкаСайт.Форма.ФормаСписка");
КонецПроцедуры

//
&НаКлиенте
Процедура ВыгрузкаНДС(Команда)
ОткрытьФорму("Обработка.ВыгрузкаНДС.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДокументыДляСчетовФактур(Команда)
ОткрытьФорму("Обработка.ОтчетДокументыДляСчетовФактур.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура РасчетТурНалога(Команда)
ОткрытьФорму("Обработка.РасчетТурНалога.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

//


&НаКлиенте
Процедура ПолитикаЛояльности(Команда)
ОткрытьФорму("Обработка.ПолитикаЛояльности.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
////






/////// ++++++++++++++++++++++++++++++++++++++++++++++++++++++

&НаКлиенте
Асинх Процедура ЗаполнитьДанныеОрганизацияСДанныхКоворкинг(Команда)
Если НЕ НастройкиСервер.ЭтоСтритАрт() Тогда Возврат; КонецЕсли;
	
Если ТекущаяДата() < '20250101' Тогда 
	ПоказатьПредупреждение(, "НУЖНО ЗАПУСТИТЬ 01 января 2025 г.
			|
			|Перед запуском ЗАКРОЙТЕ кассовые смены");
	
	Сообщить("НУЖНО ЗАПУСТИТЬ 01 января 2025 г.
			|Перед запуском ЗАКРОЙТЕ кассовые смены");
	
	Возврат;
КонецЕсли;

Текст = ДокументыСервер.ПроверитьВозможностьЗаполненияДанныеОрганизацияСДанныхКоворкинг();
Если Текст <> "" Тогда
	ПоказатьПредупреждение(, Текст);
	Сообщить(Текст);
	
	Возврат;
КонецЕсли;

Результат = Ждать ВопросАсинх("Подтвердите заполнение ... " 
	, РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена); 		
	
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ДокументыСервер.ЗаполнитьДанныеОрганизацияСДанныхКоворкинг();

Сообщить("Операция успешно завершена");
КонецПроцедуры

























//ТекКоорд=Новый Структура("Х,У",0,0);
//ПеретН=Новый Структура("Х,У",0,0);
//ПеретК=Новый Структура("Х,У",0,0);

//ТЗШахм=Новый ТаблицаЗначений;
//ТЗШахм.Колонки.Добавить("Х");
//ТЗШахм.Колонки.Добавить("У");
//ТЗШахм.Колонки.Добавить("Клиент");
//ТЗШахм.Колонки.Добавить("Номер");
//ТЗШахм.Колонки.Добавить("Период");
//ТЗШахм.Колонки.Добавить("Документ");

//Ошибка=Истина;
