
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//ЭлементОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

//Поле_компоновки_отбора = Новый ПолеКомпоновкиДанных("НачалоКассовойСмены");
//ЭлементОтбора.ЛевоеЗначение = Поле_компоновки_отбора;

//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
//ЭлементОтбора.ПравоеЗначение = НачалоДня(ТекущаяДата() - 4*86400); 
//ЭлементОтбора.Использование  = Истина; 

Список.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
Если ТекущаяСтрока = Неопределено Тогда Закрыть(); КонецЕсли; 

ТекущиеДанные = Элементы.Список.ТекущиеДанные;
ВыбратьДействие(ТекущаяСтрока, ТекущиеДанные);
КонецПроцедуры
 
&НаКлиенте
Процедура ВыбратьДействие(ТекущаяСтрока, ТекущиеДанные)
Результат = Новый Структура;
//Результат.Вставить("ТекущаяСтрока", ТекущаяСтрока);
Результат.Вставить("НомерСменыККТ", ТекущиеДанные.НомерСменыККТ);
Результат.Вставить("ДатаСменыККТ", ТекущиеДанные.ДатаСменыККТ);
Результат.Вставить("НачалоКассовойСмены", ТекущиеДанные.НачалоКассовойСмены);
Результат.Вставить("ОкончаниеКассовойСмены", ТекущиеДанные.ОкончаниеКассовойСмены);

Закрыть(Результат); 
КонецПроцедуры   

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если ВыбраннаяСтрока = Неопределено ТОгда Возврат; КонецЕсли;	
	
СтандартнаяОбработка = Ложь;
ВыбратьДействие(ВыбраннаяСтрока, Элемент.ТекущиеДанные)
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
Список.Параметры.УстановитьЗначениеПараметра("Организация", Организация); 	
	// Вставить содержимое обработчика.
КонецПроцедуры

