
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Ложь);
КонецПроцедуры

 //
&НаКлиенте
Процедура ПриОткрытии(Отказ)
Элементы.ЦветНомера.ЦветФона = Новый Цвет(Объект.ЦветНомераR, Объект.ЦветНомераG, Объект.ЦветНомераB);
Элементы.ЦветНомера.ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Элементы.ЦветНомера.ЦветФона);

НастройкаФормы();
КонецПроцедуры

 &НаКлиенте
Процедура НастройкаФормы()
ПоказатьХостел = НастройкиСервер.ЭтоЛайв(); 
//ПоказатьКоворкинг = ОбщийМодульНастройки.ЭтоЛайв(); 

Элементы.ГруппаХостел.Видимость = ПоказатьХостел; 
//Элементы.Коворкинг.Видимость = ПоказатьКоворкинг; 
КонецПроцедуры
 //
 
&НаКлиенте
Процедура ЦветНомера(Команда)
ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
 Оповещение = Новый ОписаниеОповещения("ОповещениеВыборЦветаЗавершение", ЭтотОбъект);
 ДиалогВыбораЦвета.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыборЦветаЗавершение(Результат, ДополнительныеПараметры) Экспорт
Если НЕ Результат = Неопределено Тогда
	Элементы.ЦветНомера.ЦветФона = Результат; 

	АбсолютныйЦвет =  ОбщийФункционалСервер.ПолучитьАбсолютныйЦвет(Элементы.ЦветНомера.ЦветФона);
	Объект.ЦветНомераB=АбсолютныйЦвет.Синий;
	Объект.ЦветНомераG=АбсолютныйЦвет.Зеленый;
	Объект.ЦветНомераR=АбсолютныйЦвет.Красный;
	
	Элементы.ЦветНомера.ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(АбсолютныйЦвет);
	
КонецЕсли;
КонецПроцедуры
//






