
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
УстановитьПользовательскийОтборДинамическогоСписка(Список, "НомерКарты", "", ВидСравненияКомпоновкиДанных.Содержит
	, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, Ложь);
	
УстановитьПользовательскийОтборДинамическогоСписка(Список, "СуммаОперации", 0, ВидСравненияКомпоновкиДанных.Равно
	, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, Ложь);
	
УстановитьПользовательскийОтборДинамическогоСписка(Список, "КассовыйЧек", Истина, ВидСравненияКомпоновкиДанных.Равно
	, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, Ложь);
	
Если НЕ НастройкиСервер.ЭтоАдминистратор() Тогда
	ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторУстройстваНаименование");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
	ЭлементОтбора.ПравоеЗначение = "Эмулятор";
	
	ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторУстройстваНаименование");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = "";	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля, Значение, ВидСравнения, РежимОтображения, Использование)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				 Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НовыйЭлементОтбора = Неопределено Тогда
			НовыйЭлементОтбора = ПользовательскийОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
		
		НовыйЭлементОтбора.ВидСравнения = ВидСравнения;
		НовыйЭлементОтбора.Использование = Использование;
		//НовыйЭлементОтбора.Использование = Истина;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		НовыйЭлементОтбора.РежимОтображения = РежимОтображения;
		НовыйЭлементОтбора.ПравоеЗначение = Значение;
		
		НовыйЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СброситьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				 Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НовыйЭлементОтбора = Неопределено Тогда Возврат; КонецЕсли;
		ПользовательскийОтбор.Удалить(НовыйЭлементОтбора);
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры



