//// + Счета
Процедура ДобавитьСчет(Форма, ОповещениеПриЗакрытии, КоворкингЗаявкаОбъект) Экспорт
Если КоворкингЗаявкаОбъект.ПочасоваяОплата Тогда
	ДобавитьСчетЧасы(Форма, ОповещениеПриЗакрытии, КоворкингЗаявкаОбъект);
Иначе
	ДобавитьСчетДни(Форма, ОповещениеПриЗакрытии, КоворкингЗаявкаОбъект)
КонецЕсли;		
КонецПроцедуры

Функция ДобавитьСчетЧасы(Форма, ОповещениеПриЗакрытии, КоворкингЗаявкаОбъект) Экспорт
ПараметрыФорма = Новый Структура("КоворкингЗаявка", КоворкингЗаявкаОбъект.Ссылка); 	
	
//ФормаСчет = ПолучитьФорму("Документ.КоворкингСчета.Форма.ФормаДокумента", ПараметрыФорма, Форма);
ФормаСчет = ОткрытьФорму("Документ.КоворкингСчета.Форма.ФормаДокумента", ПараметрыФорма, Форма
	,,,, ОповещениеПриЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
ДатаС = КоворкингСервер.СледующийСчетДатаС(КоворкингЗаявкаОбъект); 

ДатаПо = СчетДатаПо(ДатаС, КоворкингЗаявкаОбъект.ПериодАренды);
Если ДатаПо = Неопределено Тогда Возврат Неопределено; КонецЕсли; 
//

СчетОбъект = ФормаСчет.Объект; 
	
//СчетОбъект = Документы.КоворкингСчета.СоздатьДокумент();
//СчетОбъект = Неопределено;
//СчетОбъект.СчетГУИД = Новый УникальныйИдентификатор();

СчетОбъект.Дата = ТекущаяДата();
СчетОбъект.КоворкингЗаявка = КоворкингЗаявкаОбъект.Ссылка;      

Если ЗначениеЗаполнено(КоворкингЗаявкаОбъект.Оплачивает) Тогда
	СчетОбъект.ОплачиваетСчет = КоворкингЗаявкаОбъект.Оплачивает; 
Иначе
	СчетОбъект.ОплачиваетСчет = КоворкингЗаявкаОбъект.Клиент; 
КонецЕсли;

СчетОбъект.ПочасоваяОплата = Истина;

СледующийСчетДатаС = КоворкингСервер.СледующийСчетДатаС(КоворкингЗаявкаОбъект.Ссылка);
СчетОбъект.ДатаС = СледующийСчетДатаС;
СчетОбъект.ДатаПо = СчетОбъект.ДатаС;

СчетОбъект.ЧасС = КоворкингЗаявкаОбъект.ЧасС;
СчетОбъект.ЧасПо = КоворкингЗаявкаОбъект.ЧасПо;

//СрокиАренды = СчетОбъект.СрокиАренды;
//ЗаполнитьСрокиАренды(СрокиАренды, ДатаС, ДатаПо, КоворкингЗаявкаОбъект.ВключатьВыходные);

//СчетОбъект.Количество = СрокиАренды.Количество();
СчетОбъект.КоличествоЕдиниц = КоворкингЗаявкаОбъект.ЧасПо - КоворкингЗаявкаОбъект.ЧасС;
СчетОбъект.Количество = СчетОбъект.КоличествоЕдиниц;

СчетОбъект.Цена = КоворкингЗаявкаОбъект.Цена;
СчетОбъект.Сумма = СчетОбъект.Цена * СчетОбъект.Количество;

//СчетОбъект.ВключатьВыходные = КоворкингЗаявкаОбъект.ВключатьВыходные;

//СчетОбъект.Записать(РежимЗаписиДокумента.Проведение); 

//Возврат СчетОбъект.Ссылка;
КонецФункции

Функция ДобавитьСчетДни(Форма, ОповещениеПриЗакрытии, КоворкингЗаявкаОбъект) Экспорт
ПараметрыФорма = Новый Структура("КоворкингЗаявка", КоворкингЗаявкаОбъект.Ссылка); 	
	
//ФормаСчет = ПолучитьФорму("Документ.КоворкингСчета.Форма.ФормаДокумента", ПараметрыФорма, Форма);
ФормаСчет = ОткрытьФорму("Документ.КоворкингСчета.Форма.ФормаДокумента", ПараметрыФорма, Форма
	,,,, ОповещениеПриЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
ДатаС = КоворкингСервер.СледующийСчетДатаС(КоворкингЗаявкаОбъект); 

ДатаПо = СчетДатаПо(ДатаС, КоворкингЗаявкаОбъект.ПериодАренды);
Если ДатаПо = Неопределено Тогда Возврат Неопределено; КонецЕсли; 
//

СчетОбъект = ФормаСчет.Объект; 

//СчетОбъект = Документы.КоворкингСчета.СоздатьДокумент();
//СчетОбъект.СчетГУИД = Новый УникальныйИдентификатор();

СчетОбъект.Дата = ТекущаяДата();
СчетОбъект.КоворкингЗаявка = КоворкингЗаявкаОбъект.Ссылка;      

Если ЗначениеЗаполнено(КоворкингЗаявкаОбъект.Оплачивает) Тогда
	СчетОбъект.ОплачиваетСчет = КоворкингЗаявкаОбъект.Оплачивает; 
Иначе
	СчетОбъект.ОплачиваетСчет = КоворкингЗаявкаОбъект.Клиент; 
КонецЕсли;

СчетОбъект.ПочасоваяОплата = Ложь;

СчетОбъект.ДатаС = ДатаС;
СчетОбъект.ДатаПо = ДатаПо;

//СрокиАренды = СчетОбъект.СрокиАренды;
//ЗаполнитьСрокиАренды(СрокиАренды, ДатаС, ДатаПо, КоворкингЗаявкаОбъект.ВключатьВыходные);
//ЗаполнитьСрокиАренды(СрокиАренды, ДатаС, ДатаПо);
//СчетОбъект.КоличествоЕдиниц = СрокиАренды.Количество();

//РазницаВДнях = РазницаВДнях(СчетОбъект.ДатаС, СчетОбъект.ДатаПо, КоворкингЗаявкаОбъект.ВключатьВыходные);	
РазницаВДнях = (НачалоДня(СчетОбъект.ДатаПо) - НачалоДня(СчетОбъект.ДатаС)) / (60 * 60 * 24) + 1;	
СчетОбъект.КоличествоЕдиниц = РазницаВДнях;

СчетОбъект.Цена = КоворкингЗаявкаОбъект.Цена;

//РазницаВДнях = РазницаВДнях(СчетОбъект.ДатаС, СчетОбъект.ДатаПо, КоворкингЗаявкаОбъект.ВключатьВыходные);	
Если КоворкингЗаявкаОбъект.ПериодАренды = "МЕСЯЦ" Тогда
	//ДлинаМесяца = РазницаВДнях(НачалоДня(НачалоМесяца(СчетОбъект.ДатаПо)), НачалоДня(КонецМесяца(СчетОбъект.ДатаС))
	//	, КоворкингЗаявкаОбъект.ВключатьВыходные); 
	//
	//СчетОбъект.Количество = РазницаВДнях/ДлинаМесяца;
	
	СчетОбъект.Количество = 1;
ИначеЕсли КоворкингЗаявкаОбъект.ПериодАренды = "НЕДЕЛЯ" Тогда
	//Если КоворкингЗаявкаОбъект.ВключатьВыходные Тогда
	//	ДлинаНедели = 7;
	//Иначе
	//	ДлинаНедели = 5;
	//КонецЕсли;
	//СчетОбъект.Количество = РазницаВДнях / ДлинаНедели;

	СчетОбъект.Количество = 1;
ИначеЕсли КоворкингЗаявкаОбъект.ПериодАренды = "ДЕНЬ" Тогда
	СчетОбъект.Количество = 1;
Иначе
	Возврат Неопределено;
КонецЕсли;
СчетОбъект.Сумма = СчетОбъект.Цена * СчетОбъект.Количество;

//СчетОбъект.ВключатьВыходные = КоворкингЗаявкаОбъект.ВключатьВыходные;

//СчетОбъект.Записать(РежимЗаписиДокумента.Проведение);

//Возврат СчетОбъект.Ссылка;
КонецФункции

Функция СчетДатаПо(ДатаС, ПериодАренды) Экспорт
Если ПериодАренды = "МЕСЯЦ" Тогда
	День = День(ДатаС);
	
	Месяц = Месяц(ДатаС);
	Год = Год(ДатаС);
	
	Если День > 1 Тогда
		Месяц = Месяц + 1;
	КонецЕсли;
	
	Если Месяц > 12 Тогда
		Месяц = 1;
		Год = Год + 1;
	КонецЕсли;
	
    // + Аудит
	//Дата_П = Дата(Год, Месяц, День);
	Попытка 	
		День_П = День;
		Дата_П = Дата(Год, Месяц, День_П);
	Исключение
		Попытка 	
			День_П = День - 1;
			Дата_П = Дата(Год, Месяц, День_П);
		Исключение
			Попытка 	
				День_П = День - 2;
				Дата_П = Дата(Год, Месяц, День_П);
			Исключение
				День_П = День - 3;
				Дата_П = Дата(Год, Месяц, День_П);
			КонецПопытки;
		КонецПопытки;
	КонецПопытки;
    // - Аудит

	Если День = 1 Тогда
		Дата_П = КонецМесяца(Дата_П);
	Иначе
		Дата_П = Дата_П - 86400; 
	КонецЕсли;
	
	ДатаПо = Дата_П;
	
	//ДатаПо = КонецМесяца(ДатаС);
	//Если НЕ КоворкингЗаявкаОбъект.ВключатьВыходные Тогда
	//	ДатаПо = РабочийДень(ДатаПо, Истина);
	//КонецЕсли;
ИначеЕсли ПериодАренды = "НЕДЕЛЯ" Тогда
	
	ДатаПо = ДатаС + 6*86400;
	
	//Если КоворкингЗаявкаОбъект.ВключатьВыходные Тогда
	//	ДатаПо = КонецНедели(ДатаС);
	//	ДатаПо = ДатаПо + 7*86400;
	//Иначе
	//	ДатаПо = КонецНедели(ДатаС);
	//	ДатаПо = ДатаПо - 2*86400;
	//КонецЕсли;

ИначеЕсли ПериодАренды = "ДЕНЬ" Тогда
	ДатаПо = НачалоДня(ДатаС);
ИначеЕсли ПериодАренды = "ЧАС" Тогда
	ДатаПо = НачалоДня(ДатаС);
Иначе	
	Возврат Неопределено;
КонецЕсли;	

Возврат ДатаПо; 
КонецФункции	

Процедура ЗаполнитьСрокиАренды(СрокиАренды, ДатаС, ДатаПо) Экспорт
СрокиАренды.Очистить();
Дата_П = ДатаС;
Пока Дата_П <= ДатаПо Цикл
	НоваяСтрока = СрокиАренды.Добавить(); 
	НоваяСтрока.СрокАренды = Дата_П;
	
	Дата_П = Дата_П + 86400;
КонецЦикла;
КонецПроцедуры 

// + ВключатьВыходные Не используется
Процедура ЗаполнитьСрокиАрендыВключатьВыходные(СрокиАренды, ДатаС, ДатаПо, ВключатьВыходные) Экспорт
СрокиАренды.Очистить();
Дата_П = ДатаС;
Пока Дата_П <= ДатаПо Цикл
	Если НЕ ВключатьВыходные Тогда 
		Если ДеньНедели(Дата_П) > 5 Тогда Перейти ~Продолжение; КонецЕсли;
	КонецЕсли;	
	
	НоваяСтрока = СрокиАренды.Добавить(); 
	НоваяСтрока.СрокАренды = Дата_П;
	
~Продолжение:	
	Дата_П = Дата_П + 86400;
КонецЦикла;
КонецПроцедуры 

Функция РазницаВДняхВключатьВыходные(ДатаС, ДатаПо, ВключатьВыходные)
Если ВключатьВыходные Тогда
	РазницаВДнях = (НачалоДня(ДатаПо) - НачалоДня(ДатаС)) / (60 * 60 * 24) + 1;	
Иначе
	РазницаВДнях = 0;
	Дата_П = ДатаС;
	Пока Дата_П <= ДатаПо Цикл
		Если ЭтоРабочийДень(Дата_П) Тогда 
		   РазницаВДнях = РазницаВДнях + 1;
		КонецЕсли;	
		Дата_П = Дата_П + 86400;	
	КонецЦикла;
КонецЕсли;
	
Возврат РазницаВДнях;	
КонецФункции

Функция ЭтоРабочийДень(Дата)
ДеньНедели = ДеньНедели(Дата);

Остаток = ДеньНедели - 5;
ЭтоРабочийДень = (Остаток <= 0); 
Возврат ЭтоРабочийДень;
КонецФункции

Функция РабочийДень(Дата, ПредыдущийДень) 
ДеньНедели = ДеньНедели(Дата);

Остаток = ДеньНедели - 5;
Если Остаток <= 0 Тогда Возврат Дата; КонецЕсли;

Если ПредыдущийДень Тогда
	РабочийДень = Дата - Остаток*86400; 	
Иначе
	Если Остаток = 2 Тогда
		Остаток = 1;
	Иначе 
		Остаток = 2;
	КонецЕсли;	
	
	РабочийДень = Дата + Остаток*86400; 	
КонецЕсли;	
Возврат РабочийДень;	
КонецФункции
// - ВключатьВыходные Не используется
//// - Счета


// + Заявки
Функция ПроверкаУдаленияЗаявки(Заявка) Экспорт
Если КоворкингСервер.ЕстьКоворкингСчета(Заявка) Тогда	
	ПоказатьПредупреждение(,"Есть Счета.
	|
	|УДАЛЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции
// - Заявки


// + Счета
Функция ПроверкаУдаленияСчета(Счет) Экспорт
Если КоворкингСервер.ЕстьОплатыСчет(Счет) Тогда	
	ПоказатьПредупреждение(,"Есть оплаты счета.
	|
	|УДАЛЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции
// - Счета



////// ++++++++++++++++++++++++

//// + Неиспользуется

// + Удаление Счета
Процедура СчетаПередУдалением(КоворкингЗаявка, СчетСсылка, Счета) Экспорт
Если КоворкингСервер.ЕстьОплатыСчет(КоворкингЗаявка) Тогда
	ПоказатьПредупреждение(, "Есть оплата Счета.
	| 
	|УДАЛЕНИЕ НЕ РАЗРЕШЕНО ..."); 
	
	Возврат;
КонецЕсли;

ДопПараметры = Новый Структура;
ДопПараметры.Вставить("СчетСсылка", СчетСсылка);
ДопПараметры.Вставить("Счета", Счета);

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдалениеСчета", ЭтотОбъект, ДопПараметры);

ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ...", РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

Процедура ЗавершениеВопросаПодтвердитеУдалениеСчета(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

СчетСсылка = ДополнительныеПараметры.СчетСсылка;
КоворкингСервер.УдалитьСчет(СчетСсылка);

Счета = ДополнительныеПараметры.Счета;
ОтборСтроки = Новый Структура("СчетСсылка", СчетСсылка); 
НайденныеСтроки = Счета.НайтиСтроки(ОтборСтроки);
ТД = НайденныеСтроки[0];
Счета.Удалить(ТД);
КонецПроцедуры	
// - Удаление Счета

//// - Неиспользуется

