/////// Не доделано Исходный

//Перем ПеретН,ПеретК,ТекКоорд,ТЗШахм,Ошибка;

&НаКлиенте
Процедура УстановитьНачальныеЗначения()
ТекКоорд=Новый Структура("Х,У",0,0);
ПеретН=Новый Структура("Х,У",0,0);
ПеретК=Новый Структура("Х,У",0,0);
Ошибка=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
УстановитьНачальныеЗначения()
КонецПроцедуры

//
&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
	// Вставить содержимое обработчика.
	//ВывестиШахматку(НачалоЧаса(ПериодС),НачалоЧаса(ПериодПо),?(Детализация=0,"День","Час"));
	
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
ВывестиШахматку(НачалоЧаса(Отчет.ПериодС),НачалоЧаса(Отчет.ПериодПо),?(Детализация=0,"День","Час"));
КонецПроцедуры
//

// Ошибки
&НаСервере
Функция ВывестиШахматку(ДатаС,ДатаПо,ДетализацияСтрока)
	ТЗШахм.Очистить();
	ДатаС=?(ДетализацияСтрока="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
// + ПСН
	ДатаПо=?(ДетализацияСтрока="День",КонецДня(ДатаПо),КонецДня(ДатаПо));
// - ПСН
	Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	ЗанятостьНомеров.Клиент
		                    |ИЗ
		                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
		                    |ГДЕ
		                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
		                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
							
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
    ТЗКлиентов=Запрос.Выполнить().Выгрузить();
	ТЗКлиентов.Колонки.Добавить("Цвет");
    Сч=0;
	////СписокЦветов=Новый СписокЗначений;
	Для каждого Клиент Из ТЗКлиентов Цикл		
		Случай=Новый ГенераторСлучайныхЧисел();
		СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
		СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
		СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
		НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
		Если ТЗКлиентов.Найти(НовЦвет,"Цвет")<>Неопределено тогда
			Случай=Новый ГенераторСлучайныхЧисел();
			СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
			СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
			СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
			НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
		КонецЕсли;
		Клиент.Цвет=НовЦвет;
	
	КонецЦикла; 
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗанятостьНомеров.Номер,
	                    |	ЗанятостьНомеров.Клиент,
	                    |	ЗанятостьНомеров.ПериодРезерва
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	                    |	И ЗанятостьНомеров.Номер = &Номер
	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
						
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
////	ТЗЗапроса=Запрос.Выполнить().Выгрузить();

	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();

	ТемпС=ДатаС;
	ТемпПо=ДатаПо;
	
	//Макет=ПолучитьМакет("Макет");
	Макет = Отчеты.Шахматка.ПолучитьМакет("Макет");
	
	ТабДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
	ТабДок.Присоединить(Обл);
	
	Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");
	Пока ТемпС<=ТемпПо цикл
		Обл.Параметры.Период=Формат(ТемпС, ?(ДетализацияСтрока="День","ДФ='dd.MM'","ДФ='dd.MM HH:mm'"));
		ТабДок.Присоединить(Обл);
		ТемпС=ТемпС+?(ДетализацияСтрока="День",86400,3600*6);
	КонецЦикла;
	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТабДок);
	ПолеОтчета.Вывести(ТабДок);
	
	СпрНомеров=Справочники.НомернойФонд.Выбрать();
	Х=0;
	У=0;
	
	Пока СпрНомеров.Следующий() цикл

		У=У+1;

		ТабДок=Новый ТабличныйДокумент;
        ТемпС=ДатаС;
		ТемпПо=ДатаПо;

		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
		Обл.Параметры.Номер=СпрНомеров.Наименование;
		ТабДок.Присоединить(Обл);
        ТемпКл=Справочники.Клиенты.ПустаяСсылка();
		СписОб=Новый СписокЗначений;
		Сч=1;
		НачИ=2;	
		Пока ТемпС<=ТемпПо цикл
			Х=Х+1;			
			
			ПС=?(ДетализацияСтрока="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			ПК=?(ДетализацияСтрока="День",КонецДня(ТемпС),КонецЧаса(ТемпС));
			
			Запрос.УстановитьПараметр("ДатаС",ПС);						
			Запрос.УстановитьПараметр("ДатаПо",ПК);
			Запрос.УстановитьПараметр("Номер",СпрНомеров.Ссылка);
			ТЗЗапроса=Запрос.Выполнить().Выгрузить();
			Обл=Макет.ПолучитьОбласть("Строка|СтрПериод");
			
			Если ТЗЗапроса.Количество()<>0 тогда
				Цв=ТЗКлиентов.Найти(ТЗЗапроса[0].Клиент,"Клиент").Цвет;
				ТекКл=ТЗЗапроса[0].Клиент;
				Обл.Область(1,1,1,1).ЦветФона=Цв;
// + ПСН Цвет текста				
		ЦвТекста= ОбщийФункционалСервер.ЦветТекстаПоЦветуФона(Цв);
		Обл.Область(1,1,1,1).ЦветТекста = ЦвТекста;
// - ПСН Цвет текста				
				Обл.Параметры.Период=ТекКл.Наименование;
				НовШ=ТЗШахм.Добавить();
				НовШ.Х=Х;
				НовШ.У=У;
				НовШ.Клиент=ТекКл;
				НовШ.Номер=СпрНомеров.Ссылка;
				
				НовШ.Период=?(ДетализацияСтрока="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			иначе
				ТекКл=Справочники.Клиенты.ПустаяСсылка();			
			конецесли;
			
			Если ТекКл<>ТемпКл тогда
				
					НовОб=новый Структура("Нач,Кон",НачИ,сч);
					СписОб.Добавить(НовОб);
					ТемпКл=ТекКл;
					НачИ=Сч+1;
				
			конецесли;
			
			ТабДок.Присоединить(Обл);
			
			ТемпС=ТемпС+?(ДетализацияСтрока="День",86400,3600*6);
			
			сч=сч+1;
		КонецЦикла;
			НовОб=новый Структура("Нач,Кон",НачИ,сч);
			СписОб.Добавить(НовОб);

		Для каждого Об Из СписОб Цикл
			ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
		КонецЦикла; 
		
		//ЭлементыФормы.ПолеОтчета.Вывести(ТабДок);
		ПолеОтчета.Вывести(ТабДок);

	КонецЦикла;
	
	

	//ЭлементыФормы.ПолеОтчета.ФиксацияСлева=1;
	ПолеОтчета.ФиксацияСлева=1;
	//ТЗЗапроса
КонецФункции

&НаКлиенте
Процедура ПолеОтчетаНачалоПеретаскивания___(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
//	СтандартнаяОбработка=НЕ Ошибка;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
////	СтандартнаяОбработка=НЕ Ошибка;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПроверкаПеретаскивания___(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	//
	//Если ТекКоорд.Х=0 и ТекКоорд.У=0 тогда //начало перетаскивания
	//	Структ=ОпределитьПоКоординатам(Область.Лево-1,Область.Верх-2);
	//	Если Структ.Клиент=Справочники.Клиенты.ПустаяСсылка() тогда // неоттуда тащим!!
	//		СтандартнаяОбработка=Истина;
	//		//Сообщить("Ай ай ай!");
	//		Ошибка=Истина;
	//	иначе
	//		Ошибка=Ложь;
	//		ПеретН.Х=Область.Лево;
	//		ПеретН.У=Область.Верх;
	//	конецесли;
	//конецесли;
	//Если СтандартнаяОбработка тогда
	//    ТекКоорд.Х=Область.Лево;
	//	ТекКоорд.У=Область.Верх;	
	//конецесли;
	//
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	Если ТекКоорд.Х=0 и ТекКоорд.У=0 тогда //начало перетаскивания
		Структ=ОпределитьПоКоординатам(Область.Лево-1,Область.Верх-2);
		Если Структ.Клиент = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка") тогда // неоттуда тащим!!
			СтандартнаяОбработка=Истина;
			////Сообщить("Ай ай ай!");
			Ошибка=Истина;
		иначе
			Ошибка=Ложь;
			ПеретН.Х=Область.Лево;
			ПеретН.У=Область.Верх;
		конецесли;
	конецесли;
	Если СтандартнаяОбработка тогда
	    ТекКоорд.Х=Область.Лево;
		ТекКоорд.У=Область.Верх;	
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаОкончаниеПеретаскивания___(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
//	ПеретК.Х=ТекКоорд.Х;
//	ПеретК.У=ТекКоорд.У;
//    ТекКоорд.Х=0;
//	ТекКоорд.У=0;
//	
////	Сообщить("Перетаскивание с точки с координатами " + Строка(ПеретН.Х)+":"+Строка(ПеретН.У)+ " в точку с координатами " + Строка(ПеретК.Х)+":"+Строка(ПеретК.У));
	
КонецПроцедуры


&НаКлиенте
Процедура ПолеОтчетаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	ПеретК.Х=ТекКоорд.Х;
	ПеретК.У=ТекКоорд.У;
    ТекКоорд.Х=0;
	ТекКоорд.У=0;
	
////	Сообщить("Перетаскивание с точки с координатами " + Строка(ПеретН.Х)+":"+Строка(ПеретН.У)+ " в точку с координатами " + Строка(ПеретК.Х)+":"+Строка(ПеретК.У));
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПеретаскивание___(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	//СтандартнаяОбработка=НЕ Ошибка;		
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	СтандартнаяОбработка=НЕ Ошибка;		
КонецПроцедуры

&НаКлиенте
Функция ОпределитьПоКоординатам(х,у)
	Отбор=Новый Структура("Х,У",Х,У);
	Стр=ТЗШахм.НайтиСтроки(Отбор);
	ВозврСтр=Новый Структура("Клиент,Номер,Период"
		,ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка")
		,ПредопределенноеЗначение("Справочник.НомернойФонд.ПустаяСсылка")
		,ТекущаяДата());
	Если Стр.Количество()=0 тогда
		Возврат ВозврСтр;
	иначе
		ВозврСтр.Клиент=Стр[0].Клиент;
		ВозврСтр.Номер=Стр[0].Номер;
		ВозврСтр.Период=Стр[0].Период;
		Возврат ВозврСтр;
	КонецЕсли;
КонецФункции





//ТекКоорд=Новый Структура("Х,У",0,0);
//ПеретН=Новый Структура("Х,У",0,0);
//ПеретК=Новый Структура("Х,У",0,0);

//ТЗШахм=Новый ТаблицаЗначений;
//ТЗШахм.Колонки.Добавить("Х");
//ТЗШахм.Колонки.Добавить("У");
//ТЗШахм.Колонки.Добавить("Клиент");
//ТЗШахм.Колонки.Добавить("Номер");
//ТЗШахм.Колонки.Добавить("Период");

//Ошибка=Истина;
