

&НаКлиенте
Асинх Процедура Объединить(Команда)
обещание = ВопросАсинх("Объединить ?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
Результат = Ждать обещание; // тут выполнение остановится пока пользователь не ответит на вопрос

Если Результат = КодВозвратаДиалога.Да Тогда
	ОбъединитьНаСервере();
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ЗадатьВопросАсинх()

	обещание = ВопросАсинх(НСтр("ru='Купить слона?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Результат = Ждать обещание; // тут выполнение остановится пока пользователь не ответит на вопрос
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		текст = НСтр("ru='Ответ утвержительный!'");
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда 
		текст = НСтр("ru='Ответ отрицательный!'");
	Иначе
		текст = НСтр("ru='Ответ не получен!'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбъединитьНаСервере()
//НачатьТранзакцию();
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты
                      |ГДЕ
                      |	Клиенты.Менеджер = &Менеджер");

Запрос.УстановитьПараметр("Менеджер", КогоОбъединяем);
ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Объект_П = Строка.Ссылка.ПолучитьОбъект();
	Объект_П.Менеджер = С_КемОбъединяем;
	
	Объект_П.Записать();
КонецЦикла;
Сообщить("Клиенты:" + ТЗ.Количество()); 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Администраторы.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.Администраторы КАК Администраторы
                      |ГДЕ
                      |	Администраторы.Пользователь = &Пользователь");

Запрос.УстановитьПараметр("Пользователь", КогоОбъединяем);
ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Объект_П = Строка.Ссылка.ПолучитьОбъект();
	Объект_П.Пользователь = С_КемОбъединяем;
	
	Объект_П.Записать();
КонецЦикла;
Сообщить("Администраторы:" + ТЗ.Количество()); 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	БазовыеЦены.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.БазовыеЦены КАК БазовыеЦены
                      |ГДЕ
                      |	БазовыеЦены.Автор = &Автор");

Запрос.УстановитьПараметр("Автор", КогоОбъединяем);
ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Объект_П = Строка.Ссылка.ПолучитьОбъект();
	Объект_П.Автор = С_КемОбъединяем;
	
	Объект_П.Записать();
КонецЦикла;
Сообщить("БазовыеЦены:" + ТЗ.Количество());

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.АвторЗаявки = &АвторЗаявки");

Запрос.УстановитьПараметр("АвторЗаявки", КогоОбъединяем);
ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Объект_П = Строка.Ссылка.ПолучитьОбъект();
	Объект_П.АвторЗаявки = С_КемОбъединяем;
	
	ЗабытыеВещи = Объект_П.ЗабытыеВещи;
	ОтборСтроки = Новый Структура("КтоОтдал", КогоОбъединяем);
	НайденныеСтроки = ЗабытыеВещи.НайтиСтроки(ОтборСтроки);
	Для Каждого СтрокаЗабытыеВещи Из НайденныеСтроки Цикл
		СтрокаЗабытыеВещи.КтоОтдал = С_КемОбъединяем;
	КонецЦикла;
	
	Попытка 
		Если Объект_П.ПометкаУдаления Тогда
			Объект_П.Записать(РежимЗаписиДокумента.Запись);
		Иначе
			Объект_П.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Исключение
		Сообщить("Ошибка проведения Документа: " + Строка.Ссылка);
		Объект_П.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;	
КонецЦикла;
Сообщить("ЗаявкаНаБронирование:" + ТЗ.Количество());

Объект_П = КогоОбъединяем.ПолучитьОбъект();

Объект_П.УстановитьПометкуУдаления(Истина);

//ОтменитьТранзакцию();
КонецПроцедуры
