
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//ЭтаФорма.ВладелецФормы.Родитель
Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
	Если ЭтаФорма.ВладелецФормы.Родитель <> Неопределено Тогда  
		ДатаС_С = ЭтаФорма.ВладелецФормы.Родитель.ДатаС_С;
		ДатаС_По = ЭтаФорма.ВладелецФормы.Родитель.ДатаС_По;
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверкаДат()
Если НЕ ЗначениеЗаполнено(Объект.ДатаС)
ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаПо)
Тогда Возврат Истина; КонецЕсли;

Возврат Ложь; 	
КонецФункции	

&НаКлиенте
Асинх Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Если ПроверкаДат() Тогда  
	ПоказатьПредупреждение(, "Дата - пусто
	|
	|ЗАПИСЬ ОТМЕНЯЕТСЯ ...");
	
	
	Отказ = Истина;
	Возврат;
КонецЕсли;	

Если ЗначениеЗаполнено(ДатаС_С) Тогда
	Если Объект.ДатаС > ДатаС_С
	ИЛИ Объект.ДатаС < ДатаС_С
	Тогда
	    Текст = "ВНИМАНИЕ !!! Дата с > Даты С отбора
			|
			|ПОДТВЕРДИТЕ ...";
		
		обещание = ВопросАсинх(Текст, РежимДиалогаВопрос.ОКОтмена);
		Результат = Ждать обещание; // тут выполнение остановится пока пользователь не ответит на вопрос
		Если Результат = КодВозвратаДиалога.Отмена Тогда 
			Отказ = Истина;
			
			Возврат;
		КонецЕсли;
	
		ПоказатьПредупреждение(, "ВНИМАНИЕ !!! Дата с > Даты С отбора
			|
			|Чтобы увидеть мероприятие в списке измените дату отбора");
	КонецЕсли;	
КонецЕсли;	
КонецПроцедуры



