&НаКлиенте
Процедура ПриОткрытии__()
	//ДТ=НачалоДня(ТекущаяДата()-86400);
	//КнопкаВыполнитьНажатие(Неопределено);
	//
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если Параметры.Свойство("ЗавершитьРаботу") Тогда	
	 ЗавершитьРаботу = Параметры.ЗавершитьРаботу;
Иначе
	 ЗавершитьРаботу = Ложь;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ДТ=НачалоДня(ТекущаяДата()-86400);
//	КнопкаВыполнитьНажатие(Неопределено);
	ВыполнитьКомандаНаСервере();
	 
Если ЗавершитьРаботу Тогда
	Отказ = Истина;	
КонецЕсли;
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие__(Кнопка)
//ЗапросКассы=Новый Запрос("ВЫБРАТЬ
//                         |	СУММА(ВЫБОР
//                         |			КОГДА КассовыйДокумент.Приход
//                         |				ТОГДА КассовыйДокумент.Сумма
//                         |			ИНАЧЕ КассовыйДокумент.Сумма * -1
//                         |		КОНЕЦ) КАК Сумма
//                         |ИЗ
//                         |	Документ.КассовыйДокумент КАК КассовыйДокумент
//                         |ГДЕ
//                         |	НАЧАЛОПЕРИОДА(КассовыйДокумент.Дата, ДЕНЬ) = &Дата
//                         |	И КассовыйДокумент.КредитнаяКарта = &КредитнаяКарта");
//ЗапросКассы.УстановитьПараметр("Дата",НачалоДня(ДТ));

//ТекстДок=Новый ТекстовыйДокумент;
//ЗапросКассы.УстановитьПараметр("КредитнаяКарта",Истина);
//ТЗКассы=ЗапросКассы.Выполнить().Выгрузить();
//ТекстДок.ДобавитьСтроку(?(ТЗКассы.Количество()=0,"0",Формат(ТЗКассы[0].Сумма, "ЧГ=")));	
//ЗапросКассы.УстановитьПараметр("КредитнаяКарта",Ложь);
//ТЗКассы=ЗапросКассы.Выполнить().Выгрузить();
//ТекстДок.ДобавитьСтроку(?(ТЗКассы.Количество()=0,"0",Формат(ТЗКассы[0].Сумма, "ЧГ=")));
//ТекстДок.Записать("C:\BASE\"+Формат(ДТ, "ДФ=ddMMyy")+".txt");

//АдресСайта = "212.176.32.173" ;
//Порт = 21;
//Логин = "INVINA/streg";
//Пароль = "mnbvcxz*279";
//ИмяКаталога = "/test/RENOME/";
//FTPСоединение = Новый FTPСоединение(АдресСайта,Порт,Логин,Пароль);
//FTPСоединение.УстановитьТекущийКаталог(ИмяКаталога);
//FTPСоединение .Записать("C:\BASE\"+Формат(ДТ, "ДФ=ddMMyy")+".txt",Формат(ДТ, "ДФ=ddMMyy")+".txt");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
ВыполнитьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандаНаСервере()
ЗапросКассы=Новый Запрос("ВЫБРАТЬ
                         |	СУММА(ВЫБОР
                         |			КОГДА КассовыйДокумент.Приход
                         |				ТОГДА КассовыйДокумент.Сумма
                         |			ИНАЧЕ КассовыйДокумент.Сумма * -1
                         |		КОНЕЦ) КАК Сумма
                         |ИЗ
                         |	Документ.КассовыйДокумент КАК КассовыйДокумент
                         |ГДЕ
                         |	НАЧАЛОПЕРИОДА(КассовыйДокумент.Дата, ДЕНЬ) = &Дата
                         |	И КассовыйДокумент.КредитнаяКарта = &КредитнаяКарта");
ЗапросКассы.УстановитьПараметр("Дата",НачалоДня(Объект.ДТ));

ТекстДок=Новый ТекстовыйДокумент;
ЗапросКассы.УстановитьПараметр("КредитнаяКарта",Истина);
ТЗКассы=ЗапросКассы.Выполнить().Выгрузить();
ТекстДок.ДобавитьСтроку(?(ТЗКассы.Количество()=0,"0",Формат(ТЗКассы[0].Сумма, "ЧГ=")));	
ЗапросКассы.УстановитьПараметр("КредитнаяКарта",Ложь);
ТЗКассы=ЗапросКассы.Выполнить().Выгрузить();
ТекстДок.ДобавитьСтроку(?(ТЗКассы.Количество()=0,"0",Формат(ТЗКассы[0].Сумма, "ЧГ=")));

ИмяФайла = Константы.Папка_C_BASE.Получить();
ИмяФайла = ИмяФайла + Формат(Объект.ДТ, "ДФ=ddMMyy")+".txt";  

//ТекстДок.Записать("C:\BASE\"+Формат(ДТ, "ДФ=ddMMyy")+".txt");
ТекстДок.Записать(ИмяФайла);

ОбщийМодульСлужебныеСервер.FTPСоединениеЗаписать(ИмяФайла, Объект.ДТ);
//АдресСайта = "212.176.32.173" ;
//Порт = 21;
//Логин = "INVINA/streg";
//Пароль = "mnbvcxz*279";
//ИмяКаталога = "/test/RENOME_TEST/";
//FTPСоединение = Новый FTPСоединение(АдресСайта,Порт,Логин,Пароль);
//FTPСоединение.УстановитьТекущийКаталог(ИмяКаталога);

////FTPСоединение.Записать("C:\BASE\"+Формат(ДТ, "ДФ=ddMMyy")+".txt",Формат(ДТ, "ДФ=ddMMyy")+".txt");
//FTPСоединение.Записать(ИмяФайла, Формат(Объект.ДТ, "ДФ=ddMMyy")+".txt");
КонецПроцедуры




