
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр(); 

РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(ЭтаФорма.КоманднаяПанель,"ФормаУдалить");
РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(Элементы.Список.КоманднаяПанель,"ФормаУдалить");

Если Параметры.Свойство("ТолькоПочасоваяОплата") Тогда
	ТолькоПочасоваяОплата = Параметры.ТолькоПочасоваяОплата;	
КонецЕсли;
Список.Параметры.УстановитьЗначениеПараметра("ТолькоПочасоваяОплата", ТолькоПочасоваяОплата);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
ТД = Элементы.Список.ТекущиеДанные;
Заявка = ТД.Ссылка;
	
Отказ = КоворкингКлиент.ПроверкаУдаленияЗаявки(Заявка);
КонецПроцедуры

