
&НаКлиенте
Процедура ЗаявкаРедактирование(Команда)
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаСписка_ПрямоеРедактирование"); ;  
КонецПроцедуры

&НаКлиенте
Процедура КассовыйДокумент(Команда)
ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаСписка_ПрямоеРедактирование");  
КонецПроцедуры

&НаКлиенте
Процедура КассовыеСмены(Команда)
	ОткрытьФорму("Документ.КассоваяСмена.Форма.ФормаСписка_ПрямоеРедактирование");
КонецПроцедуры

&НаКлиенте
Процедура ГрупповыеСчета(Команда)
ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаСписка_ПрямоеРедактирование"); 
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеОплаты(Команда)
ОткрытьФорму("Документ.ПрочиеОплаты.Форма.ФормаСписка_ПрямоеРедактирование"); 
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеОбщийКвиток(Команда)
ОткрытьФорму("Документ.ГорничныеОбщийКвиток.Форма.ФормаСписка_ПрямоеРедактирование");
КонецПроцедуры

&НаКлиенте
Процедура АнкетыНовая(Команда)
ОткрытьФорму("Документ.АнкетаНовая.Форма.ФормаСписка_ПрямоеРедактирование");
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаАдминистраторы(Команда)
ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.ФормаСписка_ПрямоеРедактирование");
КонецПроцедуры
