
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаС = НачалоДня(ТекущаяДата());

ЗаполнитьАктивностиКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
ЗаполнитьАктивностиКалендарь();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАктивностиКалендарь()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	АктивностиКалендарь.Дата КАК Дата,
                      |	АктивностиКалендарь.АктивностьКалендарь КАК АктивностьКалендарь
                      |ИЗ
                      |	РегистрСведений.АктивностиКалендарь КАК АктивностиКалендарь
                      |ГДЕ
                      |	АктивностиКалендарь.Дата >= &Дата");


Запрос.УстановитьПараметр("Дата", ДатаС);

ТЗ = Запрос.Выполнить().Выгрузить();

АктивностиКалендарь.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = АктивностиКалендарь.Добавить();	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;
	
КонецПроцедуры


//
&НаКлиенте
Процедура АктивностиКалендарьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
ТД = Элемент.ТекущиеДанные;

Если НЕ ЗначениеЗаполнено(ТД.Дата) Тогда
	ТД.Дата	= ТекущаяДата();
КонецЕсли;
КонецПроцедуры
//

//
&НаКлиенте
Асинх Процедура АктивностиКалендарьПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
Если НоваяСтрока И ОтменаРедактирования Тогда Возврат; КонецЕсли;
	
ТД = Элемент.ТекущиеДанные;	

//
Если НЕ ЗначениеЗаполнено(ТД.Дата) Тогда
	ПоказатьПредупреждение(," Дата д. б. заполнено");
	Отказ= Истина;
	Возврат;
КонецЕсли;
	
ТС = Элемент.ТекущаяСтрока;
ОбновитьЗаписьАктивностиКалендарь(ТС);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписьАктивностиКалендарь(ТС)
ТД = АктивностиКалендарь.НайтиПоИдентификатору(ТС);	
	
МенеджерЗаписи = РегистрыСведений.АктивностиКалендарь.СоздатьМенеджерЗаписи();

МенеджерЗаписи.Дата = ТД.Дата;
МенеджерЗаписи.АктивностьКалендарь = ТД.АктивностьКалендарь;

МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура АктивностиКалендарьПередУдалением(Элемент, Отказ)
ТС = Элемент.ТекущаяСтрока;
УдалитьЗаписьАктивностиКалендарь(ТС);
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьАктивностиКалендарь(ТС)
ТД = АктивностиКалендарь.НайтиПоИдентификатору(ТС);	
	
Запись = РегистрыСведений.АктивностиКалендарь.СоздатьМенеджерЗаписи();
Запись.Дата = ТД.Дата;
Запись.Удалить();
КонецПроцедуры






