
#Область ОписаниеПеременных

// ПодключаемоеОборудование
Перем ПараметрыПриложения Экспорт;
// Конец ПодключаемоеОборудование

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	// ПодключаемоеОборудование
	ИнтеграцияПодсистемБПОКлиент.ПередНачаломРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы_Исходный()
	
	// ПодключаемоеОборудование
	ИнтеграцияПодсистемБПОКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
// + ПСН 
Если ИмяПользователя()="ЗакрытиеСмены" тогда
	
	ОткрытьФорму("Обработка.ЗакрытьСмену.Форма.Форма");
	
	//ЗавершитьРаботуСистемы(Ложь);
	ПрекратитьРаботуСистемы();
КонецЕсли;

Если ИмяПользователя()="ВыгрузкаФинРезультат" тогда
	ДатаПо = КонецДня(ТекущаяДата() + 365 * 24 * 60 *60);
	ДатаС = НачалоДня(ТекущаяДата() - 90 * 24 * 60 *60);
	
	ВыгрузкаФинРезультатов.ВыгрузкаФинРезультатов(ДатаС, ДатаПо); 	

	//ЗавершитьРаботуСистемы(Ложь);
	ПрекратитьРаботуСистемы();
КонецЕсли;

Если ИмяПользователя()="ЗагрузкаБухгалтерия" тогда
	ЗагрузкаВыпискиГостиница.ЗагрузкаВыписки();
	
	//ЗавершитьРаботуСистемы(Ложь);
	ПрекратитьРаботуСистемы();
КонецЕсли;

Если ИмяПользователя()="РассылкаWhatsApp" тогда
	ДатаРассылки = НачалоДня(ТекущаяДата());
	РассылкаWhatsApp.РассылкаWhatsApp(ДатаРассылки);
	
	//ЗавершитьРаботуСистемы(Ложь);
	ПрекратитьРаботуСистемы();
КонецЕсли;

Если ИмяПользователя()="ОтправкаПисемКанторову" тогда
	МассивПолучатели = Новый Массив;
	МассивПолучатели.Добавить("kantorov.ee@gmail.ru");
	МассивПолучатели.Добавить("Kantorov_ee@invina.ru");
	МассивПолучатели.Добавить("Isaeva_JS@invina.ru");
	МассивПолучатели.Добавить("postnikov_sn@invina.ru");
	
	ДатаОтчета = НачалоДня(ТекущаяДата()) - 32 * 24 * 60 * 60;
	
	ДатаС = НачалоМесяца(ДатаОтчета);
	ДатаПо = НачалоДня(КонецМесяца(ДатаС));
	
	ПисьмаКлиент.ОтправитьЗакрытиеФинансовогоПериода(МассивПолучатели, ДатаС, ДатаПо);
	
	ЗавершитьРаботуСистемы(Ложь);
	//ПрекратитьРаботуСистемы();
КонецЕсли;


Если ИмяПользователя()="ОтправкаЕжедневныйОтчетФактСводный" тогда
	МассивПолучатели = Новый Массив;
	
	//МассивПолучатели.Добавить("Pevzner_AJ@invina.ru");
	//МассивПолучатели.Добавить("Isaeva_JS@invina.ru");
	
	МассивПолучатели.Добавить("postnikov_sn@invina.ru");
	
	ДатаОтчета = НачалоДня(ТекущаяДата()) - 1 * 24 * 60 * 60;
	
	ДатаС = НачалоМесяца(ДатаОтчета);
	ДатаПо = НачалоДня(КонецМесяца(ДатаС));
	
	ПисьмаКлиент.ОтправитьЕжедневныйОтчетФактСводный(МассивПолучатели, ДатаС, ДатаПо);
	
	ЗавершитьРаботуСистемы(Ложь);
	//ПрекратитьРаботуСистемы();
КонецЕсли;

Если ИмяПользователя()="РассылкаДеньРождения" тогда

	ДатаРассылки = НачалоДня(ТекущаяДата());
	РассылкаWhatsApp.РассылкаWhatsApp_ДеньРождения(ДатаРассылки);
	
	ЗавершитьРаботуСистемы(Ложь);
	//ПрекратитьРаботуСистемы();
КонецЕсли;
//- ПСН 
	
	
//Политов	
Если ИмяПользователя()="RobotBonus" тогда
	//АвтоБонус();
	
	ОбщееСервер.АвтоБонус();

	ЗавершитьРаботуСистемы(Ложь);
КонецЕсли;
//Политов
		
Если ИмяПользователя()="Robot" тогда
	//Отчеты.ОтчетПоКлиентам.ПолучитьФорму().Открыть();
	
	Парам = Новый Структура;
	Парам.Вставить("ЗавершитьРаботу", Истина); 
	ОткрытьФорму("Отчет.ОтчетПоКлиентам.Форма.ФормаОтчета", Парам);
	
	//Форма = Обработки.ВыгрузкаКассовойСмены.ПолучитьФорму();		
	//Форма.Открыть();
	
	ОткрытьФорму("Обработка.ВыгрузкаКассовойСмены_OLD.Форма.Форма", Парам);

	ЗавершитьРаботуСистемы(Ложь);
конецесли;

Если ИмяПользователя()="RobotG" тогда
	//Обработки.ФормированиеЗаданийНаСменуБелья.ПолучитьФорму().Открыть();
	Парам = Новый Структура("ЗавершитьРаботу", Истина);
	ОткрытьФорму("Обработка.ФормированиеЗаданийНаСменуБелья_КУдадению.Форма.Форма", Парам);
	
	ЗавершитьРаботуСистемы(Ложь);
конецесли;

Если ИмяПользователя()="RobotA" тогда
	//ОтчА = Отчеты.ОтчетПоКлиентам.Создать();
	//
	//ОтчА.Аудит=Истина;
	//
	//ОтчА.ПолучитьФорму().Открыть();
	
	Парам = Новый Структура;
	Парам.Вставить("ЗавершитьРаботу", Истина); 
	Парам.Вставить("Аудит", Истина); 
	ОткрытьФорму("Отчет.ОтчетПоКлиентам.Форма.ФормаОтчета", Парам);
	
	ЗавершитьРаботуСистемы(Ложь);
конецесли;

Если ИмяПользователя()="FinRobot" тогда
	//Форма=Отчеты.ЕжемесячныеФинансы.ПолучитьФорму();
	//Форма.Авто=Истина;
	//Форма.Открыть();
	
	Парам = Новый Структура;
	Парам.Вставить("ЗавершитьРаботу", Истина); 
	Парам.Вставить("Авто", Истина); 
	ОткрытьФорму("Отчет.ЕжемесячныеФинансы.Форма.ФормаОтчета", Парам);
	
	////Форма=Отчеты.ОбщийОтчетПоГорничным.ПолучитьФорму();
	////Форма.Авто=Истина;
	////Форма.Открыть();

	ЗавершитьРаботуСистемы(Ложь);
конецесли;

Если ИмяПользователя()="DATCH" тогда
	//Обработки.СообщенияДляПроверяющего.ПолучитьФорму().Открыть();
	ОткрытьФорму("Обработка.СообщенияДляПроверяющего.Форма.Форма");
	
	//Форма=Обработки.ЗагрузкаПоказанийДатчика.ПолучитьФорму();
	////Форма.Авто=Истина;
	//Форма.Открыть();
	Парам = Новый Структура;
	Парам.Вставить("ЗавершитьРаботу", Истина); 
	ОткрытьФорму("Обработка.ЗагрузкаПоказанийДатчика_OLD.Форма.Форма", Парам);
	
	ОбщееСервер.ЗагрузкаТек();
	
	////ЗагрузкаАрхива();
	
	ОбщееСервер.ЗагрузкаОсмотра();
	
	ЗавершитьРаботуСистемы(Ложь);
конецесли;
	
	// ПодключаемоеОборудование
	ИнтеграцияПодсистемБПОКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
Организация = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Организация");
ЗаголовокСистемы = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Организация, "Наименование");
//Если НЕ Пустаястрока(ЗаголовокСистемы) Тогда
	//УстановитьЗаголовокСистемы(ЗаголовокСистемы);
	УстановитьЗаголовокПриложения(ЗаголовокСистемы);
//КонецЕсли;

//Если ПолнотекстовыйПоиск.ДатаАктуальности()<ТекущаяДата()-3600 тогда 
//	////		ПолнотекстовыйПоиск.ОбновитьИндекс();	
//КонецЕсли;
СлужебныеСервер.ПолнотекстовыйПоискОбновитьИндекс();

РаботаСИнтерфейсомСервер.ОбычныйИнтерфейс();

ОткрытьФорму("Обработка.Интерфейс.Форма.Форма",,,
		,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры


Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	// ПодключаемоеОборудование
	ИнтеграцияПодсистемБПОКлиент.ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	ИнтеграцияПодсистемБПОКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	
КонецПроцедуры


#КонецОбласти