

#Область ОбработчикиКомандФормы

Процедура ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтоСерверККМ = ФУ_Сервер.ЭтоСерверККМ();
	ИдентификаторОбъекта = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("СерверККМИдентификатор");
	
	Если РезультатВыполнения.Результат Тогда
		Если ЭтоСерверККМ Тогда
			Команда = Параметры.Команда;
			
			Если Команда = "ОткрытьСмену" Тогда
				ТекущееРабочееМесто = МенеджерОборудованияКлиентПовтИсп.РабочееМестоКлиента();    

				МассивОборудование = ФУ_Сервер.ПолучитьВсеУстройства(ИдентификаторОбъекта, ТекущееРабочееМесто);
				
				ДанныеОбработатьДанныеОперации = ФУ_Сервер.ПолучитьДанныеОбработатьДанныеОперации();
				
				Если ДанныеОбработатьДанныеОперации <> Неопределено Тогда
					
					Для Каждого Строка Из МассивОборудование Цикл
						ПараметрыПодключенияСерверОбработатьДанныеОперации  = ДанныеОбработатьДанныеОперации.ПараметрыПодключенияСервер;
						ПараметрыПодключенияСерверОбработатьДанныеОперации.ИдентификаторУстройства = Строка.ОборудованиеСсылка;
						ПараметрыПодключенияСерверОбработатьДанныеОперации.Наименование = Строка.ОборудованиеНаименование;
						
						КомандаОбработатьДанныеОперации = ДанныеОбработатьДанныеОперации.Команда;
						РезультатВыполненияОбработатьДанныеОперации = ДанныеОбработатьДанныеОперации.РезультатВыполнения;
						РезультатВыполненияОбработатьДанныеОперации.ИдентификаторУстройства = Строка.ОборудованиеСсылка; 
						
						ДанныеОперацииОбработатьДанныеОперации  = ДанныеОбработатьДанныеОперации.ДанныеОперации;
						
						//ОборудованиеЧекопечатающиеУстройстваВызовСервера.ОбработатьДанныеОперации(ПараметрыПодключенияСерверОбработатьДанныеОперации
						//	, КомандаОбработатьДанныеОперации, РезультатВыполненияОбработатьДанныеОперации, ДанныеОперацииОбработатьДанныеОперации);
						ОборудованиеЧекопечатающиеУстройстваКлиент.ОбработатьДанныеОперации(ПараметрыПодключенияСерверОбработатьДанныеОперации
							, КомандаОбработатьДанныеОперации, РезультатВыполненияОбработатьДанныеОперации, ДанныеОперацииОбработатьДанныеОперации);
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли Команда = "ЗакрытьСмену" Тогда
				МассивОборудование = ФУ_Сервер.ПолучитьВсеУстройства(ИдентификаторОбъекта, ТекущееРабочееМесто);
				
				ДанныеОбработатьДанныеОперации = ФУ_Сервер.ПолучитьДанныеОбработатьДанныеОперации();
				
				Если ДанныеОбработатьДанныеОперации <> Неопределено Тогда
					
					Для Каждого Строка Из МассивОборудование Цикл
						
						ПараметрыПодключенияСерверОбработатьДанныеОперации  = ДанныеОбработатьДанныеОперации.ПараметрыПодключенияСервер;
						ПараметрыПодключенияСерверОбработатьДанныеОперации.ИдентификаторУстройства = Строка.ОборудованиеСсылка;
						ПараметрыПодключенияСерверОбработатьДанныеОперации.Наименование = Строка.ОборудованиеНаименование;
						
						КомандаОбработатьДанныеОперации = ДанныеОбработатьДанныеОперации.Команда;
						
						РезультатВыполненияОбработатьДанныеОперации = ДанныеОбработатьДанныеОперации.РезультатВыполнения;
						РезультатВыполненияОбработатьДанныеОперации.ИдентификаторУстройства = Строка.ОборудованиеСсылка; 
						
						ДанныеОперацииОбработатьДанныеОперации  = ДанныеОбработатьДанныеОперации.ДанныеОперации;
						
						ОписаниеПоследнейКассовойСмены = КассовыеСменыВызовСервера.ОписаниеПоследнейКассовойСмены(Строка.ОборудованиеСсылка);
						
						Если ОписаниеПоследнейКассовойСмены <> Неопределено Тогда
							ДанныеОперацииОбработатьДанныеОперации.КассоваяСмена = ОписаниеПоследнейКассовойСмены.КассоваяСмена;
							//ОборудованиеЧекопечатающиеУстройстваВызовСервера.ОбработатьДанныеОперации(ПараметрыПодключенияСерверОбработатьДанныеОперации
							//	, КомандаОбработатьДанныеОперации, РезультатВыполненияОбработатьДанныеОперации, ДанныеОперацииОбработатьДанныеОперации);
							ОборудованиеЧекопечатающиеУстройстваКлиент.ОбработатьДанныеОперации(ПараметрыПодключенияСерверОбработатьДанныеОперации
								, КомандаОбработатьДанныеОперации, РезультатВыполненияОбработатьДанныеОперации, ДанныеОперацииОбработатьДанныеОперации);
						КонецЕсли;		
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	Форма = Параметры.Форма;
	//Доступность = Истина;
	Форма.Доступность = Истина;
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, НСтр("ru='Операция успешно завершена.'"), РезультатВыполнения.ОписаниеОшибки);
	//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
	ОповещениеЗавершение = Параметры.ОповещениеЗавершение;
	Если ОповещениеЗавершение <> Неопределено Тогда
		Результат = Новый Структура;
		Результат.Вставить("Результат", РезультатВыполнения.Результат);
		Результат.Вставить("ТекстСообщения", ТекстСообщения);
		ВыполнитьОбработкуОповещения(ОповещениеЗавершение, Результат);
	Иначе	
		//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

Процедура ОткрытьСмену(Форма, ОповещениеЗавершение, Параметры) Экспорт
	
	ВыполнитьОперацию("ОткрытьСмену", Форма, ОповещениеЗавершение, Параметры);
	
КонецПроцедуры

Процедура ЗакрытьСмену(Форма, ОповещениеЗавершение, Параметры) Экспорт
	
	ВыполнитьОперацию("ЗакрытьСмену", Форма, ОповещениеЗавершение, Параметры);
	
КонецПроцедуры

Процедура ВнесениеДенег(Форма, ОповещениеЗавершение, Параметры)
	
	ВыполнитьОперацию("Внесение", Форма, ОповещениеЗавершение, Параметры); 
	
КонецПроцедуры

Процедура ВыемкаДенег(Форма, ОповещениеЗавершение, Параметры)
	
	ВыполнитьОперацию("Выемка", Форма, ОповещениеЗавершение, Параметры);     
	
КонецПроцедуры

Процедура ОтчетОТекущемСостоянииРасчетов(Форма, ОповещениеЗавершение, Параметры)
	
	ВыполнитьОперацию("ОтчетОТекущемСостоянииРасчетов", Форма, ОповещениеЗавершение, Параметры);
	
КонецПроцедуры

Процедура ОтчетБезГашения(Форма, ОповещениеЗавершение, Параметры) Экспорт
	
	ВыполнитьОперацию("ОтчетБезГашения", Форма, ОповещениеЗавершение, Параметры);
	
КонецПроцедуры

Процедура ВыполнитьОперацию(Команда, Форма, ОповещениеЗавершение, Параметры)
	
	ОчиститьСообщения();
	
	ПоддерживаемыеТипыВО = Новый Массив();
	//ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
	//ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	
	ДополнительныеПараметры = Новый Структура("Команда", Команда);
	ДополнительныеПараметры.Вставить("Форма", Форма); 
	ДополнительныеПараметры.Вставить("ОповещениеЗавершение", ОповещениеЗавершение); 
	ДополнительныеПараметры.Вставить("Параметры", Параметры);
	Если Параметры.Свойство("ЭтоКоворкинг") Тогда
		ДополнительныеПараметры.Вставить("ЭтоКоворкинг", Параметры.ЭтоКоворкинг);
	КонецЕсли;	
	
	Если Команда = "Внесение" Или Команда = "Выемка" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюВыбораУстройстваИнкассация", ЭтотОбъект, ДополнительныеПараметры); 
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюВыбораУстройства", ЭтотОбъект, ДополнительныеПараметры); 
	КонецЕсли;
	МенеджерОборудованияКлиент.ВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальное устройство'"), 
		НСтр("ru='Фискальное устройство не подключено.'"), 
		НСтр("ru='Фискальное устройство не выбрано.'"));

КонецПроцедуры

Процедура ВыполнитьОперациюВыбораУстройстваИнкассация(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыбора.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыбора.ОписаниеОшибки);      
		Возврат;
	КонецЕсли;  
	
	СуммаОперации = 0;
	
	Если ДополнительныеПараметры.Команда = "Внесение" Тогда    
		ЗаголовокОкна = НСтр("ru='Сумма внесения'");       
	Иначе     
		ЗаголовокОкна = НСтр("ru='Сумма выемки'");  
	КонецЕсли;
	
	ПараметрыПослеВводаЧисла = Новый Структура;
	ПараметрыПослеВводаЧисла.Вставить("СуммаОперации", СуммаОперации);
	ПараметрыПослеВводаЧисла.Вставить("ИдентификаторУстройства", РезультатВыбора.ИдентификаторУстройства);  
	ПараметрыПослеВводаЧисла.Вставить("Команда", ДополнительныеПараметры.Команда);
	
	ОповещениеПослеВводеЧисла = Новый ОписаниеОповещения("ИнкассацияЗавершение", ЭтотОбъект, ПараметрыПослеВводаЧисла);
	
	ПоказатьВводЧисла(ОповещениеПослеВводеЧисла, СуммаОперации, ЗаголовокОкна, 15, 2);
	
КонецПроцедуры        

Процедура ИнкассацияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СуммаОперации = ?(Результат = Неопределено, ДополнительныеПараметры.СуммаОперации, Результат);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Доступность = Ложь;   
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыИнкассации();
	ПараметрыОперации.ТипИнкассации = ?(ДополнительныеПараметры.Команда = "Внесение" , 1, 0);    
	ПараметрыОперации.Сумма     = СуммаОперации;   
	//ПараметрыОперации.Кассир    = Кассир;   
	//ПараметрыОперации.КассирИНН = КассирИНН;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект);
	//ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, 
	//	ДополнительныеПараметры.ИдентификаторУстройства, ПараметрыОперации);
	//
КонецПроцедуры

Процедура ВыполнитьОперациюВыбораУстройства(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыбора.Результат Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыбора.ОписаниеОшибки);      
		Возврат;
	КонецЕсли;              
	
	Форма = ДополнительныеПараметры.Форма;
	
	ОчиститьСообщения();
	//Доступность = Ложь;
	Форма.Доступность = Ложь;
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	//ПараметрыОперации.Кассир    = Кассир;   
	//ПараметрыОперации.КассирИНН = КассирИНН;
	Параметры = ДополнительныеПараметры.Параметры;
	ПараметрыОперации.Кассир    = Параметры.Кассир;   
	//ПараметрыОперации.КассирИНН = Параметры.КассирИНН;

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Команда", ДополнительныеПараметры.Команда);
	ДопПараметры.Вставить("Форма", Форма);
	ДопПараметры.Вставить("ОповещениеЗавершение", ДополнительныеПараметры.ОповещениеЗавершение);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект, ДопПараметры);
	
	Если ДополнительныеПараметры.Команда = "ОткрытьСмену" Тогда 
		//Если МенеджерОборудованияКлиентПовтИсп.ИспользуетсяКассоваяСмена() Тогда 
		Если ОБщегоНазначенияБПОКлиент.ИспользуетсяКассоваяСмена() Тогда 
			ДополнительныеПараметры = Новый Структура();
			МодульКассовыеСменыКлиентПереопределяемый = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("КассовыеСменыКлиентПереопределяемый");
			МодульКассовыеСменыКлиентПереопределяемый.УправлениеФУЗаполнитьДополнительныеПараметрыПередОткрытиемСмены(РезультатВыбора.ИдентификаторУстройства, ДополнительныеПараметры);
		Иначе     
			ДополнительныеПараметры = Неопределено;
		КонецЕсли;
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, 
			Форма.УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации, ДополнительныеПараметры);    
	ИначеЕсли ДополнительныеПараметры.Команда = "ЗакрытьСмену" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, 
			Форма.УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации);
	ИначеЕсли ДополнительныеПараметры.Команда = "ОтчетОТекущемСостоянииРасчетов" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаОТекущемСостоянииРасчетов(ОповещениеПриЗавершении, 
			Форма.УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации);
	ИначеЕсли ДополнительныеПараметры.Команда = "ОтчетБезГашения" Тогда
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, 
			Форма.УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//

Процедура ПриОткрытии_Подключить(Форма) Экспорт
ВыполнитьПодключитьОтключитьОборудование(Форма, "Подключить");
КонецПроцедуры

Процедура ПриЗакрытии_Отключить(Форма) Экспорт
ВыполнитьПодключитьОтключитьОборудование(Форма, "Отключить");
КонецПроцедуры                                                                             

Процедура ВыполнитьПодключитьОтключитьОборудование(Форма, Команда) Экспорт    
	// 1. Вариант. Можно указать один или несколько типов оборудования
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	//ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
	//ПоддерживаемыеТипыВО.Добавить("ТерминалСбораДанных");
	//ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	ПоддерживаемыеТипыВО.Добавить("ЭквайринговыйТерминал");
	//ПоддерживаемыеТипыВО.Добавить("ЭлектронныеВесы");
	//ПоддерживаемыеТипыВО.Добавить("ВесыСПечатьюЭтикеток");
	//ПоддерживаемыеТипыВО.Добавить("ПринтерЭтикеток");
	//ПоддерживаемыеТипыВО.Добавить("СчитывательRFID");
	
	//Команда = ДополнительныеПараметры.Команда;
	Если Команда = "Подключить" Тогда 
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОтключитьОборудованиеЗавершение", ЭтотОбъект); 
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(
		    ОповещенияПриПодключении, Форма.УникальныйИдентификатор, ПоддерживаемыеТипыВО);
			
	ИначеЕсли Команда = "Отключить" Тогда
		ОповещениеПриОтключении = Новый ОписаниеОповещения("ПодключитьОтключитьОборудованиеЗавершение", ЭтотОбъект); 
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованияПоТипу(
		    ОповещениеПриОтключении, Форма.УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	Иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодключитьОтключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
    
    // Возвращается структура у которой обязательно есть два реквизита:
    // РезультатВыполнения.Результат - Булево
    // РезультатВыполнения.ОписаниеОшибки - Строка
    
    Если Не РезультатВыполнения.Результат Тогда
        ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
        Сообщить(ТекстСообщения);
    Иначе
        ТекстСообщения = НСтр("ru = 'Оборудование подключено.'" );
		//Сообщить(ТекстСообщения);
    КонецЕсли;
КонецПроцедуры
//

//// + Копия Чека
Процедура ВыполнитьПечатьТекста(Форма, Текст) Экспорт
	
	ОчиститьСообщения();
	
	ПоддерживаемыеТипыВО = Новый Массив();
	//ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
	//ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	
	ДополнительныеПараметры = Новый Структура;;
	ДополнительныеПараметры.Вставить("Форма", Форма); 
	//ДополнительныеПараметры.Вставить("ОповещениеЗавершение", ОповещениеЗавершение); 
	ДополнительныеПараметры.Вставить("Текст", Текст); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьТекста", ЭтотОбъект, ДополнительныеПараметры); 
	МенеджерОборудованияКлиент.ВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальное устройство'"), 
		НСтр("ru='Фискальное устройство не подключено.'"), 
		НСтр("ru='Фискальное устройство не выбрано.'"));

КонецПроцедуры

Процедура ПечатьТекста(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
    Форма.Доступность = Ложь; // При необходимости можно заблокировать интерфейс пользователя.
    
	//Текст = "ТЕКСТ ДЛЯ ПЕЧАТИ"; // Произвольный текст для печати в чеке
    Текст = ДополнительныеПараметры.Текст;; // Произвольный текст для печати в чеке
    ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТеста(Текст);
    
    ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПечатьТекстаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
    ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(
        ОповещениеПриЗавершении, Форма.УникальныйИдентификатор, Результат.ИдентификаторУстройства, ПараметрыОперации);
    
КонецПроцедуры

Процедура ПечатьТекстаЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
    
	Форма = ДополнительныеПараметры.Форма;
    Форма.Доступность = Истина; // При необходимости разблокируем интерфейс пользователя.
    
    Если НЕ РезультатВыполнения.Результат Тогда
        ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:""%ОписаниеОшибки%"".'");
        ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
        Сообщить(ТекстСообщения);
    КонецЕсли;
    
КонецПроцедуры
//// - Копия Чека




//
Функция ПолучитьШаблонЧека(ТипРасчета, СуммаБезналЧекККМ, СуммаНалЧекККМ, СуммаПредыдущихОплат, ЭтоАванс, ТаблицаЧекаККМ
	, ЭтоКоворкинг) Экспорт
    
    // Общие параметры чека
    ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека();
    
    // Параметры установлены по умолчанию.
    ОбщиеПараметры.ТипРасчета        = ТипРасчета; // Перечисление "ТипыРасчетаДенежнымиСредствами"
	
	//ОбщиеПараметры.Электронно        = Ложь;       // Если Электронно = Истина, то чек будет предоставлен в элетронной форме, без печати.
	//ОбщиеПараметры.Отправляет1СSMS   = Ложь;       // SMS отправляет средствами 1C.
	//ОбщиеПараметры.Отправляет1СEmail = Ложь;       // Email отправляет средствами 1C.
	//ОбщиеПараметры.ПокупательEmail   = Неопределено;
	//ОбщиеПараметры.ПокупательНомер   = Неопределено;
    
    // Параметры необходимые для чека ЕНВД на принтере чеков
	//ОбщиеПараметры.Кассир    = "Иванов И.И"; // Строка, Обязательно - ФИО лица, осуществившего расчет 
	//                                         // с покупателем (клиентом), оформившего кассовый чек.
	//ОбщиеПараметры.КассирИНН = КассирИНН;    // Строка, Необязательно - Идентификационный номер налогоплательщика кассира, при наличии.
	
	ДанныеОрганизацииДляФУ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
	Кассир = ФУ_Сервер.Кассир(ЭтоКоворкинг);
	
	ОбщиеПараметры.Кассир = Кассир; // Строка, Обязательно - ФИО лица, осуществившего расчет с покупателем (клиентом), оформившего кассовый чек.
	
	//ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН"); 
	//                                         // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ"
	//ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход"); // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
	//  Если ЭтоКоворкинг Тогда
	//	ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоход"); // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
	//Иначе
	//	ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход"); // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
	//КонецЕсли;
  	Если ЭтоКоворкинг Тогда
		ОбщиеПараметры.СистемаНалогообложения = ДанныеОрганизацииДляФУ.ТипСистемыНалогообложенияККТКоворкинг; // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
	Иначе
		ОбщиеПараметры.СистемаНалогообложения = ДанныеОрганизацииДляФУ.ТипСистемыНалогообложенияККТ;; // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
	КонецЕсли;
	
	// Параметры необходимые для чека ЕНВД на принтере чеков
	//ОбщиеПараметры.ОрганизацияНазвание = "ООО ""1C-СОФТ""";
	//ОбщиеПараметры.ОрганизацияИНН      = "7709860400";
	//ОбщиеПараметры.ОрганизацияКПП      = "770901001";
	//ОбщиеПараметры.НомерКассы          = "00001";
	//ОбщиеПараметры.НомерЧека           = "1";
	//ОбщиеПараметры.НомерСмены          = "1";
	
	Если ЭтоКоворкинг Тогда
		ОрганизацияНазвание = ДанныеОрганизацииДляФУ.КоворкингНаименованиеДляФУ;
		ОрганизацияИНН = ДанныеОрганизацииДляФУ.ИННДляФУКоворкинг;
	Иначе	
		ОрганизацияНазвание = ДанныеОрганизацииДляФУ.НаименованиеДляФУ;
		ОрганизацияИНН = ДанныеОрганизацииДляФУ.ИННДляФУ;
	КонецЕсли;
	
	ОбщиеПараметры.ОрганизацияНазвание = ОрганизацияНазвание;
	ОбщиеПараметры.ОрганизацияИНН = ОрганизацияИНН;
	
    // Формато-логический контроль - "ПеречислениеСсылка.СпособыФорматоЛогическогоКонтроля"
	//ОбщиеПараметры.СпособФорматоЛогическогоКонтроля = Неопределено; // Перечисление,Необязательно - Способ формато-логического контроля. 
	//ОбщиеПараметры.ДопустимоеРасхождениеФорматоЛогическогоКонтроля = 0; // Число,Необязательно - устанавливается значение по умолчанию. 
    
    // Формирование табличной части
	//СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	//
	//СтрокаПозицииЧека.Наименование = "Товарная позиция";
	//СтрокаПозицииЧека.Количество   = 3;
	//СтрокаПозицииЧека.Сумма        = 330;
	//СтрокаПозицииЧека.НомерСекции  = 1;
	//СтрокаПозицииЧека.СтавкаНДС    = 20;
	//
	//// Может рассчитываться автоматически при использовании функции формато-логический контроля.
	//СтрокаПозицииЧека.ЦенаСоСкидками = 110; // Обязательно, Цена с учета скидок и наценок (Необходимо начиная с ФФД 1.0.5 и выше)
	//// Реквизиты начиная с ФФД 1.0.5
	//СтрокаПозицииЧека.ПризнакСпособаРасчета = ТипыПризнакаСпособаРасчета; 
	//                                        // Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	//// Признаки агента и агенские реквизиты. Для ККТ по ФФД 1.0.5 и выше.
	//СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = ПризнакПредметаРасчета;       // Перечисление - ПризнакиАгента
	//СтрокаПозицииЧека.ДанныеПоставщика.Телефон       = ДанныеПоставщикаТелефон;      // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеПоставщика.Наименование  = ДанныеПоставщикаНаименование; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеПоставщика.ИНН           = ДанныеПоставщикаИНН;          // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Операция       = ПлатежныйАгентОперация;  // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Телефон        = ПлатежныйАгентТелефон;   // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Телефон      = ОператорПереводаТелефон; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Наименование = ОператорПереводаНаименование; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Адрес        = ОператорПереводаАдрес;   // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.ИНН          = ОператорПереводаИНН;     // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = ОператорПоПриемуПлатежейТелефон; // Строка, Необязательно
	//ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
Для Каждого Строка Из ТаблицаЧекаККМ Цикл
    СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	
	СтрокаПозицииЧека.Наименование = Строка.Наименование;
	СтрокаПозицииЧека.Количество = Строка.Количество;
	//СтрокаПозицииЧека.Цена = Строка.Цена; // Обязательно, Цена без учета скидок и наценок (Необходимо для ФР и ФФД 1.0)
	СтрокаПозицииЧека.Сумма = Строка.Сумма;

	СтрокаПозицииЧека.НомерСекции = Строка.НомерСекции;
 
	//СтрокаПозицииЧека.СтавкаНДС = Неопределено;
	//Если НЕ Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5") Тогда
		Если ТекущаяДата() >= '20250101' Тогда
			Если НЕ (Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС")
					ИЛИ Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка")) Тогда
			
				Если НЕ (ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств"))
				Тогда 
					СтрокаПозицииЧека.СтавкаНДС =  ДокументыСервер.СтавкаНДСЧисло(Строка.СтавкаНДС);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	//КонецЕсли;
	
	// Может рассчитываться автоматически при использовании функции формато-логический контроля.
    СтрокаПозицииЧека.ЦенаСоСкидками = Строка.Цена; // Обязательно, Цена с учета скидок и наценок (Необходимо начиная с ФФД 1.0.5 и выше)

	//СтрокаПозицииЧека.ПризнакСпособаРасчета = ТипыПризнакаСпособаРасчета; 
	//                                        // Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	// Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	Если ЭтоАванс Тогда
		СтрокаПозицииЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.Аванс");
	Иначе	
		СтрокаПозицииЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой");// Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	КонецЕсли;	
	
	//ТекущийПользователь = ОбщийФункционалСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
	//ТекущийПользовательНаименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущийПользователь, "Наименование");

	//Если ТекущийПользовательНаименование = "Администратор" Тогда
		Если ЭтоАванс Тогда 
			СтрокаПозицииЧека.ПризнакПредметаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Платеж");
		Иначе
			СтрокаПозицииЧека.ПризнакПредметаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Услуга");
		КонецЕсли;
	//КонецЕсли;	
		
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
КонецЦикла;		
	
// Формирование таблицы оплат
//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); // Наличная оплата
//СтрокаОплаты.Сумма     = 100;
//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
Если СуммаНалЧекККМ > 0 Тогда
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); // Наличная оплата
	СтрокаОплаты.Сумма = СуммаНалЧекККМ;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
КонецЕсли;

//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
//СтрокаОплаты.ТипОплаты = Перечисление.ТипыОплатыККТ.Электронно; // Сумма электронной оплаты
//СтрокаОплаты.Сумма     = 100;
//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
Если СуммаБезналЧекККМ > 0 Тогда
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"); // Сумма электронной оплаты
	СтрокаОплаты.Сумма = СуммаБезналЧекККМ;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
КонецЕсли;

//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"); // Сумма постоплатой (в кредит)
//СтрокаОплаты.Сумма     = 100;
//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
//
//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"); // Сумма предоплатой (зачетом аванса)
//СтрокаОплаты.Сумма     = 100;
//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
Если СуммаПредыдущихОплат > 0 Тогда
	
	СуммаКОплате = ТаблицаЧекаККМ.Итог("Сумма");
	СуммаКредит = СуммаКОплате - СуммаПредыдущихОплат - СуммаБезналЧекККМ - СуммаНалЧекККМ;
	Если СуммаКредит > 0 Тогда
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"); // Сумма постоплатой (в кредит)
		СтрокаОплаты.Сумма = СуммаКредит;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;	
	
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"); // Сумма предоплатой (зачетом аванса)

	СтрокаОплаты.Сумма = СуммаПредыдущихОплат;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
КонецЕсли;
	
//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление"); // Сумма встречным предоставлением
//СтрокаОплаты.Сумма     = 100;
//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);

Возврат ОбщиеПараметры;

КонецФункции

Функция ПолучитьШаблонЧека_1(ТипРасчета, СуммаБезналЧекККМ, СуммаНалЧекККМ, СуммаПредыдущихОплат, ЭтоАванс, ТаблицаЧекаККМ
	, ЭтоКоворкинг) Экспорт
    
    // Общие параметры чека
    ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека();
    
    // Параметры установлены по умолчанию.
    ОбщиеПараметры.ТипРасчета        = ТипРасчета; // Перечисление "ТипыРасчетаДенежнымиСредствами"
	
	//ОбщиеПараметры.Электронно        = Ложь;       // Если Электронно = Истина, то чек будет предоставлен в элетронной форме, без печати.
	//ОбщиеПараметры.Отправляет1СSMS   = Ложь;       // SMS отправляет средствами 1C.
	//ОбщиеПараметры.Отправляет1СEmail = Ложь;       // Email отправляет средствами 1C.
	//ОбщиеПараметры.ПокупательEmail   = Неопределено;
	//ОбщиеПараметры.ПокупательНомер   = Неопределено;
    
    // Параметры необходимые для чека ЕНВД на принтере чеков
	//ОбщиеПараметры.Кассир    = "Иванов И.И"; // Строка, Обязательно - ФИО лица, осуществившего расчет 
	//                                         // с покупателем (клиентом), оформившего кассовый чек.
	//ОбщиеПараметры.КассирИНН = КассирИНН;    // Строка, Необязательно - Идентификационный номер налогоплательщика кассира, при наличии.
	ДанныеОрганизацииДляФУ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
	Если ЭтоКоворкинг Тогда
		Кассир = ДанныеОрганизацииДляФУ.КоворкингКассир;
	Иначе
		Кассир = ДанныеОрганизацииДляФУ.Кассир;
	КонецЕсли;	
	ОбщиеПараметры.Кассир = Кассир; // Строка, Обязательно - ФИО лица, осуществившего расчет с покупателем (клиентом), оформившего кассовый чек.
	
	//ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН"); 
	//                                         // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ"
	//ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход"); // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
  	Если ЭтоКоворкинг Тогда
		ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоход"); // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
	Иначе
		ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход"); // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
	КонецЕсли;
    // Параметры необходимые для чека ЕНВД на принтере чеков
	//ОбщиеПараметры.ОрганизацияНазвание = "ООО ""1C-СОФТ""";
	//ОбщиеПараметры.ОрганизацияИНН      = "7709860400";
	//ОбщиеПараметры.ОрганизацияКПП      = "770901001";
	//ОбщиеПараметры.НомерКассы          = "00001";
	//ОбщиеПараметры.НомерЧека           = "1";
	//ОбщиеПараметры.НомерСмены          = "1";
	
	Если ЭтоКоворкинг Тогда
		ОрганизацияНазвание = ДанныеОрганизацииДляФУ.КоворкингНаименованиеДляФУ;
		ОрганизацияИНН = ДанныеОрганизацииДляФУ.ИННДляФУКовркинг;
	Иначе	
		ОрганизацияНазвание = ДанныеОрганизацииДляФУ.НаименованиеДляФУ;
		ОрганизацияИНН = ДанныеОрганизацииДляФУ.ИННДляФУ;
	КонецЕсли;
	
	ОбщиеПараметры.ОрганизацияНазвание = ОрганизацияНазвание;
	ОбщиеПараметры.ОрганизацияИНН = ОрганизацияИНН;
	
    // Формато-логический контроль - "ПеречислениеСсылка.СпособыФорматоЛогическогоКонтроля"
	//ОбщиеПараметры.СпособФорматоЛогическогоКонтроля = Неопределено; // Перечисление,Необязательно - Способ формато-логического контроля. 
	//ОбщиеПараметры.ДопустимоеРасхождениеФорматоЛогическогоКонтроля = 0; // Число,Необязательно - устанавливается значение по умолчанию. 
    
    // Формирование табличной части
	//СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	//
	//СтрокаПозицииЧека.Наименование = "Товарная позиция";
	//СтрокаПозицииЧека.Количество   = 3;
	//СтрокаПозицииЧека.Сумма        = 330;
	//СтрокаПозицииЧека.НомерСекции  = 1;
	//СтрокаПозицииЧека.СтавкаНДС    = 20;
	//
	//// Может рассчитываться автоматически при использовании функции формато-логический контроля.
	//СтрокаПозицииЧека.ЦенаСоСкидками = 110; // Обязательно, Цена с учета скидок и наценок (Необходимо начиная с ФФД 1.0.5 и выше)
	//// Реквизиты начиная с ФФД 1.0.5
	//СтрокаПозицииЧека.ПризнакСпособаРасчета = ТипыПризнакаСпособаРасчета; 
	//                                        // Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	//// Признаки агента и агенские реквизиты. Для ККТ по ФФД 1.0.5 и выше.
	//СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = ПризнакПредметаРасчета;       // Перечисление - ПризнакиАгента
	//СтрокаПозицииЧека.ДанныеПоставщика.Телефон       = ДанныеПоставщикаТелефон;      // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеПоставщика.Наименование  = ДанныеПоставщикаНаименование; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеПоставщика.ИНН           = ДанныеПоставщикаИНН;          // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Операция       = ПлатежныйАгентОперация;  // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Телефон        = ПлатежныйАгентТелефон;   // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Телефон      = ОператорПереводаТелефон; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Наименование = ОператорПереводаНаименование; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Адрес        = ОператорПереводаАдрес;   // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.ИНН          = ОператорПереводаИНН;     // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = ОператорПоПриемуПлатежейТелефон; // Строка, Необязательно
	//ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
Для Каждого Строка Из ТаблицаЧекаККМ Цикл
    СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	
	СтрокаПозицииЧека.Наименование = Строка.Наименование;
	СтрокаПозицииЧека.Количество = Строка.Количество;
	//СтрокаПозицииЧека.Цена = Строка.Цена; // Обязательно, Цена без учета скидок и наценок (Необходимо для ФР и ФФД 1.0)
	СтрокаПозицииЧека.Сумма = Строка.Сумма;

	СтрокаПозицииЧека.НомерСекции = Строка.НомерСекции;

	СтрокаПозицииЧека.СтавкаНДС = " в т.ч. " + Строка.СтавкаНДС + "%";
	//СтрокаПозицииЧека.СтавкаНДС = Неопределено;

    // Может рассчитываться автоматически при использовании функции формато-логический контроля.
    СтрокаПозицииЧека.ЦенаСоСкидками = Строка.Цена; // Обязательно, Цена с учета скидок и наценок (Необходимо начиная с ФФД 1.0.5 и выше)

	
	//СтрокаПозицииЧека.ПризнакСпособаРасчета = ТипыПризнакаСпособаРасчета; 
	//                                        // Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	// Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	Если ЭтоАванс Тогда
		СтрокаПозицииЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.Аванс");
	Иначе	
		СтрокаПозицииЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой");// Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	КонецЕсли;	
	
	//ТекущийПользователь = ОбщийФункционалСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
	//ТекущийПользовательНаименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущийПользователь, "Наименование");

	//Если ТекущийПользовательНаименование = "Администратор" Тогда
		Если ЭтоАванс Тогда 
			СтрокаПозицииЧека.ПризнакПредметаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Платеж");
		Иначе
			СтрокаПозицииЧека.ПризнакПредметаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Услуга");
		КонецЕсли;
	//КонецЕсли;	
		
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
КонецЦикла;		
	
    // Формирование таблицы оплат
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); // Наличная оплата
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
Если СуммаНалЧекККМ > 0 Тогда
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); // Наличная оплата
	СтрокаОплаты.Сумма = СуммаНалЧекККМ;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
КонецЕсли;

	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = Перечисление.ТипыОплатыККТ.Электронно; // Сумма электронной оплаты
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
Если СуммаБезналЧекККМ > 0 Тогда
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"); // Сумма электронной оплаты
	СтрокаОплаты.Сумма = СуммаБезналЧекККМ;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
КонецЕсли;

	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"); // Сумма постоплатой (в кредит)
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	//
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"); // Сумма предоплатой (зачетом аванса)
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
Если СуммаПредыдущихОплат > 0 Тогда
	
	СуммаКОплате = ТаблицаЧекаККМ.Итог("Сумма");
	СуммаКредит = СуммаКОплате - СуммаПредыдущихОплат - СуммаБезналЧекККМ - СуммаНалЧекККМ;
	Если СуммаКредит > 0 Тогда
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"); // Сумма постоплатой (в кредит)
		СтрокаОплаты.Сумма = СуммаКредит;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;	
	
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"); // Сумма предоплатой (зачетом аванса)

	СтрокаОплаты.Сумма = СуммаПредыдущихОплат;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
КонецЕсли;
	
	
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление"); // Сумма встречным предоставлением
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
    
    Возврат ОбщиеПараметры;
    
КонецФункции

//

Функция ПолучитьШаблонЧека_ЧекПроизвольный(ТипРасчета, СуммаБезналЧекККМ, СуммаНалЧекККМ, СуммаПредыдущихОплат, ЭтоАванс
	, ТаблицаЧекаККМ, ЭтоКоворкинг) Экспорт
    // Общие параметры чека     
    ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека();
    
    // Параметры установлены по умолчанию.
    ОбщиеПараметры.ТипРасчета        = ТипРасчета; // Перечисление "ТипыРасчетаДенежнымиСредствами"
	
	//ОбщиеПараметры.Электронно        = Ложь;       // Если Электронно = Истина, то чек будет предоставлен в элетронной форме, без печати.
	//ОбщиеПараметры.Отправляет1СSMS   = Ложь;       // SMS отправляет средствами 1C.
	//ОбщиеПараметры.Отправляет1СEmail = Ложь;       // Email отправляет средствами 1C.
	//ОбщиеПараметры.ПокупательEmail   = Неопределено;
	//ОбщиеПараметры.ПокупательНомер   = Неопределено;
    
    // Параметры необходимые для чека ЕНВД на принтере чеков
	//ОбщиеПараметры.Кассир    = "Иванов И.И"; // Строка, Обязательно - ФИО лица, осуществившего расчет 
	//                                         // с покупателем (клиентом), оформившего кассовый чек.
	//ОбщиеПараметры.КассирИНН = КассирИНН;    // Строка, Необязательно - Идентификационный номер налогоплательщика кассира, при наличии.
	
	ДанныеОрганизацииДляФУ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
	
	Кассир = ФУ_Сервер.Кассир(ЭтоКоворкинг);
	ОбщиеПараметры.Кассир = Кассир; // Строка, Обязательно - ФИО лица, осуществившего расчет с покупателем (клиентом), оформившего кассовый чек.
	
	//ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН"); 
	//                                         // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ"
	//ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход"); // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
  	Если ЭтоКоворкинг Тогда
		ОбщиеПараметры.СистемаНалогообложения = ДанныеОрганизацииДляФУ.ТипСистемыНалогообложенияККТКоворкинг;
	Иначе
		ОбщиеПараметры.СистемаНалогообложения = ДанныеОрганизацииДляФУ.ТипСистемыНалогообложенияККТ; // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
	КонецЕсли;
    // Параметры необходимые для чека ЕНВД на принтере чеков
	//ОбщиеПараметры.ОрганизацияНазвание = "ООО ""1C-СОФТ""";
	//ОбщиеПараметры.ОрганизацияИНН      = "7709860400";
	//ОбщиеПараметры.ОрганизацияКПП      = "770901001";
	//ОбщиеПараметры.НомерКассы          = "00001";
	//ОбщиеПараметры.НомерЧека           = "1";
	//ОбщиеПараметры.НомерСмены          = "1";
	
	Если ЭтоКоворкинг Тогда
		ОрганизацияНазвание = ДанныеОрганизацииДляФУ.КоворкингНаименованиеДляФУ;
		ОрганизацияИНН = ДанныеОрганизацииДляФУ.ИННДляФУКоворкинг;
	Иначе	
		ОрганизацияНазвание = ДанныеОрганизацииДляФУ.НаименованиеДляФУ;
		ОрганизацияИНН = ДанныеОрганизацииДляФУ.ИННДляФУ;
	КонецЕсли;
	
	ОбщиеПараметры.ОрганизацияНазвание = ОрганизацияНазвание;
	ОбщиеПараметры.ОрганизацияИНН = ОрганизацияИНН;
	
    // Формато-логический контроль - "ПеречислениеСсылка.СпособыФорматоЛогическогоКонтроля"
	//ОбщиеПараметры.СпособФорматоЛогическогоКонтроля = Неопределено; // Перечисление,Необязательно - Способ формато-логического контроля. 
	//ОбщиеПараметры.ДопустимоеРасхождениеФорматоЛогическогоКонтроля = 0; // Число,Необязательно - устанавливается значение по умолчанию. 
    
    // Формирование табличной части
	//СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	//
	//СтрокаПозицииЧека.Наименование = "Товарная позиция";
	//СтрокаПозицииЧека.Количество   = 3;
	//СтрокаПозицииЧека.Сумма        = 330;
	//СтрокаПозицииЧека.НомерСекции  = 1;
	//СтрокаПозицииЧека.СтавкаНДС    = 20;
	//
	//// Может рассчитываться автоматически при использовании функции формато-логический контроля.
	//СтрокаПозицииЧека.ЦенаСоСкидками = 110; // Обязательно, Цена с учета скидок и наценок (Необходимо начиная с ФФД 1.0.5 и выше)
	//// Реквизиты начиная с ФФД 1.0.5
	//СтрокаПозицииЧека.ПризнакСпособаРасчета = ТипыПризнакаСпособаРасчета; 
	//                                        // Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	//// Признаки агента и агенские реквизиты. Для ККТ по ФФД 1.0.5 и выше.
	//СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = ПризнакПредметаРасчета;       // Перечисление - ПризнакиАгента
	//СтрокаПозицииЧека.ДанныеПоставщика.Телефон       = ДанныеПоставщикаТелефон;      // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеПоставщика.Наименование  = ДанныеПоставщикаНаименование; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеПоставщика.ИНН           = ДанныеПоставщикаИНН;          // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Операция       = ПлатежныйАгентОперация;  // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Телефон        = ПлатежныйАгентТелефон;   // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Телефон      = ОператорПереводаТелефон; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Наименование = ОператорПереводаНаименование; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Адрес        = ОператорПереводаАдрес;   // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.ИНН          = ОператорПереводаИНН;     // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = ОператорПоПриемуПлатежейТелефон; // Строка, Необязательно
	//ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
Для Каждого Строка Из ТаблицаЧекаККМ Цикл
    СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	
	СтрокаПозицииЧека.Наименование = Строка.Наименование;
	СтрокаПозицииЧека.Количество = Строка.Количество;
	//СтрокаПозицииЧека.Цена = Строка.Цена; // Обязательно, Цена без учета скидок и наценок (Необходимо для ФР и ФФД 1.0)
	СтрокаПозицииЧека.Сумма = Строка.Сумма;

	СтрокаПозицииЧека.НомерСекции = Строка.НомерСекции;

	//СтрокаПозицииЧека.СтавкаНДС = Неопределено;
	Если НЕ (Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка") 
	         ИЛИ ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств"))
	Тогда
		Если Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
			СтрокаПозицииЧека.СтавкаНДС =  Неопределено;
		Иначе	
			СтрокаПозицииЧека.СтавкаНДС =  ДокументыСервер.СтавкаНДСЧисло(Строка.СтавкаНДС);
		КонецЕсли;	
	КонецЕсли;	
	
    // Может рассчитываться автоматически при использовании функции формато-логический контроля.
    СтрокаПозицииЧека.ЦенаСоСкидками = Строка.Цена; // Обязательно, Цена с учета скидок и наценок (Необходимо начиная с ФФД 1.0.5 и выше)

	
	//СтрокаПозицииЧека.ПризнакСпособаРасчета = ТипыПризнакаСпособаРасчета; 
	//                                        // Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	// Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	Если ЭтоАванс Тогда
		СтрокаПозицииЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.Аванс");
	Иначе	
		СтрокаПозицииЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой");// Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	КонецЕсли;	
	
	//ТекущийПользователь = ОбщийФункционалСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
	//ТекущийПользовательНаименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущийПользователь, "Наименование");

	//Если ТекущийПользовательНаименование = "Администратор" Тогда
		Если ЭтоАванс Тогда 
			СтрокаПозицииЧека.ПризнакПредметаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Платеж");
		Иначе
			СтрокаПозицииЧека.ПризнакПредметаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Услуга");
		КонецЕсли;
	//КонецЕсли;	
		
	ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
КонецЦикла;		
	
    // Формирование таблицы оплат
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); // Наличная оплата
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
Если СуммаНалЧекККМ > 0 Тогда
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); // Наличная оплата
	СтрокаОплаты.Сумма = СуммаНалЧекККМ;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
КонецЕсли;

	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = Перечисление.ТипыОплатыККТ.Электронно; // Сумма электронной оплаты
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
Если СуммаБезналЧекККМ > 0 Тогда
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"); // Сумма электронной оплаты
	СтрокаОплаты.Сумма = СуммаБезналЧекККМ;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
КонецЕсли;

	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"); // Сумма постоплатой (в кредит)
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	//
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"); // Сумма предоплатой (зачетом аванса)
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	
Если СуммаПредыдущихОплат > 0 Тогда
	
	СуммаКОплате = ТаблицаЧекаККМ.Итог("Сумма");
	СуммаКредит = СуммаКОплате - СуммаПредыдущихОплат - СуммаБезналЧекККМ - СуммаНалЧекККМ;
	Если СуммаКредит > 0 Тогда
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"); // Сумма постоплатой (в кредит)
		СтрокаОплаты.Сумма = СуммаКредит;
		ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	КонецЕсли;	
	
	СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"); // Сумма предоплатой (зачетом аванса)

	СтрокаОплаты.Сумма = СуммаПредыдущихОплат;
	ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
КонецЕсли;
	
	
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление"); // Сумма встречным предоставлением
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
    
    Возврат ОбщиеПараметры;
    
КонецФункции

Функция ПолучитьШаблонЧека_Образец()
	//
	//// Общие параметры чека
	//ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека();
	//
	//// Параметры установлены по умолчанию.
	//ОбщиеПараметры.ТипРасчета        = ТипРасчета; // Перечисление "ТипыРасчетаДенежнымиСредствами"
	//ОбщиеПараметры.Электронно        = Ложь;       // Если Электронно = Истина, то чек будет предоставлен в элетронной форме, без печати.
	//ОбщиеПараметры.Отправляет1СSMS   = Ложь;       // SMS отправляет средствами 1C.
	//ОбщиеПараметры.Отправляет1СEmail = Ложь;       // Email отправляет средствами 1C.
	//ОбщиеПараметры.ПокупательEmail   = Неопределено;
	//ОбщиеПараметры.ПокупательНомер   = Неопределено;
	//
	//// Параметры необходимые для чека ЕНВД на принтере чеков
	//ОбщиеПараметры.Кассир    = "Иванов И.И"; // Строка, Обязательно - ФИО лица, осуществившего расчет 
	//                                         // с покупателем (клиентом), оформившего кассовый чек.
	//ОбщиеПараметры.КассирИНН = КассирИНН;    // Строка, Необязательно - Идентификационный номер налогоплательщика кассира, при наличии.
	//ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН"); 
	//                                         // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ"
	//
	//// Параметры необходимые для чека ЕНВД на принтере чеков
	//ОбщиеПараметры.ОрганизацияНазвание = "ООО ""1C-СОФТ""";
	//ОбщиеПараметры.ОрганизацияИНН      = "7709860400";
	//ОбщиеПараметры.ОрганизацияКПП      = "770901001";
	//ОбщиеПараметры.НомерКассы          = "00001";
	//ОбщиеПараметры.НомерЧека           = "1";
	//ОбщиеПараметры.НомерСмены          = "1";
	//
	//// Формато-логический контроль - "ПеречислениеСсылка.СпособыФорматоЛогическогоКонтроля"
	//ОбщиеПараметры.СпособФорматоЛогическогоКонтроля = Неопределено; // Перечисление,Необязательно - Способ формато-логического контроля. 
	//ОбщиеПараметры.ДопустимоеРасхождениеФорматоЛогическогоКонтроля = 0; // Число,Необязательно - устанавливается значение по умолчанию. 
	//
	//// Формирование табличной части
	//СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	//СтрокаПозицииЧека.Наименование = "Товарная позиция";
	//СтрокаПозицииЧека.Количество   = 3;
	//СтрокаПозицииЧека.Сумма        = 330;
	//СтрокаПозицииЧека.НомерСекции  = 1;
	//СтрокаПозицииЧека.СтавкаНДС    = 20;
	//
	//// Может рассчитываться автоматически при использовании функции формато-логический контроля.
	//СтрокаПозицииЧека.ЦенаСоСкидками = 110; // Обязательно, Цена с учета скидок и наценок (Необходимо начиная с ФФД 1.0.5 и выше)
	//// Реквизиты начиная с ФФД 1.0.5
	//СтрокаПозицииЧека.ПризнакСпособаРасчета = ТипыПризнакаСпособаРасчета; 
	//                                        // Перечисление - ТипыПризнакаСпособаРасчет, Признак способа расчета. Обязательно для ФФД 1.0.5 и выше.
	//// Признаки агента и агенские реквизиты. Для ККТ по ФФД 1.0.5 и выше.
	//СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = ПризнакПредметаРасчета;       // Перечисление - ПризнакиАгента
	//СтрокаПозицииЧека.ДанныеПоставщика.Телефон       = ДанныеПоставщикаТелефон;      // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеПоставщика.Наименование  = ДанныеПоставщикаНаименование; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеПоставщика.ИНН           = ДанныеПоставщикаИНН;          // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Операция       = ПлатежныйАгентОперация;  // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ПлатежныйАгент.Телефон        = ПлатежныйАгентТелефон;   // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Телефон      = ОператорПереводаТелефон; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Наименование = ОператорПереводаНаименование; // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.Адрес        = ОператорПереводаАдрес;   // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПеревода.ИНН          = ОператорПереводаИНН;     // Строка, Необязательно
	//СтрокаПозицииЧека.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = ОператорПоПриемуПлатежейТелефон; // Строка, Необязательно
	//ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	//
	//// Формирование таблицы оплат
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); // Наличная оплата
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	//
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = Перечисление.ТипыОплатыККТ.Электронно; // Сумма электронной оплаты
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	//
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"); // Сумма постоплатой (в кредит)
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	//
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"); // Сумма предоплатой (зачетом аванса)
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	//
	//СтрокаОплаты           = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
	//СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление"); // Сумма встречным предоставлением
	//СтрокаОплаты.Сумма     = 100;
	//ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	//
	//Возврат ОбщиеПараметры;
	//
КонецФункции

Процедура ПоказатьПодтверждениеСообщение(Результат) Экспорт
ОшибкаОперации = Результат.ОшибкаОперации;
ОшибкаЭТ = Результат.ОшибкаЭТ;
ТекстПредупреждения = Результат.ТекстПредупреждения;
ТекстСообщения = Результат.ТекстСообщения;

Если ОшибкаОперации тогда 
	Если НЕ ОшибкаЭТ Тогда
		ТекстПредупреждения_ФС = Новый ФорматированнаяСтрока(ТекстПредупреждения + Символы.ПС + Символы.ПС
			, Новый Шрифт(, 11, Истина), WebЦвета.Коричневый);
		ДополнениеСтрока = Новый ФорматированнаяСтрока("После устранения ошибки" 
				+ Символы.ПС + "НЕ ЗАБУДЬТЕ ОФОРМИТЬ КАССОВЫЙ ЧЕК !!!"
			, Новый Шрифт(, 12, Истина), WebЦвета.Красный);
		ТекстПредупреждения_ФС = Новый ФорматированнаяСтрока(ТекстПредупреждения_ФС, ДополнениеСтрока);
		ПоказатьПредупреждение(, ТекстПредупреждения_ФС); 
		
		ТекстСообщения_П = ТекстСообщения + Символы.ПС + "ПОСЛЕ УСТРАНЕНИЯ ОШИБКИ НЕ ЗАБУДЬТЕ ОФОРМИТЬ КАССОВЫЙ ЧЕК !!!" 
	Иначе
		ПоказатьПредупреждение(, ТекстПредупреждения);
		ТекстСообщения_П = ТекстСообщения;
	КонецЕсли;
	
	Сообщить(ТекстСообщения_П);
Иначе
	ПоказатьПредупреждение(, ТекстПредупреждения);
КонецЕсли;
КонецПроцедуры
