
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Контрагенты = Параметры.КонтрагентыСписокЗначений;
Элементы.Контрагент.СписокВыбора.ЗагрузитьЗначения(Контрагенты.ВыгрузитьЗначения());
Элементы.Контрагент.РежимВыбораИзСписка = Истина;

Контрагент = Контрагенты.НайтиПоИдентификатору(0).Значение;

Если Контрагенты.Количество() > 1 Тогда
	Элементы.Контрагент.Заголовок = "ВыберитеКонтрагента";
	Элементы.Контрагент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветОсобогоТекста;
	Элементы.Контрагент.ТолькоПросмотр = Ложь;
	
Иначе
	Элементы.Контрагент.Заголовок = "Контрагент";
	Элементы.Контрагент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаПоля;
	Элементы.Контрагент.ТолькоПросмотр = Истина;
КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ВестиДанные(Команда)
Результат = Новый Структура();
Результат.Вставить("Контрагент", Контрагент); 
Результат.Вставить("СуммаАванса", СуммаЧекаНаАванс); 

Закрыть(Результат);
КонецПроцедуры




