
Процедура ОбычныйИнтерфейс() Экспорт
НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();

// Очистить настройки состава.
НастройкиСостава.Верх.Очистить();
НастройкиСостава.Лево.Очистить();
НастройкиСостава.Низ.Очистить();
НастройкиСостава.Право.Очистить();

//ПанельИнструментов = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов");
ПанельОткрытых = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых");

//НастройкиСостава.Верх.Добавить(ПанельИнструментов);
//НастройкиСостава.Низ.Добавить(ПанельОткрытых);

НастройкиСостава.Верх.Добавить(ПанельОткрытых);

НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);
КонецПроцедуры

Функция ПользовательТолькоПросмотр() Экспорт
ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;

Возврат ТекущийПользователь.ТолькоПросмотр; 	
КонецФункции

Функция УстановитьТолькоПросмотр(Форма) Экспорт
Если РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр() Тогда 
	Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Форма.ТолькоПросмотр = Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции
