
Функция ТЗ_ОтчетДанные(ДатаС, ДатаПо) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.Номер КАК Номер,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеПроживание.ГУИД КАК ГУИД,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.КолВоЧеловек КАК КолВоЧеловек,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.Бронирует КАК Бронирует,
                      |	ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
                      |	ЗаявкаНаБронированиеПроживание.Тариф КАК Тариф,
                      |	ЗаявкаНаБронированиеПроживание.Сумма КАК Сумма,
                      |	ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидки,
                      |	ЗаявкаНаБронированиеПроживание.ПроцентСкидкиКлиента КАК ПроцентСкидкиКлиента,
                      |	ЗаявкаНаБронированиеПроживание.Цена КАК Цена,
                      |	ЗаявкаНаБронированиеПроживание.Количество КАК Количество
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД КАК ДолгиГУИД
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД) КАК Счет
                      |		ПО ЗаявкаНаБронированиеПроживание.Ссылка = Счет.Ссылка
                      |			И ЗаявкаНаБронированиеПроживание.ГУИД = Счет.ДолгиГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И (ЗаявкаНаБронированиеПроживание.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает)
                      |			ИЛИ ЗаявкаНаБронированиеПроживание.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                      |			ИЛИ ЗаявкаНаБронированиеПроживание.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
                      |	И ЗаявкаНаБронированиеПроживание.ДеньПроживания >= &ДатаС
                      |	И ЗаявкаНаБронированиеПроживание.ДеньПроживания <= &ДатаПо
                      |	И ЗаявкаНаБронированиеПроживание.Ссылка.БонШанс = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Номер");
	
Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
ТЗ_Проживание = Запрос.Выполнить().Выгрузить();

ТЗ_Заявки = ТЗ_Проживание.Скопировать(,"Заявка");
ТЗ_Заявки.Свернуть("Заявка");
МассивЗаявки = ТЗ_Заявки.ВыгрузитьКолонку("Заявка");

ТЗ_Проживание.Колонки.Добавить("КоличествоДвухместныеРазмещения", Новый ОписаниеТипов("Число")); 
ТЗ_Проживание.Колонки.Добавить("КоличествоОдноместныеРазмещения", Новый ОписаниеТипов("Число")); 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеДопУслуги.ГУИД КАК ГУИД,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена КАК Цена,
                      |	ЗаявкаНаБронированиеДопУслуги.Количество КАК Количество,
                      |	ЗаявкаНаБронированиеДопУслуги.ВСчет КАК ВСчет,
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК Сумма,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК СуммаУслугиДолг,
                      |	ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка
                      |			И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка В(&Заявки)
                      |	И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги >= &ДатаС
                      |	И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги <= &ДатаПо");

Запрос.УстановитьПараметр("Заявки", МассивЗаявки);
Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
ТЗ_УслугиЗаявки = Запрос.Выполнить().Выгрузить();	

Запрос = Новый Запрос ("ВЫБРАТЬ
                       |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                       |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                       |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
                       |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты
                       |ИЗ
                       |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |ГДЕ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка В (&Заявки)");


Запрос.УстановитьПараметр("Заявки", МассивЗаявки);
ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();

ПроцентыЭквайринга = ПроцентыЭквайрингаЗагрузить();

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Отель = ТекущаяОрганизация.Наименование;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоНомеров
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд
                      |ГДЕ
                      |	НомернойФонд.ПометкаУдаления = ЛОЖЬ");

ТЗ = Запрос.Выполнить().Выгрузить();
КоличествоНомеровОтель = ТЗ[0].КоличествоНомеров;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЕжедневныйОтчетФакт.Дата КАК Дата,
                      |	ЕжедневныйОтчетФакт.Отель КАК Отель,
                      |	ЕжедневныйОтчетФакт.КоличествоНомеров КАК КоличествоНомеров,
                      |	ЕжедневныйОтчетФакт.КоличествоДвухместныеРазмещения КАК КоличествоДвухместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаДвухместныеРазмещения КАК СуммаДвухместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.КоличествоОдноместныеРазмещения КАК КоличествоОдноместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаОдноместныеРазмещения КАК СуммаОдноместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаАгентскогоВознаграждения КАК СуммаАгентскогоВознаграждения,
                      |	ЕжедневныйОтчетФакт.Процент_НА КАК Процент_НА,
                      |	ЕжедневныйОтчетФакт.ADR_НА КАК ADR_НА,
                      |	ЕжедневныйОтчетФакт.Мероприятия КАК Мероприятия
                      |ИЗ
                      |	РегистрСведений.ЕжедневныйОтчетФакт КАК ЕжедневныйОтчетФакт
                      |ГДЕ
                      |	ЕжедневныйОтчетФакт.Дата = &Дата");
					  
Запрос.УстановитьПараметр("Дата", Неопределено);					  
ТЗ_ОтчетДанные = Запрос.Выполнить().Выгрузить();

ТЗ_ОтчетДанные.Колонки.Добавить("СуммаКомиссии");
ТЗ_ОтчетДанные.Колонки.Добавить("СуммаВ2В");

ДТ = ДатаС;
Пока ДТ <= ДатаПо Цикл
	//ОтборСтроки = Новый Структура("ДеньПроживания", ДТ);
	//НайденныеСтрокиДолги = ТЗ_Проживание.НайтиСтроки(ОтборСтроки);
	//
	//Если НайденныеСтрокиДолги.Количество() = 0 Тогда
	//	НоваяСтрока = ТЗ_ОтчетДанные.Добавить();
	//	
	//	НоваяСтрока.Дата = ДТ;
	//	НоваяСтрока.Отель = Отель;
	//	НоваяСтрока.КоличествоНомеров = КоличествоНомеровОтель;
	//	
	//	Перейти ~ПРОДОЛЖИТЬ;
	//КонецЕсли;	
	
	Для Каждого Заявка Из МассивЗаявки Цикл 
		
	//Для Каждого СтрокаДолги Из НайденныеСтрокиДолги Цикл 
		
		ОтборСтроки = Новый Структура(" Заявка, ДеньПроживания", Заявка, ДТ);
		НайденныеСтрокиДолги = ТЗ_Проживание.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтрокиДолги.Количество() = 0 Тогда
			НоваяСтрока = ТЗ_ОтчетДанные.Добавить();
			
			НоваяСтрока.Дата = ДТ;
			НоваяСтрока.Отель = Отель;
			НоваяСтрока.КоличествоНомеров = КоличествоНомеровОтель;
			
			//Перейти ~ПРОДОЛЖИТЬ;
			Продолжить;	
		КонецЕсли;		
		
		СтрокаДолги = НайденныеСтрокиДолги[0];
		
		ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(СтрокаДолги.Заявка.Бронирует, СтрокаДолги.Заявка.РезервС);	
		
		ОтборСтроки = Новый Структура("Заявка", СтрокаДолги.Заявка);
		ТЗ_Услуги = ТЗ_УслугиЗаявки.Скопировать(ОтборСтроки);
		
		СуммаКомиссии_П = ДокументыСервер.СуммаКомиссии(СтрокаДолги.Заявка, СтрокаДолги.СуммаБезСкидки, СтрокаДолги.Заявка.Счета
			, СтрокаДолги.Заявка.СчетаДетальноДолги, ТЗ_Услуги, ПроцентКомиссии);   
		
		СуммаКомиссии = Окр(СуммаКомиссии_П, 2); 
		
		ПроцентВ2В = ДокументыСервер.ПроцентВ2В(СтрокаДолги.Заявка.Бронирует, СтрокаДолги.Заявка.РезервС);
		СуммаВ2В_П = ДокументыСервер.СуммаВ2В(СтрокаДолги.Заявка, ПроцентВ2В, СтрокаДолги);
		СуммаВ2В = Окр(СуммаВ2В_П); 
		
		СуммаКомиссииПроживание = СуммаКомиссии + СуммаВ2В;
		
		ОтборСтроки = Новый Структура("Ссылка, ДолгиГУИД", СтрокаДолги.Заявка, СтрокаДолги.ГУИД);
		НайденныеОплаты = ТЗ_Оплаты.НайтиСтроки(ОтборСтроки);
		СуммаЭквайринга = 0;
		Для Каждого СтрокаОплаты Из НайденныеОплаты Цикл
			Если ЗначениеЗаполнено(СтрокаОплаты.ДокументОплаты) Тогда
				ДатаОплаты_П = СтрокаОплаты.ДокументОплаты.ДатаОплаты;
			Иначе
				ДатаОплаты_П = '00010101';
			КонецЕсли;

			ПроцентыЭквайринга_П = ПроцентыЭквайринга(ПроцентыЭквайринга, ДатаОплаты_П);
			ПроцентЭквайринга = ПроцентыЭквайринга_П.ПроцентЭквайринга;
			ПроцентЭквайрингаСБП = ПроцентыЭквайринга_П.ПроцентЭквайрингаСБП;
			
			СуммаЭквайринга = СуммаЭквайринга + СуммаЭквайринга(СтрокаОплаты, ПроцентЭквайринга, ПроцентЭквайрингаСБП); 				
		КонецЦикла;
		
		НоваяСтрока = ТЗ_ОтчетДанные.Добавить();
		
		НоваяСтрока.СуммаКомиссии = СуммаКомиссии;
		НоваяСтрока.СуммаВ2В = СуммаВ2В;
		
		НоваяСтрока.Дата = ДТ;
		НоваяСтрока.Отель = Отель;
		НоваяСтрока.КоличествоНомеров = КоличествоНомеровОтель;
		
		Если СтрокаДолги.КолвоЧеловек < 2 Тогда
			//НоваяСтрока.КоличествоОдноместныеРазмещения = 1;
			НоваяСтрока.КоличествоОдноместныеРазмещения = СтрокаДолги.Количество;
			НоваяСтрока.КоличествоДвухместныеРазмещения = 0;
			Если СтрокаДолги.Бронирует.Турагентство Тогда
				СуммаОдноместныеРазмещения = СтрокаДолги.СуммаБезСкидки - СуммаКомиссииПроживание;
				СуммаАгентскогоВознаграждения = СуммаКомиссииПроживание;
			Иначе	
				СуммаОдноместныеРазмещения = СтрокаДолги.Сумма;
				СуммаАгентскогоВознаграждения = 0;
			КонецЕсли;
			
			СуммаОдноместныеРазмещения = СуммаОдноместныеРазмещения - СуммаЭквайринга; 
			НоваяСтрока.СуммаОдноместныеРазмещения = СуммаОдноместныеРазмещения;
			НоваяСтрока.СуммаАгентскогоВознаграждения = СуммаАгентскогоВознаграждения;
		Иначе
			//НоваяСтрока.КоличествоДвухместныеРазмещения =  1;
			НоваяСтрока.КоличествоДвухместныеРазмещения =  СтрокаДолги.Количество;
			НоваяСтрока.КоличествоОдноместныеРазмещения = 0;
			Если СтрокаДолги.Бронирует.Турагентство Тогда
				СуммаДвухместныеРазмещения = СтрокаДолги.СуммаБезСкидки - СуммаКомиссииПроживание;
				СуммаАгентскогоВознаграждения = СуммаКомиссииПроживание;
			Иначе	
				СуммаДвухместныеРазмещения = СтрокаДолги.Сумма;
				СуммаАгентскогоВознаграждения = 0;
			КонецЕсли;
			
			СуммаДвухместныеРазмещения = СуммаДвухместныеРазмещения - СуммаЭквайринга; 
			НоваяСтрока.СуммаДвухместныеРазмещения = СуммаДвухместныеРазмещения;
			НоваяСтрока.СуммаАгентскогоВознаграждения = СуммаАгентскогоВознаграждения;
		КонецЕсли;
	КонецЦикла;
	
~ПРОДОЛЖИТЬ: 
 	ДТ = ДТ + 24*60*60;
КонецЦикла;

ТЗ_ОтчетДанные.Свернуть("Дата, Отель, КоличествоНомеров",
	"КоличествоОдноместныеРазмещения, СуммаОдноместныеРазмещения, КоличествоДвухместныеРазмещения, СуммаДвухместныеРазмещения" 
	+ ", СуммаАгентскогоВознаграждения, СуммаВ2В, СуммаКомиссии");
	
ТЗ_ОтчетДанные.Колонки.Добавить("Мероприятия");	
	
Для Каждого Строка Из ТЗ_ОтчетДанные Цикл
	ЗапросМероприятия = Новый Запрос("ВЫБРАТЬ
		                                 |	Мероприятия.Ссылка КАК Ссылка,
		                                 |	Мероприятия.Наименование КАК Наименование,
		                                 |	Мероприятия.ДатаС КАК ДатаС,
		                                 |	Мероприятия.ДатаПо КАК ДатаПо,
		                                 |	Мероприятия.ТипМероприятия КАК ТипМероприятия,
		                                 |	Мероприятия.Мероприятие КАК Мероприятие
		                                 |ИЗ
		                                 |	Справочник.Мероприятия КАК Мероприятия
		                                 |ГДЕ
		                                 |	Мероприятия.ПометкаУдаления = ЛОЖЬ
		                                 |	И Мероприятия.ДатаС <= &Дата
		                                 |	И Мероприятия.ДатаПо >= &Дата
		                                 |
		                                 |УПОРЯДОЧИТЬ ПО
		                                 |	ДатаС");
		
		ЗапросМероприятия.УстановитьПараметр("Дата", Строка.Дата);
		ТЗМероприятия = ЗапросМероприятия.Выполнить().Выгрузить();
		Мероприятия = "";
		Для Каждого СтрокаТЗМероприятия Из ТЗМероприятия Цикл
			Мероприятие = ?(ЗначениеЗаполнено(СтрокаТЗМероприятия.Мероприятие), СтрокаТЗМероприятия.Мероприятие, СтрокаТЗМероприятия.Наименование);
			Мероприятия = Мероприятия + Мероприятие + Символы.ПС;
		КонецЦикла;
		Если Мероприятия <> "" Тогда 
			Мероприятия = Лев(Мероприятия, СтрДлина(Мероприятия) - 1);
		КонецЕсли; 
	
		Строка.Мероприятия = Мероприятия;		
КонецЦикла;

Для Каждого Строка Из ТЗ_ОтчетДанные Цикл
	Строка.СуммаАгентскогоВознаграждения = Строка.СуммаКомиссии + Строка.СуммаВ2В; 	
КонецЦикла;
	
Возврат ТЗ_ОтчетДанные;
КонецФункции

Функция ПроцентыЭквайрингаЗагрузить() Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП,
                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга КАК ДатаУстановкиПроцентаЭквайринга
                      |ИЗ
                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");


ТЗ = Запрос.Выполнить().Выгрузить();
ТЗ.Сортировать("ДатаУстановкиПроцентаЭквайринга УБЫВ");

Возврат ТЗ;
КонецФункции

Функция ПроцентыЭквайринга(ПроцентыЭквайринга, ДатаУстановкиПроцентаЭквайринга)
ПроцентЭквайринга = 0; ПроцентЭквайрингаСБП = 0;

Для Каждого Строка Из ПроцентыЭквайринга Цикл
	Если Строка.ДатаУстановкиПроцентаЭквайринга > ДатаУстановкиПроцентаЭквайринга 
	Тогда Продолжить; КонецЕсли;
		
	ПроцентЭквайринга = Строка.ПроцентЭквайринга;
	ПроцентЭквайрингаСБП = Строка.ПроцентЭквайринга;
	Прервать;
КонецЦикла;
	
Возврат Новый Структура("ПроцентЭквайринга, ПроцентЭквайрингаСБП", ПроцентЭквайринга, ПроцентЭквайрингаСБП); 	
КонецФункции

Функция СуммаЭквайринга(СтрокаОплата, ПроцентЭквайринга, ПроцентЭквайрингаСБП) Экспорт
ПроцентЭквайринга_П = ПроцентЭквайринга;

Если СтрокаОплата.ДокументОплаты.ВидОперации = Справочники.ВидыОпераций.оverbooking Тогда 
   	Сумма = 0;

ИначеЕсли ТипЗнч(СтрокаОплата.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда 
	Если СтрокаОплата.ДокументОплаты.СуммаНаличные > 0 
	И СтрокаОплата.ДокументОплаты.СуммаКарта = 0	Тогда
       	Сумма = 0;
	ИначеЕсли СтрокаОплата.ДокументОплаты.СуммаНаличные = 0 
	И СтрокаОплата.ДокументОплаты.СуммаКарта > 0	Тогда
		Сумма = СтрокаОплата.СуммаОплаты;
	Иначе
		Сумма = Окр(СтрокаОплата.СуммаОплаты * (СтрокаОплата.ДокументОплаты.СуммаКарта / СтрокаОплата.ДокументОплаты.Сумма), 2);
	КонецЕсли;		
ИначеЕсли ТипЗнч(СтрокаОплата.ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда 
	Если СтрокаОплата.ДокументОплаты.ЭтоЭквайринг Тогда
		Индекс = СтрНайти(СтрокаОплата.ДокументОплаты.ТекстПлатежа, "СБП");
		Если Индекс > 0 Тогда
	        Сумма = СтрокаОплата.СуммаОплаты;
			ПроцентЭквайринга_П = ПроцентЭквайрингаСБП;
		Иначе
			Сумма = СтрокаОплата.СуммаОплаты;
		КонецЕсли;
	Иначе
		Сумма = 0; 
	КонецЕсли;		
Иначе	
	Сумма = 0; 
КонецЕсли;

СуммаЭквайринга = Окр(Сумма * ПроцентЭквайринга_П / 100, 2);     

Возврат СуммаЭквайринга; 
КонецФункции

Процедура ДобавитьРегистрЕжедневныйОтчетФакт(Дата, Отель)
	
ДТ = НачалоМесяца(Дата);	
ДатаПо_П = КонецМесяца(Дата);	
Пока ДТ <= ДатаПо_П Цикл
	МенеджерЗаписи = РегистрыСведений.ЕжедневныйОтчетФакт.СоздатьМенеджерЗаписи();	
	
	МенеджерЗаписи.Дата = ДТ;
	МенеджерЗаписи.Отель = Отель;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Записать();
	
	ДТ = ДТ + 24*60*60;
КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьРегистрЕжедневныйОтчетФакт(ТЗ_ОтчетДанные) Экспорт
	
Для Каждого Строка Из ТЗ_ОтчетДанные Цикл
	МенеджерЗаписи = РегистрыСведений.ЕжедневныйОтчетФакт.СоздатьМенеджерЗаписи();	
	
	МенеджерЗаписи.Дата = Строка.Дата;
	МенеджерЗаписи.Отель = Строка.Отель;
	МенеджерЗаписи.Месяц = НачалоМесяца(Строка.Дата);
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Дата = Строка.Дата;
	МенеджерЗаписи.Отель = Строка.Отель;
	МенеджерЗаписи.Месяц = НачалоМесяца(Строка.Дата);
	
	МенеджерЗаписи.КоличествоНомеров = Строка.КоличествоНомеров;
	МенеджерЗаписи.КоличествоДвухместныеРазмещения = Строка.КоличествоДвухместныеРазмещения;
	МенеджерЗаписи.СуммаДвухместныеРазмещения = Строка.СуммаДвухместныеРазмещения;
	МенеджерЗаписи.КоличествоОдноместныеРазмещения = Строка.КоличествоОдноместныеРазмещения;
	МенеджерЗаписи.СуммаОдноместныеРазмещения = Строка.СуммаОдноместныеРазмещения;
	МенеджерЗаписи.СуммаАгентскогоВознаграждения = Строка.СуммаАгентскогоВознаграждения;
	
	МенеджерЗаписи.СуммаВ2В = Строка.СуммаВ2В;
	МенеджерЗаписи.СуммаКомиссии = Строка.СуммаКомиссии;
	
	МенеджерЗаписи.Мероприятия = Строка.Мероприятия;
	
	МенеджерЗаписи.Записать();
КонецЦикла;	
	
КонецПроцедуры

Функция РегистрЕжедневныйОтчетФактВыгрузить(ДатаС, ДатаПо) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЕжедневныйОтчетФакт.Дата КАК Дата,
                      |	ЕжедневныйОтчетФакт.Отель КАК Отель,
                      |	ЕжедневныйОтчетФакт.КоличествоНомеров КАК КоличествоНомеров,
                      |	ЕжедневныйОтчетФакт.КоличествоДвухместныеРазмещения КАК КоличествоДвухместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаДвухместныеРазмещения КАК СуммаДвухместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.КоличествоОдноместныеРазмещения КАК КоличествоОдноместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаОдноместныеРазмещения КАК СуммаОдноместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаАгентскогоВознаграждения КАК СуммаАгентскогоВознаграждения,
                      |	ЕжедневныйОтчетФакт.Процент_НА КАК Процент_НА,
                      |	ЕжедневныйОтчетФакт.ADR_НА КАК ADR_НА,
                      |	ЕжедневныйОтчетФакт.Мероприятия КАК Мероприятия
                      |ИЗ
                      |	РегистрСведений.ЕжедневныйОтчетФакт КАК ЕжедневныйОтчетФакт
                      |ГДЕ
                      |	ЕжедневныйОтчетФакт.Дата >= &ДатаС
                      |	И ЕжедневныйОтчетФакт.Дата <= &ДатаПо");

Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

Возврат  ТЗ;
КонецФункции

//
Функция СформироватьЕжедневныйОтчетСводный(Данные) Экспорт
ТабДок = Новый ТабличныйДокумент;	

ДатаС = Данные.ДатаС;
ДатаПо = Данные.ДатаПо;

МассивЛайв = Данные.МассивЛайв;
МассивРеноме = Данные.МассивРеноме;
МассивЧехов = Данные.МассивЧехов;
МассивДомСоветов = Данные.МассивДомСоветов;
МассивСтритАрт = Данные.МассивСтритАрт;
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЕжедневныйОтчетФакт.Дата КАК Дата,
                      |	ЕжедневныйОтчетФакт.Отель КАК Отель,
                      |	ЕжедневныйОтчетФакт.Месяц КАК Месяц,
                      |	ЕжедневныйОтчетФакт.КоличествоНомеров КАК КоличествоНомеров,
                      |	ЕжедневныйОтчетФакт.КоличествоДвухместныеРазмещения КАК КоличествоДвухместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаДвухместныеРазмещения КАК СуммаДвухместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.КоличествоОдноместныеРазмещения КАК КоличествоОдноместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаОдноместныеРазмещения КАК СуммаОдноместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаАгентскогоВознаграждения КАК СуммаАгентскогоВознаграждения,
                      |	ЕжедневныйОтчетФакт.Процент_НА КАК Процент_НА,
                      |	ЕжедневныйОтчетФакт.ADR_НА КАК ADR_НА,
                      |	ЕжедневныйОтчетФакт.СуммаВ2В КАК СуммаВ2В,
                      |	ЕжедневныйОтчетФакт.СуммаКомиссии КАК СуммаКомиссии,
                      |	ЕжедневныйОтчетФакт.Мероприятия КАК Мероприятия
                      |ИЗ
                      |	РегистрСведений.ЕжедневныйОтчетФакт КАК ЕжедневныйОтчетФакт
                      |ГДЕ
                      |	ЕжедневныйОтчетФакт.Дата = ДАТАВРЕМЯ(1, 1, 1)"); 	
	


ТЗ_Данные = Запрос.Выполнить().Выгрузить(); 
ТЗ_Данные.Колонки.Добавить("СортировкаОтель", Новый ОписаниеТипов("Число"));
Для Каждого Строка Из МассивРеноме Цикл
	НоваяСтрока = ТЗ_Данные.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.СортировкаОтель = 1; 
КонецЦикла;

Для Каждого Строка Из МассивЛайв Цикл
	НоваяСтрока = ТЗ_Данные.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.СортировкаОтель = 2; 
КонецЦикла;

Для Каждого Строка Из МассивЧехов Цикл
	НоваяСтрока = ТЗ_Данные.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.СортировкаОтель = 3; 
КонецЦикла;

Для Каждого Строка Из МассивДомСоветов Цикл
	НоваяСтрока = ТЗ_Данные.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.СортировкаОтель = 4; 
КонецЦикла;

Для Каждого Строка Из МассивСтритАрт Цикл
	НоваяСтрока = ТЗ_Данные.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.СортировкаОтель = 5; 
КонецЦикла;

ТЗ_Данные.Сортировать("Дата, СортировкаОтель"); 

ТабДок.Очистить();	

Макет = Обработки.ЕжедневныйОтчетФактСводный.ПолучитьМакет("Макет");

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

ИтогиДень = Новый Структура;
ИтогиДень.Вставить("Дата");

ИтогиДень.Вставить("КоличествоДвухместныеРазмещения", 0);
ИтогиДень.Вставить("СуммаДвухместныеРазмещения", 0);
ИтогиДень.Вставить("ADRДвухместныеРазмещения", 0);
ИтогиДень.Вставить("ПроцентДвухместныеРазмещения", 0);
ИтогиДень.Вставить("КоличествоОдноместныеРазмещения", 0);
ИтогиДень.Вставить("СуммаОдноместныеРазмещения", 0);
ИтогиДень.Вставить("ADRОдноместныеРазмещения", 0);
ИтогиДень.Вставить("ПроцентОдноместныеРазмещения", 0);
ИтогиДень.Вставить("СуммаАгентскогоВознаграждения", 0);
ИтогиДень.Вставить("ИтогоЗанятыеНомера", 0);
ИтогиДень.Вставить("ПроцентЗаселяемости", 0);
ИтогиДень.Вставить("ИтогоСумма", 0);
ИтогиДень.Вставить("ИтогоСредняяСтоимость", 0);

Итоги = ОбщийФункционалСервер.СкопироватьСтруктуру(ИтогиДень);

ДТ = ДатаС;

ИтогиКоличество = 0;
Пока ДТ <= ДатаПо Цикл
	ИтогиДень.Дата = ДТ;
	
	ОтборСтроки = Новый Структура("Дата", ДТ);
	ТЗ_Строки = ТЗ_Данные.Скопировать(ОтборСтроки);
	ТЗ_Строки.Сортировать("Дата, СортировкаОтель"); 
	
	Если ТЗ_Строки.Количество() > 1 Тогда 
		//ТабДок.НачатьГруппуСтрок("ГруппаСтрок_1", Ложь);		
	КонецЕсли;
	
	Для Каждого Строка Из ТЗ_Строки Цикл
		Область = Макет.ПолучитьОбласть("Строка");	
	
		ОбластьПараметры = Область.Параметры; 
		
		ОбластьПараметры.Отель = Строка.Отель;
		ОбластьПараметры.КоличествоНомеров = Строка.КоличествоНомеров;
		
		//ОбластьПараметры.Дата = Формат(Строка.Дата,"ДФ=dd.MM.yy");
		ОбластьПараметры.Дата = Строка.Дата;
		ОбластьПараметры.ДеньНедели = Формат(Строка.Дата,"ДФ=дддд");
		
		ОбластьПараметры.КоличествоДвухместныеРазмещения = Строка.КоличествоДвухместныеРазмещения;
		ОбластьПараметры.СуммаДвухместныеРазмещения = Строка.СуммаДвухместныеРазмещения;
		ОбластьПараметры.КоличествоОдноместныеРазмещения = Строка.КоличествоОдноместныеРазмещения;
		ОбластьПараметры.СуммаОдноместныеРазмещения = Строка.СуммаОдноместныеРазмещения;
		ОбластьПараметры.Процент_НА = Строка.Процент_НА;
		ОбластьПараметры.ADR_НА = Строка.ADR_НА;
		
		Если Строка.КоличествоДвухместныеРазмещения = 0 Тогда
			ADRДвухместныеРазмещения = 0;	
		Иначе	
			ADRДвухместныеРазмещения = Окр((Строка.СуммаДвухместныеРазмещения / Строка.КоличествоДвухместныеРазмещения));
		КонецЕсли;
		ОбластьПараметры.ADRДвухместныеРазмещения = ADRДвухместныеРазмещения;
		
		Если Строка.КоличествоОдноместныеРазмещения = 0 Тогда
			ADRОдноместныеРазмещения = 0;	
		Иначе	
			ADRОдноместныеРазмещения = Окр((Строка.СуммаОдноместныеРазмещения / Строка.КоличествоОдноместныеРазмещения));;
		КонецЕсли;
		ОбластьПараметры.ADRОдноместныеРазмещения = ADRОдноместныеРазмещения;
		
		ИтогоЗанятыеНомера = Строка.КоличествоОдноместныеРазмещения +  Строка.КоличествоДвухместныеРазмещения;
		ОбластьПараметры.ИтогоЗанятыеНомера = ИтогоЗанятыеНомера;
		
		ПроцентЗаселяемости = Окр((ИтогоЗанятыеНомера / Строка.КоличествоНомеров) * 100);
		ОбластьПараметры.ПроцентЗаселяемости = ПроцентЗаселяемости;
		
		ИтогоСумма = Строка.СуммаОдноместныеРазмещения + Строка.СуммаДвухместныеРазмещения;
		ОбластьПараметры.ИтогоСумма = ИтогоСумма;
		Если ИтогоЗанятыеНомера = 0 Тогда
			ИтогоСредняяСтоимость = 0;
		Иначе
			ИтогоСредняяСтоимость = Окр(ИтогоСумма / ИтогоЗанятыеНомера);
		КонецЕсли;	
		ОбластьПараметры.ИтогоСредняяСтоимость = ИтогоСредняяСтоимость;
			
		ПроцентДвухместныеРазмещения = 0;
		ПроцентОдноместныеРазмещения = 0;

		Если ИтогоЗанятыеНомера = 0 Тогда
			ПроцентДвухместныеРазмещения = 0;
			ПроцентОдноместныеРазмещения = 0;
		Иначе
			ПроцентДвухместныеРазмещения = Окр((Строка.КоличествоДвухместныеРазмещения / ИтогоЗанятыеНомера) * 100);
			ПроцентОдноместныеРазмещения = Окр((Строка.КоличествоОдноместныеРазмещения / ИтогоЗанятыеНомера) * 100);
		КонецЕсли;	
		ОбластьПараметры.ПроцентДвухместныеРазмещения = ПроцентДвухместныеРазмещения;
		ОбластьПараметры.ПроцентОдноместныеРазмещения = ПроцентОдноместныеРазмещения;
		
		ОбластьПараметры.СуммаАгентскогоВознаграждения = Строка.СуммаАгентскогоВознаграждения;
		
		ОбластьПараметры.Мероприятия = Строка.Мероприятия;
		
		ТабДок.Вывести(Область);
		
		ИтогиДень.КоличествоДвухместныеРазмещения = ИтогиДень.КоличествоДвухместныеРазмещения + Строка.КоличествоДвухместныеРазмещения;
		ИтогиДень.СуммаДвухместныеРазмещения = ИтогиДень.СуммаДвухместныеРазмещения + Строка.СуммаДвухместныеРазмещения;
		ИтогиДень.КоличествоОдноместныеРазмещения = ИтогиДень.КоличествоОдноместныеРазмещения + Строка.КоличествоОдноместныеРазмещения;
		ИтогиДень.СуммаОдноместныеРазмещения = ИтогиДень.СуммаОдноместныеРазмещения + Строка.СуммаОдноместныеРазмещения;
		
		ИтогиДень.СуммаАгентскогоВознаграждения = ИтогиДень.СуммаАгентскогоВознаграждения + Строка.СуммаАгентскогоВознаграждения;
		
		ИтогиДень.ADRДвухместныеРазмещения = ИтогиДень.ADRДвухместныеРазмещения + ADRДвухместныеРазмещения;
		ИтогиДень.ADRОдноместныеРазмещения = ИтогиДень.ADRОдноместныеРазмещения + ADRОдноместныеРазмещения;
		
		ИтогиДень.ПроцентДвухместныеРазмещения = ИтогиДень.ПроцентДвухместныеРазмещения + ПроцентДвухместныеРазмещения;
		ИтогиДень.ПроцентОдноместныеРазмещения = ИтогиДень.ПроцентОдноместныеРазмещения + ПроцентОдноместныеРазмещения;
		
		ИтогиДень.ИтогоЗанятыеНомера = ИтогиДень.ИтогоЗанятыеНомера + ИтогоЗанятыеНомера;
		ИтогиДень.ПроцентЗаселяемости = ИтогиДень.ПроцентЗаселяемости + ПроцентЗаселяемости;
		
		ИтогиДень.ИтогоСумма = ИтогиДень.ИтогоСумма + ИтогоСумма;
		ИтогиДень.ИтогоСредняяСтоимость = ИтогиДень.ИтогоСредняяСтоимость + ИтогоСредняяСтоимость;
		
	КонецЦикла;
	
	Если ТЗ_Строки.Количество() > 1 Тогда 
		ТЗ_Количество = ТЗ_Строки.Количество();
		
		//ТабДок.ЗакончитьГруппуСтрок();

		Область = Макет.ПолучитьОбласть("ИтогиДень");	

		ОбластьПараметры = Область.Параметры; 
		
		ОбластьПараметры.Дата = Формат(Строка.Дата,"ДФ=dd.MM.yy");
		ОбластьПараметры.ДеньНедели = Формат(Строка.Дата,"ДФ=дддд");
		
		ОбластьПараметры.КоличествоДвухместныеРазмещения = ИтогиДень.КоличествоДвухместныеРазмещения;
		ОбластьПараметры.СуммаДвухместныеРазмещения = ИтогиДень.СуммаДвухместныеРазмещения;
		ОбластьПараметры.КоличествоОдноместныеРазмещения = ИтогиДень.КоличествоОдноместныеРазмещения;
		ОбластьПараметры.СуммаОдноместныеРазмещения = ИтогиДень.СуммаОдноместныеРазмещения;
		
		ОбластьПараметры.СуммаАгентскогоВознаграждения = ИтогиДень.СуммаАгентскогоВознаграждения;
		ОбластьПараметры.ИтогоСумма = ИтогиДень.ИтогоСумма;
		ОбластьПараметры.ИтогоЗанятыеНомера = ИтогиДень.ИтогоЗанятыеНомера;
		
		ADRДвухместныеРазмещения = Окр(ИтогиДень.ADRДвухместныеРазмещения / ТЗ_Количество);
		ОбластьПараметры.ADRДвухместныеРазмещения = ADRДвухместныеРазмещения;
		
		ADRОдноместныеРазмещения = Окр(ИтогиДень.ADRОдноместныеРазмещения / ТЗ_Количество);
		ОбластьПараметры.ADRОдноместныеРазмещения = ADRОдноместныеРазмещения;
		
		ПроцентЗаселяемости = Окр(ИтогиДень.ПроцентЗаселяемости / ТЗ_Количество);
		ОбластьПараметры.ПроцентЗаселяемости = ПроцентЗаселяемости;

		ИтогоСредняяСтоимость = Окр(ИтогиДень.ИтогоСредняяСтоимость / ТЗ_Количество);
		ОбластьПараметры.ИтогоСредняяСтоимость = ИтогоСредняяСтоимость;
		
		ПроцентДвухместныеРазмещения = Окр(ИтогиДень.ПроцентДвухместныеРазмещения / ТЗ_Количество);
		ОбластьПараметры.ПроцентДвухместныеРазмещения = ПроцентДвухместныеРазмещения;
		
		ПроцентОдноместныеРазмещения = Окр(ИтогиДень.ПроцентОдноместныеРазмещения / ТЗ_Количество);
		ОбластьПараметры.ПроцентОдноместныеРазмещения = ПроцентОдноместныеРазмещения;
		
		//ТабДок.Вывести(Область);
	Иначе
		ADRДвухместныеРазмещения = 0;
		ADRОдноместныеРазмещения = 0;
		
		ПроцентЗаселяемости = 0;

		ИтогоСредняяСтоимость = 0;
		
		ПроцентДвухместныеРазмещения = 0;
		ПроцентОдноместныеРазмещения = 0;
	КонецЕсли;
	
	Итоги.КоличествоДвухместныеРазмещения = Итоги.КоличествоДвухместныеРазмещения + ИтогиДень.КоличествоДвухместныеРазмещения;
	Итоги.СуммаДвухместныеРазмещения = Итоги.СуммаДвухместныеРазмещения + ИтогиДень.СуммаДвухместныеРазмещения;
	Итоги.КоличествоОдноместныеРазмещения = Итоги.КоличествоОдноместныеРазмещения + ИтогиДень.КоличествоОдноместныеРазмещения;
	Итоги.СуммаОдноместныеРазмещения = Итоги.СуммаОдноместныеРазмещения + ИтогиДень.СуммаОдноместныеРазмещения;
	
	Итоги.СуммаАгентскогоВознаграждения = Итоги.СуммаАгентскогоВознаграждения + ИтогиДень.СуммаАгентскогоВознаграждения;
	Итоги.ИтогоЗанятыеНомера = Итоги.ИтогоЗанятыеНомера + ИтогиДень.ИтогоЗанятыеНомера;
	Итоги.ИтогоСумма = Итоги.ИтогоСумма + ИтогиДень.ИтогоСумма;
	
	Итоги.ADRДвухместныеРазмещения = Итоги.ADRДвухместныеРазмещения + ADRДвухместныеРазмещения;
	Итоги.ADRОдноместныеРазмещения = Итоги.ADRОдноместныеРазмещения + ADRОдноместныеРазмещения;
	
	Итоги.ПроцентДвухместныеРазмещения = Итоги.ПроцентДвухместныеРазмещения + ПроцентДвухместныеРазмещения;
	Итоги.ПроцентОдноместныеРазмещения = Итоги.ПроцентОдноместныеРазмещения + ПроцентОдноместныеРазмещения;
	
	Итоги.ПроцентЗаселяемости = Итоги.ПроцентЗаселяемости + ПроцентЗаселяемости;
	
	Итоги.ИтогоСредняяСтоимость = Итоги.ИтогоСредняяСтоимость + ИтогоСредняяСтоимость;	
	
	Для Каждого Элемент Из ИтогиДень Цикл
		Если Элемент.Ключ = "Дата" 
	    Тогда ИтогиДень[Элемент.Ключ] = Неопределено; Продолжить; КонецЕсли;
		
		ИтогиДень[Элемент.Ключ] = 0;
	КонецЦикла;

	ДТ = ДТ + 24 * 60 * 60;
	
	ИтогиКоличество = ИтогиКоличество + 1; 
КонецЦикла;

Если ИтогиКоличество > 0 Тогда
	Область = Макет.ПолучитьОбласть("Итоги");	

	ОбластьПараметры = Область.Параметры; 

	ОбластьПараметры.КоличествоДвухместныеРазмещения = Итоги.КоличествоДвухместныеРазмещения;
	ОбластьПараметры.СуммаДвухместныеРазмещения = Итоги.СуммаДвухместныеРазмещения;
	ОбластьПараметры.КоличествоОдноместныеРазмещения = Итоги.КоличествоОдноместныеРазмещения;
	ОбластьПараметры.СуммаОдноместныеРазмещения = Итоги.СуммаОдноместныеРазмещения;

	ОбластьПараметры.СуммаАгентскогоВознаграждения = Итоги.СуммаАгентскогоВознаграждения;
	ОбластьПараметры.ИтогоСумма = Итоги.ИтогоСумма;
	ОбластьПараметры.ИтогоЗанятыеНомера = Итоги.ИтогоЗанятыеНомера;

	ADRДвухместныеРазмещения = Окр(Итоги.ADRДвухместныеРазмещения / ИтогиКоличество);
	ОбластьПараметры.ADRДвухместныеРазмещения = ADRДвухместныеРазмещения;

	ADRОдноместныеРазмещения = Окр(Итоги.ADRОдноместныеРазмещения / ИтогиКоличество);
	ОбластьПараметры.ADRОдноместныеРазмещения = ADRОдноместныеРазмещения;

	ПроцентЗаселяемости = Окр(Итоги.ПроцентЗаселяемости / ИтогиКоличество);
	ОбластьПараметры.ПроцентЗаселяемости = ПроцентЗаселяемости;

	ИтогоСредняяСтоимость = Окр(Итоги.ИтогоСредняяСтоимость / ИтогиКоличество);
	ОбластьПараметры.ИтогоСредняяСтоимость = ИтогоСредняяСтоимость;

	ПроцентДвухместныеРазмещения = Окр(Итоги.ПроцентДвухместныеРазмещения / ИтогиКоличество);
	ОбластьПараметры.ПроцентДвухместныеРазмещения = ПроцентДвухместныеРазмещения;

	ПроцентОдноместныеРазмещения = Окр(Итоги.ПроцентОдноместныеРазмещения / ИтогиКоличество);
	ОбластьПараметры.ПроцентОдноместныеРазмещения = ПроцентОдноместныеРазмещения;

	ТабДок.Вывести(Область);
КонецЕсли;

Возврат ТабДок;
КонецФункции

Функция ПолучитьДанныеДляЕжедневныйОтчетФактСводный(ДатаС, ДатаПо) Экспорт
ТекстОшибки = "";	
	
Ответ = ЗагрузитьHTTP_ЕжедневныйОтчетФакт(ДатаС, ДатаПо, "СерверЛайвHTTP");
Если Ответ.Ошибка Тогда
	Текст = "Данные из Лайв НЕ Загружены. " + Ответ.ТекстОшибки; 
	//Сообщить(Текст);	
	ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Текст, Символы.ПС);
	
	МассивЛайв = Новый Массив;
Иначе
	МассивЛайв = Ответ.Данные;
КонецЕсли;

Ответ = ЗагрузитьHTTP_ЕжедневныйОтчетФакт(ДатаС, ДатаПо, "СерверЧеховHTTP");
Если Ответ.Ошибка Тогда
	Текст = "Данные из Чехов НЕ Загружены. " + Ответ.ТекстОшибки; 
	//Сообщить(Текст);	
	ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Текст, Символы.ПС);
	
	МассивЧехов = Новый Массив;
Иначе
	МассивЧехов = Ответ.Данные;
КонецЕсли;

Ответ = ЗагрузитьHTTP_ЕжедневныйОтчетФакт(ДатаС, ДатаПо, "СерверДомСоветовHTTP");
Если Ответ.Ошибка Тогда
	Текст = "Данные из Дом Советов НЕ Загружены. " + Ответ.ТекстОшибки; 
	//Сообщить(Текст);	
	ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Текст, Символы.ПС);
	
	МассивДомСоветов = Новый Массив;
Иначе
	МассивДомСоветов = Ответ.Данные;
КонецЕсли;

Ответ = ЗагрузитьHTTP_ЕжедневныйОтчетФакт(ДатаС, ДатаПо, "СерверСтритАртHTTP");
Если Ответ.Ошибка Тогда
	Текст = "Данные из СтритАрт НЕ Загружены. " + Ответ.ТекстОшибки; 
	//Сообщить(Текст);	
	ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Текст, Символы.ПС);
	
	МассивСтритАрт = Новый Массив;
Иначе
	МассивСтритАрт = Ответ.Данные;
КонецЕсли;

МассивРеноме = МассивРеноме(ДатаС, ДатаПо);

Результат = Новый Структура("ТекстОшибки, ДатаС, ДатаПо, МассивЛайв, МассивРеноме, МассивЧехов, МассивДомСоветов, МассивСтритАрт"
	, ТекстОшибки, ДатаС, ДатаПо ,МассивЛайв, МассивРеноме, МассивЧехов, МассивДомСоветов, МассивСтритАрт);
Возврат Результат;	
КонецФункции

Функция ЗагрузитьHTTP_ЕжедневныйОтчетФакт(ДатаС, ДатаПо, ИмяСервера)
Ответ = Новый Структура("Ошибка, ТекстОшибки, Данные", Ложь, "", Неопределено);	
	
Результат = HTTP_Модуль.ПолучитьЕжедневныйОтчетФакт(ДатаС, ДатаПо, ИмяСервера);
Если Результат.Ошибка Тогда
	Ответ.Ошибка = Истина;
	Ответ.ТекстОшибки = "Ошибка соединения с HTTP сервисом " + ИмяСервера + ". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ." + Символы.ПС
		+ Результат.ТекстОшибки;
	
	Возврат Ответ; 
КонецЕсли;

Если Результат.Данные = Неопределено Тогда 
	Ответ.Ошибка = Истина;
	Ответ.ТекстОшибки = "Ошибка подготовки данных в HTTP сервисе " + ИмяСервера + ". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ."; 	
	
	Возврат Ответ; 
КонецЕсли;

//ЗагрузитьЗаселенияНаСервере("ЗаселенияВЛайв", Результат.Данные);
Ответ.Данные = Результат.Данные;
Возврат Ответ;
КонецФункции

Функция МассивРеноме(ДатаС, ДатаПо)
ТЗ_ОтчетДанные = ЕжедневныйОтчетФакт.ТЗ_ОтчетДанные(ДатаС, ДатаПо);	
	
ЕжедневныйОтчетФакт.ЗаполнитьРегистрЕжедневныйОтчетФакт(ТЗ_ОтчетДанные);

ТЗ = ЕжедневныйОтчетФакт.РегистрЕжедневныйОтчетФактВыгрузить(ДатаС, ДатаПо);

МассивРеноме = ОбщийФункционалСервер.ТаблицаЗначенийВМассивСтруктур(ТЗ);

Возврат МассивРеноме;
КонецФункции
