&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
НаименованиеКлюча = "ЗаголовокКод";

СписокВыбора = Элементы.ЗаголовкиЗаголовокТип.СписокВыбора;
СписокВыбора.Добавить("ОтветыПХУП", "Таблица Превосходно, ...");
СписокВыбора.Добавить("ОтветТекст", "Текст");
СписокВыбора.Добавить("ОтветТекстБезСтроки", "Текст без строки");
СписокВыбора.Добавить("ОтветДаНет", "Да, Нет");
СписокВыбора.Добавить("ОтветыТаблицаДаНет", "Таблица: Да / Нет");

КонецПроцедуры


&НаКлиенте
Процедура ЗаголовкиПриАктивизацииСтроки(Элемент)
	ТекДанные = Элемент.ТекущиеДанные;
	УстановитьОтбор(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор(ТекДанные)
	Если ТекДанные = Неопределено Тогда Возврат; КонецЕсли;

	// Создаем структуру отбора
	Отбор = Новый Структура;
	ЗначениеКлюча_П = ТекДанные[НаименованиеКлюча];
	Отбор.Вставить(НаименованиеКлюча, ЗначениеКлюча_П);
	// Задаем фиксированную структуру отбора для таблицы формы
	Элементы.Вопросы.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовкиПередУдалением(Элемент, Отказ)
	ВопросыУдалитьСтроки(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте 
Процедура ВопросыУдалитьСтроки(ТекДанные)
Если ТекДанные = Неопределено Тогда Возврат; КонецЕсли;

МассивСтрок = Объект.Вопросы.НайтиСтроки(Новый Структура (НаименованиеКлюча, ТекДанные[НаименованиеКлюча]));
Для Каждого СтрМассива ИЗ МассивСтрок Цикл
	Элементы.Вопросы.Удалить(СтрМассива);
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
ЗначениеКлюча_OldValue = "";
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовкиПередНачаломИзменения(Элемент, Отказ)
ТекДанные = Элемент.ТекущиеДанные;
Если ТекДанные = Неопределено Тогда ЗначениеКлюча_OldValue = ""; Возврат; КонецЕсли;

ЗначениеКлюча_OldValue = ТекДанные[НаименованиеКлюча]; 
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	
	ЗначениеКлюча = ТекДанные[НаименованиеКлюча]; 
	
	Если ЗначениеКлюча = ЗначениеКлюча_OldValue Тогда Возврат; КонецЕсли;
	
	ВопросыПерезаполнитьЗначениеКлюча(ЗначениеКлюча);
	
	УстановитьОтбор(ТекДанные);
КонецПроцедуры

&НаСервере
Процедура ВопросыПерезаполнитьЗначениеКлюча (ЗначениеКлюча)
	Если ЗначениеЗаполнено(ЗначениеКлюча_OldValue) Тогда
		МассивСтрок = Объект.Вопросы.НайтиСтроки(Новый Структура (НаименованиеКлюча, ЗначениеКлюча_OldValue));
		Для Каждого СтрМассива ИЗ МассивСтрок Цикл
			СтрМассива[НаименованиеКлюча] = ЗначениеКлюча;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Заголовки_ТД = Элементы.Заголовки.ТекущиеДанные;
Если Заголовки_ТД = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
Заголовки_ТД = Элементы.Заголовки.ТекущиеДанные;
Если Заголовки_ТД = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли;

ТД = Элемент.ТекущиеДанные;
ТД[НаименованиеКлюча] = Заголовки_ТД[НаименованиеКлюча];

КонецПроцедуры

// +++++++++++++++++++++++++++
&НаКлиенте
Процедура КонтрагентыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элемент.ТекущиеДанные;
	УстановитьОтборПоКлючу(ТекДанные,Элементы.Товары,НаименованиеКлюча);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПередУдалением(Элемент, Отказ)
	ОбщаяПроцедураУдалитьСтроки(Элемент.ТекущиеДанные,Объект.Товары,НаименованиеКлюча);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДанные = Элемент.ТекущиеДанные;
	
	ТекНаименованиеКлюча = НаименованиеКлюча;
	
	Если ТекДанные[ТекНаименованиеКлюча] <> ТекДанные[ТекНаименованиеКлюча + "Начальный"] Тогда
		
		ПерезаполнитьЗначениеКлюча(ТекДанные[ТекНаименованиеКлюча+"Начальный"],ТекДанные[ТекНаименованиеКлюча],"Товары",ТекНаименованиеКлюча);
		
		ТекДанные[ТекНаименованиеКлюча + "Начальный"] = ТекДанные[ТекНаименованиеКлюча];
		
	КонецЕсли;
	
	УстановитьОтборПоКлючу(ТекДанные,Элементы.Товары,ТекНаименованиеКлюча);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКлючу(ТекДанные,ТекЭлем,НаименованиеКлюча)
	Если ТекДанные = Неопределено Тогда
 		Возврат;
	КонецЕсли;

	// Создаем структуру отбора
	Отбор = Новый Структура;
	Отбор.Вставить(НаименованиеКлюча, ТекДанные[НаименованиеКлюча]);
	// Задаем фиксированную структуру отбора для таблицы формы
	ТекЭлем.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте 
Процедура ОбщаяПроцедураУдалитьСтроки(ТекДанные,ТекЭлем,НаименованиеКлюча)
	Если ТекДанные <> Неопределено Тогда
		МассивСтрок = ТекЭлем.НайтиСтроки(Новый Структура (НаименованиеКлюча,ТекДанные[НаименованиеКлюча]));
		Для Каждого СтрМассива ИЗ МассивСтрок Цикл
			ТекЭлем.Удалить(СтрМассива);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЗначениеКлюча (ЗначениеКлючаНачальный,ЗначениеКлюча,НаименованиеТабЧасти,НаименованиеКлюча)
	Если ЗначениеЗаполнено(ЗначениеКлючаНачальный) Тогда
		ТекЭлем = Объект[НаименованиеТабЧасти];
		МассивСтрок = ТекЭлем.НайтиСтроки(Новый Структура (НаименованиеКлюча,ЗначениеКлючаНачальный));
		Для Каждого СтрМассива ИЗ МассивСтрок Цикл
			СтрМассива[НаименованиеКлюча] = ЗначениеКлюча;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.Контрагенты.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		Элемент.ТекущиеДанные[НаименованиеКлюча] = Элементы.Контрагенты.ТекущиеДанные[НаименованиеКлюча];
	КонецЕсли;
КонецПроцедуры









