
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтоКоворкинг = Истина; 	
Если ЭтоКоворкинг Тогда
	ЭтаФорма.Заголовок = "КОВОРКИНГ";	
КонецЕсли;

ДатаОплаты = ТекущаяДата();
ДатаУчетаНДС = ДатаОплаты;
СтавкаНДС = ДокументыСервер.СтавкаНДС(ЭтоКоворкинг); СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);

Элементы.СуммаОплаты.ТолькоПросмотр = Истина; 
Элементы.СуммаКарта.ТолькоПросмотр = Истина; 
Элементы.СуммаНаличные.ТолькоПросмотр = Истина; 

Элементы.АвансПолныйРасчет.СписокВыбора.Добавить("Аванс");
Элементы.АвансПолныйРасчет.СписокВыбора.Добавить("Полный расчет");

Элементы.ТипОплаты.СписокВыбора.Добавить("Карта");
Элементы.ТипОплаты.СписокВыбора.Добавить("Наличные");
Элементы.ТипОплаты.СписокВыбора.Добавить("Смешанная");

//ВидимостьОплатаЭТ = ОбщийМодульНастройки.ЭтоЛайв() ИЛИ ОбщийМодульНастройки.ЭтоСтритАрт() ИЛИ ОбщийМодульНастройки.ЭтоДомСоветов();
ВидимостьОплатаЭТ = Ложь;
Элементы.ОплатитьКарта.Видимость =  ВидимостьОплатаЭТ;
КонецПроцедуры


&НаКлиенте
Процедура Отменить(Команда)
Закрыть();
КонецПроцедуры

//
&НаКлиенте
Процедура АвансПолныйРасчетПриИзменении(Элемент)
Если АвансПолныйРасчет = "Аванс" Тогда	
	ЭтоАванс = Истина;
Иначе
	ЭтоАванс = Ложь;
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТипОплатыПриИзменении(Элемент)
Если ТипОплаты = "Карта" тогда
	СуммаКарта = СуммаОплаты;	
	СуммаНаличные = 0;
	
	Элементы.СуммаКарта.ТолькоПросмотр = Истина; 
	Элементы.СуммаНаличные.ТолькоПросмотр = Истина; 
ИначеЕсли ТипОплаты = "Наличные" Тогда 
	СуммаКарта = 0;	
	СуммаНаличные = СуммаОплаты;	
	
	Элементы.СуммаКарта.ТолькоПросмотр = Истина; 
	Элементы.СуммаНаличные.ТолькоПросмотр = Истина; 
Иначе 
	СуммаНаличные = 0;	
	СуммаКарта = 0;	
	
	Элементы.СуммаКарта.ТолькоПросмотр = Ложь; 
	Элементы.СуммаНаличные.ТолькоПросмотр = Ложь;       
КонецЕсли;	

Элементы.СуммаОплаты.ТолькоПросмотр = Ложь;       
КонецПроцедуры

&НаКлиенте
Процедура СуммаОплатыПриИзменении(Элемент)
Если ТипОплаты = "Карта" тогда
	СуммаКарта = СуммаОплаты;	
	СуммаНаличные = 0;
ИначеЕсли ТипОплаты = "Наличные" Тогда 
	СуммаКарта = 0;	
	СуммаНаличные = СуммаОплаты;	
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКартаПриИзменении(Элемент)
СуммаНаличные = СуммаОплаты - СуммаКарта;
КонецПроцедуры

&НаКлиенте
Процедура СуммаНаличныеПриИзменении(Элемент)
СуммаКарта = СуммаОплаты - СуммаНаличные;
КонецПроцедуры
//

&НаКлиенте
Процедура КассовыйЧек(Команда)
Если ПроверкаДанныхФормы() Тогда Возврат; КонецЕсли;

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаБудетВыведенЧекНаСумму", ЭтаФорма);
ТекстВопроса = "Будет выведен чек" + ?(ЭтоАванс, " на АВАНС", "");
ТекстВопроса = ТекстВопроса + " на сумму: " + СуммаОплаты 
		+ Символы.ПС + "Карта: " + СуммаКарта + ", наличные: " + СуммаНаличные  
		+ Символы.ПС + Символы.ПС + "Тип оплаты: " + ТипОплаты 
		+ Символы.ПС + Символы.ПС + "ПОДТВЕРДИТЕ ...";		
		
		
ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

&НаКлиенте
Функция ПроверкаДанныхФормы()
ТекстПредупреждения_П = "";
Если ТипОплаты = "" Тогда
	ТекстПредупреждения_П = "Выберите тип оплаты ...";
КонецЕсли;
	                      
Если АвансПолныйРасчет = ""  Тогда
	ТекстПредупреждения_П = ТекстПредупреждения_П + Символы.ПС  + Символы.ПС  + "Укажите Аванс / Полный расчет ...";
КонецЕсли;

Если ТаблицаПозицииЧека.Количество() = 0 Тогда
	ТекстПредупреждения_П = ТекстПредупреждения_П + Символы.ПС  + Символы.ПС  + "Заполните таблицу позиций чека ...";
КонецЕсли;

Если СуммаОплаты > 0 И СуммаКарта = 0 И СуммаНаличные = 0 Тогда
	ТекстПредупреждения_П = ТекстПредупреждения_П + Символы.ПС  + Символы.ПС  + "Введите Сумму по карте и (или) Сумму наличными ...";
КонецЕсли;

ИтогоТаблицаПозицииЧека = ТаблицаПозицииЧека.Итог("Сумма");
Если СуммаКарта + СуммаНаличные <> ИтогоТаблицаПозицииЧека Тогда
	ТекстПредупреждения_П = ТекстПредупреждения_П + Символы.ПС  + Символы.ПС  + "Сумма по карте + Сумма наличными <> Итоги таблицы позиций чека";
КонецЕсли;

//
Если ТекстПредупреждения_П <> "" Тогда
	ПоказатьПредупреждение(, ТекстПредупреждения_П);	
	
	Возврат Истина;	
Иначе 	
	Возврат Ложь;	
КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗавершениеВопросаБудетВыведенЧекНаСумму(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли; 	

ВывестиЧек();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиЧек() 
ВыполнитьОперацию_ФУ();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию_ФУ()
	ПоддерживаемыеТипыВО = Новый Массив();
	//ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
	//ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	
	ДопПараметры = Новый Структура("ЭтоКоворкинг", ЭтоКоворкинг);
			 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюВыбораУстройства_ФУ", ЭтотОбъект, ДопПараметры); 
	МенеджерОборудованияКлиент.ВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальное устройство'"), 
		НСтр("ru='Фискальное устройство не подключено.'"), 
		НСтр("ru='Фискальное устройство не выбрано.'"));
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюВыбораУстройства_ФУ(РезультатВыбора, ДополнительныеПараметры) Экспорт
Если НЕ РезультатВыбора.Результат Тогда
	ТекстСообщения = ТекстСообщения + "Ошибка выбора ККМ: " + РезультатВыбора.ОписаниеОшибки;      
	ТекстПредупреждения = ТекстПредупреждения + "Ошибка выбора ККМ.";      
	
	ОшибкаОперации = Истина;	
	ФУ_Сервер.ЗаписатьОшибкуКММ(РезультатВыбора.ОписаниеОшибки);		
	
	ЗавершитьОтбитиеЧека();
	Возврат;
КонецЕсли;              

ЭтаФорма.Доступность = Ложь;

СуммаБезналЧекККМ = СуммаКарта;
СуммаНалЧекККМ = СуммаНаличные;

ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств");

ТаблицаПозицииЧека_П = ТаблицаПозицииЧека;

ОбщиеПараметры = ФУ_Клиент.ПолучитьШаблонЧека_ЧекПроизвольный(
	ТипРасчета, СуммаБезналЧекККМ, СуммаНалЧекККМ, СуммаПредыдущихОплат, ЭтоАванс, ТаблицаПозицииЧека_П
		, ЭтоКоворкинг);

ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПечатьЧекаЗавершение_ФУ", ЭтотОбъект);
ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(
	ОповещениеПриЗавершении, УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ОбщиеПараметры);
КонецПроцедуры

&НаКлиенте
Функция ТаблицаПозицииЧека()
Массив = Новый Массив;

Строка = Новый Структура("Наименование, Количество, Цена, Сумма, НомерСекции, СтавкаНДС, ЦенаСоСкидками"
	, "Коворкинг", 1, СуммаОплаты, СуммаОплаты, 0, Неопределено, СуммаОплаты); 

Массив.Добавить(Строка);
Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ПечатьЧекаЗавершение_ФУ(РезультатВыполнения, Параметры) Экспорт
	
ЭтаФорма.Доступность = Истина; // При необходимости разблокируем интерфейс пользователя.

Если НЕ РезультатВыполнения.Результат Тогда
	ТекстПредупреждения = ТекстПредупреждения + "При пробитии кассового чека произошла ошибка";
	
	Если СтрНайти(РезультатВыполнения.ОписаниеОшибки, "смена") > 0 Тогда
		ТекстПредупреждения = ТекстПредупреждения + ": "
		 	+ Символы.ПС + РезультатВыполнения.ОписаниеОшибки;
	Иначе		
		ТекстПредупреждения = ТекстПредупреждения + ". ";
	КонецЕсли;
	
	ТекстСообщения = ТекстСообщения + "При пробитии кассового чека произошла ошибка: " + РезультатВыполнения.ОписаниеОшибки;
	Сообщить(ТекстСообщения); 
	
	ОшибкаОперации = Истина;	
	//ФУ_Сервер.ЗаписатьОшибкуКММ(РезультатВыполнения.ОписаниеОшибки);
Иначе
    НомерСменыККМ = РезультатВыполнения.НомерСменыККТ;
    НомерЧекаККМ  = РезультатВыполнения.НомерЧекаККТ;

	ТекстПредупреждения = ТекстПредупреждения + "Пробитие кассового чека выполнено успешно.";
	ТекстСообщения = ТекстСообщения + "Пробитие кассового чека выполнено успешно.";

	ОшибкаОперации = Ложь;	
КонецЕсли;

ЗавершитьОтбитиеЧека();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОтбитиеЧека()
	
//Если НЕ ОшибкаОперации Тогда	
//	Если ЗначениеЗаполнено(ГУИД_ЭТ) Тогда
//		ЭТСервер.ЗаписатьВЭТКассовыйЧекКММ(ГУИД_ЭТ);	
//	КонецЕсли;	
//КонецЕсли;	
//	
//Результат = Новый Структура();
//Результат.Вставить("ОшибкаОперации", ОшибкаОперации); 
//Результат.Вставить("ОшибкаЭТ", ОшибкаЭТ); 
//Результат.Вставить("ТекстПредупреждения", ТекстПредупреждения); 
//Результат.Вставить("ТекстСообщения", ТекстСообщения); 

//Результат.Вставить("СуммаКарта", СуммаКарта); 
//Результат.Вставить("СуммаНаличные", СуммаНаличные); 
//Результат.Вставить("ЭтоАванс", ЭтоАванс); 

//Результат.Вставить("НомерСменыККМ", НомерСменыККМ); 
//Результат.Вставить("НомерЧекаККМ", НомерЧекаККМ); 

//Результат.Вставить("ГУИД_ЭТ", ГУИД_ЭТ); 

//Закрыть(Результат);

Если ОшибкаОперации Тогда Возврат; КонецЕсли;	

СоздатьКассовыйДокумент();

АвансПолныйРасчет = Неопределено;
ТипОплаты = Неопределено;

СуммаОплаты = 0;
СуммаПредыдущихОплат = 0;
СуммаКарта = 0;
СуммаНаличные = 0;
ТаблицаПозицииЧека.Очистить();
КонецПроцедуры	

&НаСервере
Процедура СоздатьКассовыйДокумент()
КассовыйДокументОбъект = Документы.КассовыйДокумент.СоздатьДокумент();

КассовыйДокументОбъект.Дата = ТекущаяДата();

КассовыйДокументОбъект.ДатаОплаты = ТекущаяДата();

ОтКого = Справочники.Клиенты.ФизЛицоПроизвольный;
КассовыйДокументОбъект.ОтКого = ОтКого;

КассовыйДокументОбъект.Приход = Истина;
КассовыйДокументОбъект.Сумма = СуммаОплаты;

КредитнаяКарта = (ТипОплаты = "Карта") ИЛИ (ТипОплаты = "Смешанная");
КассовыйДокументОбъект.КредитнаяКарта = КредитнаяКарта;
КассовыйДокументОбъект.СуммаКарта = СуммаКарта;

Наличные = (ТипОплаты = "Наличные") ИЛИ (ТипОплаты = "Смешанная");
КассовыйДокументОбъект.Наличные = Наличные;
КассовыйДокументОбъект.СуммаНаличные = СуммаНаличные;

КассовыйДокументОбъект.НомерСменыККМ = НомерСменыККМ;
КассовыйДокументОбъект.НомерЧекаККМ = НомерЧекаККМ;

КассовыйДокументОбъект.ЭтоПроизвольныйЧек = Истина; 

КассовыйДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры	


//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ФУ_Клиент.ПриОткрытии_Подключить(ЭтаФорма);	
КонецПроцедуры        

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ФУ_Клиент.ПриЗакрытии_Отключить(ЭтаФорма);	
КонецПроцедуры
//

///////////
&НаКлиенте
Процедура ОплатитьКарта_Неиспользуется(Команда)
Если СуммаКарта = 0 тогда Возврат; КонецЕсли;
Если ПроверкаДанныхФормы() Тогда Возврат; КонецЕсли;

ПредупреждениеЕстьТакиеПлатежи();
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеЕстьТакиеПлатежи()
Ответ = ПолучитьПараметрыЧекаЗапрос(ДокументДолг, СуммаКарта); 	

ЕстьТакиеПлатежи = Ложь;
Если ТипЗнч(Ответ) = Тип("Структура") Тогда
	ЕстьТакиеПлатежи = Истина;
Иначе
	ЕстьТакиеПлатежи = (Ответ = "+"); 
КонецЕсли;

Если ЕстьТакиеПлатежи Тогда
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_ЕстьПлатежиПоЗаявке", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "ВНИМАНИЕ: Есть платежи по заявке на сумму: " + СуммаКарта + "
		|
		|ПРОДОЛЖИТЬ ?"
		, РежимДиалогаВопрос.ОКОтмена);
	Возврат;
КонецЕсли;

ОплатитьКартаВыполнить();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_ЕстьПлатежиПоЗаявке(Результат, ДополнитерльныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ОплатитьКартаВыполнить();
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыЧекаЗапрос(ДокументДолг, СуммаОперации) 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ОперацииЭТ.СсылочныйНомер КАК СсылочныйНомер,
                      |	ОперацииЭТ.СуммаОперации КАК СуммаОперации,
                      |	ЕСТЬNULL(Возвраты.СуммаВозврата, 0) КАК СуммаВозврата
                      |ИЗ
                      |	РегистрСведений.ОперацииЭТ КАК ОперацииЭТ
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ОперацииЭТ.СсылочныйНомерВозврат КАК СсылочныйНомерВозврат,
                      |			СУММА(ОперацииЭТ.СуммаОперации) КАК СуммаВозврата
                      |		ИЗ
                      |			РегистрСведений.ОперацииЭТ КАК ОперацииЭТ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ОперацииЭТ.СсылочныйНомерВозврат) КАК Возвраты
                      |		ПО ОперацииЭТ.СсылочныйНомер = Возвраты.СсылочныйНомерВозврат
                      |ГДЕ
                      |	ОперацииЭТ.ТипТранзакции = ""AuthorizeSales""
                      |	И ОперацииЭТ.ДокументДолг = &ДокументДолг
                      |	И ОперацииЭТ.СуммаОперации = &СуммаОперации");

Запрос.УстановитьПараметр("ДокументДолг", ДокументДолг);
Запрос.УстановитьПараметр("СуммаОперации", СуммаОперации);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	Возврат "-";
ИначеЕсли ТЗ.Количество() > 1 Тогда
	Возврат "+";
Иначе
	СсылочныйНомер = ТЗ[0].СсылочныйНомер;
	Остаток = ТЗ[0].СуммаОперации - ТЗ[0].СуммаВозврата; 
	Результат = Новый Структура("СсылочныйНомер, Остаток", СсылочныйНомер, Остаток); 
	
	Возврат Результат; 
КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОплатитьКартаВыполнить()
Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_БудетПроизведенаОплата", ЭтаФорма);
ПоказатьВопрос(Оповещение, "Будет произведена оплата через эквайринговый терминал на сумму:" + СуммаКарта + "
	|
	|ПРОДОЛЖИТЬ ?"
	, РежимДиалогаВопрос.ОКОтмена); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_БудетПроизведенаОплата(Результат, ДополнитерльныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ОплатитьКартаДействие(СуммаКарта);
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьКартаДействие(СуммаОперации) 
ФормаУникальныйИдентификатор = ЭтаФорма.УникальныйИдентификатор;

ЭтаФорма.Доступность = Ложь;

ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
//ПараметрыОперации.ТипТранзакции  = Параметры.ТипТранзакции;
//ПараметрыОперации.СуммаОперации  = Результат.Сумма;
ТипТранзакции = "AuthorizeSales";
ПараметрыОперации.ТипТранзакции  = ТипТранзакции;
ПараметрыОперации.СуммаОперации  = СуммаОперации;

//ПараметрыОперации.НомерЧека      = ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, "");
//ПараметрыОперации.НомерЧекаЭТ    = ?(Результат.Свойство("НомерЧекаЭТ"), Результат.НомерЧекаЭТ, "");

//ПараметрыОперации.СсылочныйНомер = Результат.СсылочныйНомер;
СсылочныйНомер = "";
ПараметрыОперации.СсылочныйНомер = СсылочныйНомер;

ДанныеОперации = Новый Структура();
ДанныеОперации.Вставить("ТипТранзакции", ТипТранзакции);
//ДанныеОперации.Вставить("ДанныеКарты", ?(Результат.Свойство("ДанныеКарты")  , Результат.ДанныеКарты, ""));
//ДанныеОперации.Вставить("ТипКарты", ?(Результат.Свойство("ТипКарты")  , Результат.ТипКарты, 0));
//ДанныеОперации.Вставить("НомерЧека", ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, ""));

ДанныеОперации.Вставить("СсылочныйНомерВозврат", СсылочныйНомер);

ДанныеОперации.Вставить("ДокументДолг", ДокументДолг);

ДанныеОперации.Вставить("ЭтоКоворкинг", ЭтоКоворкинг);

//ДанныеОперации.Вставить("ФормаУникальныйИдентификатор",  Параметры.ФормаУникальныйИдентификатор);
//ДанныеОперации.Вставить("ФормаУникальныйИдентификатор",  ФормаУникальныйИдентификатор);

//ИмяОповещенияОЗавершении = Параметры.ИмяОповещенияОЗавершении;
Оповещение = Новый ОписаниеОповещения("ОплатитьКартаДействие_Завершение", ЭтотОбъект, ДанныеОперации);
ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение
	, ФормаУникальныйИдентификатор, Неопределено, ПараметрыОперации);
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьКартаДействие_Завершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
//ФормаУникальныйИдентификатор = Параметры.ФормаУникальныйИдентификатор;

ЭтаФорма.Доступность = Истина;

Если РезультатВыполнения.Результат Тогда
	ТекстСообщения = "Эквайринговая Операция выполнена успешно." + Символы.ПС;
	ТекстПредупреждения = ТекстСообщения + Символы.ПС;
	
	ТипТранзакции = ДополнительныеПараметры.ТипТранзакции; 
	
	ГУИД_ЭТ = Неопределено;
	Если ТипТранзакции = "AuthorizeSales" 
	//ИЛИ  ТипТранзакции = "AuthorizeRefund" 
	//ИЛИ  ТипТранзакции = "AuthorizeVoid" 
	Тогда
		ГУИД_ЭТ = ЭТСервер.ЗаписатьОперацию(РезультатВыполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	ВывестиЧек();	
Иначе
	ТекстПредупреждения = "Ошибка эквайрингого терминала";
	ТекстСообщения = "Ошибка эквайрингового терминала: " + РезультатВыполнения.ОписаниеОшибки;
	
	ОшибкаОперации = Истина;
	ОшибкаЭТ = Истина;
	
	ЗавершитьОтбитиеЧека();
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтоКоворкингПриИзменении(Элемент)
Если ЭтоКоворкинг Тогда
	ЭтаФорма.Заголовок = "КОВОРКИНГ";	
Иначе
	ЭтаФорма.Заголовок = "ОТЕЛЬ";	
КонецЕсли;

СтавкаНДС = ДокументыСервер.СтавкаНДС(ЭтоКоворкинг); СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаОплаты);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПозицииЧекаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
ТД = Элемент.ТекущиеДанные;	
Если НоваяСтрока Тогда
	ТД.СтавкаНДС = СтавкаНДС;		
КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПозицииЧекаКоличествоПриИзменении(Элемент)
ТД = Элементы.ТаблицаПозицииЧека.ТекущиеДанные;
ТД.Сумма = ТД.Количество * ТД.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПозицииЧекаЦенаПриИзменении(Элемент)
ТД = Элементы.ТаблицаПозицииЧека.ТекущиеДанные;
ТД.Сумма = ТД.Количество * ТД.Цена;
КонецПроцедуры

//

// +++++++++++++++++++++++++++++++++



