&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ОбменСГорничными = Константы.ОбменСГорничными.Получить();
Элементы.ФормаСоздатьРасход.Видимость = НЕ ОбменСГорничными;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРасход(Команда)
ПараметрыФормы = Новый Структура("ЭтоРасход", Истина);

ОткрытьФорму("Документ.МинибарРасход.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписание(Команда)
ПараметрыФормы = Новый Структура("ЭтоСписание", Истина);

ОткрытьФорму("Документ.МинибарРасход.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

