//
&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
//ЗарпосБрони=Новый Запрос("ВЫБРАТЬ
//                         |	ЗаявкаНаБронирование.Дата КАК ДатаБронирования,
//                         |	ЗаявкаНаБронирование.НомерВРезерв,
//                         |	ЗаявкаНаБронирование.Бронирует,
//                         |	ЗаявкаНаБронирование.Клиент,
//                         |	ЗаявкаНаБронирование.РезервС КАК ДатаЗаезда,
//                         |	ЗаявкаНаБронирование.КолВо,
//                         |	ЗаявкаНаБронирование.Источник КАК ИсточникБронирования,
//                         |	ЗаявкаНаБронирование.Клиент.ВидКлиента КАК Вид,
//                         |	1 КАК КолВоБроней
//                         |ИЗ
//                         |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
//                         |ГДЕ
//                         |	ЗаявкаНаБронирование.Дата МЕЖДУ &ДТН И &ДТК
//                         |	И ЗаявкаНаБронирование.Статус <> &Статус
//						 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
//                         |
//                         |УПОРЯДОЧИТЬ ПО
//                         |	ДатаБронирования");
//ЗарпосБрони.УстановитьПараметр("ДТН",НачалоДня(ПериодС));						 
//ЗарпосБрони.УстановитьПараметр("ДТК",КонецДня(ПериодПо));
//ЗарпосБрони.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);
//ЗарпосБрони.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

//ТЗБ=ЗарпосБрони.Выполнить().Выгрузить();
//ТЗБ.Колонки.Добавить("ВидКлиента");
//Макет=ПолучитьМакет("Макет");
//ЭлементыФормы.ПолеОтчета.Очистить();
//Обл=Макет.ПолучитьОбласть("Шапка");
//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
//Для каждого СтрТЗ Из ТЗБ Цикл
//	
//	Обл=Макет.ПолучитьОбласть("Строка");
//	Обл.Параметры.Заполнить(СтрТЗ);
//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);
//	Если СтрТЗ.Вид.Код="000000007" тогда
//		СтрТЗ.ВидКлиента="Корпарат";// корп
//	иначеесли СтрТЗ.Вид.Код="000000001" или СтрТЗ.Вид.Код="000000002" тогда
//		СтрТЗ.ВидКлиента="Агентство";// агент
//	иначе
//		СтрТЗ.ВидКлиента="Частные";// част
//	КонецЕсли;
//	
//	
//КонецЦикла; 

//ТЗБ.Свернуть("ИсточникБронирования,ВидКлиента","КолВоБроней");
//ТЗБ.Сортировать("КолВоБроней");
//Макет=ПолучитьМакет("Макет1");
//Обл=Макет.ПолучитьОбласть("Шапка");
//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
//ОбщКолво=ТЗБ.Итог("КолВоБроней");
//Для каждого СтрТЗ Из ТЗБ Цикл
//	
//	Обл=Макет.ПолучитьОбласть("Строка");
//	Обл.Параметры.Заполнить(СтрТЗ);
//	Обл.Параметры.Проц=?(ОбщКолво=0,"0",Формат((СтрТЗ.КолВоБроней/ОбщКолво)*100, "ЧДЦ=2"));
//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);
//		
//	
//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
ЗарпосБрони=Новый Запрос("ВЫБРАТЬ
                         |	ЗаявкаНаБронирование.Дата КАК ДатаБронирования,
                         |	ЗаявкаНаБронирование.НомерВРезерв,
                         |	ЗаявкаНаБронирование.Бронирует,
                         |	ЗаявкаНаБронирование.Клиент,
                         |	ЗаявкаНаБронирование.РезервС КАК ДатаЗаезда,
                         |	ЗаявкаНаБронирование.КолВо,
                         |	ЗаявкаНаБронирование.Источник КАК ИсточникБронирования,
                         |	ЗаявкаНаБронирование.Клиент.ВидКлиента КАК Вид,
                         |	1 КАК КолВоБроней
                         |ИЗ
                         |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                         |ГДЕ
                         |	ЗаявкаНаБронирование.Дата МЕЖДУ &ДТН И &ДТК
                         |	И ЗаявкаНаБронирование.Статус <> &Статус
						 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
                         |
                         |УПОРЯДОЧИТЬ ПО
                         |	ДатаБронирования");
ЗарпосБрони.УстановитьПараметр("ДТН",НачалоДня(Отчет.ПериодС));						 
ЗарпосБрони.УстановитьПараметр("ДТК",КонецДня(Отчет.ПериодПо));
ЗарпосБрони.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);
ЗарпосБрони.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

ТЗБ=ЗарпосБрони.Выполнить().Выгрузить();
ТЗБ.Колонки.Добавить("ВидКлиента");
 
//Макет=ПолучитьМакет("Макет");
Макет = Отчеты.ОтчетПоИсточникамБронирования.ПолучитьМакет("Макет");

//ЭлементыФормы.ПолеОтчета.Очистить();
ПолеОтчета.Очистить();

Обл=Макет.ПолучитьОбласть("Шапка");

//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
ПолеОтчета.Вывести(Обл);

Для каждого СтрТЗ Из ТЗБ Цикл
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Заполнить(СтрТЗ);
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Если СтрТЗ.Вид.Код="000000007" тогда
		СтрТЗ.ВидКлиента="Корпарат";// корп
	иначеесли СтрТЗ.Вид.Код="000000001" или СтрТЗ.Вид.Код="000000002" тогда
		СтрТЗ.ВидКлиента="Агентство";// агент
	иначе
		СтрТЗ.ВидКлиента="Частные";// част
	КонецЕсли;
	
	
КонецЦикла; 

ТЗБ.Свернуть("ИсточникБронирования,ВидКлиента","КолВоБроней");
ТЗБ.Сортировать("КолВоБроней");

//Макет=ПолучитьМакет("Макет1");
Макет=Отчеты.ОтчетПоИсточникамБронирования.ПолучитьМакет("Макет1");

Обл=Макет.ПолучитьОбласть("Шапка");

//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
ПолеОтчета.Вывести(Обл);

ОбщКолво=ТЗБ.Итог("КолВоБроней");
Для каждого СтрТЗ Из ТЗБ Цикл
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Заполнить(СтрТЗ);
	Обл.Параметры.Проц=?(ОбщКолво=0,"0",Формат((СтрТЗ.КолВоБроней/ОбщКолво)*100, "ЧДЦ=2"));
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
		
	
КонецЦикла;
КонецПроцедуры

//
&НаКлиенте
Процедура ОсновныеДействияФормыПоДатеЗаезда___(Кнопка)
//ЗарпосБрони=Новый Запрос("ВЫБРАТЬ
//                         |	ЗаявкаНаБронирование.Дата КАК ДатаБронирования,
//                         |	ЗаявкаНаБронирование.НомерВРезерв,
//                         |	ЗаявкаНаБронирование.Бронирует,
//                         |	ЗаявкаНаБронирование.Клиент,
//                         |	ЗаявкаНаБронирование.РезервС КАК ДатаЗаезда,
//                         |	ЗаявкаНаБронирование.КолВо,
//                         |	ЗаявкаНаБронирование.Источник КАК ИсточникБронирования,
//                         |	ЗаявкаНаБронирование.Клиент.ВидКлиента КАК Вид,
//                         |	1 КАК КолВоБроней
//                         |ИЗ
//                         |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
//                         |ГДЕ
//                         |	ЗаявкаНаБронирование.РезервС МЕЖДУ &ДТН И &ДТК
//                         |	И ЗаявкаНаБронирование.Статус <> &Статус
//						 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
//                         |
//                         |УПОРЯДОЧИТЬ ПО
//                         |	ДатаБронирования");
//ЗарпосБрони.УстановитьПараметр("ДТН",НачалоДня(ПериодС));						 
//ЗарпосБрони.УстановитьПараметр("ДТК",КонецДня(ПериодПо));
//ЗарпосБрони.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);
//ЗарпосБрони.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

//ТЗБ=ЗарпосБрони.Выполнить().Выгрузить();
//ТЗБ.Колонки.Добавить("ВидКлиента");
//Макет=ПолучитьМакет("Макет");
//ЭлементыФормы.ПолеОтчета.Очистить();
//Обл=Макет.ПолучитьОбласть("Шапка");
//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
//Для каждого СтрТЗ Из ТЗБ Цикл
//	
//	Обл=Макет.ПолучитьОбласть("Строка");
//	Обл.Параметры.Заполнить(СтрТЗ);
//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);
//	Если СтрТЗ.Вид.Код="000000007" тогда
//		СтрТЗ.ВидКлиента="Корпарат";// корп
//	иначеесли СтрТЗ.Вид.Код="000000001" или СтрТЗ.Вид.Код="000000002" тогда
//		СтрТЗ.ВидКлиента="Агентство";// агент
//	иначе
//		СтрТЗ.ВидКлиента="Частные";// част
//	КонецЕсли;
//	
//	
//КонецЦикла; 

//ТЗБ.Свернуть("ИсточникБронирования,ВидКлиента","КолВоБроней");
//ТЗБ.Сортировать("КолВоБроней");
//Макет=ПолучитьМакет("Макет1");
//Обл=Макет.ПолучитьОбласть("Шапка");
//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
//ОбщКолво=ТЗБ.Итог("КолВоБроней");
//Для каждого СтрТЗ Из ТЗБ Цикл
//	
//	Обл=Макет.ПолучитьОбласть("Строка");
//	Обл.Параметры.Заполнить(СтрТЗ);
//	Обл.Параметры.Проц=?(ОбщКолво=0,"0",Формат((СтрТЗ.КолВоБроней/ОбщКолво)*100, "ЧДЦ=2"));
//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);
//		
//	
//КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПоДатеЗаезда(Команда)
	ПоДатеЗаездаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоДатеЗаездаНаСервере()
ЗарпосБрони=Новый Запрос("ВЫБРАТЬ
                         |	ЗаявкаНаБронирование.Дата КАК ДатаБронирования,
                         |	ЗаявкаНаБронирование.НомерВРезерв,
                         |	ЗаявкаНаБронирование.Бронирует,
                         |	ЗаявкаНаБронирование.Клиент,
                         |	ЗаявкаНаБронирование.РезервС КАК ДатаЗаезда,
                         |	ЗаявкаНаБронирование.КолВо,
                         |	ЗаявкаНаБронирование.Источник КАК ИсточникБронирования,
                         |	ЗаявкаНаБронирование.Клиент.ВидКлиента КАК Вид,
                         |	1 КАК КолВоБроней
                         |ИЗ
                         |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                         |ГДЕ
                         |	ЗаявкаНаБронирование.РезервС МЕЖДУ &ДТН И &ДТК
                         |	И ЗаявкаНаБронирование.Статус <> &Статус
						 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
                         |
                         |УПОРЯДОЧИТЬ ПО
                         |	ДатаБронирования");
ЗарпосБрони.УстановитьПараметр("ДТН",НачалоДня(Отчет.ПериодС));						 
ЗарпосБрони.УстановитьПараметр("ДТК",КонецДня(Отчет.ПериодПо));
ЗарпосБрони.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);
ЗарпосБрони.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

ТЗБ=ЗарпосБрони.Выполнить().Выгрузить();
ТЗБ.Колонки.Добавить("ВидКлиента");

//Макет=ПолучитьМакет("Макет");
Макет = Отчеты.ОтчетПоИсточникамБронирования.ПолучитьМакет("Макет");

//ЭлементыФормы.ПолеОтчета.Очистить();
ПолеОтчета.Очистить();

Обл=Макет.ПолучитьОбласть("Шапка");

//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
ПолеОтчета.Вывести(Обл);

Для каждого СтрТЗ Из ТЗБ Цикл
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Заполнить(СтрТЗ);
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Если СтрТЗ.Вид.Код="000000007" тогда
		СтрТЗ.ВидКлиента="Корпарат";// корп
	иначеесли СтрТЗ.Вид.Код="000000001" или СтрТЗ.Вид.Код="000000002" тогда
		СтрТЗ.ВидКлиента="Агентство";// агент
	иначе
		СтрТЗ.ВидКлиента="Частные";// част
	КонецЕсли;
	
	
КонецЦикла; 

ТЗБ.Свернуть("ИсточникБронирования,ВидКлиента","КолВоБроней");
ТЗБ.Сортировать("КолВоБроней");

//Макет=ПолучитьМакет("Макет1");
Макет = Отчеты.ОтчетПоИсточникамБронирования.ПолучитьМакет("Макет1");

Обл=Макет.ПолучитьОбласть("Шапка");

//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
ПолеОтчета.Вывести(Обл);

ОбщКолво=ТЗБ.Итог("КолВоБроней");
Для каждого СтрТЗ Из ТЗБ Цикл
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Заполнить(СтрТЗ);
	Обл.Параметры.Проц=?(ОбщКолво=0,"0",Формат((СтрТЗ.КолВоБроней/ОбщКолво)*100, "ЧДЦ=2"));
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
		
	
КонецЦикла;
КонецПроцедуры



