
Функция НачальныеБазовыеЦены(КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака) Экспорт 
Если БезЗавтрака тогда
	Если ПроцентСкидкиБезЗавтрака = 0 Тогда      
		БТ			= КатегорияНомера.БазовыйТарифБудниБезЗавтрака;
		БТ_Вых		= КатегорияНомера.БазовыйТарифВыходныеБезЗавтрака;		
		БТ_2		= КатегорияНомера.БазовыйТарифБудниДвухБезЗавтрака;
		БТ_Вых_2	= КатегорияНомера.БазовыйТарифВыходныеДвухБезЗавтрака;			
	Иначе	
		БТ			= КатегорияНомера.БазовыйТарифБудни;
		БТ_Вых		= КатегорияНомера.БазовыйТарифВыходные;		
		БТ_2		= КатегорияНомера.БазовыйТарифБудниДвух;
		БТ_Вых_2	= КатегорияНомера.БазовыйТарифВыходныеДвух;	
	конецесли;
иначе
	БТ			= КатегорияНомера.БазовыйТарифБудни;
	БТ_Вых		= КатегорияНомера.БазовыйТарифВыходные;		
	БТ_2		= КатегорияНомера.БазовыйТарифБудниДвух;
	БТ_Вых_2	= КатегорияНомера.БазовыйТарифВыходныеДвух;	
конецесли;

Результат = Новый Структура("БТ, БТ_Вых, БТ_2, БТ_Вых_2", БТ, БТ_Вых, БТ_2, БТ_Вых_2); 	
	
Возврат Результат;	
КонецФункции

Функция ПолучитьТЗБазовыеЦены(ДатаЦеныНачалоГода, КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака) Экспорт
ЗапросЦен = Новый Запрос("ВЫБРАТЬ
                         |	ЦеныБазовыеПоДатам.ДатаЦены КАК ДатаЦены,
                         |	ЦеныБазовыеПоДатам.БазоваяЦена КАК БазоваяЦена,
                         |	ЦеныБазовыеПоДатам.БазоваяЦенаВыходной КАК БазоваяЦенаВыходной,
                         |	ЦеныБазовыеПоДатам.Двухместный КАК Двухместный,
                         |	ЦеныБазовыеПоДатам.Категория КАК КатегорияНомера,
                         |	ЦеныБазовыеПоДатам.БезЗавтрака КАК БезЗавтрака
                         |ИЗ
                         |	РегистрСведений.ЦеныБазовыеПоДатам КАК ЦеныБазовыеПоДатам
                         |ГДЕ
                         |	НАЧАЛОПЕРИОДА(ЦеныБазовыеПоДатам.ДатаЦены, ГОД) = &ДатаЦены
                         |	И ВЫБОР
                         |			КОГДА &Категория = ""ВСЕ""
                         |				ТОГДА ИСТИНА
                         |			ИНАЧЕ ЦеныБазовыеПоДатам.Категория = &Категория
                         |		КОНЕЦ
                         |	И ВЫБОР
                         |			КОГДА &БезЗавтрака = ""ВСЕ""
                         |				ТОГДА ИСТИНА
                         |			ИНАЧЕ ЦеныБазовыеПоДатам.БезЗавтрака = &БезЗавтрака
                         |		КОНЕЦ");

ЗапросЦен.УстановитьПараметр("ДатаЦены", ДатаЦеныНачалоГода );
ЗапросЦен.УстановитьПараметр("Категория", КатегорияНомера);

Если ПроцентСкидкиБезЗавтрака <> 0 И БезЗавтрака Тогда 
	БезЗавтрака_П = Ложь;
Иначе
	БезЗавтрака_П = БезЗавтрака;    
КонецЕсли;
ЗапросЦен.УстановитьПараметр("БезЗавтрака", БезЗавтрака_П);
ТЗ = ЗапросЦен.Выполнить().Выгрузить();

ТЗ.Сортировать("ДатаЦены");

Возврат ТЗ;
КонецФункции  

Функция ЗаполнитьТЗБазовыеЦены(ТЗБазовыеЦены, ДатаЦеныНачалоГода, КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака) Экспорт
ТЗ = ПолучитьТЗБазовыеЦены(ДатаЦеныНачалоГода, КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака);

ТЗБазовыеЦены.Очистить();
Для Каждого Строка из ТЗ Цикл
	НоваяСтрока = ТЗБазовыеЦены.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

ТЗБазовыеЦены.Сортировать("ДатаЦены");
КонецФункции  

Функция ПолучитьБазоваяЦенаДня(ДатаЦены, ТЗБазовыеЦены, БТ, БТ_Вых, КатегорияНомера, БезЗавтрака, Двухместный, ПроцентСкидкиБезЗавтрака) Экспорт 
СтрокаБазоваяЦенаДня = СтрокаБазоваяЦенаДня(ДатаЦены, ТЗБазовыеЦены, КатегорияНомера, БезЗавтрака, Двухместный, ПроцентСкидкиБезЗавтрака);	
Если СтрокаБазоваяЦенаДня = Неопределено Тогда
	БазовыйТарифБудни = БТ; 
	БазовыйТарифВыходные = БТ_Вых; 	
Иначе
	БазовыйТарифБудни = СтрокаБазоваяЦенаДня.БазоваяЦена; 
	БазовыйТарифВыходные = СтрокаБазоваяЦенаДня.БазоваяЦенаВыходной; 
КонецЕсли;

БазовыйТарифДатаЦены = ?(ДеньНедели(ДатаЦены) < 5, БазовыйТарифБудни, БазовыйТарифВыходные); 

Результат = Новый Структура("БазовыйТарифДатаЦены, БазовыйТарифБудни, БазовыйТарифВыходные"
	, БазовыйТарифДатаЦены, БазовыйТарифБудни, БазовыйТарифВыходные); 
	
Возврат Результат;	
КонецФункции

Функция СтрокаБазоваяЦенаДня(ДТН, ТЗБазовыеЦены, КатегорияНомера, БезЗавтрака, Двухместный, ПроцентСкидкиБезЗавтрака) Экспорт 
Если ПроцентСкидкиБезЗавтрака <> 0 И БезЗавтрака Тогда 
	БезЗавтрака_П = Ложь;
Иначе
	БезЗавтрака_П = БезЗавтрака;    
КонецЕсли;
	
ОтборСтроки = Новый Структура("КатегорияНомера, БезЗавтрака, Двухместный", КатегорияНомера, БезЗавтрака_П, Двухместный);
НайденныеСтроки = ТЗБазовыеЦены.НайтиСтроки(ОтборСтроки);
	
ПредыдущаяСтрока = Неопределено;
ТочноеСоответствие = Ложь;
Для Каждого Строка Из НайденныеСтроки Цикл
	Если Строка.ДатаЦены < ДТН Тогда
		ПредыдущаяСтрока = Строка;
	ИначеЕсли Строка.ДатаЦены = ДТН Тогда
		ПредыдущаяСтрока = Строка;
	КонецЕсли;
КонецЦикла;	

Возврат ПредыдущаяСтрока;
КонецФункции
//

//
Функция ПолучитьТЗЦен(ДатаЦеныНачалоГода, КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака) Экспорт
ЗапросЦен=Новый Запрос("ВЫБРАТЬ
                       |	ЦеныПоДатам.ДатаЦены КАК ДатаЦены,
                       |	ЦеныПоДатам.Тариф_НеИспользуется КАК Тариф_НеИспользуется,
                       |	ЦеныПоДатам.ПроцентИзменения КАК ПроцентИзменения,
                       |	ЦеныПоДатам.Категория КАК КатегорияНомера,
                       |	ЦеныПоДатам.БезЗавтрака КАК БезЗавтрака,
                       |	ЦеныПоДатам.Двухместный КАК Двухместный
                       |ИЗ
                       |	РегистрСведений.ЦеныПоДатам КАК ЦеныПоДатам
                       |ГДЕ
                       |	НАЧАЛОПЕРИОДА(ЦеныПоДатам.ДатаЦены, ГОД) = &ДатаЦены
                       |	И ВЫБОР
                       |			КОГДА &Категория = ""ВСЕ""
                       |				ТОГДА ИСТИНА
                       |			ИНАЧЕ ЦеныПоДатам.Категория = &Категория
                       |		КОНЕЦ
                       |	И ВЫБОР
                       |			КОГДА &БезЗавтрака = ""ВСЕ""
                       |				ТОГДА ИСТИНА
                       |			ИНАЧЕ ЦеныПоДатам.БезЗавтрака = &БезЗавтрака
                       |		КОНЕЦ");
ЗапросЦен.УстановитьПараметр("ДатаЦены", ДатаЦеныНачалоГода);
ЗапросЦен.УстановитьПараметр("Категория", КатегорияНомера);

Если ПроцентСкидкиБезЗавтрака <> 0 И БезЗавтрака Тогда 
	БезЗавтрака_П = Ложь;
Иначе
	БезЗавтрака_П = БезЗавтрака;    
КонецЕсли;

ЗапросЦен.УстановитьПараметр("БезЗавтрака", БезЗавтрака_П);
ТЗ = ЗапросЦен.Выполнить().Выгрузить();

Возврат ТЗ;
КонецФункции

Процедура ЗаполнитьТЗЦен(ТЗЦен, ДатаЦеныНачалоГода, КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака) Экспорт
ТЗ = ПолучитьТЗЦен(ДатаЦеныНачалоГода, КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака);

ТЗЦен.Очистить();
Для Каждого Строка из ТЗ Цикл
	НоваяСтрока = ТЗЦен.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТЗЦен_1(ТЗЦен, ДатаЦеныНачалоГода, КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака) Экспорт
ЗапросЦен=Новый Запрос("ВЫБРАТЬ
                       |	ЦеныПоДатам.ДатаЦены КАК ДатаЦены,
                       |	ЦеныПоДатам.Тариф_НеИспользуется КАК Тариф_НеИспользуется,
                       |	ЦеныПоДатам.ПроцентИзменения КАК ПроцентИзменения,
                       |	ЦеныПоДатам.Категория КАК КатегорияНомера,
                       |	ЦеныПоДатам.БезЗавтрака КАК БезЗавтрака,
                       |	ЦеныПоДатам.Двухместный КАК Двухместный
                       |ИЗ
                       |	РегистрСведений.ЦеныПоДатам КАК ЦеныПоДатам
                       |ГДЕ
                       |	НАЧАЛОПЕРИОДА(ЦеныПоДатам.ДатаЦены, ГОД) = &ДатаЦены
                       |	И ВЫБОР
                       |			КОГДА &Категория = ""ВСЕ""
                       |				ТОГДА ИСТИНА
                       |			ИНАЧЕ ЦеныПоДатам.Категория = &Категория
                       |		КОНЕЦ
                       |	И ВЫБОР
                       |			КОГДА &БезЗавтрака = ""ВСЕ""
                       |				ТОГДА ИСТИНА
                       |			ИНАЧЕ ЦеныПоДатам.БезЗавтрака = &БезЗавтрака
                       |		КОНЕЦ");
ЗапросЦен.УстановитьПараметр("ДатаЦены", ДатаЦеныНачалоГода);
ЗапросЦен.УстановитьПараметр("Категория", КатегорияНомера);

Если ПроцентСкидкиБезЗавтрака <> 0 И БезЗавтрака Тогда 
	БезЗавтрака_П = Ложь;
Иначе
	БезЗавтрака_П = БезЗавтрака;    
КонецЕсли;

ЗапросЦен.УстановитьПараметр("БезЗавтрака", БезЗавтрака_П);
ТЗ = ЗапросЦен.Выполнить().Выгрузить();

ТЗЦен.Очистить();
Для Каждого Строка из ТЗ Цикл
	НоваяСтрока = ТЗЦен.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

КонецПроцедуры


Функция ЦенаДня(ДТН, ТЗЦен, КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака, БазоваяЦенаОдноместный, БазоваяЦенаДвухместный) Экспорт
Если ТЗЦен.Количество()=0 тогда
	ИзменениеЦеныОдноместный = 0;
	ИзменениеЦеныДвухместный = 0;
Иначе
	Если ПроцентСкидкиБезЗавтрака <> 0 И БезЗавтрака Тогда
		БезЗавтрака_П = Ложь;
	Иначе
		БезЗавтрака_П = БезЗавтрака;
	КонецЕсли;
			
	ПоискЦ = ТЗЦен.НайтиСтроки(Новый Структура("ДатаЦены, КатегорияНомера, БезЗавтрака, Двухместный"
		, ДТН, КатегорияНомера, БезЗавтрака_П, Ложь));
	Если ПоискЦ.Количество() = 0 Тогда
		ИзменениеЦеныОдноместный = 0;
	Иначе
		ИзменениеЦеныОдноместный = ?(ПоискЦ.Количество()=0, 0, ПоискЦ[0].ПроцентИзменения);
	КонецЕсли;
	
	ПоискЦ2=ТЗЦен.НайтиСтроки(Новый Структура("ДатаЦены, КатегорияНомера, БезЗавтрака,Двухместный"
		, ДТН, КатегорияНомера, БезЗавтрака_П, Истина));
	Если ПоискЦ2.Количество() = 0 Тогда
		ИзменениеЦеныДвухместный = 0;
	Иначе
		ИзменениеЦеныДвухместный=?(ПоискЦ2.Количество()=0, 0, ПоискЦ2[0].ПроцентИзменения);
	КонецЕсли;
КонецЕсли;

ЦенаДняОдноместный = БазоваяЦенаОдноместный + ИзменениеЦеныОдноместный;
ЦенаДняДвухместный = БазоваяЦенаДвухместный + ИзменениеЦеныДвухместный;

Если БезЗавтрака И ПроцентСкидкиБезЗавтрака <> 0 Тогда
	ЦенаДняОдноместный = ДокументыСервер_Старый.ЦенаПроцентСкидкиБезЗавтрака(ЦенаДняОдноместный, ПроцентСкидкиБезЗавтрака); 
	ЦенаДняДвухместный = ДокументыСервер_Старый.ЦенаПроцентСкидкиБезЗавтрака(ЦенаДняДвухместный, ПроцентСкидкиБезЗавтрака); 
КонецЕсли;

Результат = Новый Структура("ЦенаДняОдноместный, ИзменениеЦеныОдноместный, ЦенаДняДвухместный, ИзменениеЦеныДвухместный"
	, ЦенаДняОдноместный, ИзменениеЦеныОдноместный, ЦенаДняДвухместный, ИзменениеЦеныДвухместный);
Возврат Результат;
КонецФункции
//

// ++++++++++++++++++++++


