
&НаКлиенте
Процедура ПриОткрытии__()
	ПутьКФайлу="C:\ТЕРМО\текущие\";
	КнопкаВыполнитьНажатие(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если Параметры.Свойство("ЗавершитьРаботу") Тогда	
	 ЗавершитьРаботу = Параметры.ЗавершитьРаботу;
Иначе
	 ЗавершитьРаботу = Ложь;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ПутьКФайлу="C:\ТЕРМО\текущие\";
ВыполнитьКомандаНаСервере();
	
Если ЗавершитьРаботу Тогда
	Отказ = Истина;	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыполнитьНажатие(Кнопка)
	//Поиск=НайтиФайлы(ПутьКФайлу,"*.txt");
	////Сообщить("Найено " + Строка(Поиск.Количество()) + " ф.");
	//Для каждого Ф Из Поиск Цикл
	//	
	//	ТХТ=Новый ТекстовыйДокумент;
	//	ТХТ.Прочитать(Ф.ПолноеИмя);
	//	//Сообщить(ТХТ.КоличествоСтрок());
	//	Если ТХТ.КоличествоСтрок()>2 тогда 
	//		Заголовок=ТХТ.ПолучитьСтроку(1);
	//		СписЗН=ПолучитьСписок(Заголовок,Символы.Таб);
	//		ПоискПоказаний=Документы.ПоказанияДатчиков.НайтиПоРеквизиту("НомерКадра",СписЗН[0].Значение);
	//		Если ПоискПоказаний.Пустая() тогда
	//			НовПоказания=Документы.ПоказанияДатчиков.СоздатьДокумент();
	//			ГодДТ=Число(Прав(СписЗН[1].значение,4));
	//			МесДТ=Число(Сред(СписЗН[1].значение,4,2));
	//			ЧислоДТ=Число(Лев(СписЗН[1].значение,2));
	//			ЧасДТ=Число(Лев(СписЗН[2].значение,2));
	//			МинДТ=Число(Сред(СписЗН[2].значение,4,2));
	//			СекДТ=Число(Прав(СписЗН[2].значение,2));
	//			ДТДок=Дата(ГодДТ,МесДТ,ЧислоДТ,ЧасДТ,МинДТ,СекДТ);
	//			НовПоказания.Дата=ДТДок;
	//			НовПоказания.Время=ДТДок;
	//			НовПоказания.НомерКадра=СписЗН[0].значение;
	//			Для Сч=3 по ТХТ.КоличествоСтрок() цикл
	//				
	//				СписЗН=ПолучитьСписок(ТХТ.ПолучитьСтроку(Сч),Символы.Таб);
	//				Равно=ПолучитьСписок(СписЗН[1].Значение,"=");
	//				Датчик=Равно[0].значение;
	//				Показание=Равно[1].значение;
	//				ПоискДатчика=Справочники.Датчики.НайтиПоНаименованию(Датчик);
	//				Если ПоискДатчика.Пустая() тогда
	//					НовДатчик=Справочники.Датчики.СоздатьЭлемент();
	//					НовДатчик.Наименование=Датчик;
	//					НовДатчик.Записать();
	//					ПоискДатчика=НовДатчик.Ссылка;
	//				конецесли;
	//				Поиск=НовПоказания.Датчики.Найти(ПоискДатчика,"Датчик");
	//				Если Поиск=Неопределено тогда
	//					Попытка
	//					НовСтр=НовПоказания.Датчики.Добавить();
	//				НовСтр.Датчик=ПоискДатчика;
	//				НовСтр.Показатель=Число(Показание);

	//						
	//					
	//					Исключение
	//					
	//					КонецПопытки; 
	//									конецесли;
	//				
	//			КонецЦикла;
	//			Если НовПоказания.Датчики.Количество()>0 тогда
	//				НовПоказания.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	//			конецесли;
	//		конецесли;
	//	конецесли	
	//КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
ВыполнитьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандаНаСервере()
	Поиск=НайтиФайлы(ПутьКФайлу,"*.txt");
	//Сообщить("Найено " + Строка(Поиск.Количество()) + " ф.");
	Для каждого Ф Из Поиск Цикл
		
		ТХТ=Новый ТекстовыйДокумент;
		ТХТ.Прочитать(Ф.ПолноеИмя);
		//Сообщить(ТХТ.КоличествоСтрок());
		Если ТХТ.КоличествоСтрок()>2 тогда 
			Заголовок=ТХТ.ПолучитьСтроку(1);
			СписЗН=ПолучитьСписок(Заголовок,Символы.Таб);
			ПоискПоказаний=Документы.ПоказанияДатчиков.НайтиПоРеквизиту("НомерКадра",СписЗН[0].Значение);
			Если ПоискПоказаний.Пустая() тогда
				НовПоказания=Документы.ПоказанияДатчиков.СоздатьДокумент();
				ГодДТ=Число(Прав(СписЗН[1].значение,4));
				МесДТ=Число(Сред(СписЗН[1].значение,4,2));
				ЧислоДТ=Число(Лев(СписЗН[1].значение,2));
				ЧасДТ=Число(Лев(СписЗН[2].значение,2));
				МинДТ=Число(Сред(СписЗН[2].значение,4,2));
				СекДТ=Число(Прав(СписЗН[2].значение,2));
				ДТДок=Дата(ГодДТ,МесДТ,ЧислоДТ,ЧасДТ,МинДТ,СекДТ);
				НовПоказания.Дата=ДТДок;
				НовПоказания.Время=ДТДок;
				НовПоказания.НомерКадра=СписЗН[0].значение;
				Для Сч=3 по ТХТ.КоличествоСтрок() цикл
					
					СписЗН=ПолучитьСписок(ТХТ.ПолучитьСтроку(Сч),Символы.Таб);
					Равно=ПолучитьСписок(СписЗН[1].Значение,"=");
					Датчик=Равно[0].значение;
					Показание=Равно[1].значение;
					ПоискДатчика=Справочники.Датчики.НайтиПоНаименованию(Датчик);
					Если ПоискДатчика.Пустая() тогда
						НовДатчик=Справочники.Датчики.СоздатьЭлемент();
						НовДатчик.Наименование=Датчик;
						НовДатчик.Записать();
						ПоискДатчика=НовДатчик.Ссылка;
					конецесли;
					Поиск=НовПоказания.Датчики.Найти(ПоискДатчика,"Датчик");
					Если Поиск=Неопределено тогда
						Попытка
							НовСтр=НовПоказания.Датчики.Добавить();
							НовСтр.Датчик=ПоискДатчика;
							НовСтр.Показатель=Число(Показание);
						
						Исключение
						
						КонецПопытки; 
					конецесли;
					
				КонецЦикла;
				Если НовПоказания.Датчики.Количество()>0 тогда
					НовПоказания.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				конецесли;
			конецесли;
		конецесли	
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписок(Стр,Разделитель) 
	СписЗнач=Новый СписокЗначений;
	Если Найти(Стр,Разделитель)<>0 тогда
		Пока СтрДлина(СТР)>0 цикл
			Попытка
				Поз=Найти(Стр,Разделитель);
				Если Поз=0 тогда // последний элемент
					СписЗнач.Добавить(СокрЛП(СТР));
					Прервать;
				конецесли;
				
				СписЗнач.Добавить(СокрЛП(Лев(СТР,Поз-1)));
				СТР=Прав(СТР,СтрДлина(СТР)-Поз);
			исключение
				Прервать;
			конецпопытки;
		конеццикла;
	иначе // только 1 элемент
		Попытка
			СписЗнач.Добавить(СокрЛП(СТР));	
		исключение
		конецпопытки;
	конецесли;
	Возврат СписЗнач;
конецфункции




