&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

ВключатьПроизвольныеЧекиВидимость = НастройкиСервер.ЭтоАдмин();  
Элементы.ВключатьПроизвольныеЧеки.Видимость = ВключатьПроизвольныеЧекиВидимость;

КонецПроцедуры

&НаКлиенте
Процедура НомерСменыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_ФормаВыбораСмены", ЭтаФорма); 
ОткрытьФорму("Отчет.ОтчетКассоваяСмена.Форма.ФормаВыбораСмены", , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы_ФормаВыбораСмены(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

НомерСмены = Результат.НомерСменыККТ; 	
ДатаСмены = Результат.ДатаСменыККТ; 	
НачалоСмены = Результат.НачалоКассовойСмены; 	
ОкончаниеСмены = Результат.ОкончаниеКассовойСмены; 	

КонецПроцедуры

&НаКлиенте
Процедура НомерСменыОткрытие(Элемент, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Если НомерСмены = 0 Тогда Возврат; КонецЕсли; 
	
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
Ключ =  КлючКассоваяСмена();
Если Ключ = Неопределено Тогда Возврат; КонецЕсли; 
ПараметрыФормы.Вставить("Ключ", Ключ);

ОткрытьФорму("Документ.КассоваяСмена.Форма.ФормаДокумента", ПараметрыФормы , ЭтаФорма
	,,,, , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаСервере
Функция КлючКассоваяСмена()
	
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	КассоваяСмена.Ссылка КАК Ссылка
               |ИЗ
               |	Документ.КассоваяСмена КАК КассоваяСмена
               |ГДЕ
               |	КассоваяСмена.ДатаСменыККТ = &ДатаСменыККТ
               |	И КассоваяСмена.НомерСменыККТ = &НомерСменыККТ
               |
               |УПОРЯДОЧИТЬ ПО
               |	КассоваяСмена.НачалоКассовойСмены УБЫВ";

Запрос.УстановитьПараметр("НомерСменыККТ", НомерСмены); 
Запрос.УстановитьПараметр("ДатаСменыККТ", ДатаСмены); 
Результат  = Запрос.Выполнить();
Если Результат.Пустой() Тогда Возврат Неопределено; КонецЕсли;

ТЗ = Результат.Выгрузить();
Ключ = ТЗ[0].Ссылка;
Возврат Ключ;
КонецФункции

&НаКлиенте
Процедура ПечатьКасса(Команда)
Если НомерСмены = 0 Тогда Возврат; КонецЕсли;	

ПолеОтчета = ТабДокКасса(); 	
КонецПроцедуры

&НаСервере
Функция ТабДокКасса()
ТабДок=Новый ТабличныйДокумент;
ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

Макет = Отчеты.ОтчетКассоваяСмена.ПолучитьМакет("МакетКасса");

Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.НомерСменыККТ = НомерСмены;
Область.Параметры.НачалоКассовойСмены = НачалоСмены;
Область.Параметры.ОкончаниеКассовойСмены = ОкончаниеСмены;
ТабДок.Вывести(Область);

ШапкаОсновная = Макет.ПолучитьОбласть("Шапка|Основная");
ТабДок.Вывести(ШапкаОсновная);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Корень,
                      |	ДопУслуги.Наименование КАК Наименование,
                      |	ДопУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты,
                      |	ДопУслуги.НомерПП КАК НомерПП
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");
ТЗ_ГруппыДопУслуги = Запрос.Выполнить().Выгрузить();

СтрокаГруппаПроживание = ТЗ_ГруппыДопУслуги.Добавить();
СтрокаГруппаПроживание.Корень = Справочники.ДопУслуги.ПустаяСсылка();
СтрокаГруппаПроживание.Наименование = "Без группы";
СтрокаГруппаПроживание.ЗаголовокОтчеты = "Без группы";

ШапкаГруппа = Макет.ПолучитьОбласть("Шапка|Группа");
Для Каждого Строка Из ТЗ_ГруппыДопУслуги Цикл
	ЗаголовокОтчеты = ?(СокрЛП(Строка.ЗаголовокОтчеты) = "", Строка.Наименование, Строка.ЗаголовокОтчеты);
	Строка.ЗаголовокОтчеты = ЗаголовокОтчеты; 
КонецЦикла;

ШапкаГруппа.Параметры.НаименованиеГруппа = "Проживание"; 
ТабДок.Присоединить(ШапкаГруппа);	

Для Каждого Строка Из ТЗ_ГруппыДопУслуги Цикл
	ШапкаГруппа.Параметры.НаименованиеГруппа = Строка.ЗаголовокОтчеты; 
	ТабДок.Присоединить(ШапкаГруппа);	
КонецЦикла;

ОбластьПовтора = ТабДок.Область("R5");
ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовтора;

// Строки
Запрос = Новый Запрос;
Запрос.Текст =  "ВЫБРАТЬ
                |	КассовыйДокумент.Ссылка КАК Ссылка,
                |	КассовыйДокумент.Номер КАК Номер,
                |	КассовыйДокумент.Дата КАК Дата,
                |	КассовыйДокумент.Проведен КАК Проведен,
                |	КассовыйДокумент.ОтКого КАК ОтКого,
                |	КассовыйДокумент.Приход КАК Приход,
                |	КассовыйДокумент.Сумма КАК Сумма,
                |	КассовыйДокумент.ВидОперации КАК ВидОперации,
                |	КассовыйДокумент.Примечание КАК Примечание,
                |	КассовыйДокумент.КредитнаяКарта КАК КредитнаяКарта,
                |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                |	КассовыйДокумент.СуммаКарта КАК СуммаКарта,
                |	КассовыйДокумент.СуммаНаличные КАК СуммаНаличные,
                |	КассовыйДокумент.НомерСменыККМ КАК НомерСменыККМ,
                |	КассовыйДокумент.НомерЧекаККМ КАК НомерЧекаККМ,
                |	КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                |	КассовыйДокумент.Аванс КАК Аванс,
                |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратов,
                |	КассовыйДокумент.ДолгиОплата.(
                |		ДокументДолг КАК ДокументДолг,
                |		СчетГУИД КАК СчетГУИД,
                |		Сумма КАК Сумма
                |	) КАК ДолгиОплата
                |ИЗ
                |	Документ.КассовыйДокумент КАК КассовыйДокумент
                |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                |			СУММА(КассовыйДокумент.Сумма) КАК Сумма
                |		ИЗ
                |			Документ.КассовыйДокумент КАК КассовыйДокумент
                |		ГДЕ
                |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                |		
                |		СГРУППИРОВАТЬ ПО
                |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                |ГДЕ
                |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                |	И КассовыйДокумент.НомерСменыККМ = &НомерСменыККМ
                |	И КассовыйДокумент.Дата >= &НачалоСмены
                |	И КассовыйДокумент.Дата <= &ОкончаниеСмены
                |	И ВЫБОР
                |			КОГДА &ВключатьПроизвольныеЧеки
                |				ТОГДА ИСТИНА
                |			ИНАЧЕ КассовыйДокумент.ЭтоПроизвольныйЧек = ЛОЖЬ
                |		КОНЕЦ
                |
                |УПОРЯДОЧИТЬ ПО
                |	Дата";

Запрос.УстановитьПараметр("НомерСменыККМ", НомерСмены);
Запрос.УстановитьПараметр("ВключатьПроизвольныеЧеки", ВключатьПроизвольныеЧеки);

НачалоСмены_П = НачалоДня(НачалоСмены);
Запрос.УстановитьПараметр("НачалоСмены", НачалоСмены_П);

ОкончаниеСмены_П = ?(ЗначениеЗаполнено(ОкончаниеСмены), ОкончаниеСмены, '30000101');
ОкончаниеСмены_П = КонецДня(ОкончаниеСмены_П);
Запрос.УстановитьПараметр("ОкончаниеСмены", ОкончаниеСмены_П);

ТЗ = Запрос.Выполнить().Выгрузить();

ИтогоПоКарте = 0; 
ИтогоНаличные = 0;
ИтогоВозврат = 0;

ИтогоОтель = 0;
ИтогоКоворкинг = 0;
Для каждого Строка Из ТЗ Цикл
	СтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
	
	СтрокаОсновная.Параметры.ДатаВремя = Строка.Дата;
	СтрокаОсновная.Параметры.НомерДокумента = Строка.Номер;
	
	СтрокаОсновная.Параметры.ФИО = Строка.ОтКого.Наименование;
	
	СтрокаОсновная.Параметры.Приход = Флажок(Строка.Приход);
	ЭтоВозврат = ЗначениеЗаполнено(Строка.ВозвратДокумент); 
	СтрокаОсновная.Параметры.Возврат = Флажок(ЭтоВозврат);

	КредитнаяКарта = (Строка.СуммаКарта > 0);
	СтрокаОсновная.Параметры.Карта = Флажок(КредитнаяКарта);
	
	Наличные = (Строка.СуммаНаличные > 0);
	СтрокаОсновная.Параметры.Наличные = Флажок(Наличные);
	
	Если Строка.СуммаВозвратов = 0 Тогда
		СтрокаОсновная.Параметры.Сумма = Строка.Сумма;
	Иначе	
 		СтрокаОсновная.Параметры.Сумма = Строка(Строка.Сумма) + " ( - " + Строка(Строка.СуммаВозвратов) + ")";
	КонецЕсли;
	
	СтрокаОсновная.Параметры.НомерЧекаККМ = Строка.НомерЧекаККМ;
	
	Если ЭтоВозврат Тогда 
		ИтогоВозврат = ИтогоВозврат + Строка.Сумма; 	
	Иначе	
		Если КредитнаяКарта Тогда 
			ИтогоПоКарте = ИтогоПоКарте + Строка.СуммаКарта; 	
		КонецЕсли;
		
		Если Наличные Тогда 
			ИтогоНаличные = ИтогоНаличные + Строка.СуммаНаличные; 	
		КонецЕсли;
	КонецЕсли;
	
	СтрокаОсновная.Параметры.РасшифровкаКассовыйДокумент = Строка.Ссылка;
	
	Если Строка.ДолгиОплата.Количество() = 0
	ИЛИ ЭтоВозврат 	
	Тогда 
		ТабДок.Вывести(СтрокаОсновная);	
		
		Продолжить;
	КонецЕсли;
	
	ДолгиОплата = Строка.ДолгиОплата.Скопировать();
	ДолгиОплата.Свернуть("ДокументДолг", "Сумма");
	Для Каждого СтрокаОплата Из ДолгиОплата Цикл
    	СтрокаОсновная.Параметры.РасшифровкаЗаявка = СтрокаОплата.ДокументДолг;
		
		ГрупповаяОплата = (ТипЗнч(СтрокаОплата.ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета"));
		Если ГрупповаяОплата Тогда
			ИтогоОтель = ИтогоОтель + СтрокаОплата.Сумма;

			СтрокаОсновная.Параметры.ГрупповаяОплата = Флажок(ГрупповаяОплата);
			СтрокаОсновная.Параметры.ЗаявкаСумма = СтрокаОплата.Сумма;

			СтрокаОсновная.Параметры.НомерВРезерв = "Гр. счет";
			СтрокаОсновная.Параметры.ЗаявкаНомер = СтрокаОплата.ДокументДолг.Номер;
			
			ТабДок.Вывести(СтрокаОсновная);	  
			
			ТЗ_Данные = Новый ТаблицаЗначений;
			ТипСтрока = Новый ОписаниеТипов("Строка");
			ТЗ_Данные.Колонки.Добавить("УслугаКорень", ТипСтрока);
			
			ТипЧисло = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10, 2));
			ТЗ_Данные.Колонки.Добавить("СуммаОплаты", ТипЧисло); 
			
			Для Каждого СтрокаДокументДолг Из СтрокаОплата.ДокументДолг.ДокументыДолги Цикл
				ТЗ_Заявка = ТЗ_Заявка(СтрокаДокументДолг.ДокументДолг, Строка.Ссылка);

				ТЗ_Заявка.Свернуть("УслугаКорень", "СуммаОплаты"); 
				
				Для Каждого Строка_ТЗ_Заявка Из ТЗ_Заявка Цикл
				    НоваяСтрока = ТЗ_Данные.Добавить();
					
					НоваяСтрока.УслугаКорень = Строка_ТЗ_Заявка.УслугаКорень;
					НоваяСтрока.СуммаОплаты = Строка_ТЗ_Заявка.СуммаОплаты;
				КонецЦикла;
			КонецЦикла;
			
			ТЗ_Данные.Свернуть("УслугаКорень", "СуммаОплаты");

			ПрисоединитьГруппа(ТабДок, Макет, ТЗ_ГруппыДопУслуги, ТЗ_Данные);
			
			Перейти ~ПРОДОЛЖИТЬ_ДОЛГИОПЛАТА;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаОплата.ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда  
			ИтогоОтель = ИтогоОтель + СтрокаОплата.Сумма;
			
			СтрокаОсновная.Параметры.ЗаявкаНомер = СтрокаОплата.ДокументДолг.Номер;
			СтрокаОсновная.Параметры.НомерВРезерв = СтрокаОплата.ДокументДолг.НомерВРезерв;
			СтрокаОсновная.Параметры.ЗаявкаСумма = СтрокаОплата.Сумма;
			
            ТЗЗаявка = ТЗ_Заявка(СтрокаОплата.ДокументДолг, Строка.Ссылка);
			
			Если ТЗЗаявка.Количество() = 0 
			Тогда 
				СтрокаОсновная.Параметры.Аванс = Флажок(Истина);
				
				ТабДок.Вывести(СтрокаОсновная);	
				
				Перейти ~ПРОДОЛЖИТЬ_ДОЛГИОПЛАТА;
			Иначе
				СтрокаОсновная.Параметры.Аванс = Флажок(Ложь);
			КонецЕсли;
			
			ТабДок.Вывести(СтрокаОсновная);	
			
			ТЗЗаявка.Свернуть("УслугаКорень", "СуммаОплаты");

			ПрисоединитьГруппа(ТабДок, Макет, ТЗ_ГруппыДопУслуги, ТЗЗаявка);
		КонецЕсли;
		
		Если ТипЗнч(СтрокаОплата.ДокументДолг) = Тип("ДокументСсылка.КоворкингСчета") Тогда 
			ИтогоКоворкинг = ИтогоКоворкинг + СтрокаОплата.Сумма;
			
			СтрокаОсновная.Параметры.ЗаявкаНомер = СтрокаОплата.ДокументДолг.Номер;
			СтрокаОсновная.Параметры.НомерВРезерв = СтрокаОплата.ДокументДолг.КоворкингЗаявка.КоворкингНомер;
			
			СтрокаОсновная.Параметры.Коворкинг = Флажок(Истина);
			СтрокаОсновная.Параметры.ЗаявкаСумма = СтрокаОплата.Сумма;
			
			ТабДок.Вывести(СтрокаОсновная);	
			
		КонецЕсли;
~ПРОДОЛЖИТЬ_ДОЛГИОПЛАТА:
		СтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
	КонецЦикла;		
		
КонецЦикла;

Подножие = Макет.ПолучитьОбласть("Подножие|Основная");
Подножие.Параметры.ИтогоПоКарте = ИтогоПоКарте;
Подножие.Параметры.ИтогоНаличные = ИтогоНаличные;
Подножие.Параметры.ИтогоВозврат = ИтогоВозврат;

Подножие.Параметры.ИтогоОтель = ИтогоОтель;
Подножие.Параметры.ИтогоКоворкинг = ИтогоКоворкинг;


ТабДок.Вывести(Подножие);

ПодножиеПрисоединить = Макет.ПолучитьОбласть("Подножие|Группа");
ТабДок.Присоединить(ПодножиеПрисоединить);	

Для Каждого СтрокаДопУслуги Из ТЗ_ГруппыДопУслуги Цикл
	ТабДок.Присоединить(ПодножиеПрисоединить);	
КонецЦикла;

ТабДок.НижнийКолонтитул.ТекстСправа = "[&Дата] [&Время]";
ТабДок.НижнийКолонтитул.Выводить = Истина;
ТабДок.НижнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.НижнийКолонтитул.Шрифт = мШрифт;

Возврат ТабДок;
КонецФункции

&НаСервере
Функция ТЗ_Заявка(ДокументДолг, ДокументОплаты)
ЗапросЗаявка = Новый Запрос("ВЫБРАТЬ
                            |	СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты,
                            |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга
                            |ИЗ
                            |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                            |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                            |ГДЕ
                            |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
                            |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = &ДокументОплаты
                            |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = &ЗаявкаСсылка
                            |
                            |СГРУППИРОВАТЬ ПО
                            |	ЗаявкаНаБронированиеДопУслуги.Услуга");

ЗапросЗаявка.УстановитьПараметр("ЗаявкаСсылка", ДокументДолг);	
ЗапросЗаявка.УстановитьПараметр("ДокументОплаты", ДокументОплаты);	

ТЗЗаявка = ЗапросЗаявка.Выполнить().Выгрузить(); 

ТЗЗаявка.Колонки.Добавить("УслугаКорень");
Для Каждого СтрокаЗаявка Из ТЗЗаявка Цикл
	Если СтрокаЗаявка.Услуга = NULL Тогда 
		СтрокаЗаявка.УслугаКорень = "Проживание";
		
		Продолжить;
	КонецЕсли; 
		
	РодительТекущий = СтрокаЗаявка.Услуга.Родитель; 
	
	КореньУслуга(РодительТекущий);

	СтрокаЗаявка.УслугаКорень = РодительТекущий;
КонецЦикла;

Возврат ТЗЗаявка;
КонецФункции

&НаСервере
Процедура ПрисоединитьГруппа(ТабДок, Макет, ТЗ_ГруппыДопУслуги, ТЗЗаявка)
СтрокаГруппа = Макет.ПолучитьОбласть("Строка|Группа");

НайденнаяСтрока = ТЗЗаявка.Найти( "Проживание", "УслугаКорень"); 
СуммаГруппа = ?(НайденнаяСтрока = Неопределено, 0, НайденнаяСтрока.СуммаОплаты);
СтрокаГруппа.Параметры.СуммаГруппа = СуммаГруппа; 
ТабДок.Присоединить(СтрокаГруппа);	

Для Каждого СтрокаДопУслуги Из ТЗ_ГруппыДопУслуги Цикл
	СтрокаГруппа = Макет.ПолучитьОбласть("Строка|Группа");
	НайденнаяСтрока = ТЗЗаявка.Найти(СтрокаДопУслуги.Корень, "УслугаКорень"); 
	
	СуммаГруппа = ?(НайденнаяСтрока = Неопределено, 0, НайденнаяСтрока.СуммаОплаты);
	СтрокаГруппа.Параметры.СуммаГруппа = СуммаГруппа; 
	ТабДок.Присоединить(СтрокаГруппа);	
КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТабДокКасса_1()
ТабДок=Новый ТабличныйДокумент;
ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

Макет = Отчеты.ОтчетКассоваяСмена.ПолучитьМакет("МакетКасса");

Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.НомерСменыККТ = НомерСмены;
Область.Параметры.НачалоКассовойСмены = НачалоСмены;
Область.Параметры.ОкончаниеКассовойСмены = ОкончаниеСмены;
ТабДок.Вывести(Область);

ШапкаОсновная = Макет.ПолучитьОбласть("Шапка|Основная");
ТабДок.Вывести(ШапкаОсновная);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Корень,
                      |	ДопУслуги.Наименование КАК Наименование,
                      |	ДопУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты,
                      |	ДопУслуги.НомерПП КАК НомерПП
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");
ТЗ_ГруппыДопУслуги = Запрос.Выполнить().Выгрузить();

СтрокаГруппаПроживание = ТЗ_ГруппыДопУслуги.Добавить();
СтрокаГруппаПроживание.Корень = Справочники.ДопУслуги.ПустаяСсылка();
СтрокаГруппаПроживание.Наименование = "Без группы";
СтрокаГруппаПроживание.ЗаголовокОтчеты = "Без группы";

ШапкаГруппа = Макет.ПолучитьОбласть("Шапка|Группа");
Для Каждого Строка Из ТЗ_ГруппыДопУслуги Цикл
	ЗаголовокОтчеты = ?(СокрЛП(Строка.ЗаголовокОтчеты) = "", Строка.Наименование, Строка.ЗаголовокОтчеты);
	Строка.ЗаголовокОтчеты = ЗаголовокОтчеты; 
КонецЦикла;

ШапкаГруппа.Параметры.НаименованиеГруппа = "Проживание"; 
ТабДок.Присоединить(ШапкаГруппа);	

Для Каждого Строка Из ТЗ_ГруппыДопУслуги Цикл
	ШапкаГруппа.Параметры.НаименованиеГруппа = Строка.ЗаголовокОтчеты; 
	ТабДок.Присоединить(ШапкаГруппа);	
КонецЦикла;

ОбластьПовтора = ТабДок.Область("R5");
ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовтора;

// Строки
Запрос = Новый Запрос;
Запрос.Текст =  "ВЫБРАТЬ
                |	КассовыйДокумент.Ссылка КАК Ссылка,
                |	КассовыйДокумент.Номер КАК Номер,
                |	КассовыйДокумент.Дата КАК Дата,
                |	КассовыйДокумент.Проведен КАК Проведен,
                |	КассовыйДокумент.ОтКого КАК ОтКого,
                |	КассовыйДокумент.Приход КАК Приход,
                |	КассовыйДокумент.Сумма КАК Сумма,
                |	КассовыйДокумент.ВидОперации КАК ВидОперации,
                |	КассовыйДокумент.Примечание КАК Примечание,
                |	КассовыйДокумент.КредитнаяКарта КАК КредитнаяКарта,
                |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                |	КассовыйДокумент.СуммаКарта КАК СуммаКарта,
                |	КассовыйДокумент.СуммаНаличные КАК СуммаНаличные,
                |	КассовыйДокумент.НомерСменыККМ КАК НомерСменыККМ,
                |	КассовыйДокумент.НомерЧекаККМ КАК НомерЧекаККМ,
                |	КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                |	КассовыйДокумент.Аванс КАК Аванс,
                |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратов,
                |	КассовыйДокумент.ДолгиОплата.(
                |		ДокументДолг КАК ДокументДолг,
                |		СчетГУИД КАК СчетГУИД,
                |		Сумма КАК Сумма
                |	) КАК ДолгиОплата
                |ИЗ
                |	Документ.КассовыйДокумент КАК КассовыйДокумент
                |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                |			СУММА(КассовыйДокумент.Сумма) КАК Сумма
                |		ИЗ
                |			Документ.КассовыйДокумент КАК КассовыйДокумент
                |		ГДЕ
                |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                |		
                |		СГРУППИРОВАТЬ ПО
                |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                |ГДЕ
                |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                |	И КассовыйДокумент.НомерСменыККМ = &НомерСменыККМ
                |	И КассовыйДокумент.Дата >= &НачалоСмены
                |	И КассовыйДокумент.Дата <= &ОкончаниеСмены
                |	И ВЫБОР
                |			КОГДА &ВключатьПроизвольныеЧеки
                |				ТОГДА ИСТИНА
                |			ИНАЧЕ КассовыйДокумент.ЭтоПроизвольныйЧек = ЛОЖЬ
                |		КОНЕЦ
                |
                |УПОРЯДОЧИТЬ ПО
                |	Дата";

Запрос.УстановитьПараметр("НомерСменыККМ", НомерСмены);
Запрос.УстановитьПараметр("ВключатьПроизвольныеЧеки", ВключатьПроизвольныеЧеки);

НачалоСмены_П = НачалоДня(НачалоСмены);
Запрос.УстановитьПараметр("НачалоСмены", НачалоСмены_П);

ОкончаниеСмены_П = ?(ЗначениеЗаполнено(ОкончаниеСмены), ОкончаниеСмены, '30000101');
ОкончаниеСмены_П = КонецДня(ОкончаниеСмены_П);
Запрос.УстановитьПараметр("ОкончаниеСмены", ОкончаниеСмены_П);

ТЗ = Запрос.Выполнить().Выгрузить();

ИтогоПоКарте = 0; 
ИтогоНаличные = 0;
ИтогоВозврат = 0;

ИтогоОтель = 0;
ИтогоКоворкинг = 0;
Для каждого Строка Из ТЗ Цикл
	СтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
	
	СтрокаОсновная.Параметры.ДатаВремя = Строка.Дата;
	СтрокаОсновная.Параметры.НомерДокумента = Строка.Номер;
	
	//СтрокаОсновная.Параметры.НомерВРезерв = Строка.НомерВРезерв;
	//СтрокаОсновная.Параметры.ФИО = Строка.ФИО;
	СтрокаОсновная.Параметры.ФИО = Строка.ОтКого.Наименование;
	
	СтрокаОсновная.Параметры.Приход = Флажок(Строка.Приход);
	//СтрокаОсновная.Параметры.Возврат = Флажок(Строка.Возврат);
	ЭтоВозврат = ЗначениеЗаполнено(Строка.ВозвратДокумент); 
	СтрокаОсновная.Параметры.Возврат = Флажок(ЭтоВозврат);

	КредитнаяКарта = (Строка.СуммаКарта > 0);
	СтрокаОсновная.Параметры.Карта = Флажок(КредитнаяКарта);
	
	Наличные = (Строка.СуммаНаличные > 0);
	СтрокаОсновная.Параметры.Наличные = Флажок(Наличные);
	
	Если Строка.СуммаВозвратов = 0 Тогда
		СтрокаОсновная.Параметры.Сумма = Строка.Сумма;
	Иначе	
 		СтрокаОсновная.Параметры.Сумма = Строка(Строка.Сумма) + " ( - " + Строка(Строка.СуммаВозвратов) + ")";
	КонецЕсли;
	
	СтрокаОсновная.Параметры.НомерЧекаККМ = Строка.НомерЧекаККМ;
	
	Если ЭтоВозврат Тогда 
		ИтогоВозврат = ИтогоВозврат + Строка.Сумма; 	
	Иначе	
		Если КредитнаяКарта Тогда 
			ИтогоПоКарте = ИтогоПоКарте + Строка.СуммаКарта; 	
		КонецЕсли;
		
		Если Наличные Тогда 
			ИтогоНаличные = ИтогоНаличные + Строка.СуммаНаличные; 	
		КонецЕсли;
	КонецЕсли;
	
	СтрокаОсновная.Параметры.РасшифровкаКассовыйДокумент = Строка.Ссылка;
	
	Если Строка.ДолгиОплата.Количество() = 0
	ИЛИ ЭтоВозврат 	
	Тогда 
		ТабДок.Вывести(СтрокаОсновная);	
		
		Продолжить;
	КонецЕсли;
	
	ДолгиОплата = Строка.ДолгиОплата.Скопировать();
	ДолгиОплата.Свернуть("ДокументДолг", "Сумма");
	Для Каждого СтрокаОплата Из ДолгиОплата Цикл
    	СтрокаОсновная.Параметры.РасшифровкаЗаявка = СтрокаОплата.ДокументДолг;
		
		ГрупповаяОплата = (ТипЗнч(СтрокаОплата.ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета"));
		Если ГрупповаяОплата Тогда
			СтрокаОсновная.Параметры.ГрупповаяОплата = Флажок(ГрупповаяОплата);
			СтрокаОсновная.Параметры.ЗаявкаСумма = СтрокаОплата.Сумма;
			
			ТабДок.Вывести(СтрокаОсновная);	
			
			Перейти ~ПРОДОЛЖИТЬ_ДОЛГИОПЛАТА;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаОплата.ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда  
			ИтогоОтель = ИтогоОтель + СтрокаОплата.Сумма;
			
			СтрокаОсновная.Параметры.ЗаявкаНомер = СтрокаОплата.ДокументДолг.Номер;
			СтрокаОсновная.Параметры.НомерВРезерв = СтрокаОплата.ДокументДолг.НомерВРезерв;
			
			ЗапросЗаявка = Новый Запрос("ВЫБРАТЬ
			                            |	СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты,
			                            |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга
			                            |ИЗ
			                            |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
			                            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
			                            |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
			                            |ГДЕ
			                            |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
			                            |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = &ДокументОплаты
			                            |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = &ЗаявкаСсылка
			                            |
			                            |СГРУППИРОВАТЬ ПО
			                            |	ЗаявкаНаБронированиеДопУслуги.Услуга");
			
			ЗапросЗаявка.УстановитьПараметр("ЗаявкаСсылка", СтрокаОплата.ДокументДолг);	
			ЗапросЗаявка.УстановитьПараметр("ДокументОплаты", Строка.Ссылка);	
			
			ТЗЗаявка = ЗапросЗаявка.Выполнить().Выгрузить(); 
			
			СтрокаОсновная.Параметры.ЗаявкаСумма = СтрокаОплата.Сумма;
		
			Если ТЗЗаявка.Количество() = 0 
			Тогда 
				СтрокаОсновная.Параметры.Аванс = Флажок(Истина);
				
				ТабДок.Вывести(СтрокаОсновная);	
				
				Перейти ~ПРОДОЛЖИТЬ_ДОЛГИОПЛАТА;
			Иначе
				СтрокаОсновная.Параметры.Аванс = Флажок(Ложь);
			КонецЕсли;
			
			ТабДок.Вывести(СтрокаОсновная);	

			ТЗЗаявка.Колонки.Добавить("УслугаКорень");
			Для Каждого СтрокаЗаявка Из ТЗЗаявка Цикл
				Если СтрокаЗаявка.Услуга = NULL Тогда 
					СтрокаЗаявка.УслугаКорень = "Проживание";
					
					Продолжить;
				КонецЕсли; 
					
				РодительТекущий = СтрокаЗаявка.Услуга.Родитель; 
				
				КореньУслуга(РодительТекущий);

				СтрокаЗаявка.УслугаКорень = РодительТекущий;
			КонецЦикла;
			
			ТЗЗаявка.Свернуть("УслугаКорень", "СуммаОплаты");
			
			СтрокаГруппа = Макет.ПолучитьОбласть("Строка|Группа");
			
			НайденнаяСтрока = ТЗЗаявка.Найти( "Проживание", "УслугаКорень"); 
			СуммаГруппа = ?(НайденнаяСтрока = Неопределено, 0, НайденнаяСтрока.СуммаОплаты);
			СтрокаГруппа.Параметры.СуммаГруппа = СуммаГруппа; 
			ТабДок.Присоединить(СтрокаГруппа);	

			Для Каждого СтрокаДопУслуги Из ТЗ_ГруппыДопУслуги Цикл
				СтрокаГруппа = Макет.ПолучитьОбласть("Строка|Группа");
				НайденнаяСтрока = ТЗЗаявка.Найти(СтрокаДопУслуги.Корень, "УслугаКорень"); 
				
				СуммаГруппа = ?(НайденнаяСтрока = Неопределено, 0, НайденнаяСтрока.СуммаОплаты);
				СтрокаГруппа.Параметры.СуммаГруппа = СуммаГруппа; 
				ТабДок.Присоединить(СтрокаГруппа);	
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаОплата.ДокументДолг) = Тип("ДокументСсылка.КоворкингСчета") Тогда 
			ИтогоКоворкинг = ИтогоКоворкинг + СтрокаОплата.Сумма;
			
			СтрокаОсновная.Параметры.ЗаявкаНомер = СтрокаОплата.ДокументДолг.Номер;
			СтрокаОсновная.Параметры.НомерВРезерв = СтрокаОплата.ДокументДолг.КоворкингЗаявка.КоворкингНомер;
			
			СтрокаОсновная.Параметры.Коворкинг = Флажок(Истина);
			СтрокаОсновная.Параметры.ЗаявкаСумма = СтрокаОплата.Сумма;
			
			ТабДок.Вывести(СтрокаОсновная);	
			
		КонецЕсли;
~ПРОДОЛЖИТЬ_ДОЛГИОПЛАТА:
		СтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
	КонецЦикла;		
		
КонецЦикла;

Подножие = Макет.ПолучитьОбласть("Подножие|Основная");
Подножие.Параметры.ИтогоПоКарте = ИтогоПоКарте;
Подножие.Параметры.ИтогоНаличные = ИтогоНаличные;
Подножие.Параметры.ИтогоВозврат = ИтогоВозврат;

Подножие.Параметры.ИтогоОтель = ИтогоОтель;
Подножие.Параметры.ИтогоКоворкинг = ИтогоКоворкинг;


ТабДок.Вывести(Подножие);

ПодножиеПрисоединить = Макет.ПолучитьОбласть("Подножие|Группа");
ТабДок.Присоединить(ПодножиеПрисоединить);	

Для Каждого СтрокаДопУслуги Из ТЗ_ГруппыДопУслуги Цикл
	ТабДок.Присоединить(ПодножиеПрисоединить);	
КонецЦикла;

ТабДок.НижнийКолонтитул.ТекстСправа = "[&Дата] [&Время]";
ТабДок.НижнийКолонтитул.Выводить = Истина;
ТабДок.НижнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.НижнийКолонтитул.Шрифт = мШрифт;

Возврат ТабДок;
КонецФункции

&НаСервере
Процедура КореньУслуга(РодительТекущий)
Если РодительТекущий.Родитель = Справочники.ДопУслуги.ПустаяСсылка() Тогда Возврат; КонецЕсли;	

РодительТекущий = РодительТекущий.Родитель;
КореньУслуга(РодительТекущий);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Флажок(Значение)
	Если Значение Тогда
		Возврат Символ(118); 
	Иначе
		Возврат ""; 
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
СтандартнаяОбработка = Ложь;	

Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
	ФормаИмя = "Документ.КассовыйДокумент.Форма.ФормаДокумента"; 	
ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	ФормаИмя = "Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента"; 	
ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	ФормаИмя = "Документ.ГрупповыеСчета.Форма.ФормаДокумента"; 	
ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.КоворкингСчета") Тогда
	ФормаИмя = "Документ.КоворкингСчета.Форма.ФормаДокумента"Иначе
	Возврат;
КонецЕсли;

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("Ключ", Расшифровка);
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);

ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

