&НаКлиенте
Процедура КоманднаяПанель1Заполнить__(Кнопка)
	//
	//ЗапросДолга=Новый запрос("ВЫБРАТЬ
	//                         |	СУММА(ЕСТЬNULL(ДолгиОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
	//                         |	ДолгиОстатки.Контрагент,
	//                         |	ДолгиОстатки.ДокументОплаты
	//                         |ИЗ
	//                         |	РегистрНакопления.Долги.Остатки(&ДТ, ) КАК ДолгиОстатки
	//                         |ГДЕ
	//                         |	ДолгиОстатки.ДокументОплаты.Дата <= &ДТ
	//                         |	И ДолгиОстатки.ДокументОплаты.Статус <> &Статус
	//                         |	И ДолгиОстатки.ДокументОплаты.РезервПо <= &ДТ
	//                         |
	//                         |СГРУППИРОВАТЬ ПО
	//                         |	ДолгиОстатки.Контрагент,
	//                         |	ДолгиОстатки.ДокументОплаты");	
	//						 ЗапросДолга.УстановитьПараметр("ДТ",Дата);
	//						 ЗапросДолга.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);
	//ТЗДолг=ЗапросДолга.Выполнить().Выгрузить();
	//Для каждого Долг Из ТЗДолг Цикл
	//
	//	Нов=Долги.Добавить();
	//	Нов.Контрагент=Долг.Контрагент;
	//	Нов.СуммаДолга=Долг.СуммаОстаток;
	//	Нов.СуммаПогашения=Долг.СуммаОстаток;
	//    Нов.Документ=Долг.ДокументОплаты;
	//
	//КонецЦикла; 
	//
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДолги(Команда)
ЗаполнитьДолгиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолгиНаСервере()
	ЗапросДолга=Новый запрос("ВЫБРАТЬ
	                         |	СУММА(ЕСТЬNULL(ДолгиОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
	                         |	ДолгиОстатки.Контрагент,
	                         |	ДолгиОстатки.ДокументОплаты
	                         |ИЗ
	                         |	РегистрНакопления.Долги.Остатки(&ДТ, ) КАК ДолгиОстатки
	                         |ГДЕ
	                         |	ДолгиОстатки.ДокументОплаты.Дата <= &ДТ
	                         |	И ДолгиОстатки.ДокументОплаты.Статус <> &Статус
	                         |	И ДолгиОстатки.ДокументОплаты.РезервПо <= &ДТ
	                         |
	                         |СГРУППИРОВАТЬ ПО
	                         |	ДолгиОстатки.Контрагент,
	                         |	ДолгиОстатки.ДокументОплаты");	
							 ЗапросДолга.УстановитьПараметр("ДТ", Объект.Дата);
							 ЗапросДолга.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);
	ТЗДолг=ЗапросДолга.Выполнить().Выгрузить();
	Для каждого Долг Из ТЗДолг Цикл
	
		Нов=Объект.Долги.Добавить();
		Нов.Контрагент=Долг.Контрагент;
		Нов.СуммаДолга=Долг.СуммаОстаток;
		Нов.СуммаПогашения=Долг.СуммаОстаток;
        Нов.Документ=Долг.ДокументОплаты;
	
	КонецЦикла; 
КонецПроцедуры

