&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Ложь);
	
НастройкаФормы();
КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()
Элементы.ГруппаЦены.Видимость = НЕ Объект.ПочасоваяОплата;
Элементы.ЦенаЗаЧас.Видимость = Объект.ПочасоваяОплата;
КонецПроцедуры

&НаКлиенте
Процедура ПочасоваяОплатаПриИзменении(Элемент)
НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЦветНомера(Команда)
ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
 Оповещение = Новый ОписаниеОповещения("ОповещениеВыборЦветаЗавершение", ЭтотОбъект);
 ДиалогВыбораЦвета.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыборЦветаЗавершение(Результат, ДополнительныеПараметры) Экспорт
Если НЕ Результат = Неопределено Тогда
	Элементы.ЦветНомера.ЦветФона = Результат; 

	АбсолютныйЦвет =  ОбщийФункционалСервер.ПолучитьАбсолютныйЦвет(Элементы.ЦветНомера.ЦветФона);
	Объект.ЦветНомераB=АбсолютныйЦвет.Синий;
	Объект.ЦветНомераG=АбсолютныйЦвет.Зеленый;
	Объект.ЦветНомераR=АбсолютныйЦвет.Красный;
	
	Элементы.ЦветНомера.ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(АбсолютныйЦвет);
	
КонецЕсли;
КонецПроцедуры


