
&НаКлиенте
Процедура ПриОткрытии(Отказ)
РезервС = ЭтаФорма.ВладелецФормы.Объект.РезервС;	
РезервПо = ЭтаФорма.ВладелецФормы.Объект.РезервПо;	
ДатаПереселения = ТекущаяДата();
КонецПроцедуры

//
&НаКлиенте
Процедура ДатаПереселенияПриИзменении(Элемент)
ДатаПереселенияПроверить();
КонецПроцедуры

&НаКлиенте
Функция ДатаПереселенияПроверить()
Если ДатаПереселения <= РезервС 
ИЛИ ДатаПереселения >= РезервПо
Тогда
	ПоказатьПредупреждение(, "Дата переселения вне дат размещения");
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции
//

//
&НаКлиенте
Процедура НомерКудаПриИзменении(Элемент)
НомерКудаПроверить();
КонецПроцедуры

&НаКлиенте
Функция НомерКудаПроверить()
//ДанныеОбъекта = Новый Структура();
//ДанныеОбъекта.Вставить("РезервС", РезервС); 
//ДанныеОбъекта.Вставить("РезервПо", РезервПо);

//ОбъектДанные = ЭтаФорма.ВладелецФормы.Объект;
//ДанныеОбъекта.Вставить("ВремяЗаезда", ОбъектДанные.ВремяЗаезда); 
//ДанныеОбъекта.Вставить("ВремяВыезда", ОбъектДанные.ВремяВыезда); 
//	
//Если ДокументыСервер.ЗанятостьНомераПроверить(ДанныеОбъекта, НомерКуда) Тогда	
//	ПоказатьПредупреждение(, "На эти даты номер занят");
//	Возврат Истина;
//КонецЕсли;

Возврат Ложь;
КонецФункции
//

&НаКлиенте
Процедура Переселить(Команда)
Если ДатаПереселенияПроверить() Тогда Возврат; КонецЕсли;	
Если НомерКудаПроверить() Тогда Возврат; КонецЕсли;	
	
Результат = Новый Структура("ДатаПереселения, НомерКуда", ДатаПереселения, НомерКуда);
	
ОповеститьОВыборе(Результат); 
КонецПроцедуры

&НаКлиенте
Процедура ОтменаКоманда(Команда)
ОповеститьОВыборе(""); 
КонецПроцедуры





