
Функция ЗаписатьОперацию(РезультатВыполнения, Параметры) Экспорт 
	//Если НЕ ЗначениеЗаполнено(Параметры) Тогда Возврат Неопределено; КонецЕсли;     
	Если Параметры = Неопределено Тогда Возврат Неопределено; КонецЕсли;     
	Если НЕ Параметры.Свойство("ТипТранзакции") Тогда Возврат Неопределено; КонецЕсли;  
	
	ТипТранзакции = Параметры.ТипТранзакции; 
	Если ТипТранзакции <> "AuthorizeSales" 
	И ТипТранзакции <> "AuthorizeVoid"	
	И ТипТранзакции <> "AuthorizeRefund"	
	Тогда Возврат Неопределено; КонецЕсли;
	
	ОперацииЭТМенеджер = РегистрыСведений.ОперацииЭТ.СоздатьМенеджерЗаписи();
	ОперацииЭТМенеджер.ГУИД = Новый УникальныйИдентификатор;
	
	ОперацииЭТМенеджер.КодАвторизации = РезультатВыполнения.КодАвторизации;
	ОперацииЭТМенеджер.НомерКарты = РезультатВыполнения.НомерКарты;
	ОперацииЭТМенеджер.НомерМерчанта = РезультатВыполнения.НомерМерчанта;
	ОперацииЭТМенеджер.НомерЧекаЭТ = РезультатВыполнения.НомерЧекаЭТ;
	ОперацииЭТМенеджер.СсылочныйНомер = РезультатВыполнения.СсылочныйНомер;
	
	ОперацииЭТМенеджер.СуммаОперации = РезультатВыполнения.СуммаОперации;
	
	ОперацииЭТМенеджер.ТипТранзакции = Параметры.ТипТранзакции; 
	
	ОперацииЭТМенеджер.ДанныеКарты = ?(Параметры.Свойство("ДанныеКарты")  , Параметры.ДанныеКарты, ""); 
	ОперацииЭТМенеджер.ТипКарты = ?(Параметры.Свойство("ТипКарты")  , Параметры.ТипКарты, 0); 
	
	ОперацииЭТМенеджер.НомерЧека = ?(Параметры.Свойство("НомерЧека")  , Параметры.НомерЧека, ""); 
	
	ОперацииЭТМенеджер.ДатаРегистрации = ТекущаяДата();
	
	ОперацииЭТМенеджер.ИдентификаторУстройстваНаименование = РезультатВыполнения.ИдентификаторУстройства.Наименование;

	Если ТипТранзакции = "AuthorizeVoid"	
	ИЛИ ТипТранзакции = "AuthorizeRefund"	
	Тогда 
		ОперацииЭТМенеджер.СсылочныйНомерВозврат = Параметры.СсылочныйНомерВозврат; 
	КонецЕсли;
	
	Если Параметры.Свойство("ДокументДолг") Тогда
		ОперацииЭТМенеджер.ДокументДолг = Параметры.ДокументДолг; 
	КонецЕсли;

	ОперацииЭТМенеджер.Записать(Истина);
	
	Возврат ОперацииЭТМенеджер.ГУИД;
КонецФункции

Процедура ЗаписатьВЭТКассовыйЧекКММ(ГУИД_ЭТ) Экспорт 
НаборЗаписей = РегистрыСведений.ОперацииЭТ.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.ГУИД.Установить(ГУИД_ЭТ);
НаборЗаписей.Прочитать();
Если НаборЗаписей.Выбран() Тогда
	НаборЗаписей[0].КассовыйЧек = Истина;

	НаборЗаписей.Записать(Истина);
КонецЕсли;
КонецПроцедуры

Процедура СверкаИтоговЗаписать(РезультатВыполнения, Параметры) Экспорт 
	ЭТСверкиИтоговМенеджер = РегистрыСведений.ЭТСверкиИтогов.СоздатьМенеджерЗаписи();
	ЭТСверкиИтоговМенеджер.ДатаСверки = ТекущаяДата();
	ЭТСверкиИтоговМенеджер.ТекстСлипЧека = РезультатВыполнения.ТекстСлипЧека;
	ЭТСверкиИтоговМенеджер.ИдентификаторУстройства = РезультатВыполнения.ИдентификаторУстройства;

	ЭТСверкиИтоговМенеджер.Записать(Истина);
КонецПроцедуры
