
&НаКлиенте
Процедура Команда1(Команда)
ЗаявкаСсылка = ЗаявкаСсылка();	
МассивЗаявок = ОбщийФункционалСервер.ТабличнаяЧастьДокументаВМассивСтруктур(ЗаявкаСсылка, "СчетаДетальноДолги");

//СчетаДетальноДолги = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ЗаявкаСсылка, "СчетаДетальноДолги");

//МассивЗаявок = ОбщийФункционалСервер.ТабличнаяЧастьДокументаВМассивСтруктур(СчетаДетальноДолги, "ЗаявкаНаБронирование", "СчетаДетальноДолги");   
КонецПроцедуры

&НаСервере
Функция ЗаявкаСсылка()
ЗаявкаСсылка = Документы.ЗаявкаНаБронирование.НайтиПоНомеру("000000006");
Возврат ЗаявкаСсылка; 	

СчетаДетальноДолги = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ЗаявкаСсылка, "СчетаДетальноДолги");

МассивЗаявок = ОбщийФункционалСервер.МассивСтруктурТабличнаяЧастьДокумента(СчетаДетальноДолги, "ЗаявкаНаБронирование", "СчетаДетальноДолги");   
Возврат МассивЗаявок; 	
КонецФункции


&НаКлиенте
Процедура ПочтаТест(Команда)
// Профиль = новый ИнтернетПочтовыйПрофиль;
// Профиль.АдресСервераSMTP = "10.1.2.3";
//// Профиль.АдресСервераSMTP = "srvex1.corp.invina.ru";

// Профиль.ПользовательSMTP = "rassupp";
// Профиль.ПарольSMTP = "dfrxpo*87695";

// ПочтовыйПрофиль = новый ИнтернетПочтовыйПрофиль;
// ПочтовыйПрофиль.АдресСервераSMTP = "10.1.2.3";
//// Профиль.АдресСервераSMTP = "srvex1.corp.invina.ru";

// ПочтовыйПрофиль.ПользовательSMTP = "rassupp";
// ПочтовыйПрофиль.ПарольSMTP = "dfrxpo*87695";
	
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	ПочтовыйПрофиль.АдресСервераSMTP   = "srvex1.corp.invina.ru"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
		смтпПользователь="postnikov_sn";//Константы.АдресЭлПочтыОтправителя.Получить();
		//смтпПользователь="postnikov_sn@invina.ru";//Константы.АдресЭлПочтыОтправителя.Получить();
	
	ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	ПочтовыйПрофиль.ПарольSMTP         = "<HFNyjcjhju*12"; 
	//ПочтовыйПрофиль.Пароль = "<HFNyjcjhju*12";
	//ПочтовыйПрофиль.ВремяОжидания      = 15;                 
	//ПочтовыйПрофиль.АутентификацияSMTP=СпособSMTPАутентификации.Login; 

	// - ПСН
	
	
	Почта = Новый ИнтернетПочта(); 
	
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		//ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки(),ЛогФайл, , Истина); 
		
		Сообщить("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " 
			+ Символы.ПС + ОписаниеОшибки() ,СтатусСообщения.ОченьВажное); 
		Возврат; 
	КонецПопытки; 

КонецПроцедуры


