
&НаКлиенте
Процедура ПриОткрытии(Отказ)
Элементы.ЦветТарифа.ЦветФона =Новый Цвет(Объект.ЦветR, Объект.ЦветG, Объект.ЦветB);
Элементы.ЦветТарифа.ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Элементы.ЦветТарифа.ЦветФона);
КонецПроцедуры

&НаКлиенте
Процедура ЦветТарифа(Команда)
ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
Оповещение = Новый ОписаниеОповещения("ОповещениеВыборЦветаЗавершение", ЭтотОбъект);
ДиалогВыбораЦвета.Показать(Оповещение);
	
//ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета; 
//Если ДиалогВыбораЦвета.Выбрать() тогда 
//	Элементы.ЦветТарифа.ЦветФона = ДиалогВыбораЦвета.Цвет; 
//	Объект.ЦветB=Элементы.ЦветТарифа.ЦветФона.Синий;
//	Объект.ЦветG=Элементы.ЦветТарифа.ЦветФона.Зеленый;
//	Объект.ЦветR=Элементы.ЦветТарифа.ЦветФона.Красный;
//КонецЕсли;
КонецПроцедуры

 &НаКлиенте
Процедура ОповещениеВыборЦветаЗавершение(Результат, ДополнительныеПараметры) Экспорт
Если НЕ Результат = Неопределено Тогда
	Элементы.ЦветТарифа.ЦветФона = Результат; 

	АбсолютныйЦвет =  ОбщийФункционалСервер.ПолучитьАбсолютныйЦвет(Элементы.ЦветТарифа.ЦветФона);
	Объект.ЦветB=АбсолютныйЦвет.Синий;
	Объект.ЦветG=АбсолютныйЦвет.Зеленый;
	Объект.ЦветR=АбсолютныйЦвет.Красный;
	
	Элементы.ЦветТарифа.ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(АбсолютныйЦвет);
КонецЕсли;
КонецПроцедуры

