
Процедура ЗаполнитьУслугиРодительСправочник(УслугиРодительСправочник) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК УслугаРодитель,
                      |	ДопУслуги.НомерПП КАК НомерПП,
                      |	ДопУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты,
                      |	0 КАК Номер
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.УслугаРодитель) Тогда		
		Если НЕ ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			Строка.ЗаголовокОтчеты = Строка.УслугаРодитель;
		КонецЕсли;
	КонецЕсли;
КонецЦикла;

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.УслугаРодитель = Справочники.ДопУслуги.ПустаяСсылка();
НоваяСтрока.ЗаголовокОтчеты = "Без папки";
НоваяСтрока.НомерПП = 9999999;

УслугиРодительСправочник.Очистить();

Номер = 1;
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиРодительСправочник.Добавить();

	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	НоваяСтрока.Номер = Номер;
	Номер = Номер + 1;
КонецЦикла;
КонецПроцедуры

Функция ПолучитьДокументыКСписанию(РезервС, РезервПо, ТолькоНовые, ДокументДолг) Экспорт

Запрос = Новый Запрос();
Запрос.Текст = "ВЫБРАТЬ
               |	ЗаявкаНаБронирование.Ссылка КАК ДокументДолг,
               |	ЕСТЬNULL(ДопУслугиИтоги.СуммаДопУслугиДолг, 0) КАК СуммаДолг,
               |	ЕСТЬNULL(ДопУслугиИтоги.СуммаДопУслугиДолг, 0) - ЕСТЬNULL(ДопУслугиИтоги.СуммаДопУслугиОплаты, 0) КАК ОстатокДолг,
               |	ЕСТЬNULL(ДопУслугиИтоги.СуммаДопУслугиОплаты, 0) КАК СуммаОплатыДолг,
               |	ЕСТЬNULL(СчетаДопУслугиИтоги.СуммаДолг, 0) КАК СуммаСчетДолг,
               |	ЕСТЬNULL(СчетаДопУслугиИтоги.СуммаОплачено, 0) КАК СуммаОплатыСчетДолг,
               |	ЕСТЬNULL(СчетаДопУслугиИтоги.СуммаДолг, 0) - ЕСТЬNULL(СчетаДопУслугиИтоги.СуммаОплачено, 0) КАК ОстатокСчетДолг,
               |	ЕСТЬNULL(ОплатыСписание.СуммаРаспределено, 0) КАК СуммаСписано
               |ИЗ
               |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество) КАК СуммаДопУслугиДолг,
               |			СУММА(ЕСТЬNULL(ДопУслугиОплаты.СуммаОплаты, 0)) КАК СуммаДопУслугиОплаты
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
               |					СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
               |				ИЗ
               |					Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
               |				
               |				СГРУППИРОВАТЬ ПО
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК ДопУслугиОплаты
               |				ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ДопУслугиОплаты.Ссылка
               |					И ЗаявкаНаБронированиеДопУслуги.ГУИД = ДопУслугиОплаты.ДолгиГУИД
               |		ГДЕ
               |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка) КАК ДопУслугиИтоги
               |		ПО ЗаявкаНаБронирование.Ссылка = ДопУслугиИтоги.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено) КАК СуммаОплачено,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК СчетаДопУслугиИтоги
               |		ПО ЗаявкаНаБронирование.Ссылка = СчетаДопУслугиИтоги.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноОплаты.СуммаРаспределено) КАК СуммаРаспределено
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты.ВидОперации = &ВидОперации
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка) КАК ОплатыСписание
               |		ПО ЗаявкаНаБронирование.Ссылка = ОплатыСписание.Ссылка
               |ГДЕ
               |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
               |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
               |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
               |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
               |	И ЗаявкаНаБронирование.РезервПо <= &РезервПо
               |	И (ЗаявкаНаБронирование.РезервС >= &РезервС
               |			ИЛИ ЗаявкаНаБронирование.РезервПо > &РезервС)
               |	И ВЫБОР
               |			КОГДА &Отбор = ЛОЖЬ
               |				ТОГДА ИСТИНА
               |			ИНАЧЕ ЗаявкаНаБронирование.Ссылка = &ДокументДолг
               |		КОНЕЦ
               |	И ЕСТЬNULL(ДопУслугиИтоги.СуммаДопУслугиДолг, 0) <> 0";
			   
			   //|
			   //|УПОРЯДОЧИТЬ ПО
			   //|	ЗаявкаНаБронирование.РезервС,
			   //|	ЗаявкаНаБронирование.Ссылка";

Если ТолькоНовые Тогда
	Запрос.Текст = Запрос.Текст + "
					  |	И ЕСТЬNULL(ДопУслугиИтоги.СуммаДопУслугиДолг, 0) - ЕСТЬNULL(ДопУслугиИтоги.СуммаДопУслугиОплаты, 0) <> 0";
Иначе
	Запрос.Текст = Запрос.Текст + "
					  |	И ЕСТЬNULL(ДопУслугиИтоги.СуммаДопУслугиДолг, 0) - ЕСТЬNULL(ДопУслугиИтоги.СуммаДопУслугиОплаты, 0) - ЕСТЬNULL(ОплатыСписание.СуммаРаспределено, 0) <> 0";
КонецЕсли;

Запрос.Текст = Запрос.Текст + "
			   |
               |УПОРЯДОЧИТЬ ПО
               |	ЗаявкаНаБронирование.РезервС,
               |	ЗаявкаНаБронирование.Ссылка";

Запрос.УстановитьПараметр("РезервС", РезервС);
Запрос.УстановитьПараметр("РезервПо", РезервПо);
Запрос.УстановитьПараметр("ВидОперации", Справочники.ВидыОпераций.СписаниеДопУслуг);

Если ЗначениеЗаполнено(ДокументДолг) Тогда 
	Отбор = Истина;
Иначе	
	Отбор = Ложь;
КонецЕсли;
Запрос.УстановитьПараметр("Отбор", Отбор);
Запрос.УстановитьПараметр("ДокументДолг", ДокументДолг);

ТЗ = Запрос.Выполнить().Выгрузить();
Возврат ТЗ;
	
КонецФункции

