

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НЕ НастройкиСервер.ТекущийПользовательКодРавноАдминистратор();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
УстановитьПользовательскиеНастройкиПорядок();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПользовательскиеНастройкиПорядок()

Если ЭтаФорма.ВладелецФормы.Имя = "ТипДокументаФМС" Тогда
	Имя_Номер_пп = "Номер_пп_ТипДокумента";
ИначеЕсли ЭтаФорма.ВладелецФормы.Имя = "ВидДокументаНаПребываниеФМС" Тогда
	Имя_Номер_пп = "Номер_пп_ВидДокументаУдостоверящегоЛичность";
ИначеЕсли ЭтаФорма.ВладелецФормы.Имя = "ПредставительТипДокументаФМС" Тогда
	ТекущийРодитель = ЭтаФорма.ВладелецФормы;	
	РодительФорма(ТекущийРодитель);
	Если ТекущийРодитель = Неопределено Тогда Возврат; КонецЕсли;
	
	Объект = ТекущийРодитель.Объект;
	Если ИностранныйГражданин(Объект) Тогда
		Имя_Номер_пп = "Номер_пп_ВидДокументаУдостоверящегоЛичность";
	Иначе
		Имя_Номер_пп = "Номер_пп_ТипДокумента";
	КонецЕсли;
Иначе
	Возврат;
КонецЕсли;
	
ЭлементыПользовательскихНастроек = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
Для Каждого НастройкаСписка Из ЭлементыПользовательскихНастроек Цикл
    Если ТипЗнч(НастройкаСписка) = ТипЗнч(Список.КомпоновщикНастроек.Настройки.Порядок) Тогда
        НастройкаСписка.Элементы.Очистить();
        УсловиеСортировкиДС = НастройкаСписка.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		
		УсловиеСортировкиДС.Поле = Новый ПолеКомпоновкиДанных(Имя_Номер_пп);
		
		УсловиеСортировкиДС.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
        УсловиеСортировкиДС.Использование = Истина;
    КонецЕсли;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РодительФорма(ТекущийРодитель)
Если ТипЗнч(ТекущийРодитель) = Тип("Неопределено") Тогда Возврат ; КонецЕсли;
	
Если ТипЗнч(ТекущийРодитель) = Тип("ФормаКлиентскогоПриложения") Тогда Возврат; КонецЕсли;

ТекущийРодитель = ТекущийРодитель.Родитель;
РодительФорма(ТекущийРодитель); 
КонецПроцедуры	

&НаСервере
Функция ИностранныйГражданин(Объект)
Возврат Объект.ИностранныйГражданин;
КонецФункции	

