
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ДниТекущаяДата(Неопределено);
ЧасыТекущаяДата(Неопределено);

//ОбновитьФорму(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьФорму(Команда)
ВывестиШахматкуДни(ДниДатаС, ДниДатаПо);
//ВывестиШахматкуЧасы(НачалоНедели(ТекущаяДата()),КонецНедели(ТекущаяДата()));
ВывестиШахматкуЧасы(НачалоДня(ЧасыДата) - 2 * 24 * 60 * 60, НачалоДня(ЧасыДата) +  2 * 24 * 60 *60);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДниТекущаяДата(Команда)
ДниДатаС = НачалоМесяца(ТекущаяДата());	                   

//КалендарныхДней = День(КонецМесяца(ДниДатаС));
//Дата_П = ДниДатаС + КалендарныхДней * 24 * 60 *60;
//КалендарныхДней = День(КонецМесяца(Дата_П));
//КалендарныхДней = КалендарныхДней - 1;
//Дата_П = Дата_П + КалендарныхДней * 24 * 60 *60;

//ДниДатаПо = Дата_П;

ДниДатаПо = ДниДатаПо(ДниДатаС);

ОбновитьФорму(Неопределено);
КонецПроцедуры

//
&НаКлиенте
Функция ДниДатаПо(Дата)

КалендарныхДней = День(КонецМесяца(Дата));
Дата_П = ДниДатаС + КалендарныхДней * 24 * 60 *60;
КалендарныхДней = День(КонецМесяца(Дата_П));
КалендарныхДней = КалендарныхДней - 1;
Дата_П = Дата_П + КалендарныхДней * 24 * 60 *60;

Возврат Дата_П;
КонецФункции


&НаКлиенте
Процедура ДниМесяцВперед(Команда)
КалендарныхДней = День(КонецМесяца(ДниДатаС));
ДниДатаС = ДниДатаС + КалендарныхДней * 24 * 60 *60;
ДниДатаПо = ДниДатаПо(ДниДатаС);

ОбновитьФорму(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДниМесяцНазад(Команда)
Дата_П = ДниДатаС - 24 * 60 *60;
ДниДатаС = НачалоМесяца(Дата_П);
ДниДатаПо = ДниДатаПо(ДниДатаС);	

ОбновитьФорму(Неопределено);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДниВстатьНаДату(Команда)
Дата = ТекущаяДата(); 
Обещание = ВвестиДатуАсинх(Дата, "Дата", ЧастиДаты.Дата);
Результат = Ждать Обещание;

Если НЕ ЗначениеЗаполнено(Результат) тогда Возврат; КонецЕсли;
	
ДниДатаС = НачалоМесяца(Результат);
ДниДатаПо = ДниДатаПо(ДниДатаС);	

ОбновитьФорму(Неопределено);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЧасыТекущаяДата(Команда)
ЧасыДата = НачалоДня(ТекущаяДата());

ОбновитьФорму(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЧасыДниВперед(Команда)
ЧасыДата = ЧасыДата + 3 * 24 * 60 *60;

ОбновитьФорму(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЧасыДниНазад(Команда)
ЧасыДата = ЧасыДата - 3 * 24 * 60 *60;

ОбновитьФорму(Неопределено);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЧасыВстатьНаДату(Команда)
Дата = ТекущаяДата(); 
Обещание = ВвестиДатуАсинх(Дата, "Дата", ЧастиДаты.Дата);
Результат = Ждать Обещание;

Если НЕ ЗначениеЗаполнено(Результат) тогда Возврат; КонецЕсли;
	
ЧасыДата = НачалоДня(Результат);

ОбновитьФорму(Неопределено);
КонецПроцедуры
//

////
&НаСервере
Функция ВывестиШахматкуДни(ДатаС, ДатаПо)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингНомера.ПочасоваяОплата = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоворкингНомера.Номер_пп");

Результат = Запрос.Выполнить();
Если Результат.Пустой() Тогда 
	Элементы.ПолеШахматкиДни.Видимость = Ложь;
	Элементы.КоманднаяПанельДни.Видимость = Ложь;
	
	Возврат Неопределено; 
КонецЕсли; 

ТЗШахматкаДни.Очистить();

//ДатаС=?(Детализация="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
ДатаС = НачалоДня(ДатаС);
ДатаПо = НачалоДня(ДатаПо);

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	ЗанятостьНомеровКоворкинг.Регистратор КАК Регистратор,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингНомер КАК КоворкингНомер,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.Клиент КАК Клиент,
                    |	ЗанятостьНомеровКоворкинг.ПериодРезерва КАК ПериодРезерва
                    |ИЗ
                    |	РегистрСведений.ЗанятостьНомеровКоворкинг КАК ЗанятостьНомеровКоворкинг
                    |ГДЕ
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ПочасоваяОплата = ЛОЖЬ
                    |	И ТИПЗНАЧЕНИЯ(ЗанятостьНомеровКоворкинг.Регистратор) = ТИП(Документ.КоворкингЗаявка)
                    |	И ЗанятостьНомеровКоворкинг.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо");

Запрос.УстановитьПараметр("ДатаС",ДатаС);						
Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
ТЗ_Заявки = Запрос.Выполнить().Выгрузить(); 

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	ЗанятостьНомеровКоворкинг.Регистратор КАК Регистратор,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингЗаявка.КоворкингНомер КАК КоворкингНомер,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингЗаявка.Клиент КАК Клиент,
                    |	ЗанятостьНомеровКоворкинг.ПериодРезерва КАК ПериодРезерва,
                    |	ЗанятостьНомеровКоворкинг.Регистратор КАК Счет,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ДатаС КАК РегистраторДатаС,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ДатаПо КАК РегистраторДатаПо,
                    |	ЕСТЬNULL(Оплаты.СуммаРаспределено, 0) КАК РегистраторСуммаРаспределено,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.Сумма + ЕСТЬNULL(УслугиКоворкинг.Сумма, 0) КАК РегистраторСумма
                    |ИЗ
                    |	РегистрСведений.ЗанятостьНомеровКоворкинг КАК ЗанятостьНомеровКоворкинг
                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                    |			КоворкингСчетаДокументыОплаты.Ссылка КАК СчетСсылка,
                    |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                    |		ИЗ
                    |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                    |		
                    |		СГРУППИРОВАТЬ ПО
                    |			КоворкингСчетаДокументыОплаты.Ссылка) КАК Оплаты
                    |		ПО ЗанятостьНомеровКоворкинг.Регистратор = Оплаты.СчетСсылка
                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                    |			КоворкингСчетаДопУслугиКоворкинг.Ссылка КАК Ссылка,
                    |			СУММА(КоворкингСчетаДопУслугиКоворкинг.Сумма) КАК Сумма
                    |		ИЗ
                    |			Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                    |		
                    |		СГРУППИРОВАТЬ ПО
                    |			КоворкингСчетаДопУслугиКоворкинг.Ссылка) КАК УслугиКоворкинг
                    |		ПО ЗанятостьНомеровКоворкинг.Регистратор = УслугиКоворкинг.Ссылка
                    |ГДЕ
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ПочасоваяОплата = ЛОЖЬ
                    |	И ТИПЗНАЧЕНИЯ(ЗанятостьНомеровКоворкинг.Регистратор) = ТИП(Документ.КоворкингСчета)
                    |	И ЗанятостьНомеровКоворкинг.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо");

Запрос.УстановитьПараметр("ДатаС",ДатаС);						
Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
ТЗ_Счета = Запрос.Выполнить().Выгрузить(); 

// 
ПолеШахматкиДни.Очистить();

//Макет = Обработки.КоворкингШахматка.ПолучитьМакет("МакетШахматкаДни");
ИмяОбработки = ОбщийФункционалКлиентСервер.ИмяОбработки(ЭтаФорма);
Макет = Обработки[ИмяОбработки].ПолучитьМакет("МакетШахматкаДни");

ТабДок=Новый ТабличныйДокумент;
Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
ТабДок.Присоединить(Обл);

////// - Вывод Верхних строк с датами
ТЗОбъеденения=Новый ТаблицаЗначений();
ТЗОбъеденения.Колонки.Добавить("КолонкаС");
ТЗОбъеденения.Колонки.Добавить("КолонкаПо");
ТЗОбъеденения.Колонки.Добавить("ДТ");

Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");

//// + Вывод Верхних строк с датами
Нов=ТЗОбъеденения.Добавить();
Нов.КолонкаС=2;
Нов.КолонкаПо=2;

ТемпС = ДатаС;
ТемпПо = ДатаПо;

ТемпДень=НачалоМесяца(ТемпС);
Нов.ДТ=Формат(ТемпДень, "ДФ=MM");

ТекКол=2;
Пока ТемпС <= ТемпПо цикл
	Если НачалоМесяца(ТемпС) > ТемпДень тогда
		// новый месяц
		Нов.КолонкаПо=ТекКол-1;
		Нов=ТЗОбъеденения.Добавить();
		Нов.КолонкаС=ТекКол;
		Нов.КолонкаПо=ТекКол+1;
		
		ТемпДень=НачалоМесяца(ТемпС);
		Нов.ДТ=Формат(ТемпДень, "ДФ=MM");	
	конецесли;
	
	Обл.Параметры.Период=Формат(ТемпС, "ДФ='dd'");
	
	ТабДок.Присоединить(Обл);             
	
	ТемпС = ТемпС + 86400;
	
	ТекКол=ТекКол+1;
КонецЦикла;

Нов.КолонкаПо=ТекКол-1;
Для каждого Об Из ТЗОбъеденения Цикл
	ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаС+1).Текст=Об.ДТ;
	
	ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаПо+1).Объединить();
КонецЦикла; 

ПолеШахматкиДни.Вывести(ТабДок);
////- Вывод Верхних строк с датами

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК Ссылка,
                      |	КоворкингНомера.Наименование КАК Наименование,
                      |	КоворкингНомера.ОписаниеНомера КАК ОписаниеНомера,
                      |	КоворкингНомера.ЦветНомераB КАК ЦветНомераB,
                      |	КоворкингНомера.ЦветНомераG КАК ЦветНомераG,
                      |	КоворкингНомера.ЦветНомераR КАК ЦветНомераR
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингНомера.ПочасоваяОплата = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоворкингНомера.Номер_пп");
СпрНомеров = Запрос.Выполнить().Выбрать();

Х=0;
У=0;

Пока СпрНомеров.Следующий() цикл
	//Если СпрНомеров.ПометкаУдаления Тогда Продолжить; КонецЕсли;
				
	//Если СпрНомеров.Наименование <> "Офис 7/ 5" Тогда ТемпС=ТемпС + 86400; продолжить; КонецЕсли; 
	
	У=У+1;
	
	ТабДок=Новый ТабличныйДокумент;
	
	ТемпС=ДатаС;
	ТемпПо=ДатаПо;
	
	Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
	
	// + Вывод Номера 
	Обл.Параметры.Номер=СпрНомеров.Наименование;
	Если Не СпрНомеров.ЦветНомераB+СпрНомеров.ЦветНомераG+СпрНомеров.ЦветНомераR=0 тогда
		Обл.Область(1,2,1,2).ЦветФона=Новый Цвет(СпрНомеров.ЦветНомераR,СпрНомеров.ЦветНомераG,СпрНомеров.ЦветНомераB);
		Обл.Область(1,2,1,2).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,2,1,2).ЦветФона);
	конецесли;
	
    Обл.Область(1,1,1,1).Расшифровка=СпрНомеров.ОписаниеНомера;
	ТабДок.Присоединить(Обл);
	// - Вывод Номера 
	
	ТемпКл=Справочники.Клиенты.ПустаяСсылка();
	
	ТемпРегистратор =Документы.КоворкингЗаявка.ПустаяСсылка();
	//ТемпСчет = Документы.КоворкингСчета.ПустаяСсылка();
	
	СписОб=Новый СписокЗначений;                            
	Сч=2;
	НачИ=3;	
	Х=0;
	
	Пока ТемпС <= ТемпПо цикл
		Обл = Макет.ПолучитьОбласть("Строка|СтрПериод");
		
		Х=Х+1;	
		
		ПС = НачалоДня(ТемпС);
		ПК = КонецДня(ТемпС);
		
		Отбор=Новый Структура("ПериодРезерва, КоворкингНомер", ПС, СпрНомеров.Ссылка);
		СтрокиСчета = ТЗ_Счета.НайтиСтроки(Отбор);
		
		Отбор=Новый Структура("ПериодРезерва, КоворкингНомер", ПС, СпрНомеров.Ссылка);
		СтрокиЗаявки = ТЗ_Заявки.НайтиСтроки(Отбор);
		
		Если СтрокиСчета.Количество() <> 0 
		ИЛИ СтрокиЗаявки.Количество() <> 0 
		Тогда 

			Если СтрокиСчета.Количество() <> 0 Тогда 
				СтрокаСчета = СтрокиСчета[0];
				ТекКл = СтрокиСчета[0].Клиент;
				ТекРегистратор = СтрокиСчета[0].Регистратор;
				//ТекСчет = СтрокиСчета[0].Счет;
						
			ИначеЕсли СтрокиЗаявки.Количество() <> 0 Тогда 
				ТекКл = СтрокиЗаявки[0].Клиент;
				ТекРегистратор = СтрокиЗаявки[0].Регистратор;
				//ТекСчет = Документы.КоворкингСчета.ПустаяСсылка();
				
			КонецЕсли;
		
			Обл.Параметры.Период=ТекКл.Наименование;
			Если ТипЗнч(ТекРегистратор) = Тип("ДокументСсылка.КоворкингЗаявка") Тогда
				Цвет_П = Новый Цвет(210, 245, 220); 
				ШрифтПолужирный_П = Ложь;
			ИначеЕсли СтрокаСчета.РегистраторСуммаРаспределено = 0 Тогда
				Цвет_П = Новый Цвет(220, 220, 220); 
				ШрифтПолужирный_П = Ложь;
			ИначеЕсли СтрокаСчета.РегистраторСумма > СтрокаСчета.РегистраторСуммаРаспределено Тогда
				Цвет_П = Новый Цвет(200, 240, 240); 
				ШрифтПолужирный_П = Истина;
			Иначе
				Цвет_П =  Новый Цвет(255, 255, 255); 
				ШрифтПолужирный_П = Истина;
			КонецЕсли;
			
			Обл.Область(1,1,1,1).ЦветФона=Цвет_П;
			Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
			
			ШрифтТекста = Новый Шрифт(Обл.Область(1,1,1,1).Шрифт,,,ШрифтПолужирный_П);
			Обл.Область(1,1,1,1).Шрифт = ШрифтТекста;

			НовШ=ТЗШахматкаДни.Добавить();
			НовШ.Х=Х;
			НовШ.У=У;
			НовШ.Клиент=ТекКл;
			НовШ.Номер=СпрНомеров.Ссылка;
			
			НовШ.Регистратор = ТекРегистратор;
			//НовШ.Счет = ТекСчет;
				
			НовШ.Период = НачалоДня(ТемпС);
		Иначе
			ТекКл=Справочники.Клиенты.ПустаяСсылка();			
		КонецЕсли;	
		
		Если ТекКл<>ТемпКл 
		ИЛИ ТекРегистратор <> ТемпРегистратор 
		//ИЛИ ТекСчет <> ТемпСчет 
		тогда
			
			НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
			СписОб.Добавить(НовОб);
			
			ТемпКл=ТекКл;
			ТемпРегистратор = ТекРегистратор;
			//ТемпСчет = ТекСчет;
			//ТемпСтатус = ТекСтатус;
			
			НачИ=Сч+1;
		конецесли;
		
		ТабДок.Присоединить(Обл);
		ТемпС=ТемпС + 86400;
		
		сч=сч+1;
	КонецЦикла;
	
	НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
	СписОб.Добавить(НовОб);
	
	Первый=Истина;
	Для каждого Об Из СписОб Цикл
		Если Первый Тогда Первый=Ложь; Продолжить; КонецЕсли;
		
		Если Об.Значение.ТекКл=Справочники.Клиенты.ПустаяСсылка() тогда Продолжить;	конецесли;
		
		ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
	КонецЦикла; 
	
	ПолеШахматкиДни.Вывести(ТабДок);
КонецЦикла;

КоличествоКолонокДней = (НачалоДня(ДатаПо) - НачалоДня(ДатаС)) / (60 * 60 * 24);
ШиринаТаблицы = 150;
ШиринаКолонки = ШиринаТаблицы / КоличествоКолонокДней;

Если ШиринаКолонки < 2.5 Тогда
	 ШиринаКолонки = 2.5;
КонецЕсли;

ПолеШахматкиДни.Область(,3,,КоличествоКолонокДней + 3).ШиринаКолонки = ШиринаКолонки;	

ПолеШахматкиДни.Область(,3,,КоличествоКолонокДней + 3).РастягиватьПоГоризонтали = Истина;

ПолеШахматкиДни.ФиксацияСлева=2;
ПолеШахматкиДни.ФиксацияСверху=2;

ПолеШахматкиДни.Область(1, ,1).Видимость = Ложь;
//ПолеШахматкиДни.УстановитьРастягиваниеПоГоризонтали(Истина);
КонецФункции

&НаСервере
Функция ВывестиШахматкуДни_1(ДатаС, ДатаПо)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингНомера.ПочасоваяОплата = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоворкингНомера.Номер_пп");

Результат = Запрос.Выполнить();
Если Результат.Пустой() Тогда 
	Элементы.ПолеШахматкиДни.Видимость = Ложь;
	Элементы.КоманднаяПанельДни.Видимость = Ложь;
	
	Возврат Неопределено; 
КонецЕсли; 

ТЗШахматкаДни.Очистить();

//ДатаС=?(Детализация="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
ДатаС = НачалоДня(ДатаС);
ДатаПо = НачалоДня(ДатаПо);

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	ЗанятостьНомеровКоворкинг.Регистратор КАК Регистратор,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингНомер КАК КоворкингНомер,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.Клиент КАК Клиент,
                    |	ЗанятостьНомеровКоворкинг.ПериодРезерва КАК ПериодРезерва,
                    |	СчетаОплаты.Счет КАК Счет,
                    |	СчетаОплаты.СчетДатаС КАК СчетДатаС,
                    |	СчетаОплаты.СчетДатаПо КАК СчетДатаПо,
                    |	СчетаОплаты.СуммаСчета КАК СуммаСчета,
                    |	СчетаОплаты.СуммаРаспределено КАК СуммаРаспределено
                    |ИЗ
                    |	РегистрСведений.ЗанятостьНомеровКоворкинг КАК ЗанятостьНомеровКоворкинг
                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                    |			КоворкингСчета.КоворкингЗаявка КАК СчетКоворкингЗаявка,
                    |			КоворкингСчета.Ссылка КАК Счет,
                    |			КоворкингСчета.ДатаПо КАК СчетДатаПо,
                    |			КоворкингСчета.ДатаС КАК СчетДатаС,
                    |			КоворкингСчета.Сумма КАК СуммаСчета,
                    |			Оплаты.СуммаРаспределено КАК СуммаРаспределено
                    |		ИЗ
                    |			Документ.КоворкингСчета КАК КоворкингСчета
                    |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                    |					КоворкингСчетаДокументыОплаты.Ссылка КАК СчетСсылка,
                    |					СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                    |				ИЗ
                    |					Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                    |				
                    |				СГРУППИРОВАТЬ ПО
                    |					КоворкингСчетаДокументыОплаты.Ссылка) КАК Оплаты
                    |				ПО КоворкингСчета.Ссылка = Оплаты.СчетСсылка) КАК СчетаОплаты
                    |		ПО ЗанятостьНомеровКоворкинг.Регистратор = СчетаОплаты.СчетКоворкингЗаявка
                    |ГДЕ
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ПочасоваяОплата = ЛОЖЬ
                    |	И ТИПЗНАЧЕНИЯ(ЗанятостьНомеровКоворкинг.Регистратор) = ТИП(Документ.КоворкингЗаявка)
                    |	И ЗанятостьНомеровКоворкинг.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
                    |
                    |ОБЪЕДИНИТЬ
                    |
                    |ВЫБРАТЬ
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингЗаявка,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингЗаявка.КоворкингНомер,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингЗаявка.Клиент,
                    |	ЗанятостьНомеровКоворкинг.ПериодРезерва,
                    |	ЗанятостьНомеровКоворкинг.Регистратор,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ДатаС,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ДатаПо,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.Сумма,
                    |	Оплаты.СуммаРаспределено
                    |ИЗ
                    |	РегистрСведений.ЗанятостьНомеровКоворкинг КАК ЗанятостьНомеровКоворкинг
                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                    |			КоворкингСчетаДокументыОплаты.Ссылка КАК СчетСсылка,
                    |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                    |		ИЗ
                    |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                    |		
                    |		СГРУППИРОВАТЬ ПО
                    |			КоворкингСчетаДокументыОплаты.Ссылка) КАК Оплаты
                    |		ПО ЗанятостьНомеровКоворкинг.Регистратор = Оплаты.СчетСсылка
                    |ГДЕ
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ПочасоваяОплата = ЛОЖЬ
                    |	И ТИПЗНАЧЕНИЯ(ЗанятостьНомеровКоворкинг.Регистратор) = ТИП(Документ.КоворкингСчета)
                    |	И ЗанятостьНомеровКоворкинг.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо");

Запрос.УстановитьПараметр("ДатаС",ДатаС);						
Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
ТЗЗапроса = Запрос.Выполнить().Выгрузить(); 

ТЗЗапроса.Колонки.Добавить("Статус");
Для Каждого Строка Из ТЗЗапроса Цикл
	Если Строка.Счет = Null Тогда
		Строка.Статус = "НЕТ СЧЕТОВ";
		Строка.Счет = Неопределено;
	Иначе
		
		//Если Строка.СчетДатаС > Строка.ПериодРезерва 
		//ИЛИ Строка.СчетДатаПо < Строка.ПериодРезерва   
		//Тогда
		//	Строка.Статус = "НЕТ СЧЕТОВ";
		//	Строка.Счет = Неопределено;

		//Иначе
			Если Строка.СуммаРаспределено = Null Тогда
				Строка.Статус = "НЕТ ОПЛАТ";
			ИначеЕсли Строка.СуммаРаспределено = 0 Тогда
				Строка.Статус = "НЕТ ОПЛАТ";
			ИначеЕсли Строка.СуммаРаспределено < Строка.СуммаСчета Тогда
				Строка.Статус = "ЧАСТИЧНО ОПЛАЧЕНО";
			Иначе
				Строка.Статус = "ОПЛАЧЕНО";
		    КонецЕсли;
		//КонецЕсли;
    КонецЕсли;
КонецЦикла;

ТЗКлиентов = ТЗЗапроса.Скопировать();
ТЗКлиентов.Свернуть("Клиент, Регистратор, Счет, Статус") ;
ТЗКлиентов.Колонки.Добавить("Цвет");

Сч=0;
Для каждого Клиент Из ТЗКлиентов Цикл	
	Если Клиент.Статус = "ОПЛАЧЕНО" тогда
		Клиент.Цвет=Новый Цвет(255,255,255);
	иначеесли Клиент.Статус = "ЧАСТИЧНО ОПЛАЧЕНО" тогда
		//Клиент.Цвет=Новый Цвет(231, 227, 217);
		Клиент.Цвет=Новый Цвет(230, 230, 230);
	иначеесли Клиент.Статус = "НЕТ ОПЛАТ" тогда
		//Клиент.Цвет=Новый Цвет(233, 150, 122);   // Лосось темный
		Клиент.Цвет=Новый Цвет(255, 230, 230);   
	иначе
		Если Клиент.Клиент.ЦветR<>0 Или  Клиент.Клиент.ЦветG<>0 или  Клиент.Клиент.ЦветB<>0 тогда	
			Клиент.Цвет=Новый Цвет(Клиент.Клиент.ЦветR,Клиент.Клиент.ЦветG,Клиент.Клиент.ЦветB);
		иначе
			Клиент.Цвет = СлучайныйЦвет(ТЗКлиентов);
		КонецЕсли;
	конецесли;
КонецЦикла; 

ПолеШахматкиДни.Очистить();

//Макет = Обработки.КоворкингШахматка.ПолучитьМакет("МакетШахматкаДни");
ИмяОбработки = ОбщийФункционалКлиентСервер.ИмяОбработки(ЭтаФорма);
Макет = Обработки[ИмяОбработки].ПолучитьМакет("МакетШахматкаДни");

ТабДок=Новый ТабличныйДокумент;
Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
ТабДок.Присоединить(Обл);

////// - Вывод Верхних строк с датами
ТЗОбъеденения=Новый ТаблицаЗначений();
ТЗОбъеденения.Колонки.Добавить("КолонкаС");
ТЗОбъеденения.Колонки.Добавить("КолонкаПо");
ТЗОбъеденения.Колонки.Добавить("ДТ");

Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");

//// + Вывод Верхних строк с датами
Нов=ТЗОбъеденения.Добавить();
Нов.КолонкаС=2;
Нов.КолонкаПо=2;

ТемпС = ДатаС;
ТемпПо = ДатаПо;

ТемпДень=НачалоМесяца(ТемпС);
Нов.ДТ=Формат(ТемпДень, "ДФ=MM");

ТекКол=2;
Пока ТемпС <= ТемпПо цикл
	Если НачалоМесяца(ТемпС) > ТемпДень тогда
		// новый месяц
		Нов.КолонкаПо=ТекКол-1;
		Нов=ТЗОбъеденения.Добавить();
		Нов.КолонкаС=ТекКол;
		Нов.КолонкаПо=ТекКол+1;
		
		ТемпДень=НачалоМесяца(ТемпС);
		Нов.ДТ=Формат(ТемпДень, "ДФ=MM");	
	конецесли;
	
	Обл.Параметры.Период=Формат(ТемпС, "ДФ='dd'");
	
	ТабДок.Присоединить(Обл);             
	
	ТемпС = ТемпС + 86400;
	
	ТекКол=ТекКол+1;
КонецЦикла;

Нов.КолонкаПо=ТекКол-1;
Для каждого Об Из ТЗОбъеденения Цикл
	ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаС+1).Текст=Об.ДТ;
	
	ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаПо+1).Объединить();
КонецЦикла; 

ПолеШахматкиДни.Вывести(ТабДок);
////- Вывод Верхних строк с датами

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК Ссылка,
                      |	КоворкингНомера.Наименование КАК Наименование,
                      |	КоворкингНомера.ОписаниеНомера КАК ОписаниеНомера,
                      |	КоворкингНомера.ЦветНомераB КАК ЦветНомераB,
                      |	КоворкингНомера.ЦветНомераG КАК ЦветНомераG,
                      |	КоворкингНомера.ЦветНомераR КАК ЦветНомераR
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингНомера.ПочасоваяОплата = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоворкингНомера.Номер_пп");
СпрНомеров = Запрос.Выполнить().Выбрать();

Х=0;
У=0;

Пока СпрНомеров.Следующий() цикл
	//Если СпрНомеров.ПометкаУдаления Тогда Продолжить; КонецЕсли;
				
	//Если СпрНомеров.Наименование <> "Офис 7/ 5" Тогда ТемпС=ТемпС + 86400; продолжить; КонецЕсли; 
	
	У=У+1;
	
	ТабДок=Новый ТабличныйДокумент;
	
	ТемпС=ДатаС;
	ТемпПо=ДатаПо;
	
	Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
	
	// + Вывод Номера 
	Обл.Параметры.Номер=СпрНомеров.Наименование;
	Если Не СпрНомеров.ЦветНомераB+СпрНомеров.ЦветНомераG+СпрНомеров.ЦветНомераR=0 тогда
		Обл.Область(1,2,1,2).ЦветФона=Новый Цвет(СпрНомеров.ЦветНомераR,СпрНомеров.ЦветНомераG,СпрНомеров.ЦветНомераB);
		Обл.Область(1,2,1,2).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,2,1,2).ЦветФона);
	конецесли;
	
    Обл.Область(1,1,1,1).Расшифровка=СпрНомеров.ОписаниеНомера;
	ТабДок.Присоединить(Обл);
	// - Вывод Номера 
	
	ТемпКл=Справочники.Клиенты.ПустаяСсылка();
	
	ТемпРегистратор=Документы.КоворкингЗаявка.ПустаяСсылка();
	ТемпСчет=Документы.КоворкингСчета.ПустаяСсылка();
	
	//ТемпСтатус = "";
	
	СписОб=Новый СписокЗначений;                            
	Сч=2;
	НачИ=3;	
	Х=0;
	
	Пока ТемпС <= ТемпПо цикл
		Обл=Макет.ПолучитьОбласть("Строка|СтрПериод");
		
		Х=Х+1;	
		
		ПС = НачалоДня(ТемпС);
		ПК = КонецДня(ТемпС);
		
		Отбор=Новый Структура("ПериодРезерва, КоворкингНомер", ПС, СпрНомеров.Ссылка);
		СтрокиНом=ТЗЗапроса.НайтиСтроки(Отбор);

		Если СтрокиНом.Количество() <> 0 тогда
			ТекКл = СтрокиНом[0].Клиент;
			ТекРегистратор = СтрокиНом[0].Регистратор;
			ТекСчет = СтрокиНом[0].Счет;
			
			//ТекСтатус = СтрокиНом[0].Статус;
			
			ОтборСтроки = Новый Структура("Клиент, Регистратор, Счет ", ТекКл, ТекРегистратор, ТекСчет); 
			НайденныеСтроки = ТЗКлиентов.НайтиСтроки(ОтборСтроки);
			Клиент_П = НайденныеСтроки[0];
			Цвет_П = Клиент_П.Цвет;
		
			Обл.Область(1,1,1,1).ЦветФона=Цвет_П;
			Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
			
			ШрифтПолужирный_П = (Клиент_П.Статус <> "НЕТ СЧЕТОВ");  
			ШрифтТекста = Новый Шрифт(Обл.Область(1,1,1,1).Шрифт,,,ШрифтПолужирный_П);
			Обл.Область(1,1,1,1).Шрифт = ШрифтТекста;
			
			Обл.Параметры.Период=ТекКл.Наименование;
			
			НовШ=ТЗШахматкаДни.Добавить();
			НовШ.Х=Х;
			НовШ.У=У;
			НовШ.Клиент=ТекКл;
			НовШ.Номер=СпрНомеров.Ссылка;
			
			НовШ.Регистратор = ТекРегистратор;
			НовШ.Счет = ТекСчет;
			
			//ДокументМассив = Новый СписокЗначений; 
			//Для Каждого СтрокаДанные Из СтрокиНом Цикл
			//	ДокументМассив.Добавить(СтрокаДанные.Регистратор); 
			//КонецЦикла;
			//НовШ.Документ=ДокументМассив;
			
			//НовШ.Период=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			НовШ.Период = НачалоДня(ТемпС);
		иначе
			ТекКл=Справочники.Клиенты.ПустаяСсылка();			
		конецесли;
		
		Если ТекКл<>ТемпКл 
		ИЛИ ТекРегистратор <> ТемпРегистратор 
		ИЛИ ТекСчет <> ТемпСчет 
		тогда
			
			НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
			СписОб.Добавить(НовОб);
			
			ТемпКл=ТекКл;
			ТемпРегистратор = ТекРегистратор;
			ТемпСчет = ТекСчет;
			//ТемпСтатус = ТекСтатус;
			
			НачИ=Сч+1;
		конецесли;
		
		ТабДок.Присоединить(Обл);
		ТемпС=ТемпС + 86400;
		
		сч=сч+1;
	КонецЦикла;
	
	НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
	СписОб.Добавить(НовОб);
	
	Первый=Истина;
	Для каждого Об Из СписОб Цикл
		Если Первый Тогда Первый=Ложь; Продолжить; КонецЕсли;
		
		Если Об.Значение.ТекКл=Справочники.Клиенты.ПустаяСсылка() тогда Продолжить;	конецесли;
		
		ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
	КонецЦикла; 
	
	ПолеШахматкиДни.Вывести(ТабДок);
КонецЦикла;

КоличествоКолонокДней = (НачалоДня(ДатаПо) - НачалоДня(ДатаС)) / (60 * 60 * 24);
ШиринаТаблицы = 150;
ШиринаКолонки = ШиринаТаблицы / КоличествоКолонокДней;

Если ШиринаКолонки < 2.5 Тогда
	 ШиринаКолонки = 2.5;
КонецЕсли;

ПолеШахматкиДни.Область(,3,,КоличествоКолонокДней + 3).ШиринаКолонки = ШиринаКолонки;	

ПолеШахматкиДни.Область(,3,,КоличествоКолонокДней + 3).РастягиватьПоГоризонтали = Истина;

ПолеШахматкиДни.ФиксацияСлева=2;
ПолеШахматкиДни.ФиксацияСверху=2;

//ПолеШахматкиДни.УстановитьРастягиваниеПоГоризонтали(Истина);
КонецФункции


&НаСервере
Функция ВывестиШахматкуЧасы(ДатаС, ДатаПо)

ТЗШахматкаЧасы.Очистить();

//ДатаС=?(Детализация="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
ДатаС = НачалоЧаса(ДатаС);
ДатаПо = НачалоЧаса(ДатаПо);

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	ЗанятостьНомеровКоворкинг.Регистратор КАК Регистратор,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингЗаявка.КоворкингНомер КАК КоворкингНомер,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.КоворкингЗаявка.Клиент КАК Клиент,
                    |	ЗанятостьНомеровКоворкинг.ПериодРезерва КАК ПериодРезерва,
                    |	ЗанятостьНомеровКоворкинг.Регистратор.Сумма КАК СуммаСчета,
                    |	Оплаты.СуммаРаспределено КАК СуммаРаспределено
                    |ИЗ
                    |	РегистрСведений.ЗанятостьНомеровКоворкинг КАК ЗанятостьНомеровКоворкинг
                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                    |			КоворкингСчетаДокументыОплаты.Ссылка КАК СчетСсылка,
                    |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                    |		ИЗ
                    |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                    |		
                    |		СГРУППИРОВАТЬ ПО
                    |			КоворкингСчетаДокументыОплаты.Ссылка) КАК Оплаты
                    |		ПО ЗанятостьНомеровКоворкинг.Регистратор.Ссылка = Оплаты.СчетСсылка
                    |ГДЕ
                    |	ЗанятостьНомеровКоворкинг.Регистратор.ПочасоваяОплата = ИСТИНА
                    |	И ТИПЗНАЧЕНИЯ(ЗанятостьНомеровКоворкинг.Регистратор) = ТИП(Документ.КоворкингСчета)
                    |	И ЗанятостьНомеровКоворкинг.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо");

Запрос.УстановитьПараметр("ДатаС",ДатаС);						
Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
ТЗЗапроса = Запрос.Выполнить().Выгрузить(); 

ТЗЗапроса.Колонки.Добавить("Статус");
Для Каждого Строка Из ТЗЗапроса Цикл
	//Если Строка.СуммаСчета = Null Тогда
	//	Строка.Статус = "НЕТ СЧЕТОВ";
	//Иначе
		Если Строка.СуммаРаспределено = Null Тогда
			Строка.Статус = "НЕТ ОПЛАТ";
		ИначеЕсли Строка.СуммаРаспределено = 0 Тогда
			Строка.Статус = "НЕТ ОПЛАТ";
		ИначеЕсли Строка.СуммаРаспределено < Строка.СуммаСчета Тогда
			Строка.Статус = "ЧАСТИЧНО ОПЛАЧЕНО";
		Иначе
			Строка.Статус = "ОПЛАЧЕНО";
	    КонецЕсли;
	//КонецЕсли;
КонецЦикла;

ТЗКлиентов = ТЗЗапроса.Скопировать();
ТЗКлиентов.Свернуть("Клиент, Регистратор, Статус") ;
ТЗКлиентов.Колонки.Добавить("Цвет");

Сч=0;

//Если ТипЗнч(ТекРегистратор) = Тип("ДокументСсылка.КоворкингЗаявка") Тогда
//	Цвет_П = Новый Цвет(210, 245, 220); 
//	ШрифтПолужирный_П = Ложь;
//ИначеЕсли СтрокаСчета.РегистраторСуммаРаспределено = 0 Тогда
//	Цвет_П = Новый Цвет(220, 220, 220); 
//	ШрифтПолужирный_П = Истина;
//ИначеЕсли СтрокаСчета.РегистраторСумма > СтрокаСчета.РегистраторСуммаРаспределено Тогда
//	Цвет_П = Новый Цвет(200, 240, 240); 
//	ШрифтПолужирный_П = Истина;
//Иначе
//	Цвет_П = WebЦвета.Белый;  				
//	ШрифтПолужирный_П = Истина;
//КонецЕсли;

Для каждого Клиент Из ТЗКлиентов Цикл	
	Если Клиент.Статус = "ОПЛАЧЕНО" тогда
		Клиент.Цвет=Новый Цвет(255,255,255);
	иначеесли Клиент.Статус = "ЧАСТИЧНО ОПЛАЧЕНО" тогда
		Клиент.Цвет=Новый Цвет(200, 240, 240);
	иначеесли Клиент.Статус = "НЕТ ОПЛАТ" тогда
		Клиент.Цвет=Новый Цвет(220, 220, 220);   
	иначе
		Если Клиент.Клиент.ЦветR<>0 Или  Клиент.Клиент.ЦветG<>0 или  Клиент.Клиент.ЦветB<>0 тогда	
			Клиент.Цвет=Новый Цвет(Клиент.Клиент.ЦветR,Клиент.Клиент.ЦветG,Клиент.Клиент.ЦветB);
		иначе
			Клиент.Цвет = СлучайныйЦвет(ТЗКлиентов);
		КонецЕсли;
	конецесли;
КонецЦикла; 

ПолеШахматкиЧасы.Очистить();

ИмяОбработки = ОбщийФункционалКлиентСервер.ИмяОбработки(ЭтаФорма);
//Макет = Обработки.КоворкингШахматка.ПолучитьМакет("МакетШахматкаДни");
Макет = Обработки[ИмяОбработки].ПолучитьМакет("МакетШахматкаДни");

НачальныйЧас = Константы.КоворкингНачальныйЧас.Получить();
Если НачальныйЧас = 0 Тогда НачальныйЧас = 8; КонецЕсли;

КонечныйЧас = Константы.КоворкингКонечныйЧас.Получить() - 1;
Если КонечныйЧас = 0 Тогда КонечныйЧас = 21; КонецЕсли;
КонечныйЧас = КонечныйЧас - 1;

ТемпС = ДатаС;
ТемпПо = ДатаПо;

ТабДок=Новый ТабличныйДокумент;
Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
ТабДок.Присоединить(Обл);

ТЗОбъеденения=Новый ТаблицаЗначений();
ТЗОбъеденения.Колонки.Добавить("КолонкаС");
ТЗОбъеденения.Колонки.Добавить("КолонкаПо");
ТЗОбъеденения.Колонки.Добавить("ДТ");

Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");

Нов=ТЗОбъеденения.Добавить();
Нов.КолонкаС=2;
Нов.КолонкаПо=2;

ТемпДень=НачалоДня(ТемпС);
Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");

ТекКол=2;

Пока ТемпС<=ТемпПо цикл
	Час = Час(ТемпС);
	Если Час >= НачальныйЧас И Час <= КонечныйЧас Тогда 
		Если НачалоДня(ТемпС)>ТемпДень тогда
			// новый день
			Нов.КолонкаПо=ТекКол-1;
			Нов=ТЗОбъеденения.Добавить();
			Нов.КолонкаС=ТекКол;
			Нов.КолонкаПо=ТекКол+1;
			ТемпДень=НачалоДня(ТемпС);
			Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");	
		конецесли;
	
		//Обл.Параметры.Период = Формат(ТемпС, "ДФ='HH:mm'");
		Обл.Параметры.Период = Формат(ТемпС, "ДФ='HH'");
		ТабДок.Присоединить(Обл);
	
		ТекКол=ТекКол+1;
	КонецЕсли; 	
	
	//ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
	ТемпС = ТемпС + 3600;
КонецЦикла;

Нов.КолонкаПо=ТекКол-1;
Для каждого Об Из ТЗОбъеденения Цикл
	ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаС+1).Текст=Об.ДТ;
	
	ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаПо+1).Объединить();
КонецЦикла; 

ПолеШахматкиЧасы.Вывести(ТабДок);
////// + Вывод Верхних строк с датами

//Возврат Неопределено;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК Ссылка,
                      |	КоворкингНомера.Наименование КАК Наименование,
                      |	КоворкингНомера.ОписаниеНомера КАК ОписаниеНомера,
                      |	КоворкингНомера.ЦветНомераB КАК ЦветНомераB,
                      |	КоворкингНомера.ЦветНомераG КАК ЦветНомераG,
                      |	КоворкингНомера.ЦветНомераR КАК ЦветНомераR
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингНомера.ПочасоваяОплата = ИСТИНА");
СпрНомеров = Запрос.Выполнить().Выбрать();

Х=0;
У=0;

Пока СпрНомеров.Следующий() цикл
	//Если СпрНомеров.ПометкаУдаления Тогда Продолжить; КонецЕсли;
	
	У=У+1;
	
	ТабДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
	Обл.Параметры.Номер=СпрНомеров.Наименование;
	Если Не СпрНомеров.ЦветНомераB+СпрНомеров.ЦветНомераG+СпрНомеров.ЦветНомераR=0 тогда
		Обл.Область(1,2,1,2).ЦветФона=Новый Цвет(СпрНомеров.ЦветНомераR,СпрНомеров.ЦветНомераG,СпрНомеров.ЦветНомераB);
		Обл.Область(1,2,1,2).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,2,1,2).ЦветФона);
	конецесли;
	
    Обл.Область(1,1,1,1).Расшифровка=СпрНомеров.ОписаниеНомера;
	ТабДок.Присоединить(Обл);
	
	ТемпКл=Справочники.Клиенты.ПустаяСсылка();
	
	ТемпРегистратор=Документы.КоворкингСчета.ПустаяСсылка();
	
	СписОб=Новый СписокЗначений;                            
	Сч=2;
	НачИ=3;	
	Х=0;
	
	ТемпС=ДатаС;
	ТемпПо=ДатаПо;
	
	Пока ТемпС<=ТемпПо цикл
		//Х=Х+1;	
		
		ПС = НачалоЧаса(ТемпС);
		ПК = КонецЧаса(ТемпС);
		
		Час = Час(ПС); 
		Если Час >= НачальныйЧас И Час <= КонечныйЧас Тогда 
		
			Х=Х+1;	
			
			Отбор=Новый Структура("ПериодРезерва, КоворкингНомер", ПС, СпрНомеров.Ссылка);
			СтрокиНом=ТЗЗапроса.НайтиСтроки(Отбор);
			Обл=Макет.ПолучитьОбласть("Строка|СтрПериод");

			Если СтрокиНом.Количество() <> 0 тогда
				ТекКл = СтрокиНом[0].Клиент;
				ТекРегистратор = СтрокиНом[0].Регистратор;
				
				//ТекСтатус = СтрокиНом[0].Статус;
				
				ОтборСтроки = Новый Структура("Клиент, Регистратор", ТекКл, ТекРегистратор); 
				НайденныеСтроки = ТЗКлиентов.НайтиСтроки(ОтборСтроки);
				КлСтат = НайденныеСтроки[0];
				Цв = КлСтат.Цвет;
				
				Обл.Область(1,1,1,1).ЦветФона=Цв;
				Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
					
				ШрифтПолужирный_П = (КлСтат.Статус <> "НЕТ СЧЕТОВ");  
				ШрифтТекста = Новый Шрифт(Обл.Область(1,1,1,1).Шрифт,,,ШрифтПолужирный_П);
				Обл.Область(1,1,1,1).Шрифт = ШрифтТекста;
			
				Обл.Параметры.Период=ТекКл.Наименование;
				
				НовШ=ТЗШахматкаЧасы.Добавить();
				НовШ.Х=Х;
				НовШ.У=У;
				НовШ.Клиент=ТекКл;
				НовШ.Номер=СпрНомеров.Ссылка;
				
				НовШ.Регистратор = ТекРегистратор;
				НовШ.Счет = НовШ.Регистратор;
				
				НовШ.Период = НачалоЧаса(ТемпС);
			иначе
				ТекКл=Справочники.Клиенты.ПустаяСсылка();			
			конецесли;
			
			Если ТекКл<>ТемпКл 
			ИЛИ ТекРегистратор <> ТемпРегистратор 
			//ИЛИ ТекСчет <> ТемпСчет 
			тогда
				
				НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
				СписОб.Добавить(НовОб);
				
				ТемпКл=ТекКл;
				ТемпРегистратор = ТекРегистратор;
				//ТемпСчет = ТекСчет;
				
				НачИ=Сч+1;
			конецесли;
			
			ТабДок.Присоединить(Обл);
		
			сч=сч+1;
		КонецЕсли;
			
		ТемпС=ТемпС + 3600;
	КонецЦикла;
	
	НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
	СписОб.Добавить(НовОб);
	
	Первый=Истина;
	Для каждого Об Из СписОб Цикл
		если Первый Тогда Первый=Ложь; Продолжить; конецесли;
		
		Если Об.Значение.ТекКл=Справочники.Клиенты.ПустаяСсылка() тогда	Продолжить; конецесли; 
		
		ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
	КонецЦикла; 
	
	ПолеШахматкиЧасы.Вывести(ТабДок);
КонецЦикла;

КоличествоДней = (НачалоДня(ДатаПо) - НачалоДня(ДатаС)) / (60 * 60 * 24);

КоличествоКолонокЧасов = (КоличествоДней + 1) * (КонечныйЧас - НачальныйЧас + 1);

Час = Час(ДатаС);
Если Час > НачальныйЧас Тогда
	КоличествоКолонокЧасов = КоличествоКолонокЧасов - (Час - НачальныйЧас);
КонецЕсли;

Час = Час(ДатаПо);
Если Час < КонечныйЧас Тогда
	КоличествоКолонокЧасов = КоличествоКолонокЧасов - (КонечныйЧас - Час);
КонецЕсли;
	
ШиринаТаблицы = 150;
ШиринаКолонки = ШиринаТаблицы / КоличествоКолонокЧасов;

Если ШиринаКолонки < 2.5 Тогда
	 ШиринаКолонки = 2.5;
КонецЕсли;

//ПолеШахматкиЧасы.Область(,3,,КоличествоКолонокЧасов + 2).ЦветФона = Новый Цвет(100, 100, 100);

ПолеШахматкиЧасы.Область(,3,,КоличествоКолонокЧасов + 2).ШиринаКолонки = ШиринаКолонки;	

ПолеШахматкиЧасы.Область(,3,,КоличествоКолонокЧасов + 2).РастягиватьПоГоризонтали = Истина;

ПолеШахматкиЧасы.ФиксацияСлева=2;
ПолеШахматкиЧасы.ФиксацияСверху=2;

ПолеШахматкиЧасы.Область(1, ,1).Видимость = Ложь;

//ПолеШахматкиЧасы.УстановитьРастягиваниеПоГоризонтали(Истина);
КонецФункции
//

&НаСервере
Функция СлучайныйЦвет(ТЗКлиентов)      
Случай=Новый ГенераторСлучайныхЧисел();
СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
Если ТЗКлиентов.Найти(НовЦвет,"Цвет")<>Неопределено тогда
	//Случай=Новый ГенераторСлучайныхЧисел();
	
	Случай=Новый ГенераторСлучайныхЧисел(Случай.СлучайноеЧисло(0, 100));  
	СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
	СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
	СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
	НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
КонецЕсли;

Возврат НовЦвет;
	
КонецФункции

&НаСервере
Функция ИмяОбработки_ПеренесеноВОбщийМодуль(Форма)
Имя = Форма.ИмяФормы;    
ИмяОбработки = Сред(Имя, 11);
Индекс = СтрНайти(ИмяОбработки,".");
ИмяОбработки = Сред(ИмяОбработки, 1, Индекс - 1); 	

Возврат ИмяОбработки
КонецФункции
//


&НаКлиенте
Процедура КоворкингДокументы(Команда)
ОткрытьФорму("Обработка.КоворкингЗаявкаОбработка.Форма.Форма", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
/////// ++++++++

&НаКлиенте
Процедура КоворкингЗаявки(Команда)
ОткрытьФорму("Документ.КоворкингЗаявка.Форма.ФормаСписка", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингСчета(Команда)
ОткрытьФорму("Документ.КоворкингСчета.Форма.ФормаСписка", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

////

// + Выбор
&НаКлиенте
Процедура ПолеОтчетаВыбор(Элемент, Область, СтандартнаяОбработка)
ИмяЭлемента = Элемент.Имя;
Если ИмяЭлемента = "ПолеШахматкиДни" Тогда
	ДниЧасы = "Дни";
ИначеЕсли ИмяЭлемента = "ПолеШахматкиЧасы" Тогда
	ДниЧасы = "Часы";
Иначе
	Возврат;
КонецЕсли;
	
Тек=ОпределитьПоКоординатам(Область.Лево-2,Область.Верх-3, ДниЧасы);	
Если НЕ ЗначениеЗаполнено(Тек.Клиент) тогда Возврат; КонецЕсли;

Если ТипЗнч(Тек.Регистратор) = Тип("ДокументСсылка.КоворкингСчета") тогда
	ПараметрыФормы = Новый Структура("Ключ", Тек.Регистратор);
	
	ОткрытьФорму("Документ.КоворкингСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.Независимый);
		
Иначе
	ПараметрыФормы = Новый Структура("Ключ", Тек.Регистратор);
	ОткрытьФорму("Документ.КоворкингЗаявка.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.Независимый);
		
конецесли;
КонецПроцедуры

&НаКлиенте
Функция ОпределитьПоКоординатам(х,у, ДниЧасы)
	
ВозврСтр=Новый Структура("Клиент, Номер, Период, Регистратор, Счет"
	,ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка")
	,ПредопределенноеЗначение("Справочник.КоворкингНомера.ПустаяСсылка")
	,ТекущаяДата()
	,ПредопределенноеЗначение("Документ.КоворкингЗаявка.ПустаяСсылка")
	,ПредопределенноеЗначение("Документ.КоворкингСчета.ПустаяСсылка"));
	
	
Отбор=Новый Структура("Х,У",Х,У);
Если ДниЧасы = "Дни" Тогда
	Стр=ТЗШахматкаДни.НайтиСтроки(Отбор);
ИначеЕсли ДниЧасы = "Часы" Тогда
	Стр=ТЗШахматкаЧасы.НайтиСтроки(Отбор);
Иначе
	Возврат ВозврСтр;
КонецЕсли;
	
Если Стр.Количество()=0 тогда
	Возврат ВозврСтр;
иначе
	ВозврСтр.Клиент=Стр[0].Клиент;
	ВозврСтр.Номер=Стр[0].Номер;
	ВозврСтр.Период=Стр[0].Период;

	ВозврСтр.Регистратор=Стр[0].Регистратор;
	//ВозврСтр.Счет=Стр[0].Счет;
	
	//ВозврСтр.Документ=Стр[0].Документ;
	Возврат ВозврСтр;
КонецЕсли;
КонецФункции
// - Выбор


// + Справочники
&НаКлиенте
Процедура КоворкингНомера(Команда)
Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_КоворкингНомераФормаСписка", ЭтаФорма);	
	
ОткрытьФорму("Справочник.КоворкингНомера.ФормаСписка", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_КоворкингНомераФормаСписка(Результат, ДополнительныеПараметры) Экспорт
ОбновитьФорму(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КоворкингДопУслуги(Команда)
	ОткрытьФорму("Справочник.КоворкингУслуги.ФормаСписка", , ЭтаФорма  
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
// + Справочники

&НаКлиенте
Процедура ТЕСТ(Команда)
ВывестиШахматкуДни('20220601','20220830');
//ВывестиШахматкуЧасы('20220401110000', '20220404180000');
//ТЕСТНаСервере();
КонецПроцедуры


&НаСервере
Процедура ТЕСТНаСервере()
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КоворкингЗаявка.Ссылка КАК Ссылка,
	                    |	КоворкингЗаявка.Клиент КАК Клиент,
	                    |	СУММА(СчетаОплаты.СуммаСчета) КАК СуммаСчета,
	                    |	СУММА(СчетаОплаты.СуммаРаспределено) КАК СуммаРаспределено
	                    |ИЗ
	                    |	Документ.КоворкингЗаявка КАК КоворкингЗаявка
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |			КоворкингСчета.Ссылка КАК Ссылка,
	                    |			КоворкингСчета.Сумма КАК СуммаСчета,
	                    |			Оплаты.СуммаРаспределено КАК СуммаРаспределено,
	                    |			КоворкингСчета.КоворкингЗаявка КАК СчетКоворкингЗаявка
	                    |		ИЗ
	                    |			Документ.КоворкингСчета КАК КоворкингСчета,
	                    |			(ВЫБРАТЬ
	                    |				КоворкингСчетаДокументыОплаты.Ссылка КАК ОплатыСсылка,
	                    |				СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
	                    |			ИЗ
	                    |				Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
	                    |			
	                    |			СГРУППИРОВАТЬ ПО
	                    |				КоворкингСчетаДокументыОплаты.Ссылка) КАК Оплаты) КАК СчетаОплаты
	                    |		ПО КоворкингЗаявка.Ссылка = СчетаОплаты.СчетКоворкингЗаявка
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	КоворкингЗаявка.Ссылка,
	                    |	КоворкингЗаявка.Клиент");	
	
	ТЗ =  Запрос.Выполнить().Выгрузить();
КонецПроцедуры


// +++++++++++++++++++++++++++++++++++++++++
&НаСервере
Функция ВывестиШахматку(ДатаС,ДатаПо,Детализация)

//	ТЗШахматкаДни.Очистить();
//	ДатаС=?(Детализация="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
//	Запрос=Новый Запрос("ВЫБРАТЬ
//	                    |	ЗанятостьНомеров.Клиент КАК Клиент,
//	                    |	ЗанятостьНомеров.Регистратор.Статус КАК Статус,
//	                    |	ЗанятостьНомеров.Регистратор КАК Регистратор
//	                    |ИЗ
//	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
//	                    |ГДЕ
//	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
//	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА
//	                    |
//	                    |УПОРЯДОЧИТЬ ПО
//	                    |	Клиент");	
//	
//	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
//	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
//	ТЗКлиентов=Запрос.Выполнить().Выгрузить();
//	ТЗКлиентов.Колонки.Добавить("Цвет");
//	
//	Сч=0;
//	////СписокЦветов=Новый СписокЗначений;
//	Для каждого Клиент Из ТЗКлиентов Цикл	
//		Если Клиент.Статус=Перечисления.СтатусБрони.Проживает тогда
//			Клиент.Цвет=Новый Цвет(255,255,255);
//		иначеесли Клиент.Статус=Перечисления.СтатусБрони.Выехал тогда
//			Клиент.Цвет=Новый Цвет(231, 227, 217);
//		иначеесли Клиент.Статус=Перечисления.СтатусБрони.ОтказОтБронирования тогда
//			Клиент.Цвет=Новый Цвет(233, 150, 122);   // Лосось темный
//		иначе
//			Если Клиент.регистратор.ЦветR<>0 Или  Клиент.регистратор.ЦветG<>0 или  Клиент.регистратор.ЦветB<>0 тогда	
//				Клиент.Цвет=Новый Цвет(Клиент.регистратор.ЦветR,Клиент.регистратор.ЦветG,Клиент.регистратор.ЦветB);
//			ИначеЕсли Клиент.Клиент.ЦветR<>0 Или  Клиент.Клиент.ЦветG<>0 или  Клиент.Клиент.ЦветB<>0 тогда	
//				Клиент.Цвет=Новый Цвет(Клиент.Клиент.ЦветR,Клиент.Клиент.ЦветG,Клиент.Клиент.ЦветB);
//			иначе
//				//Случай=Новый ГенераторСлучайныхЧисел();
//				//СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
//				//СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
//				//СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
//				//НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
//				//Если ТЗКлиентов.Найти(НовЦвет,"Цвет")<>Неопределено тогда
//				//	Случай=Новый ГенераторСлучайныхЧисел();
//				//	СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
//				//	СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
//				//	СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
//				//	НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
//				//КонецЕсли;
//				//Клиент.Цвет=НовЦвет;
//				
//				Клиент.Цвет = СлучайныйЦвет(ТЗКлиентов);
//			КонецЕсли;
//		конецесли;
//	КонецЦикла; 
//	
//	Запрос=Новый Запрос("ВЫБРАТЬ
//	                    |	ЗанятостьНомеров.Номер КАК Номер,
//	                    |	ЗанятостьНомеров.Клиент КАК Клиент,
//	                    |	ЗанятостьНомеров.ПериодРезерва КАК ПериодРезерва,
//	                    |	ЗанятостьНомеров.Регистратор КАК Регистратор,
//	                    |	ЗанятостьНомеров.БонШанс КАК БонШанс
//	                    |ИЗ
//	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
//	                    |ГДЕ
//	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
//	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
//	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
//	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
//	ТЗЗапроса=Запрос.Выполнить().Выгрузить();
//	
//	ПолеОтчета.Очистить();
//	
////// + Вывод Верхних строк с датами		
//	ТемпС=ДатаС;
//	ТемпПо=ДатаПо;
//	
//	Макет = Обработки.Интерфейс.ПолучитьМакет("Макет");
//	
//	ТабДок=Новый ТабличныйДокумент;
//	Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
//	ТабДок.Присоединить(Обл);
//	
//	ТЗОбъеденения=Новый ТаблицаЗначений();
//	ТЗОбъеденения.Колонки.Добавить("КолонкаС");
//	ТЗОбъеденения.Колонки.Добавить("КолонкаПо");
//	ТЗОбъеденения.Колонки.Добавить("ДТ");
//	
//	Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");
//	ТемпДень=НачалоДня(ТемпС);
//	Нов=ТЗОбъеденения.Добавить();
//	Нов.КолонкаС=2;
//	Нов.КолонкаПо=2;
//	Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");
//	ТекКол=2;
//	Пока ТемпС<=ТемпПо цикл
//		Если НачалоДня(ТемпС)>ТемпДень тогда
//			// новый день
//			Нов.КолонкаПо=ТекКол-1;
//			Нов=ТЗОбъеденения.Добавить();
//			Нов.КолонкаС=ТекКол;
//			Нов.КолонкаПо=ТекКол+1;
//			ТемпДень=НачалоДня(ТемпС);
//			Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");	
//		конецесли;
//		
//		// + ПСН  Замена 12:00 на 14:00
//		//Обл.Параметры.Период=Формат(ТемпС, ?(Детализация="День","ДФ='dd.MM'","ДФ='HH:mm'"));
//		Если Детализация="День" Тогда 
//			Обл.Параметры.Период=Формат(ТемпС, "ДФ='dd.MM'");
//		Иначе	
//			ТемпС_Период = Формат(ТемпС, "ДФ='HH:mm'");		
//			Если Лев(ТемпС_Период, 2) = "12" Тогда
//				ТемпС_Период = СтрЗаменить(ТемпС_Период, "12", "14");
//			КонецЕсли;
//			Обл.Параметры.Период = ТемпС_Период;
//		КонецЕсли;
//		// - ПСН  Замена 12:00 на 14:00
//		
//		ТабДок.Присоединить(Обл);
//		ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
//		ТекКол=ТекКол+1;
//	КонецЦикла;
//	Нов.КолонкаПо=ТекКол-1;
//	Для каждого Об Из ТЗОбъеденения Цикл
//		ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаС+1).Текст=Об.ДТ;
//		
//		ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаПо+1).Объединить();
//	КонецЦикла; 
//	
//	ПолеОтчета.Вывести(ТабДок);
////// + Вывод Верхних строк с датами	
//	
//	СпрНомеров=Справочники.НомернойФонд.Выбрать();
//	Х=0;
//	У=0;
//	
//	Пока СпрНомеров.Следующий() цикл
//		Если СпрНомеров.ПометкаУдаления Тогда продолжить; КонецЕсли;
//		
//		У=У+1;
//		
//		ТабДок=Новый ТабличныйДокумент;
//		
//		ТемпС=ДатаС;
//		ТемпПо=ДатаПо;
//		
//		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
//		Обл.Параметры.Номер=СпрНомеров.Наименование + ?(СпрНомеров.РаздельныеКровати, " / РК","")+ ?(СпрНомеров.Балкон, "/ Б ","");
//		Если Не СпрНомеров.ЦветНомераB+СпрНомеров.ЦветНомераG+СпрНомеров.ЦветНомераR=0 тогда
//			Обл.Область(1,2,1,2).ЦветФона=Новый Цвет(СпрНомеров.ЦветНомераR,СпрНомеров.ЦветНомераG,СпрНомеров.ЦветНомераB);
//			Обл.Область(1,2,1,2).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,2,1,2).ЦветФона);
//		конецесли;
//		
//		//// + ПСН 25.04.22
//		//Если СпрНомеров.КатегорияНомера.Наименование="Полулюкс" тогда
//		//	Обл.Область(1,1,1,1).ЦветФона=Новый Цвет(100, 188, 255);
//		//	Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
//		//иначеесли  СпрНомеров.КатегорияНомера.Наименование="Люкс" тогда
//		//	Обл.Область(1,1,1,1).ЦветФона=Новый Цвет(110, 255, 103);
//		//	Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
//		//иначеесли  СпрНомеров.КатегорияНомера.Наименование="Ст с Б" тогда
//		//	Обл.Область(1,1,1,1).ЦветФона=Новый Цвет(184, 184, 184);
//		//	Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
//		////Политов
//		//иначеесли  СпрНомеров.КатегорияНомера.Наименование="Переговорная" тогда
//		//	Обл.Область(1,1,1,1).ЦветФона=Новый Цвет(184, 184, 184);
//		//	Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
//		//	///Политов
//		//конецесли;
//		//// - ПСН 25.04.22
//		
//	    Обл.Область(1,1,1,1).Расшифровка=СпрНомеров.ОписаниеНомера;
//		////Обл.Область(1,1,1,1).ИспользованиеРасшифровки=ИспользованиеРасшифровкиТабличногоДокумента.
//		////Обл.Область(1,1,1,1).
//		ТабДок.Присоединить(Обл);
//		
//		ТемпКл=Справочники.Клиенты.ПустаяСсылка();
//		
//		//// + ПСН 25.04.22
//		ТемпРегистратор=Документы.ЗаявкаНаБронирование.ПустаяСсылка();
//		//// - ПСН 25.04.22
//		
//		СписОб=Новый СписокЗначений;                            
//		Сч=2;
//		НачИ=3;	
//		Х=0;
//		
//		Пока ТемпС<=ТемпПо цикл
//			Х=Х+1;			
//			ПС=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
//			ПК=?(Детализация="День",КонецДня(ТемпС),КонецЧаса(ТемпС));
//			
//			Отбор=Новый Структура("ПериодРезерва,Номер",ПС,СпрНомеров.Ссылка);
//			СтрокиНом=ТЗЗапроса.НайтиСтроки(Отбор);
//			Обл=Макет.ПолучитьОбласть("Строка|СтрПериод");
//			
//			//// + ПСН 25.04.22
//			//Политов
//			//если  СпрНомеров.КатегорияНомера.Наименование="Переговорная" тогда
//			//	Обл.Область(1,1,1,1).ЦветФона=Новый Цвет(184, 184, 184);
//			//	Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);
//			//КонецЕсли;
//			//Политов
//			//// - ПСН 25.04.22

//			////Если ТЗЗапроса.Количество()<>0 тогда
//			Если СтрокиНом.Количество() <> 0 тогда
//				////ТекКл=ТЗЗапроса[0].Клиент;
//				//ТекКл=СтрокиНом[0].Клиент;
//				//
//				////// + ПСН 25.04.22
//				//ТекРегистратор=СтрокиНом[0].Регистратор;
//				////// - ПСН 25.04.22
//				
//				Если СтрокиНом.Количество() > 1 Тогда 
//					ТекКл = СтрокиНом[0].Клиент;
//					
//					//// + ПСН 25.04.22
//					ТекРегистратор = СтрокиНом[0].Регистратор;
//					//// - ПСН 25.04.22
//					
//					ТекСтатус = Неопределено; 
//					ТекРегистратор = Неопределено;
//					
//					Обл.Параметры.Период = "БШ " + Строка(СтрокиНом.Количество());
//					Цв = Новый Цвет(0, 0, 255);
//					
//					////НовШ.Документ=СтрокиНом[0].Регистратор;
//				Иначе	
//					ТекКл=СтрокиНом[0].Клиент;
//					
//					//// + ПСН 25.04.22
//					ТекРегистратор=СтрокиНом[0].Регистратор;
//					//// - ПСН 25.04.22
//					
//					////	КлСтат=ТЗКлиентов.Найти(ТЗЗапроса[0].Клиент,"Клиент");
//					КлСтат=ТЗКлиентов.Найти(СтрокиНом[0].Регистратор,"Регистратор");
//					Цв=КлСтат.Цвет;
//					
//					Если ТекКл = ТемпКл Тогда
//						Если ТекРегистратор <> ТемпРегистратор Тогда
//							ЦветR = Цв.Красный  + 5;
//							Если ЦветR > 255 Тогда
//								ЦветR = ЦветR - 10;
//							КонецЕсли;
//									
//							Цв = Новый Цвет(ЦветR, Цв.Зеленый, Цв.Синий);
//						КонецЕсли;	
//					КонецЕсли;	
//					
//					Обл.Параметры.Период=ТекКл.Наименование;
//					ТекСтатус = КлСтат.Статус; 
//				КонецЕсли;	
//				
//				Обл.Область(1,1,1,1).ЦветФона=Цв;
//				Обл.Область(1,1,1,1).ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Обл.Область(1,1,1,1).ЦветФона);

//				//Если КлСтат.Статус=Перечисления.СтатусБрони.Проживает тогда
//				Если ТекСтатус = Перечисления.СтатусБрони.Проживает тогда
//					Обл.Область(1,1,1,1).Шрифт=Новый Шрифт(Обл.Область(1,1,1,1).Шрифт,,,Истина);
//				КонецЕсли;
//				
//				//Обл.Параметры.Период=ТекКл.Наименование;
//				
//				НовШ=ТЗШахматкаДни.Добавить();
//				НовШ.Х=Х;
//				НовШ.У=У;
//				НовШ.Клиент=ТекКл;
//				НовШ.Номер=СпрНомеров.Ссылка;
//				////НовШ.Документ=ТЗЗапроса[0].Регистратор;
//				
//				ДокументМассив = Новый СписокЗначений; 
//				Для Каждого СтрокаДанные Из СтрокиНом Цикл
//					ДокументМассив.Добавить(СтрокаДанные.Регистратор); 
//				КонецЦикла;
//				НовШ.Документ=ДокументМассив;
//				
//				НовШ.Период=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
//			иначе
//				ТекКл=Справочники.Клиенты.ПустаяСсылка();			
//			конецесли;
//			
//			//// + ПСН 25.04.22
//			//Если ТекКл<>ТемпКл тогда
//			Если ТекКл<>ТемпКл 
//			ИЛИ ТекРегистратор <> ТемпРегистратор 
//			тогда
//			//// - ПСН 25.04.22
//				
//				НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
//				СписОб.Добавить(НовОб);
//				
//				ТемпКл=ТекКл;
//				//// + ПСН 25.04.22
//				ТемпРегистратор = ТекРегистратор;
//				//// - ПСН 25.04.22
//				
//				НачИ=Сч+1;
//			конецесли;
//			
//			ТабДок.Присоединить(Обл);
//			ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
//			сч=сч+1;
//		КонецЦикла;
//		
//		НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
//		СписОб.Добавить(НовОб);
//		
//		Первый=Истина;
//		Для каждого Об Из СписОб Цикл
//			если Первый Тогда
//				Первый=Ложь;
//				Продолжить;
//				
//			конецесли;
//			Если Об.Значение.ТекКл=Справочники.Клиенты.ПустаяСсылка() тогда
//				Продолжить;
//			конецесли;
//			
//			ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
//		КонецЦикла; 
//		
//		ПолеОтчета.Вывести(ТабДок);
//	КонецЦикла;
//	
//	ПолеОтчета.ФиксацияСлева=2;
//	ПолеОтчета.ФиксацияСверху=3;
//	
//	ПолеОтчета.УстановитьРастягиваниеПоГоризонтали(Истина);
//	////ТЗЗапроса
КонецФункции










