
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Регистраторы_П = Параметры.Регистраторы;

Для Каждого Строка Из Регистраторы_П Цикл
	НоваяСтрока = Регистраторы.Добавить();
	НоваяСтрока.Регистратор = Строка.Значение;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РегистраторыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

СтрокаРегистратор = Регистраторы.НайтиПоИдентификатору(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура("Ключ", СтрокаРегистратор.Регистратор); 
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
