&НаКлиенте
Перем ПредыдущийНомерСтроки;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ПолеОтчета") Тогда 
		Отказ = Истина;
		Возврат;
	Иначе 
		ПолеОтчета = Параметры.ПолеОтчета;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокОтчета") Тогда 
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.ЗаголовокОтчета;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПриАктивизации(Элемент)
   НомерСтроки = Элементы.ПолеОтчета.ТекущаяОбласть.Верх;
    Если ПредыдущийНомерСтроки <> Неопределено И НомерСтроки <> ПредыдущийНомерСтроки Тогда
        ПолеОтчета.Область(ПредыдущийНомерСтроки,,ПредыдущийНомерСтроки).ЦветФона = Новый Цвет;        
    КонецЕсли;
	
	ПолеОтчета.Область(НомерСтроки,,НомерСтроки).ЦветФона = WebЦвета.АкварельноСиний;
	ПредыдущийНомерСтроки = НомерСтроки;
КонецПроцедуры
