
Функция ЗаписатьФайлСообщение(ДатаС, ДатаПо, ТипыСчетов) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	
	
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Выгрузка Заявок " + " ------------";
Сообщение.Сообщить();

// + ПСН 
// Получить имя файла обмена.
//ИмяФайла = "C:\ПСН\ЗаявкиJSON.JSON";
ИмяФайла = ПолучитьИмяВременногоФайла("json"); 
// - ПСН 

ЗаписатьЗаявки(ИмяФайла, ДатаС, ДатаПо, ТипыСчетов); 

//ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(УзелПриемник.Ссылка.Код);
ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена("ОБМЕН_НДС");

//ИмяФайлаФТП = ФТПСервер.ПолучитьИмяФайлаОбменаФТП(УзелИсточник, УзелПриемник, ДанныеУзлаОбмена.КаталогОбменаFTP);
ИмяФайлаФТП = ПолучитьИмяФайлаОбменаФТП(ДанныеУзлаОбмена.КаталогОбменаFTP);

Ответ = ФТПСервер.ЗаписатьФТПФайл(ИмяФайла, ИмяФайлаФТП
	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
//Результат = ОбщийМодульФТП.ЗаписатьФТПФайл_TECT(ИмяФайла, "C:\_Base1C\Обмен.xml"); 

Если Ответ.Ошибка Тогда 
	Сообщить("Ошибка записи файла обмена по FTP. " + Ответ.ОписаниеОшибки + 
	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
	
	Результат = Ответ;	
КонецЕсли;

 ~ВЫХОД:
УдалитьФайлы(ИмяФайла);
// - ПСН 

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец выгрузки ------------";
Сообщение.Сообщить();

Возврат Результат;
КонецФункции

Функция ПолучитьИмяФайлаОбменаФТП(КаталогОбменаFTP) Экспорт
// Сформировать полное имя файла обмена.
//ИмяФайла = КаталогОбменаFTP + "Message_" + Формат(ТекущаяДата()) + ".json";

Если НастройкиСервер.ЭтоДомСоветов() Тогда
	Имя = "ДомСоветов_Обмен_НДС";
ИначеЕсли НастройкиСервер.ЭтоЛайв() Тогда
	Имя = "Лайв_Обмен_НДС";
ИначеЕсли НастройкиСервер.ЭтоРеноме() Тогда
	Имя = "Реноме_Обмен_НДС";
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда
	Имя = "СтритАрт_Обмен_НДС";
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда
	Имя = "Чехов_Обмен_НДС";
Иначе
	Имя = "";
КонецЕсли;

ИмяФайла = КаталогОбменаFTP + "Message_" + Имя + ".json";

Возврат ИмяФайла;
КонецФункции

Функция ЗаписатьЗаявки(Знач ИмяФайла, ДатаС, ДатаПо, ТипыСчетов) Экспорт 
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();    
Если НастройкиСервер.ЭтоДомСоветов() И ДатаПо < '20260301' ТОгда
	СтавкаНДС = Перечисления.СтавкиНДС.НДС22; 
	ВсеСНДС = Ложь; 
Иначе	
	СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; 
	ВсеСНДС = ТекущаяОрганизация.ВсеСНДС; 
КонецЕсли; 
//СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; 
////СтавкаНДСЧисло = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДС); 
//ВсеСНДС = ТекущаяОрганизация.ВсеСНДС; 

ЗаписьJSON = Новый ЗаписьJSON;
//ИмяФайла = "C:\ПСН\ЗаявкиJSON";
//ЗаписьJSON.ОткрытьФайл(ИмяФайла,,, Новый ПараметрыЗаписиJSON(, Символы.ВТаб));
ЗаписьJSON.ОткрытьФайл(ИмяФайла);

ЗаписьJSON.ЗаписатьНачалоМассива();

ДатаМин = ДатаС;
ДатаМакс = ДатаПо;

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
ОрганизацияИНН = ТекущаяОрганизация.ИНН;
ОрганизацияКПП = ТекущаяОрганизация.КППОбмен;

ДанныеОрганизации = Справочники.Организации.ПолучитьДанныеОрганизации(Истина);
КоворкингИНН = ДанныеОрганизации.ИНН;
КоворкингКПП = ДанныеОрганизации.ИНН;

СтавкаНДСКоворкинг = ТекущаяОрганизация.КоворкингСтавкаНДС; 

СтруктураДанные = Новый Структура("ТипЗаявки, ОрганизацияИНН, ОрганизацияКПП"
	+ ", КоворкингИНН, КоворкингКПП"
	+ ", ДатаС, ДатаПо"
	, "ЗГ", ОрганизацияИНН, ОрганизацияКПП
	, КоворкингИНН, КоворкингКПП
	, ДатаМин, ДатаМакс);
ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);

ЗапросТекстСчета = "ВЫБРАТЬ
                   |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК ЗаявкаНомер,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ЗаявкаДата,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервС КАК РезервС,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервПо КАК РезервПо,
                   |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                   |	ЗаявкаНаБронированиеСчета.НомерСчета КАК СчетНомер,
                   |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК СчетДата,
                   |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаС,
                   |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаПо,
                   |	ЗаявкаНаБронированиеСчета.Контрагент КАК Контрагент,
                   |	ЗаявкаНаБронированиеСчета.Клиент КАК Клиент,
                   |	ЗаявкаНаБронированиеСчета.Контрагент.НаименованиеЮрЛица КАК КонтрагентНаименованиеЮрЛица,
                   |	ЗаявкаНаБронированиеСчета.Контрагент.Наименование КАК КонтрагентНаименование,
                   |	ЗаявкаНаБронированиеСчета.Контрагент.ИНН КАК КонтрагентИНН,
                   |	ЗаявкаНаБронированиеСчета.Контрагент.КПП КАК КонтрагентКПП,
                   |	ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете,
                   |	ЕСТЬNULL(СчетаБронируетРавноКонтрагент.КоличествоСчетов, 0) КАК КоличествоСчетовТурагентство
                   |ИЗ
                   |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |			ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
                   |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронированиеСчета.СчетГУИД) КАК КоличествоСчетов
                   |		ИЗ
                   |			Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ГДЕ
                   |			ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                   |		
                   |		СГРУППИРОВАТЬ ПО
                   |			ЗаявкаНаБронированиеСчета.Ссылка) КАК СчетаБронируетРавноКонтрагент
                   |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаБронируетРавноКонтрагент.Ссылка";

ЗапросТекстСчетСтроки = "ВЫБРАТЬ
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Заявка,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.НомерСтроки КАК НомерСтроки,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.ГрупповойСчет КАК ГрупповойСчет,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга КАК Услуга,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД КАК ДолгиГУИД,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.ДатаДолг КАК ДатаДолг,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.НаименованиеДолг КАК НаименованиеДолг,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.Количество КАК Количество,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.Цена КАК Цена,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг КАК СуммаДолг,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию КАК СуммаКЗакрытию,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено КАК СуммаОплачено,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС КАК ЕстьНДС,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.НазваниеДляЧека КАК НазваниеДляЧека,
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.ПрограммныйКодУслуги КАК ПрограммныйКодУслуги
               |ИЗ
               |	Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |ГДЕ
               |	ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = &Заявка
               |	И ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД = &СчетГУИД";

ЗапросТекстКоворкингСчета = "ВЫБРАТЬ
                            |	КоворкингСчета.Ссылка КАК КоворкингСчет,
                            |	КоворкингСчета.Номер КАК КоворкингСчетНомер,
                            |	КоворкингСчета.Дата КАК КоворкингСчетДата,
                            |	КоворкингСчета.ДатаС КАК ДатаС,
                            |	КоворкингСчета.ДатаПо КАК ДатаПо,
                            |	КоворкингСчета.СчетГУИД КАК СчетГУИД,
                            |	КоворкингСчета.ЧасС КАК ЧасС,
                            |	КоворкингСчета.ЧасПо КАК ЧасПо,
                            |	КоворкингСчета_1.Контрагент КАК Контрагент
                            |ИЗ
                            |	Документ.КоворкингСчета КАК КоворкингСчета
                            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                            |			КоворкингСчета.Ссылка КАК Ссылка,
                            |			ВЫБОР
                            |				КОГДА КоворкингСчета.ОплачиваетСчет = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                            |					ТОГДА ВЫБОР
                            |							КОГДА КоворкингСчета.КоворкингЗаявка.Оплачивает = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                            |								ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
                            |							ИНАЧЕ КоворкингСчета.КоворкингЗаявка.Оплачивает
                            |						КОНЕЦ
                            |				ИНАЧЕ КоворкингСчета.ОплачиваетСчет
                            |			КОНЕЦ КАК Контрагент
                            |		ИЗ
                            |			Документ.КоворкингСчета КАК КоворкингСчета) КАК КоворкингСчета_1
                            |		ПО КоворкингСчета.Ссылка = КоворкингСчета_1.Ссылка";


//Если ДатаМакс <> НачалоДня(КонецМесяца(ДатаМакс)) Тогда Перейти ~БЛОК_1; КонецЕсли;

ДатаМин_П = НачалоМесяца(ДатаМакс);
ДатаМакс_П = КонецМесяца(ДатаМакс);

// ===================   
            
//Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда Перейти ~БЛОК_КОВОРКИНГ; КонецЕсли;

УсловиеФС = "(
				|ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
				|И (ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				|		ИЛИ (ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				|				И (СчетаБронируетРавноКонтрагент.КоличествоСчетов > 0
				|	ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%"")
				|))
				|)";

Если НЕ ТипыСчетов.ФизЛицоСчет Тогда Перейти ~БЛОК_1; КонецЕсли;

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчета + "
					|ГДЕ
					|	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
					|	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
					|	И " + УсловиеФС + "
					|	И ЗаявкаНаБронированиеСчета.ДатаПо МЕЖДУ &ДатаПо_С И &ДатаПо_По
					|
					|УПОРЯДОЧИТЬ ПО
					|	РезервС,
					|	ЗаявкаНомер,
					|	ЗаявкаНаБронированиеСчета.НомерСчета";

Запрос.УстановитьПараметр("ДатаПо_С", ДатаМин_П);
Запрос.УстановитьПараметр("ДатаПо_По", ДатаМакс_П);
ТЗ = Запрос.Выполнить().Выгрузить();

СтруктураДанные = Новый Структура("ТипЗаявки", "ФС");

МассивСтроки = Новый Массив;
ЗаявкаНомер = ""; СчетНомер = -1; 
Для Каждого Строка Из ТЗ Цикл       
	
	ДатаУчетаНДС = Строка.Заявка.РезервПо;
	СтавкаНДСТекущий = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);  

	Если СтавкаНДСТекущий = Перечисления.СтавкиНДС.БезНДС Тогда Продолжить; КонецЕсли;	
	
	ЗаявкаНомер = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Строка.ЗаявкаНомер);
	ЗаявкаСтрока = Новый Структура("ЗаявкаНомер, ЗаявкаДата, СчетНомер, СчетДата, ДатаЗаезда, ДатаВыезда"
		, ЗаявкаНомер, Строка.ЗаявкаДата, Строка.СчетНомер, Строка.СчетДата, Строка.РезервС, Строка.РезервПо
		);
		
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	Счета = Строка.Заявка.Счета.Выгрузить(ОтборСтроки); 
	Если Счета.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Счет = Счета[0];
	ТЗСтроки = ПечатьСервер.СчетФактураСтроки(Строка.Заявка, Счет);
	
	ТЗСтроки.Сортировать("ЭтоУслуга");
	
	//СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСЧислоТекущий);
	СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСТекущий);
	
	СодержаниеДополнение = " (" + ЗаявкаНомер + "/" + Строка(Строка.СчетНомер) + ")"; 
	МассивСтрокиЗаявки = МассивСтроки(ТЗСтроки, СодержаниеДополнение, СтавкаНДСЧислоТекущий); 
	
	ЗаявкаСтрока.Вставить("МассивСтрокиЗаявки", МассивСтрокиЗаявки);
	
	МассивСтроки.Добавить(ЗаявкаСтрока); 
КонецЦикла;

СтруктураДанные.Вставить("МассивСтроки", МассивСтроки); 
ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);

//Перейти ~ВЫХОД;
//=================

~БЛОК_1:
УсловиеЮС =  "(
				|ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
				|	И ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				|	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ЛОЖЬ
				|	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
			|)";

Если НЕ ТипыСчетов.ЮрЛицоСчет Тогда Перейти ~БЛОК_2; КонецЕсли;

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчета + " 
					|ГДЕ
					|	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
					|	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
					|	И " + УсловиеЮС + " 
					|	И ЗаявкаНаБронированиеСчета.ДатаПо МЕЖДУ &ДатаПо_С И &ДатаПо_По
					|
					|УПОРЯДОЧИТЬ ПО
					|	РезервПо,
					|	ЗаявкаНомер,
					|	ЗаявкаНаБронированиеСчета.НомерСчета";

Запрос.УстановитьПараметр("ДатаПо_С", ДатаМин);
Запрос.УстановитьПараметр("ДатаПо_По", ДатаМакс);
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ДатаУчетаНДС = Строка.Заявка.РезервПо;
	СтавкаНДСТекущий = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);  

	Если СтавкаНДСТекущий = Перечисления.СтавкиНДС.БезНДС Тогда Продолжить; КонецЕсли;	
	
	ЗаявкаНомер = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Строка.ЗаявкаНомер);
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.СчетНомер, Строка.ДатаПо);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентИНН) Тогда
		Сообщить("Контрагент - Юр. лицо. Не заполнен ИНН у контрагента " + Строка.Контрагент + 
			". Выгрузка заявки " + ЗаявкаНомер + " от " + Строка.ЗаявкаДата + " ОТМЕНЯЕТСЯ.");
		Продолжить;
	КонецЕсли;
	
	СтруктураДанные = Новый Структура("ТипЗаявки" 
		+ ", КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентНаименованиеЮрЛица"
		+ ", ЗаявкаНомер, ЗаявкаДата, СчетНомер, СчетДата, ДатаЗаезда, ДатаВыезда"
		+ ", ДокументНомер, ДокументДата"
		+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
		, "ЮС"
		, Строка.КонтрагентИНН, Строка.КонтрагентКПП, Строка.КонтрагентНаименование, Строка.КонтрагентНаименованиеЮрЛица
		, ЗаявкаНомер, Строка.ЗаявкаДата, Строка.СчетНомер, Строка.СчетДата, Строка.РезервС, Строка.РезервПо
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		);
		
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	Счета = Строка.Заявка.Счета.Выгрузить(ОтборСтроки); 
	Если Счета.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Счет = Счета[0];
	ТЗСтроки = ПечатьСервер.СчетФактураСтроки(Строка.Заявка, Счет);
	
	ТЗСтроки.Сортировать("ЭтоУслуга");
	
	//СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСЧислоТекущий);
	СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСТекущий);

	МассивСтрокиЗаявки = МассивСтроки(ТЗСтроки, "", СтавкаНДСЧислоТекущий);
	
	СтруктураДанные.Вставить("МассивСтрокиЗаявки", МассивСтрокиЗаявки); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;

//Перейти ~ВЫХОД;
////////

~БЛОК_2:

УсловиеЮГ = "(
				|	ЗаявкаНаБронированиеСчета.Контрагент.Турагентство = ЛОЖЬ
				|	И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
				|	И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ИСТИНА
				|		ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
			|)";


Если НЕ ТипыСчетов.ЮрЛицоГрупповойСчет Тогда Перейти ~БЛОК_3; КонецЕсли;
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГрупповыеСчета.Ссылка КАК ГрупповойСчет,
                      |	ГрупповыеСчета.Контрагент КАК Контрагент,
                      |	ГрупповыеСчета.Контрагент.ИНН КАК КонтрагентИНН,
                      |	ГрупповыеСчета.Контрагент.КПП КАК КонтрагентКПП,
                      |	ГрупповыеСчета.Контрагент.Наименование КАК КонтрагентНаименование,
                      |	ГрупповыеСчета.Контрагент.НаименованиеЮрЛица КАК КонтрагентНаименованиеЮрЛица
                      |ИЗ
                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |ГДЕ
                      |	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
                      |	И ГрупповыеСчета.Контрагент.Турагентство = ЛОЖЬ
                      |	И ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |	И ГрупповыеСчета.ДатаДокумента МЕЖДУ &ДатаДокументаС И &ДатаДокументаПо");

Запрос.УстановитьПараметр("ДатаДокументаС", ДатаМин);
Запрос.УстановитьПараметр("ДатаДокументаПо", ДатаМакс);
ТЗГрупповыеСчета = Запрос.Выполнить().Выгрузить();

Для Каждого СтрокаГрупповойСчет Из ТЗГрупповыеСчета Цикл
	
	//ТекстОшибки = ПроверитьГрупповойСчет(СтрокаГрупповойСчет.ГрупповойСчет, ДатаПо);
	//Если ТекстОшибки <> "" Тогда
	//	ТекстОшибки = ТекстОшибки + " Счет фактура НЕ ВЫГРУЖЕНА.";
	//	Сообщить(ТекстОшибки);
	//	
	//	Продолжить;
	//КонецЕсли;  
	
 	ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(СтрокаГрупповойСчет.ГрупповойСчет);
	СтавкаНДСТекущий = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);  

	Если СтавкаНДСТекущий = Перечисления.СтавкиНДС.БезНДС Тогда Продолжить; КонецЕсли;	
	
	ТЗСтроки = ПечатьСервер.ГрупповойСчетФактурыСтроки(СтрокаГрупповойСчет.ГрупповойСчет); 
	
 	ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(СтрокаГрупповойСчет.ГрупповойСчет);
	
	//СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСЧислоТекущий);
	СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСТекущий);
	
	МассивСтроки = МассивСтроки(ТЗСтроки, "", СтавкаНДСЧислоТекущий);
	Если МассивСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли; 
	
	ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(СтрокаГрупповойСчет.ГрупповойСчет);
	
	СтруктураДанные = Новый Структура("ТипЗаявки"
				+ ", ДокументНомер, ДокументДата"
				+ ", КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентНаименованиеЮрЛица"
				+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
				, "ЮГ"
				, ГрупповойСчетНомерДата.Номер, ГрупповойСчетНомерДата.Дата
				, СтрокаГрупповойСчет.КонтрагентИНН, СтрокаГрупповойСчет.КонтрагентКПП
				, СтрокаГрупповойСчет.КонтрагентНаименование, СтрокаГрупповойСчет.КонтрагентНаименованиеЮрЛица
				, ГрупповойСчетНомерДата.Номер, ГрупповойСчетНомерДата.Дата);
				
	СтруктураДанные.Вставить("МассивСтроки", МассивСтроки);	
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;	
	
//Перейти ~ВЫХОД;
/////

~БЛОК_3:
УсловиеТСГ = "(
				|	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				|   И НЕ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%""
				|	И ЗаявкаНаБронированиеСчета.Контрагент =  ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
				|	И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ИСТИНА
				|		ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
			|)";

УсловиеТСП = "(
				|	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				|   И НЕ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%""
				|	И ЗаявкаНаБронированиеСчета.Контрагент =  ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
				|	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ЛОЖЬ
				|	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
			|)";

УсловиеТСФ = "(
				|	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				|   И НЕ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%""
				|	И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.Физлицо)
				|	И (ЗаявкаНаБронированиеСчета.ТолькоПроживание = ИСТИНА
				|		ИЛИ (ЗаявкаНаБронированиеСчета.ТолькоПроживание = ЛОЖЬ
				|			И ЗаявкаНаБронированиеСчета.ТолькоУслуги = ЛОЖЬ))
				|	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ЛОЖЬ
				|	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
			|)";


Если НЕ ТипыСчетов.Турагентство Тогда Перейти ~БЛОК_6; КонецЕсли;

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчета + "
					|ГДЕ
					|	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
					|	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
					|	И " + УсловиеТСГ + "
					|	И ЗаявкаНаБронированиеСчета.ДатаПо МЕЖДУ &ДатаПо_С И &ДатаПо_По
					|
					|УПОРЯДОЧИТЬ ПО
					|	РезервС,
					|	ЗаявкаНомер,
					|	ЗаявкаНаБронированиеСчета.НомерСчета";

Запрос.УстановитьПараметр("ДатаПо_С", ДатаМин_П);
Запрос.УстановитьПараметр("ДатаПо_По", ДатаМакс_П);
ТЗ = Запрос.Выполнить().Выгрузить();

МассивСтроки = Новый Массив;
ЗаявкаНомер = ""; СчетНомер = -1; 
Для Каждого Строка Из ТЗ Цикл
	
  	ДатаУчетаНДС = Строка.Заявка.РезервПо;
	СтавкаНДСТекущий = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);	
	Если СтавкаНДСТекущий = Перечисления.СтавкиНДС.БезНДС Тогда Продолжить; КонецЕсли;	

	ЗаявкаНомер = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Строка.ЗаявкаНомер);
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.СчетНомер, Строка.ДатаПо);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентИНН) Тогда
		Сообщить("Контрагент - Юр. лицо. Не заполнен ИНН у контрагента " + Строка.Контрагент + 
			". Выгрузка заявки " + ЗаявкаНомер + " от " + Строка.ЗаявкаДата + " ОТМЕНЯЕТСЯ.");
		Продолжить;
	КонецЕсли;  
	
	СтруктураДанные = Новый Структура("ТипЗаявки" 
		+ ", КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентНаименованиеЮрЛица"
		+ ", ЗаявкаНомер, ЗаявкаДата, СчетНомер, СчетДата, ДатаЗаезда, ДатаВыезда"
		+ ", ДокументНомер, ДокументДата"
		+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
		, "ТСГ"
		, Строка.Заявка.Бронирует.ИНН, Строка.Заявка.Бронирует.КПП
		, Строка.Заявка.Бронирует.Наименование, Строка.Заявка.Бронирует.НаименованиеЮрЛица
		, ЗаявкаНомер, Строка.ЗаявкаДата, Строка.СчетНомер, Строка.СчетДата, Строка.РезервС, Строка.РезервПо
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		);
		
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	Счета = Строка.Заявка.Счета.Выгрузить(ОтборСтроки); 
	Если Счета.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Счет = Счета[0];
	ТЗСтроки = ПечатьСервер.СчетФактураСтроки(Строка.Заявка, Счет);
	
	ТЗСтроки.Сортировать("ЭтоУслуга");
  
	//СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСЧислоТекущий);
	СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСТекущий);
	
	МассивСтрокиЗаявки = МассивСтроки(ТЗСтроки, "", СтавкаНДСЧислоТекущий);
	
	СтруктураДанные.Вставить("МассивСтрокиЗаявки", МассивСтрокиЗаявки); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;

~БЛОК_4:
Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчета + "
					|ГДЕ
					|	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
					|	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
					|	И " + УсловиеТСП + "
					|	И ЗаявкаНаБронированиеСчета.ДатаПо МЕЖДУ &ДатаПо_С И &ДатаПо_По
					|
					|УПОРЯДОЧИТЬ ПО
					|	РезервС,
					|	ЗаявкаНомер,
					|	ЗаявкаНаБронированиеСчета.НомерСчета";

Запрос.УстановитьПараметр("ДатаПо_С", ДатаМин_П);
Запрос.УстановитьПараметр("ДатаПо_По", ДатаМакс_П);
ТЗ = Запрос.Выполнить().Выгрузить();

МассивСтроки = Новый Массив;
ЗаявкаНомер = ""; СчетНомер = -1; 
Для Каждого Строка Из ТЗ Цикл  
 	ДатаУчетаНДС = Строка.Заявка.РезервПо;
	СтавкаНДСТекущий = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);  
	Если СтавкаНДСТекущий = Перечисления.СтавкиНДС.БезНДС Тогда Продолжить; КонецЕсли;	
	
	ЗаявкаНомер = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Строка.ЗаявкаНомер);
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.СчетНомер, Строка.ДатаПо);
	
	СтруктураДанные = Новый Структура("ТипЗаявки" 
		+ ", КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентНаименованиеЮрЛица"
		+ ", ЗаявкаНомер, ЗаявкаДата, СчетНомер, СчетДата, ДатаЗаезда, ДатаВыезда"
		+ ", ДокументНомер, ДокументДата"
		+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
		, "ТСП"
		, Строка.Заявка.Бронирует.ИНН, Строка.Заявка.Бронирует.КПП
		, Строка.Заявка.Бронирует.Наименование, Строка.Заявка.Бронирует.НаименованиеЮрЛица
		, ЗаявкаНомер, Строка.ЗаявкаДата, Строка.СчетНомер, Строка.СчетДата, Строка.РезервС, Строка.РезервПо
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		);
		
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	Счета = Строка.Заявка.Счета.Выгрузить(ОтборСтроки); 
	Если Счета.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Счет = Счета[0];
	ТЗСтроки = ПечатьСервер.СчетФактураСтроки(Строка.Заявка, Счет);
	
	ТЗСтроки.Сортировать("ЭтоУслуга");
	
	 //СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСЧислоТекущий);
 	СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСТекущий);

	МассивСтрокиЗаявки = МассивСтроки(ТЗСтроки, "", СтавкаНДСЧислоТекущий);
	
	СтруктураДанные.Вставить("МассивСтрокиЗаявки", МассивСтрокиЗаявки); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;

~БЛОК_5:
Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчета + "
					|ГДЕ
					|	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
					|	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
					|	И " + УсловиеТСФ + "
					|	И ЗаявкаНаБронированиеСчета.ДатаПо МЕЖДУ &ДатаПо_С И &ДатаПо_По
					|
					|УПОРЯДОЧИТЬ ПО
					|	РезервС,
					|	ЗаявкаНомер,
					|	ЗаявкаНаБронированиеСчета.НомерСчета";

Запрос.УстановитьПараметр("ДатаПо_С", ДатаМин_П);
Запрос.УстановитьПараметр("ДатаПо_По", ДатаМакс_П);
ТЗ = Запрос.Выполнить().Выгрузить();

МассивСтроки = Новый Массив;
ЗаявкаНомер = ""; СчетНомер = -1; 
Для Каждого Строка Из ТЗ Цикл  
	ДатаУчетаНДС = Строка.Заявка.РезервПо;
	СтавкаНДСТекущий = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);  
	Если СтавкаНДСТекущий = Перечисления.СтавкиНДС.БезНДС Тогда Продолжить; КонецЕсли;	
	
	ЗаявкаНомер = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Строка.ЗаявкаНомер);
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.СчетНомер, Строка.ДатаПо);
	
	СтруктураДанные = Новый Структура("ТипЗаявки" 
		+ ", КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентНаименованиеЮрЛица"
		+ ", ЗаявкаНомер, ЗаявкаДата, СчетНомер, СчетДата, ДатаЗаезда, ДатаВыезда"
		+ ", ДокументНомер, ДокументДата"
		+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
		, "ТСФ"
		, Строка.Заявка.Бронирует.ИНН, Строка.Заявка.Бронирует.КПП
		, Строка.Заявка.Бронирует.Наименование, Строка.Заявка.Бронирует.НаименованиеЮрЛица
		, ЗаявкаНомер, Строка.ЗаявкаДата, Строка.СчетНомер, Строка.СчетДата, Строка.РезервС, Строка.РезервПо
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		);
		
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	Счета = Строка.Заявка.Счета.Выгрузить(ОтборСтроки); 
	Если Счета.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Счет = Счета[0];
	ТЗСтроки = ПечатьСервер.СчетФактураСтроки(Строка.Заявка, Счет);
	
	ТЗСтроки.Сортировать("ЭтоУслуга");

	//СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСЧислоТекущий);
	СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСТекущий);
	
	МассивСтрокиЗаявки = МассивСтроки(ТЗСтроки, "", СтавкаНДСЧислоТекущий);
	
	СтруктураДанные.Вставить("МассивСтрокиЗаявки", МассивСтрокиЗаявки); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;
 

~БЛОК_6:
Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчета + "
					|ГДЕ
					|	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
					|	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
					| И НЕ (" + УсловиеФС + "
					|		ИЛИ " + УсловиеЮС + "
					|		ИЛИ " + УсловиеЮГ + "
					| 		ИЛИ " + УсловиеТСГ + "
					| 		ИЛИ " + УсловиеТСП + " 
					| 		ИЛИ " + УсловиеТСФ + ")
					| И ЗаявкаНаБронированиеСчета.ДатаПо МЕЖДУ &ДатаПо_С И &ДатаПо_По
					|
					|УПОРЯДОЧИТЬ ПО
					|	РезервС,
					|	ЗаявкаНомер,
					|	ЗаявкаНаБронированиеСчета.НомерСчета";

Запрос.УстановитьПараметр("ДатаПо_С", ДатаМин_П);
Запрос.УстановитьПараметр("ДатаПо_По", ДатаМакс_П);
ТЗ = Запрос.Выполнить().Выгрузить();

МассивСтроки = Новый Массив;
ЗаявкаНомер = ""; СчетНомер = -1; 
Для Каждого Строка Из ТЗ Цикл  
	ДатаУчетаНДС = Строка.Заявка.РезервПо;
	СтавкаНДСТекущий = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);  
	Если СтавкаНДСТекущий = Перечисления.СтавкиНДС.БезНДС Тогда Продолжить; КонецЕсли;	
	
	ЗаявкаНомер = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Строка.ЗаявкаНомер);
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.СчетНомер, Строка.ДатаПо);
	
	СтруктураДанные = Новый Структура("ТипЗаявки" 
		+ ", КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентНаименованиеЮрЛица"
		+ ", ЗаявкаНомер, ЗаявкаДата, СчетНомер, СчетДата, ДатаЗаезда, ДатаВыезда"
		+ ", ДокументНомер, ДокументДата"
		+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
		, "???"
		, Строка.Контрагент.ИНН, Строка.Контрагент.КПП
		, Строка.Контрагент.Наименование, Строка.Контрагент.НаименованиеЮрЛица
		, ЗаявкаНомер, Строка.ЗаявкаДата, Строка.СчетНомер, Строка.СчетДата, Строка.РезервС, Строка.РезервПо
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		);
		
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	Счета = Строка.Заявка.Счета.Выгрузить(ОтборСтроки); 
	Если Счета.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Счет = Счета[0];
	ТЗСтроки = ПечатьСервер.СчетФактураСтроки(Строка.Заявка, Счет);
	
	ТЗСтроки.Сортировать("ЭтоУслуга");
	
	//СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСЧислоТекущий);
	СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСТекущий);
	
	МассивСтрокиЗаявки = МассивСтроки(ТЗСтроки, "", СтавкаНДСЧислоТекущий);
	
	СтруктураДанные.Вставить("МассивСтрокиЗаявки", МассивСтрокиЗаявки); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;

~БЛОК_КОВОРКИНГ:
//Если СтавкаНДСКоворкинг = Перечисления.СтавкиНДС.БезНДС Тогда Перейти ~БЛОК_ПРЕДОПЛАТА; КонецЕсли;

УсловиеФКС =  "(
				|КоворкингСчета_1.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
			|)";

Если НЕ ТипыСчетов.ФизЛицоКоворкингСчет Тогда Перейти ~БЛОК_11; КонецЕсли;

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстКоворкингСчета + " 
					|ГДЕ
					|	КоворкингСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
					|	И " + УсловиеФКС + " 
					|	И КоворкингСчета.ДатаПо МЕЖДУ &ДатаПо_С И &ДатаПо_По
					|
					|УПОРЯДОЧИТЬ ПО
					|	ДатаПо,
					|	КоворкингСчетНомер";

Запрос.УстановитьПараметр("ДатаПо_С", ДатаМин);
Запрос.УстановитьПараметр("ДатаПо_По", ДатаМакс);
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл   
	ДатаУчетаНДС = Строка.ДатаПо;
	СтавкаНДСТекущий = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДСКоворкинг, ДатаУчетаНДС);  
	Если СтавкаНДСТекущий = Перечисления.СтавкиНДС.БезНДС Тогда Продолжить; КонецЕсли;	
	
	НомерДатаДокумента = КоворкингПечатьСервер.НомерДатаДокумента(Строка.КоворкингСчет);
	СчетНомер = НомерДатаДокумента.Номер;
	СчетДата = НомерДатаДокумента.Дата;
	
	//Если НЕ ЗначениеЗаполнено(Строка.КонтрагентИНН) Тогда
	//	Сообщить("Контрагент - Юр. лицо. Не заполнен ИНН у контрагента " + Строка.Контрагент + 
	//		". Выгрузка заявки " + ЗаявкаНомер + " от " + Строка.ЗаявкаДата + " ОТМЕНЯЕТСЯ.");
	//	Продолжить;
	//КонецЕсли;
	
	СтруктураДанные = Новый Структура("ТипЗаявки" 
		+ ", СчетНомер, СчетДата, ДатаС, ДатаПо"
		+ ", ДокументНомер, ДокументДата"
		+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
		, "ФКС"
		, СчетНомер, СчетДата, Строка.ДатаС, Строка.ДатаПо
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		);
		
	ИтогоСуммаБезНДС = 0;
	ИтогоСуммаНДС = 0;
	ИтогоСумма = 0;
	
	ТЗСтроки = КоворкингПечатьСервер.СчетФактураСтроки(Строка.КоворкингСчет, ИтогоСуммаБезНДС, ИтогоСуммаНДС, ИтогоСумма);
	
	ТЗСтроки.Сортировать("ЭтоУслуга");
	
	//СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСЧислоТекущий);
	СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСТекущий);

	МассивСтрокиЗаявки = МассивСтроки(ТЗСтроки, "", СтавкаНДСЧислоТекущий);
	
	СтруктураДанные.Вставить("МассивСтрокиЗаявки", МассивСтрокиЗаявки); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;


~БЛОК_11:

УсловиеФКС =  "(
				|КоворкингСчета_1.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
			|)";

Если НЕ ТипыСчетов.ЮрЛицоКоворкингСчет Тогда Перейти ~БЛОК_ПРЕДОПЛАТА; КонецЕсли;

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстКоворкингСчета + " 
					|ГДЕ
					|	КоворкингСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
					|	И " + УсловиеФКС + " 
					|	И КоворкингСчета.ДатаПо МЕЖДУ &ДатаПо_С И &ДатаПо_По
					|
					|УПОРЯДОЧИТЬ ПО
					|	ДатаПо,
					|	КоворкингСчетНомер";

Запрос.УстановитьПараметр("ДатаПо_С", ДатаМин);
Запрос.УстановитьПараметр("ДатаПо_По", ДатаМакс);
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ДатаУчетаНДС = Строка.ДатаПо;
	СтавкаНДСТекущий = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДСКоворкинг, ДатаУчетаНДС);  
	Если СтавкаНДСТекущий = Перечисления.СтавкиНДС.БезНДС Тогда Продолжить; КонецЕсли;	
	
	НомерДатаДокумента = КоворкингПечатьСервер.НомерДатаДокумента(Строка.КоворкингСчет);
	СчетНомер = НомерДатаДокумента.Номер;
	СчетДата = НомерДатаДокумента.Дата;
	
	Если НЕ ЗначениеЗаполнено(Строка.Контрагент.ИНН) Тогда
		Сообщить("Контрагент - Юр. лицо. Не заполнен ИНН у контрагента " + Строка.Контрагент + 
			". Выгрузка счета коворкинг " + СчетНомер + " от " + Формат(СчетДата, "ДФ=dd.MM.yy") + " ОТМЕНЯЕТСЯ.");
		Продолжить;
	КонецЕсли;
	
	СтруктураДанные = Новый Структура("ТипЗаявки" 
		+ ", КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентНаименованиеЮрЛица"
		+ ", СчетНомер, СчетДата, ДатаС, ДатаПо"
		+ ", ДокументНомер, ДокументДата"
		+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
		, "ЮКС"
		, Строка.Контрагент.ИНН, Строка.Контрагент.КПП, Строка.Контрагент.Наименование, Строка.Контрагент.НаименованиеЮрЛица
		, СчетНомер, СчетДата, Строка.ДатаС, Строка.ДатаПо
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		);
		
	ИтогоСуммаБезНДС = 0;
	ИтогоСуммаНДС = 0;
	ИтогоСумма = 0;
	
	ТЗСтроки = КоворкингПечатьСервер.СчетФактураСтроки(Строка.КоворкингСчет, ИтогоСуммаБезНДС, ИтогоСуммаНДС, ИтогоСумма);
	
	ТЗСтроки.Сортировать("ЭтоУслуга");
	
	//СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСЧислоТекущий);
	СтавкаНДСЧислоТекущий = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСТекущий);
	
	МассивСтрокиЗаявки = МассивСтроки(ТЗСтроки, "", СтавкаНДСЧислоТекущий);
	
	СтруктураДанные.Вставить("МассивСтрокиЗаявки", МассивСтрокиЗаявки); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;

Перейти ~БЛОК_ПРЕДОПЛАТА;

//////

~БЛОК_ПРЕДОПЛАТА:
Если НЕ ТипыСчетов.ЮрЛицоПредоплата Тогда Перейти ~БЛОК_21; КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК ЗаявкаНомер,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ЗаявкаДата,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.РезервС КАК РезервС,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.РезервПо КАК РезервПо,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеСчета.НомерСчета КАК СчетНомер,
                      |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК СчетДата,
                      |	ЗаявкаНаБронированиеСчета.Контрагент КАК Контрагент,
                      |	ЗаявкаНаБронированиеСчета.Клиент КАК Клиент,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.НаименованиеЮрЛица КАК КонтрагентНаименованиеЮрЛица,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.Наименование КАК КонтрагентНаименование,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.ИНН КАК КонтрагентИНН,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.КПП КАК КонтрагентКПП,
                      |	ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете,
                      |	РаспределениеОплаты.СуммаОплаты КАК СуммаОплаты
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК РаспределениеОплаты
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = РаспределениеОплаты.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = РаспределениеОплаты.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
                      |	И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |	И ЗаявкаНаБронированиеСчета.Контрагент.Турагентство = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
                      |	И ЗаявкаНаБронированиеСчета.ДатаСчета МЕЖДУ &ДатаСчета_С И &ДатаСчета_По
                      |	И РаспределениеОплаты.СуммаОплаты <> 0");


Запрос.УстановитьПараметр("ДатаСчета_С", ДатаМин);
Запрос.УстановитьПараметр("ДатаСчета_По", ДатаМакс);
ТЗ = Запрос.Выполнить().Выгрузить();
					  
Для Каждого Строка Из ТЗ Цикл
	ЗаявкаНомер = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Строка.ЗаявкаНомер);
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.СчетНомер, Строка.СчетДата);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентИНН) Тогда
		Сообщить("Контрагент - Юр. лицо. Не заполнен ИНН у контрагента " + Строка.Контрагент + 
			". Выгрузка заявки " + ЗаявкаНомер + " от " + Строка.ЗаявкаДата + " ОТМЕНЯЕТСЯ.");
		Продолжить;
	КонецЕсли;
	
	СтруктураДанные = Новый Структура("ТипЗаявки" 
		+ ", КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентНаименованиеЮрЛица"
		+ ", ДокументНомер, ДокументДата, ДатаЗаезда, ДатаВыезда, СчетНомер, СчетДата"
		+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
		+ ", СуммаПредоплаты"
		, "ЮП"
		, Строка.КонтрагентИНН, Строка.КонтрагентКПП, Строка.КонтрагентНаименование, Строка.КонтрагентНаименованиеЮрЛица
		, ЗаявкаНомер, Строка.ЗаявкаДата, Строка.РезервС, Строка.РезервПо, Строка.СчетНомер, Строка.СчетДата
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		, Строка.СуммаОплаты
		);
		
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;

~БЛОК_21:
/////       
// + Аудит
//Если НЕ ТипыСчетов.ЮрЛицоПредоплата Тогда Перейти ~БЛОК_22; КонецЕсли;
Если НЕ ТипыСчетов.ФизЛицоПредоплата Тогда Перейти ~БЛОК_22; КонецЕсли;
// - Аудит

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК ЗаявкаНомер,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ЗаявкаДата,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.РезервС КАК РезервС,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.РезервПо КАК РезервПо,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеСчета.НомерСчета КАК СчетНомер,
                      |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК СчетДата,
                      |	ЗаявкаНаБронированиеСчета.Контрагент КАК Контрагент,
                      |	ЗаявкаНаБронированиеСчета.Клиент КАК Клиент,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.НаименованиеЮрЛица КАК КонтрагентНаименованиеЮрЛица,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.Наименование КАК КонтрагентНаименование,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.ИНН КАК КонтрагентИНН,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.КПП КАК КонтрагентКПП,
                      |	ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете,
                      |	РаспределениеОплаты.СуммаОплаты КАК СуммаОплаты
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК РаспределениеОплаты
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = РаспределениеОплаты.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = РаспределениеОплаты.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
                      |	И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                      |	И ЗаявкаНаБронированиеСчета.Контрагент.Турагентство = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
                      |	И ЗаявкаНаБронированиеСчета.ДатаСчета МЕЖДУ &ДатаСчета_С И &ДатаСчета_По");

Запрос.УстановитьПараметр("ДатаСчета_С", ДатаМин);
Запрос.УстановитьПараметр("ДатаСчета_По", ДатаМакс);
ТЗ = Запрос.Выполнить().Выгрузить();
					  
Для Каждого Строка Из ТЗ Цикл
	ЗаявкаНомер = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Строка.ЗаявкаНомер);
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.СчетНомер, Строка.СчетДата);
	
	// + Аудит
	//Если НЕ ЗначениеЗаполнено(Строка.КонтрагентИНН) Тогда
	//	Сообщить("Контрагент - Юр. лицо. Не заполнен ИНН у контрагента " + Строка.Контрагент + 
	//		". Выгрузка заявки " + ЗаявкаНомер + " от " + Строка.ЗаявкаДата + " ОТМЕНЯЕТСЯ.");
	//	Продолжить;
	//КонецЕсли;
	// - Аудит
	
	СтруктураДанные = Новый Структура("ТипЗаявки" 
		+ ", КонтрагентНаименование"
		+ ", ДокументНомер, ДокументДата, ДатаЗаезда, ДатаВыезда, СчетНомер, СчетДата"
		+ ", НомерСчетаФактуры, ДатаСчетаФактуры"
		+ ", СуммаПредоплаты"
		, "ФП"
		, Строка.КонтрагентНаименование
		, ЗаявкаНомер, Строка.ЗаявкаДата, Строка.РезервС, Строка.РезервПо, Строка.СчетНомер, Строка.СчетДата
		, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата
		, Строка.СуммаОплаты
		);
		
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
КонецЦикла;

~БЛОК_22:                                          
////

~ВЫХОД:
ЗаписьJSON.ЗаписатьКонецМассива();

ЗаписьJSON.Закрыть();	
КонецФункции

Функция МассивСтроки(ТЗСтроки, СодержаниеДополнение, СтавкаНДСЧисло)
МассивСтроки = Новый Массив;
Для Каждого СтрокаТЗСтроки Из ТЗСтроки Цикл
	Содержание = СтрокаТЗСтроки.НаименованиеТовара + СодержаниеДополнение; 
	
	Если СтрокаТЗСтроки.СуммаНДС <> 0 Тогда
		СтавкаНДС = СтавкаНДСЧисло;
	Иначе
		СтавкаНДС = 0;
	КонецЕсли;
	
	СтрокаМассива = Новый Структура("Содержание, ЭтоУслуга, СтавкаНДС"
		+ ", СуммаНДС, СуммаБезНДС, СуммаСНДС"
		+ ", Количество, Цена, ДатаУслуги"
		, Содержание, СтрокаТЗСтроки.ЭтоУслуга, СтавкаНДС
		, СтрокаТЗСтроки.СуммаНДС, СтрокаТЗСтроки.СуммаБезНДС, СтрокаТЗСтроки.СуммаСНДС
		, СтрокаТЗСтроки.Количество, СтрокаТЗСтроки.Цена, СтрокаТЗСтроки.Дата
		);
		
	МассивСтроки.Добавить(СтрокаМассива);
КонецЦикла;
	
Возврат МассивСтроки;	
КонецФункции

