
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СписокСчета.ТекстЗапроса = ЗапросТекстСчета();
СписокГрупповыеСчета.ТекстЗапроса = ЗапросТекстГрупповыеСчета();
СписокПредоплата.ТекстЗапроса = ЗапросТекстСчетаПредоплаты();
СписокГрупповыеСчетаПредоплата.ТекстЗапроса = ЗапросТекстГрупповыеСчетаПредоплаты();

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();		
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;
СтавкаНДСОрганизация = ТекущаяОрганизация.СтавкаНДС; 
СтавкаНДСДо2026 = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДСОрганизация, '20251231');
СтавкаНДСЧислоДо2026 = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСДо2026);
СтавкаНДСПосле2026 = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДСОрганизация, '20260101');
СтавкаНДСЧислоПосле2026 = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСПосле2026);

СписокСчета.Параметры.УстановитьЗначениеПараметра("ДатаС", Неопределено);
СписокСчета.Параметры.УстановитьЗначениеПараметра("ДатаПо", Неопределено);

СписокСчета.Параметры.УстановитьЗначениеПараметра("ВсеСНДС", ВсеСНДС);
СписокСчета.Параметры.УстановитьЗначениеПараметра("СтавкаНДСДо2026", СтавкаНДСДо2026);
СписокСчета.Параметры.УстановитьЗначениеПараметра("СтавкаНДСЧислоДо2026", СтавкаНДСЧислоДо2026);
СписокСчета.Параметры.УстановитьЗначениеПараметра("СтавкаНДСПосле2026", СтавкаНДСПосле2026);
СписокСчета.Параметры.УстановитьЗначениеПараметра("СтавкаНДСЧислоПосле2026", СтавкаНДСЧислоПосле2026);

Поля = Новый Массив;
//Поля.Добавить("ТипДокумента");
//Поля.Добавить("ТипСчета");
Поля.Добавить("НомерСчетаФактуры");
Поля.Добавить("ДатаСчетаФактуры");
//Поля.Добавить("Стоимость");
//Поля.Добавить("СуммаНДС");

СписокСчета.УстановитьОграниченияИспользованияВГруппировке(Поля);
СписокСчета.УстановитьОграниченияИспользованияВОтборе(Поля);
СписокСчета.УстановитьОграниченияИспользованияВПорядке(Поля);

////
//СписокГрупповыеСчета.Параметры.УстановитьЗначениеПараметра("ДатаС", Неопределено);
//СписокГрупповыеСчета.Параметры.УстановитьЗначениеПараметра("ДатаПо", Неопределено);

//СписокГрупповыеСчета.Параметры.УстановитьЗначениеПараметра("ВсеСНДС", ВсеСНДС);
//СписокГрупповыеСчета.Параметры.УстановитьЗначениеПараметра("СтавкаНДС", СтавкаНДСЧисло);

//Поля = Новый Массив;
////Поля.Добавить("ТипДокумента");
////Поля.Добавить("ТипСчета");
//Поля.Добавить("НомерСчетаФактуры");
//Поля.Добавить("ДатаСчетаФактуры");
////Поля.Добавить("Стоимость");
////Поля.Добавить("СуммаНДС");

//СписокГрупповыеСчета.УстановитьОграниченияИспользованияВГруппировке(Поля);
//СписокГрупповыеСчета.УстановитьОграниченияИспользованияВОтборе(Поля);
//СписокГрупповыеСчета.УстановитьОграниченияИспользованияВПорядке(Поля);

////
//СписокПредоплата.Параметры.УстановитьЗначениеПараметра("ДатаС", Неопределено);
//СписокПредоплата.Параметры.УстановитьЗначениеПараметра("ДатаПо", Неопределено);

//СписокПредоплата.Параметры.УстановитьЗначениеПараметра("ВсеСНДС", ВсеСНДС);
//СписокПредоплата.Параметры.УстановитьЗначениеПараметра("СтавкаНДС", СтавкаНДСЧисло);

////Поля = Новый Массив;
//////Поля.Добавить("ТипДокумента");
//////Поля.Добавить("ТипСчета");
////Поля.Добавить("НомерСчетаФактуры");
////Поля.Добавить("ДатаСчетаФактуры");
//////Поля.Добавить("Стоимость");
//////Поля.Добавить("СуммаНДС");

////СписокГрупповыеСчета.УстановитьОграниченияИспользованияВГруппировке(Поля);
////СписокГрупповыеСчета.УстановитьОграниченияИспользованияВОтборе(Поля);
////СписокГрупповыеСчета.УстановитьОграниченияИспользованияВПорядке(Поля);

////
//СписокГрупповыеСчетаПредоплата.Параметры.УстановитьЗначениеПараметра("ДатаС", Неопределено);
//СписокГрупповыеСчетаПредоплата.Параметры.УстановитьЗначениеПараметра("ДатаПо", Неопределено);

//СписокГрупповыеСчетаПредоплата.Параметры.УстановитьЗначениеПараметра("ВсеСНДС", ВсеСНДС);
//СписокГрупповыеСчетаПредоплата.Параметры.УстановитьЗначениеПараметра("СтавкаНДС", СтавкаНДСЧисло);

////Поля = Новый Массив;
//////Поля.Добавить("ТипДокумента");
//////Поля.Добавить("ТипСчета");
////Поля.Добавить("НомерСчетаФактуры");
////Поля.Добавить("ДатаСчетаФактуры");
//////Поля.Добавить("Стоимость");
//////Поля.Добавить("СуммаНДС");

////СписокГрупповыеСчета.УстановитьОграниченияИспользованияВГруппировке(Поля);
////СписокГрупповыеСчета.УстановитьОграниченияИспользованияВОтборе(Поля);
////СписокГрупповыеСчета.УстановитьОграниченияИспользованияВПорядке(Поля);

КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
ДатыПроверка();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
ДатыПроверка();
КонецПроцедуры

&НаКлиенте
Функция ДатыПроверка()
Если НЕ ЗначениеЗаполнено(ДатаС) ИЛИ НЕ ЗначениеЗаполнено(ДатаПо) Тогда
	
	Возврат Истина;
КонецЕсли;	
	
Если НачалоМесяца(ДатаС) <> НачалоМесяца(ДатаПо) Тогда
	ПоказатьПредупреждение(, "Месяц Дата С <> Месяц Дата По");
	
	Возврат Истина;
КонецЕсли;	
	
Возврат Ложь;	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
Если НЕ ЗначениеЗаполнено(ДатаС) ИЛИ НЕ ЗначениеЗаполнено(ДатаПо) Тогда
	ПоказатьПредупреждение(, "Дата С или Дата По - пусто");
	
	Возврат;
КонецЕсли;		

СписокСчета.Параметры.УстановитьЗначениеПараметра("ДатаС", ДатаС);
СписокСчета.Параметры.УстановитьЗначениеПараметра("ДатаПо", ДатаПо);

СписокГрупповыеСчета.Параметры.УстановитьЗначениеПараметра("ДатаС", ДатаС);
СписокГрупповыеСчета.Параметры.УстановитьЗначениеПараметра("ДатаПо", ДатаПо);

СписокПредоплата.Параметры.УстановитьЗначениеПараметра("ДатаС", ДатаС);
СписокПредоплата.Параметры.УстановитьЗначениеПараметра("ДатаПо", ДатаПо);

СписокГрупповыеСчетаПредоплата.Параметры.УстановитьЗначениеПараметра("ДатаС", ДатаС);
СписокГрупповыеСчетаПредоплата.Параметры.УстановитьЗначениеПараметра("ДатаПо", ДатаПо);

Отчет = ТабДок(); 	
КонецПроцедуры

&НаСервере
Функция ЗапросТекстСчета()
ЗапросТекстСчета = "ВЫБРАТЬ
                   |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует КАК Бронирует,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК НомерЗаявки,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ДатаЗаявки,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервС КАК ДатаЗаезда,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервПо КАК ДатаВыезда,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
                   |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                   |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                   |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаС,
                   |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаПо,
                   |	ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет КАК ЭтоПредварительныйГрупповойСчет,
                   |	ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
                   |	ЗаявкаНаБронированиеСчета.Клиент КАК Гость,
                   |	ЗаявкаНаБронированиеСчета.Контрагент КАК Плательщик,
                   |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                   |	ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете,
                   |	РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) КАК КоличествоНочей,
                   |	ВЫБОР
                   |		КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |			ТОГДА ЛОЖЬ
                   |		ИНАЧЕ ИСТИНА
                   |	КОНЕЦ КАК ЕстьСчетТурагентству,
                   |	ВЫБОР
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Счет Юрлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Прямой счет Турагентству""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                   |				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Входит в групповой счет Юрлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |					И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |				ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |					И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |					И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |							ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |					И (ВЫБОР
                   |							КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |								ТОГДА ЛОЖЬ
                   |							ИНАЧЕ ИСТИНА
                   |						КОНЕЦ
                   |						ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%"")
                   |			ТОГДА ""Счет Физлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И НЕ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%""
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |				И НЕ ВЫБОР
                   |						КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |							ТОГДА ЛОЖЬ
                   |						ИНАЧЕ ИСТИНА
                   |					КОНЕЦ
                   |			ТОГДА ""Прямой счет Физлицу (бронирует Турагентство)""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Входит в Групповой счет Турагентству""
                   |		ИНАЧЕ ""НЕ ОПРЕДЕЛЕНО""
                   |	КОНЕЦ КАК ТипДокумента,
                   |	ВЫБОР
                   |		КОГДА СчетаДолги.УслугаМин = 0
                   |				И СчетаДолги.УслугаМакс = 0
                   |			ТОГДА ""П""
                   |		КОГДА СчетаДолги.УслугаМин = 1
                   |				И СчетаДолги.УслугаМакс = 1
                   |			ТОГДА ""У""
                   |		ИНАЧЕ ""П и У""
                   |	КОНЕЦ КАК ТипСчета,
                   |	ВЫРАЗИТЬ(NULL КАК СТРОКА) КАК НомерСчетаФактуры,
                   |	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(NULL КАК ДАТА), ДЕНЬ) КАК ДатаСчетаФактуры,
                   |	ВЫБОР
                   |		КОГДА ЗаявкаНаБронированиеСчета.СвернутьВСчете
                   |				И НЕ &ВсеСНДС
                   |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
                   |		ИНАЧЕ ВЫБОР
                   |				КОГДА ЗаявкаНаБронированиеСчета.ДатаПо < ДАТАВРЕМЯ(2026, 1, 1)
                   |					ТОГДА &СтавкаНДСДо2026
                   |				ИНАЧЕ &СтавкаНДСПосле2026
                   |			КОНЕЦ
                   |	КОНЕЦ КАК СтавкаНДС,
                   |	ВЫБОР
                   |		КОГДА ЗаявкаНаБронированиеСчета.СвернутьВСчете
                   |				И НЕ &ВсеСНДС
                   |			ТОГДА 0
                   |		ИНАЧЕ ВЫБОР
                   |				КОГДА ЗаявкаНаБронированиеСчета.ДатаПо < ДАТАВРЕМЯ(2026, 1, 1)
                   |					ТОГДА СчетаДолги.СуммаБазаНДС * (&СтавкаНДСЧислоДо2026 / (100 + &СтавкаНДСЧислоДо2026))
                   |				ИНАЧЕ СчетаДолги.СуммаБазаНДС * (&СтавкаНДСЧислоПосле2026 / (100 + &СтавкаНДСЧислоПосле2026))
                   |			КОНЕЦ
                   |	КОНЕЦ КАК СуммаНДС,
                   |	СчетаДолги.СуммаДолг КАК Стоимость,
                   |	СчетаДолги.СуммаОплачено КАК СуммаОплачено,
                   |	СчетаДолги.СуммаДолг КАК СуммаДолг,
                   |	СчетаДолги.УслугаМин КАК УслугаМин,
                   |	СчетаДолги.УслугаМакс КАК УслугаМакс
                   |ИЗ
                   |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                   |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
                   |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено) КАК СуммаОплачено,
                   |			СУММА(ВЫРАЗИТЬ(ВЫБОР
                   |						КОГДА &ВсеСНДС
                   |							ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг
                   |						ИНАЧЕ ВЫБОР
                   |								КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС
                   |									ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг
                   |								ИНАЧЕ 0
                   |							КОНЕЦ
                   |					КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаБазаНДС,
                   |			МИНИМУМ(ВЫБОР
                   |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                   |						ТОГДА 1
                   |					ИНАЧЕ 0
                   |				КОНЕЦ) КАК УслугаМин,
                   |			МАКСИМУМ(ВЫБОР
                   |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                   |						ТОГДА 1
                   |					ИНАЧЕ 0
                   |				КОНЕЦ) КАК УслугаМакс
                   |		ИЗ
                   |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                   |		
                   |		СГРУППИРОВАТЬ ПО
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДолги
                   |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДолги.Ссылка
                   |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДолги.СчетГУИД
                   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |			ЗаявкаНаБронированиеСчета.Ссылка КАК ЕстьДанные
                   |		ИЗ
                   |			Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ГДЕ
                   |			ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                   |		
                   |		СГРУППИРОВАТЬ ПО
                   |			ЗаявкаНаБронированиеСчета.Ссылка) КАК СчетаБронируетРавноКонтрагент
                   |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаБронируетРавноКонтрагент.ЕстьДанные
                   |ГДЕ
                   |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                   |	И НЕ(ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                   |				ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования))
                   |	И ЗаявкаНаБронированиеСчета.ДатаПо >= &ДатаС
                   |	И ЗаявкаНаБронированиеСчета.ДатаПо <= &ДатаПо
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	ДатаПо,
                   |	НомерЗаявки,
                   |	НомерСчета";

Возврат ЗапросТекстСчета;
КонецФункции


&НаСервере
Функция ЗапросТекстСчета_22()
ЗапросТекстСчета = "ВЫБРАТЬ
                   |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует КАК Бронирует,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК НомерЗаявки,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ДатаЗаявки,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервС КАК ДатаЗаезда,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервПо КАК ДатаВыезда,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
                   |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                   |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                   |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаС,
                   |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаПо,
                   |	ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет КАК ЭтоПредварительныйГрупповойСчет,
                   |	ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
                   |	ЗаявкаНаБронированиеСчета.Клиент КАК Гость,
                   |	ЗаявкаНаБронированиеСчета.Контрагент КАК Плательщик,
                   |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                   |	ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете,
                   |	РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) КАК КоличествоНочей,
                   |	ВЫБОР
                   |		КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |			ТОГДА ЛОЖЬ
                   |		ИНАЧЕ ИСТИНА
                   |	КОНЕЦ КАК ЕстьСчетТурагентству,
                   |	ВЫБОР
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Счет Юрлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Прямой счет Турагентству""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                   |				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Входит в групповой счет Юрлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |					И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |				ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |					И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |					И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |							ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |					И (ВЫБОР
                   |							КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |								ТОГДА ЛОЖЬ
                   |							ИНАЧЕ ИСТИНА
                   |						КОНЕЦ
                   |						ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%"")
                   |			ТОГДА ""Счет Физлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И НЕ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%""
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |				И НЕ ВЫБОР
                   |						КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |							ТОГДА ЛОЖЬ
                   |						ИНАЧЕ ИСТИНА
                   |					КОНЕЦ
                   |			ТОГДА ""Прямой счет Физлицу (бронирует Турагентство)""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Входит в Групповой счет Турагентству""
                   |		ИНАЧЕ ""НЕ ОПРЕДЕЛЕНО""
                   |	КОНЕЦ КАК ТипДокумента,
                   |	ВЫБОР
                   |		КОГДА СчетаДолги.УслугаМин = 0
                   |				И СчетаДолги.УслугаМакс = 0
                   |			ТОГДА ""П""
                   |		КОГДА СчетаДолги.УслугаМин = 1
                   |				И СчетаДолги.УслугаМакс = 1
                   |			ТОГДА ""У""
                   |		ИНАЧЕ ""П и У""
                   |	КОНЕЦ КАК ТипСчета,
                   |	ВЫРАЗИТЬ(NULL КАК СТРОКА) КАК НомерСчетаФактуры,
                   |	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(NULL КАК ДАТА), ДЕНЬ) КАК ДатаСчетаФактуры,
                   |	ВЫБОР
                   |		КОГДА ЗаявкаНаБронированиеСчета.СвернутьВСчете
                   |			ТОГДА ВЫБОР
                   |					КОГДА &ВсеСНДС
                   |						ТОГДА ВЫБОР
                   |								КОГДА ЗаявкаНаБронированиеСчета.ДатаПо < ДАТАВРЕМЯ(2026, 1, 1)
                   |										И &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
                   |									ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
                   |								ИНАЧЕ &СтавкаНДСОрганизация
                   |							КОНЕЦ
                   |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
                   |				КОНЕЦ
                   |		ИНАЧЕ ВЫБОР
                   |				КОГДА ЗаявкаНаБронированиеСчета.ДатаПо < ДАТАВРЕМЯ(2026, 1, 1)
                   |						И &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
                   |					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
                   |				ИНАЧЕ &СтавкаНДСОрганизация
                   |			КОНЕЦ
                   |	КОНЕЦ КАК СтавкаНДС,
                   |	ВЫБОР
                   |		КОГДА ЗаявкаНаБронированиеСчета.СвернутьВСчете
                   |			ТОГДА СчетаДолги.СуммаБазаНДС * ВЫБОР
                   |					КОГДА &ВсеСНДС
                   |						ТОГДА ВЫБОР
                   |								КОГДА ЗаявкаНаБронированиеСчета.ДатаПо < ДАТАВРЕМЯ(2026, 1, 1)
                   |										И &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
                   |									ТОГДА 0.2 / 1.2
                   |								ИНАЧЕ ВЫБОР
                   |										КОГДА &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
                   |												ИЛИ &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
                   |												ИЛИ &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
                   |											ТОГДА 0
                   |										КОГДА &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
                   |											ТОГДА 0.05 / 1.05
                   |										КОГДА &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
                   |											ТОГДА 0.2 / 1.2
                   |										КОГДА &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
                   |											ТОГДА 0.22 / 1.22
                   |									КОНЕЦ
                   |							КОНЕЦ
                   |					ИНАЧЕ 0
                   |				КОНЕЦ
                   |		ИНАЧЕ СчетаДолги.СуммаБазаНДС * ВЫБОР
                   |				КОГДА ЗаявкаНаБронированиеСчета.ДатаПо < ДАТАВРЕМЯ(2026, 1, 1)
                   |						И &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
                   |					ТОГДА 0.2 / 1.2
                   |				ИНАЧЕ ВЫБОР
                   |						КОГДА &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
                   |								ИЛИ &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
                   |								ИЛИ &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
                   |							ТОГДА 0
                   |						КОГДА &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
                   |							ТОГДА 0.05 / 1.05
                   |						КОГДА &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
                   |							ТОГДА 0.2 / 1.2
                   |						КОГДА &СтавкаНДСОрганизация = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
                   |							ТОГДА 0.22 / 1.22
                   |					КОНЕЦ
                   |			КОНЕЦ
                   |	КОНЕЦ КАК СуммаНДС,
                   |	СчетаДолги.СуммаДолг КАК Стоимость,
                   |	СчетаДолги.СуммаОплачено КАК СуммаОплачено,
                   |	СчетаДолги.СуммаДолг КАК СуммаДолг,
                   |	СчетаДолги.УслугаМин КАК УслугаМин,
                   |	СчетаДолги.УслугаМакс КАК УслугаМакс
                   |ИЗ
                   |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                   |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
                   |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено) КАК СуммаОплачено,
                   |			СУММА(ВЫРАЗИТЬ(ВЫБОР
                   |						КОГДА &ВсеСНДС
                   |							ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг
                   |						ИНАЧЕ ВЫБОР
                   |								КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС
                   |									ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг
                   |								ИНАЧЕ 0
                   |							КОНЕЦ
                   |					КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаБазаНДС,
                   |			МИНИМУМ(ВЫБОР
                   |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                   |						ТОГДА 1
                   |					ИНАЧЕ 0
                   |				КОНЕЦ) КАК УслугаМин,
                   |			МАКСИМУМ(ВЫБОР
                   |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                   |						ТОГДА 1
                   |					ИНАЧЕ 0
                   |				КОНЕЦ) КАК УслугаМакс
                   |		ИЗ
                   |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                   |		
                   |		СГРУППИРОВАТЬ ПО
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДолги
                   |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДолги.Ссылка
                   |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДолги.СчетГУИД
                   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |			ЗаявкаНаБронированиеСчета.Ссылка КАК ЕстьДанные
                   |		ИЗ
                   |			Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ГДЕ
                   |			ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                   |		
                   |		СГРУППИРОВАТЬ ПО
                   |			ЗаявкаНаБронированиеСчета.Ссылка) КАК СчетаБронируетРавноКонтрагент
                   |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаБронируетРавноКонтрагент.ЕстьДанные
                   |ГДЕ
                   |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                   |	И НЕ(ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                   |				ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования))
                   |	И ЗаявкаНаБронированиеСчета.ДатаПо >= &ДатаС
                   |	И ЗаявкаНаБронированиеСчета.ДатаПо <= &ДатаПо
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	ДатаПо,
                   |	НомерЗаявки,
                   |	НомерСчета";

Возврат ЗапросТекстСчета;
КонецФункции

&НаСервере
Функция ЗапросТекстСчета_111()
ЗапросТекстСчета = "ВЫБРАТЬ
                   |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует КАК Бронирует,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК НомерЗаявки,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ДатаЗаявки,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервС КАК ДатаЗаезда,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервПо КАК ДатаВыезда,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
                   |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                   |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                   |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаС,
                   |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаПо,
                   |	ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет КАК ЭтоПредварительныйГрупповойСчет,
                   |	ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
                   |	ЗаявкаНаБронированиеСчета.Клиент КАК Гость,
                   |	ЗаявкаНаБронированиеСчета.Контрагент КАК Плательщик,
                   |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                   |	ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете,
                   |	РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) КАК КоличествоНочей,
                   |	ВЫБОР
                   |		КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |			ТОГДА ЛОЖЬ
                   |		ИНАЧЕ ИСТИНА
                   |	КОНЕЦ КАК ЕстьСчетТурагентству,
                   |	ВЫБОР
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Счет Юрлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Прямой счет Турагентству""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                   |				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Входит в групповой счет Юрлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |					И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |				ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |					И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |					И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |							ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |					И (ВЫБОР
                   |							КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |								ТОГДА ЛОЖЬ
                   |							ИНАЧЕ ИСТИНА
                   |						КОНЕЦ
                   |						ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%"")
                   |			ТОГДА ""Счет Физлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И НЕ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%""
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |				И НЕ ВЫБОР
                   |						КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |							ТОГДА ЛОЖЬ
                   |						ИНАЧЕ ИСТИНА
                   |					КОНЕЦ
                   |			ТОГДА ""Прямой счет Физлицу (бронирует Турагентство)""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Входит в Групповой счет Турагентству""
                   |		ИНАЧЕ ""НЕ ОПРЕДЕЛЕНО""
                   |	КОНЕЦ КАК ТипДокумента,
                   |	ВЫБОР
                   |		КОГДА СчетаДолги.УслугаМин = 0
                   |				И СчетаДолги.УслугаМакс = 0
                   |			ТОГДА ""П""
                   |		КОГДА СчетаДолги.УслугаМин = 1
                   |				И СчетаДолги.УслугаМакс = 1
                   |			ТОГДА ""У""
                   |		ИНАЧЕ ""П и У""
                   |	КОНЕЦ КАК ТипСчета,
                   |	ВЫРАЗИТЬ(NULL КАК СТРОКА) КАК НомерСчетаФактуры,
                   |	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(NULL КАК ДАТА), ДЕНЬ) КАК ДатаСчетаФактуры,
				   //|	ВЫБОР
				   //|		КОГДА ЗаявкаНаБронированиеСчета.СвернутьВСчете
				   //|			ТОГДА 0
				   //|		ИНАЧЕ СчетаДолги.СуммаНДС
				   //|	КОНЕЦ КАК СуммаНДС,
                   |	СчетаДолги.СуммаДолг КАК Стоимость,
                   |	СчетаДолги.СуммаОплачено КАК СуммаОплачено,
                   |	СчетаДолги.СуммаДолг КАК СуммаДолг,
                   |	СчетаДолги.УслугаМин КАК УслугаМин,
                   |	СчетаДолги.УслугаМакс КАК УслугаМакс
                   |ИЗ
                   |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                   |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
                   |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено) КАК СуммаОплачено,
				   //|			СУММА(ВЫРАЗИТЬ(ВЫБОР
				   //|						КОГДА &ВсеСНДС
				   //|							ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДСОрганизация / (100 + &СтавкаНДСОрганизация))
				   //|						ИНАЧЕ ВЫБОР
				   //|								КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС
				   //|									ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДСОрганизация / (100 + &СтавкаНДСОрганизация))
				   //|								ИНАЧЕ 0
				   //|							КОНЕЦ
				   //|					КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
                   |			МИНИМУМ(ВЫБОР
                   |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                   |						ТОГДА 1
                   |					ИНАЧЕ 0
                   |				КОНЕЦ) КАК УслугаМин,
                   |			МАКСИМУМ(ВЫБОР
                   |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                   |						ТОГДА 1
                   |					ИНАЧЕ 0
                   |				КОНЕЦ) КАК УслугаМакс
                   |		ИЗ
                   |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                   |		
                   |		СГРУППИРОВАТЬ ПО
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДолги
                   |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДолги.Ссылка
                   |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДолги.СчетГУИД
                   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |			ЗаявкаНаБронированиеСчета.Ссылка КАК ЕстьДанные
                   |		ИЗ
                   |			Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ГДЕ
                   |			ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                   |		
                   |		СГРУППИРОВАТЬ ПО
                   |			ЗаявкаНаБронированиеСчета.Ссылка) КАК СчетаБронируетРавноКонтрагент
                   |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаБронируетРавноКонтрагент.ЕстьДанные
                   |ГДЕ
                   |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                   |	И НЕ(ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                   |				ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования))
                   |	И ЗаявкаНаБронированиеСчета.ДатаПо >= &ДатаС
                   |	И ЗаявкаНаБронированиеСчета.ДатаПо <= &ДатаПо
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	ДатаПо,
                   |	НомерЗаявки,
                   |	НомерСчета";

Возврат ЗапросТекстСчета;
КонецФункции

&НаСервере
Функция ЗапросТекстСчета_1()
ЗапросТекстСчета = "ВЫБРАТЬ
                   |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует КАК Бронирует,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК НомерЗаявки,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ДатаЗаявки,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервС КАК ДатаЗаезда,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.РезервПо КАК ДатаВыезда,
                   |	ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
                   |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                   |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                   |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаС,
                   |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаПо,
                   |	ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет КАК ЭтоПредварительныйГрупповойСчет,
                   |	ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
                   |	ЗаявкаНаБронированиеСчета.Клиент КАК Гость,
                   |	ЗаявкаНаБронированиеСчета.Контрагент КАК Плательщик,
                   |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                   |	ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете,
                   |	РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) КАК КоличествоНочей,
                   |	ВЫБОР
                   |		КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |			ТОГДА ЛОЖЬ
                   |		ИНАЧЕ ИСТИНА
                   |	КОНЕЦ КАК ЕстьСчетТурагентству,
                   |	ВЫБОР
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Счет Юрлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Прямой счет Турагентству""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                   |				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Входит в групповой счет Юрлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
                   |					И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |				ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |					И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |					И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |							ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |					И (ВЫБОР
                   |							КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |								ТОГДА ЛОЖЬ
                   |							ИНАЧЕ ИСТИНА
                   |						КОНЕЦ
                   |						ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%"")
                   |			ТОГДА ""Счет Физлицу""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И НЕ ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Наименование ПОДОБНО ""%сайт%""
                   |				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                   |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |				И НЕ ВЫБОР
                   |						КОГДА СчетаБронируетРавноКонтрагент.ЕстьДанные ЕСТЬ NULL
                   |							ТОГДА ЛОЖЬ
                   |						ИНАЧЕ ИСТИНА
                   |					КОНЕЦ
                   |			ТОГДА ""Прямой счет Физлицу (бронирует Турагентство)""
                   |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
                   |				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                   |					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                   |			ТОГДА ""Входит в Групповой счет Турагентству""
                   |		ИНАЧЕ ""НЕ ОПРЕДЕЛЕНО""
                   |	КОНЕЦ КАК ТипДокумента,
                   |	ВЫБОР
                   |		КОГДА СчетаДолги.УслугаМин = 0
                   |				И СчетаДолги.УслугаМакс = 0
                   |			ТОГДА ""П""
                   |		КОГДА СчетаДолги.УслугаМин = 1
                   |				И СчетаДолги.УслугаМакс = 1
                   |			ТОГДА ""У""
                   |		ИНАЧЕ ""П и У""
                   |	КОНЕЦ КАК ТипСчета,
                   |	ВЫРАЗИТЬ(NULL КАК СТРОКА) КАК НомерСчетаФактуры,
                   |	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(NULL КАК ДАТА), ДЕНЬ) КАК ДатаСчетаФактуры,
                   |	ВЫБОР
                   |		КОГДА ЗаявкаНаБронированиеСчета.СвернутьВСчете
                   |			ТОГДА 0
                   |		ИНАЧЕ СчетаДолги.СуммаНДС
                   |	КОНЕЦ КАК СуммаНДС,
                   |	СчетаДолги.СуммаДолг КАК Стоимость,
                   |	СчетаДолги.СуммаОплачено КАК СуммаОплачено,
                   |	СчетаДолги.СуммаДолг КАК СуммаДолг,
                   |	СчетаДолги.УслугаМин КАК УслугаМин,
                   |	СчетаДолги.УслугаМакс КАК УслугаМакс
                   |ИЗ
                   |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                   |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
                   |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено) КАК СуммаОплачено,
                   |			СУММА(ВЫРАЗИТЬ(ВЫБОР
                   |						КОГДА &ВсеСНДС
                   |							ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДС / (100 + &СтавкаНДС))
                   |						ИНАЧЕ ВЫБОР
                   |								КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС
                   |									ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДС / (100 + &СтавкаНДС))
                   |								ИНАЧЕ 0
                   |							КОНЕЦ
                   |					КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
                   |			МИНИМУМ(ВЫБОР
                   |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                   |						ТОГДА 1
                   |					ИНАЧЕ 0
                   |				КОНЕЦ) КАК УслугаМин,
                   |			МАКСИМУМ(ВЫБОР
                   |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                   |						ТОГДА 1
                   |					ИНАЧЕ 0
                   |				КОНЕЦ) КАК УслугаМакс
                   |		ИЗ
                   |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                   |		
                   |		СГРУППИРОВАТЬ ПО
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                   |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДолги
                   |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДолги.Ссылка
                   |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДолги.СчетГУИД
                   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                   |			ЗаявкаНаБронированиеСчета.Ссылка КАК ЕстьДанные
                   |		ИЗ
                   |			Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                   |		ГДЕ
                   |			ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                   |		
                   |		СГРУППИРОВАТЬ ПО
                   |			ЗаявкаНаБронированиеСчета.Ссылка) КАК СчетаБронируетРавноКонтрагент
                   |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаБронируетРавноКонтрагент.ЕстьДанные
                   |ГДЕ
                   |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                   |	И НЕ(ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                   |				ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования))
                   |	И ЗаявкаНаБронированиеСчета.ДатаПо >= &ДатаС
                   |	И ЗаявкаНаБронированиеСчета.ДатаПо <= &ДатаПо
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	ДатаПо,
                   |	НомерЗаявки,
                   |	НомерСчета";

Возврат ЗапросТекстСчета;
КонецФункции


&НаСервере
Функция ЗапросТекстГрупповыеСчета()
ЗапросТекстГрупповыеСчета =	
"ВЫБРАТЬ
|	ГрупповыеСчета.Ссылка КАК ГрупповойСчет,
|	ГрупповыеСчета.НомерСчета КАК НомерСчета,
|	ГрупповыеСчета.ДатаСчета КАК ДатаСчета,
|	ГрупповыеСчета.ДатаДокумента КАК ДатаДокумента,
|	ГрупповыеСчета.Контрагент КАК Контрагент,
|	ГрупповыеСчета.Контрагент.ТипКлиента КАК ТипКонтрагента,
|	ВЫБОР
|		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
|			ТОГДА ""Гр. счет Физлицу""
|		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
|				И НЕ ГрупповыеСчета.Контрагент.Турагентство
|			ТОГДА ""Гр. счет Юрлицу""
|		КОГДА ГрупповыеСчета.Контрагент.Турагентство
|			ТОГДА ""Гр. Cчет Турагентству""
|	КОНЕЦ КАК ТипДокумента,
|	ВЫРАЗИТЬ(NULL КАК СТРОКА(100)) КАК НомерСчетаФактуры,
|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(NULL КАК ДАТА), ДЕНЬ) КАК ДатаСчетаФактуры,
|	ГрупповойСчетДолги.СуммаДолг КАК СуммаДолг,
|	ГрупповойСчетДолги.СуммаНДС КАК СуммаНДС,
|	ГрупповойСчетДолги.ЕстьОшибки КАК ЕстьОшибки,
|	ГрупповойСчетДолги.ЕстьБронь КАК ЕстьБронь,
|	ЕСТЬNULL(Оплаты.СуммаРаспределено, 0) КАК СуммаОплачено
|ИЗ
|	Документ.ГрупповыеСчета КАК ГрупповыеСчета
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
|			МАКСИМУМ(ВЫБОР
|					КОГДА СчетаДолги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
|							ИЛИ СчетаДолги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
|						ТОГДА 1
|					ИНАЧЕ 0
|				КОНЕЦ) КАК ЕстьОшибки,
|			МАКСИМУМ(ВЫБОР
|					КОГДА СчетаДолги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
|						ТОГДА 1
|					ИНАЧЕ 0
|				КОНЕЦ) КАК ЕстьБронь,
|			МАКСИМУМ(ВЫБОР
|					КОГДА СчетаДолги.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
|						ТОГДА 1
|					ИНАЧЕ 0
|				КОНЕЦ) КАК НетБрони,
|			СУММА(СчетаДолги.СуммаДолг) КАК СуммаДолг,
|			СУММА(СчетаДолги.СуммаНДС) КАК СуммаНДС
|		ИЗ
|			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|					ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
|					ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
|					ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
|					ВЫБОР
|						КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
|								ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
|								ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
|							ТОГДА 0
|						ИНАЧЕ ЗаявкиСчетаДолги.СуммаДолг
|					КОНЕЦ КАК СуммаДолг,
|					ВЫБОР
|						КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
|								ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
|								ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
|							ТОГДА 0
|						ИНАЧЕ ВЫБОР
|								КОГДА ЗаявкаНаБронированиеСчета.СвернутьВСчете
|									ТОГДА 0
|								ИНАЧЕ ЗаявкиСчетаДолги.СуммаНДС
|							КОНЕЦ
|					КОНЕЦ КАК СуммаНДС
|				ИЗ
|					Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|							ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
|							ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
|							СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
|							СУММА(ВЫРАЗИТЬ(ВЫБОР
|										КОГДА &ВсеСНДС
|											ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДС / (100 + &СтавкаНДС))
|										ИНАЧЕ ВЫБОР
|												КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС
|													ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДС / (100 + &СтавкаНДС))
|												ИНАЧЕ 0
|											КОНЕЦ
|									КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДС
|						ИЗ
|							Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
|						
|						СГРУППИРОВАТЬ ПО
|							ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
|							ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ЗаявкиСчетаДолги
|						ПО ЗаявкаНаБронированиеСчета.Ссылка = ЗаявкиСчетаДолги.Ссылка
|							И ЗаявкаНаБронированиеСчета.СчетГУИД = ЗаявкиСчетаДолги.СчетГУИД) КАК СчетаДолги
|				ПО ГрупповыеСчетаДокументыДолги.ДокументДолг = СчетаДолги.Ссылка
|					И ГрупповыеСчетаДокументыДолги.СчетГУИД = СчетаДолги.СчетГУИД
|		
|		СГРУППИРОВАТЬ ПО
|			ГрупповыеСчетаДокументыДолги.Ссылка) КАК ГрупповойСчетДолги
|		ПО ГрупповыеСчета.Ссылка = ГрупповойСчетДолги.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ГрупповыеСчетаДокументыОплаты.Ссылка КАК Ссылка,
|			СУММА(ГрупповыеСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
|		ИЗ
|			Документ.ГрупповыеСчета.ДокументыОплаты КАК ГрупповыеСчетаДокументыОплаты
|		
|		СГРУППИРОВАТЬ ПО
|			ГрупповыеСчетаДокументыОплаты.Ссылка) КАК Оплаты
|		ПО ГрупповыеСчета.Ссылка = Оплаты.Ссылка
|ГДЕ
|	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
|	И ГрупповыеСчета.Контрагент.Турагентство = ЛОЖЬ
|	И ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
|	И ГрупповыеСчета.ДатаДокумента >= &ДатаС
|	И ГрупповыеСчета.ДатаДокумента <= &ДатаПо
|
|УПОРЯДОЧИТЬ ПО
|	ГрупповыеСчета.ДатаДокумента";

Возврат ЗапросТекстГрупповыеСчета;
КонецФункции

&НаСервере
Функция ЗапросТекстСчетаПредоплаты()
ЗапросТекстСчетаПредоплаты = "ВЫБРАТЬ
                             |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
                             |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК НомерЗаявки,
                             |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ДатаЗаявки,
                             |	ЗаявкаНаБронированиеСчета.Ссылка.РезервС КАК РезервС,
                             |	ЗаявкаНаБронированиеСчета.Ссылка.РезервПо КАК РезервПо,
                             |	ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
                             |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                             |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                             |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаС,
                             |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаПо,
                             |	ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет КАК ЭтоПредварительныйГрупповойСчет,
                             |	ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
                             |	ЗаявкаНаБронированиеСчета.Клиент КАК Гость,
                             |	ЗаявкаНаБронированиеСчета.Контрагент КАК Плательщик,
                             |	ЗаявкаНаБронированиеСчета.Ссылка.КолВоДней КАК КоличествоНочей,
                             |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                             |	ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете,
                             |	ВЫБОР
                             |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                             |			ТОГДА ""Счет Физлицу""
                             |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                             |				И НЕ ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                             |				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                             |						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                             |			ТОГДА ""Счет Юрлицу""
                             |		КОГДА НЕ ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                             |				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
                             |					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
                             |			ТОГДА ""Входит в групповой счет Юрлицу""
                             |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                             |			ТОГДА ""Cчет Турагентству""
                             |	КОНЕЦ КАК ТипДокумента,
                             |	ВЫБОР
                             |		КОГДА СчетаДолги.УслугаМин = 0
                             |				И СчетаДолги.УслугаМакс = 0
                             |			ТОГДА ""П""
                             |		КОГДА СчетаДолги.УслугаМин = 1
                             |				И СчетаДолги.УслугаМакс = 1
                             |			ТОГДА ""У""
                             |		ИНАЧЕ ""П и У""
                             |	КОНЕЦ КАК ТипСчета,
                             |	ВЫРАЗИТЬ(NULL КАК СТРОКА) КАК НомерСчетаФактуры,
                             |	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(NULL КАК ДАТА), ДЕНЬ) КАК ДатаСчетаФактуры,
                             |	СчетаДолги.СуммаДолг КАК Стоимость,
                             |	ВЫБОР
                             |		КОГДА ЗаявкаНаБронированиеСчета.СвернутьВСчете
                             |			ТОГДА 0
                             |		ИНАЧЕ СчетаДолги.СуммаНДС
                             |	КОНЕЦ КАК СуммаНДС,
                             |	СчетаДолги.СуммаОплачено КАК СуммаОплачено,
                             |	СчетаДолги.СуммаДолг КАК СуммаДолг,
                             |	СчетаДолги.УслугаМин КАК УслугаМин,
                             |	СчетаДолги.УслугаМакс КАК УслугаМакс
                             |ИЗ
                             |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                             |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                             |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                             |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
                             |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено) КАК СуммаОплачено,
                             |			МИНИМУМ(ВЫБОР
                             |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                             |						ТОГДА 1
                             |					ИНАЧЕ 0
                             |				КОНЕЦ) КАК УслугаМин,
                             |			МАКСИМУМ(ВЫБОР
                             |					КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                             |						ТОГДА 1
                             |					ИНАЧЕ 0
                             |				КОНЕЦ) КАК УслугаМакс,
                             |			СУММА(ВЫРАЗИТЬ(ВЫБОР
                             |						КОГДА &ВсеСНДС
                             |							ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДС / (100 + &СтавкаНДС))
                             |						ИНАЧЕ ВЫБОР
                             |								КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС
                             |									ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДС / (100 + &СтавкаНДС))
                             |								ИНАЧЕ 0
                             |							КОНЕЦ
                             |					КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДС
                             |		ИЗ
                             |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                             |		
                             |		СГРУППИРОВАТЬ ПО
                             |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                             |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДолги
                             |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДолги.Ссылка
                             |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДолги.СчетГУИД
                             |ГДЕ
                             |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                             |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
                             |	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ЛОЖЬ
                             |	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
                             |	И СчетаДолги.СуммаОплачено <> 0
                             |	И ЗаявкаНаБронированиеСчета.ДатаСчета >= &ДатаС
                             |	И ЗаявкаНаБронированиеСчета.ДатаСчета <= &ДатаПо
                             |
                             |УПОРЯДОЧИТЬ ПО
                             |	ДатаПо,
                             |	ДатаС";	
Возврат ЗапросТекстСчетаПредоплаты;	
КонецФункции

&НаСервере
Функция ЗапросТекстГрупповыеСчетаПредоплаты()
ЗапросТекстГрупповыеСчетаПредоплаты =	
"ВЫБРАТЬ
|	ГрупповыеСчета.Ссылка КАК ГрупповойСчет,
|	ГрупповыеСчета.НомерСчета КАК НомерСчета,
|	ГрупповыеСчета.ДатаСчета КАК ДатаСчета,
|	ГрупповыеСчета.Контрагент КАК Контрагент,
|	ГрупповыеСчета.Контрагент.ТипКлиента КАК ТипКонтрагента,
|	ВЫБОР
|		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
|			ТОГДА ""Гр. счет Физлицу""
|		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
|				И НЕ ГрупповыеСчета.Контрагент.Турагентство
|			ТОГДА ""Гр. счет Юрлицу""
|		КОГДА ГрупповыеСчета.Контрагент.Турагентство
|			ТОГДА ""Гр. Cчет Турагентству""
|	КОНЕЦ КАК ТипДокумента,
|	ВЫРАЗИТЬ(NULL КАК СТРОКА(100)) КАК НомерСчетаФактуры,
|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(NULL КАК ДАТА), ДЕНЬ) КАК ДатаСчетаФактуры,
|	ГрупповойСчетДолги.СуммаДолг КАК СуммаДолг,
|	ГрупповойСчетДолги.СуммаНДС КАК СуммаНДС,
|	ГрупповойСчетДолги.ЕстьОшибки КАК ЕстьОшибки,
|	ГрупповойСчетДолги.НетБрони КАК НетБрони,
|	ГрупповойСчетДолги.СуммаДолг КАК Стоимость,
|	Оплаты.СуммаРаспределено КАК СуммаОплачено
|ИЗ
|	Документ.ГрупповыеСчета КАК ГрупповыеСчета
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
|			МАКСИМУМ(ВЫБОР
|					КОГДА СчетаДолги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
|							ИЛИ СчетаДолги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
|						ТОГДА 1
|					ИНАЧЕ 0
|				КОНЕЦ) КАК ЕстьОшибки,
|			МАКСИМУМ(ВЫБОР
|					КОГДА СчетаДолги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
|						ТОГДА 1
|					ИНАЧЕ 0
|				КОНЕЦ) КАК ЕстьБронь,
|			МАКСИМУМ(ВЫБОР
|					КОГДА СчетаДолги.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
|						ТОГДА 1
|					ИНАЧЕ 0
|				КОНЕЦ) КАК НетБрони,
|			СУММА(СчетаДолги.СуммаДолг) КАК СуммаДолг,
|			СУММА(СчетаДолги.СуммаНДС) КАК СуммаНДС
|		ИЗ
|			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|					ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
|					ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
|					ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
|					ВЫБОР
|						КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
|							ТОГДА ЗаявкиСчетаДолги.СуммаДолг
|						ИНАЧЕ 0
|					КОНЕЦ КАК СуммаДолг,
|					ВЫБОР
|						КОГДА ЗаявкаНаБронированиеСчета.СвернутьВСчете
|							ТОГДА 0
|						ИНАЧЕ ЗаявкиСчетаДолги.СуммаНДС
|					КОНЕЦ КАК СуммаНДС
|				ИЗ
|					Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|							ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
|							ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
|							СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
|							СУММА(ВЫРАЗИТЬ(ВЫБОР
|										КОГДА &ВсеСНДС
|											ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДС / (100 + &СтавкаНДС))
|										ИНАЧЕ ВЫБОР
|												КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС
|													ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДС / (100 + &СтавкаНДС))
|												ИНАЧЕ 0
|											КОНЕЦ
|									КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДС
|						ИЗ
|							Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
|						
|						СГРУППИРОВАТЬ ПО
|							ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
|							ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ЗаявкиСчетаДолги
|						ПО ЗаявкаНаБронированиеСчета.Ссылка = ЗаявкиСчетаДолги.Ссылка
|							И ЗаявкаНаБронированиеСчета.СчетГУИД = ЗаявкиСчетаДолги.СчетГУИД) КАК СчетаДолги
|				ПО ГрупповыеСчетаДокументыДолги.ДокументДолг = СчетаДолги.Ссылка
|					И ГрупповыеСчетаДокументыДолги.СчетГУИД = СчетаДолги.СчетГУИД
|		
|		СГРУППИРОВАТЬ ПО
|			ГрупповыеСчетаДокументыДолги.Ссылка) КАК ГрупповойСчетДолги
|		ПО ГрупповыеСчета.Ссылка = ГрупповойСчетДолги.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ГрупповыеСчетаДокументыОплаты.Ссылка КАК Ссылка,
|			СУММА(ГрупповыеСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
|		ИЗ
|			Документ.ГрупповыеСчета.ДокументыОплаты КАК ГрупповыеСчетаДокументыОплаты
|		
|		СГРУППИРОВАТЬ ПО
|			ГрупповыеСчетаДокументыОплаты.Ссылка) КАК Оплаты
|		ПО ГрупповыеСчета.Ссылка = Оплаты.Ссылка
|ГДЕ
|	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
|	И ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
|	И ГрупповыеСчета.Контрагент.Турагентство = ЛОЖЬ
|	И ГрупповойСчетДолги.СуммаДолг <> 0
|	И ГрупповыеСчета.ДатаДокумента >= &ДатаС
|	И ГрупповыеСчета.ДатаДокумента <= &ДатаПо
|
|УПОРЯДОЧИТЬ ПО
|	ГрупповыеСчета.ДатаДокумента";

Возврат ЗапросТекстГрупповыеСчетаПредоплаты; 	
КонецФункции

&НаСервере
Функция ТабДок()
ТабДок = Новый ТабличныйДокумент;

ТабДок = ТабДокСчета(ТабДок);

//ДобавитьГрупповыеСчета(ТабДок);
//ДобавитьСчетаПредоплаты(ТабДок);
//ДобавитьГрупповыеСчетаПредоплаты(ТабДок);

Возврат ТабДок;
КонецФункции


&НаСервере
Функция ТабДокСчета(ТабДок)
	
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();		
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;
СтавкаНДСОрганизация = ТекущаяОрганизация.СтавкаНДС; 
СтавкаНДСДо2026 = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДСОрганизация, '20251231');
СтавкаНДСЧислоДо2026 = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСДо2026);
СтавкаНДСПосле2026 = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДСОрганизация, '20260101');
СтавкаНДСЧислоПосле2026 = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДСПосле2026);


Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчета();

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

Запрос.УстановитьПараметр("ВсеСНДС", ВсеСНДС);
Запрос.УстановитьПараметр("СтавкаНДСДо2026", СтавкаНДСДо2026);
Запрос.УстановитьПараметр("СтавкаНДСЧислоДо2026", СтавкаНДСЧислоДо2026);
Запрос.УстановитьПараметр("СтавкаНДСПосле2026", СтавкаНДСПосле2026);
Запрос.УстановитьПараметр("СтавкаНДСЧислоПосле2026", СтавкаНДСЧислоПосле2026);



ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.НомерСчета, Строка.ДатаПо);
	
	Строка.НомерСчетаФактуры = НомерДатаДокумента.Номер;
	Строка.ДатаСчетаФактуры = НомерДатаДокумента.Дата;
КонецЦикла;

Макет = Обработки.ОтчетДокументыДляСчетовФактур_РазныйНДС.ПолучитьМакет("МакетСчета");

Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.Отель = ТекущаяОрганизация.Наименование;
Табдок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
Табдок.Вывести(Область);

Для Каждого Строка Из ТЗ Цикл
	
	СтрокаОтчета = Макет.ПолучитьОбласть("Строка");
	СтрокаОтчета.Параметры.Заполнить(Строка);
	
	СтрокаОтчетаПараметры = СтрокаОтчета.Параметры;

	СтрокаОтчетаПараметры.ЗаявкаРасшифровка = Строка.Заявка;
	СтрокаОтчетаПараметры.ГостьРасшифровка = Строка.Гость;
	СтрокаОтчетаПараметры.ПлательщикРасшифровка = Строка.Плательщик;
	СтрокаОтчетаПараметры.ГрупповойСчетРасшифровка = Строка.ГрупповойСчет;
	
	СтрокаОтчетаПараметры.ДатаСчетаС = Формат(Строка.ДатаС, "ДФ=dd.MM.yy");
	СтрокаОтчетаПараметры.ДатаСчетаПо = Формат(Строка.ДатаПо, "ДФ=dd.MM.yy");
	СтрокаОтчетаПараметры.ДатаЗаезда = Формат(Строка.ДатаЗаезда, "ДФ=dd.MM.yy");
	СтрокаОтчетаПараметры.ДатаВыезда = Формат(Строка.ДатаВыезда, "ДФ=dd.MM.yy");
	
	СтрокаОтчетаПараметры.Статус = Строка.Статус;
	
				   //|	ВЫБОР
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
				   //|				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Счет Юрлицу""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				   //|				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Прямой счет Турагентству""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
				   //|				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Входит в групповой счет Юрлицу""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
				   //|			ТОГДА ""Счет Физлицу""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
				   //|				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Прямой счет Физлицу (бронирует Турагентство)""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				   //|				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Входит в Групповой счет Турагентству""
				   //|	КОНЕЦ КАК ТипДокумента,

	СтрокаОтчетаПараметры.ТипДокумента = Строка.ТипДокумента;
	Если Строка.ТипДокумента = "Счет Юрлицу" 
	ИЛИ Строка.ТипДокумента = "Прямой счет Турагентству" 	
	Тогда
		НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.НомерСчета, Строка.ДатаПо);
		
		Строка.НомерСчетаФактуры = НомерДатаДокумента.Номер;
		Строка.ДатаСчетаФактуры = НомерДатаДокумента.Дата;
				
	ИначеЕсли Строка.ТипДокумента = "Входит в групповой счет Юрлицу" Тогда
		Если ЗначениеЗаполнено(Строка.ГрупповойСчет) Тогда
			ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(Строка.ГрупповойСчет);
			СтрокаОтчетаПараметры.НомерСчетаФактуры = ГрупповойСчетНомерДата.Номер;
			СтрокаОтчетаПараметры.ДатаСчетаФактуры = Формат(ГрупповойСчетНомерДата.Дата, "ДФ=dd.MM.yy");
		Иначе
			СтрокаОтчетаПараметры.НомерСчетаФактуры = "";
			СтрокаОтчетаПараметры.ДатаСчетаФактуры = "";
		КонецЕсли;	
		
	Иначе 
		СтрокаОтчетаПараметры.НомерСчетаФактуры = "";
		СтрокаОтчетаПараметры.ДатаСчетаФактуры = "";
	КонецЕсли;
	
	СтрокаОтчетаПараметры.Стоимость = Строка.Стоимость;
	СтрокаОтчетаПараметры.СуммаНДС = Строка.СуммаНДС;
	СтрокаОтчетаПараметры.СуммаОплачено = Строка.СуммаОплачено;
	
	Если Строка.ТипДокумента = "Прямой счет Физлицу (бронирует Турагентство)" Тогда
		СтрокаОтчета.ТекущаяОбласть.ЦветТекста = Новый Цвет(153, 51, 0);
	ИначеЕсли Строка.ТипДокумента = "НЕ ОПРЕДЕЛЕНО" Тогда
		СтрокаОтчета.ТекущаяОбласть.ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;
	
	ТабДок.Вывести(СтрокаОтчета);
КонецЦикла;	
	
Возврат ТабДок;	
КонецФункции

&НаСервере
Функция ТабДокСчета__111()
ТабДок = Новый ТабличныйДокумент;	
	
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
//ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;
//СтавкаНДСОрганизация = ТекущаяОрганизация.СтавкаНДС; 
//СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС);
//СтавкаНДСЧисло = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДС);
СтавкаНДСЧисло = Неопределено;

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчета();

СписокСчета.Параметры.УстановитьЗначениеПараметра("ВсеСНДС", ВсеСНДС);
СписокСчета.Параметры.УстановитьЗначениеПараметра("СтавкаНДС", СтавкаНДСЧисло);

Запрос.УстановитьПараметр("ВсеСНДС", ВсеСНДС);	
Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДСЧисло);	

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.НомерСчета, Строка.ДатаПо);
	
	Строка.НомерСчетаФактуры = НомерДатаДокумента.Номер;
	Строка.ДатаСчетаФактуры = НомерДатаДокумента.Дата;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаС,
                      |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаПо,
                      |	ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	СчетаДолги.СуммаДолг КАК СуммаДолг,
                      |	СчетаДолги.ЕстьНДС КАК ЕстьНДС
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг КАК СуммаДолг,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС КАК ЕстьНДС
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги) КАК СчетаДолги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДолги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДолги.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И НЕ(ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                      |				ИЛИ ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования))
                      |	И ЗаявкаНаБронированиеСчета.ДатаПо >= &ДатаС
                      |	И ЗаявкаНаБронированиеСчета.ДатаПо <= &ДатаПо");
				   
ТЗСчетаДетальноДолги = Запрос.Выполнить().Выгрузить();

Макет = Обработки.ОтчетДокументыДляСчетовФактур_РазныйНДС.ПолучитьМакет("МакетСчета");

Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.Отель = ТекущаяОрганизация.Наименование;
Табдок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
Табдок.Вывести(Область);

Для Каждого Строка Из ТЗ Цикл
	
	СтрокаОтчета = Макет.ПолучитьОбласть("Строка");
	СтрокаОтчета.Параметры.Заполнить(Строка);
	
	СтрокаОтчетаПараметры = СтрокаОтчета.Параметры;

	СтрокаОтчетаПараметры.ЗаявкаРасшифровка = Строка.Заявка;
	СтрокаОтчетаПараметры.ГостьРасшифровка = Строка.Гость;
	СтрокаОтчетаПараметры.ПлательщикРасшифровка = Строка.Плательщик;
	СтрокаОтчетаПараметры.ГрупповойСчетРасшифровка = Строка.ГрупповойСчет;
	
	СтрокаОтчетаПараметры.ДатаСчетаС = Формат(Строка.ДатаС, "ДФ=dd.MM.yy");
	СтрокаОтчетаПараметры.ДатаСчетаПо = Формат(Строка.ДатаПо, "ДФ=dd.MM.yy");
	СтрокаОтчетаПараметры.ДатаЗаезда = Формат(Строка.ДатаЗаезда, "ДФ=dd.MM.yy");
	СтрокаОтчетаПараметры.ДатаВыезда = Формат(Строка.ДатаВыезда, "ДФ=dd.MM.yy");
	
	СтрокаОтчетаПараметры.Статус = Строка.Статус;
	
				   //|	ВЫБОР
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
				   //|				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Счет Юрлицу""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				   //|				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Прямой счет Турагентству""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
				   //|				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Входит в групповой счет Юрлицу""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
				   //|			ТОГДА ""Счет Физлицу""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
				   //|				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Прямой счет Физлицу (бронирует Турагентство)""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				   //|				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Входит в Групповой счет Турагентству""
				   //|	КОНЕЦ КАК ТипДокумента,

	СтрокаОтчетаПараметры.ТипДокумента = Строка.ТипДокумента;
	Если Строка.ТипДокумента = "Счет Юрлицу" 
	ИЛИ Строка.ТипДокумента = "Прямой счет Турагентству" 	
	Тогда
		НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.НомерСчета, Строка.ДатаПо);
		
		Строка.НомерСчетаФактуры = НомерДатаДокумента.Номер;
		Строка.ДатаСчетаФактуры = НомерДатаДокумента.Дата;
				
	ИначеЕсли Строка.ТипДокумента = "Входит в групповой счет Юрлицу" Тогда
		Если ЗначениеЗаполнено(Строка.ГрупповойСчет) Тогда
			ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(Строка.ГрупповойСчет);
			СтрокаОтчетаПараметры.НомерСчетаФактуры = ГрупповойСчетНомерДата.Номер;
			СтрокаОтчетаПараметры.ДатаСчетаФактуры = Формат(ГрупповойСчетНомерДата.Дата, "ДФ=dd.MM.yy");
		Иначе
			СтрокаОтчетаПараметры.НомерСчетаФактуры = "";
			СтрокаОтчетаПараметры.ДатаСчетаФактуры = "";
		КонецЕсли;	
		
	Иначе 
		СтрокаОтчетаПараметры.НомерСчетаФактуры = "";
		СтрокаОтчетаПараметры.ДатаСчетаФактуры = "";
	КонецЕсли;
	
	СтрокаОтчетаПараметры.Стоимость = Строка.Стоимость;     
	
	//СтрокаОтчетаПараметры.СуммаНДС = Строка.СуммаНДС;  
	
	//Если ЗаявкаНаБронированиеСчета.СвернутьВСчете Тогда
	Если ИСтина Тогда
		СуммаНДС = 0;
	Иначе
	   //|			СУММА(ВЫРАЗИТЬ(ВЫБОР
	   //|						КОГДА &ВсеСНДС
	   //|							ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДСОрганизация / (100 + &СтавкаНДСОрганизация))
	   //|						ИНАЧЕ ВЫБОР
	   //|								КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС
	   //|									ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг * (&СтавкаНДСОрганизация / (100 + &СтавкаНДСОрганизация))
	   //|								ИНАЧЕ 0
	   //|							КОНЕЦ
	   //|					КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
	   
		ОтборСтроки = Новый Структура("Заявка, СчетГУИД", Строка.Заявка, Строка.СчетГУИД); 
		НайденныеСтроки = ТЗСчетаДетальноДолги.НайтиСтроки(ОтборСтроки);	
		СтавкаНДС_П = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДСОрганизация, Строка.ДатаПо );
		СтавкаНДСЧисло = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДС_П);
								
		Если ВсеСНДС Тогда 
			СуммаНДС = 0;
			Для Каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл
				СуммаНДС = СуммаНДС + СтрокаНайденныеСтроки.СуммаДолг * (СтавкаНДСЧисло / (100 + СтавкаНДСЧисло));	
			КонецЦикла;	

		Иначе
			СуммаНДС = 0;
			Для Каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл 
				Если СтрокаНайденныеСтроки.ЕстьНДС Тогда 
					СуммаНДС = СуммаНДС + СтрокаНайденныеСтроки.СуммаДолг * (СтавкаНДСЧисло / (100 + СтавкаНДСЧисло));	  
				КонецЕсли;
			КонецЦикла;	

		КонецЕсли;	
	КонецЕсли;  
	
	СтрокаОтчетаПараметры.СуммаНДС = СуммаНДС;  

	СтрокаОтчетаПараметры.СуммаОплачено = Строка.СуммаОплачено;
	
	Если Строка.ТипДокумента = "Прямой счет Физлицу (бронирует Турагентство)" Тогда
		СтрокаОтчета.ТекущаяОбласть.ЦветТекста = Новый Цвет(153, 51, 0);
	ИначеЕсли Строка.ТипДокумента = "НЕ ОПРЕДЕЛЕНО" Тогда
		СтрокаОтчета.ТекущаяОбласть.ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;
	
	ТабДок.Вывести(СтрокаОтчета);
КонецЦикла;	
	
Возврат ТабДок;	
КонецФункции

&НаСервере
Функция ТабДокСчета_1()
ТабДок = Новый ТабличныйДокумент;	
	
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;
СтавкаНДСЧисло = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДС);

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчета();

СписокСчета.Параметры.УстановитьЗначениеПараметра("ВсеСНДС", ВсеСНДС);
СписокСчета.Параметры.УстановитьЗначениеПараметра("СтавкаНДС", СтавкаНДСЧисло);

Запрос.УстановитьПараметр("ВсеСНДС", ВсеСНДС);	
Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДСЧисло);	

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.НомерСчета, Строка.ДатаПо);
	
	Строка.НомерСчетаФактуры = НомерДатаДокумента.Номер;
	Строка.ДатаСчетаФактуры = НомерДатаДокумента.Дата;
КонецЦикла;

Макет = Обработки.ОтчетДокументыДляСчетовФактур_РазныйНДС.ПолучитьМакет("МакетСчета");

Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.Отель = ТекущаяОрганизация.Наименование;
Табдок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
Табдок.Вывести(Область);

Для Каждого Строка Из ТЗ Цикл
	
	СтрокаОтчета = Макет.ПолучитьОбласть("Строка");
	СтрокаОтчета.Параметры.Заполнить(Строка);
	
	СтрокаОтчетаПараметры = СтрокаОтчета.Параметры;

	СтрокаОтчетаПараметры.ЗаявкаРасшифровка = Строка.Заявка;
	СтрокаОтчетаПараметры.ГостьРасшифровка = Строка.Гость;
	СтрокаОтчетаПараметры.ПлательщикРасшифровка = Строка.Плательщик;
	СтрокаОтчетаПараметры.ГрупповойСчетРасшифровка = Строка.ГрупповойСчет;
	
	СтрокаОтчетаПараметры.ДатаСчетаС = Формат(Строка.ДатаС, "ДФ=dd.MM.yy");
	СтрокаОтчетаПараметры.ДатаСчетаПо = Формат(Строка.ДатаПо, "ДФ=dd.MM.yy");
	СтрокаОтчетаПараметры.ДатаЗаезда = Формат(Строка.ДатаЗаезда, "ДФ=dd.MM.yy");
	СтрокаОтчетаПараметры.ДатаВыезда = Формат(Строка.ДатаВыезда, "ДФ=dd.MM.yy");
	
	СтрокаОтчетаПараметры.Статус = Строка.Статус;
	
				   //|	ВЫБОР
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
				   //|				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Счет Юрлицу""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				   //|				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Прямой счет Турагентству""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
				   //|				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Входит в групповой счет Юрлицу""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ЛОЖЬ
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
				   //|			ТОГДА ""Счет Физлицу""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				   //|				И ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
				   //|				И НЕ(ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|						ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Прямой счет Физлицу (бронирует Турагентство)""
				   //|		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство = ИСТИНА
				   //|				И (ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет
				   //|					ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка))
				   //|			ТОГДА ""Входит в Групповой счет Турагентству""
				   //|	КОНЕЦ КАК ТипДокумента,

	СтрокаОтчетаПараметры.ТипДокумента = Строка.ТипДокумента;
	Если Строка.ТипДокумента = "Счет Юрлицу" 
	ИЛИ Строка.ТипДокумента = "Прямой счет Турагентству" 	
	Тогда
		НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Строка.Заявка, Строка.НомерСчета, Строка.ДатаПо);
		
		Строка.НомерСчетаФактуры = НомерДатаДокумента.Номер;
		Строка.ДатаСчетаФактуры = НомерДатаДокумента.Дата;
				
	ИначеЕсли Строка.ТипДокумента = "Входит в групповой счет Юрлицу" Тогда
		Если ЗначениеЗаполнено(Строка.ГрупповойСчет) Тогда
			ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(Строка.ГрупповойСчет);
			СтрокаОтчетаПараметры.НомерСчетаФактуры = ГрупповойСчетНомерДата.Номер;
			СтрокаОтчетаПараметры.ДатаСчетаФактуры = Формат(ГрупповойСчетНомерДата.Дата, "ДФ=dd.MM.yy");
		Иначе
			СтрокаОтчетаПараметры.НомерСчетаФактуры = "";
			СтрокаОтчетаПараметры.ДатаСчетаФактуры = "";
		КонецЕсли;	
		
	Иначе 
		СтрокаОтчетаПараметры.НомерСчетаФактуры = "";
		СтрокаОтчетаПараметры.ДатаСчетаФактуры = "";
	КонецЕсли;
	
	СтрокаОтчетаПараметры.Стоимость = Строка.Стоимость;
	СтрокаОтчетаПараметры.СуммаНДС = Строка.СуммаНДС;
	СтрокаОтчетаПараметры.СуммаОплачено = Строка.СуммаОплачено;
	
	Если Строка.ТипДокумента = "Прямой счет Физлицу (бронирует Турагентство)" Тогда
		СтрокаОтчета.ТекущаяОбласть.ЦветТекста = Новый Цвет(153, 51, 0);
	ИначеЕсли Строка.ТипДокумента = "НЕ ОПРЕДЕЛЕНО" Тогда
		СтрокаОтчета.ТекущаяОбласть.ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;
	
	ТабДок.Вывести(СтрокаОтчета);
КонецЦикла;	
	
Возврат ТабДок;	
КонецФункции


&НаСервере
Процедура ДобавитьГрупповыеСчета(ТабДок)

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;
СтавкаНДСЧисло = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДС);

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстГрупповыеСчета();

Запрос.УстановитьПараметр("ВсеСНДС", ВсеСНДС);	
Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДСЧисло);	

Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда Возврат; КонецЕсли;

Макет = Обработки.ОтчетДокументыДляСчетовФактур_РазныйНДС.ПолучитьМакет("МакетГрупповыеСчета");

Область = Макет.ПолучитьОбласть("Заголовок");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

Для Каждого Строка Из ТЗ Цикл
	
	Ответ = ДокументыСервер.ПроверитьГрупповойСчет(Строка.ГрупповойСчет);
	Если Ответ.ТекстОшибки <> "" Тогда
		Текст = "Групповой счет " + Строка.ГрупповойСчет + ". " + Символы.ПС + Ответ.ТекстОшибки;
		Область = Макет.ПолучитьОбласть("СтрокаОшибки");
		Область.Параметры.Сообщение = Текст; 
		ТабДок.Вывести(Область);
		
		Продолжить;
	КонецЕсли;
	
	Текст = Ответ.ТекстПредупреждения;
	Если Текст <> "" Тогда
		Текст = "Групповой счет " + Строка.ГрупповойСчет + ". " + Символы.ПС + Текст 
			+ ". В расчет НЕ включены Заявки со статусом 'Бронь'";		
		Область = Макет.ПолучитьОбласть("СтрокаСообщения");
		Область.Параметры.Сообщение = Текст; 
		ТабДок.Вывести(Область);
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Строка"); 
	ОбластьПараметры = Область.Параметры;
	
	ОбластьПараметры.ГрупповойСчетРасшифровка = Строка.ГрупповойСчет;
	
	ОбластьПараметры.НомерСчета = Строка.НомерСчета;
	ОбластьПараметры.ДатаСчета = Формат(Строка.ДатаСчета, "ДФ=dd.MM.yy");
	//ОбластьПараметры.ГрупповойСчет = Строка.ГрупповойСчет;

	ОбластьПараметры.Контрагент = Строка.Контрагент;
	ОбластьПараметры.КонтрагентРасшифровка = Строка.Контрагент;
	
	ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(Строка.ГрупповойСчет);

	Если Строка.Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо Тогда
		ОбластьПараметры.ТипДокумента = "Гр. счет ФизЛицу";
		
		ОбластьПараметры.НомерСчетаФактуры = "";
		ОбластьПараметры.ДатаСчетаФактуры = "";
	ИначеЕсли НЕ Строка.Контрагент.Турагентство Тогда
		ОбластьПараметры.ТипДокумента = "Гр. счет ЮрЛицу";
		
		ОбластьПараметры.НомерСчетаФактуры = ГрупповойСчетНомерДата.Номер;
		ОбластьПараметры.ДатаСчетаФактуры = Формат(ГрупповойСчетНомерДата.Дата, "ДФ=dd.MM.yy");
	ИначеЕсли Строка.Контрагент.Турагентство Тогда
		ОбластьПараметры.ТипДокумента = "Гр. счет Турагентству";
		
		ОбластьПараметры.НомерСчетаФактуры = "";
		ОбластьПараметры.ДатаСчетаФактуры = "";
	КонецЕсли;

	ГрупповойСчетФактурыСтроки = ПечатьСервер.ГрупповойСчетФактурыСтроки(Строка.Групповойсчет);	
	Стоимость = ГрупповойСчетФактурыСтроки.Итог("СуммаСНДС");	
	СуммаНДС = ГрупповойСчетФактурыСтроки.Итог("СуммаНДС");	
	
	ОбластьПараметры.Стоимость = Стоимость; 
	ОбластьПараметры.СуммаНДС = СуммаНДС; 
	
	ТабДок.Вывести(Область);
КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСчетаПредоплаты(ТабДок)
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;
СтавкаНДСЧисло = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДС);
	
Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстСчетаПредоплаты();
					  
Запрос.УстановитьПараметр("ВсеСНДС", ВсеСНДС);	
Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДСЧисло);		

Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда Возврат; КонецЕсли;

Макет = Обработки.ОтчетДокументыДляСчетовФактур_РазныйНДС.ПолучитьМакет("МакетСчета");

Область = Макет.ПолучитьОбласть("ЗаголовокПредоплаты");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

Для Каждого Строка Из ТЗ Цикл
	СтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
	СтрокаТаблицы.Параметры.Заполнить(Строка);
	
	СтрокаТаблицыПараметры = СтрокаТаблицы.Параметры;

	СтрокаТаблицыПараметры.ЗаявкаРасшифровка = Строка.Заявка;
	СтрокаТаблицыПараметры.ГостьРасшифровка = Строка.Гость;
	СтрокаТаблицыПараметры.ПлательщикРасшифровка = Строка.Плательщик;
	СтрокаТаблицыПараметры.ГрупповойСчетРасшифровка = Строка.ГрупповойСчет;
	
	СтрокаТаблицыПараметры.ДатаСчетаС = Строка.ДатаС;
	СтрокаТаблицыПараметры.ДатаСчетаПо = Строка.ДатаПо;
	СтрокаТаблицыПараметры.ДатаЗаезда = Формат(Строка.РезервС, "ДФ=dd.MM.yy");
	СтрокаТаблицыПараметры.ДатаВыезда = Формат(Строка.РезервПо, "ДФ=dd.MM.yy");
	
	//СтрокаТаблицыПараметры.ДатаСчетаФактуры = Формат(Строка.ДатаСчетаФактуры, "ДФ=dd.MM.yy");
	//СтрокаТаблицыПараметры.НомерСчетаФактуры = ПечатьСервер.НомерСчетаДляПечати(Строка.НомерЗаявки, Строка.НомерСчета);
	//СтрокаТаблицыПараметры.ДатаСчетаФактуры =  Строка.ДатаСчетаПо;
	
	СтрокаТаблицыПараметры.ТипДокумента = Строка.ТипДокумента;
		
	СтрокаТаблицыПараметры.ТипСчета = Строка.ТипСчета;
	
	СтрокаТаблицыПараметры.Стоимость = Строка.Стоимость;
	СтрокаТаблицыПараметры.СуммаОплачено = Строка.СуммаОплачено;

	ТабДок.Вывести(СтрокаТаблицы);
КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГрупповыеСчетаПредоплаты(ТабДок)
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;
СтавкаНДСЧисло = ДокументыСервер.СтавкаНДСЧисло(СтавкаНДС);
	
Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекстГрупповыеСчетаПредоплаты();
					  
Запрос.УстановитьПараметр("ВсеСНДС", ВсеСНДС);	
Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДСЧисло);	
					  
Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда Возврат; КонецЕсли;

Макет = Обработки.ОтчетДокументыДляСчетовФактур_РазныйНДС.ПолучитьМакет("МакетГрупповыеСчета");

Область = Макет.ПолучитьОбласть("ЗаголовокПредоплаты");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

Для Каждого Строка Из ТЗ Цикл
	
	Ответ = ДокументыСервер.ПроверитьГрупповойСчет(Строка.ГрупповойСчет);
	Если Ответ.ТекстОшибки <> "" Тогда
		Текст = "Групповой счет " + Строка.ГрупповойСчет + ". " + Символы.ПС + Ответ.ТекстОшибки;
		Область = Макет.ПолучитьОбласть("СтрокаОшибки");
		Область.Параметры.Сообщение = Текст; 
		ТабДок.Вывести(Область);
		
		Продолжить;
	КонецЕсли;
	
	Текст = Ответ.ТекстПредупреждения;
	Если Текст <> "" Тогда
		Текст = "Групповой счет " + Строка.ГрупповойСчет + ". " + Символы.ПС + Текст + ". В расчет включены только Заявки со статусом 'Бронь'";		
		Область = Макет.ПолучитьОбласть("СтрокаСообщения");
		Область.Параметры.Сообщение = Текст; 
		ТабДок.Вывести(Область);
	КонецЕсли;
	
	СтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
	СтрокаТаблицы.Параметры.Заполнить(Строка);
	
	ОбластьПараметры = СтрокаТаблицы.Параметры;
	
	ОбластьПараметры.ГрупповойСчетРасшифровка = Строка.ГрупповойСчет;
	
	ОбластьПараметры.НомерСчета = Строка.НомерСчета;
	ОбластьПараметры.ДатаСчета = Формат(Строка.ДатаСчета, "ДФ=dd.MM.yy");
	//ОбластьПараметры.ГрупповойСчет = Строка.ГрупповойСчет;

	ОбластьПараметры.Контрагент = Строка.Контрагент;
	ОбластьПараметры.КонтрагентРасшифровка = Строка.Контрагент;
	
	//ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(Строка.ГрупповойСчет);

	//Если Строка.Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо Тогда
	//	ОбластьПараметры.ТипДокумента = "Гр. счет ФизЛицу";
	//	
	//ИначеЕсли НЕ Строка.Контрагент.Турагентство Тогда
	//	ОбластьПараметры.ТипДокумента = "Гр. счет ЮрЛицу";
	//	
	//ИначеЕсли Строка.Контрагент.Турагентство Тогда
	//	ОбластьПараметры.ТипДокумента = "Гр. счет Турагентству";
	//КонецЕсли;

	//ГрупповойСчетФактурыСтроки = ПечатьСервер.ГрупповойСчетФактурыСтроки(Строка.Групповойсчет);	
	//Стоимость = ГрупповойСчетФактурыСтроки.Итог("СуммаСНДС");	
	//СуммаНДС = ГрупповойСчетФактурыСтроки.Итог("СуммаНДС");	
	
	ОбластьПараметры.Стоимость = Строка.Стоимость; 
	ОбластьПараметры.СуммаОплачено = Строка.СуммаОплачено; 
	
	ТабДок.Вывести(СтрокаТаблицы);
КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура СписокСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТС = Элемент.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;
	
ТД = Элементы.СписокСчета.ДанныеСтроки(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура("Ключ, ТолькоПросмотр", ТД.Заявка, Истина);
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокСчетаПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
Для каждого Элемент Из Строки Цикл
	СтрокаСписка = Строки[Элемент.Ключ];

    Заявка = Элемент.Значение.Данные["Заявка"];
	НомерСчета = Элемент.Значение.Данные["НомерСчета"];
	ДатаПо = Элемент.Значение.Данные["ДатаПо"];
	ГрупповойСчет = Элемент.Значение.Данные["ГрупповойСчет"];

	ТипДокумента = Элемент.Значение.Данные["ТипДокумента"];
	Если ТипДокумента = "Счет Юрлицу" Тогда
		НомерДатаДокумента = ПечатьСервер.НомерДатаДокумента(Заявка, НомерСчета, ДатаПо);
		СтрокаСписка.Данные["НомерСчетаФактуры"] =  НомерДатаДокумента.Номер;
		СтрокаСписка.Данные["ДатаСчетаФактуры"] =  НомерДатаДокумента.Дата;
	ИначеЕсли ТипДокумента = "Входит в групповой счет Юрлицу" Тогда
		Если ЗначениеЗаполнено(ГрупповойСчет) Тогда
			ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(ГрупповойСчет);
			СтрокаСписка.Данные["НомерСчетаФактуры"] = ГрупповойСчетНомерДата.Номер;
			СтрокаСписка.Данные["ДатаСчетаФактуры"] = ГрупповойСчетНомерДата.Дата;
		КонецЕсли;
	КонецЕсли;
КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СписокГрупповыеСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТС = Элемент.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;
	
ТД = Элементы.СписокГрупповыеСчета.ДанныеСтроки(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура("Ключ, ТолькоПросмотр", ТД.ГрупповойСчет, Истина);
ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокГрупповыеСчетаПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

Для каждого Элемент Из Строки Цикл
	СтрокаСписка = Строки[Элемент.Ключ];

    ГрупповойСчет = Элемент.Значение.Данные["ГрупповойСчет"];
	ТипДокумента = Элемент.Значение.Данные["ТипДокумента"];
	
	Если ТипДокумента = "Гр. счет Юрлицу" Тогда
		ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(ГрупповойСчет);
		СтрокаСписка.Данные["НомерСчетаФактуры"] =  ГрупповойСчетНомерДата.Номер;
		СтрокаСписка.Данные["ДатаСчетаФактуры"] =  ГрупповойСчетНомерДата.Дата;
	КонецЕсли;	
КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СписокПредоплатаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТС = Элемент.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;
	
ТД = Элементы.СписокПредоплата.ДанныеСтроки(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура("Ключ, ТолькоПросмотр", ТД.Заявка, Истина);
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура СписокГрупповыеСчетаПредоплатаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТС = Элемент.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;
	
ТД = Элементы.СписокГрупповыеСчетаПредоплата.ДанныеСтроки(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура("Ключ, ТолькоПросмотр", ТД.ГрупповойСчет, Истина);
ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

