
//
&НаКлиенте
Процедура КнопкаВыполнитьНажатие___(Кнопка)
	//ТаблицыПоКлиентам=Новый ТаблицаЗначений;
	//ТаблицыПоКлиентам.Колонки.Добавить("Клиент");
	//ТаблицыПоКлиентам.Колонки.Добавить("ТЗ");
	//
	//ЗапросНомеров=Новый Запрос("ВЫБРАТЬ
	//|	ПроданныеНомера.ДатаПродажи,
	//|	ПроданныеНомера.Бронь,
	//|	ПроданныеНомера.Клиент,
	//|	ПроданныеНомера.НомерВРезерв,
	//|	ПроданныеНомера.СуммаЗаПроживание
	//|ИЗ
	//|	РегистрСведений.ПроданныеНомера КАК ПроданныеНомера
	//|ГДЕ
	//|	ПроданныеНомера.ДатаПродажи МЕЖДУ &ДН И &ДК");
	//
	//ЗапросНомеров=Новый Запрос("ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(ЕжедневныйАудитПроданныеНомера.Ссылка.Дата,ДЕНЬ) КАК ДатаПродажи,
	//|	ЕжедневныйАудитПроданныеНомера.Бронь,
	//|	ЕжедневныйАудитПроданныеНомера.Клиент,
	//|	ЕжедневныйАудитПроданныеНомера.НомерВРезерв,
	//|	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживание,
	//|	ЕжедневныйАудитПроданныеНомера.СуммаПолупансион
	//|ИЗ
	//|	Документ.ЕжедневныйАудит.ПроданныеНомера КАК ЕжедневныйАудитПроданныеНомера
	//|ГДЕ
	//|	ЕжедневныйАудитПроданныеНомера.Ссылка.Дата МЕЖДУ &ДН И &ДК
	//|	И ЕжедневныйАудитПроданныеНомера.Ссылка.Проведен = ИСТИНА
	//|	И ЕжедневныйАудитПроданныеНомера.Ссылка.Проверка = ИСТИНА");
	//
	//ЗапросНомеров.УстановитьПараметр("ДН",НачалоДня(ПериодС));							   
	//ЗапросНомеров.УстановитьПараметр("ДК",КонецДня(ПериодПо));
	//ТЗНомеров=ЗапросНомеров.Выполнить().Выгрузить();
	//Дн=НачалоДня(ПериодС);
	//Макет=ПолучитьМакет("Макет");
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//Пока ДН<=ПериодПо цикл
	//	СпрН=Справочники.НомернойФонд.Выбрать();
	//	Пока Спрн.Следующий() цикл
	//		СтруктНом=Новый Структура("НомерВРезерв,ДатаПродажи",СпрН.Ссылка,ДН);
	//		
	//		ПоискНом=ТЗНомеров.НайтиСтроки(СтруктНом);
	//		Если ПоискНом.Количество()>0 тогда //продан
	//			Для каждого СтрПродажа Из ПоискНом Цикл
	//			
	//			
	//			Обл=Макет.ПолучитьОбласть("Строка");
	//			//ДТ	1	Мес	Нед	ДН	УЭ	Комната	тип	Сумма	КолВоЧел	СуммаОпл	ДатаОпл	ФормаОпл
	//			Обл.Параметры.ДТ=Формат(ДН, "ДФ=dd.MM.yy");
	//			Обл.Параметры.Мес=Строка(Месяц(ДН))+" " + Формат(Год(ДН), "ЧГ=");
	//			Обл.Параметры.Нед=Формат(НеделяГода(ДН), "ЧГ=");
	//			Обл.Параметры.ДН=ДеньНедели(ДН);
	//			Обл.Параметры.УЭ=?(ДеньНедели(ДН)>5,1,0);
	//			Обл.Параметры.Комната=СпрН.Ссылка;
	//			Обл.Параметры.тип=СпрН.КатегорияНомера;
	//			Обл.Параметры.Сумма=Формат(?(СтрПродажа.Бронь.Бронирует.Турагенство,СтрПродажа.СуммаЗаПроживание*((100-СтрПродажа.Бронь.Бронирует.ПроцентАгент)/100),СтрПродажа.СуммаЗаПроживание)-СтрПродажа.СуммаПолупансион, "ЧДЦ=2; ЧГ=");	
	//			Обл.Параметры.КолВоЧел=Формат(СтрПродажа.Бронь.КолВоЧеловек, "ЧГ=");
	//			Если СтрПродажа.Бронь.Бронирует.Турагенство тогда			
	//				Обл.Параметры.СуммаАгент=Формат(СтрПродажа.СуммаЗаПроживание*(СтрПродажа.Бронь.Бронирует.ПроцентАгент/100), "ЧДЦ=2; ЧГ=")+СтрПродажа.СуммаПолупансион;	
	//			иначе
	//				Обл.Параметры.СуммаАгент=СтрПродажа.СуммаПолупансион;
	//			КонецЕсли;
	//			
	//			ПоискТЗКл=ТаблицыПоКлиентам.Найти(СтрПродажа.Бронь.Оплачивает,"Клиент");
	//			Если ПоискТЗКл=Неопределено тогда
	//				ТЗКл=ПолучитьТаблицуПоКлиенту(СтрПродажа.Бронь.Оплачивает);
	//				НовЗап=ТаблицыПоКлиентам.Добавить();
	//				НовЗап.Клиент=СтрПродажа.Бронь.Оплачивает;
	//				НовЗап.ТЗ=ТЗКл;
	//			иначе
	//				ТЗКл=ПоискТЗКл.ТЗ;
	//			КонецЕсли;
	//			СтруктОпл=Новый Структура("НомерВРезерв,ДатаПродажи",СпрН.Ссылка,ДН);
	//			ПоискОпл=ТЗКл.НайтиСтроки(СтруктНом);
	//			Если ПоискОпл.Количество()>0 тогда //оплачен
	//				
	//				Если ПоискОпл[0].ДатаОплаты>КонецДня(ДН) тогда // поздняя оплата					
	//					Обл.Параметры.ДатаОпл2=?(ПоискОпл[0].СуммаОплаты=0,"",Формат(ПоискОпл[0].ДатаОплаты, "ДФ=dd.MM.yy"));	
	//					Обл.Параметры.ФормаОпл2=ПоискОпл[0].Вид+?(ПоискОпл[0].КредитнаяКарта,"(КК)","");	
	//					
	//				иначе
	//					Обл.Параметры.ДатаОпл=?(ПоискОпл[0].СуммаОплаты=0,"",Формат(ПоискОпл[0].ДатаОплаты, "ДФ=dd.MM.yy"));	
	//					Обл.Параметры.ФормаОпл=ПоискОпл[0].Вид+?(ПоискОпл[0].КредитнаяКарта,"(КК)","");	
	//				КонецЕсли;
	//			КонецЕсли;
	//			ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//		КонецЦикла; 
	//	иначе
	//			Обл=Макет.ПолучитьОбласть("Строка");
	//			//ДТ	1	Мес	Нед	ДН	УЭ	Комната	тип	Сумма	КолВоЧел	СуммаОпл	ДатаОпл	ФормаОпл
	//			Обл.Параметры.ДТ=Формат(ДН, "ДФ=dd.MM.yy");
	//			Обл.Параметры.Мес=Строка(Месяц(ДН))+" " + Формат(Год(ДН), "ЧГ=");
	//			Обл.Параметры.Нед=Формат(НеделяГода(ДН), "ЧГ=");
	//			Обл.Параметры.ДН=ДеньНедели(ДН);
	//			Обл.Параметры.УЭ=?(ДеньНедели(ДН)>5,1,0);
	//			Обл.Параметры.Комната=СпрН.Ссылка;
	//			Обл.Параметры.тип=СпрН.КатегорияНомера;
	//			ЭлементыФормы.ПолеОтчета.Вывести(Обл);		
	//		конецесли;
	//		
	//		
	//	КонецЦикла;
	//	
	//	ДН=ДН+86400;
	//КонецЦикла;
	//
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
	ВыполнитьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандаНаСервере()
	//ТаблицыПоКлиентам=Новый ТаблицаЗначений;
	//ТаблицыПоКлиентам.Колонки.Добавить("Клиент");
	//ТаблицыПоКлиентам.Колонки.Добавить("ТЗ");
	
	ЗапросНомеров=Новый Запрос("ВЫБРАТЬ
	|	ПроданныеНомера.ДатаПродажи,
	|	ПроданныеНомера.Бронь,
	|	ПроданныеНомера.Клиент,
	|	ПроданныеНомера.НомерВРезерв,
	|	ПроданныеНомера.СуммаЗаПроживание
	|ИЗ
	|	РегистрСведений.ПроданныеНомера КАК ПроданныеНомера
	|ГДЕ
	|	ПроданныеНомера.ДатаПродажи МЕЖДУ &ДН И &ДК");
	
	ЗапросНомеров=Новый Запрос("ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЕжедневныйАудитПроданныеНомера.Ссылка.Дата,ДЕНЬ) КАК ДатаПродажи,
	|	ЕжедневныйАудитПроданныеНомера.Бронь,
	|	ЕжедневныйАудитПроданныеНомера.Клиент,
	|	ЕжедневныйАудитПроданныеНомера.НомерВРезерв,
	|	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживание,
	|	ЕжедневныйАудитПроданныеНомера.СуммаПолупансион
	|ИЗ
	|	Документ.ЕжедневныйАудит.ПроданныеНомера КАК ЕжедневныйАудитПроданныеНомера
	|ГДЕ
	|	ЕжедневныйАудитПроданныеНомера.Ссылка.Дата МЕЖДУ &ДН И &ДК
	|	И ЕжедневныйАудитПроданныеНомера.Ссылка.Проведен = ИСТИНА
	|	И ЕжедневныйАудитПроданныеНомера.Ссылка.Проверка = ИСТИНА");
	
	ЗапросНомеров.УстановитьПараметр("ДН",НачалоДня(Отчет.ПериодС));							   
	ЗапросНомеров.УстановитьПараметр("ДК",КонецДня(Отчет.ПериодПо));
	ТЗНомеров=ЗапросНомеров.Выполнить().Выгрузить();
	Дн=НачалоДня(Отчет.ПериодС);
	
	//Макет=ПолучитьМакет("Макет");
	Макет= Отчеты.ФинансовыйОтчет.ПолучитьМакет("Макет");
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Пока ДН<=Отчет.ПериодПо цикл
		СпрН=Справочники.НомернойФонд.Выбрать();
		Пока Спрн.Следующий() цикл
			СтруктНом=Новый Структура("НомерВРезерв,ДатаПродажи",СпрН.Ссылка,ДН);
			
			ПоискНом=ТЗНомеров.НайтиСтроки(СтруктНом);
			Если ПоискНом.Количество()>0 тогда //продан
				Для каждого СтрПродажа Из ПоискНом Цикл
				
				
				Обл=Макет.ПолучитьОбласть("Строка");
				//ДТ	1	Мес	Нед	ДН	УЭ	Комната	тип	Сумма	КолВоЧел	СуммаОпл	ДатаОпл	ФормаОпл
				Обл.Параметры.ДТ=Формат(ДН, "ДФ=dd.MM.yy");
				Обл.Параметры.Мес=Строка(Месяц(ДН))+" " + Формат(Год(ДН), "ЧГ=");
				Обл.Параметры.Нед=Формат(НеделяГода(ДН), "ЧГ=");
				Обл.Параметры.ДН=ДеньНедели(ДН);
				Обл.Параметры.УЭ=?(ДеньНедели(ДН)>5,1,0);
				Обл.Параметры.Комната=СпрН.Ссылка;
				Обл.Параметры.тип=СпрН.КатегорияНомера;
				Обл.Параметры.Сумма=Формат(?(СтрПродажа.Бронь.Бронирует.Турагентство,СтрПродажа.СуммаЗаПроживание*((100-СтрПродажа.Бронь.Бронирует.ПроцентАгент_OLD)/100),СтрПродажа.СуммаЗаПроживание)-СтрПродажа.СуммаПолупансион, "ЧДЦ=2; ЧГ=");	
				Обл.Параметры.КолВоЧел=Формат(СтрПродажа.Бронь.КолВоЧеловек, "ЧГ=");
				Если СтрПродажа.Бронь.Бронирует.Турагентство тогда			
					Обл.Параметры.СуммаАгент=Формат(СтрПродажа.СуммаЗаПроживание*(СтрПродажа.Бронь.Бронирует.ПроцентАгент_OLD/100), "ЧДЦ=2; ЧГ=")+СтрПродажа.СуммаПолупансион;	
				иначе
					Обл.Параметры.СуммаАгент=СтрПродажа.СуммаПолупансион;
				КонецЕсли;
				
				ПоискТЗКл=ТаблицыПоКлиентам.Найти(СтрПродажа.Бронь.Оплачивает,"Клиент");
				Если ПоискТЗКл=Неопределено тогда
					ТЗКл=ПолучитьТаблицуПоКлиенту(СтрПродажа.Бронь.Оплачивает);
					НовЗап=ТаблицыПоКлиентам.Добавить();
					НовЗап.Клиент=СтрПродажа.Бронь.Оплачивает;
					НовЗап.ТЗ=ТЗКл;
				иначе
					ТЗКл=ПоискТЗКл.ТЗ;
				КонецЕсли;
				СтруктОпл=Новый Структура("НомерВРезерв,ДатаПродажи",СпрН.Ссылка,ДН);
				ПоискОпл=ТЗКл.НайтиСтроки(СтруктНом);
				Если ПоискОпл.Количество()>0 тогда //оплачен
					
					Если ПоискОпл[0].ДатаОплаты>КонецДня(ДН) тогда // поздняя оплата					
						Обл.Параметры.ДатаОпл2=?(ПоискОпл[0].СуммаОплаты=0,"",Формат(ПоискОпл[0].ДатаОплаты, "ДФ=dd.MM.yy"));	
						Обл.Параметры.ФормаОпл2=ПоискОпл[0].Вид+?(ПоискОпл[0].КредитнаяКарта,"(КК)","");	
						
					иначе
						Обл.Параметры.ДатаОпл=?(ПоискОпл[0].СуммаОплаты=0,"",Формат(ПоискОпл[0].ДатаОплаты, "ДФ=dd.MM.yy"));	
						Обл.Параметры.ФормаОпл=ПоискОпл[0].Вид+?(ПоискОпл[0].КредитнаяКарта,"(КК)","");	
					КонецЕсли;
				КонецЕсли;
				
				//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
				ПолеОтчета.Вывести(Обл);
			КонецЦикла; 
		иначе
				Обл=Макет.ПолучитьОбласть("Строка");
				//ДТ	1	Мес	Нед	ДН	УЭ	Комната	тип	Сумма	КолВоЧел	СуммаОпл	ДатаОпл	ФормаОпл
				Обл.Параметры.ДТ=Формат(ДН, "ДФ=dd.MM.yy");
				Обл.Параметры.Мес=Строка(Месяц(ДН))+" " + Формат(Год(ДН), "ЧГ=");
				Обл.Параметры.Нед=Формат(НеделяГода(ДН), "ЧГ=");
				Обл.Параметры.ДН=ДеньНедели(ДН);
				Обл.Параметры.УЭ=?(ДеньНедели(ДН)>5,1,0);
				Обл.Параметры.Комната=СпрН.Ссылка;
				Обл.Параметры.тип=СпрН.КатегорияНомера;
				
				//ЭлементыФормы.ПолеОтчета.Вывести(Обл);		
				ПолеОтчета.Вывести(Обл); 		
			конецесли;
			
			
		КонецЦикла;
		
		ДН=ДН+86400;
	КонецЦикла;
	
КонецПроцедуры
//

&НаСервере
Функция ПолучитьТаблицуПоКлиенту(Клиент)   
	ЗапросОплат=Новый Запрос("ВЫБРАТЬ
	                         |	ВыпискаБанка.Дата КАК Дата,
	                         |	ВыпискаБанка.Сумма,
	                         |	""БезНал"" КАК Вид,
	                         |	ЛОЖЬ КАК КредитнаяКарта
	                         |ИЗ
	                         |	Документ.ВыпискаБанка КАК ВыпискаБанка
	                         |ГДЕ
	                         |	ВыпискаБанка.ОтКого = &ОтКого
	                         |	И ВыпискаБанка.Дата >= &Дата
	                         |
	                         |ОБЪЕДИНИТЬ ВСЕ
	                         |
	                         |ВЫБРАТЬ
	                         |	КассовыйДокумент.Дата,
	                         |	КассовыйДокумент.Сумма,
	                         |	""Нал"",
	                         |	КассовыйДокумент.КредитнаяКарта
	                         |ИЗ
	                         |	Документ.КассовыйДокумент КАК КассовыйДокумент
	                         |ГДЕ
	                         |	КассовыйДокумент.ОтКого = &ОтКого
	                         |	И КассовыйДокумент.Дата >= &Дата
	                         |
	                         |УПОРЯДОЧИТЬ ПО
	                         |	Дата УБЫВ");
	ЗапросОплат.УстановитьПараметр("ОтКого",Клиент);
	ЗапросОплат.УстановитьПараметр("Дата",Дата(2015,12,01));

	ТЗОпл=ЗапросОплат.Выполнить().Выгрузить();
	
	Запрос_Номеров=Новый Запрос("ВЫБРАТЬ
	                            |	ПроданныеНомера.Бронь,
	                            |	ПроданныеНомера.Клиент,
	                            |	ПроданныеНомера.НомерВРезерв,
	                            |	ПроданныеНомера.ДатаПродажи КАК ДатаПродажи,
	                            |	ПроданныеНомера.ДатаПродажи КАК ДатаОплаты,
	                            |	ПроданныеНомера.СуммаКоррекция КАК СуммаОплаты,
	                            |	""           "" КАК Вид,
	                            |	ЛОЖЬ КАК КредитнаяКарта,
	                            |	ПроданныеНомера.СуммаЗаПроживание КАК Сумма
	                            |ИЗ
	                            |	РегистрСведений.ПроданныеНомера КАК ПроданныеНомера
	                            |ГДЕ
	                            |	ПроданныеНомера.Бронь.Оплачивает = &Клиент
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	ДатаПродажи УБЫВ");
	Запрос_Номеров.УстановитьПараметр("Клиент",Клиент);
	
	ТЗНомеров=Запрос_Номеров.Выполнить().Выгрузить();
	
	ТЗНомеров.ЗаполнитьЗначения(0,"СуммаОплаты");
	Если ТЗНомеров.Количество()=0 тогда
		возврат ТЗНомеров;
	конецесли;
	
	Для каждого СтрОпл из ТЗОпл цикл
		СуммаОпл=СтрОпл.Сумма;
		Пока СуммаОпл>0 цикл
			Для каждого СтрНом из ТЗНомеров цикл
				Если СтрНом.СуммаОплаты<СтрНом.Сумма тогда
					// не оплачено.
					СуммаДолга=СтрНом.Сумма-СтрНом.СуммаОплаты;
					Если СуммаОпл>=СуммаДолга тогда
						СуммаОпл=СуммаОпл-СуммаДолга;
						СтрНом.СуммаОплаты=СтрНом.СуммаОплаты+СуммаДолга;
						СтрНом.Вид=СтрОпл.Вид;
						СтрНом.ДатаОплаты=СтрОпл.Дата;
						СтрНом.КредитнаяКарта=СтрОпл.КредитнаяКарта;
					иначе
						СтрНом.СуммаОплаты=СтрНом.СуммаОплаты+СуммаОпл;
						СуммаОпл=0;
						СтрНом.Вид=СтрОпл.Вид;
						СтрНом.ДатаОплаты=СтрОпл.Дата;
						СтрНом.КредитнаяКарта=СтрОпл.КредитнаяКарта;
						
					КонецЕсли;
				конецесли;
				
			конеццикла;
			прервать;
			
		КонецЦикла;		
	КонецЦикла;
	
	Возврат ТЗНомеров;
	
КонецФункции
//

//
&НаКлиенте
Процедура ОсновныеДействияФормыТестКлиента___(Кнопка)
	//Клиент=Справочники.Клиенты.ПустаяСсылка();
	//ВвестиЗначение(Клиент);
	//ТЗ=ПолучитьТаблицуПоКлиенту(Клиент);
	//
	//Сообщить("ОК");
КонецПроцедуры


&НаКлиенте
Процедура ТестКлиента(Команда)
	Клиент=ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");
	
	//ВвестиЗначение(Клиент);
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВводЗначенияКлиент", ЭтаФорма);
	ПоказатьВводЗначения(Оповещение, Клиент);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВводЗначенияКлиент(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;	

Клиент = Результат; 	
ТЗ=ПолучитьТаблицуПоКлиенту(Клиент);
	
Сообщить("ОК");
КонецПроцедуры



