
&НаКлиенте
Процедура СформироватьОтчет(Команда)
//Если НЕ ЗначениеЗаполнено(Месяц) Тогда Возврат; КонецЕсли;

СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
СтатистикаОплаты.Очистить();

//
ЗапросВыпискаПроживание = Новый Запрос(
"ВЫБРАТЬ
|	ЕСТЬNULL(СУММА(Заявки.СуммаПроживание), 0) КАК СуммаПроживание,
|	ЕСТЬNULL(СУММА(Заявки.ОплаченоНомеровНочей), 0) КАК ОплаченоНомеровНочей
|ИЗ
|	(ВЫБРАТЬ
|		Распределение.ДокументОплаты КАК ДокументОплаты,
|		СУММА(Распределение.СуммаПроживание) КАК СуммаПроживание,
|		СУММА(ВЫРАЗИТЬ(Распределение.СуммаПроживание / ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 1))) КАК ОплаченоНомеровНочей
|	ИЗ
|		Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
|				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаПроживание
|			ИЗ
|				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
|			
|			СГРУППИРОВАТЬ ПО
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК Распределение
|			ПО ЗаявкаНаБронированиеПроживание.Ссылка = Распределение.Ссылка
|				И ЗаявкаНаБронированиеПроживание.ГУИД = Распределение.ДолгиГУИД
|	ГДЕ
|		ЗаявкаНаБронированиеПроживание.Ссылка.ПометкаУдаления = ЛОЖЬ
|		И ЗаявкаНаБронированиеПроживание.Ссылка.ТипБронирования <> &ТипБронирования
|		И ЗаявкаНаБронированиеПроживание.ДеньПроживания >= &ДатаС
|		И ЗаявкаНаБронированиеПроживание.ДеньПроживания <= &ДатаПо
|		И ВЫБОР
|				КОГДА ТИПЗНАЧЕНИЯ(Распределение.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
|					ТОГДА Распределение.ДокументОплаты.ЭтоЭквайринг = &ЭтоЭквайринг
|				ИНАЧЕ ЛОЖЬ
|			КОНЕЦ
|	
|	СГРУППИРОВАТЬ ПО
|		Распределение.ДокументОплаты) КАК Заявки");

ЗапросВыпискаПроживание.УстановитьПараметр("ДатаС", ДатаС);
ЗапросВыпискаПроживание.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросВыпискаПроживание.УстановитьПараметр("ЭтоЭквайринг", Ложь);
ЗапросВыпискаПроживание.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = ЗапросВыпискаПроживание.Выполнить().Выгрузить();

//СтрокаПроживаниеВыпискаНеЭквайринг = ТЗ[0]; 
СтрокаПроживание = ТЗ[0]; 

ЗапросВыпискаУслуги = Новый Запрос("ВЫБРАТЬ
                                   |	ЕСТЬNULL(СУММА(Заявки.СуммаУслуги), 0) КАК СуммаУслуги
                                   |ИЗ
                                   |	(ВЫБРАТЬ
                                   |		Распределение.ДокументОплаты КАК ДокументОплаты,
                                   |		СУММА(Распределение.СуммаУслуги) КАК СуммаУслуги
                                   |	ИЗ
                                   |		Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                                   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                                   |				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаУслуги
                                   |			ИЗ
                                   |				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                                   |			
                                   |			СГРУППИРОВАТЬ ПО
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК Распределение
                                   |			ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = Распределение.Ссылка
                                   |				И ЗаявкаНаБронированиеДопУслуги.ГУИД = Распределение.ДолгиГУИД
                                   |	ГДЕ
                                   |		ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
                                   |		И ЗаявкаНаБронированиеДопУслуги.Ссылка.ТипБронирования <> &ТипБронирования
                                   |		И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги >= &ДатаС
                                   |		И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги <= &ДатаПо
                                   |		И ВЫБОР
                                   |				КОГДА ТИПЗНАЧЕНИЯ(Распределение.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                                   |					ТОГДА Распределение.ДокументОплаты.ЭтоЭквайринг = &ЭтоЭквайринг
                                   |				ИНАЧЕ ЛОЖЬ
                                   |			КОНЕЦ
                                   |	
                                   |	СГРУППИРОВАТЬ ПО
                                   |		Распределение.ДокументОплаты) КАК Заявки");

ЗапросВыпискаУслуги.УстановитьПараметр("ДатаС", ДатаС);
ЗапросВыпискаУслуги.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросВыпискаУслуги.УстановитьПараметр("ЭтоЭквайринг", Ложь);
ЗапросВыпискаУслуги.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = ЗапросВыпискаУслуги.Выполнить().Выгрузить();
//СтрокаУслугиВыпискаНеЭквайринг = ТЗ[0]; 
СтрокаУслуги = ТЗ[0]; 

НоваяСтрока = СтатистикаОплаты.Добавить();
НоваяСтрока.ТипОплаты = "б/н";
НоваяСтрока.СуммаПроживание = Окр(СтрокаПроживание.СуммаПроживание);
НоваяСтрока.ОплаченоНомеровНочей = СтрокаПроживание.ОплаченоНомеровНочей;
НоваяСтрока.СуммаУслуги = Окр(СтрокаУслуги.СуммаУслуги);


//
ЗапросКассовыйДокументПроживание = Новый Запрос(
"ВЫБРАТЬ
|	ЕСТЬNULL(СУММА(Заявки.СуммаПроживание), 0) КАК СуммаПроживание,
|	ЕСТЬNULL(СУММА(Заявки.ОплаченоНомеровНочей), 0) КАК ОплаченоНомеровНочей
|ИЗ
|	(ВЫБРАТЬ
|		Распределение.ДокументОплаты КАК ДокументОплаты,
|		ВЫБОР
|			КОГДА &Наличные
|				ТОГДА СУММА(ВЫРАЗИТЬ(Распределение.СуммаПроживание * Распределение.ДокументОплаты.СуммаНаличные / (Распределение.ДокументОплаты.СуммаНаличные + Распределение.ДокументОплаты.СуммаКарта) КАК ЧИСЛО(10, 2)))
|			ИНАЧЕ СУММА(ВЫРАЗИТЬ(Распределение.СуммаПроживание * Распределение.ДокументОплаты.СуммаКарта / (Распределение.ДокументОплаты.СуммаНаличные + Распределение.ДокументОплаты.СуммаКарта) КАК ЧИСЛО(10, 2)))
|		КОНЕЦ КАК СуммаПроживание,
|		ВЫБОР
|			КОГДА &Наличные
|				ТОГДА СУММА(ВЫРАЗИТЬ(Распределение.СуммаПроживание * Распределение.ДокументОплаты.СуммаНаличные / (Распределение.ДокументОплаты.СуммаНаличные + Распределение.ДокументОплаты.СуммаКарта) / ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 1)))
|			ИНАЧЕ СУММА(ВЫРАЗИТЬ(Распределение.СуммаПроживание * Распределение.ДокументОплаты.СуммаКарта / (Распределение.ДокументОплаты.СуммаНаличные + Распределение.ДокументОплаты.СуммаКарта) / ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 1)))
|		КОНЕЦ КАК ОплаченоНомеровНочей
|	ИЗ
|		Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
|				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаПроживание
|			ИЗ
|				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
|			
|			СГРУППИРОВАТЬ ПО
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК Распределение
|			ПО ЗаявкаНаБронированиеПроживание.Ссылка = Распределение.Ссылка
|				И ЗаявкаНаБронированиеПроживание.ГУИД = Распределение.ДолгиГУИД
|	ГДЕ
|		ЗаявкаНаБронированиеПроживание.Ссылка.ПометкаУдаления = ЛОЖЬ
|		И ЗаявкаНаБронированиеПроживание.Ссылка.ТипБронирования <> &ТипБронирования
|		И ЗаявкаНаБронированиеПроживание.ДеньПроживания >= &ДатаС
|		И ЗаявкаНаБронированиеПроживание.ДеньПроживания <= &ДатаПо
|		И ВЫБОР
|				КОГДА ТИПЗНАЧЕНИЯ(Распределение.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
|					ТОГДА ВЫБОР
|							КОГДА &Наличные
|								ТОГДА Распределение.ДокументОплаты.СуммаНаличные <> 0
|							ИНАЧЕ Распределение.ДокументОплаты.СуммаКарта <> 0
|						КОНЕЦ
|				ИНАЧЕ ЛОЖЬ
|			КОНЕЦ
|	
|	СГРУППИРОВАТЬ ПО
|		Распределение.ДокументОплаты) КАК Заявки");

ЗапросКассовыйДокументПроживание.УстановитьПараметр("ДатаС", ДатаС);
ЗапросКассовыйДокументПроживание.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросКассовыйДокументПроживание.УстановитьПараметр("Наличные", Ложь);
ЗапросКассовыйДокументПроживание.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = ЗапросКассовыйДокументПроживание.Выполнить().Выгрузить();

//СтрокаПроживаниеКарта = ТЗ[0]; 
СтрокаПроживание = ТЗ[0]; 

ЗапросКассовыйДокументУслуги = Новый Запрос("ВЫБРАТЬ
                                            |	ЕСТЬNULL(СУММА(Заявки.СуммаУслуги), 0) КАК СуммаУслуги
                                            |ИЗ
                                            |	(ВЫБРАТЬ
                                            |		Распределение.ДокументОплаты КАК ДокументОплаты,
                                            |		ВЫБОР
                                            |			КОГДА &Наличные
                                            |				ТОГДА СУММА(ВЫРАЗИТЬ(Распределение.СуммаУслуги * Распределение.ДокументОплаты.СуммаНаличные / (Распределение.ДокументОплаты.СуммаНаличные + Распределение.ДокументОплаты.СуммаКарта) КАК ЧИСЛО(10, 2)))
                                            |			ИНАЧЕ СУММА(ВЫРАЗИТЬ(Распределение.СуммаУслуги * Распределение.ДокументОплаты.СуммаКарта / (Распределение.ДокументОплаты.СуммаНаличные + Распределение.ДокументОплаты.СуммаКарта) КАК ЧИСЛО(10, 2)))
                                            |		КОНЕЦ КАК СуммаУслуги
                                            |	ИЗ
                                            |		Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                                            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                                            |				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаУслуги
                                            |			ИЗ
                                            |				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                                            |			
                                            |			СГРУППИРОВАТЬ ПО
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК Распределение
                                            |			ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = Распределение.Ссылка
                                            |				И ЗаявкаНаБронированиеДопУслуги.ГУИД = Распределение.ДолгиГУИД
                                            |	ГДЕ
                                            |		ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
                                            |		И ЗаявкаНаБронированиеДопУслуги.Ссылка.ТипБронирования <> &ТипБронирования
                                            |		И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги >= &ДатаС
                                            |		И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги <= &ДатаПо
                                            |		И ВЫБОР
                                            |				КОГДА ТИПЗНАЧЕНИЯ(Распределение.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                                            |					ТОГДА ВЫБОР
                                            |							КОГДА &Наличные
                                            |								ТОГДА Распределение.ДокументОплаты.СуммаНаличные <> 0
                                            |							ИНАЧЕ Распределение.ДокументОплаты.СуммаКарта <> 0
                                            |						КОНЕЦ
                                            |				ИНАЧЕ ЛОЖЬ
                                            |			КОНЕЦ
                                            |	
                                            |	СГРУППИРОВАТЬ ПО
                                            |		Распределение.ДокументОплаты) КАК Заявки");

ЗапросКассовыйДокументУслуги.УстановитьПараметр("ДатаС", ДатаС);
ЗапросКассовыйДокументУслуги.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросКассовыйДокументУслуги.УстановитьПараметр("Наличные", Ложь);
ЗапросКассовыйДокументУслуги.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = ЗапросКассовыйДокументУслуги.Выполнить().Выгрузить();

//СтрокаУслугиКарта = ТЗ[0]; 
СтрокаУслуги = ТЗ[0]; 

НоваяСтрока = СтатистикаОплаты.Добавить();
НоваяСтрока.ТипОплаты = "к/к";
НоваяСтрока.СуммаПроживание = Окр(СтрокаПроживание.СуммаПроживание);
НоваяСтрока.ОплаченоНомеровНочей = СтрокаПроживание.ОплаченоНомеровНочей;
НоваяСтрока.СуммаУслуги = Окр(СтрокаУслуги.СуммаУслуги);

//
ЗапросКассовыйДокументПроживание.УстановитьПараметр("ДатаС", ДатаС);
ЗапросКассовыйДокументПроживание.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросКассовыйДокументПроживание.УстановитьПараметр("Наличные", Истина);

ТЗ = ЗапросКассовыйДокументПроживание.Выполнить().Выгрузить();

//СтрокаПроживаниеНаличные = ТЗ[0]; 
СтрокаПроживание = ТЗ[0]; 

ЗапросКассовыйДокументУслуги.УстановитьПараметр("ДатаС", ДатаС);
ЗапросКассовыйДокументУслуги.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросКассовыйДокументУслуги.УстановитьПараметр("Наличные", Истина);

ТЗ = ЗапросКассовыйДокументУслуги.Выполнить().Выгрузить();

//СтрокаУслугиНаличные = ТЗ[0]; 
СтрокаУслуги = ТЗ[0]; 

НоваяСтрока = СтатистикаОплаты.Добавить();
НоваяСтрока.ТипОплаты = "нал";
НоваяСтрока.СуммаПроживание = Окр(СтрокаПроживание.СуммаПроживание);
НоваяСтрока.ОплаченоНомеровНочей = СтрокаПроживание.ОплаченоНомеровНочей;
НоваяСтрока.СуммаУслуги = Окр(СтрокаУслуги.СуммаУслуги);
//

//
ЗапросВыпискаПроживаниеPayKeeper = Новый Запрос(
"ВЫБРАТЬ
|	ЕСТЬNULL(СУММА(Заявки.СуммаПроживание), 0) КАК СуммаПроживание,
|	ЕСТЬNULL(СУММА(Заявки.ОплаченоНомеровНочей), 0) КАК ОплаченоНомеровНочей
|ИЗ
|	(ВЫБРАТЬ
|		Распределение.ДокументОплаты КАК ДокументОплаты,
|		СУММА(Распределение.СуммаПроживание) КАК СуммаПроживание,
|		СУММА(ВЫРАЗИТЬ(Распределение.СуммаПроживание / ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 1))) КАК ОплаченоНомеровНочей
|	ИЗ
|		Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
|				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаПроживание
|			ИЗ
|				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
|			
|			СГРУППИРОВАТЬ ПО
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
|				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК Распределение
|			ПО ЗаявкаНаБронированиеПроживание.Ссылка = Распределение.Ссылка
|				И ЗаявкаНаБронированиеПроживание.ГУИД = Распределение.ДолгиГУИД
|	ГДЕ
|		ЗаявкаНаБронированиеПроживание.Ссылка.ПометкаУдаления = ЛОЖЬ
|		И ЗаявкаНаБронированиеПроживание.Ссылка.ТипБронирования <> &ТипБронирования
|		И ЗаявкаНаБронированиеПроживание.ДеньПроживания >= &ДатаС
|		И ЗаявкаНаБронированиеПроживание.ДеньПроживания <= &ДатаПо
|		И ВЫБОР
|				КОГДА ТИПЗНАЧЕНИЯ(Распределение.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
|					ТОГДА Распределение.ДокументОплаты.ЭтоЭквайринг = &ЭтоЭквайринг
|				ИНАЧЕ ЛОЖЬ
|			КОНЕЦ
|		И (Распределение.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%"") = &ЭтоСБП
|	
|	СГРУППИРОВАТЬ ПО
|		Распределение.ДокументОплаты) КАК Заявки");

ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ДатаС", ДатаС);
ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ЭтоЭквайринг", Истина);
ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ЭтоСБП", Ложь);
ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = ЗапросВыпискаПроживаниеPayKeeper.Выполнить().Выгрузить();

//СтрокаПроживаниеВыпискаЭквайринг = ТЗ[0]; 
СтрокаПроживание = ТЗ[0]; 

ЗапросВыпискаУслугиPayKeeper = Новый Запрос("ВЫБРАТЬ
                                   |	ЕСТЬNULL(СУММА(Заявки.СуммаУслуги), 0) КАК СуммаУслуги
                                   |ИЗ
                                   |	(ВЫБРАТЬ
                                   |		Распределение.ДокументОплаты КАК ДокументОплаты,
                                   |		СУММА(Распределение.СуммаУслуги) КАК СуммаУслуги
                                   |	ИЗ
                                   |		Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                                   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                                   |				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаУслуги
                                   |			ИЗ
                                   |				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                                   |			
                                   |			СГРУППИРОВАТЬ ПО
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
                                   |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК Распределение
                                   |			ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = Распределение.Ссылка
                                   |				И ЗаявкаНаБронированиеДопУслуги.ГУИД = Распределение.ДолгиГУИД
                                   |	ГДЕ
                                   |		ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
                                   |		И ЗаявкаНаБронированиеДопУслуги.Ссылка.ТипБронирования <> &ТипБронирования
                                   |		И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги >= &ДатаС
                                   |		И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги <= &ДатаПо
                                   |		И ВЫБОР
                                   |				КОГДА ТИПЗНАЧЕНИЯ(Распределение.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                                   |					ТОГДА Распределение.ДокументОплаты.ЭтоЭквайринг = &ЭтоЭквайринг
                                   |				ИНАЧЕ ЛОЖЬ
                                   |			КОНЕЦ
                                   |		И (Распределение.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%"") = &ЭтоСБП
                                   |	
                                   |	СГРУППИРОВАТЬ ПО
                                   |		Распределение.ДокументОплаты) КАК Заявки");

ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ДатаС", ДатаС);
ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ЭтоЭквайринг", Истина);
ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ЭтоСБП", Ложь);
ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = ЗапросВыпискаУслугиPayKeeper.Выполнить().Выгрузить();

//СтрокаУслугиВыпискаЭквайринг = ТЗ[0]; 
СтрокаУслуги = ТЗ[0]; 

НоваяСтрока = СтатистикаОплаты.Добавить();
НоваяСтрока.ТипОплаты = "Pay Keeper";
НоваяСтрока.СуммаПроживание = Окр(СтрокаПроживание.СуммаПроживание);
НоваяСтрока.ОплаченоНомеровНочей = СтрокаПроживание.ОплаченоНомеровНочей;
НоваяСтрока.СуммаУслуги = Окр(СтрокаУслуги.СуммаУслуги);
//

ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ДатаС", ДатаС);
ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ЭтоЭквайринг", Истина);
ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ЭтоСБП", Истина);
ЗапросВыпискаПроживаниеPayKeeper.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = ЗапросВыпискаПроживаниеPayKeeper.Выполнить().Выгрузить();

СтрокаПроживание = ТЗ[0];

ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ДатаС", ДатаС);
ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ЭтоЭквайринг", Истина);
ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ЭтоСБП", Истина);
ЗапросВыпискаУслугиPayKeeper.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = ЗапросВыпискаУслугиPayKeeper.Выполнить().Выгрузить();

//СтрокаУслугиВыпискаЭквайринг = ТЗ[0]; 
СтрокаУслуги = ТЗ[0]; 

НоваяСтрока = СтатистикаОплаты.Добавить();
НоваяСтрока.ТипОплаты = "Pay Keeper СБП";
НоваяСтрока.СуммаПроживание = Окр(СтрокаПроживание.СуммаПроживание);
НоваяСтрока.ОплаченоНомеровНочей = СтрокаПроживание.ОплаченоНомеровНочей;
НоваяСтрока.СуммаУслуги = Окр(СтрокаУслуги.СуммаУслуги);
//

//
ЗапросПрочиеОплатыПроживание = Новый Запрос("ВЫБРАТЬ
                                            |	ЕСТЬNULL(СУММА(Заявки.СуммаПроживание), 0) КАК СуммаПроживание,
                                            |	ЕСТЬNULL(СУММА(Заявки.ОплаченоНомеровНочей), 0) КАК ОплаченоНомеровНочей
                                            |ИЗ
                                            |	(ВЫБРАТЬ
                                            |		Распределение.ДокументОплаты КАК ДокументОплаты,
                                            |		СУММА(Распределение.СуммаПроживание) КАК СуммаПроживание,
                                            |		СУММА(ВЫРАЗИТЬ(Распределение.СуммаПроживание / ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 1))) КАК ОплаченоНомеровНочей
                                            |	ИЗ
                                            |		Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                                            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                                            |				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаПроживание
                                            |			ИЗ
                                            |				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                                            |			
                                            |			СГРУППИРОВАТЬ ПО
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
                                            |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК Распределение
                                            |			ПО ЗаявкаНаБронированиеПроживание.Ссылка = Распределение.Ссылка
                                            |				И ЗаявкаНаБронированиеПроживание.ГУИД = Распределение.ДолгиГУИД
                                            |	ГДЕ
                                            |		ЗаявкаНаБронированиеПроживание.Ссылка.ПометкаУдаления = ЛОЖЬ
                                            |		И ЗаявкаНаБронированиеПроживание.Ссылка.ТипБронирования <> &ТипБронирования
                                            |		И ЗаявкаНаБронированиеПроживание.ДеньПроживания >= &ДатаС
                                            |		И ЗаявкаНаБронированиеПроживание.ДеньПроживания <= &ДатаПо
                                            |		И ВЫБОР
                                            |				КОГДА ТИПЗНАЧЕНИЯ(Распределение.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                                            |					ТОГДА ВЫБОР
                                            |							КОГДА &ВСписке
                                            |								ТОГДА Распределение.ДокументОплаты.ВидОперации В (&ВидыОпераций)
                                            |							ИНАЧЕ НЕ Распределение.ДокументОплаты.ВидОперации В (&ВидыОпераций)
                                            |						КОНЕЦ
                                            |				ИНАЧЕ ЛОЖЬ
                                            |			КОНЕЦ
                                            |	
                                            |	СГРУППИРОВАТЬ ПО
                                            |		Распределение.ДокументОплаты) КАК Заявки");


ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ДатаС", ДатаС);
ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ВидыОпераций = Новый Массив;
ВидыОпераций.Добавить(Справочники.ВидыОпераций.оverbooking);
ВидыОпераций.Добавить(Справочники.ВидыОпераций.Списание);
ВидыОпераций.Добавить(Справочники.ВидыОпераций.СписаниеЗачет);
ВидыОпераций.Добавить(Справочники.ВидыОпераций.СписаниеДопУслуг);
ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ВидыОпераций", ВидыОпераций);

ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ВСписке", Ложь);

ТЗ = ЗапросПрочиеОплатыПроживание.Выполнить().Выгрузить();

//СтрокаПроживаниеПрочиеОплатыВзаимозачет = ТЗ[0]; 
СтрокаПроживание = ТЗ[0]; 

ЗапросПрочиеОплатыУслуги = Новый Запрос("ВЫБРАТЬ
                                        |	ЕСТЬNULL(СУММА(Заявки.СуммаУслуги), 0) КАК СуммаУслуги
                                        |ИЗ
                                        |	(ВЫБРАТЬ
                                        |		Распределение.ДокументОплаты КАК ДокументОплаты,
                                        |		СУММА(Распределение.СуммаУслуги) КАК СуммаУслуги
                                        |	ИЗ
                                        |		Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                                        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                                        |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                                        |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                                        |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                                        |				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаУслуги
                                        |			ИЗ
                                        |				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                                        |			
                                        |			СГРУППИРОВАТЬ ПО
                                        |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                                        |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
                                        |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК Распределение
                                        |			ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = Распределение.Ссылка
                                        |				И ЗаявкаНаБронированиеДопУслуги.ГУИД = Распределение.ДолгиГУИД
                                        |	ГДЕ
                                        |		ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
                                        |		И ЗаявкаНаБронированиеДопУслуги.Ссылка.ТипБронирования <> &ТипБронирования
                                        |		И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги >= &ДатаС
                                        |		И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги <= &ДатаПо
                                        |		И ВЫБОР
                                        |				КОГДА ТИПЗНАЧЕНИЯ(Распределение.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                                        |					ТОГДА ВЫБОР
                                        |							КОГДА &ВСписке
                                        |								ТОГДА Распределение.ДокументОплаты.ВидОперации В (&ВидыОпераций)
                                        |							ИНАЧЕ НЕ Распределение.ДокументОплаты.ВидОперации В (&ВидыОпераций)
                                        |						КОНЕЦ
                                        |				ИНАЧЕ ЛОЖЬ
                                        |			КОНЕЦ
                                        |	
                                        |	СГРУППИРОВАТЬ ПО
                                        |		Распределение.ДокументОплаты) КАК Заявки");

ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ДатаС", ДатаС);
ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ДатаПо", ДатаПо);
ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

//ВидыОпераций = Новый Массив;
//ВидыОпераций.Добавить(Справочники.ВидыОпераций.Взаимозачет);
ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ВидыОпераций", ВидыОпераций);

ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ВСписке", Ложь);

ТЗ = ЗапросПрочиеОплатыУслуги.Выполнить().Выгрузить();

//СтрокаУслугиПрочиеОплатыВзаимозачет = ТЗ[0]; 
СтрокаУслуги = ТЗ[0]; 

НоваяСтрока = СтатистикаОплаты.Добавить();
НоваяСтрока.ТипОплаты = "в/з";
НоваяСтрока.СуммаПроживание = Окр(СтрокаПроживание.СуммаПроживание);
НоваяСтрока.ОплаченоНомеровНочей = СтрокаПроживание.ОплаченоНомеровНочей;
НоваяСтрока.СуммаУслуги = Окр(СтрокаУслуги.СуммаУслуги);

//
ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ДатаС", ДатаС);
ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ДатаПо", ДатаПо);

ВидыОпераций = Новый Массив;
ВидыОпераций.Добавить(Справочники.ВидыОпераций.Списание);
//ВидыОпераций.Добавить(Справочники.ВидыОпераций.СписаниеДопУслуг);
ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ВидыОпераций", ВидыОпераций);

ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ВСписке", Истина);

ТЗ = ЗапросПрочиеОплатыПроживание.Выполнить().Выгрузить();

//СтрокаПроживаниеПрочиеОплатыСписание = ТЗ[0]; 
СтрокаПроживание = ТЗ[0]; 

ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ДатаС", ДатаС);
ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ДатаПо", ДатаПо);

//ВидыОпераций = Новый Массив;
//ВидыОпераций.Добавить(Справочники.ВидыОпераций.Списание);
////ВидыОпераций.Добавить(Справочники.ВидыОпераций.СписаниеДопУслуг);
ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ВидыОпераций", ВидыОпераций);

ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ВСписке", Истина);

ТЗ = ЗапросПрочиеОплатыУслуги.Выполнить().Выгрузить();

//СтрокаУслугиПрочиеОплатыСписание = ТЗ[0]; 
СтрокаУслуги = ТЗ[0]; 

НоваяСтрока = СтатистикаОплаты.Добавить();
НоваяСтрока.ТипОплаты = "списание";
НоваяСтрока.СуммаПроживание = Окр(СтрокаПроживание.СуммаПроживание);
НоваяСтрока.ОплаченоНомеровНочей = СтрокаПроживание.ОплаченоНомеровНочей;
НоваяСтрока.СуммаУслуги = Окр(СтрокаУслуги.СуммаУслуги);

//
ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ДатаС", ДатаС);
ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ДатаПо", ДатаПо);

ВидыОпераций = Новый Массив;
//ВидыОпераций.Добавить(Справочники.ВидыОпераций.Списание);
ВидыОпераций.Добавить(Справочники.ВидыОпераций.СписаниеДопУслуг);
ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ВидыОпераций", ВидыОпераций);

ЗапросПрочиеОплатыПроживание.УстановитьПараметр("ВСписке", Истина);

ТЗ = ЗапросПрочиеОплатыПроживание.Выполнить().Выгрузить();

//СтрокаПроживаниеПрочиеОплатыСписаниеДопУслуг = ТЗ[0]; 
СтрокаПроживание = ТЗ[0]; 

ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ДатаС", ДатаС);
ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ДатаПо", ДатаПо);

//ВидыОпераций = Новый Массив;
////ВидыОпераций.Добавить(Справочники.ВидыОпераций.Списание);
//ВидыОпераций.Добавить(Справочники.ВидыОпераций.СписаниеДопУслуг);
ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ВидыОпераций", ВидыОпераций);

ЗапросПрочиеОплатыУслуги.УстановитьПараметр("ВСписке", Истина);

ТЗ = ЗапросПрочиеОплатыУслуги.Выполнить().Выгрузить();

СтрокаУслугиПрочиеОплатыСписаниеДопУслуг = ТЗ[0]; 
СтрокаУслуги = ТЗ[0]; 

НоваяСтрока = СтатистикаОплаты.Добавить();
НоваяСтрока.ТипОплаты = "списание услуг";
НоваяСтрока.СуммаПроживание = Окр(СтрокаПроживание.СуммаПроживание);
НоваяСтрока.ОплаченоНомеровНочей = СтрокаПроживание.ОплаченоНомеровНочей;
НоваяСтрока.СуммаУслуги = Окр(СтрокаУслуги.СуммаУслуги);

Для Каждого Строка Из СтатистикаОплаты Цикл
	Строка.СуммаРаспределено = Строка.СуммаПроживание + Строка.СуммаУслуги;
КонецЦикла;


////
ПолеОтчета.Очистить();	

//
ОбъектМакет = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектМакет.ПолучитьМакет("Макет");

Макет = Отчеты.СтатистикаОплаты.ПолучитьМакет("Макет");

ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
ОбластьЗаголовок.Параметры.ДатаС = Формат(ДатаС, "ДФ=dd.MM.yy");
ОбластьЗаголовок.Параметры.ДатаПо = Формат(ДатаПо, "ДФ=dd.MM.yy");
ПолеОтчета.Вывести(ОбластьЗаголовок);

ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(ОбластьШапка);

СуммаРаспределеноИтого = СтатистикаОплаты.Итог("СуммаРаспределено");
Для Каждого Строка Из СтатистикаОплаты Цикл
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьСтрока.Параметры.ТипОплаты = Строка.ТипОплаты;

	ОбластьСтрока.Параметры.СуммаПроживание = Строка.СуммаПроживание;
	ОбластьСтрока.Параметры.ОплаченоНомеровНочей = Строка.ОплаченоНомеровНочей;

	ОбластьСтрока.Параметры.СуммаУслуги = Строка.СуммаУслуги;

	Строка.СуммаРаспределено = Строка.СуммаПроживание + Строка.СуммаУслуги;
	ОбластьСтрока.Параметры.СуммаРаспределено = Строка.СуммаРаспределено;

	Если СуммаРаспределеноИтого <> 0 Тогда
		Строка.Процент = Окр(100 * Строка.СуммаРаспределено / СуммаРаспределеноИтого);
		ОбластьСтрока.Параметры.Процент = Строка.Процент;
	КонецЕсли;

	ПолеОтчета.Вывести(ОбластьСтрока);
КонецЦикла;
//


//
ОбластьСтрока = Макет.ПолучитьОбласть("Итоги");
ОбластьСтрока.Параметры.ТипОплаты = "Итоги";

СуммаПроживаниеИтого = СтатистикаОплаты.Итог("СуммаПроживание");
ОплаченоНомеровНочейИтого = СтатистикаОплаты.Итог("ОплаченоНомеровНочей");
СуммаУслугиИтого =  СтатистикаОплаты.Итог("СуммаУслуги");

ОбластьСтрока.Параметры.СуммаПроживание = СуммаПроживаниеИтого;
ОбластьСтрока.Параметры.ОплаченоНомеровНочей = ОплаченоНомеровНочейИтого;
ОбластьСтрока.Параметры.СуммаУслуги = СуммаУслугиИтого;

ОбластьСтрока.Параметры.СуммаРаспределено = СуммаРаспределеноИтого;

ПолеОтчета.Вывести(ОбластьСтрока);
//

ВывестиДиаграмму(Макет);


КонецПроцедуры

&НаСервере
Процедура ВывестиДиаграмму(Макет)
ОбластьМакета = Макет.ПолучитьОбласть("Диаграмма");


//
Круг = ОбластьМакета.Рисунки.D1;
Диаграмма = Круг.Объект;

ФорматПроцентовВПодписях = "ЧДЦ=0";
Диаграмма.ФорматПроцентовВПодписях = ФорматПроцентовВПодписях;

ТЗДиаграммы = Новый ТаблицаЗначений;
ТЗДиаграммы.Колонки.Добавить("Измерение");
//ТЗДиаграммы.Колонки.Добавить("Точка");
ТЗДиаграммы.Колонки.Добавить("Ресурс");
  
Для Каждого Строка Из СтатистикаОплаты Цикл
	НоваяСтрока = ТЗДиаграммы.Добавить();
	
	НоваяСтрока.Измерение = Строка.ТипОплаты;
	НоваяСтрока.Ресурс = Строка.СуммаРаспределено;
	
	//НоваяСтрока.Точка = Строка.СуммаРаспределено;
КонецЦикла;

ТекущаяТочка = Диаграмма.УстановитьТочку("");

Для Каждого Строка из ТЗДиаграммы цикл
   // Получить серию, точку и значение для них
   ТекущаяСерия = Диаграмма.УстановитьСерию(Строка.Измерение);
   Диаграмма.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, Строка.Ресурс, ,) ;
   
   //ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
   ////ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
   //Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
   
  //ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
  //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
  // Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
КонецЦикла;


////  
//ТЗДиаграммы = Новый ТаблицаЗначений;
//ТЗДиаграммы.Колонки.Добавить("Измерение1");
//ТЗДиаграммы.Колонки.Добавить("Измерение2");
//ТЗДиаграммы.Колонки.Добавить("Точка");
//ТЗДиаграммы.Колонки.Добавить("Ресурс1");
//ТЗДиаграммы.Колонки.Добавить("Ресурс2");

  //НовСтр = ТЗДиаграммы.Добавить();
  //НовСтр.Измерение1="Склад1";
  //НовСтр.Измерение2="Склад2";
  //НовСтр.Точка="01/01/01";
  //НовСтр.Ресурс1=10;
  //НовСтр.Ресурс2=15;
 
////  НовСтр = ТЗДиаграммы.Добавить();
  //НовСтр.Измерение1="Склад1";
  //НовСтр.Измерение2="Склад2";
  //НовСтр.Точка="01/02/01";
  //НовСтр.Ресурс1=5;
  //НовСтр.Ресурс2=9;
 
   // Заполнить диаграмму
  //Для Каждого ТекСтр из ТЗДиаграммы цикл
  //     // Получить серию, точку и значение для них
  //     ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение1);
  //     ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
  //     Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс1, ,) ;
  //   
  //     ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
  //     //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
  //     Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
  //     
  //    //ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
  //    //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
  //    // Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
  // КонецЦикла;
   
  //// Раскрасить серии своими цветами
  //Для Каждого Серия из Диаграмма.Серии Цикл
  //   Если Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
  //      Серия.Цвет = WEBЦвета.Желтый;
  //   ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
  //      Серия.Цвет = WEBЦвета.Зеленый;
  //   ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Невыход Тогда
  //      Серия.Цвет = WEBЦвета.Красный;
  //   КонецЕсли;
  //КонецЦикла;
   
   // Разрешить обновление диаграммы
   //Диаграм.Обновление = Истина;
////  


	//Разрешить обновление диаграммы
   Диаграмма.Обновление = Истина;
   
ПолеОтчета.Вывести(ОбластьМакета);
КонецПроцедуры
