
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаС = ТекущаяДата();
ДатаПо = ДатаС;
КонецПроцедуры


&НаКлиенте
Процедура Отчет(Команда)
ПолеОтчета = ОтчетНаСервере();
КонецПроцедуры

&НаСервере
Функция ОтчетНаСервере()
ТабДок = Новый ТабличныйДокумент;	
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронирование.Дата КАК ДатаЗаявки,
                      |	ЗаявкаНаБронированиеСМС.НомерСтроки КАК НомерСтроки,
                      |	ЗаявкаНаБронированиеСМС.ДатаОтправки КАК ДатаОтправки,
                      |	ЗаявкаНаБронированиеСМС.Телефон КАК Телефон,
                      |	ЗаявкаНаБронированиеСМС.ОтметкаОтменаБронирования КАК ОтметкаОтменаБронирования,
                      |	ЗаявкаНаБронированиеСМС.Текст КАК Текст,
                      |	ЗаявкаНаБронированиеСМС.WhatsApp КАК WhatsApp,
                      |	ЗаявкаНаБронированиеСМС.КодОшибки КАК КодОшибки,
                      |	ЗаявкаНаБронированиеСМС.ОписаниеОшибки КАК ОписаниеОшибки,
                      |	ЗаявкаНаБронированиеСМС.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СМС КАК ЗаявкаНаБронированиеСМС
                      |		ПО ЗаявкаНаБронирование.Ссылка = ЗаявкаНаБронированиеСМС.Ссылка
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.ТипБронирования <> &ТипБронирования
                      |	И ЗаявкаНаБронирование.Дата >= &ДатаС
                      |	И ЗаявкаНаБронирование.Дата <= &ДатаПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаЗаявки,
                      |	Заявка,
                      |	ДатаОтправки");	
					  
Запрос.УстановитьПараметр("ДатаС", ДатаС);					  
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);					  
Запрос.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = Запрос.Выполнить().Выгрузить();	
	
ОтчетОбъект = РеквизитФормыВЗначение("Объект");
Макет = ОтчетОбъект.ПолучитьМакет("Макет");
Макет = Обработки.ОтчетСМС.ПолучитьМакет("Макет");

ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(ОбластьШапка);

Для Каждого Строка Из ТЗ Цикл
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьСтрока.Параметры.Дата = Формат(Строка.ДатаЗаявки, "ДФ=dd.MM.yy");
	ОбластьСтрока.Параметры.Заявка = Строка.Заявка;
	Если ЗначениеЗаполнено(Строка.Ссылка) Тогда
		ОбластьСтрока.Параметры.ДатаОтправки = Строка.ДатаОтправки;
		ОбластьСтрока.Параметры.Телефон = Строка.Телефон;
		ОбластьСтрока.Параметры.ОтменаБронирования = ОбщийФункционалСервер.Флажок(Строка.ОтметкаОтменаБронирования);
		ОбластьСтрока.Параметры.WhatsApp = ОбщийФункционалСервер.Флажок(Строка.WhatsApp);
		ОбластьСтрока.Параметры.Текст = Строка.Текст;
		ОбластьСтрока.Параметры.КодОшибки = Строка.КодОшибки;
		ОбластьСтрока.Параметры.ОписаниеОшибки = Строка.ОписаниеОшибки;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьСтрока);
КонецЦикла;

//ТабДок.ОтображатьСетку = Истина;
Возврат ТабДок;
КонецФункции


