
Функция ПолучитьЗаселения(ДатаС, ДатаПо, ИмяСервера) Экспорт
// Создаем HTTPСоединение, указываем сервер
Результат = Новый Структура("Ошибка, ТекстОшибки, Данные", Ложь, "", Неопределено);

Настройки = ПолучитьНастройки(ДатаС, ДатаПо, ИмяСервера);
Если Настройки.СерверДляЗапроса = "" Тогда
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибочная настройка константы " + ИмяСервера;
	
	Возврат Результат;
КонецЕсли;

Если Настройки.ТекстДляЗапроса = "" = Неопределено Тогда
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибочные настройки HTTP";
	
	Возврат Результат;
КонецЕсли;
	
Соединение = Новый HTTPСоединение(Настройки.СерверДляЗапроса,,,,, 120);

ИмяФайла = НастройкиСервер.КаталогБД() + "HTTPЗаселения" + ИмяСервера + ".txt";
//ИмяФайла = НастройкиСервер.КаталогБД() + "HTTPЗаселения"  + ".txt";

Попытка
	HTTPОтвет = Соединение.Получить(Настройки.ТекстДляЗапроса, ИмяФайла);
Исключение
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка соединения с HTTP: " + ОписаниеОшибки();
	
	Возврат Результат;
КонецПопытки;

Если HTTPОтвет.КодСостояния >= 300 Тогда
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка HTTP Соединение.Получить. Код состояния: " + HTTPОтвет.КодСостояния;

	Возврат Результат;
КонецЕсли;
//Сообщить("Удачно выполнен GET запрос!");

чтение = Новый ЧтениеJSON;
чтение.ОткрытьФайл(ИмяФайла);
    
ВСоответствие = Ложь;
Данные = ПрочитатьJSON(чтение, ВСоответствие);
    
чтение.Закрыть();

Результат.Данные = Данные;
Возврат Результат; 
КонецФункции

Функция ПолучитьНастройки(ДатаС, ДатаПо, ИмяСервера)
Результат = Новый Структура("СерверДляЗапроса, ТекстДляЗапроса", "", "");

СерверHTTP = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты(ИмяСервера);

Если ЗначениеЗаполнено(СерверHTTP) Тогда
	СерверДляЗапроса = СерверHTTP;
Иначе
	//СерверДляЗапроса = "127.0.0.1";
	
	Возврат Результат;
КонецЕсли;

//ТекстДляЗапроса = "/HTTP_Service/hs/products/get_product?param1=123";
//ТекстДляЗапроса = "/HTTP_Service/hs/products/get_product/code/123/code1/ww";
Результат.СерверДляЗапроса = СерверДляЗапроса;
Если ИмяСервера = "СерверЛайвHTTP" Тогда
	ТекстДляЗапроса = "/LIVE_HTTP/";
ИначеЕсли ИмяСервера = "СерверЧеховHTTP" Тогда
	ТекстДляЗапроса = "/CHEHOV_HTTP/";
ИначеЕсли ИмяСервера = "СерверДомСоветовHTTP" Тогда
	ТекстДляЗапроса = "/DomSovetov_HTTP/";
ИначеЕсли ИмяСервера = "СерверСтритАртHTTP" Тогда
	ТекстДляЗапроса = "/StreetArt_HTTP/";
Иначе		
	Возврат Результат; 	
КонецЕсли;
	                         
ТекстДляЗапроса = ТекстДляЗапроса + "hs/products/get_product";
	
Дата_П = Формат(ДатаС, "ДФ=dd.MM.yyyy");
ТекстДляЗапроса = ТекстДляЗапроса + "/date_from/" + Дата_П;
Дата_П = Формат(ДатаПо, "ДФ=dd.MM.yyyy");
ТекстДляЗапроса = ТекстДляЗапроса + "/date_to/" + Дата_П;

Результат.ТекстДляЗапроса = ТекстДляЗапроса;

Возврат Результат; 
КонецФункции	

Функция ПолучитьЕжедневныйОтчетФакт(ДатаС, ДатаПо, ИмяСервера) Экспорт
// Создаем HTTPСоединение, указываем сервер
Результат = Новый Структура("Ошибка, ТекстОшибки, Данные", Ложь, "", Неопределено);

Настройки = ПолучитьНастройкиЕжедневныйОтчетФакт(ДатаС, ДатаПо, ИмяСервера);
Если Настройки.СерверДляЗапроса = "" Тогда
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибочная настройка константы " + ИмяСервера;
	
	Возврат Результат;
КонецЕсли;

Если Настройки.ТекстДляЗапроса = "" = Неопределено Тогда
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибочные настройки HTTP";
	
	Возврат Результат;
КонецЕсли;
	
Соединение = Новый HTTPСоединение(Настройки.СерверДляЗапроса,,,,, 120);

ИмяФайла = НастройкиСервер.КаталогБД() + "HTTPЕжедневныйОтчетФакт" + ИмяСервера + ".txt";
//ИмяФайла = НастройкиСервер.КаталогБД() + "HTTPЗаселения"  + ".txt";

Попытка
	HTTPОтвет = Соединение.Получить(Настройки.ТекстДляЗапроса, ИмяФайла);
Исключение
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка соединения с HTTP: " + ОписаниеОшибки();
	
	Возврат Результат;
КонецПопытки;

Если HTTPОтвет.КодСостояния >= 300 Тогда
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка HTTP Соединение.Получить. Код состояния: " + HTTPОтвет.КодСостояния;

	Возврат Результат;
КонецЕсли;
//Сообщить("Удачно выполнен GET запрос!");

чтение = Новый ЧтениеJSON;
чтение.ОткрытьФайл(ИмяФайла);
    
//ВСоответствие = Ложь;
//Данные = ПрочитатьJSON(чтение, ВСоответствие);

МассивИменаДаты = Новый Массив;

МассивИменаДаты.Добавить("Дата");
Данные = ПрочитатьJSON(Чтение, Ложь, МассивИменаДаты, ФорматДатыJSON.ISO);

чтение.Закрыть();

Результат.Данные = Данные;
Возврат Результат; 
КонецФункции

Функция ПолучитьНастройкиЕжедневныйОтчетФакт(ДатаС, ДатаПо, ИмяСервера)
Результат = Новый Структура("СерверДляЗапроса, ТекстДляЗапроса", "", "");

СерверHTTP = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты(ИмяСервера);

Если ЗначениеЗаполнено(СерверHTTP) Тогда
	СерверДляЗапроса = СерверHTTP;
Иначе
	//СерверДляЗапроса = "127.0.0.1";
	
	Возврат Результат;
КонецЕсли;

//ТекстДляЗапроса = "/HTTP_Service/hs/products/get_product?param1=123";
//ТекстДляЗапроса = "/HTTP_Service/hs/products/get_product/code/123/code1/ww";
Результат.СерверДляЗапроса = СерверДляЗапроса;
Если ИмяСервера = "СерверЛайвHTTP" Тогда
	ТекстДляЗапроса = "/LIVE_HTTP/";
ИначеЕсли ИмяСервера = "СерверЧеховHTTP" Тогда
	ТекстДляЗапроса = "/Chehov_HTTP/";
ИначеЕсли ИмяСервера = "СерверДомСоветовHTTP" Тогда
	ТекстДляЗапроса = "/DomSovetov_HTTP/";
ИначеЕсли ИмяСервера = "СерверСтритАртHTTP" Тогда
	ТекстДляЗапроса = "/StreetArt_HTTP/";
Иначе		
	Возврат Результат; 	
КонецЕсли;
	                         
ТекстДляЗапроса = ТекстДляЗапроса + "hs/products/get_Report_1";
	
Дата_П = Формат(ДатаС, "ДФ=dd.MM.yyyy");
ТекстДляЗапроса = ТекстДляЗапроса + "/date_from/" + Дата_П;
Дата_П = Формат(ДатаПо, "ДФ=dd.MM.yyyy");
ТекстДляЗапроса = ТекстДляЗапроса + "/date_to/" + Дата_П;

Результат.ТекстДляЗапроса = ТекстДляЗапроса;

Возврат Результат; 
КонецФункции	

