

&НаКлиенте
Процедура УдалитьГрупповыеСчета(Команда)
	УдалитьГрупповыеСчетаНаСервере();
КонецПроцедуры


&НаСервере
Процедура УдалитьГрупповыеСчетаНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронирование.Счета.(
                      |		ГрупповыеСчета КАК ГрупповыеСчета
                      |	) КАК Счета
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	МассивКУдалению = Новый Массив;
	Для каждого СтрокаСчета Из ЗаявкаОбъект.Счета Цикл
		Если ЗначениеЗаполнено(СтрокаСчета.ГрупповыеСчета) Тогда
			МассивКУдалению.Добавить(СтрокаСчета);	
		КонецЕсли;
		Для каждого СтрокаКУдалению Из МассивКУдалению Цикл
			ЗаявкаОбъект.Счета.Удалить(СтрокаКУдалению);
		КонецЦикла;		
		
		Если МассивКУдалению.Количество() > 0 Тогда
			 ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;		
	
КонецЦикла;
КонецПроцедуры
