

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
ПлохиеТелефоны.Очистить();	
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Ссылка,
                      |	Клиенты.Телефон КАК Телефон,
                      |	Клиенты.Код КАК Код,
                      |	Клиенты.Наименование КАК Наименование,
                      |	Клиенты.ТипКлиента КАК ТипКлиента,
                      |	Клиенты.ИностранныйГражданин КАК ИностранныйГражданин
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Наименование");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Если Строка.ТипКлиента <> Перечисления.ТипыКлиентов.ФизЛицо Тогда Продолжить; КонецЕсли;	
	Если Строка.ИностранныйГражданин Тогда Продолжить; КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Строка.Телефон) Тогда Продолжить; КонецЕсли;	
	
	Ответ = СлужебныеКлиентСервер.ПроверкаНомераТелефона(Строка.Телефон); 
	Если Ответ.КодОшибки <> -1 Тогда Продолжить; КонецЕсли;	 
	
	НоваяСтрока = ПлохиеТелефоны.Добавить();
	НоваяСтрока.Код = Строка.Код;
	НоваяСтрока.Наименование = Строка.Наименование;
	НоваяСтрока.Телефон = Строка.Телефон;
КонецЦикла;
КонецПроцедуры

