//                                                                           
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если РаботаСИнтерфейсомСервер.УстановитьТолькоПросмотр(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;

РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(ЭтаФорма.КоманднаяПанель,"ФормаУдалить");

Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 	
	Параметры.Свойство("КоворкингЗаявка", Объект.КоворкингЗаявка);
	Если НЕ ЗначениеЗаполнено(Объект.КоворкингЗаявка) Тогда Отказ = Истина;	Возврат; КонецЕсли;
КонецЕсли;

ЭтоАдминистратор = НастройкиСервер.ЭтоАдминистратор();
Элементы.КоворкингЗаявка.ТолькоПросмотр = НЕ ЭтоАдминистратор;

НастройкаФормы();

Если НастройкиСервер.ЭтоЛайв()
ИЛИ НастройкиСервер.ЭтоЧехов()	
Тогда
	Элементы.ФормаЧекСчет.Доступность = Ложь;
	
	//Элементы.ФормаПодменю.Доступность = Ложь;
	Элементы.ФормаВозвратОплаты.Доступность = Ложь;
	Элементы.ФормаДобавитьОплатаКассаОтменные.Доступность = Ложь;
	Элементы.ФормаДобавитьОплатаКассаОстаткиОплаты.Доступность = Ложь;

	Элементы.ФормаОтправитьВPayKeeper.Доступность = Ложь;
	Элементы.ФормаПроверитьОплатуPayKeepr.Доступность = Ложь;
КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()
ПочасоваяОплата = Объект.КоворкингЗаявка.ПочасоваяОплата;

//Элементы.ДатаПо.Видимость = НЕ ПочасоваяОплата; 
Элементы.ЧасС.Видимость = ПочасоваяОплата; 
Элементы.ЧасПо.Видимость = ПочасоваяОплата; 
//Элементы.ВключатьВыходные.Видимость = НЕ ПочасоваяОплата; 

Если ПочасоваяОплата Тогда
	КоворкингСервер.ЗаполнитьЧасыСписокВыбора(Элементы.ЧасС.СписокВыбора, Элементы.ЧасПо.СписокВыбора);
КонецЕсли;
КонецПроцедуры
//

//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
ОбновитьДанные();
КонецПроцедуры


&НаСервере
Процедура ОбновитьДанные()
ОбновитьУслуги();
ОбновитьСтрокиДокументыОплаты();

УстановитьШапкаТолькоПросмотр();
КонецПроцедуры

&НаСервере
Процедура ОбновитьУслуги()

СуммаОплаченоИтогоДопУслуги = 0;
СуммаИтогоДопУслуги = 0;
Для Каждого Строка Из Объект.ДопУслугиКоворкинг Цикл
	СуммаИтогоДопУслуги = СуммаИтогоДопУслуги + Строка.Сумма;
	
	СуммаОплатыДолгиГУИД = 0;
	ОтборСтроки = Новый Структура("ГУИДДолги", Строка.ГУИД);
	НайденныеСтроки = Объект.РаспределениеОплатКоворкинг.НайтиСтроки(ОтборСтроки);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		СуммаОплатыДолгиГУИД = СуммаОплатыДолгиГУИД + НайденнаяСтрока.СуммаОплаты;
	КонецЦикла;
	Строка.СуммаОплачено = СуммаОплатыДолгиГУИД;	
	
	СуммаОплаченоИтогоДопУслуги = СуммаОплаченоИтогоДопУслуги + Строка.СуммаОплачено;
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокиДокументыОплаты()
МассивДокументовДолг = Новый Массив;
СуммаРаспределеноИтогоОплаты = 0;

ОплатыОбщееСервер.ОбновитьДанныеКолонокДокументыОплаты(СуммаРаспределеноИтогоОплаты
	, Объект.ДокументыОплаты, Объект, МассивДокументовДолг);	
	
Для Каждого Строка Из Объект.ДокументыОплаты Цикл
	ДокументОплаты = Строка.ДокументОплаты;
	Строка.ДатаОплаты = ДокументОплаты.ДатаОплаты;
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		Строка.Аванс = ДокументОплаты.Аванс;	
	КонецЕсли;	
КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура УстановитьШапкаТолькоПросмотр()
ОтборСтроки = Новый Структура("ЭтоУслуга", Ложь);
НайденныеСтроки = Объект.РаспределениеОплатКоворкинг.НайтиСтроки(ОтборСтроки);
	
ТолькоПросмотр_П = (НайденныеСтроки.Количество() <> 0);	
Элементы.Цена.ТолькоПросмотр = ТолькоПросмотр_П; 	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
ТекстСообщения = ПроверкаЗаполненияТекстСообщенияПередЗаписьюНаСервере();
Если ТекстСообщения <> "" Тогда
	ТекстСообщения = ТекстСообщения + " ЗАПИСЬ ОТМЕНЯЕТСЯ.";
	Сообщить(ТекстСообщения); 
	
	Отказ = Истина;
	Возврат; 
КонецЕсли;

//Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	ДанныеОбъект = Объект;
	Результат = КоворкингСервер.ПроверкаЗанятостиКоворкинг(ДанныеОбъект);
	Если Результат.Ошибка Тогда
		ТекстПредупреждения = "";
		Первый = Истина;
		Для Каждого Строка Из Результат.Сообщение Цикл
			Если Первый Тогда Первый = Ложь; Продолжить; КонецЕсли; 
			ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Строка;
		КонецЦикла;
		ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Символы.ПС; 
		ТекстПредупреждения = ТекстПредупреждения + "ЗАПИСЬ ОТМЕНЯЕТСЯ." + Символы.ПС + Символы.ПС;
		Если УдалениеОплатыПроведенногДокумента Тогда
			ТекстПредупреждения = ТекстПредупреждения + "Попытка удаления оплаты блокированного счета
				|ДЛЯ УДАЛЕНИЯ ОПЛАТЫ ОТМЕНИТЕ ПРОВЕДЕНИЕ ДОКУМЕНТА";
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
		ТекстСообщения = "";
		Для Каждого Строка Из Результат.Сообщение Цикл
			ТекстСообщения = ТекстСообщения + Строка + " ";
		КонецЦикла;	
		ТекстСообщения = ТекстСообщения + "ЗАПИСЬ ОТМЕНЯЕТСЯ.";
		Если УдалениеОплатыПроведенногДокумента Тогда
			ТекстСообщения = ТекстСообщения + "Попытка удаления оплаты блокированного счета. ДЛЯ УДАЛЕНИЯ ОПЛАТЫ ОТМЕНИТЕ ПРОВЕДЕНИЕ ДОКУМЕНТА.";
		КонецЕсли;		
		Сообщить(ТекстСообщения);
		
		УдалениеОплатыПроведенногДокумента = Ложь;
		Отказ = Истина; Возврат;	
	КонецЕсли;
КонецЕсли;

Если ОбновитьОплаты Тогда
	ОбновитьОплатыКоворкингНаСервере();
	
	ОбновитьОплаты = Ложь;
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОплатыКоворкинг(Команда)
ОбновитьОплатыКоворкингНаСервере();
КонецПроцедуры

&НаСервере
Функция ОбновитьОплатыКоворкингНаСервере()
КоворкингСервер.ОбновитьОплатыКоворкинг(Объект);
КонецФункции

&НаСервере
Функция ПроверкаЗаполненияТекстСообщенияПередЗаписьюНаСервере()
Возврат КоворкингСервер.ПроверкаЗаполненияКоворкингСчетТекстСообщения(Объект, " ");
КонецФункции
//

&НаКлиенте
Функция ПроверкаУстановкиПометкаУдаления_НеИспользуется()
Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Если Объект.ПометкаУдаления Тогда
		Если Объект.ДокументыОплаты.Количество() > 0 Тогда 
			ПоказатьПредупреждение(,"У счета есть оплаты.
			|
			|Пометка удаления НЕ разрешена.
			|
			|ДОКУМЕНТ НЕ СОХРАНЕН !
			|
			|Для установки пометки удаления удалите оплаты");
			
			Сообщить("У счета есть оплаты. Пометка удаления НЕ разрешена. ДОКУМЕНТ НЕ СОХРАНЕН !");
			
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
КонецЕсли;

Возврат Ложь;
КонецФункции
//
&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(Объект.ДатаС) Тогда Возврат; КонецЕсли;
	
Если НЕ ЗначениеЗаполнено(Объект.ДатаПо) Тогда
	ПериодАренды = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.КоворкингЗаявка, "ПериодАренды");
	ДатаПо = КоворкингСервер.СчетДатаПо(Объект.ДатаС, ПериодАренды);
	Объект.ДатаПо = ДатаПо;
КонецЕсли;

КонтрольДаты("ДатаС", "Дата С");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
КонтрольДаты("ДатаПо", "Дата По")
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДаты(ДатаИмяРеквизита, ДатаНаименованиеРеквизита)
Если НЕ (ЗначениеЗаполнено(Объект.ДатаС) И ЗначениеЗаполнено(Объект.ДатаПо)) Тогда 
	ЗавершениеВопроса_РасчетнаяДатаНеРавноДатаПоСчета(КодВозвратаДиалога.Отмена, Неопределено);
	
	Возврат; 
КонецЕсли;

Если Объект.ДатаС > Объект.ДатаПо Тогда 
	ПоказатьПредупреждение(, "'Дата С' БОЛЬШЕ 'Дата По'
		|
		|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	Дата_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, ДатаИмяРеквизита);
	Объект[ДатаИмяРеквизита] = Дата_OldValue;
	
	//ЗавершениеВопроса_РасчетнаяДатаНеРавноДатаПоСчета(КодВозвратаДиалога.Отмена, Неопределено);
	
	Возврат; 
КонецЕсли;

Если КоворкингСервер.ЕстьОплатыСчет(Объект.Ссылка) Тогда
	ПоказатьПредупреждение(, "Есть оплаты счета.
		|
		|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...
		|
		|Для изменения " + ДатаНаименованиеРеквизита + " удалите оплаты.");
	
	Дата_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, ДатаИмяРеквизита);
	Объект[ДатаИмяРеквизита] = Дата_OldValue;
	
	//ЗавершениеВопроса_РасчетнаяДатаНеРавноДатаПоСчета(КодВозвратаДиалога.Отмена, Неопределено);
	
	Возврат;
		
КонецЕсли;	

// + Аудит
ПериодАренды_П = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.КоворкингЗаявка, "ПериодАренды");
Если ПериодАренды_П = "ЧАС"
И Объект.ДатаС <> Объект.ДатаПо 
Тогда 
	ПоказатьПредупреждение(, "'Дата С' = 'Дата По' для периода аренды 'ЧАС'
		|
		|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	Дата_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, ДатаИмяРеквизита);
	Объект[ДатаИмяРеквизита] = Дата_OldValue;
	
	//ЗавершениеВопроса_РасчетнаяДатаНеРавноДатаПоСчета(КодВозвратаДиалога.Отмена, Неопределено);
	
	Возврат; 
КонецЕсли;
// - Аудит

ПериодАренды = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.КоворкингЗаявка, "ПериодАренды");
СчетДатаПо = КоворкингСервер.СчетДатаПо(Объект.ДатаС, ПериодАренды);
Если СчетДатаПо <> Объект.ДатаПо Тогда 
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_РасчетнаяДатаНеРавноДатаПоСчета", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Период аренды: " + ПериодАренды + "
					|Расчетная дата По: " + Формат(СчетДатаПо, "ДФ=dd.MM.yyyy") + " НЕ РАВНА 'Дата по' счета: " + Формат(Объект.ДатаПо, "ДФ=dd.MM.yyyy") + "
					|
					|ПРОДОЛЖИТЬ ? "
					,РежимДиалогаВопрос.ОКОтмена);
					
	Возврат;
КонецЕсли;

ЗавершениеВопроса_РасчетнаяДатаНеРавноДатаПоСчета(КодВозвратаДиалога.ОК, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_РасчетнаяДатаНеРавноДатаПоСчета(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда 
	Объект.КоличествоЕдиниц = 0; 
	Объект.Количество = 0; 
	Объект.Сумма = 0;

	Возврат; 
КонецЕсли;	

СчетСуммаКоличествоДни();
КонецПроцедуры

&НаСервере
Процедура СчетСуммаКоличествоДни()
Если Объект.КоворкингЗаявка.ПериодАренды = "МЕСЯЦ" Тогда
		
	МесяцС = Месяц(Объект.ДатаС);
	МесяцПо = Месяц(Объект.ДатаПо);
			
	ГодС = Год(Объект.ДатаС);
	ГодПо = Год(Объект.ДатаПо);
	
	ДеньС = День(Объект.ДатаС);
	ДеньПо = День(Объект.ДатаПо);
	
	КоличествоМесяцев = (ГодПо - ГодС)*12 + (МесяцПо - МесяцС);
	Если ДеньПо >= ДеньС Тогда КоличествоМесяцев = КоличествоМесяцев + 1; КонецЕсли; 
	
	КоворкингСервер.ЗаполнитьСрокиАренды(Объект.СрокиАренды, Объект.ДатаС, Объект.ДатаПо);
	
	РазницаВДнях = (НачалоДня(Объект.ДатаПо) - НачалоДня(Объект.ДатаС)) / (60 * 60 * 24) + 1;
	Объект.КоличествоЕдиниц = РазницаВДнях;
	
	Объект.Количество = КоличествоМесяцев;
	Объект.Сумма = Объект.Количество * Объект.Цена;
	
ИначеЕсли Объект.КоворкингЗаявка.ПериодАренды = "НЕДЕЛЯ" Тогда	
	РазницаВДнях = (НачалоДня(Объект.ДатаПо) - НачалоДня(Объект.ДатаС)) / (60 * 60 * 24) + 1;
	Объект.КоличествоЕдиниц = РазницаВДнях;
	
	КоличествоНедель = Цел((РазницаВДнях - 1) / 7) + 1; 
		
	Объект.Количество = КоличествоНедель;
	Объект.Сумма = Объект.Количество * Объект.Цена;
	
ИначеЕсли Объект.КоворкингЗаявка.ПериодАренды = "ДЕНЬ" Тогда	
	РазницаВДнях = (НачалоДня(Объект.ДатаПо) - НачалоДня(Объект.ДатаС)) / (60 * 60 * 24) + 1;
	
	//Объект.КоличествоЕдиниц = 1;
	//Объект.Количество = 1;
	
	Объект.КоличествоЕдиниц = РазницаВДнях;
	Объект.Количество = РазницаВДнях;
	
	Объект.Сумма = Объект.Количество * Объект.Цена;
КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СчетСуммаКоличество_Вариант()
//Если Объект.КоворкингЗаявка.ПериодАренды = "МЕСЯЦ" Тогда	
	ДеньС = День(Объект.ДатаС);
	ДеньПо = День(Объект.ДатаПо);   

	МесяцС = Месяц(Объект.ДатаС);
	МесяцПо = Месяц(Объект.ДатаПо);
	
	ГодС = Год(Объект.ДатаС);
	ГодПо = Год(Объект.ДатаПо);

	Год_П = ГодС;
	Месяц_П = МесяцС;
	Сумма = 0;
	
	ДлинаПериода = (НачалоДня(КонецМесяца(Объект.ДатаС)) - НачалоДня(НачалоМесяца(Объект.ДатаС))) / (60 * 60 * 24) + 1;
	ЦенаЗаДень = Объект.Цена / ДлинаПериода;

	Пока Истина Цикл
		ДеньС_П = ?(Месяц_П = МесяцС, ДеньС, 1);
		ДеньПо_П = ?(Месяц_П = МесяцПо, ДеньПо, День(КонецМесяца(Дата(Год_П, Месяц_П, 1))));
		
		ДатаС_П = Дата(Год_П, Месяц_П, ДеньС_П); 
		ДатаПо_П = Дата(Год_П, Месяц_П, ДеньПо_П); 
		Если ДатаПо_П > Объект.ДатаПо Тогда Прервать; КонецЕсли; 
		
		//ДлинаПериода = (НачалоДня(КонецМесяца(ДатаПо_П)) - НачалоДня(НачалоМесяца(ДатаПо_П))) / (60 * 60 * 24) + 1;
		//ЦенаЗаДень = Объект.Цена / ДлинаПериода;
		
		Если Месяц_П = МесяцС ИЛИ Месяц_П = МесяцПо Тогда 
			РазницаВДнях = (НачалоДня(ДатаПо_П) - НачалоДня(ДатаС_П)) / (60 * 60 * 24)  + 1;
			Сумма = Сумма + ЦенаЗаДень * РазницаВДнях;
		Иначе
			Сумма = Сумма + Объект.Цена;
		КонецЕсли;	
			
		Месяц_П = Месяц_П + 1;
		Если Месяц_П > 12 Тогда 
			Месяц_П = 1;
			Год_П = Год_П + 1;
		КонецЕсли;
	КонецЦикла;	
	
	КоворкингСервер.ЗаполнитьСрокиАренды(Объект.СрокиАренды, Объект.ДатаС, Объект.ДатаПо);
	
	РазницаВДнях = (НачалоДня(Объект.ДатаПо) - НачалоДня(Объект.ДатаС)) / (60 * 60 * 24) + 1;

	Объект.КоличествоЕдиниц = РазницаВДнях;
	Объект.Сумма = Сумма;
	
//ИначеЕсли Объект.КоворкингЗаявка.ПериодАренды = "НЕДЕЛЯ" Тогда	
//	
//КонецЕсли;	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЧасСПриИзменении(Элемент)
//Если Объект.ЧасС = 0 Тогда Возврат; КонецЕсли;

КонтрольЧасы("ЧасС", "Час С");
КонецПроцедуры

&НаКлиенте
Процедура ЧасПоПриИзменении(Элемент)
КонтрольЧасы("ЧасПо", "Час По");
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЧасы(ЧасИмяРеквизита, ЧасНаименованиеРеквизита)
//Если Объект.ЧасС = 0 ИЛИ Объект.ЧасПо = 0 Тогда 
//	
//	СчетСуммаКоличествоЧасы(Истина);
//	Возврат; 
//КонецЕсли;

НачальныйЧасКонечныйЧас = КоворкингСервер.НачальныйЧасКонечныйЧас();
Если Объект[ЧасИмяРеквизита] < НачальныйЧасКонечныйЧас.НачальныйЧас
ИЛИ Объект[ЧасИмяРеквизита] > НачальныйЧасКонечныйЧас.КонечныйЧас
Тогда  	
	Час_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "ЧасС");
	Объект[ЧасИмяРеквизита] = Час_OldValue;
	
	//СчетСуммаКоличествоЧасы(Истина);
	Возврат;
КонецЕсли;

Если Объект.ДатаС = Объект.ДатаПо Тогда
	Если Объект.ЧасС > Объект.ЧасПо Тогда 
		ПоказатьПредупреждение(, "'Час С' БОЛЬШЕ 'Час По'.
			|
			|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...");
		
		Дата_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, ЧасИмяРеквизита);
		Объект[ЧасИмяРеквизита] = Дата_OldValue;
		
		//СчетСуммаКоличествоЧасы(Истина);
		Возврат; 
	КонецЕсли;
КонецЕсли;

Если КоворкингСервер.ЕстьОплатыСчет(Объект.Ссылка) Тогда
	ПоказатьПредупреждение(, "Есть оплаты счета.
		|
		|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...
		|
		|Для изменения " + ЧасНаименованиеРеквизита + " удалите оплаты.");
	
	Час_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, ЧасИмяРеквизита);
	Объект[ЧасИмяРеквизита] = Дата_OldValue;
	
	//СчетСуммаКоличествоЧасы(Истина);
	Возврат;
КонецЕсли;	

СчетСуммаКоличествоЧасы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СчетСуммаКоличествоЧасы(Очистить)
Если Очистить Тогда 
	Объект.КоличествоЕдиниц = 0; 
	Объект.Количество = 0; 
	Объект.Сумма = 0;
	
	Возврат; 
КонецЕсли;	

РазницаЕдиницы = Объект.ЧасПо - Объект.ЧасС;
Если Объект.ДатаС <> Объект.ДатаПо Тогда 
	// + Аудит
	//РазницаЕдиницы = 24 + РазницаЕдиницы;
	РазницаДни = (Объект.ДатаПо - Объект.ДатаС) / (24 * 60 * 60);
	РазницаЕдиницы = 24 * РазницаДни + РазницаЕдиницы;
	// + Аудит
КонецЕсли;	
Объект.КоличествоЕдиниц = РазницаЕдиницы; 
Объект.Количество = РазницаЕдиницы; 
Объект.Сумма = Объект.Цена * Объект.Количество;
КонецПроцедуры
//

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
Объект.Сумма = Объект.Цена * Объект.Количество;

ОбновитьОплаты = Истина;
КонецПроцедуры

//
&НаКлиенте
Процедура ЗаполнитьСрокиАренды(Команда)
Если Объект.ДокументыОплаты.Количество() > 0 Тогда 
	ПоказатьПредупреждение(, "Есть оплаты Счета
	|
	|ПЕРЕЗАПОЛНЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	Возврат;
КонецЕсли;
	
Если Объект.СрокиАренды.Количество() > 0 Тогда
	Оповещение = новый ОписаниеОповещения("ЗавершениеВопроса_СрокиАрендыБудутПерезаполнены", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Сроки аренды будут перезаполнены.
	|
	|ПРОДОЛЖИТЬ ?", РежимДиалогаВопрос.ОКОтмена); 
	
	Возврат;
КонецЕсли;		

ЗаполнитьСрокиАрендыДействие();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_СрокиАрендыБудутПерезаполнены(Результат, ДополнительныеПараметры)  Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ЗаполнитьСрокиАрендыДействие();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСрокиАрендыДействие() 
//КоворкингСервер.ЗаполнитьСрокиАренды(Объект.СрокиАренды, Объект.ДатаС, Объект.ДатаПо, Объект.ВключатьВыходные);
КоворкингСервер.ЗаполнитьСрокиАренды(Объект.СрокиАренды, Объект.ДатаС, Объект.ДатаПо);

Объект.КоличествоЕдиниц = Объект.СрокиАренды.Количество();
КонецПроцедуры
//

// + Услуги
&НаКлиенте
Процедура УслугиКоворкингПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ТекущиеДанные = Элемент.ТекущиеДанные;	
Если НоваяСтрока Тогда 
	ТекущиеДанные.ГУИД = Новый УникальныйИдентификатор(); 
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДатаУслуги) Тогда
	ТекущиеДанные.ДатаУслуги = Объект.ДатаПо;
КонецЕсли;

ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена; 

ОбновитьОплаты = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоворкингПередУдалением(Элемент, Отказ)
ТекущиеДанные = Элемент.ТекущиеДанные;	

//Если ЕстьВЗакрытомСчетеПредупреждение(ТекущиеДанные.ГУИД, "УДАЛЕНИЕ") Тогда Отказ = Истина; Возврат; КонецЕсли;

СуммаОплаченоИтогоДопУслуги = СуммаОплаченоИтогоДопУслуги - ТекущиеДанные.СуммаОплачено;
ОбновитьОплаты = Истина;
КонецПроцедуры
// - Услуги

//// + Оплаты
&НаКлиенте
Процедура ДокументыОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ТД = Элементы.ДокументыОплаты.ТекущиеДанные;

ОплатыОбщееКлиент.ОткрытьДокументОплаты(ЭтаФорма, ТД.ДокументОплаты, Истина, Неопределено);

//ДокументОплаты = ТД.ДокументОплаты;

//ПараметрыФормы = Новый Структура;
//ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
//ПараметрыФормы.Вставить("Ключ", ДокументОплаты);

//Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
//	ФормаИмя = "Документ.КассовыйДокумент.Форма.ФормаДокумента";
//ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
//	ФормаИмя = "Документ.ВыпискаБанка.Форма.ФормаДокумента";
//Иначе
//	Возврат;
//КонецЕсли;

//ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

//
&НаКлиенте
Процедура ДокументыОплатыПередУдалением(Элемент, Отказ)
ТекущиеДанные = Элемент.ТекущиеДанные;  	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;	

ДопПараметры = Новый Структура();
ДопПараметры.Вставить("ДокументОплаты", ТекущиеДанные.ДокументОплаты);
ДопПараметры.Вставить("СуммаРаспределено", ТекущиеДанные.СуммаРаспределено);
Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдалениеОплаты", ЭтаФорма, ДопПараметры);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ ОТМЕНУ ОПЛАТЫ ...", РежимДиалогаВопрос.ОКОтмена);
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдалениеОплаты(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

УдалитьДокументыОплатыНаСервере(ДополнительныеПараметры.ДокументОплаты, ДополнительныеПараметры.СуммаРаспределено);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДокументыОплатыНаСервере(ДокументОплаты, СуммаРаспределено)
//НачатьТранзакцию();

УдалитьОплату(ДокументОплаты);

ОбновитьОплаты = Истина;

Если Объект.Проведен Тогда  
	УдалениеОплатыПроведенногДокумента = Истина;
	
	РезультатПроведения = ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	Если НЕ	РезультатПроведения Тогда ЭтаФорма.Прочитать(); Возврат; КонецЕсли;
	
Иначе
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
КонецЕсли;

УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты);

~ЗАВЕРШИТЬ:
//ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере
Процедура УдалитьОплату(ДокументОплаты)
КоворкингСервер.УдалитьДокументОплаты(ДокументОплаты, Объект);
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты)
ОплатыОбщееСервер.УдалитьДокументОплатыДолгОплатыИДокументОплаты(ДокументОплаты, Объект.Ссылка, Объект.СчетГУИД);
КонецПроцедуры

//
//// - Оплаты

////// + Наличные

// + Чек Счет
&НаКлиенте
Асинх Процедура ЧекСчет(Команда)
Клиент = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.КоворкингЗаявка, "Клиент");	
Контрагент = ?(ЗначениеЗаполнено(Объект.ОплачиваетСчет), Объект.ОплачиваетСчет, Клиент); 

Если КлиентыСервер.ЭтоЮрЛицо(Контрагент) Тогда 	
	//ПоказатьПредупреждение(,"Счет выписан на юр. лицо"	
	//	+ Символы.ПС + Символы.ПС + "ОПЛАТА НАЛИЧНЫМИ НЕ РАЗРЕШЕНА ...");		
		
	Результат = Ждать ВопросАсинх("Счет выписан на юр. лицо !!!
											|
											|ПРОДОЛЖИТЬ ФОРМИРОВАНИЕ ЧЕКА ?"
						, РежимДиалогаВопрос.ОКОтмена);
	Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли; 
КонецЕсли;

Если Объект.Сумма = 0 Тогда
	ПоказатьПредупреждение(,"Сумма счета = 0"	
		+ Символы.ПС + Символы.ПС + "ОПЛАТА НЕ РАЗРЕШЕНА ...");		
		
	Возврат;
КонецЕсли;

Если ОплатыОбщееСервер.ЕстьОстаткиОплатКассаКонтрагент(Контрагент) Тогда
	Результат = Ждать ВопросАсинх("Есть кассовые остатки оплат для контрагента
											|
											|ПРОДОЛЖИТЬ ФОРМИРОВАНИЕ ЧЕКА ?"
						, РежимДиалогаВопрос.ОКОтмена);
	Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли; 
КонецЕсли;


ЧекСчетДействие(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЧекСчетДействие(Счет)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;

ДопПараметры = Новый Структура;
ДопПараметры.Вставить("Счет", Счет);
ДопПараметры.Вставить("ДокументДолгОбъектДанные", Объект);   

ДопПараметры.Вставить("ЭтоСчетКоворкинг", Истина);

ДопПараметры.Вставить("ЭтоКоворкинг", Истина);

ДопПараметрыОповещения = Новый Структура;
ОповещениеЗавершениеЧекОплаты = Новый ОписаниеОповещения("ОповещениеЗавершениеЧекОплаты", ЭтаФорма, ДопПараметрыОповещения);
ДопПараметры.Вставить("ОповещениеЗавершениеЧек", ОповещениеЗавершениеЧекОплаты);

ОплатыЧекКлиент.ЧекОплаты(ДопПараметры, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗавершениеЧекОплаты(Результат, ДополнительныеПараметры) Экспорт
//ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЭтаФорма.Прочитать();
КонецПроцедуры	
// - Чек Счет

// + Возврат
&НаКлиенте
Процедура ВозвратОплаты(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;

//ТД = Элементы.ДокументыОплаты.ТекущиеДанные;
//Если ТД = Неопределено Тогда Возврат; КонецЕсли;

//ДокументОплаты = ТД.ДокументОплаты;
//ОтКого = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ДокументОплаты, "ОтКого");

ПараметрыФормы = Новый Структура(); 

СписокЗначенийКонтрагенты = СписокЗначенийКонтрагенты();

ПараметрыФормы.Вставить("КонтрагентыОтбор", СписокЗначенийКонтрагенты);
ПараметрыФормы.Вставить("ДокументДолг", Объект.Ссылка);
//ПараметрыФормы.Вставить("ДокументОплаты", ДокументОплаты);        

ПараметрыФормы.Вставить("ЭтоСчетКоворкинг", Истина);
ПараметрыФормы.Вставить("ЭтоКоворкинг", Истина);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ЧекВозврат", ЭтаФорма);   
ОткрытьФорму("ОбщаяФорма.ЧекВозврат", ПараметрыФормы, ЭтаФорма
	,,,,Оповещение , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаСервере
Функция СписокЗначенийКонтрагенты()
ТЗ = Новый ТаблицаЗначений;	
ТЗ.Колонки.Добавить("Контрагент");

Для Каждого Строка Из Объект.ДокументыОплаты Цикл
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Контрагент = Строка.ДокументОплаты.ОтКого;
КонецЦикла;	

НоваяСтрока = ТЗ.Добавить();
НоваяСтрока.Контрагент = Объект.КоворкингЗаявка.Клиент;

Если ЗначениеЗаполнено(Объект.ОплачиваетСчет) Тогда
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Контрагент = Объект.ОплачиваетСчет;
КонецЕсли;

ТЗ.Свернуть("Контрагент");

СписокКонтрагентов = Новый СписокЗначений;
Для Каждого Строка Из ТЗ Цикл
	СписокКонтрагентов.Добавить(Строка.Контрагент);	
КонецЦикла;

Возврат СписокКонтрагентов;
КонецФункции

&НаКлиенте
Процедура ЗавершениеФормы_ЧекВозврат(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли; 	

ОчиститьСообщения();  

ФУ_Клиент.ПоказатьПодтверждениеСообщение(Результат);

ЭтаФорма.Прочитать();	
КонецПроцедуры
// - Возврат

&НаКлиенте
Процедура ДобавитьОплатаКассаОтменные(Команда)
ДанныеОбъект = Объект;	
СуммаКоплате = КоворкингСервер.СуммаКОплатеКоворкинг(ДанныеОбъект);
	
Если СуммаКоплате = 0 Тогда
	ПоказатьПредупреждение(,"Сумма счета к оплате = 0"	
		+ Символы.ПС + Символы.ПС + "НЕЧЕГО ОПЛАЧИВАТЬ ...");		
		
	Возврат;
КонецЕсли;
	
ОткрытьФормаВыбораОстаткиОплаты(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОплатаКассаОстаткиОплаты(Команда)
ДанныеОбъект = Объект;	
СуммаКоплате = КоворкингСервер.СуммаКОплатеКоворкинг(ДанныеОбъект);
	
Если СуммаКоплате = 0 Тогда
	ПоказатьПредупреждение(,"Сумма счета к оплате = 0"	
		+ Символы.ПС + Символы.ПС + "ОПЛАТА НЕ РАЗРЕШЕНА ...");		
		
	Возврат;
КонецЕсли;

ОткрытьФормаВыбораОстаткиОплаты(Неопределено);
КонецПроцедуры

////
&НаКлиенте
Процедура ОткрытьФормаВыбораОстаткиОплаты(ОтмененныйДокументДолг)
Если НЕ ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;	
	
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);

Если ОтмененныйДокументДолг = Неопределено Тогда
	СписокКонтрагентов = Новый СписокЗначений;
Иначе	
	СписокКонтрагентов = СписокЗначенийКонтрагенты();
	ПараметрыФормы.Вставить("СписокКонтрагентов", СписокКонтрагентов);
КонецЕсли;

ДанныеОбъект = Объект;
СуммаКОплате = КоворкингСервер.СуммаКОплатеКоворкинг(ДанныеОбъект);

Если СуммаКОплате <= 0 Тогда ЭтаФорма.Модифицированность = Ложь; Возврат; КонецЕсли; 

ПараметрыФормы.Вставить("СуммаКОплате", СуммаКОплате);

ПараметрыФормы.Вставить("ОтмененныйДокументДолг", ОтмененныйДокументДолг);

ДопПараметры = Новый Структура;
ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытиеФормы_ФормаВыбораОплатыОстатки", ЭтаФорма, ДопПараметры);
	
ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаВыбораОстаткиОплаты", ПараметрыФормы, ЭтаФорма 
	,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы_ФормаВыбораОплатыОстатки(Результат, ДополнительныеПараметры) Экспорт
Если НЕ ЗначениеЗаполнено(Результат) Тогда Возврат; КонецЕсли;

ДобавитьОплатаНаСервере(Результат);

//ЭтаФорма.Прочитать();
КонецПроцедуры

&НаСервере
Процедура ДобавитьОплатаНаСервере(ДокументОплаты)
НачатьТранзакцию();

СуммаРаспределено = 0;
КоворкингСервер.РаспределитьДокументОплатаКоворкингСчетОбъект(ДокументОплаты, Объект, СуммаРаспределено);

ДокументыОплатыКоворкинг = Объект.ДокументыОплаты;

НоваяОплата = ДокументыОплатыКоворкинг.Добавить();
НоваяОплата.ДокументОплаты = ДокументОплаты;
НоваяОплата.СуммаРаспределено = СуммаРаспределено;

ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, Объект.Ссылка, Объект.СчетГУИД
	, СуммаРаспределено, Истина);   

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры
////
////// - Наличные

// + Безнал Оплата добавить
&НаКлиенте
Процедура ДобавитьОплатаБезнал(Команда)
ДанныеОбъект = Объект;	
СуммаКоплате = КоворкингСервер.СуммаКОплатеКоворкинг(ДанныеОбъект);
Если СуммаКоплате = 0 Тогда
	ПоказатьПредупреждение(,"Сумма счета к оплате = 0"	
		+ Символы.ПС + Символы.ПС + "ОПЛАТА НЕ РАЗРЕШЕНА ...");		
		
	Возврат;
КонецЕсли;

Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;

ПараметрыФормы = Новый Структура();

Клиент = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.КоворкингЗаявка, "Клиент");	
Контрагент = ?(ЗначениеЗаполнено(Объект.ОплачиваетСчет), Объект.ОплачиваетСчет, Клиент); 

СписокКонтрагентыЗаявка = Новый СписокЗначений; 
СписокКонтрагентыЗаявка.Добавить(Контрагент);
ПараметрыФормы.Вставить("ОтКого", СписокКонтрагентыЗаявка);

ПараметрыФормы.Вставить("КонтрагентТолькоПросмотр", Истина);

ДанныеОбъект = Объект;
СуммаКОплате = КоворкингСервер.СуммаКОплатеКоворкинг(ДанныеОбъект);
Если СуммаКОплате <= 0 Тогда ЭтаФорма.Модифицированность = Ложь; Возврат; КонецЕсли;
ПараметрыФормы.Вставить("СуммаКОплате", СуммаКОплате);

ДопПараметры = Новый Структура();
ДопПараметры.Вставить("СуммаКОплате", СуммаКОплате);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормаВыбораОплата_ОплатаБезнал", ЭтаФорма, ДопПараметры);
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаВыбораОплата", ПараметрыФормы , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы .БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормаВыбораОплата_ОплатаБезнал(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

ДокументОплаты = Результат;

ДобавитьОплатаНаСервере(ДокументОплаты);

ЭтаФорма.Прочитать();
Конецпроцедуры
// - Безнал Оплата добавить


// + Отправить в Pay Keeper
&НаКлиенте
Процедура ОтправитьВPayKeeper(Команда)
ОтправитьВPayKeeperДействие();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВPayKeeperДействие()
	
Если ЗначениеЗаполнено(ЭтаФорма.УникальныйИдентификатор) Тогда
	УникальныйИдентификатор_П = ЭтаФорма.УникальныйИдентификатор;		
Иначе
	УникальныйИдентификатор_П = Новый УникальныйИдентификатор();
КонецЕсли;

ДопПараметры = Новый Структура;
ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеФормы_ОтправкаPayKeeper", ЭтотОбъект, ДопПараметры);

ОбъектДанные = Объект;
PayKeeperКлиент.ОтправитьВPayKeeperДолг(ОбъектДанные, Неопределено, УникальныйИдентификатор_П
	, ЭтаФорма, ОповещениеОЗавершении);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Контрагент(КоворкингЗаявка)
	
Возврат КоворкингЗаявка.Клиент;	
КонецФункции	

&НаКлиенте
Функция СуммаКЗакрытиюДопУслуги()
СуммаКЗакрытиюДопУслуги = 0;	

Для Каждого Строка Из Объект.ДопУслугиКоворкинг Цикл
	СуммаКЗакрытиюДопУслуги = СуммаКЗакрытиюДопУслуги + Строка.Сумма - Строка.СуммаОплачено;		
КонецЦикла;		
	
Возврат СуммаКЗакрытиюДопУслуги;	
КонецФункции

&НаКлиенте
Процедура ЗавершениеФормы_ОтправкаPayKeeper(Результат, ДополнительныеПараметры) Экспорт
Ответ = ДополнительныеПараметры.Результат;	
ИД_Платежа = Ответ.ИД_Платежа;

ПоказатьПредупреждение(, "Платеж отправлен в Pay Keeper");
КонецПроцедуры
// - Отправить в Pay Keeper

&НаКлиенте
Процедура ПроверитьОплатуPayKeepr(Команда)
 
Ответ = PayKeeperКлиентСервер.СписокПлатежейPayKeeper();
Если Ответ.Ошибка Тогда 
	ПоказатьПредупреждение(, Ответ.ОписаниеОшибки); 
	Сообщить(Ответ.ОписаниеОшибки);
	
	Возврат;
КонецЕсли;

СписокПлатежей = Ответ.СписокПлатежей;	

ЕстьОплаты = Ложь;
НомерСчетаPayKeeper = НомерСчетаPayKeeper();
Для Каждого СтрокаПлатежа Из СписокПлатежей Цикл 
	                      
	Если СтрокаПлатежа.orderid <> НомерСчетаPayKeeper Тогда Продолжить; КонецЕсли; 
	
	Если СтрокаПлатежа.status <> "success" Тогда  Продолжить; КонецЕсли; 
	
	ИД_ПлатежаСтрока = СтрокаПлатежа.id;
	ИД_Платежа = ОбщийФункционалКлиентСервер.ПолучитьЧисло(ИД_ПлатежаСтрока);
	
	СуммаПлатежаСтрока = СтрокаПлатежа.pay_amount;
	СуммаПлатежа = ОбщийФункционалКлиентСервер.ПолучитьЧисло(СуммаПлатежаСтрока);
	
	ПоказатьПредупреждение(, "Успешная оплата счета: " + НомерСчетаPayKeeper + " на сумму: " + Строка(СуммаПлатежа));
	ЕстьОплаты = Истина;

	//Строка = Новый Структура("ИД_платежа, Плательщик, НомерСчета, СуммаПлатежа, Статус"
	//		 , ИД_Платежа, СтрокаПлатежа.clientid, СтрокаПлатежа.orderid, СуммаПлатежа, СтрокаПлатежа.status); 
	//		 
	//ДатаОплатыСтрока = СтрокаПлатежа.success_datetime;
	//Если ЗначениеЗаполнено(ДатаОплатыСтрока) Тогда
	//	//ДатаОплатыСтрока = СтрЗаменить(ДатаОплатыСтрока ,"-" ,".");
	//	ДатаОплаты = ОбщийФункционалКлиентСервер.ПолучитьДату(ДатаОплатыСтрока);
	//Иначе
	//	ДатаОплаты = Неопределено;
	//КонецЕсли;

	//НаборЗаписей = PayKeeperСервер.ОбновитьPayKeeperПлатежи(Строка, Неопределено, ДатаОплаты);
	//
	//СтрокаНабора = НаборЗаписей[0];	
	//	
	//PayKeeperСервер.СвязатьPayKeeperПлатежи(СтрокаНабора.ИД_Платежа);  
КонецЦикла;

Если НЕ ЕстьОплаты Тогда
	ПоказатьПредупреждение(, "Нет оплаты счета: " + НомерСчетаPayKeeper);
КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НомерСчетаPayKeeper()
ТД = Неопределено;

Ответ = PayKeeperСервер.НомерСчета(Объект, Неопределено);
НомерСчетаPayKeeper = Ответ.НомерСчетаPayKeeper;

Возврат НомерСчетаPayKeeper;
КонецФункции

//////
&НаКлиенте
Процедура ПечатьСчета(Команда)
ПечатьСчетаКоворкинг(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетаКоворкинг(Форма, ДокументДолгСсылка) Экспорт
ДокументДолгОбъектПараметр = ДокументДолгСсылка;

Контрагент = КоворкингСервер.ОплачиваетСчет(ДокументДолгСсылка);	

ТабличныйДокумент = КоворкингПечатьСервер.ТабличныйДокументСчетКоворкинг(ДокументДолгСсылка);

ОткрытьФормуПечатьСчетаКоворкинг(Форма, ДокументДолгСсылка, Контрагент, ТабличныйДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПечатьСчетаКоворкинг(Форма, ДокументДолгСсылка, Контрагент, ТабличныйДокумент
	, НаАнглийском = Ложь) Экспорт
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТабличныйДокумент", ТабличныйДокумент); 

ПараметрыФормы.Вставить("ДокументДолгСсылка", ДокументДолгСсылка);
ПараметрыФормы.Вставить("СчетГУИД", Неопределено);

ПараметрыФормы.Вставить("Контрагент", Контрагент);

ПараметрыФормы.Вставить("НаАнглийском", НаАнглийском);

ОткрытьФорму("ОбщаяФорма.ПечатьИОтправкаНаПочтуСчетаИПодтверждения", ПараметрыФормы, Форма
	, Истина,,,, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАкта(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;	

ДанныеОбъект = Объект;
ТабличныйДокумент = КоворкингПечатьСервер.ПечатьАктаДействие(ДанныеОбъект);
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабличныйДокумент, "Акт");
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ЭтаФорма, Истина); 
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)

КонецПроцедуры


&НаКлиенте
Процедура ПечатьСчетаФактуры(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;	
	
ТабДок = Новый ТабличныйДокумент; 

Номер = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Объект.Номер);
Дата = НачалоДня(Объект.ДатаПо);

ДокументОтгрузки = "Акт № " + Номер + " от " + Дата;

Если ЗначениеЗаполнено(Объект.ОплачиваетСчет) Тогда
	Контрагент = Объект.ОплачиваетСчет;
Иначе
	Контрагент = ?(ЗначениеЗаполнено(Объект.КоворкингЗаявка.Оплачивает), Объект.КоворкингЗаявка.Оплачивает
			, Объект.КоворкингЗаявка.Клиент);
КонецЕсли;	
	
КоворкингПечатьСервер.ПечатьСчетаФактуры(ТабДок, Номер, Дата, Контрагент, ДокументОтгрузки, Объект.Ссылка);
Если ТабДок = Неопределено Тогда Возврат; КонецЕсли;	

ТабДок.Показать("Счет-Фактура");
КонецПроцедуры








//
//
////


