
//
Процедура ОткрытьДокументОплаты(Форма, ДокументОплаты, ТолькоПросмотр, РежимОткрытияОкна) Экспорт
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("Ключ", ДокументОплаты);
Если НЕ НастройкиСервер.ТекущийПользовательКодРавноАдминистратор() Тогда
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
КонецЕсли;

Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
	ФормаИмя = "Документ.ВыпискаБанка.Форма.ФормаДокумента";
ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
	ФормаИмя = "Документ.КассовыйДокумент.Форма.ФормаДокумента";
ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
	ФормаИмя = "Документ.ПрочиеОплаты.Форма.ФормаДокумента";
Иначе
	Возврат;	
КонецЕсли;

Если ЗначениеЗаполнено(РежимОткрытияОкна) ТОгда
	РежимОткрытияОкна_П = РежимОткрытияОкна;
Иначе
	РежимОткрытияОкна_П = РежимОткрытияОкнаФормы.Независимый;
КонецЕсли;

ОткрытьФорму(ФормаИмя, ПараметрыФормы, Форма
	,,,,, РежимОткрытияОкна_П);
КонецПроцедуры

Процедура ОткрытьДокументДолг(Форма, ДокументДолг, ТолькоПросмотр, РежимОткрытияОкна) Экспорт
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("Ключ", ДокументДолг); 

Если НЕ НастройкиСервер.ТекущийПользовательКодРавноАдминистратор() Тогда
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
КонецЕсли;

Если ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	ФормаИмя = "Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента";	
ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	ФормаИмя = "Документ.ГрупповыеСчета.Форма.ФормаДокумента";	
ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.КоворкингСчета") Тогда
	ФормаИмя = "Документ.КоворкингСчета.Форма.ФормаДокумента";	
Иначе
	Возврат;
КонецЕсли;

Если ЗначениеЗаполнено(РежимОткрытияОкна) ТОгда
	РежимОткрытияОкна_П = РежимОткрытияОкна;
Иначе
	РежимОткрытияОкна_П = РежимОткрытияОкнаФормы.Независимый;
КонецЕсли;

ОткрытьФорму(ФормаИмя, ПараметрыФормы, Форма
	,,,,, РежимОткрытияОкна_П);
КонецПроцедуры
//

//
Функция ЕстьСчета(Счета) Экспорт
Если Счета.Количество() > 0 Тогда 
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции

Функция ЕстьОплатыСчета(СчетГУИД, РаспределениеОплатДолги) Экспорт
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
Возврат (НайденныеСтроки.Количество() > 0);  
КонецФункции

Функция ЕстьГрупповыеСчетаКонтрагент(Счета, Контрагент) Экспорт
Для Каждого Строка Из Счета Цикл 
	Если ЗначениеЗаполнено(Строка.ГрупповойСчет) И Строка.Контрагент = Контрагент
	Тогда Возврат Строка.ГрупповойСчет; КонецЕсли;		
КонецЦикла;

Возврат Неопределено;
КонецФункции
//



//
Функция ЕстьБлокированныеЗаявкиПредупреждение(Заявки) Экспорт
МассивОшибок = ЗаявкаСервер.БлокироватьЗаявки(Заявки);	
Если МассивОшибок.Количество() = 0  Тогда Возврат Ложь; КонецЕсли;

ТекстОшибки = "Есть открытые (заблокированные) Заявки. 
				|
				|ЗАКРОЙТЕ ОТКРЫТЫЕ ЗАЯВКИ И ПОВТОРИТЕ ОПЕРАЦИЮ ...";
ПоказатьПредупреждение(, ТекстОшибки); 

Для Каждого Элемент Из МассивОшибок Цикл
	Сообщить(Элемент);					 
КонецЦикла;		

Возврат Истина;
КонецФункции
//

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++
