

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АнкетаВопросы.Ссылка КАК Ссылка,
	                      |	АнкетаВопросы.Код КАК Код,
	                      |	АнкетаВопросы.Наименование КАК Наименование,
	                      |	АнкетаВопросы.Заголовки.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		ЗаголовокКод КАК ЗаголовокКод,
	                      |		ЗаголовокНомер_пп КАК ЗаголовокНомер_пп,
	                      |		Заголовок КАК Заголовок,
	                      |		ЗаголовокТип КАК ЗаголовокТип
	                      |	) КАК Заголовки,
	                      |	АнкетаВопросы.Вопросы.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		ЗаголовокКод КАК ЗаголовокКод,
	                      |		ВопросКод КАК ВопросКод,
	                      |		Вопрос КАК Вопрос,
	                      |		ВопросНомер_пп КАК ВопросНомер_пп,
	                      |		ВопросТипОтвета КАК ВопросТипОтвета
	                      |	) КАК Вопросы
	                      |ИЗ
	                      |	Справочник.АнкетаВопросы КАК АнкетаВопросы
	                      |ГДЕ
	                      |	АнкетаВопросы.ПометкаУдаления = ЛОЖЬ");

	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 0 Тогда 
		Сообщить("Отсутсвуют данные справочника Анкета вопросы");
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	АнкетаВопросы = ТЗ[0];
	Заголовки = АнкетаВопросы.Заголовки; 
	Заголовки.Сортировать("ЗаголовокНомер_пп");
	
	Вопросы = АнкетаВопросы.Вопросы;
	Вопросы.Сортировать("ВопросНомер_пп");
	
	Для Каждого Строка Из Заголовки Цикл
		НоваяСтрока = Объект.Заголовки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из Вопросы Цикл
		НоваяСтрока = Объект.Вопросы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
КонецЕсли;

Заголовки = Объект.Заголовки; 
Вопросы = Объект.Вопросы; 

ДобавляемыеРеквизиты = РеквизитыФормы(Заголовки, Вопросы);

ИзменитьРеквизиты(ДобавляемыеРеквизиты);

ЗаполнитьРеквизиты(Заголовки, Вопросы);
	
ДобавитьЭлементыФормы(Заголовки, Вопросы);

Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ЗаполнитьДанные();
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РеквизитыФормы(Заголовки, Вопросы)
Реквизиты = Новый Массив;

Для Каждого Строка Из Заголовки Цикл
	
	Имя = "ЗаголовокКод" + Строка.ЗаголовокНомер_пп;
	НовыйРеквизит = Новый РеквизитФормы(Имя
		, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	Реквизиты.Добавить(НовыйРеквизит);
	ИмяЗаголовок = Имя;
	
	Имя = "Заголовок" + Строка.ЗаголовокНомер_пп;
	НовыйРеквизит = Новый РеквизитФормы(Имя
		, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100)));
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "ЗаголовокНомер_пп" + Строка.ЗаголовокНомер_пп;
	НовыйРеквизит = Новый РеквизитФормы(Имя
		, Новый ОписаниеТипов("Число"), , Строка.Заголовок);
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "ЗаголовокТип" + Строка.ЗаголовокНомер_пп;
	НовыйРеквизит = Новый РеквизитФормы(Имя
		, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	Реквизиты.Добавить(НовыйРеквизит);
	
	Если Строка.ЗаголовокТип = "ОтветыПХУП" Тогда
		Имя = "ПХУП_ОтветыТЗ" + Строка.ЗаголовокНомер_пп; 
		НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("ТаблицаЗначений"));
		Реквизиты.Добавить(НовыйРеквизит);
		ИмяТЗ = Имя;
		
		Имя = "ЗаголовокКод";
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50))
			, ИмяТЗ);
		Реквизиты.Добавить(НовыйРеквизит);

		Имя = "ВопросКод";
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50))
			, ИмяТЗ);
		Реквизиты.Добавить(НовыйРеквизит);
		
		Имя = "ВопросНомер_пп";
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Число")
			, ИмяТЗ);
		Реквизиты.Добавить(НовыйРеквизит); 
		
		Имя = "Вопрос";
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100))
			, ИмяТЗ);
		Реквизиты.Добавить(НовыйРеквизит);	

		Имя = "ВопросТипОтвета";
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50))
			, ИмяТЗ);
		Реквизиты.Добавить(НовыйРеквизит);	
		
		Имя = "Превосходно";
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Булево")
			, ИмяТЗ);
		Реквизиты.Добавить(НовыйРеквизит);	
		
		Имя = "Хорошо";
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Булево")
			, ИмяТЗ);
		Реквизиты.Добавить(НовыйРеквизит);	
		
		Имя = "Удовлетворительно";
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Булево")
			, ИмяТЗ);
		Реквизиты.Добавить(НовыйРеквизит);	
		
		Имя = "Плохо";
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Булево")
			, ИмяТЗ);
		Реквизиты.Добавить(НовыйРеквизит);	
		
	ИначеЕсли Строка.ЗаголовокТип = "ОтветТекст" ИЛИ Строка.ЗаголовокТип = "ОтветТекстБезСтроки" Тогда
		
		Имя = "ОтветТекст" + Строка.ЗаголовокНомер_пп;
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Строка")
			//, ИмяТЗ
			);
		Реквизиты.Добавить(НовыйРеквизит);	
		
	ИначеЕсли Строка.ЗаголовокТип = "ОтветДаНет" Тогда
		
		Имя = "ОтветДа" + Строка.ЗаголовокНомер_пп;
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Булево")
			//, ИмяТЗ
			);
		Реквизиты.Добавить(НовыйРеквизит);			
		
		Имя = "ОтветНет" + Строка.ЗаголовокНомер_пп;
		НовыйРеквизит = Новый РеквизитФормы(Имя
			, Новый ОписаниеТипов("Булево")
			//, ИмяТЗ
			);
		Реквизиты.Добавить(НовыйРеквизит);	
		
	ИначеЕсли Строка.ЗаголовокТип = "ОтветыТаблицаДаНет" Тогда
		
		ОтборСтроки = Новый Структура("ЗаголовокКод", Строка.ЗаголовокКод);
		ТЗ = Вопросы.Выгрузить(ОтборСтроки);
		ТЗ.Сортировать("ВопросНомер_пп");
		Для Каждого СтрокаВопрос Из ТЗ Цикл
			Имя = "ОтветТаблицаДаНет" + Строка.ЗаголовокНомер_пп 
				+ "_" + СтрокаВопрос.ВопросКод + "_" + СтрокаВопрос.ВопросНомер_пп; 
			НовыйРеквизит = Новый РеквизитФормы(Имя
				, Новый ОписаниеТипов("Булево")
				//, ИмяТЗ
				);
				
			Реквизиты.Добавить(НовыйРеквизит);	
		КонецЦикла;
		
	КонецЕсли;	
		
КонецЦикла;
	
Возврат Реквизиты;	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизиты(Заголовки, Вопросы)
Для Каждого Строка Из Заголовки Цикл
	
	Имя = "ЗаголовокКод" + Строка.ЗаголовокНомер_пп;
	ЭтаФорма[Имя] = Строка.ЗаголовокКод; 
	ИмяЗаголовок = Имя;
	
	Имя = "Заголовок" + Строка.ЗаголовокНомер_пп;
	ЭтаФорма[Имя] = Строка.Заголовок; 
	
	Имя = "ЗаголовокНомер_пп" + Строка.ЗаголовокНомер_пп;
	ЭтаФорма[Имя] = Строка.ЗаголовокНомер_пп; 
	
	Имя = "ЗаголовокТип" + Строка.ЗаголовокНомер_пп;
	ЭтаФорма[Имя] = Строка.ЗаголовокТип; 
	
	Если Строка.ЗаголовокТип = "ОтветыПХУП" Тогда
		Имя = "ПХУП_ОтветыТЗ" + Строка.ЗаголовокНомер_пп;
		ИмяТЗ = Имя;

		ОтборСтроки = Новый Структура("ЗаголовокКод", Строка.ЗаголовокКод);
		ТЗ = Вопросы.Выгрузить(ОтборСтроки);
		ТЗ.Сортировать("ВопросНомер_пп");
		Для Каждого СтрокаВопрос Из ТЗ Цикл
			НоваяСтрока = ЭтаФорма[ИмяТЗ].Добавить();
			НоваяСтрока.ЗаголовокКод = ЭтаФорма[ИмяЗаголовок];
			
			НоваяСтрока.ВопросКод= СтрокаВопрос.ВопросКод;
			НоваяСтрока.Вопрос= СтрокаВопрос.Вопрос;
			НоваяСтрока.ВопросНомер_пп= СтрокаВопрос.ВопросНомер_пп;
			НоваяСтрока.ВопросТипОтвета= СтрокаВопрос.ВопросТипОтвета;
		КонецЦикла;
	КонецЕсли;
КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыФормы(Заголовки, Вопросы)
	
	
Для Каждого СтрокаЗаголовки Из Заголовки Цикл
		
	Если СтрокаЗаголовки.ЗаголовокТип = "ОтветыПХУП" Тогда
		
		Имя = "ГруппаЗаголовок" + СтрокаЗаголовки.ЗаголовокНомер_пп;  
		ГруппаФормы = Элементы.Добавить(Имя, Тип("ГруппаФормы"));
		//ГруппаФормы = Имя;
		
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Заголовок = СтрокаЗаголовки.Заголовок;
		ГруппаФормы.ОтображатьЗаголовок = Ложь;
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 

		ИмяЭлемента = "ВопросыНадпись" + СтрокаЗаголовки.ЗаголовокНомер_пп;
		ДекорацияФормы = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаФормы);
		ДекорацияФормы.Заголовок = " ";
		
		ИмяРеквизита = "ПХУП_ОтветыТЗ" + СтрокаЗаголовки.ЗаголовокНомер_пп;;
		ИмяЭлемента = "Вопросы" + СтрокаЗаголовки.ЗаголовокНомер_пп;
		ВопросыТЗ = Элементы.Добавить(ИмяЭлемента, Тип("ТаблицаФормы"), ГруппаФормы);
		ВопросыТЗ.ПутьКДанным                  = ИмяРеквизита;
		ВопросыТЗ.Отображение = ОтображениеТаблицы.Список;
		ВопросыТЗ.Заголовок = "ТЗ";
		
		ВопросыТЗ.УстановитьДействие("ПередНачаломДобавления", "ТаблицаПередНачаломДобавления");
		ВопросыТЗ.УстановитьДействие("ПередУдалением", "ТаблицаПередУдалением");
		
		ИменаВопросыТЗ.Добавить(ИмяЭлемента);
		
		ОтборСтроки = Новый Структура("ЗаголовокКод", СтрокаЗаголовки.ЗаголовокКод);
		ТЗ = Вопросы.Выгрузить(ОтборСтроки);	
		ВопросыТЗ.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
		ВопросыТЗ.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Ложь;
		ВопросыТЗ.МаксимальнаяВысотаВСтрокахТаблицы = ТЗ.Количество();
		
		ИмяЭлементТаблицы = ИмяЭлемента; 
		ИмяРеквизитаТаблицы = ИмяРеквизита; 
		
		Имя = "Вопрос";
		ИмяЭлемента = ИмяРеквизитаТаблицы + Имя;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ВопросыТЗ);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаТаблицы + "." + Имя;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		НовыйЭлемент.Заголовок = СтрокаЗаголовки.Заголовок;
		НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
		
		Имя = "Превосходно";
		ИмяЭлемента = ИмяРеквизитаТаблицы + Имя;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ВопросыТЗ);       
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаТаблицы + "." + Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Заголовок = "Превосходно";
		НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
		
		Имя = "Хорошо";
		ИмяЭлемента = ИмяРеквизитаТаблицы + Имя;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ВопросыТЗ);       
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаТаблицы + "." + Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Заголовок = "Хорошо";
		НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
		
		Имя = "Удовлетворительно";
		ИмяЭлемента = ИмяРеквизитаТаблицы + Имя;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ВопросыТЗ);       
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаТаблицы + "." + Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Заголовок = "Удовлетворительно";
		НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
		
		Имя = "Плохо";
		ИмяЭлемента = ИмяРеквизитаТаблицы + Имя;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ВопросыТЗ);       
		НовыйЭлемент.ПутьКДанным = ИмяРеквизитаТаблицы + "." + Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Заголовок = "Плохо";
		НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
		
	ИначеЕсли СтрокаЗаголовки.ЗаголовокТип = "ОтветТекст" ИЛИ СтрокаЗаголовки.ЗаголовокТип = "ОтветТекстБезСтроки"  Тогда
		Имя = "ГруппаЗаголовок" + СтрокаЗаголовки.ЗаголовокНомер_пп;  
		ГруппаФормы = Элементы.Добавить(Имя, Тип("ГруппаФормы"));
		//ГруппаФормы = Имя;
		
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Заголовок = СтрокаЗаголовки.Заголовок;
		ГруппаФормы.ОтображатьЗаголовок = Ложь;
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		
		Если НЕ СтрокаЗаголовки.ЗаголовокТип = "ОтветТекстБезСтроки" Тогда
			ИмяЭлемента = "ОтветТекстНадпись" + СтрокаЗаголовки.ЗаголовокНомер_пп;
			ДекорацияФормы = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаФормы);
			ДекорацияФормы.Заголовок = " ";
		КонецЕсли;
		
		ИмяРеквизита = "ОтветТекст" + СтрокаЗаголовки.ЗаголовокНомер_пп;
		ИмяЭлемента = "ОтветТекст" + СтрокаЗаголовки.ЗаголовокНомер_пп;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);
		НовыйЭлемент.ПутьКДанным                  = ИмяРеквизита;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		НовыйЭлемент.МногострочныйРежим = Истина;
		НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
		НовыйЭлемент.МаксимальнаяВысота = 3;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		
		Если НЕ СтрокаЗаголовки.ЗаголовокТип = "ОтветТекстБезСтроки" Тогда
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);	
		КонецЕсли;
		
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Заголовок = СтрокаЗаголовки.Заголовок;		
		
	ИначеЕсли СтрокаЗаголовки.ЗаголовокТип = "ОтветДаНет" Тогда
		Имя = "ГруппаЗаголовок" + СтрокаЗаголовки.ЗаголовокНомер_пп;  
		ГруппаФормы = Элементы.Добавить(Имя, Тип("ГруппаФормы"));
		//ГруппаФормы = Имя;
		
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Заголовок = СтрокаЗаголовки.Заголовок;
		ГруппаФормы.ОтображатьЗаголовок = Ложь;
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		
		ИмяЭлемента = "ОтветДаНетНадпись" + СтрокаЗаголовки.ЗаголовокНомер_пп;
		ДекорацияФормы = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаФормы);
		ДекорацияФормы.Заголовок = " ";
		
		ИмяЭлемента = "НадписьДаНет" + СтрокаЗаголовки.ЗаголовокНомер_пп;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаФормы);
		НовыйЭлемент.Заголовок = СтрокаЗаголовки.Заголовок;	
		НовыйЭлемент.Шрифт = Новый Шрифт(,,Истина);	

		Имя = "ГруппаЗаголовокОтветДаНет" + СтрокаЗаголовки.ЗаголовокНомер_пп;  
		ГруппаФормыОтветДаНет = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаФормы);
		//ГруппаФормы = Имя;
		
		ГруппаФормыОтветДаНет.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормыОтветДаНет.ОтображатьЗаголовок = Ложь;
		ГруппаФормыОтветДаНет.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
		
		ИмяЭлемента = "ОтветДа" + СтрокаЗаголовки.ЗаголовокНомер_пп; ;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормыОтветДаНет);       
		НовыйЭлемент.ПутьКДанным = ИмяЭлемента;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Заголовок = "Да";

		ИмяЭлемента = "ОтветНет" + СтрокаЗаголовки.ЗаголовокНомер_пп; ;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормыОтветДаНет);       
		НовыйЭлемент.ПутьКДанным = ИмяЭлемента;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ТолькоПросмотр = Ложь;
		НовыйЭлемент.Заголовок = "Нет";
		
	ИначеЕсли СтрокаЗаголовки.ЗаголовокТип = "ОтветыТаблицаДаНет" Тогда
		Имя = "ГруппаЗаголовок" + СтрокаЗаголовки.ЗаголовокНомер_пп;  
		ГруппаФормы = Элементы.Добавить(Имя, Тип("ГруппаФормы"));
		//ГруппаФормы = Имя;
		
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Заголовок = СтрокаЗаголовки.Заголовок;
		ГруппаФормы.ОтображатьЗаголовок = Ложь;
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 		
		
		ИмяЭлемента = "ОтветыДаНетНадпись" + СтрокаЗаголовки.ЗаголовокНомер_пп;
		ДекорацияФормы = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаФормы);
		ДекорацияФормы.Заголовок = " ";
		
		ИмяЭлемента = "НадписьДаНет" + СтрокаЗаголовки.ЗаголовокНомер_пп;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаФормы);
		НовыйЭлемент.Заголовок = СтрокаЗаголовки.Заголовок;	
		НовыйЭлемент.Шрифт = Новый Шрифт(,,Истина);	
		
		Имя = "ГруппаЗаголовокОтветыТаблица" + СтрокаЗаголовки.ЗаголовокНомер_пп;  
		ГруппаФормыОтветыТаблица = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаФормы);
		
		ГруппаФормыОтветыТаблица.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормыОтветыТаблица.ОтображатьЗаголовок = Ложь;
		ГруппаФормыОтветыТаблица.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;			
		
		ИмяЭлемента = "ВопросыНадпись" + СтрокаЗаголовки.ЗаголовокНомер_пп;
		ВопросыТЗ = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), ГруппаФормыОтветыТаблица);
		
		Имя = "ГруппаВ1" + СтрокаЗаголовки.ЗаголовокНомер_пп;  
		ГруппаВ1 = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаФормыОтветыТаблица);
		
		ГруппаВ1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаВ1.ОтображатьЗаголовок = Ложь;
		ГруппаВ1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		Имя = "ГруппаВ2" + СтрокаЗаголовки.ЗаголовокНомер_пп;  
		ГруппаВ2 = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаФормыОтветыТаблица);
		
		ГруппаВ2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаВ2.ОтображатьЗаголовок = Ложь;
		ГруппаВ2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		ОтборСтроки = Новый Структура("ЗаголовокКод", СтрокаЗаголовки.ЗаголовокКод);
		ТЗ = Вопросы.Выгрузить(ОтборСтроки);
		ТЗ.Сортировать("ВопросНомер_пп");
		
		Количество = ТЗ.Количество();
		Четное = Окр(Количество / 2, 1) - Окр(Количество / 2);
		Если Четное = 1 Тогда
			Количество_1 = Окр(Количество / 2) + 1;
		Иначе
			Количество_1 = Окр(Количество / 2);
		КонецЕсли;
		
		Индекс = 1;
		Для Каждого СтрокаВопрос Из ТЗ Цикл
			Имя = "ОтветТаблицаДаНет" + СтрокаЗаголовки.ЗаголовокНомер_пп 
				+ "_" + СтрокаВопрос.ВопросКод + "_" + СтрокаВопрос.ВопросНомер_пп; 
			Если Индекс <= Количество_1 Тогда
				НовыйЭлемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), ГруппаВ1);       
			Иначе
				НовыйЭлемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), ГруппаВ2);       
			КонецЕсли;
			НовыйЭлемент.ПутьКДанным = Имя;
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ТолькоПросмотр = Ложь;
			НовыйЭлемент.Заголовок = СтрокаВопрос.Вопрос;
			
			Индекс = Индекс + 1;
		КонецЦикла;

	КонецЕсли;
КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанные()
Ответы_ПХУП = Объект.Ответы_ПХУП;	
Ответы_Текст = Объект.Ответы_Текст;	
Ответы_ДаНет = Объект.Ответы_ДаНет;	
Ответы_ТаблицаДаНет = Объект.Ответы_ТаблицаДаНет;	

Для Каждого Строка Из Объект.Заголовки Цикл
	Если Строка.ЗаголовокТип = "ОтветыПХУП" Тогда
		Имя = "ПХУП_ОтветыТЗ" + Строка.ЗаголовокНомер_пп;	
		
		ОтборСтроки = Новый Структура("ЗаголовокКод"
			, Строка.ЗаголовокКод);
		ТЗ = ЭтаФорма[Имя].НайтиСтроки(ОтборСтроки);
		
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			ОтборСтрокиТЗ = Новый Структура("ЗаголовокКод, ВопросКод, ВопросНомер_пп"
				, Строка.ЗаголовокКод, СтрокаТЗ.ВопросКод, СтрокаТЗ.ВопросНомер_пп);			
				
			НайденныеСтроки = Ответы_ПХУП.НайтиСтроки(ОтборСтрокиТЗ); 
			НайденнаяСтрока = НайденныеСтроки[0];
			
			СтрокаТЗ.Превосходно = НайденнаяСтрока.Превосходно;
			СтрокаТЗ.Хорошо = НайденнаяСтрока.Хорошо;
			СтрокаТЗ.Удовлетворительно = НайденнаяСтрока.Удовлетворительно;
			СтрокаТЗ.Плохо = НайденнаяСтрока.Плохо;
		КонецЦикла;		
	ИначеЕсли Строка.ЗаголовокТип = "ОтветТекст" ИЛИ Строка.ЗаголовокТип = "ОтветТекстБезСтроки"Тогда
		Имя = "ОтветТекст" + Строка.ЗаголовокНомер_пп;	
		
		ОтборСтрокиТЗ = Новый Структура("ЗаголовокКод"
			, Строка.ЗаголовокКод);			
			
		НайденныеСтроки = Ответы_Текст.НайтиСтроки(ОтборСтрокиТЗ); 
		НайденнаяСтрока = НайденныеСтроки[0];

		ЭтаФорма[Имя] = НайденнаяСтрока.ОтветТекст;
		
	ИначеЕсли Строка.ЗаголовокТип = "ОтветДаНет" Тогда
		ИмяДа = "ОтветДа" + Строка.ЗаголовокНомер_пп;	
		ИмяНет = "ОтветНет" + Строка.ЗаголовокНомер_пп;	
		
		ОтборСтрокиТЗ = Новый Структура("ЗаголовокКод"
			, Строка.ЗаголовокКод);			
			
		НайденныеСтроки = Ответы_ДаНет.НайтиСтроки(ОтборСтрокиТЗ); 
		НайденнаяСтрока = НайденныеСтроки[0];

		ЭтаФорма[ИмяДа] = НайденнаяСтрока.ОтветДа;
		ЭтаФорма[ИмяНет] = НайденнаяСтрока.ОтветНет;
		
	ИначеЕсли Строка.ЗаголовокТип = "ОтветыТаблицаДаНет" Тогда
		ОтборСтроки = Новый Структура("ЗаголовокКод"
			, Строка.ЗаголовокКод);
		НайденныеСтроки = Объект.Вопросы.НайтиСтроки(ОтборСтроки);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Имя = "ОтветТаблицаДаНет" + Строка.ЗаголовокНомер_пп 
				+ "_" + НайденнаяСтрока.ВопросКод + "_" + НайденнаяСтрока.ВопросНомер_пп; 
				
			ОтборСтроки = Новый Структура("ЗаголовокКод, ВопросКод, ВопросНомер_пп"
				, Строка.ЗаголовокКод, НайденнаяСтрока.ВопросКод, НайденнаяСтрока.ВопросНомер_пп); 	
			СтрокиОтвета = Ответы_ТаблицаДаНет.НайтиСтроки(ОтборСтроки); 	
			СтрокаОтвета = СтрокиОтвета[0];	
			ЭтаФорма[Имя] = СтрокаОтвета.ОтветДаНет;
		КонецЦикла;
	КонецЕсли;	
КонецЦикла;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ТаблицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Для Каждого Элемент Из ИменаВопросыТЗ Цикл	
	//Элементы.Вопросы1КоманднаяПанель.ПодчиненныеЭлементы.Вопросы1Добавить.Видимость = Ложь;
	//Элементы.Вопросы1КоманднаяПанель.ПодчиненныеЭлементы.Вопросы1Скопировать.Видимость = Ложь; 
	Имя = Элемент.Значение + "КоманднаяПанель";
	Элементы[Имя].ПодчиненныеЭлементы[Элемент.Значение + "Добавить"].Видимость = Ложь;
	Элементы[Имя].ПодчиненныеЭлементы[Элемент.Значение + "Скопировать"].Видимость = Ложь; 
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Ответы_ПХУП = Объект.Ответы_ПХУП;	
Ответы_ПХУП.Очистить();

Ответы_Текст = Объект.Ответы_Текст;	
Ответы_Текст.Очистить();

Ответы_ДаНет = Объект.Ответы_ДаНет;	
Ответы_ДаНет.Очистить();

Ответы_ТаблицаДаНет = Объект.Ответы_ТаблицаДаНет;	
Ответы_ТаблицаДаНет.Очистить();

Для Каждого Строка Из Объект.Заголовки Цикл
	Если Строка.ЗаголовокТип = "ОтветыПХУП" Тогда
		
		Имя = "ПХУП_ОтветыТЗ" + Строка.ЗаголовокНомер_пп;	
		
		ОтборСтроки = Новый Структура("ЗаголовокКод"
			, Строка.ЗаголовокКод);
		НайденныеСтроки = ЭтаФорма[Имя].НайтиСтроки(ОтборСтроки);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
			НоваяСтрока = Ответы_ПХУП.Добавить();
			
			НоваяСтрока.ЗаголовокКод = Строка.ЗаголовокКод;		
			
			НоваяСтрока.ВопросКод = НайденнаяСтрока.ВопросКод;		
			НоваяСтрока.ВопросНомер_пп = НайденнаяСтрока.ВопросНомер_пп;	
			
			НоваяСтрока.Превосходно = НайденнаяСтрока.Превосходно;
			НоваяСтрока.Хорошо = НайденнаяСтрока.Хорошо;
			НоваяСтрока.Удовлетворительно = НайденнаяСтрока.Удовлетворительно;
			НоваяСтрока.Плохо = НайденнаяСтрока.Плохо;
		КонецЦикла;		
		
	ИначеЕсли Строка.ЗаголовокТип = "ОтветТекст" ИЛИ Строка.ЗаголовокТип = "ОтветТекстБезСтроки"Тогда
		
		Имя = "ОтветТекст" + Строка.ЗаголовокНомер_пп;	
		НоваяСтрока = Ответы_Текст.Добавить();
		НоваяСтрока.ЗаголовокКод = Строка.ЗаголовокКод;		
		
		НоваяСтрока.ОтветТекст = ЭтаФорма[Имя];
		
	ИначеЕсли Строка.ЗаголовокТип = "ОтветДаНет" Тогда
		
		ИмяДа = "ОтветДа" + Строка.ЗаголовокНомер_пп;	
		ИмяНет = "ОтветНет" + Строка.ЗаголовокНомер_пп;	
		
		НоваяСтрока = Ответы_ДаНет.Добавить();
		НоваяСтрока.ЗаголовокКод = Строка.ЗаголовокКод;		
			
		НоваяСтрока.ОтветДа = ЭтаФорма[ИмяДа];	
		НоваяСтрока.ОтветНет = ЭтаФорма[ИмяНет];	
		
	ИначеЕсли Строка.ЗаголовокТип = "ОтветыТаблицаДаНет" Тогда
		
		ОтборСтроки = Новый Структура("ЗаголовокКод"
			, Строка.ЗаголовокКод);
		НайденныеСтроки = Объект.Вопросы.НайтиСтроки(ОтборСтроки);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл

			Имя = "ОтветТаблицаДаНет" + Строка.ЗаголовокНомер_пп 
				+ "_" + НайденнаяСтрока.ВопросКод + "_" + НайденнаяСтрока.ВопросНомер_пп; 
		
			НоваяСтрока = Ответы_ТаблицаДаНет.Добавить();
			НоваяСтрока.ЗаголовокКод = Строка.ЗаголовокКод;		
		
			НоваяСтрока.ВопросКод = НайденнаяСтрока.ВопросКод;		
			НоваяСтрока.ВопросНомер_пп = НайденнаяСтрока.ВопросНомер_пп;		
			
			НоваяСтрока.ОтветДаНет = ЭтаФорма[Имя];
		КонецЦикла;
	КонецЕсли;	
	
КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
Наименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Клиент, "Наименование");	
Объект.ФИО = Наименование;	
Телефон = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Клиент, "Телефон");		
Объект.Телефон = Телефон;	
ЭлПочта = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Клиент, "ЭлПочта");		
Объект.EMail = ЭлПочта;	
КонецПроцедуры





