
//
Процедура ПередУдалением(Отказ)
Для Каждого Строка Из ДокументыДолги Цикл
	ГрупповойСчетСервер.УдалитьДокументДолгГрупповойСчет(Строка.ДокументДолг, Строка.СчетГУИД);   
КонецЦикла;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
ДатаДокумента = '00010101';
Для Каждого Строка Из ДокументыДолги Цикл
	ДокументДолг = Строка.ДокументДолг;
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);  
	НайденныеСтроки = ДокументДолг.Счета.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Счет = НайденныеСтроки[0];
	ДатаДокумента = Макс(ДатаДокумента, Счет.ДатаПо); 
КонецЦикла;

// + Аудит
//ДатаДокумента = ДатаДокумента;
// - Аудит
КонецПроцедуры






