
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Ложь);

ТекущийПользовательКодРавноАдминистратор = НастройкиСервер.ТекущийПользовательКодРавноАдминистратор();
Элементы.ГУИДЗагрузка.Видимость = ТекущийПользовательКодРавноАдминистратор;
Элементы.СозданПрограммно.Видимость = ТекущийПользовательКодРавноАдминистратор;

РучнойВвод = НЕ ЗначениеЗаполнено(Объект.ГУИДЗагрузка);

Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Если Параметры.Свойство("ЭтоПлатежКонтрагенту") Тогда	
		ЭтоПлатежКонтрагенту = Параметры.ЭтоПлатежКонтрагенту;
		
		ЭтоВозврат = Ложь;
		СозданПрограммно = Истина;		
		
	ИначеЕсли Параметры.Свойство("ЭтоВозврат") Тогда
		ЭтоВозврат = Параметры.ЭтоВозврат;
		
		ЭтоПлатежКонтрагенту = Ложь;
		СозданПрограммно = Истина;	
		
	Иначе	
		ЭтоВозврат = Ложь;
		ЭтоПлатежКонтрагенту = Ложь;
		СозданПрограммно = Ложь;
		
	КонецЕсли;	

	Если ЭтоПлатежКонтрагенту Тогда 
		Объект.Приход = Ложь;
		Объект.Возврат = Ложь;
		Объект.ЭтоПлатежКонтрагенту = Истина;
		
		Параметры.Свойство("ОтКого", Объект.ОтКого);
		Если ЗначениеЗаполнено(Объект.ОтКого) Тогда Элементы.ОтКого.ТолькоПросмотр = Истина; КонецЕсли;  
		
		Параметры.Свойство("Сумма", Объект.Сумма);
		//Если ЗначениеЗаполнено(Объект.Сумма) Тогда Элементы.Сумма.ТолькоПросмотр = НЕ ЭтоАдминистратор; КонецЕсли;  
		
	ИначеЕсли ЭтоВозврат Тогда
		Объект.Приход = Ложь;
		Объект.Возврат = Истина;
		Объект.ЭтоПлатежКонтрагенту = Ложь;
		
		Параметры.Свойство("ОтКого", Объект.ОтКого);
		Если ЗначениеЗаполнено(Объект.ОтКого) Тогда Элементы.ОтКого.ТолькоПросмотр = Истина; КонецЕсли;  

		Параметры.Свойство("ВозвратДокумент", Объект.ВозвратДокумент);
		Если ЗначениеЗаполнено(Объект.ВозвратДокумент) Тогда Элементы.ВозвратДокумент.ТолькоПросмотр = Истина; КонецЕсли;  
		
		Параметры.Свойство("ВозвратСумма", Объект.Сумма);
		//Если ЗначениеЗаполнено(Объект.Сумма) Тогда Элементы.Сумма.ТолькоПросмотр = НЕ ЭтоАдминистратор; КонецЕсли;  
		
	Иначе	
		Объект.Приход = Истина;
		Объект.Возврат = Ложь;
		Объект.ЭтоПлатежКонтрагенту = Ложь;
	КонецЕсли;
Иначе	
	СозданПрограммно = (НЕ РучнойВвод) ИЛИ Объект.Возврат ИЛИ Объект.ЭтоПлатежКонтрагенту;
КонецЕсли;

Если Объект.ЭтоПлатежКонтрагенту Тогда 
	Элементы.ДекорацияТипДокумента.Заголовок = "Платеж";
	Элементы.ДекорацияТипДокумента.ЦветТекста = WebЦвета.Фиолетовый;
ИначеЕсли Объект.Возврат Тогда
	Элементы.ДекорацияТипДокумента.Заголовок = "Возврат";
	Элементы.ДекорацияТипДокумента.ЦветТекста = WebЦвета.Красный;
ИначеЕсли Объект.Приход Тогда 	
	Элементы.ДекорацияТипДокумента.Заголовок = "Приход";
	Элементы.ДекорацияТипДокумента.ЦветТекста = WebЦвета.Зеленый;
Иначе	
	Элементы.ДекорацияТипДокумента.Заголовок = "Расход";
	Элементы.ДекорацияТипДокумента.ЦветТекста = WebЦвета.Коричневый;
КонецЕсли; 

Если СозданПрограммно Тогда
	Если Объект.ЭтоПлатежКонтрагенту Тогда 
		Элементы.ЭтоПлатежКонтрагенту.ТолькоПросмотр = Истина;
		Элементы.ЭтоПлатежКонтрагенту.Видимость = Истина;
		
		Элементы.Приход.ТолькоПросмотр = Истина;

		Элементы.ЭтоЭквайринг.ТолькоПросмотр = Истина;
		Элементы.ЭтоЭквайринг.Видимость = ЭтоАдминистратор;
		
		Элементы.ЭтоКоворкинг.ТолькоПросмотр = Истина;
		Элементы.ЭтоКоворкинг.Видимость = ЭтоАдминистратор;
		
		Элементы.Возврат.ТолькоПросмотр = Истина;
		Элементы.Возврат.Видимость = ЭтоАдминистратор;
		
		Элементы.ВозвратДокумент.Видимость = ЭтоАдминистратор;
		Элементы.СуммаВозвратДокумент.Видимость = ЭтоАдминистратор;
		Элементы.СуммаОстатокВозврат.Видимость = ЭтоАдминистратор;
		
		Элементы.СуммаВозврат.Видимость = ЭтоАдминистратор;
		Элементы.СуммаОстаток.Видимость = ЭтоАдминистратор;

		Элементы.ФормаСоздатьВозврат.Доступность = Ложь;
		Элементы.ФормаСоздатьВозврат.Видимость = ЭтоАдминистратор;
		
		Элементы.Возвраты.ТолькоПросмотр = Истина;			
		Элементы.Возвраты.Видимость = ЭтоАдминистратор;	
		
		Элементы.ДолгиОплата.ТолькоПросмотр = Истина;	
		Элементы.ДолгиОплата.Видимость = ЭтоАдминистратор;	
		
	ИначеЕсли Объект.Возврат Тогда
		Элементы.ЭтоПлатежКонтрагенту.ТолькоПросмотр = Истина;
		Элементы.ЭтоПлатежКонтрагенту.Видимость = ЭтоАдминистратор;
		
		Элементы.Приход.ТолькоПросмотр = Истина;
		
		Элементы.ЭтоЭквайринг.ТолькоПросмотр = Истина;
		Элементы.ЭтоЭквайринг.Видимость = ЭтоАдминистратор;
		
		Элементы.ЭтоКоворкинг.ТолькоПросмотр = Истина;
		Элементы.ЭтоКоворкинг.Видимость = ЭтоАдминистратор;
		
		Элементы.Возврат.ТолькоПросмотр = Истина;
		Элементы.Возврат.Видимость = Истина;
		
		Элементы.ВозвратДокумент.ТолькоПросмотр = НЕ ЭтоАдминистратор;
		Элементы.ВозвратДокумент.Видимость = Истина;
		
		Элементы.СуммаОстатокВозврат.Видимость = Истина;
		Элементы.СуммаВозвратДокумент.Видимость = Истина;
		
		Элементы.СуммаВозврат.Видимость = ЭтоАдминистратор;
		Элементы.СуммаОстаток.Видимость = ЭтоАдминистратор;
		
		Элементы.ФормаСоздатьВозврат.Доступность = Ложь;
		Элементы.ФормаСоздатьВозврат.Видимость = ЭтоАдминистратор;

		Элементы.Возвраты.ТолькоПросмотр = Истина;			
		Элементы.Возвраты.Видимость = ЭтоАдминистратор;			

		Элементы.ДолгиОплата.ТолькоПросмотр = Истина;	
		Элементы.ДолгиОплата.Видимость = ЭтоАдминистратор;	
		
		СуммаВозвратОстаток = СуммаОстаткаВозврат();
		СуммаВозвратДокумент = Объект.ВозвратДокумент.Сумма;

	Иначе	
		Элементы.ЭтоПлатежКонтрагенту.ТолькоПросмотр = Истина;
		Элементы.ЭтоПлатежКонтрагенту.Видимость = ЭтоАдминистратор;
		
		Элементы.Приход.ТолькоПросмотр = Истина;
		
		Элементы.ЭтоЭквайринг.ТолькоПросмотр = Истина;
		Элементы.ЭтоЭквайринг.Видимость = Истина;
		
		Элементы.ЭтоКоворкинг.ТолькоПросмотр = Истина;
		Элементы.ЭтоКоворкинг.Видимость = Истина;
		
		Элементы.Возврат.ТолькоПросмотр = НЕ ЭтоАдминистратор;
		Элементы.Возврат.Видимость = ЭтоАдминистратор;
		
		Элементы.ВозвратДокумент.ТолькоПросмотр = НЕ ЭтоАдминистратор;
		Элементы.ВозвратДокумент.Видимость = ЭтоАдминистратор;
		
		Элементы.СуммаОстатокВозврат.Видимость = ЭтоАдминистратор;
		Элементы.СуммаВозвратДокумент.Видимость = ЭтоАдминистратор;
		
		Элементы.СуммаВозврат.Видимость = Истина;
		Элементы.СуммаОстаток.Видимость = Истина;

		Элементы.ФормаСоздатьВозврат.Доступность = Истина;
		Элементы.ФормаСоздатьВозврат.Видимость = Истина;
		
		Элементы.Возвраты.ТолькоПросмотр = НЕ ЭтоАдминистратор;	
		Элементы.Возвраты.Видимость = Истина;			
		
		Элементы.ДолгиОплата.ТолькоПросмотр = НЕ ЭтоАдминистратор;	
		Элементы.ДолгиОплата.Видимость = Истина;	
	КонецЕсли;
Иначе	
	Элементы.ЭтоПлатежКонтрагенту.ТолькоПросмотр = Истина;
	Элементы.ЭтоПлатежКонтрагенту.Видимость = ЭтоАдминистратор;
	
	Элементы.Приход.ТолькоПросмотр = Истина;
		
	Элементы.ЭтоЭквайринг.ТолькоПросмотр = Ложь;
	Элементы.ЭтоЭквайринг.Видимость = Истина;
	
	Элементы.ЭтоКоворкинг.ТолькоПросмотр = Ложь;
	Элементы.ЭтоКоворкинг.Видимость = Истина;
	
	Элементы.Возврат.ТолькоПросмотр = НЕ ЭтоАдминистратор;
	Элементы.Возврат.Видимость = ЭтоАдминистратор;
	
	Элементы.ВозвратДокумент.ТолькоПросмотр = НЕ ЭтоАдминистратор;
	Элементы.ВозвратДокумент.Видимость = ЭтоАдминистратор;
	
	Элементы.СуммаОстатокВозврат.Видимость = ЭтоАдминистратор;
	Элементы.СуммаВозвратДокумент.Видимость = ЭтоАдминистратор;
	
	Элементы.СуммаВозврат.Видимость = Истина;
	Элементы.СуммаОстаток.Видимость = Истина;
	
	Элементы.ФормаСоздатьВозврат.Доступность = Истина;
	Элементы.ФормаСоздатьВозврат.Видимость = Истина;
		
	Элементы.Возвраты.ТолькоПросмотр = НЕ ЭтоАдминистратор;	
	Элементы.Возвраты.Видимость = Истина;		
	
	Элементы.ДолгиОплата.ТолькоПросмотр = ЭтоАдминистратор;	
	Элементы.ДолгиОплата.Видимость = Истина;	
КонецЕсли;

ОтКогоНаименование = КлиентыСервер.КлиентПредставление(Объект.ОтКого);
Элементы.ОтКого.Видимость = КлиентыСервер.ЭтоЮрЛицо(Объект.ОтКого);
КонецПроцедуры

//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если ОбщееСервер.ПроверитьДату(Объект.Дата) тогда
	//Для каждого ЭФ Из Элементы Цикл
	//	Если ЭФ.Имя="ПолеHTMLДокумента1" или ЭФ.Имя="Панель1" тогда
	//		Продолжить;
	//	конецесли;
	//	
	//	ЭФ.Доступность=Ложь;			
	//КонецЦикла; 
	
	ОбщийФункционалКлиент.ЗащититьФорму(ЭтаФорма);
	
	ПоказатьПредупреждение( ,"Документ закрыт для редактирования!");
Иначе
	//Если Не ЭтоНовый() Тогда
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПересчетДолга();
	КонецЕсли;
КонецЕсли;

Элементы.ФормаЗакрытьОткрыть.Заголовок = ?(Объект.Закрыт, "Открыть", "Закрыть");
КонецПроцедуры

&НаСервере
Процедура ПересчетДолга()
Возврат;	
	
Если НЕ ЗначениеЗаполнено(Объект.ДокументДолг) Тогда 
	Элементы.НадписьДолг.Заголовок = "";
	Элементы.НадписьДолг.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;		
	Возврат; 
КонецЕсли;
	
ЗапросДолга=Новый запрос("ВЫБРАТЬ
                         |	ЕстьNULL(ДолгиОстатки.СуммаОстаток,0) КАК СуммаОстаток
                         |ИЗ
                         |	РегистрНакопления.Долги.Остатки(
                         |		,
                         |			ДокументДолг = &Док
						 //|				И Контрагент = &Клиент
						 |) КАК ДолгиОстатки");	
ЗапросДолга.УстановитьПараметр("Док",Объект.ДокументДолг.Ссылка);
ЗапросДолга.УстановитьПараметр("Клиент", Объект.ОтКого);
ТЗДолг=ЗапросДолга.Выполнить().Выгрузить();
Если ТЗДолг.Количество()=0 тогда
	Долг=0;
иначе
	Долг=ТЗДолг[0].СуммаОстаток;
конецесли;

//Элементы.НадписьДолг.Заголовок=?(Долг <> 0,"Долг по брони "+Формат(Долг, "ЧГ="),"Долг отсутствует!");
Если Долг > 0 тогда
	Текст = "Долг по брони "+Формат(Долг, "ЧГ=");
ИначеЕсли Долг < 0 тогда
	Текст = "Переплата по брони "+Формат(-Долг, "ЧГ=");
Иначе
	Текст = "Долг отсутствует.";
КонецЕсли;	

Элементы.НадписьДолг.Заголовок = Текст;
Если Долг < 0 тогда
	Элементы.НадписьДолг.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
Иначе
	Элементы.НадписьДолг.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
КонецЕсли;
КонецПроцедуры
//

//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
ОбновитьДанные(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
ОбновитьДанные(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные(ТекущийОбъект)
Если Объект.Возврат Тогда	
	Ответ = СуммыВозвраты();

	СуммаВозвратДокумент = Ответ.Сумма;
	СуммаВозвратДокументВозвраты = Ответ.СуммаВозвраты;
	СуммаВозвратОстаток = Ответ.СуммаОстаток;
Иначе	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыпискаБанка.Ссылка КАК ДокументВозврата,
	                      |	ВыпискаБанка.Дата КАК ДатаВозврата,
	                      |	ВыпискаБанка.Сумма КАК СуммаВозврата
	                      |ИЗ
	                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
	                      |ГДЕ
	                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
	                      |	И ВыпискаБанка.ВозвратДокумент = &ВозвратДокумент
	                      |	И ВыпискаБанка.Возврат = &Возврат");

	Запрос.УстановитьПараметр("ВозвратДокумент", Объект.Ссылка);
	Запрос.УстановитьПараметр("Возврат", Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возвраты.Очистить();
	Для Каждого Строка Из ТЗ Цикл
		НовыйВозврат = Возвраты.Добавить();	
		ЗаполнитьЗначенияСвойств(НовыйВозврат, Строка); 
	КонецЦикла;

	СуммаВозврат = Возвраты.Итог("СуммаВозврата");
	СуммаОстаток = Объект.Сумма - СуммаВозврат - Объект.ДолгиОплата.Итог("Сумма");
КонецЕсли;

СуммаДоЗаписи = Объект.Сумма;
КонецПроцедуры

&НаСервере
Функция СуммыВозвраты()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Сумма КАК Сумма,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвраты,
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ВыпискаБанкаДолгиОплата.Сумма, 0) КАК СуммаОстаток
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ВыпискаБанкаДолгиОплата
                      |		ПО ВыпискаБанка.Ссылка = ВыпискаБанкаДолгиОплата.Ссылка
                      |ГДЕ
                      |	ВыпискаБанка.Ссылка = &ВозвратДокумент");

Запрос.УстановитьПараметр("ВозвратДокумент", Объект.ВозвратДокумент); 
Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
					  
Выписка = Запрос.Выполнить().Выбрать();
Выписка.Следующий();

Ответ = Новый Структура("Сумма, СуммаВозвраты, СуммаОстаток", Выписка.Сумма, Выписка.СуммаВозвраты, Выписка.СуммаОстаток);
Возврат Ответ;
КонецФункции

&НаСервере
Процедура ОбновитьДанные_1(ТекущийОбъект)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК ДокументВозврата,
                      |	ВыпискаБанка.Сумма КАК СуммаВозврата
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.ВозвратДокумент = &ВозвратДокумент
                      |	И ВыпискаБанка.Возврат = &Возврат");

Запрос.УстановитьПараметр("ВозвратДокумент", Объект.Ссылка);
Запрос.УстановитьПараметр("Возврат", Истина);
ТЗ = Запрос.Выполнить().Выгрузить();

Возвраты.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НовыйВозврат = Возвраты.Добавить();	
	ЗаполнитьЗначенияСвойств(НовыйВозврат, Строка); 
КонецЦикла;

СуммаВозврат = Возвраты.Итог("СуммаВозврата");
СуммаОстаток = Объект.Сумма - СуммаВозврат - Объект.ДолгиОплата.Итог("Сумма");

ОбновитьКолонки();

СуммаВозвратОстаток = СуммаОстаткаВозврат();

СуммаВозвратДокумент = Объект.ВозвратДокумент.Сумма;

СуммаДоЗаписи = Объект.Сумма;
КонецПроцедуры

&НаСервере
Процедура ОбновитьКолонки()
Для Каждого Строка Из Объект.ДолгиОплата Цикл
	Если ТипЗнч(Строка.ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
		                      |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета
		                      |ИЗ
		                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
		                      |ГДЕ
		                      |	ЗаявкаНаБронированиеСчета.Ссылка = &Ссылка
		                      |	И ЗаявкаНаБронированиеСчета.СчетГУИД = &СчетГУИД");
							  
		Запрос.УстановитьПараметр("Ссылка", Строка.ДокументДолг);
		Запрос.УстановитьПараметр("СчетГУИД", Строка.СчетГУИД);
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			Строка.НомерСчета = ТЗ[0].НомерСчета;
		Иначе
			Строка.НомерСчета = "";
		КонецЕсли;
	Иначе	
		Строка.НомерСчета = "";
	КонецЕсли;
КонецЦикла;
КонецПроцедуры
	
&НаСервере
Функция СуммаОстаткаВозврат()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ВыпискаБанкаДолгиОплата.Сумма, 0) КАК СуммаОстатка
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
					  |			И ВыпискаБанка.Ссылка <> &Ссылка
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ВыпискаБанкаДолгиОплата
                      |		ПО ВыпискаБанка.Ссылка = ВыпискаБанкаДолгиОплата.Ссылка
                      |ГДЕ
                      |	ВыпискаБанка.Ссылка = &ВозвратДокумент");

					  //|			И ВыпискаБанка.Ссылка <> &Ссылка

Запрос.УстановитьПараметр("ВозвратДокумент", Объект.ВозвратДокумент); 
Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
					  
Выписка = Запрос.Выполнить().Выбрать();
Выписка.Следующий();

Возврат Выписка.СуммаОстатка;
КонецФункции
//

//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Ответ = ТекстОшибки();
Если ЗначениеЗаполнено(Ответ) Тогда
	ТекстПредупреждение = Ответ.ТекстПредупреждение;
	ТекстСообщение = Ответ.ТекстСообщение; 
	
	ТекстПредупреждение = "ОШИБОЧНЫЕ ДАННЫЕ" + Символы.ПС + ТекстПредупреждение;	
	ТекстПредупреждение = ТекстПредупреждение + Символы.ПС + "Документ НЕ сохранен";	
	ПоказатьПредупреждение(, ТекстПредупреждение); 
	
	ТекстСообщение = "ОШИБОЧНЫЕ ДАННЫЕ: " + ТекстСообщение;	
	ТекстСообщение = ТекстСообщение + ". Документ НЕ сохранен.";	
	Сообщить(ТекстСообщение);
	
	Отказ = Истина;
КонецЕсли;	


КонецПроцедуры

&НаСервере
Функция ТекстОшибки()
ДокументОбъект = РеквизитФормыВЗначение("Объект");
ТекстОшибки = ДокументОбъект.ТекстОшибки();

Если НЕ Объект.Возврат Тогда Перейти ~ВЫХОД; КонецЕсли;

Запрос = Новый Запрос ("ВЫБРАТЬ
                       |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                       |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0)  - ЕСТЬNULL(Долги.Сумма, 0) КАК ОстатокОплаты  
                       |ИЗ
                       |	Документ.ВыпискаБанка КАК ВыпискаБанка
                       |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                       |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                       |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                       |		ИЗ
                       |			Документ.ВыпискаБанка КАК ВыпискаБанка
                       |		ГДЕ
                       |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                       |		
                       |		СГРУППИРОВАТЬ ПО
                       |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                       |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                       |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                       |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                       |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                       |		ИЗ
                       |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                       |		
                       |		СГРУППИРОВАТЬ ПО
                       |			ВыпискаБанкаДолгиОплата.Ссылка) КАК Долги
                       |		ПО ВыпискаБанка.Ссылка = Долги.Ссылка
                       |ГДЕ
                       |	ИСТИНА
                       |	И ВыпискаБанка.Ссылка = &ВозвратДокумент");

Запрос.УстановитьПараметр("ВозвратДокумент", Объект.ВозвратДокумент);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	ОстатокОплаты = Выборка.ОстатокОплаты;
Иначе
	Перейти ~ВЫХОД;
КонецЕсли;

Если ОстатокОплаты < Объект.Сумма Тогда
	ТекстОшибки_П = "Остаток оплаты < Сумма возврата";
	
	Если ТекстОшибки = Неопределено Тогда 
		ТекстОшибки = Новый Структура("ТекстПредупреждение, ТекстСообщение", ТекстОшибки_П, ТекстОшибки_П);
	Иначе
		ТекстПредупреждение = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки.ТекстПредупреждение, ТекстОшибки_П, Символы.ПС); 
		ТекстСообщение = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки.ТекстСообщение, ТекстОшибки_П, " "); 
		
		ТекстОшибки.ТекстПредупреждение = ТекстПредупреждение;
		ТекстОшибки.ТекстСообщение = ТекстСообщение;
	КонецЕсли;
КонецЕсли;

 ~ВЫХОД:
Возврат ТекстОшибки;	
КонецФункции	

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
ОбновитьДокументДолги(ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументДолги(ТекущийОбъект, ПараметрыЗаписи)
Если НЕ Объект.Возврат Тогда Возврат; КонецЕсли;

Возврат;

Если ТекущийОбъект.Сумма = СуммаДоЗаписи Тогда Возврат; КонецЕсли;

ОстатокСуммаВозврата = ТекущийОбъект.Сумма - СуммаДоЗаписи; 

Запрос = Новый Запрос ("ВЫБРАТЬ
                       |	ВыпискаБанкаДолгиОплата.Ссылка КАК ДокументОплаты,
                       |	ВыпискаБанкаДолгиОплата.ДокументДолг КАК ДокументДолг
                       |ИЗ
                       |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                       |ГДЕ
                       |	ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                       |	И ВыпискаБанкаДолгиОплата.Ссылка = &ВозвратДокумент");

Запрос.УстановитьПараметр("ВозвратДокумент", ТекущийОбъект.ВозвратДокумент);

ТЗ = Запрос.Выполнить().Выгрузить();
ТЗ.Свернуть("ДокументОплаты, ДокументДолг");

Для Каждого Строка Из ТЗ Цикл
	
	Если ТипЗнч(Строка.ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
		ОстатокСуммаВозврата =	ЗаявкаСервер.УменьшитьОплатыЗаявкаСуммаВозврата(ТекущийОбъект.ВозвратДокумент
			, Строка.ДокументДолг, ОстатокСуммаВозврата, ТекущийОбъект.Ссылка);
		Если ОстатокСуммаВозврата = 0 Тогда Прервать; КонецЕсли;	
	ИначеЕсли ТипЗнч(Строка.ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
		ГрупповойСчетСервер.УменьшитьОплатыГрупповойСчетСуммаВозврата(ТекущийОбъект.ВозвратДокумент, Строка.ДокументДолг);
	ИначеЕсли ТипЗнч(Строка.ДокументДолг) = Тип("ДокументСсылка.КоворкингСчета") Тогда
		КоворкингСервер.УменьшитьОплатыКоворкингСчетаСуммаВозврата(ТекущийОбъект.ВозвратДокумент
			, Строка.ДокументДолг, ОстатокСуммаВозврата);         
	КонецЕсли;	
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
ПересчетДолга();
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтКогоПриИзменении(Элемент)
ОтКого_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "ОтКого"); 
Если ЕстьДолгиОплатаПредупреждение() Тогда 
	Объект.ОтКого = ОтКого_OldValue;
	
	Возврат; 
КонецЕсли;

Если Объект.ОтКого <> ОтКого_OldValue Тогда 
	Объект.ДокументДолг = Неопределено;
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ЕстьДолгиОплатаПредупреждение()
Если Объект.ДолгиОплата.Количество() > 0 Тогда
	ТекстПредупреждения = "Есть документы долги, связанные с оплатой
						|
						|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...";
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
	Возврат Истина;
КонецЕсли;	

Возврат Ложь;
КонецФункции
//

&НаКлиенте
Процедура ДокументДолгПриИзменении(Элемент)
	//ПересчетДолга();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
Если Объект.Возврат Тогда
	//Если Объект.Сумма > СуммаВозвратОстаток Тогда
	Если Объект.Сумма > СуммаВозвратДокумент - СуммаВозвратДокументВозвраты Тогда
		ПоказатьПредупреждение(, "Сумма возврата > Сумма возврат документ - Сумма возврат документ возвраты");
		
		Сумма_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "Сумма"); 
		Объект.Сумма = Сумма_OldValue;
		
		Возврат; 
КонецЕсли;

КонецЕсли;
	
Если ЕстьДолгиОплатаПредупреждение() Тогда 
	Сумма_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "Сумма"); 
	Объект.Сумма = Сумма_OldValue;
	
	Возврат; 
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратПриИзменении(Элемент)
Если Объект.Возврат Тогда
	Объект.Приход = Ложь;
КонецЕсли;	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВозвратыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Возвраты.НайтиПоИдентификатору(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура;
ТолькоПросмотр = НЕ ЭтоАдминистратор;
ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
ПараметрыФормы.Вставить("Ключ", ТД.ДокументВозврата);

ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаДокумента", ПараметрыФормы ,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//

&НаКлиенте
Процедура ЗакрытьОткрыть(Команда)
ЗакрытьОткрытьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьОткрытьНаСервере()
Объект.Закрыт = НЕ Объект.Закрыт; 

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
Элементы.ФормаЗакрытьОткрыть.Заголовок = ?(Объект.Закрыт, "Открыть", "Закрыть");
КонецПроцедуры

//
&НаКлиенте
Процедура СоздатьВозврат(Команда)
ПараметрыФормы = Новый Структура();

ПараметрыФормы.Вставить("ЭтоВозврат", Истина);
ПараметрыФормы.Вставить("ОтКого", Объект.ОтКого);
ПараметрыФормы.Вставить("ВозвратДокумент", Объект.Ссылка);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ФормаВозврат", ЭтаФорма);
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаДокумента", ПараметрыФормы
	, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_ФормаВозврат(Результат, ДополнительныеПараметры) Экспорт
ЭтаФорма.Прочитать();	
КонецПроцедуры

//
&НаКлиенте
Процедура ВозвратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыПередНачаломИзменения(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыПередУдалением(Элемент, Отказ)
Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_ПодтвердитеУдалениеВозврата", ЭтаФорма);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ВОЗВРАТА ...", РежимДиалогаВопрос.ОКОтмена); 

Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_ПодтвердитеУдалениеВозврата(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
	
УдалитьДокументВозврат();	
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументВозврат()
ТС = Элементы.Возвраты.ТекущаяСтрока;
ТД = Возвраты.НайтиПоИдентификатору(ТС);

ДокументВозврат = ТД.ДокументВозврата;
ДокументВозвратОбъект = ДокументВозврат.ПолучитьОбъект();

ДокументВозвратОбъект.Удалить();

ЭтаФорма.Прочитать();
КонецПроцедуры
//

&НаКлиенте
Процедура ДолгиОплатаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если Поле.Имя = "ДолгиОплатаСумма" 
//ИЛИ Поле.Имя = "ДолгиОплатаДокументДолг" 
Тогда Возврат; Конецесли;	

ТД = Объект.ДолгиОплата.НайтиПоИдентификатору(ВыбраннаяСтрока);
ДокументДолг = ТД.ДокументДолг; 

ТолькоПросмотр = НЕ ЭтоАдминистратор;
ОплатыОбщееКлиент.ОткрытьДокументДолг(ЭтаФорма, ДокументДолг, ТолькоПросмотр, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры

//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
Если ЗакрытьФорму Тогда Возврат; КонецЕсли;	
	
ЗакрытьФорму = Истина;	
Отказ = Истина;

Закрыть(Объект.Ссылка);
КонецПроцедуры

//
&НаКлиенте
Процедура ОтКогоНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ОтКогоНаименованиеНачалоВыбора", ЭтаФорма);

ОткрытьФорму("Справочник.Клиенты.Форма.ФормаВыбора", , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_ОтКогоНаименованиеНачалоВыбора(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
Если ЕстьДолгиОплатаПредупреждение() Тогда 
	Возврат; 
КонецЕсли;

Объект.ОтКого = Результат;
ОтКогоНаименование = КлиентыСервер.КлиентПредставление(Результат);

ОтКого_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "ОтКого"); 
Если Объект.ОтКого <> ОтКого_OldValue Тогда 
	Объект.ДокументДолг = Неопределено;
КонецЕсли;

Элементы.ОтКого.Видимость = КлиентыСервер.ЭтоЮрЛицо(Объект.ОтКого);
КонецПроцедуры

&НаКлиенте
Процедура ОтКогоНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ПараметрыФормы = Новый Структура("Ключ", Объект.ОтКого);

ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//

// ++++++++++++++++++++++





// - Кнопка1






