Перем ПроверкаОбмена;

Процедура ПередЗаписью(Отказ)
ПроверкаОбмена = Ложь;

Если ЭтотОбъект.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;	

Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда Возврат; КонецЕсли;

Если НЕ ЗначениеЗаполнено(ГорничнаяГУИДСтрока) Тогда
	ГорничнаяГУИДСтрока = Строка(Ссылка.УникальныйИдентификатор());
	
	ПроверкаОбмена = Истина;
Иначе	
	ПроверкаОбмена = ПроверкаОбмена();
КонецЕсли;			
КонецПроцедуры

Функция ПроверкаОбмена()
Если НЕ ЭтотОбъект.УчетУборок Тогда Возврат Ложь; КонецЕсли;	

ПроверкаОбмена = ((ЭтотОбъект.Наименование <> ЭтотОбъект.Ссылка.Наименование) 
	ИЛИ (ЭтотОбъект.Сортировка <> ЭтотОбъект.Ссылка.Сортировка)
	ИЛИ (ЭтотОбъект.НеРаботает <> ЭтотОбъект.Ссылка.НеРаботает)
	ИЛИ (ЭтотОбъект.ПометкаУдаления <> ЭтотОбъект.Ссылка.ПометкаУдаления)
	ИЛИ (ЭтотОбъект.УчетУборок <> ЭтотОбъект.Ссылка.УчетУборок)
	);
	
Возврат ПроверкаОбмена;
КонецФункции

Процедура ПриЗаписи(Отказ)
Если ЭтотОбъект.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;	

Если ПроверкаОбмена Тогда
	Если ОбменГорничныеСервер.ОбновитьГорничнаяГорничные(ЭтотОбъект) Тогда           
		Сообщить("Горничная: " + ЭтотОбъект.Код + " " + ЭтотОбъект.Наименование + " НЕ выгружена."); 
	КонецЕсли;
КонецЕсли;		
КонецПроцедуры

