
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.ЕстьНДС.ТолькоПросмотр = Истина;	
	
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Истина);

ПрограммныйКодДоступность = НастройкиСервер.ЭтоАдминистратор();
Элементы.ПрограммныйКод.Доступность = ПрограммныйКодДоступность;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураМинибараПриИзменении(Элемент)
Если ЗначениеЗаполнено(Объект.НоменклатураМинибара) Тогда	
	НоменклатураМинибараНаименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.НоменклатураМинибара, "Наименование");
	НоменклатураМинибараЦена = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.НоменклатураМинибара, "Цена");
	Объект.Наименование = НоменклатураМинибараНаименование;
	Объект.Цена = НоменклатураМинибараЦена; 
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммныйКодПриИзменении(Элемент)
ПрограммныйКодПриИзмененииНаСервере();
КонецПроцедуры

Процедура ПрограммныйКодПриИзмененииНаСервере()
Если Объект.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ 
ИЛИ Объект.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ШТРАФ 
Тогда
	Объект.ЕстьНДС = Ложь;
Иначе
	Объект.ЕстьНДС = Истина;
КонецЕсли;	
КонецПроцедуры
