//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр() Тогда
	ЭтаФорма.ТолькоПросмотр = Истина;
	
	Элементы.ВыгрузкаПлатежи.ТолькоПросмотр = Истина;
	
	Элементы.ЭквайрингВыгрузкаПлатежи.ТолькоПросмотр = Истина;
	Элементы.ЭквайрингВыпискаСчета.ТолькоПросмотр = Истина;
	Элементы.ЭквайрингВыпискаСвязиОплатыСчета.ТолькоПросмотр = Истина;
	
	Элементы.ВыпискаОплаты.ТолькоПросмотр = Истина;
	Элементы.ВыпискаСчета.ТолькоПросмотр = Истина;
	Элементы.ВыпискаСвязиОплатыСчета.ТолькоПросмотр = Истина;
КонецЕсли;	

//
ВыгрузкаПлатежиТолькоНеотмененные = Истина;
ВыгрузкаПлатежиТолькоС2022 = Истина;

ВыгрузкаПлатежиПолучательПлатежаВсе = Истина;
ВыгрузкаПлатежиТолькоНовые = Истина;
//

//
ВыпискаОплатыТолькоНезакрытые = Истина;
ВыпискаОплатыВсе = Ложь;
ВыпискаСчетаВсе = Ложь;
//

//
ЭквайрингВыгрузкаПлатежиТолькоНеотмененные = Истина;
ЭквайрингВыгрузкаПлатежиТолькоС2022 = Истина;

ЭквайрингВыгрузкаПлатежиПолучательПлатежаВсе = Истина;
ЭквайрингВыгрузкаПлатежиТолькоНезакрытые = Истина;
ЭквайрингВыпискаСчетаВсе = Ложь;
//

ПолучательПлатежа_Смешанный = "СМЕШАННЫЙ";
ЗагрузитьБезналНастройки();

ПолучательПлатежаБезнал = Константы.ПолучательПлатежаБезнал.Получить();
//КаталогОбменаFTP = Константы.КаталогОбменаFTP.Получить(); 

Если БезналНастройки.Количество() = 0 
ИЛИ ПолучательПлатежаБезнал = "" 
//ИЛИ КаталогОбменаFTP = "" 
Тогда
	Сообщить("ДЛЯ РАСПРЕДЕЛЕНИЯ БЕЗНАЛА НЕОБХОДИМО ВЫПОЛНИТЬ НАСТРОЙКУ БЕЗНАЛА ... ");
	
	Отказ = Истина;
	Возврат;	
КонецЕсли;

ОтборСтроки = Новый Структура("ПолучательПлатежаЗначениеСпискаВыбора", ПолучательПлатежаБезнал);
НайденныеСтроки = БезналНастройкиРаспределениеПлатежей.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() = 0 Тогда
	Сообщить("НЕКОРЕКТНОЕ ЗНАЧЕНИЕ КОНСТАНТЫ 'Получатель платежа безнал': " + ПолучательПлатежаБезнал);

	Отказ = Истина;
	Возврат;	
КонецЕсли;

ЭлементТаблица = Элементы.ВыгрузкаПлатежи; ИмяПеред = ЭлементТаблица.Имя + "ДокументОплаты";
ДобавитьСуммыПолучателейПлатежа("ВыгрузкаПлатежи", ЭлементТаблица, ИмяПеред);

ЭлементТаблица = Элементы.ЭквайрингВыгрузкаПлатежи; ИмяПеред = ЭлементТаблица.Имя + "ГУИД";
ДобавитьСуммыПолучателейПлатежа("ЭквайрингВыгрузкаПлатежи", ЭлементТаблица, ИмяПеред);

Для Каждого Строка Из БезналНастройкиСписокВыбора Цикл
	Элемент = Строка.ПолучательПлатежаЗначениеСпискаВыбора;
	
	Элементы.ВыгрузкаПлатежиПолучательПлатежа.СписокВыбора.Добавить(Элемент);
	Элементы.ВыгрузкаПлатежиПолучательПлатежаОтбор.СписокВыбора.Добавить(Элемент);
	
	Элементы.ЭквайрингВыгрузкаПлатежиПолучательПлатежа.СписокВыбора.Добавить(Элемент);
	Элементы.ЭквайрингВыгрузкаПлатежиПолучательПлатежаОтбор.СписокВыбора.Добавить(Элемент);
КонецЦикла;

ОтчетДатаПо = ТекущаяДата();

ВыпискаКонтрагент_Предыдущий = Неопределено;	

ПолучательПлатежа_Константа = Константы.ПолучательПлатежаБезнал.Получить();	

УсловноеОформление.Элементы.Очистить();
УсловноеОформлениеЗагрузить_ЗащитаСуммыПолучателейПлатежа("ВыгрузкаПлатежи");  
УсловноеОформлениеЗагрузить_ЗащитаСуммыПолучателейПлатежа("ЭквайрингВыгрузкаПлатежи");

ВыгрузкаЗагрузитьПлатежиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьБезналНастройки()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	БезналНастройки.Идентификатор КАК Идентификатор,
                      |	БезналНастройки.ПолучательПлатежа КАК ПолучательПлатежа,
                      |	БезналНастройки.ИмяРеквизитаФормы КАК ИмяРеквизитаФормы,
                      |	БезналНастройки.ИмяРеквизитаДанные КАК ИмяРеквизитаДанные,
                      |	БезналНастройки.Заголовок КАК Заголовок,
                      |	БезналНастройки.ПолучательПлатежаЗначениеСпискаВыбора КАК ПолучательПлатежаЗначениеСпискаВыбора,
                      |	БезналНастройки.НомерПоПорядкуСписокВыбора КАК НомерПоПорядкуСписокВыбора
                      |ИЗ
                      |	РегистрСведений.БезналНастройки КАК БезналНастройки
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	БезналНастройки.НомерПоПорядкуСписокВыбора");

ТЗ = Запрос.Выполнить().Выгрузить();

Массив = Новый Массив;
Массив.Добавить(Тип("Число"));
ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,Новый КвалификаторыЧисла(10,2));

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = БезналНастройки.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	НоваяСтрока = БезналНастройкиСписокВыбора.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если Строка.ПолучательПлатежа = "" Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = БезналНастройкиРаспределениеПлатежей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);	
	
	НоваяСтрока.ТипЗначения = ОписаниеТиповЧ;
КонецЦикла;

НоваяСтрока = БезналНастройкиСписокВыбора.Добавить();
НоваяСтрока.ПолучательПлатежаЗначениеСпискаВыбора = ПолучательПлатежа_Смешанный;
КонецПроцедуры	

&НаСервере
Функция ДобавитьСуммыПолучателейПлатежа(ИмяТаблицы, ЭлементТаблица, ИмяПеред)
ДополнительныеКолонки = БезналНастройкиРаспределениеПлатежей;

Массив = Новый Массив;
Массив.Добавить(Тип("Булево"));
ОписаниеТиповБулево = Новый ОписаниеТипов(Массив);

ДобавляемыеРеквизиты = Новый Массив; 
Для Каждого Строка ИЗ ДополнительныеКолонки Цикл
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Строка.ИмяРеквизитаФормы, Строка.ТипЗначения, ИмяТаблицы));
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Строка.ИмяРеквизитаФормы + "_OldValue", Строка.ТипЗначения, ИмяТаблицы));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Строка.ИмяРеквизитаФормы + "_ТолькоПросмотр", ОписаниеТиповБулево, ИмяТаблицы));
КонецЦикла;

ИзменитьРеквизиты(ДобавляемыеРеквизиты);

Для Каждого Строка ИЗ ДополнительныеКолонки Цикл
	ЭлементПеред = Элементы[ИмяПеред];
	Реквизит = Элементы.Вставить(ЭлементТаблица.Имя + Строка.ИмяРеквизитаФормы, Тип("ПолеФормы"), ЭлементТаблица, ЭлементПеред);
	Реквизит.Вид = ВидПоляФормы.ПолеВвода;
	Реквизит.ПутьКДанным = ИмяТаблицы + "." + Строка.ИмяРеквизитаФормы;
	Реквизит.Заголовок = Строка.Заголовок;
КонецЦикла;
КонецФункции
//

//
&НаСервере      
Процедура УсловноеОформлениеЗагрузить_ЗащитаСуммыПолучателейПлатежа(ИмяТаблицы)
Для Каждого Строка Из БезналНастройкиРаспределениеПлатежей Цикл
	ЭлементыТабНаФормеИмя = ИмяТаблицы + Строка.ИмяРеквизитаФормы;
	ПутьКПолюОтбора = ИмяТаблицы + "." + Строка.ИмяРеквизитаФормы + "_ТолькоПросмотр";	
	
	ОформлениеУстановитьТолькоПросмотр(ЭлементыТабНаФормеИмя, ПутьКПолюОтбора);
КонецЦикла;
КонецПроцедуры

&НаСервере      
Процедура ОформлениеУстановитьТолькоПросмотр(ЭлементыТабНаФормеИмя, ПутьКПолюОтбора)
// + Равно
ЭлементОформления = УсловноеОформление.Элементы.Добавить();
ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыТабНаФормеИмя);

ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.Использование  = Истина;
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
ОтборЭлемента.ПравоеЗначение = Истина;

ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
// + Равно

// + НЕ Равно
ЭлементОформления = УсловноеОформление.Элементы.Добавить();
ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыТабНаФормеИмя);

ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.Использование  = Истина;
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
ОтборЭлемента.ПравоеЗначение = Истина;

ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
// + НЕ Равно
КонецПроцедуры
//

////
&НаСервере      
Процедура УсловноеОформлениеЗагрузить_Цвета_НеИспользуется(ИмяТаблицы)
ЭлементыТабНаФормеИмя = Элементы.ВыгрузкаПлатежи.Имя;
ПутьКПолюОтбора = ИмяТаблицы + "." + "ОтменаРедактирования";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;
ПравоеЗначение = Истина;
Web_Цвета = WebЦвета.БледноКрасноФиолетовый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	,ЭлементыТабНаФормеИмя ,ПутьКПолюОтбора ,Вид_Сравнения, ПравоеЗначение, Web_Цвета );
КонецПроцедуры

&НаСервере      
Процедура УсловноеОформлениеЗагрузить_Пример()
УсловноеОформление.Элементы.Очистить();

//
ЭлементыТабНаФормеИмя = Элементы.ВыгрузкаПлатежи.Имя;

ПутьКПолюОтбора = "Платежи.ОстатокОплаты";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;
ПравоеЗначение = 0;
Web_Цвета = WebЦвета.БледноКрасноФиолетовый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	,ЭлементыТабНаФормеИмя ,ПутьКПолюОтбора ,Вид_Сравнения, ПравоеЗначение, Web_Цвета );

ПутьКПолюОтбора = "Платежи.ОстатокОплаты";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.НеРавно;
ПравоеЗначение = 0;
Web_Цвета = WebЦвета.БледноЗеленый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	,ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета );
//

//
ЭлементыТабНаФормеИмя = Элементы.Счета.Имя;

ПутьКПолюОтбора = "Счета.ОстатокКЗакрытию";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;
ПравоеЗначение = 0;
Web_Цвета = WebЦвета.БледноКрасноФиолетовый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	,ЭлементыТабНаФормеИмя ,ПутьКПолюОтбора ,Вид_Сравнения, ПравоеЗначение, Web_Цвета );

ПутьКПолюОтбора = "Счета.ОстатокКЗакрытию";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.НеРавно;
ПравоеЗначение = 0;
Web_Цвета = WebЦвета.БледноЗеленый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	,ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета );
//

КонецПроцедуры
////

////// + Выгрузка

////
&НаКлиенте
Процедура ВыгрузкаОбменБухгалтерия(Команда)
ВыгрузкаОбменБухгалтерияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаОбменБухгалтерияНаСервере()
Результат = ОбменВыписка.ВыполнитьОбменДанными();

Если Результат.Свойство("Добавлено") Тогда
	ТекстСообщения = "РЕЗУЛЬТАТ ОБМЕНА: Добавлено - " + Результат.Добавлено 
		+ " Заменено - " + Результат.Заменено + " Удалено - " + Результат.Удалено; 
	Сообщить(ТекстСообщения);
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОбменГостиницы(Команда)
	ВыгрузкаОбменГостиницыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаОбменГостиницыНаСервере()
Результат = ОбменГостиницы.ВыполнитьОбменДанными();

Сообщить("Обмен завершен");
КонецПроцедуры////

//
&НаКлиенте
Процедура ВыгрузкаПлатежиТолькоНовыеПриИзменении(Элемент)
ВыгрузкаЗагрузитьПлатежи(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаПлатежиТолькоНеотмененныеПриИзменении(Элемент)
ВыгрузкаЗагрузитьПлатежи(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаПлатежиТолькоС2022ПриИзменении(Элемент)
ВыгрузкаЗагрузитьПлатежи(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузкаПлатежиПолучательПлатежаОтборПриИзменении(Элемент)
Если ЗначениеЗаполнено(ВыгрузкаПлатежиПолучательПлатежаОтбор) Тогда	
	ВыгрузкаПлатежиПолучательПлатежаВсе = Ложь;
КонецЕсли;
ВыгрузкаЗагрузитьПлатежи(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаПлатежиПолучательПлатежаВсеПриИзменении(Элемент)
ВыгрузкаПлатежиПолучательПлатежаОтбор = "";	
ВыгрузкаЗагрузитьПлатежи(Неопределено);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыгрузкаЗагрузитьПлатежи(Команда)
ВыгрузкаЗагрузитьПлатежиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаЗагрузитьПлатежиНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	БезналЗагрузка.ГУИД КАК ГУИД,
                      |	БезналЗагрузка.ГУИДИсточникаСтрока КАК ГУИДИсточникаСтрока,
                      |	БезналЗагрузка.ДатаЗагрузки КАК ДатаЗагрузки,
                      |	БезналЗагрузка.КонтрагентНаименование КАК КонтрагентНаименованиеЗагрузка,
                      |	БезналЗагрузка.КонтрагентИНН КАК КонтрагентИННЗагрузка,
                      |	БезналЗагрузка.КонтрагентКПП КАК КонтрагентКППЗагрузка,
                      |	БезналЗагрузка.ДатаОплаты КАК ДатаПлатежа,
                      |	БезналЗагрузка.Сумма КАК СуммаПлатежа,
                      |	БезналЗагрузка.ТекстПлатежа КАК ТекстПлатежа,
                      |	БезналЗагрузка.Отменено КАК Отменено,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументОплаты,
                      |	БезналЗагрузка.ПолучательПлатежа КАК ПолучательПлатежа,
                      |	БезналЗагрузка.СуммаЧехов КАК СуммаЧехов,
                      |	БезналЗагрузка.СуммаЛайв КАК СуммаЛайв,
                      |	БезналЗагрузка.СуммаДомСоветов КАК СуммаДомСоветов,
                      |	БезналЗагрузка.СуммаРеноме КАК СуммаРеноме,
                      |	БезналЗагрузка.СуммаСтритАрт КАК СуммаСтритАрт,
                      |	БезналЗагрузка.ДатаИзменения КАК ДатаИзменения
                      |ИЗ
                      |	РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ПО БезналЗагрузка.ГУИД = ВыпискаБанка.ГУИДЗагрузка
                      |ГДЕ
                      |	НЕ БезналЗагрузка.КонтрагентИНН В (&СписокИННЭквайринг)
                      |	И ВЫБОР
                      |			КОГДА &КонтрагентИНН = """"
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ БезналЗагрузка.КонтрагентИНН = &КонтрагентИНН
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаПлатежаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ БезналЗагрузка.ДатаОплаты >= &ДатаПлатежаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаПлатежаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ БезналЗагрузка.ДатаОплаты <= &ДатаПлатежаПо
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ПлатежиТолькоНеотмененные
                      |				ТОГДА БезналЗагрузка.Отменено = ЛОЖЬ
                      |			ИНАЧЕ ИСТИНА
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ПлатежиТолькоС2022
                      |				ТОГДА БезналЗагрузка.ДатаОплаты >= ДАТАВРЕМЯ(2022, 1, 1, 0, 0, 0)
                      |			ИНАЧЕ ИСТИНА
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ПолучательПлатежаВсе
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ БезналЗагрузка.ПолучательПлатежа = &ПолучательПлатежаОтбор
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ПлатежиТолькоНовые
                      |				ТОГДА ВыпискаБанка.ПометкаУдаления ЕСТЬ NULL
                      |			ИНАЧЕ ЕСТЬNULL(ВыпискаБанка.ПометкаУдаления, ЛОЖЬ) = ЛОЖЬ
                      |		КОНЕЦ");

					  //|	БезналЗагрузка.КонтрагентИНН <> &КонтрагентИННЭквайринг


Запрос.УстановитьПараметр("КонтрагентИНН", СокрЛП(ВыгрузкаПлатежиКонтрагентИННОтбор));
Запрос.УстановитьПараметр("ДатаПлатежаС", ВыгрузкаДатаПлатежаС);
Запрос.УстановитьПараметр("ДатаПлатежаПо", ВыгрузкаДатаПлатежаПо);

Запрос.УстановитьПараметр("ПлатежиТолькоНовые", ВыгрузкаПлатежиТолькоНовые);
Запрос.УстановитьПараметр("ПлатежиТолькоНеотмененные", ВыгрузкаПлатежиТолькоНеотмененные);
Запрос.УстановитьПараметр("ПлатежиТолькоС2022", ВыгрузкаПлатежиТолькоС2022);

Запрос.УстановитьПараметр("ПолучательПлатежаВсе", ВыгрузкаПлатежиПолучательПлатежаВсе);
Запрос.УстановитьПараметр("ПолучательПлатежаОтбор", ВыгрузкаПлатежиПолучательПлатежаОтбор);

СписокИННЭквайринг = БезналРаспределениеСервер.СписокИННЭквайринг();
Запрос.УстановитьПараметр("СписокИННЭквайринг", СписокИННЭквайринг);

ТЗ = Запрос.Выполнить().Выгрузить(); 
ВыгрузкаПлатежи.Очистить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ВыгрузкаПлатежи.Добавить();		
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	УстановитьСуммыПлатежейТолькоПросмотр(НоваяСтрока, Строка);
КонецЦикла;

ВыгрузкаПлатежи.Сортировать("ДатаЗагрузки, ДатаПлатежа, КонтрагентИННЗагрузка,  КонтрагентКППЗагрузка, СуммаПлатежа");

Если ВыгрузкаПлатежи.Количество() = 0 Тогда
	ВыгрузкаПлатежиГУИД_Текущий = Неопределено;	
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСуммыПлатежейТолькоПросмотр(НоваяСтрока, Строка)
Для Каждого СтрокаНастройки Из БезналНастройкиРаспределениеПлатежей Цикл
	ИмяРеквизита = СтрокаНастройки.ИмяРеквизитаФормы + "_ТолькоПросмотр";
	Если Строка.ПолучательПлатежа = ПолучательПлатежа_Смешанный Тогда
		НоваяСтрока[ИмяРеквизита] = Ложь;
	ИначеЕсли Строка.ПолучательПлатежа = ПолучательПлатежа_Константа Тогда
		НоваяСтрока[ИмяРеквизита] = Истина;
	Иначе
		Если Строка.ПолучательПлатежа = СтрокаНастройки.ПолучательПлатежаЗначениеСпискаВыбора Тогда
			НоваяСтрока[ИмяРеквизита] = Ложь;
		Иначе		
			НоваяСтрока[ИмяРеквизита] = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецЦикла;
	
КонецПроцедуры
//

&НаКлиенте
Процедура ВыгрузкаПлатежиПриАктивизацииСтроки(Элемент)
Если Элемент.ТекущиеДанные = Неопределено Тогда	
	ВыгрузкаПлатежиГУИД_Текущий = Неопределено;
Иначе
	ВыгрузкаПлатежиГУИД_Текущий = Элемент.ТекущиеДанные.ГУИД;
КонецЕсли;
КонецПроцедуры

//
&НаКлиенте
Процедура ВыгрузкаПлатежиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаПлатежиПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыгрузкаПлатежиПередНачаломИзменения(Элемент, Отказ)
ТД = Элемент.ТекущиеДанные;	
ЗапомнитьOldValueПередНачаломИзменения(ТД);		

ПолучательПлатежа_OldValue = ТД.ПолучательПлатежа;	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьOldValueПередНачаломИзменения(ТД)
Для Каждого Строка Из БезналНастройкиРаспределениеПлатежей Цикл
	ТД[Строка.ИмяРеквизитаФормы + "_OldValue"] = ТД[Строка.ИмяРеквизитаФормы]; 
КонецЦикла;		
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыгрузкаОтменитьВосстановитьПлатежи(Команда)
Для Каждого Строка Из Элементы.ВыгрузкаПлатежи.ВыделенныеСтроки Цикл
	ТС = Строка;	
	
	ТекстОшибки = ВыгрузкаУдалитьДокументОплатыНаСервере(ТС, "ОТМЕНЫ ПЛАТЕЖА");
	Если ТекстОшибки.Количество() > 0 Тогда 
		ТекстСообщения = "";
		Для Каждого Элемент Из ТекстОшибки Цикл 
		    ТекстСообщения = ТекстСообщения + Элемент; 
		КонецЦикла;
		
		Сообщить(ТекстСообщения);
		Продолжить; 
	КонецЕсли; 

	ВыгрузкаОтменитьВосстановитьПлатежНаСервере(ТС);	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОтменитьВосстановитьПлатеж(Команда)
ТС = Элементы.ВыгрузкаПлатежи.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;   

ТекстОшибки = ВыгрузкаУдалитьДокументОплатыНаСервере(ТС, "ОТМЕНЫ ПЛАТЕЖА");
Если ТекстОшибки.Количество() > 0 Тогда 
	ТекстПредупреждения = "";
	Для Каждого Элемент Из ТекстОшибки Цикл 
	    ТекстПредупреждения = ТекстПредупреждения + Элемент + Символы.ПС; 
	КонецЦикла;
	ТекстПредупреждения = Лев(ТекстПредупреждения, СтрДлина(ТекстПредупреждения) - 1);
	
	ПоказатьПредупреждение(, ТекстПредупреждения);
	Возврат; 
КонецЕсли; 

ВыгрузкаОтменитьВосстановитьПлатежНаСервере(ТС);
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаОтменитьВосстановитьПлатежНаСервере(ТС)
ТД = ВыгрузкаПлатежи.НайтиПоИдентификатору(ТС);

ОтменитьВосстановитьПлатеж(ТД);
КонецПроцедуры

&НаСервере
Процедура ОтменитьВосстановитьПлатеж(ТД)
Запись = РегистрыСведений.БезналЗагрузка.СоздатьМенеджерЗаписи();
Запись.ГУИД = ТД.ГУИД;
Запись.Прочитать();

Запись.Отменено = НЕ Запись.Отменено; 
Запись.Записать();

ТД.Отменено = Запись.Отменено;
КонецПроцедуры
//


//
&НаКлиенте
Процедура ВыгрузкаСоздатьДокументыОплаты(Команда)
Для Каждого ТС Из Элементы.ВыгрузкаПлатежи.ВыделенныеСтроки Цикл
	ВыгрузкаДокументОплатыСоздатьНаСервере(ТС);
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаДокументОплатыСоздать(Команда)
ТС = Элементы.ВыгрузкаПлатежи.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;	
	
ВыгрузкаДокументОплатыСоздатьНаСервере(ТС);
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаДокументОплатыСоздатьНаСервере(ТС)
Строка = ВыгрузкаПлатежи.НайтиПоИдентификатору(ТС);	

ВыгрузкаДокументОплатыСоздатьДокумент(Строка);
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаДокументОплатыСоздатьДокумент(Строка)
Если ЗначениеЗаполнено(Строка.ДокументОплаты) Тогда Возврат; КонецЕсли;

Если Строка.Отменено Тогда 
	//ТекстСообщения = "Платеж от " + Строка.ДатаПлатежа + " на сумму " + Строка.СуммаПлатежа  + " отменен. " 
	
	ТекстСообщения = ПлатежТекст(Строка);  
	ТекстСообщения = ТекстСообщения 
		+ Строка.КонтрагентНаименованиеЗагрузка 
		+ " с ИНН: " + Строка.КонтрагентИННЗагрузка 
		+ ". Документ оплаты НЕ создан.";
		
	Сообщить(ТекстСообщения);
	
	Возврат; 
КонецЕсли;

Если Строка.ПолучательПлатежа = "" Тогда 
	//ТекстСообщения = "Платеж от " + Строка.ДатаПлатежа + " на сумму " + Строка.СуммаПлатежа + ". "
		
	ТекстСообщения = ПлатежТекст(Строка);  
	ТекстСообщения = ТекстСообщения 
		+ "Не заполнен ПолучательПлатежа." + Строка.КонтрагентНаименованиеЗагрузка 
		+ " с ИНН: " + Строка.КонтрагентИННЗагрузка 
		+ ". Документ оплаты НЕ создан.";
		
	Сообщить(ТекстСообщения);
	
	Возврат; 
КонецЕсли;

ПолучательПлатежаБезналКонстанта = Константы.ПолучательПлатежаБезнал.Получить();	
Если НЕ (Строка.ПолучательПлатежа = ПолучательПлатежаБезналКонстанта  
ИЛИ	 Строка.ПолучательПлатежа = ПолучательПлатежа_Смешанный) Тогда
	//ТекстСообщения = "Платеж от " + Строка.ДатаПлатежа + " на сумму " + Строка.СуммаПлатежа + ". "
	
	ТекстСообщения = ПлатежТекст(Строка);  
	ТекстСообщения = ТекстСообщения 
		+ "ПолучательПлатежа." + Строка.КонтрагентНаименованиеЗагрузка 
		+ " с ИНН: " + Строка.КонтрагентИННЗагрузка + " не равен " + ПолучательПлатежаБезналКонстанта
		+ ". Документ оплаты НЕ создан.";
		
	Сообщить(ТекстСообщения);
	
	Возврат; 
КонецЕсли;
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты
                      |ГДЕ
                      |	Клиенты.ПометкаУдаления = ЛОЖЬ
                      |	И Клиенты.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |	И Клиенты.ИНН = &ИНН
                      |	И Клиенты.ИНН <> """"");

Запрос.УстановитьПараметр("ИНН", Строка.КонтрагентИННЗагрузка); 
ТЗ = Запрос.Выполнить().Выгрузить();

КоличествоКонтрагентов = ТЗ.Количество();

Если КоличествоКонтрагентов = 0 Тогда 
	//ТекстСообщения = "Платеж от " + Строка.ДатаПлатежа + " на сумму " + Строка.СуммаПлатежа + ". "
	
	ТекстСообщения = ПлатежТекст(Строка);  
	ТекстСообщения = ТекстСообщения 
		+ "В базе отсутствует контрагент: " + Строка.КонтрагентНаименованиеЗагрузка 
		+ " с ИНН: " + Строка.КонтрагентИННЗагрузка 
		+ ". Документ оплаты НЕ создан.";
		
	Сообщить(ТекстСообщения);
	Возврат; 
КонецЕсли;

Если КоличествоКонтрагентов > 1 Тогда 
	//ТекстСообщения = "Платеж от " + Строка.ДатаПлатежа + " на сумму " + Строка.СуммаПлатежа + ". "
	
	ТекстСообщения = ПлатежТекст(Строка);  
	ТекстСообщения = ТекстСообщения 
		+ "В базе есть несколько контрагентов (" + КоличествоКонтрагентов + ") с ИНН: " + Строка.КонтрагентИННЗагрузка 
		+ ". Наименование (загрузка): " + Строка.КонтрагентНаименованиеЗагрузка
		+ ". Документ оплаты НЕ создан.";
		
	Сообщить(ТекстСообщения);
	Возврат; 
КонецЕсли;

ВыпискаОбъект = Документы.ВыпискаБанка.СоздатьДокумент();		
ВыпискаОбъект.Дата = ТекущаяДата();

ВыпискаОбъект.ГУИДИсточникЗагрузка = Строка.ГУИДИсточникаСтрока;	
ВыпискаОбъект.ГУИДЗагрузка = Строка.ГУИД;	

ВыпискаОбъект.ДатаОплаты = Строка.ДатаПлатежа;

ВыпискаОбъект.ОтКого = ТЗ[0].Ссылка;

ВыпискаОбъект.Приход = Истина;
ВыпискаОбъект.ЭтоЭквайринг = Ложь;

Если Строка.ПолучательПлатежа = ПолучательПлатежа_Смешанный Тогда 
	ОтборСтроки = Новый Структура("ПолучательПлатежаЗначениеСпискаВыбора", ПолучательПлатежаБезналКонстанта);
	НайденныеСтроки = БезналНастройкиРаспределениеПлатежей.НайтиСтроки(ОтборСтроки);
	ИмяРеквизита = НайденныеСтроки[0].ИмяРеквизитаФормы;
	СуммаПлатежа = Строка[ИмяРеквизита];
Иначе
	СуммаПлатежа = Строка.СуммаПлатежа;
КонецЕсли;

ВыпискаОбъект.Сумма = СуммаПлатежа;

ВыпискаОбъект.ТекстПлатежа = Строка.ТекстПлатежа;

ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);

Строка.ДокументОплаты = ВыпискаОбъект.Ссылка;
Строка.СуммаДокументОплаты = ВыпискаОбъект.Сумма;
КонецПроцедуры
//

&НаКлиентеНаСервереБезКонтекста
Функция ПлатежТекст(Строка)
ПлатежТекст = "Платеж от " + Формат(Строка.ДатаПлатежа, "ДФ=dd.MM.yy") + " на сумму " + Строка.СуммаПлатежа + ". ";

Возврат ПлатежТекст;
КонецФункции

//
&НаКлиенте
Процедура ВыгрузкаУдалитьДокументОплаты(Команда)
ТС = Элементы.ВыгрузкаПлатежи.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ТекстОшибки = ВыгрузкаУдалитьДокументОплатыНаСервере(ТС, "УДАЛЕНИЯ ОПЛАТЫ");
Если ТекстОшибки.Количество() > 0 Тогда 
	ТекстПредупреждения = "";
	Для Каждого Элемент Из ТекстОшибки Цикл 
	    ТекстПредупреждения = ТекстПредупреждения + Элемент + Символы.ПС; 
	КонецЦикла;
	ТекстПредупреждения = Лев(ТекстПредупреждения, СтрДлина(ТекстПредупреждения) - 1);
	
	ПоказатьПредупреждение(, ТекстПредупреждения);
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыгрузкаУдалитьДокументОплатыНаСервере(ТС, ТекстСообщения)
ТД = ВыгрузкаПлатежи.НайтиПоИдентификатору(ТС);

ТекстОшибки = Новый Массив;

ДокументОплаты = ТД.ДокументОплаты;
Если НЕ ЗначениеЗаполнено(ДокументОплаты) Тогда Возврат ТекстОшибки; КонецЕсли;
	
ЕстьСвязиСДокументДолги = ЕстьСвязиДокументаОплатыСДокументДолги(ДокументОплаты);

Если ЕстьСвязиСДокументДолги  Тогда
	//ТекстОшибки.Добавить("Платеж от " + ТД.ДатаПлатежа + " на сумму " + ТД.СуммаПлатежа + ". ");
	
	Текст = ПлатежТекст(ТД);
	ТекстОшибки.Добавить(Текст);
	
	ТекстОшибки.Добавить("Есть документ оплаты, связанный с документом долга. ");
	ТекстОшибки.Добавить("");
	ТекстОшибки.Добавить("ДЛЯ " + ТекстСообщения + " УДАЛИТЕ СВЯЗЬ ДОКУМЕНТА ОПЛАТЫ С ДОКУМЕНТОМ ДОЛГА ...");	
	
	Возврат ТекстОшибки;
КонецЕсли;

ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
ДокументОплатыОбъект.Удалить();       

ТД.ДокументОплаты = Неопределено;
ТД.СуммаДокументОплаты = 0;

Возврат ТекстОшибки;
КонецФункции

&НаСервере
Функция ЕстьСвязиДокументаОплатыСДокументДолги(ДокументОплаты)
Запрос = Новый Запрос( "ВЫБРАТЬ ПЕРВЫЕ 1
                       |	ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК Ссылка
                       |ИЗ
                       |	Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                       |ГДЕ
                       |	ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты = &ДокументОплаты
                       |
                       |ОБЪЕДИНИТЬ
                       |
                       |ВЫБРАТЬ ПЕРВЫЕ 1
                       |	ГрупповыеСчетаДокументыОплаты.Ссылка
                       |ИЗ
                       |	Документ.ГрупповыеСчета.ДокументыОплаты КАК ГрупповыеСчетаДокументыОплаты
                       |ГДЕ
                       |	ГрупповыеСчетаДокументыОплаты.ДокументОплаты = &ДокументОплаты
                       |
                       |ОБЪЕДИНИТЬ
                       |
                       |ВЫБРАТЬ ПЕРВЫЕ 1
                       |	КоворкингСчетаДокументыОплаты.Ссылка
                       |ИЗ
                       |	Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                       |ГДЕ
                       |	КоворкингСчетаДокументыОплаты.ДокументОплаты = &ДокументОплаты");

Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
ТЗ = Запрос.Выполнить().Выгрузить();
Возврат (ТЗ.Количество() > 0);
КонецФункции
//


//
&НаКлиенте
Процедура ВыгрузкаПлатежиПолучательПлатежаПриИзменении(Элемент)
ТД = Элементы.ВыгрузкаПлатежи.ТекущиеДанные;
Если ЗначениеЗаполнено(ТД.ДокументОплаты) Тогда
	ТД.ПолучательПлатежа = ПолучательПлатежа_OldValue;
	
	ПоказатьПредупреждение(, "Есть документ оплаты (выписка) для этого платежа.
	|
	|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...
	|
	|Для изменения получателя платежа удалите документ оплаты (выписку)."
	);
	
	Элементы.ВыгрузкаПлатежи.ЗакончитьРедактированиеСтроки(Ложь);
	Возврат;
КонецЕсли;

ЗаполнитьСуммаПолучательПлатежа(ТД);

Элементы.ВыгрузкаПлатежи.ЗакончитьРедактированиеСтроки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммаПолучательПлатежа(ТД)
Для Каждого Строка Из БезналНастройкиРаспределениеПлатежей Цикл
	Если Строка.ПолучательПлатежаЗначениеСпискаВыбора = ТД.ПолучательПлатежа Тогда 
		ТД[Строка.ИмяРеквизитаФормы] = ТД.СуммаПлатежа;
	Иначе
		ТД[Строка.ИмяРеквизитаФормы] = 0;
	КонецЕсли;
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыгрузкаПлатежиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
Если ОтменаРедактирования Тогда Возврат; КонецЕсли;	
	
ТД = Элемент.ТекущиеДанные;

Отказ = ПроверкаСуммыПлатежейПередОкончаниемРедактирования(ТД)
КонецПроцедуры

&НаКлиенте
Функция ПроверкаСуммыПлатежейПередОкончаниемРедактирования(ТД)
ИтогоСуммаПолучателиПлатежа = 0;
Для Каждого Строка Из БезналНастройкиРаспределениеПлатежей Цикл
	ИтогоСуммаПолучателиПлатежа = ИтогоСуммаПолучателиПлатежа +	ТД[Строка.ИмяРеквизитаФормы];
КонецЦикла;	

Если ИтогоСуммаПолучателиПлатежа = 0 Тогда Возврат Ложь; КонецЕсли;

Если ИтогоСуммаПолучателиПлатежа <> ТД.СуммаПлатежа Тогда
	ПоказатьПредупреждение(, "ВНИМАНИЕ: Сумма распределенных платежей НЕ равна сумме платежа");
	Возврат Истина;	
КонецЕсли;

Возврат Ложь;	
КонецФункции

&НаКлиенте
Процедура ВыгрузкаПлатежиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ПлатежиПриОкончанииРедактирования("ВыгрузкаПлатежи", Элемент, НоваяСтрока, ОтменаРедактирования);	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежиПриОкончанииРедактирования(ТаблицаДанные, Элемент, НоваяСтрока, ОтменаРедактирования)
Если ОтменаРедактирования Тогда	
	ПоказатьПредупреждение(, "Отмена редактирования
							|
							|ДАННЫЕ НЕ СОХРАНЕНЫ");
	
	ТД = Элемент.ТекущиеДанные; 	
	Для Каждого Строка Из БезналНастройкиРаспределениеПлатежей Цикл
		ТД[Строка.ИмяРеквизитаФормы] = ТД[Строка.ИмяРеквизитаФормы + "_OldValue"]; 
	КонецЦикла;		

	Возврат; 
КонецЕсли;

ТС = Элемент.ТекущаяСтрока; 
ПлатежиПриОкончанииРедактированияНаСервере(ТаблицаДанные, ТС);
КонецПроцедуры

&НаСервере
Процедура ПлатежиПриОкончанииРедактированияНаСервере(ТаблицаДанные, ТС)
ТД = ЭтаФорма[ТаблицаДанные].НайтиПоИдентификатору(ТС);

УстановитьСуммыПлатежейТолькоПросмотр(ТД, ТД);

ОбновитьЗаписьБезнал(ТД);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписьБезнал(ТД)
Запись = РегистрыСведений.БезналЗагрузка.СоздатьМенеджерЗаписи();
Запись.ГУИД = ТД.ГУИД;
Запись.Прочитать();

Запись.ПолучательПлатежа = ТД.ПолучательПлатежа; 

Для Каждого Строка Из БезналНастройкиРаспределениеПлатежей Цикл
	Запись[Строка.ИмяРеквизитаДанные] = ТД[Строка.ИмяРеквизитаФормы]; 
КонецЦикла;

Запись.Записать();
КонецПроцедуры
//

////
////// - Выгрузка


////// + Выписка
////

//
&НаКлиенте
Процедура ВыпискаОплатыТолькоНезакрытыеПриИзменении(Элемент)
Если НЕ ВыпискаОплатыТолькоНезакрытые Тогда 
	
	Если НЕ ЗначениеЗаполнено(ВыпискаОплатыКонтрагентОтбор) Тогда 
		ПоказатьПредупреждение(, "Необходимо выбрать Контрагента ..."); 
		
		ВыпискаОплатыТолькоНезакрытые = Истина;
		
		Возврат;
	КонецЕсли;
КонецЕсли;

ВыпискаОплатыЗагрузить(Неопределено);
КонецПроцедуры

// + Вариант
&НаКлиенте
Процедура ВыпискаОплатыТолькоНезакрытыеПриИзменении_Вариант(Элемент)
Если ВыпискаОплатыТолькоНезакрытые Тогда 
	ВыпискаОплатыВсе = Ложь;
КонецЕсли;	

ВыпискаОплатыЗагрузить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаОплатыВсеПриИзменении(Элемент)
Если ВыпискаОплатыВсе Тогда 
	ВыпискаОплатыТолькоНезакрытые = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ВыпискаОплатыКонтрагентОтбор) Тогда 
		ПоказатьПредупреждение(, "Необходимо выбрать Контрагента ..."); 
		
		Возврат;
	КонецЕсли;
КонецЕсли;

ВыпискаСчетаВсе = ВыпискаОплатыВсе;

ВыпискаОплатыЗагрузить(Неопределено);
КонецПроцедуры
// - Вариант

&НаКлиенте
Процедура ВыпискаОплатыКонтрагентОтборПриИзменении(Элемент)
ВыпискаОплатыЗагрузить(Неопределено);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыпискаОплатыЗагрузить(Команда)
ВыпискаОплатыЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыпискаОплатыЗагрузитьНаСервере()
ВыпискаКонтрагент_Предыдущий = Неопределено;
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ОтКого КАК Контрагент,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.ТекстПлатежа КАК ТекстПлатежа,
                      |	ВыпискаБанка.Закрыт КАК Закрыт,
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(Долги.СуммаОплаты, 0) КАК ОстатокОплаты,
                      |	Возвраты.Сумма КАК СуммаВозврат,
                      |	ВыпискаБанка.ГУИДИсточникЗагрузка = """" КАК РучнойВвод
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК ДокументОплаты,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		ГДЕ
                      |			ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК Долги
                      |		ПО ВыпискаБанка.Ссылка = Долги.ДокументОплаты
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Приход = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачалаУчета
                      |	И ВЫБОР
                      |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ВыпискаБанка.ОтКого = &Контрагент
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаОплатыС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ВыпискаБанка.ДатаОплаты >= &ДатаОплатыС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаОплатыПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ВыпискаБанка.ДатаОплаты <= &ДатаОплатыПо
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ТолькоНеЗакрытые
                      |				ТОГДА ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(Долги.СуммаОплаты, 0) > 0
                      |						И ВыпискаБанка.Закрыт = ЛОЖЬ
                      |			ИНАЧЕ ИСТИНА
                      |		КОНЕЦ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Контрагент,
                      |	ДатаОплаты,
                      |	ДокументОплаты");

Запрос.УстановитьПараметр("Контрагент", ВыпискаОплатыКонтрагентОтбор);
Запрос.УстановитьПараметр("ДатаОплатыС", ВыпискаДатаОплатыС);
Запрос.УстановитьПараметр("ДатаОплатыПо", ВыпискаДатаОплатыПо);
//Запрос.УстановитьПараметр("Все", ВыпискаОплатыВсе);
Запрос.УстановитьПараметр("ТолькоНеЗакрытые", ВыпискаОплатыТолькоНезакрытые);

Если НастройкиСервер.ЭтоЛайв() Тогда
	ДатаНачалаУчета = '20220401';
Иначе
	ДатаНачалаУчета = '00010101';
КонецЕсли;
Запрос.УстановитьПараметр("ДатаНачалаУчета", ДатаНачалаУчета);

ТЗ = Запрос.Выполнить().Выгрузить(); 
ВыпискаОплаты.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ВыпискаОплаты.Добавить();		
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		НоваяСтрока.КонтрагентНаименование = Строка.Контрагент.Наименование;	
	КонецЕсли;		
КонецЦикла;

ВыпискаОплаты.Сортировать("Контрагент, ДатаОплаты, ДокументОплаты");

Если ТЗ.Количество() = 0 Тогда 
	ВыпискаОплатыТекущаяСтрока = -1;
	ОбновитьСчетаСвязи();
КонецЕсли;

Если ВыпискаОплаты.Количество() = 0 Тогда
	ВыпискаОплатыДокументОплаты_Текущий = Неопределено;	
КонецЕсли;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыпискаОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаОплатыПередНачаломИзменения(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаОплатыПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыпискаОплатыЗакрытьОткрыть(Команда)
ВыпискаОплатыЗакрытьОткрытьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыпискаОплатыЗакрытьОткрытьНаСервере()
ТС = Элементы.ВыпискаОплаты.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ТД = ВыпискаОплаты.НайтиПоИдентификатору(ТС);

ДокументОплатыОбъект = ТД.ДокументОплаты.ПолучитьОбъект(); 
ДокументОплатыОбъект.Закрыт = НЕ ДокументОплатыОбъект.Закрыт;
ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);

ТД.Закрыт = ДокументОплатыОбъект.Закрыт;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыпискаОплатыПриАктивизацииСтроки(Элемент)
Если Элемент.ТекущиеДанные = Неопределено Тогда	
	ВыпискаОплатыДокументОплаты_Текущий = Неопределено;
Иначе
	ВыпискаОплатыДокументОплаты_Текущий = Элемент.ТекущиеДанные.ДокументОплаты;
КонецЕсли;	
	
ТекущаяСтрока = Элемент.ТекущаяСтрока;
Если ТекущаяСтрока = Неопределено Тогда 
	ВыпискаОплатыТекущаяСтрока = -1; 
Иначе	
	ВыпискаОплатыТекущаяСтрока = ТекущаяСтрока; 
	
	Если Элемент.ТекущиеДанные.Контрагент <> ВыпискаКонтрагент_Предыдущий Тогда 	
		ВыпискаКонтрагент_Предыдущий = Элемент.ТекущиеДанные.Контрагент;
		ВстатьНаСтрокуСчета();
 	КонецЕсли;
КонецЕсли;

ОбновитьСчетаСвязи();
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаОплатыПриАктивизацииСтроки_Вариант(Элемент)
ТекущаяСтрока = Элемент.ТекущаяСтрока;
Если ТекущаяСтрока = Неопределено Тогда 
	ВыпискаОплатыТекущаяСтрока = -1; 
Иначе	
	ВыпискаОплатыТекущаяСтрока = ТекущаяСтрока; 
	
	Если Элемент.ТекущиеДанные.Контрагент = ВыпискаКонтрагент_Предыдущий Тогда Возврат; КонецЕсли;
	
	ВыпискаКонтрагент_Предыдущий = Элемент.ТекущиеДанные.Контрагент;
	ВстатьНаСтрокуСчета();
КонецЕсли;

ОбновитьСчетаСвязи();
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если ВыбраннаяСтрока = Неопределено Тогда Возврат; КонецЕсли;

ТД = ВыпискаОплаты.НайтиПоИдентификатору(ВыбраннаяСтрока);

ОплатыОбщееКлиент.ОткрытьДокументОплаты(ЭтаФорма, ТД.ДокументОплаты, Истина, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВстатьНаСтрокуСчета()
ТекущиеДанныеВыпискаОплаты = Элементы.ВыпискаОплаты.ТекущиеДанные;
//Если ТекущиеДанныеВыпискаОплаты.ОстатокОплаты <> 0 Тогда 
	
	ОтборСтроки = Новый Структура("Контрагент", ТекущиеДанныеВыпискаОплаты.Контрагент);
	НайденныеСтрокиСчета = ВыпискаСчета.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтрокиСчета.Количество() > 0 Тогда
		Для Каждого Строка Из НайденныеСтрокиСчета Цикл
			Если Строка.ОстатокКЗакрытию = 0 Тогда Продолжить; КонецЕсли;
			
			Элементы.ВыпискаСчета.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
			Возврат;
		КонецЦикла;
	КонецЕсли;	
	
//КонецЕсли;

Элементы.ВыпискаСчета.ТекущаяСтрока = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетаСвязи()
ВыпискаСчетаЗагрузитьНаСервере();
ВыпискаСвязьЗагрузитьНаСервере();
КонецПроцедуры
//
////

////
&НаКлиенте
Процедура ВыпискаСчетаВсеПриИзменении(Элемент)
ВыпискаСчетаЗагрузитьНаСервере();
КонецПроцедуры

//
&НаКлиенте
Процедура ВыпискаСчетаЗагрузить(Команда)
ВыпискаСчетаЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыпискаСчетаЗагрузитьНаСервере()
ВыпискаСчета.Очистить();
ВыпискаСчетаОтмеченоИтого = 0;	

Если ВыпискаОплатыТекущаяСтрока = -1 Тогда Возврат; КонецЕсли;
ТД = ВыпискаОплаты.НайтиПоИдентификатору(ВыпискаОплатыТекущаяСтрока);
КонтрагентПараметр = ТД.ДокументОплаты.ОтКого;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	0 КАК ТипДокумента,
                      |	""ЗБ"" КАК ТипДокументаПредставление,
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК ДокументДолг,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеСчета.Контрагент КАК Контрагент,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ЗаявкаНаБронированиеСчета.Контрагент.НаименованиеЮрЛица
                      |		ИНАЧЕ ЗаявкаНаБронированиеСчета.Контрагент.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                      |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Примечание КАК ДокументДолгПримечание,
                      |	ЕСТЬNULL(Долги.СуммаКЗакрытию, 0) КАК ОстатокКЗакрытию,
                      |	ЕСТЬNULL(Долги.СуммаДолг, 0) КАК СуммаДолг,
                      |	ЕСТЬNULL(ДолгиПроживание.СуммаДолгПроживание, 0) КАК СуммаДолгПроживание,
                      |	ЕСТЬNULL(Долги.СуммаДолг, 0) - ЕСТЬNULL(ДолгиПроживание.СуммаДолгПроживание, 0) КАК СуммаДолгУслуги
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК Долги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = Долги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = Долги.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаСчетаДетальноДолгиПроживание.Ссылка КАК Ссылка,
                      |			ЗаявкаСчетаДетальноДолгиПроживание.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаСчетаДетальноДолгиПроживание.СуммаДолг) КАК СуммаДолгПроживание
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаСчетаДетальноДолгиПроживание
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаСчетаДетальноДолгиПроживание.СчетГУИД,
                      |			ЗаявкаСчетаДетальноДолгиПроживание.Ссылка) КАК ДолгиПроживание
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ДолгиПроживание.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиПроживание.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
                      |	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА &Все
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЕСТЬNULL(Долги.СуммаКЗакрытию, 0) > 0
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЗаявкаНаБронированиеСчета.Ссылка.РезервС >= &ДатаСчетаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЗаявкаНаБронированиеСчета.Ссылка.РезервС <= &ДатаСчетаПо
                      |		КОНЕЦ
                      |	И ЗаявкаНаБронированиеСчета.Контрагент = &Контрагент");


					//|	И ВЫБОР
					//  |			КОГДА &ДатаСчетаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					//  |				ТОГДА ИСТИНА
					//  |			ИНАЧЕ ЗаявкаНаБронированиеСчета.ДатаСчета >= &ДатаСчетаС
					//  |		КОНЕЦ
					//  |	И ВЫБОР
					//  |			КОГДА &ДатаСчетаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					//  |				ТОГДА ИСТИНА
					//  |			ИНАЧЕ ЗаявкаНаБронированиеСчета.ДатаСчета <= &ДатаСчетаПо
					//  |		КОНЕЦ

Запрос.УстановитьПараметр("ДатаСчетаС", ВыпискаДатаСчетаС);
Запрос.УстановитьПараметр("ДатаСчетаПо",  ВыпискаДатаСчетаПо);
Запрос.УстановитьПараметр("Все", ВыпискаСчетаВсе);

Запрос.УстановитьПараметр("Контрагент", КонтрагентПараметр);

ТЗ = Запрос.Выполнить().Выгрузить(); 
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ВыпискаСчета.Добавить();		
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		НоваяСтрока.КонтрагентНаименование = Строка.Контрагент.Наименование;	
	КонецЕсли;		
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	1 КАК ТипДокумента,
                      |	""ГС"" КАК ТипДокументаПредставление,
                      |	ГрупповыеСчета.Ссылка КАК ДокументДолг,
                      |	ГрупповыеСчета.Контрагент КАК Контрагент,
                      |	ВЫБОР
                      |		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ГрупповыеСчета.Контрагент.НаименованиеЮрЛица
                      |		ИНАЧЕ ГрупповыеСчета.Контрагент.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ГрупповыеСчета.СчетГУИД КАК СчетГУИД,
                      |	ГрупповыеСчета.НомерСчета КАК НомерСчета,
                      |	ГрупповыеСчета.ДатаСчета КАК ДатаСчета,
                      |	ЕСТЬNULL(Долги.СуммаДолг, 0) КАК СуммаДолг,
                      |	ЕСТЬNULL(Долги.СуммаКЗакрытию, 0) КАК ОстатокКЗакрытию
                      |ИЗ
                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |			СУММА(ЗаявкиДолги.СуммаДолг) КАК СуммаДолг,
                      |			СУММА(ЗаявкиДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |					СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
                      |					СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
                      |				ИЗ
                      |					Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ГДЕ
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |				
                      |				СГРУППИРОВАТЬ ПО
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ЗаявкиДолги
                      |				ПО ГрупповыеСчетаДокументыДолги.СчетГУИД = ЗаявкиДолги.СчетГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыДолги.Ссылка) КАК Долги
                      |		ПО ГрупповыеСчета.Ссылка = Долги.Ссылка
                      |ГДЕ
                      |	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА &Все
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЕСТЬNULL(Долги.СуммаКЗакрытию, 0) > 0
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ГрупповыеСчета.ДатаСчета >= &ДатаСчетаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ГрупповыеСчета.ДатаСчета <= &ДатаСчетаПо
                      |		КОНЕЦ
                      |	И ГрупповыеСчета.Контрагент = &Контрагент");

Запрос.УстановитьПараметр("ДатаСчетаС", ВыпискаДатаСчетаС);
Запрос.УстановитьПараметр("ДатаСчетаПо", ВыпискаДатаСчетаПо);
Запрос.УстановитьПараметр("Все",  ВыпискаСчетаВсе);

Запрос.УстановитьПараметр("Контрагент", КонтрагентПараметр);

ТЗ = Запрос.Выполнить().Выгрузить(); 
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ВыпискаСчета.Добавить();		
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		НоваяСтрока.КонтрагентНаименование = Строка.Контрагент.Наименование;	
	КонецЕсли;		
КонецЦикла;

/////
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	2 КАК ТипДокумента,
                      |	""КС"" КАК ТипДокументаПредставление,
                      |	КоворкингСчета.Ссылка КАК ДокументДолг,
                      |	ВЫБОР
                      |		КОГДА КоворкингСчета.ОплачиваетСчет = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |			ТОГДА ВЫБОР
                      |					КОГДА КоворкингСчета.КоворкингЗаявка.Оплачивает = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |						ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
                      |					ИНАЧЕ КоворкингСчета.КоворкингЗаявка.Оплачивает
                      |				КОНЕЦ
                      |		ИНАЧЕ КоворкингСчета.ОплачиваетСчет
                      |	КОНЕЦ КАК Контрагент,
                      |	КоворкингСчета.СчетГУИД КАК СчетГУИД,
                      |	КоворкингСчета.Номер КАК НомерСчета,
                      |	КоворкингСчета.Дата КАК ДатаСчета,
                      |	КоворкингСчета.Сумма КАК СуммаДолг,
                      |	КоворкингСчета.Сумма - ЕСТЬNULL(Оплаты.СуммаОплачено, 0) КАК ОстатокКЗакрытию
                      |ИЗ
                      |	Документ.КоворкингСчета КАК КоворкингСчета
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КоворкингСчетаДокументыОплаты.Ссылка КАК Ссылка,
                      |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаОплачено
                      |		ИЗ
                      |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КоворкингСчетаДокументыОплаты.Ссылка) КАК Оплаты
                      |		ПО КоворкингСчета.Ссылка = Оплаты.Ссылка
                      |ГДЕ
                      |	КоворкингСчета.ПометкаУдаления = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА &Все
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ КоворкингСчета.Сумма - ЕСТЬNULL(Оплаты.СуммаОплачено, 0) > 0
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ КоворкингСчета.Дата >= &ДатаСчетаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ КоворкингСчета.Дата <= &ДатаСчетаПо
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА КоворкингСчета.ОплачиваетСчет = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |				ТОГДА ВЫБОР
                      |						КОГДА КоворкингСчета.КоворкингЗаявка.Оплачивает = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |							ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
                      |						ИНАЧЕ КоворкингСчета.КоворкингЗаявка.Оплачивает
                      |					КОНЕЦ
                      |			ИНАЧЕ КоворкингСчета.ОплачиваетСчет
                      |		КОНЕЦ = &Контрагент");

					  //|	ВЫБОР
					  //|		КОГДА КоворкингСчета.КоворкингЗаявка.Оплачивает = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
					  //|			ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
					  //|		ИНАЧЕ КоворкингСчета.КоворкингЗаявка.Оплачивает
					  //|	КОНЕЦ КАК Контрагент,


Запрос.УстановитьПараметр("ДатаСчетаС", ВыпискаДатаСчетаС);
Запрос.УстановитьПараметр("ДатаСчетаПо", ВыпискаДатаСчетаПо);
Запрос.УстановитьПараметр("Все",  ВыпискаСчетаВсе);

Запрос.УстановитьПараметр("Контрагент", КонтрагентПараметр);

ТЗ = Запрос.Выполнить().Выгрузить(); 
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ВыпискаСчета.Добавить();		
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если Строка.Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда
		НаименованиеЮрЛица = Строка.Контрагент.НаименованиеЮрЛица;
		Если ЗначениеЗаполнено(НаименованиеЮрЛица) Тогда
			НоваяСтрока.КонтрагентНаименование = НаименованиеЮрЛица;
		Иначе
			НоваяСтрока.КонтрагентНаименование = Строка.Контрагент.Наименование;
		КонецЕсли;			
	Иначе
		НоваяСтрока.КонтрагентНаименование = Строка.Контрагент.Наименование;
	КонецЕсли;
КонецЦикла;

ВыпискаСчета.Сортировать("Контрагент, ТипДокумента, ДокументДолг, НомерСчета, ОстатокКЗакрытию УБЫВ");	

ВыпискаСчетаОтмеченоИтого = 0;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыпискаСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если ВыбраннаяСтрока = Неопределено Тогда Возврат; КонецЕсли;

ТД = ВыпискаСчета.НайтиПоИдентификатору(ВыбраннаяСтрока);

ОплатыОбщееКлиент.ОткрытьДокументДолг(ЭтаФорма, ТД.ДокументДолг, Истина, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаСчетаПередНачаломИзменения(Элемент, Отказ)
//Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаСчетаПередУдалением(Элемент, Отказ)
Отказ = Истина;	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыпискаСчетаОтметкаПриИзменении(Элемент)
ВыпискаСчетаТекущаяСтрока = Элементы.ВыпискаСчета.ТекущаяСтрока;
Если ВыпискаСчетаТекущаяСтрока = Неопределено Тогда Возврат; КонецЕсли;
ВыпискаСчетаТекущиеДанные = ВыпискаСчета.НайтиПоИдентификатору(ВыпискаСчетаТекущаяСтрока);
	
ВыпискаОплатыТекущаяСтрока = Элементы.ВыпискаОплаты.ТекущаяСтрока;
Если ВыпискаОплатыТекущаяСтрока = Неопределено Тогда 
	ВыпискаСчетаТекущиеДанные.Отметка = Ложь; 
	
	Возврат; 
КонецЕсли;
ВыпискаОплатыТекущиеДанные = ВыпискаОплаты.НайтиПоИдентификатору(ВыпискаОплатыТекущаяСтрока);

Если ВыпискаОплатыТекущиеДанные.ОстатокОплаты = 0 Тогда 
	ВыпискаСчетаТекущиеДанные.Отметка = Ложь; 

	Возврат; 
КонецЕсли;

ТекстОшибки = КонтрагентыНеРавныТекстОшибки(ВыпискаОплатыТекущиеДанные.ДокументОплаты, ВыпискаСчетаТекущиеДанные.Контрагент);
Если ТекстОшибки <> ""  Тогда 
	//ТекстОшибки = "Контрагент в документе оплаты не равен контрагенту в счете";
	ПоказатьПредупреждение(, ТекстОшибки); 

	ВыпискаСчетаТекущиеДанные.Отметка = Ложь; 
	
	Возврат; 
КонецЕсли;

Если ВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию = 0 Тогда 
	ВыпискаСчетаТекущиеДанные.Отметка = Ложь; 

	Возврат; 
КонецЕсли;
	
Если ВыпискаСчетаТекущиеДанные.Отметка Тогда
	ВыпискаСчетаОтмеченоИтого = ВыпискаСчетаОтмеченоИтого + ВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию; 
Иначе
	ВыпискаСчетаОтмеченоИтого = ВыпискаСчетаОтмеченоИтого - ВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию; 
КонецЕсли;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыпискаОплатыСоздатьВозврат(Команда)
ТД = Элементы.ВыпискаОплаты.ТекущиеДанные;
Если ТД.ОстатокОплаты = 0 Тогда 
	ПоказатьПредупреждение(, "Остаток выписки = 0
		|
		|Для создания возврата удалите связь выписки и счета ...");
	
	Возврат; 
КонецЕсли;

ВыпискаОплатыДокументОплатыТекущий = ТД.ДокументОплаты;

ПараметрыФормы = Новый Структура();
ПараметрыФормы.Вставить("ЭтоВозврат", Истина);
ПараметрыФормы.Вставить("ОтКого", ТД.Контрагент);
ПараметрыФормы.Вставить("ВозвратДокумент", ТД.ДокументОплаты);
ПараметрыФормы.Вставить("ВозвратСумма", ТД.ОстатокОплаты);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ФормаВозврат", ЭтаФорма);
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаДокумента", ПараметрыФормы
	, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_ФормаВозврат(Результат, ДополнительныеПараметры) Экспорт
ВыпискаОплатыЗагрузить(Неопределено);

//ОтборСтроки = Новый Структура("ДокументОплаты", ВыпискаОплатыДокументОплатыТекущий);
//НайденныеСтроки = ВыпискаОплаты.НайтиСтроки(ОтборСтроки);
//НайденнаяСтрока = НайденныеСтроки[0];
//Идентификатор = НайденнаяСтрока.ПолучитьИдентификатор();
//Элементы.ВыпискаОплаты.ТекущаяСтрока = Идентификатор;
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаОплатыУдалитьВозврат(Команда)
ТД = Элементы.ВыпискаОплаты.ТекущиеДанные;
Если ТД.СуммаВозврат = 0 Тогда Возврат; КонецЕсли;

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_ПодтвердитеУдаление", ЭтаФорма);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ...", РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_ПодтвердитеУдаление(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
	
ТС = Элементы.ВыпискаОплаты.ТекущаяСтрока;	
	
ВыпискаОплатыУдалитьВозвратНаСервере(ТС);
КонецПроцедуры

&НаСервере
Процедура ВыпискаОплатыУдалитьВозвратНаСервере(ТС)
ТД = ВыпискаОплаты.НайтиПоИдентификатору(ТС);	

ВыпискаОплатыДокументОплатыТекущий = ТД.ДокументОплаты;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.ВозвратДокумент = &ВозвратДокумент");
Запрос.УстановитьПараметр("ВозвратДокумент", ВыпискаОплатыДокументОплатыТекущий);

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Ссылка = Строка.Ссылка;
	СсылкаОбъект = Ссылка.ПолучитьОбъект();
	СсылкаОбъект.Удалить();
КонецЦикла;

ВыпискаОплатыЗагрузитьНаСервере();

ОтборСтроки = Новый Структура("ДокументОплаты", ВыпискаОплатыДокументОплатыТекущий);
НайденныеСтроки = ВыпискаОплаты.НайтиСтроки(ОтборСтроки);
НайденнаяСтрока = НайденныеСтроки[0];
Идентификатор = НайденнаяСтрока.ПолучитьИдентификатор();
Элементы.ВыпискаОплаты.ТекущаяСтрока = Идентификатор;
КонецПроцедуры
//
////

////

//
&НаКлиенте
Процедура ВыпискаСвязьЗагрузить(Команда)
ВыпискаСвязьЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыпискаСвязьЗагрузитьНаСервере()
ВыпискаСвязиОплатыСчета.Очистить();

Если ВыпискаОплатыТекущаяСтрока = -1 Тогда Возврат; КонецЕсли;

ТД = ВыпискаОплаты.НайтиПоИдентификатору(ВыпискаОплатыТекущаяСтрока);
//ДокументОплатыПараметр = ТД.ДокументОплаты;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанкаДолгиОплата.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг КАК ДокументДолг,
                      |	ДолгиОплаты.НомерСчета КАК НомерСчета,
                      |	ДолгиОплаты.ДатаСчета КАК ДатаСчета,
                      |	ДолгиОплаты.СчетГУИД КАК СчетГУИД,
                      |	ДолгиОплаты.СуммаОплаты КАК СуммаРаспределено
                      |ИЗ
                      |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			РаспределениеОплатСумма.ДокументОплаты КАК ДокументОплаты,
                      |			ЗаявкаНаБронированиеСчета.Ссылка КАК ДокументДолг,
                      |			ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |			ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                      |			ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                      |			СУММА(РаспределениеОплатСумма.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			(ВЫБРАТЬ
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
                      |			ИЗ
                      |				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |			
                      |			СГРУППИРОВАТЬ ПО
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК РаспределениеОплатСумма
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |				ПО РаспределениеОплатСумма.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
                      |					И РаспределениеОплатСумма.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			РаспределениеОплатСумма.ДокументОплаты,
                      |			ЗаявкаНаБронированиеСчета.Ссылка,
                      |			ЗаявкаНаБронированиеСчета.СчетГУИД,
                      |			ЗаявкаНаБронированиеСчета.НомерСчета,
                      |			ЗаявкаНаБронированиеСчета.ДатаСчета) КАК ДолгиОплаты
                      |		ПО ВыпискаБанкаДолгиОплата.Ссылка = ДолгиОплаты.ДокументОплаты
                      |			И ВыпискаБанкаДолгиОплата.ДокументДолг = ДолгиОплаты.ДокументДолг
                      |			И ВыпискаБанкаДолгиОплата.СчетГУИД = ДолгиОплаты.СчетГУИД
                      |ГДЕ
                      |	ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанкаДолгиОплата.Ссылка = &ДокументОплаты");

Запрос.УстановитьПараметр("ДокументОплаты", ТД.ДокументОплаты);

//|	И ВыпискаБанкаДолгиОплата.Ссылка В(&ДокументыОплаты)");

//ОтборСтроки = Новый Структура("Контрагент", ВыпискаКонтрагент_Предыдущий);					  
//ДокументыОплаты = ВыпискаОплаты.Выгрузить(ОтборСтроки, "ДокументОплаты");
//Запрос.УстановитьПараметр("ДокументыОплаты", ДокументыОплаты);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ВыпискаСвязиОплатыСчета.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанкаДолгиОплата.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг КАК ДокументДолг,
                      |	ВыпискаБанкаДолгиОплата.СчетГУИД КАК СчетГУИД,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг.НомерСчета КАК НомерСчета,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг.ДатаСчета КАК ДатаСчета,
                      |	РаспределениеОплат.СуммаОплаты КАК СуммаРаспределено
                      |ИЗ
                      |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаРаспределениеОплат.Ссылка КАК ДокументДолг,
                      |			ГрупповыеСчетаРаспределениеОплат.ДокументОплаты КАК ДокументОплаты,
                      |			СУММА(ГрупповыеСчетаРаспределениеОплат.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.РаспределениеОплат КАК ГрупповыеСчетаРаспределениеОплат
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаРаспределениеОплат.Ссылка,
                      |			ГрупповыеСчетаРаспределениеОплат.ДокументОплаты) КАК РаспределениеОплат
                      |		ПО ВыпискаБанкаДолгиОплата.Ссылка = РаспределениеОплат.ДокументОплаты
                      |			И ВыпискаБанкаДолгиОплата.ДокументДолг = РаспределениеОплат.ДокументДолг
                      |			И ВыпискаБанкаДолгиОплата.СчетГУИД = РаспределениеОплат.ДокументДолг.СчетГУИД
                      |ГДЕ
                      |	ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанкаДолгиОплата.Ссылка = &ДокументОплаты");

//|	И ВыпискаБанкаДолгиОплата.Ссылка В(&ДокументыОплаты)");

 Запрос.УстановитьПараметр("ДокументОплаты", ТД.ДокументОплаты);
 
 //|	И ВыпискаБанкаДолгиОплата.Ссылка В(&ДокументыОплаты)");

//ОтборСтроки = Новый Структура("Контрагент", ВыпискаКонтрагент_Предыдущий);					  
//ДокументыОплаты = ВыпискаОплаты.Выгрузить(ОтборСтроки, "ДокументОплаты");
//Запрос.УстановитьПараметр("ДокументыОплаты", ДокументыОплаты);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ВыпискаСвязиОплатыСчета.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанкаДолгиОплата.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг КАК ДокументДолг,
                      |	ДолгиОплаты.ДокументДолг.Номер КАК НомерСчета,
                      |	ДолгиОплаты.ДокументДолг.Дата КАК ДатаСчета,
                      |	ДолгиОплаты.ДокументДолг.СчетГУИД КАК СчетГУИД,
                      |	ДолгиОплаты.СуммаРаспределено КАК СуммаРаспределено
                      |ИЗ
                      |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КоворкингСчетаДокументыОплаты.Ссылка КАК ДокументДолг,
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                      |		ИЗ
                      |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КоворкингСчетаДокументыОплаты.Ссылка,
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты) КАК ДолгиОплаты
                      |		ПО ВыпискаБанкаДолгиОплата.Ссылка = ДолгиОплаты.ДокументОплаты
                      |			И ВыпискаБанкаДолгиОплата.ДокументДолг = ДолгиОплаты.ДокументДолг
                      |ГДЕ
                      |	ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанкаДолгиОплата.Ссылка = &ДокументОплаты");

//|	И ВыпискаБанкаДолгиОплата.Ссылка В(&ДокументыОплаты)");

 Запрос.УстановитьПараметр("ДокументОплаты", ТД.ДокументОплаты);

//ОтборСтроки = Новый Структура("Контрагент", ВыпискаКонтрагент_Предыдущий);					  
//ДокументыОплаты = ВыпискаОплаты.Выгрузить(ОтборСтроки, "ДокументОплаты");
//Запрос.УстановитьПараметр("ДокументыОплаты", ДокументыОплаты);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ВыпискаСвязиОплатыСчета.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

ВыпискаСвязиОплатыСчета.Сортировать("ДокументОплаты, ДокументДолг, ДатаСчета, СуммаРаспределено УБЫВ");	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыпискаСвязиОплатыСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаСвязиОплатыСчетаПередНачаломИзменения(Элемент, Отказ)
//Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаСвязиОплатыСчетаПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыпискаСвязиОплатыСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = ВыпискаСвязиОплатыСчета.НайтиПоИдентификатору(ВыбраннаяСтрока);	
Если Поле.Имя = "ВыпискаСвязиОплатыСчетаДокументОплаты" Тогда 
	ПоказатьЗначение(, ТД.ДокументОплаты); 
ИначеЕсли Поле.Имя = "ВыпискаСвязиОплатыСчетаДокументДолг" Тогда 
	ПоказатьЗначение(, ТД.ДокументДолг); 
КонецЕсли;

КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыпискаСвязатьОплатуСчет(Команда)
ВыпискаСвязатьОплатуСчетНаСервере();

ВыпискаСвязьЗагрузить(Неопределено);
КонецПроцедуры

&НаСервере
Функция ВыпискаСвязатьОплатуСчетНаСервере()
Результат = Новый Структура("КодОшибки, ТекстОшибки", 0 , "");	

ВыпискаОплатыТекущаяСтрока = Элементы.ВыпискаОплаты.ТекущаяСтрока;
Если ВыпискаОплатыТекущаяСтрока = Неопределено Тогда Возврат Неопределено; КонецЕсли;
ВыпискаОплатыТекущиеДанные = ВыпискаОплаты.НайтиПоИдентификатору(ВыпискаОплатыТекущаяСтрока);

Для Каждого ВыпискаСчетаТекущиеДанные Из ВыпискаСчета Цикл
	Если НЕ ВыпискаСчетаТекущиеДанные.Отметка Тогда Продолжить; КонецЕсли;

	ВыпискаСчетаТекущиеДанные.Отметка = Ложь;
	
	Если ВыпискаОплатыТекущиеДанные.ОстатокОплаты = 0 Тогда Прервать; КонецЕсли;	

	Если ВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию = 0 Тогда Продолжить; КонецЕсли;
	
	НоваяСвязь = ВыпискаСвязиОплатыСчета.Добавить();
	НоваяСвязь.ДокументОплаты = ВыпискаОплатыТекущиеДанные.ДокументОплаты;
	НоваяСвязь.ДокументДолг = ВыпискаСчетаТекущиеДанные.ДокументДолг;
	НоваяСвязь.СчетГУИД = ВыпискаСчетаТекущиеДанные.СчетГУИД;
	НоваяСвязь.НомерСчета = ВыпискаСчетаТекущиеДанные.НомерСчета;
	НоваяСвязь.ДатаСчета = ВыпискаСчетаТекущиеДанные.ДатаСчета;
	
	Если ВыпискаОплатыТекущиеДанные.ОстатокОплаты >= ВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию Тогда 
		НоваяСвязь.СуммаРаспределено = ВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию;
		ВыпискаОплатыТекущиеДанные.ОстатокОплаты = ВыпискаОплатыТекущиеДанные.ОстатокОплаты - НоваяСвязь.СуммаРаспределено;
		ВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию = 0;
	Иначе	
		НоваяСвязь.СуммаРаспределено = ВыпискаОплатыТекущиеДанные.ОстатокОплаты;
		ВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию = ВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию - НоваяСвязь.СуммаРаспределено;
		ВыпискаОплатыТекущиеДанные.ОстатокОплаты = 0;
	КонецЕсли;

	СуммаРаспределено = НоваяСвязь.СуммаРаспределено;
	ВыпискаЗаполнитьДокументДолгДокументОплаты(НоваяСвязь.ДокументОплаты, НоваяСвязь.ДокументДолг, НоваяСвязь.СчетГУИД, СуммаРаспределено);
КонецЦикла;
	
ВыпискаСчетаОтмеченоИтого = 0;

Возврат Результат; 
КонецФункции

&НаСервере
Функция КонтрагентыНеРавныТекстОшибки(ДокументОплаты, СчетКонтрагент)
Если ДокументОплаты.ОтКого <> СчетКонтрагент Тогда 
	ТекстОшибки = "Контрагент в документе оплаты не равен контрагенту в счете";
	
	Возврат ТекстОшибки; 
КонецЕсли;

Возврат ""; 
КонецФункции

&НаСервере
Функция ВыпискаЗаполнитьДокументДолгДокументОплаты(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено)
НачатьТранзакцию();

ЗаполнитьДокументДолгДокументОплаты(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено);

ЗафиксироватьТранзакцию();
КонецФункции

&НаСервере
Функция ЗаполнитьДокументДолгДокументОплаты(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено)
//ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено, Ложь);

СуммаРаспределено_П = СуммаРаспределено;

ДокументДолгОбъект = ДокументДолг.ПолучитьОбъект(); 
Если ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	
	СчетаДетальноОплаты = ДокументДолгОбъект.СчетаДетальноОплаты;
		
	НоваяОплата = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(СчетаДетальноОплаты, ДокументОплаты, Ложь);
	
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
	СчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

	РаспределениеОплатДолги = ДокументДолгОбъект.РаспределениеОплатДолги;
	
	ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(НоваяОплата, СуммаРаспределено
		,СчетаДетальноДолги, РаспределениеОплатДолги);

	ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено_П, Истина);
	
ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	
	ГрупповойСчетСервер.ДобавитьИЗаписатьДокументОплатыВГрупповойСчетОбъект(ДокументОплаты, ДокументДолгОбъект
		, СуммаРаспределено);	
	ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено_П, Истина);
	
ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.КоворкингСчета") Тогда
	
	ДокументыОплаты = ДокументДолгОбъект.ДокументыОплаты;
	
	ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);	
	НайденныеСтроки = ДокументыОплаты.НайтиСтроки(ОтборСтроки);

	Если НайденныеСтроки.Количество() = 0 Тогда 
		СтрокаОплаты = ДокументыОплаты.Добавить();	
		СтрокаОплаты.ДокументОплаты = ДокументОплаты; 
	Иначе
		СтрокаОплаты = НайденныеСтроки[0];
	КонецЕсли;
	
	СтрокаОплаты.СуммаРаспределено = СуммаРаспределено;
	
	КоворкингСервер.ОбновитьОплатыКоворкинг(ДокументДолгОбъект);
	
	ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЕсли;
КонецФункции
//

//
&НаКлиенте
Процедура ВыпискаСвязьУдалить(Команда)
ВыпискаСвязьУдалитьНаСервере();

ВыпискаСчетаЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыпискаСвязьУдалитьНаСервере()
НачатьТранзакцию();

МассивКУдалению = Новый Массив;
Для Каждого ТекущиеДанныеВыпискаСвязиОплатыСчета Из ВыпискаСвязиОплатыСчета Цикл
	Если НЕ ТекущиеДанныеВыпискаСвязиОплатыСчета.Отметка Тогда Продолжить; КонецЕсли;
	
	//ТекущиеДанныеВыпискаСвязиОплатыСчета = Элементы.ВыпискаСвязиОплатыСчета.ТекущиеДанные; 	
	ДокументОплаты = ТекущиеДанныеВыпискаСвязиОплатыСчета.ДокументОплаты;
	ДокументДолг = ТекущиеДанныеВыпискаСвязиОплатыСчета.ДокументДолг;
	СчетГУИД = ТекущиеДанныеВыпискаСвязиОплатыСчета.СчетГУИД;

	ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);	
	НайденныеСтроки = ВыпискаОплаты.НайтиСтроки(ОтборСтроки);	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ТекущиеДанныеОплаты = НайденныеСтроки[0];
		ТекущиеДанныеОплаты.ОстатокОплаты = ТекущиеДанныеОплаты.ОстатокОплаты + ТекущиеДанныеВыпискаСвязиОплатыСчета.СуммаРаспределено; 
	КонецЕсли;

	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);	
	НайденныеСтроки = ВыпискаСчета.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ТекущиеДанныеСчета = НайденныеСтроки[0];
		ТекущиеДанныеСчета.ОстатокКЗакрытию = ТекущиеДанныеСчета.ОстатокКЗакрытию + ТекущиеДанныеВыпискаСвязиОплатыСчета.СуммаРаспределено; 
	КонецЕсли;

	ВыпискаУдалитьДокументОплатыВДокументДолг(ДокументОплаты, ДокументДолг, СчетГУИД);

	МассивКУдалению.Добавить(ТекущиеДанныеВыпискаСвязиОплатыСчета);
КонецЦикла;	

Для Каждого Элемент Из МассивКУдалению Цикл
	ВыпискаСвязиОплатыСчета.Удалить(Элемент);
КонецЦикла;

ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере
Функция ВыпискаУдалитьДокументОплатыВДокументДолг(ДокументОплаты, ДокументДолг, СчетГУИД)
УдалитьДокументОплатыВДокументДолг(ДокументОплаты, ДокументДолг, СчетГУИД);

ОплатыОбщееСервер.УдалитьДокументОплатыДолгОплатыИДокументОплаты(ДокументОплаты, ДокументДолг, СчетГУИД);
КонецФункции

&НаСервере
Функция УдалитьДокументОплатыВДокументДолг(ДокументОплаты, ДокументДолг, СчетГУИД)
ДокументДолгОбъект = ДокументДолг.ПолучитьОбъект(); 
Если ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда

	ЗаявкаСервер.УдалитьДокументОплаты(ДокументОплаты, ДокументДолгОбъект);
	
	ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	
	Для Каждого СтрокаЗаявка Из ДокументДолгОбъект.ДокументыДолги Цикл
		ЗаявкаОбъект = СтрокаЗаявка.ДокументДолг.ПолучитьОбъект();

		ЗаявкаСервер.УдалитьДокументОплаты(ДокументОплаты, ЗаявкаОбъект);

		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		ОтборСтроки = Новый Структура("ДокументОплаты, ДокументДолг", ДокументОплаты, ЗаявкаОбъект.Ссылка);
		ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, ДокументДолгОбъект.РаспределениеОплат);
	КонецЦикла;
	
	ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);
	ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, ДокументДолгОбъект.ДокументыОплаты);
	
	ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.КоворкингСчета") Тогда

	КоворкингСервер.УдалитьДокументОплаты(ДокументОплаты, ДокументДолгОбъект);
	
	ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЕсли;
КонецФункции
////
////// - Выписка

////// +  Эквайринг


//// + ЭквайрингПлатежи
&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если Поле.Имя = "ЭквайрингВыгрузкаПлатежиСуммаВыписки" Тогда
	ТД = Элемент.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ГУИДЗагрузка", ТД.ГУИД);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); ///Добавляем отбор в параметры формы

	ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецЕсли;	
КонецПроцедуры

//
&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиТолькоНезакрытыеПриИзменении(Элемент)
ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежиНаСервере();

ЭквайрингВыпискаСчетаВсе = НЕ ЭквайрингВыгрузкаПлатежиТолькоНезакрытые; 
ЭквайрингСчетаЗагрузить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиТолькоНеотмененныеПриИзменении(Элемент)
ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиТолькоС2022ПриИзменении(Элемент)
ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиПолучательПлатежаОтборПриИзменении(Элемент)
ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежи(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиПолучательПлатежаВсеПриИзменении(Элемент)
ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежи(Неопределено);
КонецПроцедуры
//

&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежи(Команда)
ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежиНаСервере();
ЭквайрингСчетаЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежиНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	БезналЗагрузка.ГУИД КАК ГУИД,
                      |	БезналЗагрузка.ГУИДИсточникаСтрока КАК ГУИДИсточникаСтрока,
                      |	БезналЗагрузка.ДатаЗагрузки КАК ДатаЗагрузки,
                      |	БезналЗагрузка.КонтрагентНаименование КАК КонтрагентНаименованиеЗагрузка,
                      |	БезналЗагрузка.КонтрагентИНН КАК КонтрагентИННЗагрузка,
                      |	БезналЗагрузка.КонтрагентКПП КАК КонтрагентКППЗагрузка,
                      |	БезналЗагрузка.ДатаОплаты КАК ДатаПлатежа,
                      |	БезналЗагрузка.Сумма КАК СуммаПлатежа,
                      |	БезналЗагрузка.СуммаАннулировано КАК СуммаАннулировано,
                      |	БезналЗагрузка.ТекстПлатежа КАК ТекстПлатежа,
                      |	БезналЗагрузка.Отменено КАК Отменено,
                      |	БезналЗагрузка.ПолучательПлатежа КАК ПолучательПлатежа,
                      |	ЕСТЬNULL(Выписка.Сумма, 0) КАК СуммаВыписки,
					  |ЕСТЬNULL(ВыпискаОплаты.Сумма, 0) КАК СуммаВыпискиОплаты,
					  |	БезналЗагрузка.Сумма - ЕСТЬNULL(Выписка.Сумма, 0) КАК ОстатокПлатежа_1,
                      |	ВЫБОР
                      |		КОГДА БезналЗагрузка.ПолучательПлатежа = """"
                      |			ТОГДА БезналЗагрузка.Сумма
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА &ПолучательПлатежа = ""ЛАЙВ""
                      |					ТОГДА БезналЗагрузка.СуммаЛайв - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |				КОГДА &ПолучательПлатежа = ""ЧЕХОВ""
                      |					ТОГДА БезналЗагрузка.СуммаЧехов - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |				КОГДА &ПолучательПлатежа = ""ДОМ СОВЕТОВ""
                      |					ТОГДА БезналЗагрузка.СуммаДомСоветов - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |				КОГДА &ПолучательПлатежа = ""РЕНОМЕ""
                      |					ТОГДА БезналЗагрузка.СуммаРеноме - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |				КОГДА &ПолучательПлатежа = ""СТРИТ АРТ""
                      |					ТОГДА БезналЗагрузка.СуммаСтритАрт - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ОстатокПлатежа,
                      |	ЕСТЬNULL(Выписка.Сумма, 0) - ЕСТЬNULL(ВыпискаОплаты.Сумма, 0) - ЕСТЬNULL(ВыпискаВозвраты.Сумма, 0) КАК ОстатокВыписки,
                      |	БезналЗагрузка.СуммаЧехов КАК СуммаЧехов,
                      |	БезналЗагрузка.СуммаЛайв КАК СуммаЛайв,
                      |	БезналЗагрузка.СуммаДомСоветов КАК СуммаДомСоветов,
                      |	БезналЗагрузка.СуммаРеноме КАК СуммаРеноме,
                      |	БезналЗагрузка.СуммаСтритАрт КАК СуммаСтритАрт
                      |ИЗ
                      |	РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ГУИДЗагрузка КАК ГУИДЗагрузка,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ГУИДЗагрузка) КАК Выписка
                      |		ПО БезналЗагрузка.ГУИД = Выписка.ГУИДЗагрузка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма,
                      |			ВыпискаБанкаДолгиОплата.Ссылка.ГУИДЗагрузка КАК ГУИДЗагрузка
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка.ГУИДЗагрузка) КАК ВыпискаОплаты
                      |		ПО БезналЗагрузка.ГУИД = ВыпискаОплаты.ГУИДЗагрузка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма,
                      |			ВыпискаБанка.ВозвратДокумент.ГУИДЗагрузка КАК ВозвратДокументГУИДЗагрузка
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент.ГУИДЗагрузка) КАК ВыпискаВозвраты
                      |		ПО БезналЗагрузка.ГУИД = ВыпискаВозвраты.ВозвратДокументГУИДЗагрузка
                      |ГДЕ
                      |	БезналЗагрузка.КонтрагентИНН В(&СписокИННЭквайринг)
                      |	И ВЫБОР
                      |			КОГДА &ДатаПлатежаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ БезналЗагрузка.ДатаОплаты >= &ДатаПлатежаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаПлатежаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ БезналЗагрузка.ДатаОплаты <= &ДатаПлатежаПо
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ПлатежиТолькоНеотмененные
                      |				ТОГДА БезналЗагрузка.Отменено = ЛОЖЬ
                      |			ИНАЧЕ ИСТИНА
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ПлатежиТолькоС2022
                      |				ТОГДА БезналЗагрузка.ДатаОплаты >= ДАТАВРЕМЯ(2022, 1, 1, 0, 0, 0)
                      |			ИНАЧЕ ИСТИНА
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ГостиницаВсе
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ БезналЗагрузка.ПолучательПлатежа = &ГостиницаОтбор
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ПлатежиТолькоНезакрытые
                      |				ТОГДА ВЫБОР
                      |						КОГДА БезналЗагрузка.ПолучательПлатежа = """"
                      |							ТОГДА БезналЗагрузка.Сумма
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА &ПолучательПлатежа = ""ЛАЙВ""
                      |									ТОГДА БезналЗагрузка.СуммаЛайв - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |								КОГДА &ПолучательПлатежа = ""ЧЕХОВ""
                      |									ТОГДА БезналЗагрузка.СуммаЧехов - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |								КОГДА &ПолучательПлатежа = ""ДОМ СОВЕТОВ""
                      |									ТОГДА БезналЗагрузка.СуммаДомСоветов - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |								КОГДА &ПолучательПлатежа = ""РЕНОМЕ""
                      |									ТОГДА БезналЗагрузка.СуммаРеноме - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |								КОГДА &ПолучательПлатежа = ""СТРИТ АРТ""
                      |									ТОГДА БезналЗагрузка.СуммаСтритАрт - ЕСТЬNULL(Выписка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ <> 0
                      |			ИНАЧЕ ИСТИНА
                      |		КОНЕЦ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаЗагрузки,
                      |	ДатаПлатежа,
                      |	БезналЗагрузка.КонтрагентИНН,
                      |	БезналЗагрузка.КонтрагентКПП,
                      |	СуммаПлатежа");

					  //|	ВЫБОР
					  //|			КОГДА &КонтрагентИНН = """"
					  //|				ТОГДА ИСТИНА
					  //|			ИНАЧЕ БезналЗагрузка.КонтрагентИНН = &КонтрагентИНН
					  //|		КОНЕЦ

СписокИННЭквайринг = БезналРаспределениеСервер.СписокИННЭквайринг();
Запрос.УстановитьПараметр("СписокИННЭквайринг", СписокИННЭквайринг);

Запрос.УстановитьПараметр("ДатаПлатежаС", ЭквайрингВыгрузкаДатаПлатежаС);
Запрос.УстановитьПараметр("ДатаПлатежаПо", ЭквайрингВыгрузкаДатаПлатежаПо);

Запрос.УстановитьПараметр("ПлатежиТолькоНезакрытые", ЭквайрингВыгрузкаПлатежиТолькоНезакрытые);
Запрос.УстановитьПараметр("ПлатежиТолькоНеотмененные", ЭквайрингВыгрузкаПлатежиТолькоНеотмененные);
Запрос.УстановитьПараметр("ПлатежиТолькоС2022", ЭквайрингВыгрузкаПлатежиТолькоС2022);

Запрос.УстановитьПараметр("ГостиницаВсе", ЭквайрингВыгрузкаПлатежиПолучательПлатежаВсе);
Запрос.УстановитьПараметр("ГостиницаОтбор", ЭквайрингВыгрузкаПлатежиПолучательПлатежаОтбор);

ПолучательПлатежа = ПолучательПлатежа_Константа;
Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);

ТЗ = Запрос.Выполнить().Выгрузить(); 
ЭквайрингВыгрузкаПлатежи.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЭквайрингВыгрузкаПлатежи.Добавить();		
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	УстановитьСуммыПлатежейТолькоПросмотр(НоваяСтрока, Строка);
КонецЦикла;

ЭквайрингВыгрузкаПлатежи.Сортировать("ДатаЗагрузки, ДатаПлатежа, СуммаПлатежа");

Если ЭквайрингВыгрузкаПлатежи.Количество() = 0 Тогда
	ЭквайрингВыгрузкаПлатежиГУИД_Текущий = Неопределено;
КонецЕсли;
КонецПроцедуры
//

&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиПриАктивизацииСтроки(Элемент)
Если Элемент.ТекущиеДанные = Неопределено Тогда	
	ЭквайрингВыгрузкаПлатежиГУИД_Текущий = Неопределено;
Иначе
	ЭквайрингВыгрузкаПлатежиГУИД_Текущий = Элемент.ТекущиеДанные.ГУИД;
КонецЕсли;

ЭквайрингСвязиЗагрузитьНаСервере();	
КонецПроцедуры

//
&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиПередНачаломИзменения(Элемент, Отказ)
ТД = Элемент.ТекущиеДанные;	
ЗапомнитьOldValueПередНачаломИзменения(ТД);	

ПолучательПлатежа_OldValue = ТД.ПолучательПлатежа;
КонецПроцедуры
//


//
&НаКлиенте
Процедура ЭквайрингВыгрузкаОтменитьВостановитьПлатежи(Команда)
Для Каждого ТС Из Элементы.ЭквайрингВыгрузкаПлатежи.ВыделенныеСтроки Цикл	
	
	ТекстОшибки = ЭквайрингВыгрузкаПроверкаОтменитьВосстановитьПлатеж(ТС);
	Если ТекстОшибки.Количество() > 0 Тогда 
		ТекстСообщения = "";
		Для Каждого Элемент Из ТекстОшибки Цикл
			ТекстСообщения = ТекстСообщения + Элемент;
		КонецЦикла;	
	
		Сообщить(ТекстСообщения);
		Продолжить; 
	КонецЕсли; 
	
	ЭквайрингВыгрузкаОтменитьВосстановитьПлатежНаСервере(ТС)
КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ЭквайрингВыгрузкаОтменитьВосстановитьПлатеж(Команда)
ТС = Элементы.ЭквайрингВыгрузкаПлатежи.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;   	
	
ТекстОшибки = ЭквайрингВыгрузкаПроверкаОтменитьВосстановитьПлатеж(ТС);
Если ТекстОшибки.Количество() > 0 Тогда 
	ТекстПредупреждения = "";
	Для Каждого Элемент Из ТекстОшибки Цикл
		ТекстПредупреждения = ТекстПредупреждения + Элемент + Символы.ПС;
	КонецЦикла;	
	ТекстПредупреждения = Лев(ТекстПредупреждения, СтрДлина(ТекстПредупреждения) - 1);

	
	ПоказатьПредупреждение(, ТекстПредупреждения);
	Возврат; 
КонецЕсли; 

ЭквайрингВыгрузкаОтменитьВосстановитьПлатежНаСервере(ТС);
КонецПроцедуры

&НаКлиенте
Функция ЭквайрингВыгрузкаПроверкаОтменитьВосстановитьПлатеж(ТС)
ТД = ЭквайрингВыгрузкаПлатежи.НайтиПоИдентификатору(ТС);
	
ТекстОшибки = Новый Массив;	
	
//Если ЭквайрингВыпискаСвязиОплатыСчета.Количество() > 0 Тогда 
//	ТекстОшибки = "Платеж от " 
//	| "Есть связи платежа с документами долга
//	|
//	|ДЛЯ ОТМЕНЫ ПЛАТЕЖА УДАЛИТЕ СВЯЗИ ПЛАТЕЖА С ДОКУМЕНТАМИ ДОЛГА 
//	|ИЛИ УДАЛИТЕ ВЫПИСКУ ...";
//	
//	ПоказатьПредупреждение(, ТекстОшибки);
//	
//	Возврат ТекстОшибки; 
//КонецЕсли; 


Если ТД.СуммаВыписки > 0 Тогда 
	//ТекстОшибки.Добавить("Платеж от " + ТД.ДатаПлатежа + " на сумму " + ТД.СуммаПлатежа + ". "); 
	
	Текст = ПлатежТекст(ТД);
	ТекстОшибки.Добавить(Текст);
	
	ТекстОшибки.Добавить("Есть выписки для платежа. "); 
	ТекстОшибки.Добавить(""); 
	ТекстОшибки.Добавить("ДЛЯ ОТМЕНЫ ПЛАТЕЖА УДАЛИТЕ СВЯЗИ ПЛАТЕЖА С ДОКУМЕНТАМИ ДОЛГА ИЛИ УДАЛИТЕ ВЫПИСКИ."); 
	
	Возврат ТекстОшибки; 
КонецЕсли; 

Возврат ТекстОшибки;
КонецФункции

&НаСервере
Процедура ЭквайрингВыгрузкаОтменитьВосстановитьПлатежНаСервере(ТС)
ТД = ЭквайрингВыгрузкаПлатежи.НайтиПоИдентификатору(ТС);
	
ОтменитьВосстановитьПлатеж(ТД);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЭквайрингВыгрузкаУдалитьВыписки(Команда)
ЭквайрингВыгрузкаУдалитьВыпискиНаСервере();

ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежи(Неопределено);
КонецПроцедуры

&НаСервере
Функция ЭквайрингВыгрузкаУдалитьВыпискиНаСервере()
НачатьТранзакцию();

Для Каждого Строка Из ЭквайрингВыпискаСвязиОплатыСчета Цикл
	Строка.Отметка = Истина;
КонецЦикла;

ЭквайрингВыпискаСвязиУдалитьНаСервере();

ТекущиеДанныеПлатежи = ЭквайрингВыгрузкаПлатежи.НайтиПоИдентификатору(Элементы.ЭквайрингВыгрузкаПлатежи.ТекущаяСтрока);
Если ТекущиеДанныеПлатежи.СуммаВыписки <> 0 Тогда
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыпискаБанка.Ссылка КАК ВыпискаБанка
	                      |ИЗ
	                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
	                      |		ПО ВыпискаБанка.ГУИДЗагрузка = БезналЗагрузка.ГУИД
	                      |ГДЕ
	                      |	БезналЗагрузка.ГУИД = &ГУИД");
	
	Запрос.УстановитьПараметр("ГУИД", ТекущиеДанныеПлатежи.ГУИД);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТЗ Цикл
		ВыпискаБанкаОбъект = Строка.ВыпискаБанка.ПолучитьОбъект();
		
		ВыпискаБанкаОбъект.Удалить();
	КонецЦикла;
КонецЕсли;

ЗафиксироватьТранзакцию();
КонецФункции
//


//
&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиПолучательПлатежаПриИзменении(Элемент)
ТД = Элементы.ЭквайрингВыгрузкаПлатежи.ТекущиеДанные;

Если ТД.СуммаВыписки > 0 Тогда
	ТД.ПолучательПлатежа = ПолучательПлатежа_OldValue;
	
	ПоказатьПредупреждение(, "Есть документ оплаты (выписка) для этого платежа.
	|
	|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...
	|
	|Для изменения получателя платежа удалите связи платежа и счетов."
	);
	
	Элементы.ЭквайрингВыгрузкаПлатежи.ЗакончитьРедактированиеСтроки(Ложь);
	Возврат;
КонецЕсли;

ЗаполнитьСуммаПолучательПлатежа(ТД);

Элементы.ЭквайрингВыгрузкаПлатежи.ЗакончитьРедактированиеСтроки(Ложь);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
Если ОтменаРедактирования Тогда Возврат; КонецЕсли;	
	
ТД = Элемент.ТекущиеДанные;

Отказ = ПроверкаСуммыПлатежейПередОкончаниемРедактирования(ТД);
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыгрузкаПлатежиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ПлатежиПриОкончанииРедактирования("ЭквайрингВыгрузкаПлатежи", Элемент, НоваяСтрока, ОтменаРедактирования);	
КонецПроцедуры
//

//// - ЭквайрингПлатежи

//// + ЭквайрингСчета

&НаКлиенте
Процедура ЭквайрингВыпискаСчетаВсеПриИзменении(Элемент)
ЭквайрингСчетаЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыпискаДатаСчетаСПриИзменении(Элемент)
ЭквайрингСчетаЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыпискаДатаСчетаПоПриИзменении(Элемент)
ЭквайрингСчетаЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыпискаСчетаКонтрагентОтборПриИзменении(Элемент)
ЭквайрингСчетаЗагрузитьНаСервере();
КонецПроцедуры


//
&НаКлиенте
Процедура ЭквайрингСчетаЗагрузить(Команда)
ЭквайрингСчетаЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭквайрингСчетаЗагрузитьНаСервере()
ЭквайрингВыпискаСчета.Очистить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	0 КАК ТипДокумента,
                      |	""ЗБ"" КАК ТипДокументаПредставление,
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК ДокументДолг,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеСчета.Контрагент КАК Контрагент,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ЗаявкаНаБронированиеСчета.Контрагент.НаименованиеЮрЛица
                      |		ИНАЧЕ ЗаявкаНаБронированиеСчета.Контрагент.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                      |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                      |	ЕСТЬNULL(Долги.СуммаКЗакрытию, 0) КАК ОстатокКЗакрытию,
                      |	ЕСТЬNULL(Долги.СуммаДолг, 0) КАК СуммаДолг,
                      |	ЕСТЬNULL(ДолгиПроживание.СуммаДолгПроживание, 0) КАК СуммаДолгПроживание,
                      |	ЕСТЬNULL(Долги.СуммаДолг, 0) - ЕСТЬNULL(ДолгиПроживание.СуммаДолгПроживание, 0) КАК СуммаДолгУслуги
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК Долги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = Долги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = Долги.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаСчетаДетальноДолгиПроживание.Ссылка КАК Ссылка,
                      |			ЗаявкаСчетаДетальноДолгиПроживание.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаСчетаДетальноДолгиПроживание.СуммаДолг) КАК СуммаДолгПроживание
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаСчетаДетальноДолгиПроживание
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаСчетаДетальноДолгиПроживание.СчетГУИД,
                      |			ЗаявкаСчетаДетальноДолгиПроживание.Ссылка) КАК ДолгиПроживание
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ДолгиПроживание.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиПроживание.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Проведен = ИСТИНА
                      |	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
                      |	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА &Все
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЕСТЬNULL(Долги.СуммаКЗакрытию, 0) > 0
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЗаявкаНаБронированиеСчета.Ссылка.РезервС >= &ДатаСчетаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЗаявкаНаБронированиеСчета.Ссылка.РезервС <= &ДатаСчетаПо
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &КонтрагентОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЗаявкаНаБронированиеСчета.Контрагент = &КонтрагентОтбор
                      |		КОНЕЦ");

					  //|	И ВЫБОР
					  //|			КОГДА &ДатаСчетаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					  //|				ТОГДА ИСТИНА
					  //|			ИНАЧЕ ЗаявкаНаБронированиеСчета.ДатаСчета >= &ДатаСчетаС
					  //|		КОНЕЦ
					  //|	И ВЫБОР
					  //|			КОГДА &ДатаСчетаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					  //|				ТОГДА ИСТИНА
					  //|			ИНАЧЕ ЗаявкаНаБронированиеСчета.ДатаСчета <= &ДатаСчетаПо
					  //|		КОНЕЦ


Запрос.УстановитьПараметр("КонтрагентОтбор",  ЭквайрингВыпискаСчетаКонтрагентОтбор);
Запрос.УстановитьПараметр("ДатаСчетаС", ЭквайрингВыпискаДатаСчетаС);
Запрос.УстановитьПараметр("ДатаСчетаПо",  ЭквайрингВыпискаДатаСчетаПо);
Запрос.УстановитьПараметр("Все",  ЭквайрингВыпискаСчетаВсе);

ТЗ = Запрос.Выполнить().Выгрузить(); 
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЭквайрингВыпискаСчета.Добавить();		
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.Контрагент.Наименование;	
	КонецЕсли;		
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	1 КАК ТипДокумента,
                      |	""ГС"" КАК ТипДокументаПредставление,
                      |	ГрупповыеСчета.Ссылка КАК ДокументДолг,
                      |	ГрупповыеСчета.Контрагент КАК Контрагент,
                      |	ВЫБОР
                      |		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ГрупповыеСчета.Контрагент.НаименованиеЮрЛица
                      |		ИНАЧЕ ГрупповыеСчета.Контрагент.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ГрупповыеСчета.СчетГУИД КАК СчетГУИД,
                      |	ГрупповыеСчета.НомерСчета КАК НомерСчета,
                      |	ГрупповыеСчета.ДатаСчета КАК ДатаСчета,
                      |	ЕСТЬNULL(Долги.СуммаДолг, 0) КАК СуммаДолг,
                      |	ЕСТЬNULL(Долги.СуммаКЗакрытию, 0) КАК ОстатокКЗакрытию
                      |ИЗ
                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |			СУММА(ЗаявкиДолги.СуммаДолг) КАК СуммаДолг,
                      |			СУММА(ЗаявкиДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |					СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
                      |					СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
                      |				ИЗ
                      |					Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ГДЕ
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
                      |				
                      |				СГРУППИРОВАТЬ ПО
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ЗаявкиДолги
                      |				ПО ГрупповыеСчетаДокументыДолги.СчетГУИД = ЗаявкиДолги.СчетГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыДолги.Ссылка) КАК Долги
                      |		ПО ГрупповыеСчета.Ссылка = Долги.Ссылка
                      |ГДЕ
                      |	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
                      |	И ГрупповыеСчета.Проведен = ИСТИНА
                      |	И ВЫБОР
                      |			КОГДА &Все
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЕСТЬNULL(Долги.СуммаКЗакрытию, 0) > 0
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ГрупповыеСчета.ДатаСчета >= &ДатаСчетаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ГрупповыеСчета.ДатаСчета <= &ДатаСчетаПо
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &КонтрагентОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ГрупповыеСчета.Контрагент = &КонтрагентОтбор
                      |		КОНЕЦ");


Запрос.УстановитьПараметр("ДатаСчетаС", ЭквайрингВыпискаДатаСчетаС);
Запрос.УстановитьПараметр("ДатаСчетаПо", ЭквайрингВыпискаДатаСчетаПо);
Запрос.УстановитьПараметр("Все",  ЭквайрингВыпискаСчетаВсе);
Запрос.УстановитьПараметр("КонтрагентОтбор",  ЭквайрингВыпискаСчетаКонтрагентОтбор);

ТЗ = Запрос.Выполнить().Выгрузить(); 
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЭквайрингВыпискаСчета.Добавить();		
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.Контрагент.Наименование;	
	КонецЕсли;	
КонецЦикла;

/////
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	2 КАК ТипДокумента,
                      |	""КС"" КАК ТипДокументаПредставление,
                      |	КоворкингСчета.Ссылка КАК ДокументДолг,
                      |	ВЫБОР
                      |		КОГДА КоворкингСчета.КоворкингЗаявка.Оплачивает = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |			ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
                      |		ИНАЧЕ КоворкингСчета.КоворкингЗаявка.Оплачивает
                      |	КОНЕЦ КАК Контрагент,
                      |	КоворкингСчета.СчетГУИД КАК СчетГУИД,
                      |	КоворкингСчета.Номер КАК НомерСчета,
                      |	КоворкингСчета.Дата КАК ДатаСчета,
                      |	КоворкингСчета.Сумма КАК СуммаДолг,
                      |	КоворкингСчета.Сумма - ЕСТЬNULL(Оплаты.СуммаОплачено, 0) КАК ОстатокКЗакрытию
                      |ИЗ
                      |	Документ.КоворкингСчета КАК КоворкингСчета
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КоворкингСчетаДокументыОплаты.Ссылка КАК Ссылка,
                      |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаОплачено
                      |		ИЗ
                      |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КоворкингСчетаДокументыОплаты.Ссылка) КАК Оплаты
                      |		ПО КоворкингСчета.Ссылка = Оплаты.Ссылка
                      |ГДЕ
                      |	КоворкингСчета.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингСчета.Проведен = ИСТИНА
                      |	И ВЫБОР
                      |			КОГДА &Все
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ КоворкингСчета.Сумма - ЕСТЬNULL(Оплаты.СуммаОплачено, 0) > 0
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ КоворкингСчета.Дата >= &ДатаСчетаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаСчетаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ КоворкингСчета.Дата <= &ДатаСчетаПо
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &КонтрагентОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ВЫБОР
                      |					КОГДА КоворкингСчета.КоворкингЗаявка.Оплачивает = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |						ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
                      |					ИНАЧЕ КоворкингСчета.КоворкингЗаявка.Оплачивает
                      |				КОНЕЦ = &КонтрагентОтбор
                      |		КОНЕЦ");


Запрос.УстановитьПараметр("ДатаСчетаС", ЭквайрингВыпискаДатаСчетаС);
Запрос.УстановитьПараметр("ДатаСчетаПо", ЭквайрингВыпискаДатаСчетаПо);
Запрос.УстановитьПараметр("Все",  ЭквайрингВыпискаСчетаВсе);
Запрос.УстановитьПараметр("КонтрагентОтбор",  ЭквайрингВыпискаСчетаКонтрагентОтбор);

ТЗ = Запрос.Выполнить().Выгрузить(); 
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЭквайрингВыпискаСчета.Добавить();		
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если Строка.Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда
		НаименованиеЮрЛица = Строка.Контрагент.НаименованиеЮрЛица;
		Если ЗначениеЗаполнено(НаименованиеЮрЛица) Тогда
			НоваяСтрока.КонтрагентНаименование = НаименованиеЮрЛица;
		Иначе	
			НоваяСтрока.КонтрагентНаименование = Строка.Контрагент.Наименование;
		КонецЕсли;
	Иначе
		НоваяСтрока.КонтрагентНаименование = Строка.Контрагент.Наименование;
	КонецЕсли;
КонецЦикла;

ЭквайрингВыпискаСчета.Сортировать("Контрагент, ТипДокумента, ДокументДолг, НомерСчета, ОстатокКЗакрытию УБЫВ");	

ЭквайрингВыпискаСчетаОтмеченоИтого = 0;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЭквайрингВыпискаСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыпискаСчетаПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыпискаСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если ВыбраннаяСтрока = Неопределено Тогда Возврат; КонецЕсли;

ТД = ЭквайрингВыпискаСчета.НайтиПоИдентификатору(ВыбраннаяСтрока);
ОплатыОбщееКлиент.ОткрытьДокументДолг(ЭтаФорма, ТД.ДокументДолг, Истина, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры
//

&НаКлиенте
Процедура ЭквайрингВыпискаСчетаОтметкаПриИзменении(Элемент)
ЭквайрингВыпискаСчетаТекущаяСтрока = Элементы.ЭквайрингВыпискаСчета.ТекущаяСтрока;
Если ЭквайрингВыпискаСчетаТекущаяСтрока = Неопределено Тогда Возврат; КонецЕсли;
ЭквайрингВыпискаСчетаТекущиеДанные = ЭквайрингВыпискаСчета.НайтиПоИдентификатору(ЭквайрингВыпискаСчетаТекущаяСтрока);
	
ЭквайрингВыгрузкаПлатежиТекущаяСтрока = Элементы.ЭквайрингВыгрузкаПлатежи.ТекущаяСтрока;
Если ЭквайрингВыгрузкаПлатежиТекущаяСтрока = Неопределено Тогда 
	ЭквайрингВыпискаСчетаТекущиеДанные.Отметка = Ложь;
	
	Возврат; 
КонецЕсли;
ЭквайрингПлатежиТекущиеДанные = ЭквайрингВыгрузкаПлатежи.НайтиПоИдентификатору(ЭквайрингВыгрузкаПлатежиТекущаяСтрока);

Если ЭквайрингПлатежиТекущиеДанные.ПолучательПлатежа <> ПолучательПлатежа_Смешанный 
И ЭквайрингПлатежиТекущиеДанные.ПолучательПлатежа <> ПолучательПлатежа_Константа Тогда 
	ЭквайрингВыпискаСчетаТекущиеДанные.Отметка = Ложь;
	
	Возврат; 	
КонецЕсли;

Если ЭквайрингПлатежиТекущиеДанные.ОстатокПлатежа = 0 Тогда 
	ЭквайрингВыпискаСчетаТекущиеДанные.Отметка = Ложь;
	
	Возврат; 
КонецЕсли;

//ТекстОшибки = КонтрагентыНеРавныТекстОшибки(ВыпискаОплатыТекущиеДанные.ДокументОплаты, ВыпискаСчетаТекущиеДанные.Контрагент);
//Если ТекстОшибки <> ""  Тогда 
//	//ТекстОшибки = "Контрагент в документе оплаты не равен контрагенту в счете";
//	ПоказатьПредупреждение(, ТекстОшибки); 

//	Элементы.ВыпискаСчета.ТекущиеДанные.Отметка = Ложь; 
//КонецЕсли;

Если ЭквайрингВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию = 0 Тогда 
	ЭквайрингВыпискаСчетаТекущиеДанные.Отметка = Ложь;	
	
	Возврат;	
КонецЕсли;

Если ЭквайрингВыпискаСчетаТекущиеДанные.Отметка Тогда
	ЭквайрингВыпискаСчетаОтмеченоИтого = ЭквайрингВыпискаСчетаОтмеченоИтого + ЭквайрингВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию; 
Иначе
	ЭквайрингВыпискаСчетаОтмеченоИтого = ЭквайрингВыпискаСчетаОтмеченоИтого - ЭквайрингВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию; 
КонецЕсли;
КонецПроцедуры


//// - ЭквайрингСчета


//// + Эквайринг Связи

//
&НаКлиенте
Процедура ЭквайрингСвязиЗагрузить(Команда)
	ЭквайрингСвязиЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭквайрингСвязиЗагрузитьНаСервере()
ЭквайрингВыпискаСвязиОплатыСчета.Очистить();

ЭквайрингПлатежиТекущаяСтрока = Элементы.ЭквайрингВыгрузкаПлатежи.ТекущаяСтрока;
Если ЭквайрингПлатежиТекущаяСтрока = Неопределено Тогда Возврат; КонецЕсли;

ТД = ЭквайрингВыгрузкаПлатежи.НайтиПоИдентификатору(ЭквайрингПлатежиТекущаяСтрока);
ГУИДЗагрузка = ТД.ГУИД;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанкаДолгиОплата.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг КАК ДокументДолг,
                      |	ДолгиОплаты.НомерСчета КАК НомерСчета,
                      |	ДолгиОплаты.ДатаСчета КАК ДатаСчета,
                      |	ДолгиОплаты.СчетГУИД КАК СчетГУИД,
                      |	ДолгиОплаты.СуммаОплаты КАК СуммаРаспределено
                      |ИЗ
                      |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			РаспределениеОплатСумма.ДокументОплаты КАК ДокументОплаты,
                      |			ЗаявкаНаБронированиеСчета.Ссылка КАК ДокументДолг,
                      |			ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |			ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                      |			ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                      |			СУММА(РаспределениеОплатСумма.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			(ВЫБРАТЬ
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
                      |			ИЗ
                      |				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |			
                      |			СГРУППИРОВАТЬ ПО
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК РаспределениеОплатСумма
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |				ПО РаспределениеОплатСумма.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
                      |					И РаспределениеОплатСумма.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчета.НомерСчета,
                      |			ЗаявкаНаБронированиеСчета.ДатаСчета,
                      |			ЗаявкаНаБронированиеСчета.СчетГУИД,
                      |			РаспределениеОплатСумма.ДокументОплаты,
                      |			ЗаявкаНаБронированиеСчета.Ссылка) КАК ДолгиОплаты
                      |		ПО ВыпискаБанкаДолгиОплата.Ссылка = ДолгиОплаты.ДокументОплаты
                      |			И ВыпискаБанкаДолгиОплата.ДокументДолг = ДолгиОплаты.ДокументДолг
                      |			И ВыпискаБанкаДолгиОплата.СчетГУИД = ДолгиОплаты.СчетГУИД
                      |ГДЕ
                      |	ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанкаДолгиОплата.Ссылка.ГУИДЗагрузка = &ГУИДЗагрузка");

Запрос.УстановитьПараметр("ГУИДЗагрузка", ГУИДЗагрузка);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЭквайрингВыпискаСвязиОплатыСчета.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.ГУИД = ГУИДЗагрузка;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанкаДолгиОплата.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг КАК ДокументДолг,
                      |	ВыпискаБанкаДолгиОплата.СчетГУИД КАК СчетГУИД,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг.НомерСчета КАК НомерСчета,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг.ДатаСчета КАК ДатаСчета,
                      |	РаспределениеОплат.СуммаОплаты КАК СуммаРаспределено
                      |ИЗ
                      |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаРаспределениеОплат.Ссылка КАК ДокументДолг,
                      |			ГрупповыеСчетаРаспределениеОплат.ДокументОплаты КАК ДокументОплаты,
                      |			СУММА(ГрупповыеСчетаРаспределениеОплат.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.РаспределениеОплат КАК ГрупповыеСчетаРаспределениеОплат
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаРаспределениеОплат.Ссылка,
                      |			ГрупповыеСчетаРаспределениеОплат.ДокументОплаты) КАК РаспределениеОплат
                      |		ПО ВыпискаБанкаДолгиОплата.Ссылка = РаспределениеОплат.ДокументОплаты
                      |			И ВыпискаБанкаДолгиОплата.ДокументДолг = РаспределениеОплат.ДокументДолг
                      |			И ВыпискаБанкаДолгиОплата.СчетГУИД = РаспределениеОплат.ДокументДолг.СчетГУИД
                      |ГДЕ
                      |	ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанкаДолгиОплата.Ссылка.ГУИДЗагрузка = &ГУИДЗагрузка");

Запрос.УстановитьПараметр("ГУИДЗагрузка", ГУИДЗагрузка);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЭквайрингВыпискаСвязиОплатыСчета.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.ГУИД = ГУИДЗагрузка;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанкаДолгиОплата.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг КАК ДокументДолг,
                      |	ДолгиОплаты.ДокументДолг.Номер КАК НомерСчета,
                      |	ДолгиОплаты.ДокументДолг.Дата КАК ДатаСчета,
                      |	ДолгиОплаты.ДокументДолг.СчетГУИД КАК СчетГУИД,
                      |	ДолгиОплаты.СуммаРаспределено КАК СуммаРаспределено
                      |ИЗ
                      |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КоворкингСчетаДокументыОплаты.Ссылка КАК ДокументДолг,
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                      |		ИЗ
                      |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КоворкингСчетаДокументыОплаты.Ссылка,
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты) КАК ДолгиОплаты
                      |		ПО ВыпискаБанкаДолгиОплата.Ссылка = ДолгиОплаты.ДокументОплаты
                      |			И ВыпискаБанкаДолгиОплата.ДокументДолг = ДолгиОплаты.ДокументДолг
                      |ГДЕ
                      |	ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанкаДолгиОплата.Ссылка.ГУИДЗагрузка = &ГУИДЗагрузка");


Запрос.УстановитьПараметр("ГУИДЗагрузка", ГУИДЗагрузка);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЭквайрингВыпискаСвязиОплатыСчета.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.ГУИД = ГУИДЗагрузка;
КонецЦикла;

ЭквайрингВыпискаСвязиОплатыСчета.Сортировать("ДокументОплаты, ДокументДолг, ДатаСчета, СуммаРаспределено УБЫВ");

ЭквайрингВыпискаСчетаОтмеченоИтого = 0;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЭквайрингВыпискаСвязиОплатыСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыпискаСвязиОплатыСчетаПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыпискаСвязиОплатыСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = ЭквайрингВыпискаСвязиОплатыСчета.НайтиПоИдентификатору(ВыбраннаяСтрока);	
Если Поле.Имя = "ЭквайрингВыпискаСвязиОплатыСчетаДокументОплаты" Тогда 
	ПоказатьЗначение(, ТД.ДокументОплаты); 
ИначеЕсли Поле.Имя = "ЭквайрингВыпискаСвязиОплатыСчетаДокументДолг" Тогда 
	ПоказатьЗначение(, ТД.ДокументДолг); 
КонецЕсли;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЭквайрингСвязатьОплатуСчет(Команда)
ЭквайрингСвязатьОплатуСчетНаСервере();
КонецПроцедуры

&НаСервере
Функция ЭквайрингСвязатьОплатуСчетНаСервере()
Результат = Новый Структура("КодОшибки, ТекстОшибки", 0 , "");	

ЭквайрингВыгрузкаПлатежиТекущаяСтрока = Элементы.ЭквайрингВыгрузкаПлатежи.ТекущаяСтрока;
Если ЭквайрингВыгрузкаПлатежиТекущаяСтрока = Неопределено Тогда Возврат Неопределено; КонецЕсли;
ЭквайрингВыгрузкаПлатежиТекущиеДанные = ЭквайрингВыгрузкаПлатежи.НайтиПоИдентификатору(ЭквайрингВыгрузкаПлатежиТекущаяСтрока);

Если ЭквайрингВыгрузкаПлатежиТекущиеДанные.ПолучательПлатежа <> ПолучательПлатежа_Смешанный 
И ЭквайрингВыгрузкаПлатежиТекущиеДанные.ПолучательПлатежа <> ПолучательПлатежа_Константа Тогда 
	Возврат Неопределено; 	
КонецЕсли;

Для Каждого ЭквайрингВыпискаСчетаТекущиеДанные Из ЭквайрингВыпискаСчета Цикл
	Если НЕ ЭквайрингВыпискаСчетаТекущиеДанные.Отметка Тогда Продолжить; КонецЕсли;

	ЭквайрингВыпискаСчетаТекущиеДанные.Отметка = Ложь;
	
	Если ЭквайрингВыгрузкаПлатежиТекущиеДанные.ОстатокПлатежа = 0 Тогда Прервать; КонецЕсли;	

	Если ЭквайрингВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию = 0 Тогда Продолжить; КонецЕсли;
	
	Если ЭквайрингВыгрузкаПлатежиТекущиеДанные.ПолучательПлатежа = ПолучательПлатежа_Смешанный Тогда
		ОтборСтроки = Новый Структура("ПолучательПлатежаЗначениеСпискаВыбора", ПолучательПлатежа_Константа);
		НайденыеСтроки = БезналНастройкиРаспределениеПлатежей.НайтиСтроки(ОтборСтроки);
		СтрокаРаспределениеПлатежей = НайденыеСтроки[0];
		
		ОстатокПлатежа = ЭквайрингВыгрузкаПлатежиТекущиеДанные[СтрокаРаспределениеПлатежей.ИмяРеквизитаФормы]
			- ЭквайрингВыгрузкаПлатежиТекущиеДанные.СуммаВыписки - ЭквайрингВыгрузкаПлатежиТекущиеДанные.СуммаАннулировано ;

	Иначе  
		ОстатокПлатежа = ЭквайрингВыгрузкаПлатежиТекущиеДанные.ОстатокПлатежа; 
	КонецЕсли;
	
	Если ОстатокПлатежа >= ЭквайрингВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию Тогда 
		СуммаРаспределено = ЭквайрингВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию;
		ЭквайрингВыгрузкаПлатежиТекущиеДанные.ОстатокПлатежа = ЭквайрингВыгрузкаПлатежиТекущиеДанные.ОстатокПлатежа - СуммаРаспределено;
		ЭквайрингВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию = 0;
	Иначе	
		СуммаРаспределено = ОстатокПлатежа;
		ЭквайрингВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию = ЭквайрингВыпискаСчетаТекущиеДанные.ОстатокКЗакрытию - СуммаРаспределено;
		ЭквайрингВыгрузкаПлатежиТекущиеДанные.ОстатокПлатежа = 0;
	КонецЕсли;
	
	ЭквайрингВыгрузкаПлатежиТекущиеДанные.СуммаВыписки = ЭквайрингВыгрузкаПлатежиТекущиеДанные.СуммаВыписки + СуммаРаспределено;
	
	// + ПСН 2024.04.03
	ЭквайрингВыгрузкаПлатежиТекущиеДанные.ОстатокВыписки = ЭквайрингВыгрузкаПлатежиТекущиеДанные.ОстатокВыписки - СуммаРаспределено;
	// - ПСН 2024.04.03
	
	СуммаРаспределено_П = СуммаРаспределено;
	ДокументОплаты = ЭквайрингЗаполнитьДокументДолгДокументОплаты(ЭквайрингВыгрузкаПлатежиТекущиеДанные
		, ЭквайрингВыпискаСчетаТекущиеДанные, СуммаРаспределено_П);
	
	НоваяСвязь = ЭквайрингВыпискаСвязиОплатыСчета.Добавить();
	НоваяСвязь.ДокументОплаты = ДокументОплаты;
	НоваяСвязь.ДокументДолг = ЭквайрингВыпискаСчетаТекущиеДанные.ДокументДолг;
	НоваяСвязь.СчетГУИД = ЭквайрингВыпискаСчетаТекущиеДанные.СчетГУИД;
	НоваяСвязь.НомерСчета = ЭквайрингВыпискаСчетаТекущиеДанные.НомерСчета;
	НоваяСвязь.ДатаСчета = ЭквайрингВыпискаСчетаТекущиеДанные.ДатаСчета;
	НоваяСвязь.СуммаРаспределено = СуммаРаспределено;
	
	НоваяСвязь.ГУИД = ЭквайрингВыгрузкаПлатежиТекущиеДанные.ГУИД;
КонецЦикла;
	
ЭквайрингВыпискаСчетаОтмеченоИтого = 0;

Возврат Результат; 
КонецФункции

&НаСервере
Функция ЭквайрингЗаполнитьДокументДолгДокументОплаты(ЭквайрингВыгрузкаПлатежиТекущиеДанные
	, ЭквайрингВыпискаСчетаТекущиеДанные, СуммаРаспределено)
	
НачатьТранзакцию();
	
ДокументДолг = ЭквайрингВыпискаСчетаТекущиеДанные.ДокументДолг;
СчетГУИД = ЭквайрингВыпискаСчетаТекущиеДанные.СчетГУИД;
		
// + Выписка
ВыпискаОбъект = Документы.ВыпискаБанка.СоздатьДокумент();	
ВыпискаОбъект.Дата = ТекущаяДата();
ВыпискаОбъект.Приход = Истина;

ВыпискаОбъект.ДатаОплаты = ЭквайрингВыгрузкаПлатежиТекущиеДанные.ДатаПлатежа;

ВыпискаОбъект.ОтКого = ЭквайрингВыпискаСчетаТекущиеДанные.Контрагент;

ВыпискаОбъект.Сумма = СуммаРаспределено;

ВыпискаОбъект.ТекстПлатежа = "Эквайринг. " + ЭквайрингВыгрузкаПлатежиТекущиеДанные.ТекстПлатежа;
ВыпискаОбъект.ЭтоЭквайринг = Истина;

ВыпискаОбъект.ГУИДЗагрузка = ЭквайрингВыгрузкаПлатежиТекущиеДанные.ГУИД;
ВыпискаОбъект.ГУИДИсточникЗагрузка = ЭквайрингВыгрузкаПлатежиТекущиеДанные.ГУИДИсточникаСтрока;

ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
// -Выписка

ДокументОплаты = ВыпискаОбъект.Ссылка;

ЗаполнитьДокументДолгДокументОплаты(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено);

ЗафиксироватьТранзакцию();

Возврат ДокументОплаты;
КонецФункции
//

//
&НаКлиенте
Процедура ЭквайрингВыпискаСвязиУдалить(Команда)
ЭквайрингВыпискаСвязиУдалитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭквайрингВыпискаСвязиУдалитьНаСервере()
НачатьТранзакцию();

МассивКУдалению = Новый Массив;
Для Каждого ТекущиеДанныеЭквайрингСвязиОплатыСчета Из ЭквайрингВыпискаСвязиОплатыСчета Цикл
	Если НЕ ТекущиеДанныеЭквайрингСвязиОплатыСчета.Отметка Тогда Продолжить; КонецЕсли;
	
	ДокументОплаты = ТекущиеДанныеЭквайрингСвязиОплатыСчета.ДокументОплаты;
	ДокументДолг = ТекущиеДанныеЭквайрингСвязиОплатыСчета.ДокументДолг;
	СчетГУИД = ТекущиеДанныеЭквайрингСвязиОплатыСчета.СчетГУИД;
	СуммаРаспределено = ТекущиеДанныеЭквайрингСвязиОплатыСчета.СуммаРаспределено;

	ОтборСтроки = Новый Структура("ГУИД", ТекущиеДанныеЭквайрингСвязиОплатыСчета.ГУИД);	
	НайденныеСтроки = ЭквайрингВыгрузкаПлатежи.НайтиСтроки(ОтборСтроки);	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ТекущиеДанныеПлатежи = НайденныеСтроки[0];
		ТекущиеДанныеПлатежи.ОстатокПлатежа = ТекущиеДанныеПлатежи.ОстатокПлатежа + СуммаРаспределено; 
		
		ТекущиеДанныеПлатежи.СуммаВыписки = ТекущиеДанныеПлатежи.СуммаВыписки - СуммаРаспределено; 
		
		// + ПСН 2024.04.03
		ТекущиеДанныеПлатежи.ОстатокВыписки = ТекущиеДанныеПлатежи.ОстатокВыписки + СуммаРаспределено; 
		// - ПСН 2024.04.03
	КонецЕсли;

	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);	
	НайденныеСтроки = ЭквайрингВыпискаСчета.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ТекущиеДанныеСчета = НайденныеСтроки[0];
		ТекущиеДанныеСчета.ОстатокКЗакрытию = ТекущиеДанныеСчета.ОстатокКЗакрытию + СуммаРаспределено; 
	КонецЕсли;

	ЭквайрингУдалитьДокументОплатыВДокументДолг(ДокументОплаты, ДокументДолг, СчетГУИД);

	МассивКУдалению.Добавить(ТекущиеДанныеЭквайрингСвязиОплатыСчета);
КонецЦикла;	

Для Каждого Элемент Из МассивКУдалению Цикл
	ЭквайрингВыпискаСвязиОплатыСчета.Удалить(Элемент);
КонецЦикла;

ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере
Функция ЭквайрингУдалитьДокументОплатыВДокументДолг(ДокументОплаты, ДокументДолг, СчетГУИД)
УдалитьДокументОплатыВДокументДолг(ДокументОплаты, ДокументДолг, СчетГУИД);

ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
ДокументОплатыОбъект.Удалить();
КонецФункции
//
//// - Эквайринг Связи
////// +  Эквайринг


&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
Если ТекущаяСтраница.Имя = "ГруппаСтраницаВыгрузкаПлатежиВыписка" Тогда
	ВыгрузкаПлатежиГУИД_Предыдущий = ВыгрузкаПлатежиГУИД_Текущий;	
	ВыгрузкаЗагрузитьПлатежи(Неопределено);
	
	Если ЗначениеЗаполнено(ВыгрузкаПлатежиГУИД_Предыдущий) Тогда
		ОтборСтроки = Новый Структура("ГУИД", ВыгрузкаПлатежиГУИД_Предыдущий);	
		НайденныеСтроки = ВыгрузкаПлатежи.НайтиСтроки(ОтборСтроки);		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
			Элементы.ВыгрузкаПлатежи.ТекущаяСтрока = ТекущаяСтрока;			
		КонецЕсли;
	КонецЕсли;

ИначеЕсли ТекущаяСтраница.Имя = "ГруппаЭквайринг" Тогда
	ЭквайрингВыгрузкаПлатежиГУИД_Предыдущий = ЭквайрингВыгрузкаПлатежиГУИД_Текущий;	
	ЭквайрингВыгрузкаПлатежиЗагрузитьПлатежи(Неопределено);
	
	Если ЗначениеЗаполнено(ЭквайрингВыгрузкаПлатежиГУИД_Предыдущий) Тогда
		ОтборСтроки = Новый Структура("ГУИД", ЭквайрингВыгрузкаПлатежиГУИД_Предыдущий);	
		НайденныеСтроки = ЭквайрингВыгрузкаПлатежи.НайтиСтроки(ОтборСтроки);		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
			Элементы.ЭквайрингВыгрузкаПлатежи.ТекущаяСтрока = ТекущаяСтрока;			
		КонецЕсли;
	КонецЕсли;
	
ИначеЕсли ТекущаяСтраница.Имя = "ГруппаСтраницаВыпискаОплатыСчета" Тогда
	ВыпискаОплатыДокументОплаты_Предыдущий = ВыпискаОплатыДокументОплаты_Текущий;	
	ВыпискаОплатыЗагрузить(Неопределено);
	
	Если ЗначениеЗаполненоСервер(ВыпискаОплатыДокументОплаты_Предыдущий) Тогда
		ОтборСтроки = Новый Структура("ДокументОплаты", ВыпискаОплатыДокументОплаты_Предыдущий);	
		НайденныеСтроки = ВыпискаОплаты.НайтиСтроки(ОтборСтроки);		
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
			Элементы.ВыпискаОплаты.ТекущаяСтрока = ТекущаяСтрока;			
		КонецЕсли;
	КонецЕсли;	
КонецЕсли;
КонецПроцедуры

Функция ЗначениеЗаполненоСервер(Значение)
Возврат ЗначениеЗаполнено(Значение);	
КонецФункции
////// + Внешние Отчеты
&НаКлиенте
Процедура ОтчетВыписка(Команда)
ОткрытьФорму("Обработка.ОтчетВыписка.Форма.Форма", , ЭтаФорма,
	,,,, РежимОткрытияОкнаФормы.Независимый);	
КонецПроцедуры
////// - Внешние Отчеты

////// +++++++++++++++++++++++++++++++++++++


// ++++++++++++++++++++++++++++++++++++++++++++++++



////// + Отчет

&НаКлиенте
Процедура ОтчетОплатыДолгиСформировать(Команда)
ОтчетОплатыДолгиСформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтчетОплатыДолгиСформироватьНаСервере()
ЗаполнитьОтчетТаблица();

ОтчетПоле.Очистить();
ОтчетПоле.ФиксацияСверху = 1;
ОтчетПоле.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ОтчетПоле.ОтображатьСетку = Истина;

Макет =  ПолучитьОбщийМакет("БезналРаспределение");

Шапка = Макет.ПолучитьОбласть("Шапка");
ОтчетПоле.Вывести(Шапка);
	
ДатаСвертка = '00010101';
ДокументОплаты_П = Неопределено;
Счетчик = 0;
Для Каждого СтрокаТаблица Из ОтчетТаблица Цикл
	Если НачалоДня(СтрокаТаблица.ДатаОплаты) <> ДатаСвертка Тогда  
		ОтчетПоле.ЗакончитьАвтогруппировкуСтрок();
		
		ОтчетПоле.НачатьАвтогруппировкуСтрок();
		
		СтрокаОтчета = Макет.ПолучитьОбласть("СтрокаЗаголовок");
		СтрокаОтчета.Параметры.ДатаОплаты = Формат(СтрокаТаблица.ДатаОплаты, "ДФ=dd.MM.yy"); 
		
		ИтогСуммаВыпискиДата = ИтогСуммаВыпискиДата(СтрокаТаблица.ДатаОплаты, Счетчик);
		СтрокаОтчета.Параметры.СуммаВыписки = ИтогСуммаВыпискиДата;  
		
		ОтчетПоле.Вывести(СтрокаОтчета, 1);
		
		ДатаСвертка = НачалоДня(СтрокаТаблица.ДатаОплаты);
	КонецЕсли;
	
	СтрокаОтчета = Макет.ПолучитьОбласть("Строка");
	СтрокаОтчета.Параметры.ДатаОплаты = Формат(СтрокаТаблица.ДатаОплаты, "ДФ=dd.MM.yy"); 
	СтрокаОтчета.Параметры.Контрагент = СтрокаТаблица.Контрагент; 
	//СтрокаОтчета.Параметры.ВыпискаДокумент = СтрокаТаблица.ДокументОплаты; 
	СтрокаОтчета.Параметры.ВыпискаДокумент = ДокументПредставление(СтрокаТаблица.ДокументОплаты); 
	СтрокаОтчета.Параметры.СуммаВыписки = СтрокаТаблица.ДокументОплаты.Сумма;   

	Если СтрокаТаблица.ДокументОплаты <> ДокументОплаты_П Тогда
		ДокументОплаты_П = СтрокаТаблица.ДокументОплаты;  
		ИтогВыпискаДокументОплаты = ИтогВыпискаДокументОплаты(СтрокаТаблица.ДокументОплаты, Счетчик);
		СуммаОстатокВыписки = СтрокаТаблица.ДокументОплаты.Сумма - ИтогВыпискаДокументОплаты;
		СтрокаОтчета.Параметры.СуммаОстатокВыписки = СуммаОстатокВыписки;
	КонецЕсли;	
		
//	СтрокаОтчета.Параметры.ДокументДолг = СтрокаТаблица.ДокументДолг; 
	СтрокаОтчета.Параметры.ДокументДолг = ДокументПредставление(СтрокаТаблица.ДокументДолг); 
	
	СтрокаОтчета.Параметры.НомерСчета = СтрокаТаблица.НомерСчета; 
	СтрокаОтчета.Параметры.ДатаСчета = Формат(СтрокаТаблица.ДатаСчета, "ДФ=dd.MM.yy"); 
	СтрокаОтчета.Параметры.СуммаРаспределено = СтрокаТаблица.СуммаОплаты; 
	
	Если ТипЗнч(СтрокаТаблица.ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
		СтрокаОтчета.Параметры.НомерВРезерв = СтрокаТаблица.ДокументДолг.НомерВРезерв; 
		СтрокаОтчета.Параметры.ДатаРезерваС = Формат(СтрокаТаблица.ДокументДолг.РезервС, "ДФ=dd.MM.yy"); 
	КонецЕсли;
	
	СтрокаОтчета.Параметры.ДокументДолгРасшифровка = СтрокаТаблица.ДокументДолг; 
	
	ОтчетПоле.Вывести(СтрокаОтчета, 2);
	
	Счетчик = Счетчик + 1;
КонецЦикла;

ОтчетПоле.ЗакончитьАвтогруппировкуСтрок();
КонецПроцедуры

&НаСервере
Функция ДокументПредставление(Документ)
ДокументПредставление = ПечатьСервер.ДокументПредставление(Документ); 	
Возврат ДокументПредставление;	
КонецФункции

&НаСервере
Функция ИтогСуммаВыпискиДата(ДатаИтога, Знач Счетчик)
ИтогСуммаВыпискиДата = 0;	

ДокументОплаты_П = Неопределено;
Пока Счетчик < ОтчетТаблица.Количество() Цикл
//Для Каждого Строка Из ОтчетТаблица Цикл
	Строка = ОтчетТаблица[Счетчик]; 
	//Если НачалоДня(Строка.ДатаОплаты) < ДатаИтога Тогда Продолжить; КонецЕсли;
	Если НачалоДня(Строка.ДатаОплаты) > ДатаИтога Тогда Прервать; КонецЕсли;
	
	Если Строка.ДокументОплаты <> ДокументОплаты_П Тогда
		ДокументОплаты_П = Строка.ДокументОплаты;
		ИтогСуммаВыпискиДата = ИтогСуммаВыпискиДата + Строка.ДокументОплаты.Сумма;	
	КонецЕсли;		
	
 	Счетчик	=  Счетчик + 1;
КонецЦикла;

Возврат ИтогСуммаВыпискиДата;
КонецФункции

&НаСервере
Функция ИтогВыпискаДокументОплаты(ДокументОплаты, Знач Счетчик)
ИтогВыпискаДокументОплаты = 0;	

Пока Счетчик < ОтчетТаблица.Количество() Цикл
//Для Каждого Строка Из ОтчетТаблица Цикл
	Строка = ОтчетТаблица[Счетчик]; 
	//Если НачалоДня(Строка.ДатаОплаты) < ДатаИтога Тогда Продолжить; КонецЕсли;
	Если Строка.ДокументОплаты <> ДокументОплаты Тогда Прервать; КонецЕсли;
	
	ИтогВыпискаДокументОплаты = ИтогВыпискаДокументОплаты + Строка.СуммаОплаты;	
	
 	Счетчик	=  Счетчик + 1;
КонецЦикла;

Возврат ИтогВыпискаДокументОплаты;
КонецФункции

&НаСервере
Процедура ЗаполнитьОтчетТаблица()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Дата КАК Дата,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.ОтКого КАК Контрагент,
                      |	ВыпискаБанка.Сумма КАК Сумма,
                      |	ЗаявкиСчета.Ссылка КАК ДокументДолг,
                      |	ЗаявкиСчета.НомерСчета КАК НомерСчета,
                      |	ЗаявкиСчета.ДатаСчета КАК ДатаСчета,
                      |	ЗаявкиСчета.СуммаОплаты КАК СуммаОплаты,
                      |	ИСТИНА КАК ДокументДолгЗаполнен
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаРаспределениеОплат.Ссылка КАК Ссылка,
                      |			ЗаявкаРаспределениеОплат.СчетГУИД КАК СчетГУИД,
                      |			ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                      |			ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                      |			ЗаявкаРаспределениеОплат.ДокументОплаты КАК ДокументОплаты,
                      |			ЗаявкаРаспределениеОплат.СуммаОплаты КАК СуммаОплаты
                      |		ИЗ
                      |			(ВЫБРАТЬ
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |				СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
                      |			ИЗ
                      |				Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |			
                      |			СГРУППИРОВАТЬ ПО
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД,
                      |				ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) КАК ЗаявкаРаспределениеОплат
                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |				ПО ЗаявкаРаспределениеОплат.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
                      |					И ЗаявкаРаспределениеОплат.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)) КАК ЗаявкиСчета
                      |		ПО ВыпискаБанка.Ссылка = ЗаявкиСчета.ДокументОплаты
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкиСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА &ДатаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ НАЧАЛОПЕРИОДА(ВыпискаБанка.Дата, ДЕНЬ) >= &ДатаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ НАЧАЛОПЕРИОДА(ВыпискаБанка.Дата, ДЕНЬ) <= &ДатаПо
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &КонтрагентОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ВыпискаБанка.ОтКого = &КонтрагентОтбор
                      |		КОНЕЦ");	

Запрос.УстановитьПараметр("ДатаС", ОтчетДатаС); 
Запрос.УстановитьПараметр("ДатаПо", ОтчетДатаПо); 
Запрос.УстановитьПараметр("КонтрагентОтбор", ОтчетКонтрагентОтбор); 

ТЗ = Запрос.Выполнить().Выгрузить();
ОтчетТаблица.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ОтчетТаблица.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Дата КАК Дата,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.ОтКого КАК Контрагент,
                      |	ВыпискаБанка.Сумма КАК Сумма,
                      |	ГрупповыеСчета.Ссылка КАК ДокументДолг,
                      |	ГрупповыеСчета.Ссылка.НомерСчета КАК НомерСчета,
                      |	ГрупповыеСчета.Ссылка.ДатаСчета КАК ДатаСчета,
                      |	ГрупповыеСчета.СуммаОплаты КАК СуммаОплаты,
                      |	ИСТИНА КАК ДокументДолгЗаполнен
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыОплаты.Ссылка КАК Ссылка,
                      |			ГрупповыеСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			СУММА(ГрупповыеСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыОплаты КАК ГрупповыеСчетаДокументыОплаты
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыОплаты.Ссылка,
                      |			ГрупповыеСчетаДокументыОплаты.ДокументОплаты) КАК ГрупповыеСчета
                      |		ПО ВыпискаБанка.Ссылка = ГрупповыеСчета.ДокументОплаты
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА &ДатаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ НАЧАЛОПЕРИОДА(ВыпискаБанка.Дата, ДЕНЬ) >= &ДатаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ НАЧАЛОПЕРИОДА(ВыпискаБанка.Дата, ДЕНЬ) <= &ДатаПо
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &КонтрагентОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ВыпискаБанка.ОтКого = &КонтрагентОтбор
                      |		КОНЕЦ");	

Запрос.УстановитьПараметр("ДатаС", ОтчетДатаС); 
Запрос.УстановитьПараметр("ДатаПо", ОтчетДатаПо); 
Запрос.УстановитьПараметр("КонтрагентОтбор", ОтчетКонтрагентОтбор); 

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ОтчетТаблица.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Дата КАК Дата,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.ОтКого КАК Контрагент,
                      |	ВыпискаБанка.Сумма КАК Сумма,
                      |	ЛОЖЬ КАК ДокументДолгЗаполнен
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрупповыеСчета.ДокументыОплаты КАК ГрупповыеСчетаДокументыОплаты
                      |		ПО ВыпискаБанка.Ссылка = ГрупповыеСчетаДокументыОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                      |		ПО ВыпискаБанка.Ссылка = ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА &ДатаС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ НАЧАЛОПЕРИОДА(ВыпискаБанка.ДатаОплаты, ДЕНЬ) >= &ДатаС
                      |		КОНЕЦ
                      |	И ВЫБОР
                      |			КОГДА &ДатаПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ НАЧАЛОПЕРИОДА(ВыпискаБанка.ДатаОплаты, ДЕНЬ) <= &ДатаПо
                      |		КОНЕЦ
                      |	И ГрупповыеСчетаДокументыОплаты.Ссылка ЕСТЬ NULL
                      |	И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка ЕСТЬ NULL
                      |	И ВЫБОР
                      |			КОГДА &КонтрагентОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ВыпискаБанка.ОтКого = &КонтрагентОтбор
                      |		КОНЕЦ");	

Запрос.УстановитьПараметр("ДатаС", ОтчетДатаС); 
Запрос.УстановитьПараметр("ДатаПо", ОтчетДатаПо);
Запрос.УстановитьПараметр("КонтрагентОтбор", ОтчетКонтрагентОтбор); 

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ОтчетТаблица.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

ОтчетТаблица.Сортировать("ДатаОплаты, ДокументДолгЗаполнен УБЫВ, Контрагент , ДокументОплаты, ДокументДолг"); 
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПолеОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
СтандартнаяОбработка = Ложь;	

ОплатыОбщееКлиент.ОткрытьДокументДолг(ЭтаФорма, Расшифровка, Истина, РежимОткрытияОкнаФормы.Независимый); 

//ФормаИмя = "";
//Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
//	ФормаИмя = "Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента";
//ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
//	ФормаИмя = "Документ.ГрупповыеСчета.Форма.ФормаДокумента";
//КонецЕсли;	
//Если ФормаИмя = "" Тогда Возврат; КонецЕсли;

//ПараметрыФормы = Новый Структура;
//ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
//ПараметрыФормы.Вставить("Ключ", Расшифровка);
//	
//ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТЕСТ(Команда)
//Доб();
КонецПроцедуры


//
&НаКлиенте
Процедура ЭквайрингВыгрузкаАннулироватьОстатокПлатежа(Команда)
ЭквайрингВыгрузкаПлатежиТекущиеДанные = Элементы.ЭквайрингВыгрузкаПлатежи.ТекущиеДанные;
	
ОтборСтроки = Новый Структура("ПолучательПлатежаЗначениеСпискаВыбора", ПолучательПлатежа_Константа);
НайденыеСтроки = БезналНастройкиРаспределениеПлатежей.НайтиСтроки(ОтборСтроки);
СтрокаРаспределениеПлатежей = НайденыеСтроки[0];
	
СуммаПлатежа = ЭквайрингВыгрузкаПлатежиТекущиеДанные[СтрокаРаспределениеПлатежей.ИмяРеквизитаФормы];

Если СуммаПлатежа = 0 Тогда
	ПоказатьПредупреждение(, "Платеж не распределен на " + СтрокаРаспределениеПлатежей.ПолучательПлатежа + " 
			|
			|НЕЧЕГО АННУЛИРОВАТЬ ...");
	
	Возврат;
КонецЕсли;

ОстатокПлатежа = ЭквайрингВыгрузкаПлатежиТекущиеДанные.ОстатокПлатежа;

Если ОстатокПлатежа = 0 Тогда
	ПоказатьПредупреждение(, "Остаток Платежа = 0 
			|
			|НЕЧЕГО АННУЛИРОВАТЬ ...");
	
	Возврат;
КонецЕсли;

ЭквайрингВыгрузкаПлатежиТекущаяСтрока = Элементы.ЭквайрингВыгрузкаПлатежи.ТекущаяСтрока;
ЭквайрингВыгрузкаАннулироватьОстатокПлатежаНаСервере(ЭквайрингВыгрузкаПлатежиТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЭквайрингВыгрузкаАннулироватьОстатокПлатежаНаСервере(ЭквайрингВыгрузкаПлатежиТекущаяСтрока)
ТД = ЭквайрингВыгрузкаПлатежи.НайтиПоИдентификатору(ЭквайрингВыгрузкаПлатежиТекущаяСтрока);	
	
ТД.СуммаАннулировано = ТД.ОстатокПлатежа;
ТД.ОстатокПлатежа = 0;

ОбновитьЗаписьБезналСуммаАннулировано(ТД);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписьБезналСуммаАннулировано(ТД)
Запись = РегистрыСведений.БезналЗагрузка.СоздатьМенеджерЗаписи();
Запись.ГУИД = ТД.ГУИД;
Запись.Прочитать();

Запись.ПолучательПлатежа = ТД.ПолучательПлатежа; 

Для Каждого Строка Из БезналНастройкиРаспределениеПлатежей Цикл
	Запись.СуммаАннулировано = ТД.СуммаАннулировано; 
КонецЦикла;

Запись.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЭквайрингВыгрузкаОтменитьАннулированиеОстаткаПлатежа(Команда)
ЭквайрингВыгрузкаПлатежиТекущиеДанные = Элементы.ЭквайрингВыгрузкаПлатежи.ТекущиеДанные;
	
ОтборСтроки = Новый Структура("ПолучательПлатежаЗначениеСпискаВыбора", ПолучательПлатежа_Константа);
НайденыеСтроки = БезналНастройкиРаспределениеПлатежей.НайтиСтроки(ОтборСтроки);
СтрокаРаспределениеПлатежей = НайденыеСтроки[0];
	
СуммаПлатежа = ЭквайрингВыгрузкаПлатежиТекущиеДанные[СтрокаРаспределениеПлатежей.ИмяРеквизитаФормы];

Если СуммаПлатежа = 0 Тогда
	ПоказатьПредупреждение(, "Платеж не распределен на " + СтрокаРаспределениеПлатежей.ПолучательПлатежа + " 
			|
			|НЕЧЕГО ОТМЕНЯТЬ ...");
	
	Возврат;
КонецЕсли;

СуммаАннулировано = ЭквайрингВыгрузкаПлатежиТекущиеДанные.СуммаАннулировано;

Если СуммаАннулировано = 0 Тогда
	ПоказатьПредупреждение(, "Сумма Аннулировано = 0 
			|
			|НЕЧЕГО ОТМЕНЯТЬ ...");
	
	Возврат;
КонецЕсли;

ЭквайрингВыгрузкаПлатежиТекущаяСтрока = Элементы.ЭквайрингВыгрузкаПлатежи.ТекущаяСтрока;
ЭквайрингВыгрузкаОтменитьАннулированиеОстаткаПлатежаНаСервере(ЭквайрингВыгрузкаПлатежиТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЭквайрингВыгрузкаОтменитьАннулированиеОстаткаПлатежаНаСервере(ЭквайрингВыгрузкаПлатежиТекущаяСтрока)
ТД = ЭквайрингВыгрузкаПлатежи.НайтиПоИдентификатору(ЭквайрингВыгрузкаПлатежиТекущаяСтрока);	
	
ТД.ОстатокПлатежа = ТД.СуммаАннулировано;
ТД.СуммаАннулировано = 0;

ОбновитьЗаписьБезналСуммаАннулировано(ТД);
КонецПроцедуры

////// - Отчет













