
Процедура ОбработкаПроведения(Отказ, Режим)

//// регистр МинибарОстатки Расход
Движения.МинибарОстатки.Записывать = Истина;
Для Каждого ТекСтрокаРасход Из Расход Цикл
	Движение = Движения.МинибарОстатки.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = ТекСтрокаРасход.ДатаРасхода;
	Движение.НоменклатураМинибара = ТекСтрокаРасход.Номенклатура;
	Движение.Количество = ТекСтрокаРасход.Количество;
	Движение.ЦенаРасход = ТекСтрокаРасход.Цена;
	Движение.СуммаРасход = ТекСтрокаРасход.Цена * ТекСтрокаРасход.Количество;
КонецЦикла;

// регистр МинибарПартии Расход
Движения.МинибарПартии.Записывать = Истина;        
Для Каждого ТекСтрокаРасход Из Расход Цикл
	ПартииОстатки = ПартииОстатки(ТекСтрокаРасход.ДатаРасхода, ТекСтрокаРасход.Номенклатура);
	
	Для Каждого Строка Из Движения.МинибарПартии Цикл
		ОтборСтроки = Новый Структура("НоменклатураМинибара, ДокументПрихода"
			, Строка.НоменклатураМинибара, Строка.ДокументПрихода);
		НайденныеСтроки = ПартииОстатки.НайтиСтроки(ОтборСтроки);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.КоличествоОстаток = НайденнаяСтрока.КоличествоОстаток - Строка.Количество;				
		КонецЦикла;
	КонецЦикла;
	
	РасходОстаток = ТекСтрокаРасход.Количество;
	Для Каждого Строка Из ПартииОстатки Цикл
		Если Строка.КоличествоОстаток > 0 Тогда
			Движение = Движения.МинибарПартии.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ТекСтрокаРасход.ДатаРасхода;
			Движение.НоменклатураМинибара = ТекСтрокаРасход.Номенклатура;
			Движение.ДокументПрихода = Строка.ДокументПрихода;
			Движение.ЦенаПриход = Строка.ЦенаПриход;
			Движение.ЦенаРасход = ТекСтрокаРасход.Цена;
			
			Если РасходОстаток > Строка.КоличествоОстаток Тогда
				Движение.Количество = Строка.КоличествоОстаток;
				РасходОстаток = РасходОстаток - Строка.КоличествоОстаток;
			Иначе
				Движение.Количество = РасходОстаток;
				РасходОстаток = РасходОстаток - Строка.КоличествоОстаток;
				
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Если РасходОстаток > 0 Тогда
		Движение = Движения.МинибарПартии.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТекСтрокаРасход.ДатаРасхода;
		Движение.НоменклатураМинибара = ТекСтрокаРасход.Номенклатура;
		Движение.ЦенаРасход = ТекСтрокаРасход.Цена;
		Движение.Количество = РасходОстаток;
	КонецЕсли;
КонецЦикла;

КонецПроцедуры

Функция ПартииОстатки(Дата, НоменклатураМинибара)
//Запрос = Новый Запрос("ВЫБРАТЬ
//                      |	МинибарПартииОстатки.ДокументПрихода КАК ДокументПрихода,
//                      |	МинибарПартииОстатки.НоменклатураМинибара КАК НоменклатураМинибара,
//                      |	МинибарПартииОстатки.Количество КАК Количество
//                      |ИЗ
//                      |	РегистрНакопления.МинибарПартии КАК МинибарПартииОстатки
//                      |
//                      |УПОРЯДОЧИТЬ ПО
//                      |	МинибарПартииОстатки.ДокументПрихода.ДатаДокументаПрихода");

//ТЗ_1 = Запрос.Выполнить().Выгрузить();
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарПартииОстатки.ДокументПрихода КАК ДокументПрихода,
                      |	МинибарПартииОстатки.НоменклатураМинибара КАК НоменклатураМинибара,
                      |	МинибарПартииОстатки.КоличествоОстаток КАК КоличествоОстаток,
                      |	МинибарПартииОстатки.ЦенаПриход КАК ЦенаПриход
                      |ИЗ
                      |	РегистрНакопления.МинибарПартии.Остатки(&Дата, НоменклатураМинибара = &НоменклатураМинибара) КАК МинибарПартииОстатки
                      |ГДЕ
                      |	МинибарПартииОстатки.КоличествоОстаток > 0
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	МинибарПартииОстатки.ДокументПрихода.ДатаДокументаПрихода");


Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));	
Запрос.УстановитьПараметр("НоменклатураМинибара", НоменклатураМинибара);

ТЗ = Запрос.Выполнить().Выгрузить();
Возврат ТЗ;
КонецФункции

