//
&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
ПолеОтчета.Очистить();

ОтчетОбъект = РеквизитФормыВЗначение("Отчет");

//Запрос = Новый Запрос("ВЫБРАТЬ
//                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
//                      |	ЕСТЬNULL(ВЫБОР
//                      |			КОГДА ЗаявкаНаБронирование.Клиент.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//                      |				ТОГДА 0
//                      |			ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Клиент.ДатаРождения, &ДатаТек, ГОД)
//                      |		КОНЕЦ, 0) КАК Возраст,
//                      |	ЕСТЬNULL(ВЫБОР
//                      |			КОГДА ЗаявкаНаБронирование.Клиент2.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//                      |				ТОГДА 0
//                      |			ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Клиент2.ДатаРождения, &ДатаТек, ГОД)
//                      |		КОНЕЦ, 0) КАК Возраст2,
//                      |	ЗаявкаНаБронирование.КолВоДней КАК КолВоДней,
//                      |	ИсторияКлиента.КоличествоЗаявка КАК КоличествоЗаявка
//                      |ИЗ
//                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
//                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//                      |			ИсторияКлиента.Клиент КАК Клиент,
//                      |			КОЛИЧЕСТВО(ИсторияКлиента.ЗаявкаГУИД) КАК КоличествоЗаявка
//                      |		ИЗ
//                      |			РегистрСведений.ИсторияКлиента КАК ИсторияКлиента
//                      |		
//                      |		СГРУППИРОВАТЬ ПО
//                      |			ИсторияКлиента.Клиент) КАК ИсторияКлиента
//                      |		ПО ЗаявкаНаБронирование.Клиент = ИсторияКлиента.Клиент
//                      |ГДЕ
//                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
//                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
//                      |	И ЗаявкаНаБронирование.ТипБронирования <> &ТипБронирования
//                      |	И ЗаявкаНаБронирование.Ссылка В
//                      |			(ВЫБРАТЬ
//                      |				ЗанятостьНомеров.Регистратор
//                      |			ИЗ
//                      |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
//                      |			ГДЕ
//                      |				ЗанятостьНомеров.ПериодРезерва > &ДН
//                      |				И ЗанятостьНомеров.ПериодРезерва < &ДК
//                      |				И ЗанятостьНомеров.Зарезервирован = ИСТИНА)
//                      |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
//                      |
//                      |УПОРЯДОЧИТЬ ПО
//                      |	ЗаявкаНаБронирование.ВремяЗаездаТочное");

//					  //|				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
                      |	ЕСТЬNULL(ВЫБОР
                      |			КОГДА ЗаявкаНаБронирование.Клиент.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА 0
                      |			ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Клиент.ДатаРождения, &ДатаТек, ГОД)
                      |		КОНЕЦ, 0) КАК Возраст,
                      |	ЕСТЬNULL(ВЫБОР
                      |			КОГДА ЗаявкаНаБронирование.Клиент2.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
                      |				ТОГДА 0
                      |			ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Клиент2.ДатаРождения, &ДатаТек, ГОД)
                      |		КОНЕЦ, 0) КАК Возраст2,
                      |	ЗаявкаНаБронирование.КолВоДней КАК КолВоДней,
                      |	ИсторияКлиента.КоличествоЗаявка КАК КоличествоЗаявка,
                      |	ИсторияКлиентаПовторноПериод.КоличествоЗаявка КАК КоличествоЗаявкаПовторноПериод
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ИсторияКлиента.Клиент КАК Клиент,
                      |			КОЛИЧЕСТВО(ИсторияКлиента.ЗаявкаГУИД) КАК КоличествоЗаявка
                      |		ИЗ
                      |			РегистрСведений.ИсторияКлиента КАК ИсторияКлиента
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ИсторияКлиента.Клиент) КАК ИсторияКлиента
                      |		ПО ЗаявкаНаБронирование.Клиент = ИсторияКлиента.Клиент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ИсторияКлиента.Клиент КАК Клиент,
                      |			КОЛИЧЕСТВО(ИсторияКлиента.ЗаявкаГУИД) КАК КоличествоЗаявка
                      |		ИЗ
                      |			РегистрСведений.ИсторияКлиента КАК ИсторияКлиента
                      |		ГДЕ
                      |			ИсторияКлиента.РезервС >= &ПовторноС
                      |			И ИсторияКлиента.РезервС <= &ПовторноПо
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ИсторияКлиента.Клиент) КАК ИсторияКлиентаПовторноПериод
                      |		ПО ЗаявкаНаБронирование.Клиент = ИсторияКлиентаПовторноПериод.Клиент
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
                      |	И ЗаявкаНаБронирование.ТипБронирования <> &ТипБронирования
                      |	И ЗаявкаНаБронирование.Ссылка В
                      |			(ВЫБРАТЬ
                      |				ЗанятостьНомеров.Регистратор
                      |			ИЗ
                      |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                      |			ГДЕ
                      |				ЗанятостьНомеров.ПериодРезерва > &ДН
                      |				И ЗанятостьНомеров.ПериодРезерва < &ДК
                      |				И ЗанятостьНомеров.Зарезервирован = ИСТИНА)
                      |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ЗаявкаНаБронирование.ВремяЗаездаТочное");

					  //|				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
					  
					  
Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));						
Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
Запрос.УстановитьПараметр("ДатаТек",НачалоДня(ТекущаяДата()));
Запрос.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));
Запрос.УстановитьПараметр("ТипБронирования",Справочники.ТипБронирования.Ремонт);

Запрос.УстановитьПараметр("ПовторноС", '20250101');
Запрос.УстановитьПараметр("ПовторноПо", '20251231');

ТЗ_Данные = Запрос.Выполнить().Выгрузить();

ЗаполнитьКаналыБронированияИзСправочника();

ЗаполнитьИсточникиБронирования(ТЗ_Данные);

ВозрастИтого = 0; КоличествоВозрастИтого = 0;
КоличествоМужчин = 0; КоличествоЖенщин = 0; КоличествоМужчинЖенщинИтого = 0;

КоличествоПроживанийИтого = 0;
КоличествоСутокВПериодеИтого = 0;
КоличествоЧеловекНочейИтого = 0;
КоличествоНочейРКИтого = 0;

Для Каждого Строка Из ТЗ_Данные Цикл
	
	КоличествоСутокВПериоде = 0;
	Для каждого СтрокаПроживание Из Строка.Ссылка.Проживание Цикл
		Если СтрокаПроживание.ДеньПроживания < Отчет.ДН ИЛИ СтрокаПроживание.ДеньПроживания > Отчет.ДК
		Тогда Продолжить; КонецЕсли;
		
		КоличествоСутокВПериоде = КоличествоСутокВПериоде + СтрокаПроживание.Количество; 
	КонецЦикла;
	КоличествоСутокВПериодеИтого = КоличествоСутокВПериодеИтого + КоличествоСутокВПериоде; 
	Если КоличествоСутокВПериоде > 0 Тогда КоличествоПроживанийИтого = КоличествоПроживанийИтого + 1; КонецЕсли;
	
	КоличествоЧеловекНочей = Строка.Ссылка.КолВоЧеловек * КоличествоСутокВПериоде;  
	КоличествоЧеловекНочейИтого = КоличествоЧеловекНочейИтого + КоличествоЧеловекНочей;  
	
	Если Строка.Возраст <> 0 Тогда
		ВозрастИтого = ВозрастИтого + Строка.Возраст;
	    КоличествоВозрастИтого = КоличествоВозрастИтого + 1;
	КонецЕсли;	
	Если Строка.Возраст2 <> 0 Тогда
		ВозрастИтого = ВозрастИтого + Строка.Возраст2;
	    КоличествоВозрастИтого = КоличествоВозрастИтого + 1;
	КонецЕсли;	

	Если Строка.Ссылка.РаздельныеКровати Тогда
		КоличествоНочейРКИтого = КоличествоНочейРКИтого + КоличествоСутокВПериоде;
	КонецЕсли;

//
	Если КоличествоСутокВПериоде > 0 Тогда
		
		Если Строка.Ссылка.Клиент.Пол = Перечисления.Пол.Мужской Тогда
			КоличествоМужчин = КоличествоМужчин + 1;	
		ИначеЕсли Строка.Ссылка.Клиент.Пол = Перечисления.Пол.Женский Тогда
			КоличествоЖенщин = КоличествоЖенщин + 1;	
		КонецЕсли;
		КоличествоМужчинЖенщинИтого = КоличествоМужчинЖенщинИтого + 1;
		
		Если ЗначениеЗаполнено(Строка.Ссылка.Клиент2) Тогда
			Если Строка.Ссылка.Клиент2.Пол = Перечисления.Пол.Мужской Тогда
				КоличествоМужчин = КоличествоМужчин + 1;	
			ИначеЕсли Строка.Ссылка.Клиент2.Пол = Перечисления.Пол.Женский Тогда
				КоличествоЖенщин = КоличествоЖенщин + 1;	
			КонецЕсли;
			КоличествоМужчинЖенщинИтого = КоличествоМужчинЖенщинИтого + 1;
		КонецЕсли;
		
	//	
		ОтборСтроки = Новый Структура("КаналБронирования", Строка.Ссылка.КаналБронирования);
		НайденныеСтроки = КаналыБронирования.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			НайденнаяСтрока = НайденныеСтроки[0]; 			
			
			НайденнаяСтрока.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний + 1;		
			//НайденнаяСтрока.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей + КоличествоЧеловекНочей;		
			НайденнаяСтрока.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей + КоличествоСутокВПериоде;		
		КонецЕсли;		
	//	
		ВидКлиента = Строка.Ссылка.Бронирует.ВидКлиента; 
		Если ВидКлиента = Справочники.ВидыКлиентов.ИныеАгентства Тогда
			ОтборСтроки = Новый Структура("ЭтоИныеАгентства", Истина);
			НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
			
			Если НайденныеСтроки.Количество() > 0 Тогда 
				НайденнаяСтрока = НайденныеСтроки[0]; 			
				
				НайденнаяСтрока.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний + 1;		
				НайденнаяСтрока.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей + КоличествоСутокВПериоде;	
			КонецЕсли;	
				
		ИначеЕсли ВидКлиента = Справочники.ВидыКлиентов.КорпоративныеКлиенты Тогда
			ОтборСтроки = Новый Структура("ЭтоКорпорат", Истина);
			НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				НайденнаяСтрока = НайденныеСтроки[0]; 			
				
				НайденнаяСтрока.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний + 1;		
				НайденнаяСтрока.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей + КоличествоСутокВПериоде;	
			КонецЕсли;				
				
		ИначеЕсли Строка.Ссылка.КаналБронирования = Справочники.КаналыБронирования.НашCайт Тогда
			ОтборСтроки = Новый Структура("ЭтоНашСайт", Истина);
			НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				НайденнаяСтрока = НайденныеСтроки[0]; 			
				
				НайденнаяСтрока.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний + 1;		
				НайденнаяСтрока.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей + КоличествоСутокВПериоде;	
			КонецЕсли;	
			
		ИначеЕсли ВидКлиента = Справочники.ВидыКлиентов.Частные
		ИЛИ ВидКлиента = Справочники.ВидыКлиентов.Постоянные
		ИЛИ ВидКлиента = Справочники.ВидыКлиентов.Романтики
		ИЛИ ВидКлиента = Справочники.ВидыКлиентов.ПустаяСсылка()
		Тогда
			ОтборСтроки = Новый Структура("ЭтоЧастнаяБронь", Истина);
			НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				НайденнаяСтрока = НайденныеСтроки[0]; 			
				
				НайденнаяСтрока.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний + 1;		
				НайденнаяСтрока.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей + КоличествоСутокВПериоде;	
			КонецЕсли;				
		КонецЕсли;

		ОтборСтроки = Новый Структура("ИсточникБронирования", Строка.Ссылка.Бронирует);
		НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			НайденнаяСтрока = НайденныеСтроки[0]; 
			
			НайденнаяСтрока.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний + 1;		
			НайденнаяСтрока.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей + КоличествоСутокВПериоде;	
		КонецЕсли;	
	КонецЕсли;

КонецЦикла;

МассивКУдалению = Новый Массив;
Для Каждого Строка Из КаналыБронирования Цикл
	Если Строка.КоличествоПроживаний = 0 Тогда
		МассивКУдалению.Добавить(Строка);
	КонецЕсли;
КонецЦикла;

Для Каждого Строка Из МассивКУдалению Цикл
	КаналыБронирования.Удалить(Строка);
КонецЦикла;

МассивКУдалению = Новый Массив;
Для Каждого Строка Из ИсточникиБронирования Цикл
	Если Строка.ЭтоИныеАгентства
	ИЛИ Строка.ЭтоКорпорат
	ИЛИ Строка.ЭтоЧастнаяБронь
	ИЛИ Строка.ЭтоНашСайт
	Тогда Продолжить; КонецЕсли;
	
	Если Строка.КоличествоПроживаний = 0 Тогда
		МассивКУдалению.Добавить(Строка);
	КонецЕсли;
КонецЦикла;

Для Каждого Строка Из МассивКУдалению Цикл
	ИсточникиБронирования.Удалить(Строка);
КонецЦикла;

//Запрос = Новый Запрос("ВЫБРАТЬ
//                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоНомеров
//                      |ИЗ
//                      |	Справочник.НомернойФонд КАК НомернойФонд
//                      |ГДЕ
//                      |	НомернойФонд.ПометкаУдаления = ЛОЖЬ");
//Выборка = Запрос.Выполнить().Выбрать();
//Если Выборка.Следующий() Тогда
//	КоличествоНомеров = Выборка.КоличествоНомеров;
//Иначе
//	КоличествоНомеров = 0;
//КонецЕсли;
//Если КоличествоНомеров = 0 Тогда 
//	СредняяЗаселяемость = 0;
//Иначе
//	СредняяЗаселяемость = Окр(КоличествоЧеловекНочейИтого / КоличествоНомеров, 1);
//КонецЕсли;

МаксимальноеКоличествоГостей = Константы.МаксимальноеКоличествоГостей.Получить();

Если МаксимальноеКоличествоГостей = 0 Тогда
	СредняяЗаселяемость = 0;
Иначе
	 
	КоличествоДнейВПериоде = (НачалоДня(Отчет.ДК) - НачалоДня(Отчет.ДН)) / (60 * 60 * 24) + 1;
	Если КоличествоДнейВПериоде = 0 Тогда
		СредняяЗаселяемость = 0;
	Иначе
		//СредняяЗаселяемость = Окр((КоличествоЧеловекНочейИтого / (КоличествоДнейВПериоде * МаксимальноеКоличествоГостей)) * 100 , 1);
		СредняяЗаселяемость = Окр((КоличествоЧеловекНочейИтого / (КоличествоДнейВПериоде * МаксимальноеКоличествоГостей)) * 100);
	КонецЕсли;
КонецЕсли;

Если КоличествоМужчинЖенщинИтого = 0 Тогда
	ПроцентМужчин = 0; 
	ПроцентЖенщин = 0; 
Иначе
	ПроцентМужчин = Окр((КоличествоМужчин / КоличествоМужчинЖенщинИтого) * 100); 
	ПроцентЖенщин = Окр((КоличествоЖенщин / КоличествоМужчинЖенщинИтого) * 100); 
КонецЕсли;
ПроцентМужчинЖенщин = Строка(ПроцентМужчин) + " / " + Строка(ПроцентЖенщин); 
	
Если КоличествоВозрастИтого = 0 Тогда
	СреднийВозрастИтого = 0;
Иначе
	СреднийВозрастИтого = Окр(ВозрастИтого / КоличествоВозрастИтого);
КонецЕсли;
	
//СредняяДлительностьПроживания = Окр(ТЗ_Данные.Итог("КолвоДней") / КоличествоПроживанийИтого, 2);
Если КоличествоПроживанийИтого = 0 Тогда
	СредняяДлительностьПроживания = 0;
Иначе	
	//СредняяДлительностьПроживания = Окр(КоличествоСутокВПериодеИтого / КоличествоПроживанийИтого, 2);
	СредняяДлительностьПроживания = Окр(КоличествоСутокВПериодеИтого / КоличествоПроживанийИтого);
КонецЕсли;
//

//
МакетИмя = "МакетОсновной";
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

Обл=Макет.ПолучитьОбласть("ДанныеШапка");
Обл.Параметры.Наименование = "Кол-во прож. " + ВРег(Формат(Отчет.ДН, "ДФ='MMMM yy'")); 
Обл.Параметры.Данные = КоличествоПроживанийИтого;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("ДанныеСтрока");
Обл.Параметры.Наименование = "Кол-во номеров/ночей"; 
//Обл.Параметры.Данные = КоличествоСутокВПериодеИтого;
Обл.Параметры.Данные = Окр(КоличествоСутокВПериодеИтого);

Если КаналыБронирования.Количество() > 0 Тогда
	СтрокаКаналыБронирования = КаналыБронирования[0];
	
	Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
	
	Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	Если КоличествоПроживанийИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("ДанныеСтрока");
Обл.Параметры.Наименование = "Сред. длит. проживания"; 
Обл.Параметры.Данные = СредняяДлительностьПроживания;
Если КаналыБронирования.Количество() > 1 Тогда
	СтрокаКаналыБронирования = КаналыБронирования[1];
	
	Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
	Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	Если КоличествоПроживанийИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("ДанныеСтрока");
Обл.Параметры.Наименование = "Кол-во человек/ночей"; 
//Обл.Параметры.Данные = КоличествоЧеловекНочейИтого;
Обл.Параметры.Данные = Окр(КоличествоЧеловекНочейИтого);
Если КаналыБронирования.Количество() > 2 Тогда
	СтрокаКаналыБронирования = КаналыБронирования[2];
	
	Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
	Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	Если КоличествоПроживанийИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("ДанныеСтрока");
Обл.Параметры.Наименование = "Средняя заселяемость"; 
Обл.Параметры.Данные = СредняяЗаселяемость;
Если КаналыБронирования.Количество() > 3 Тогда
	СтрокаКаналыБронирования = КаналыБронирования[3];
	
	Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
	Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;
	
	Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("ДанныеСтрока");
Обл.Параметры.Наименование = "% муж/жен"; 
Обл.Параметры.Данные = ПроцентМужчинЖенщин;
Если КаналыБронирования.Количество() > 4 Тогда
	СтрокаКаналыБронирования = КаналыБронирования[4];
	
	Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
	Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	Если КоличествоПроживанийИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("ДанныеСтрока");
Обл.Параметры.Наименование = "Средний возраст"; 
Обл.Параметры.Данные = СреднийВозрастИтого;
Если КаналыБронирования.Количество() > 5 Тогда
	СтрокаКаналыБронирования = КаналыБронирования[5];
	
	Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
	Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;
	
//	Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	Если КоличествоПроживанийИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("ДанныеСтрока");
Обл.Параметры.Наименование = "Кол-во н/ночей РК"; 
Обл.Параметры.Данные = КоличествоНочейРКИтого;
Если КаналыБронирования.Количество() > 6 Тогда
	СтрокаКаналыБронирования = КаналыБронирования[6];
	
	Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
	Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	Если КоличествоПроживанийИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);


Обл=Макет.ПолучитьОбласть("ДанныеСтрока");
Обл.Параметры.Наименование = "% ночей РК"; 
Если КоличествоСутокВПериодеИтого = 0 Тогда
	ПроцентНочейРКИтого = 0;
Иначе
	//ПроцентНочейРКИтого = Окр((КоличествоНочейРКИтого / КоличествоСутокВПериодеИтого) * 100, 1);
	ПроцентНочейРКИтого = Окр((КоличествоНочейРКИтого / КоличествоСутокВПериодеИтого) * 100);
КонецЕсли;	
Обл.Параметры.Данные = ПроцентНочейРКИтого;
Если КаналыБронирования.Количество() > 7 Тогда
	СтрокаКаналыБронирования = КаналыБронирования[7];
	
	Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
	Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	Если КоличествоПроживанийИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Если КаналыБронирования.Количество() > 8 Тогда
	Для Индекс = 8 По КаналыБронирования.Количество() - 1 Цикл
		Обл=Макет.ПолучитьОбласть("ДанныеСтрокаЛевоПусто");
		СтрокаКаналыБронирования = КаналыБронирования[Индекс];
		Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
		Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
		Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;
	
		//Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
		Если КоличествоПроживанийИтого = 0 Тогда
			Процент = 0;
		Иначе
			Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
		КонецЕсли;	
		Обл.Параметры.Процент = Процент;
		
		ПолеОтчета.Вывести(Обл);
	КонецЦикла;		
КонецЕсли;
//

//
Обл=Макет.ПолучитьОбласть("ШапкаИсточник");
Обл.Параметры.ШапкаИсточник = "Источник " + ВРег(Формат(Отчет.ДН, "ДФ='MMMM yy'"));
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("СтрокаИныеАгентства");
ОтборСтроки = Новый Структура("ЭтоИныеАгентства", Истина);
НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда
	НайденнаяСтрока = НайденныеСтроки[0];
	
	Обл.Параметры.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((НайденнаяСтрока.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	Если КоличествоСутокВПериодеИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((НайденнаяСтрока.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
	
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Для Каждого Строка Из ИсточникиБронирования Цикл
	Если Строка.ЭтоКорпорат
	ИЛИ  Строка.ЭтоИныеАгентства
	ИЛИ  Строка.ЭтоЧастнаяБронь
	ИЛИ  Строка.ЭтоНашСайт
	Тогда Продолжить; КонецЕсли;
		
	Обл=Макет.ПолучитьОбласть("СтрокаАгентство");
	Обл.Параметры.ИсточникБронирования = Строка.Наименование; 
	
	Обл.Параметры.КоличествоПроживаний = Строка.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочей = Строка.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((Строка.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	Если КоличествоСутокВПериодеИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((Строка.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
	ПолеОтчета.Вывести(Обл);
КонецЦикла;

Обл=Макет.ПолучитьОбласть("СтрокаКорпораты");
ОтборСтроки = Новый Структура("ЭтоКорпорат", Истина);
НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда
	НайденнаяСтрока = НайденныеСтроки[0];
	
	Обл.Параметры.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((НайденнаяСтрока.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	Если КоличествоСутокВПериодеИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((НайденнаяСтрока.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("СтрокаНашСайт");
ОтборСтроки = Новый Структура("ЭтоНашСайт", Истина);
НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда
	НайденнаяСтрока = НайденныеСтроки[0];
	
	Обл.Параметры.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((НайденнаяСтрока.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	Если КоличествоСутокВПериодеИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((НайденнаяСтрока.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("СтрокаЧастныеБрони");
ОтборСтроки = Новый Структура("ЭтоЧастнаяБронь", Истина);
НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда
	НайденнаяСтрока = НайденныеСтроки[0];
	
	Обл.Параметры.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей;
	
	//Обл.Параметры.Процент = Окр((НайденнаяСтрока.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	Если КоличествоСутокВПериодеИтого = 0 Тогда
		Процент = 0;
	Иначе
		Процент = Окр((НайденнаяСтрока.КоличествоНомеровНочей / КоличествоСутокВПериодеИтого) * 100);
	КонецЕсли;	
	Обл.Параметры.Процент = Процент;
КонецЕсли;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("ПодножиеИсточники");
ПолеОтчета.Вывести(Обл);
////

ВывестиДиаграмму(Макет);

////
МакетИмя = "МакетОсновной";
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

Обл=Макет.ПолучитьОбласть("Шапка");

ПолеОтчета.Вывести(Обл);

сч=1;
КоличествоСутокИтого = 0;
КоличествоСутокВПериодеИтого = 0;
КоличествоЧеловекоНочейИтого = 0;
РКИтого = 0;
Для каждого Стр Из ТЗ_Данные Цикл
	Обл=Макет.ПолучитьОбласть("Строка");
	
	Обл.Параметры.ДатаБронирования = Формат(Стр.Ссылка.Дата, "ДФ=dd.MM.yy");
	Обл.Параметры.Повт = Стр.КоличествоЗаявка;
	Обл.Параметры.ПовторноПериод = Стр.КоличествоЗаявкаПовторноПериод;
	
	Обл.Параметры.НомерОтеля=Строка(Стр.Ссылка.НомерВРезерв);
	Обл.Параметры.ЗаявкаРасшифровка = Стр.Ссылка; 
	
	Обл.Параметры.Но=Строка(Сч);
	
	сч=сч+1;
	Обл.Параметры.ФИО=Строка(Стр.Ссылка.Клиент);
	Обл.Параметры.Бронирует=Строка(Стр.Ссылка.Бронирует);
	Обл.Параметры.КаналБронирования=Строка(Стр.Ссылка.КаналБронирования);
	Обл.Параметры.ИсточникБронирования=Строка(Стр.Ссылка.Бронирует.ВидКлиента);
	
	Обл.Параметры.ДатаР=Формат(Стр.Ссылка.Клиент.ДатаРождения, "ДФ=dd.MM.yy");
	
	Если Стр.Возраст <> 0 Тогда Обл.Параметры.Возраст=Стр.Возраст; КонецЕсли;
	Обл.Параметры.Пол=Строка(Стр.Ссылка.Клиент.Пол);
	//Обл.Параметры.Город=Строка(Стр.Ссылка.Клиент.СтранаПроживания + " " + Стр.Ссылка.Клиент.ГородПроживания);  
	Обл.Параметры.Город=Строка(Стр.Ссылка.Клиент.Город);  
	
	//Обл.Параметры.ДатаЗ=Формат(Стр.Ссылка.РезервС, "ДФ=dd.MM.yy");
	//Обл.Параметры.ДатаВ=Формат(Стр.Ссылка.РезервПо, "ДФ=dd.MM.yy");
	ВремяЗаездаТочное = Стр.Ссылка.ВремяЗаездаТочное;
	ВремяЗаездаТочное_П = Формат(ВремяЗаездаТочное, "ДФ=dd.MM.yy") + " " + Формат(ВремяЗаездаТочное, "ДФ=HH:mm");
	Обл.Параметры.ДатаЗ = ВремяЗаездаТочное_П;
	
	ВремяВыездаТочное = Стр.Ссылка.ВремяВыездаТочное;
	ВремяВыездаТочное_П = Формат(ВремяВыездаТочное, "ДФ=dd.MM.yy") + " " + Формат(ВремяВыездаТочное, "ДФ=HH:mm");
	Обл.Параметры.ДатаВ = ВремяВыездаТочное_П;
	
	Обл.Параметры.КоличествоГостей = Стр.Ссылка.КолВоЧеловек;
	
	КоличествоСуток = Стр.Ссылка.Проживание.Итог("Количество");
	Обл.Параметры.Суток = КоличествоСуток;
	КоличествоСутокИтого = КоличествоСутокИтого + КоличествоСуток;
	
	КоличествоСутокВПериоде = 0;
	Для каждого Строка Из Стр.Ссылка.Проживание Цикл
		Если Строка.ДеньПроживания < Отчет.ДН ИЛИ Строка.ДеньПроживания > Отчет.ДК
		Тогда Продолжить; КонецЕсли;
		
		КоличествоСутокВПериоде = КоличествоСутокВПериоде + Строка.Количество; 
	КонецЦикла;
	Обл.Параметры.СутокВПериоде = КоличествоСутокВПериоде;
	
	КоличествоСутокВПериодеИтого = КоличествоСутокВПериодеИтого + КоличествоСутокВПериоде;
	
	КоличествоЧеловекоНочей =  Стр.Ссылка.КолВоЧеловек * КоличествоСутокВПериоде;
	Обл.Параметры.КоличествоЧеловекоНочей = КоличествоЧеловекоНочей;
	
	КоличествоЧеловекоНочейИтого = КоличествоЧеловекоНочейИтого + КоличествоЧеловекоНочей;
	
	Если Стр.Ссылка.РаздельныеКровати Тогда
		//РК = Стр.Ссылка.КолВоЧеловек;
		РК = КоличествоСутокВПериоде;
		РКИтого = РКИтого + РК;
		
		Обл.Параметры.РК = РК;
	КонецЕсли;	
	
	СтрКом="";
	Для каждого Комм Из Стр.Ссылка.ДопПожелания Цикл
		СтрКом=СтрКом+" "+Комм.Информация; 
	КонецЦикла; 
	Обл.Параметры.Комент=СокрЛП(СтрКом);
	
	ПолеОтчета.Вывести(Обл);
КонецЦикла; 

Обл=Макет.ПолучитьОбласть("Итоги");
Обл.Параметры.Суток = КоличествоСутокИтого; 
Обл.Параметры.СутокВПериоде = КоличествоСутокВПериодеИтого;
Обл.Параметры.КоличествоЧеловекоНочей = КоличествоЧеловекоНочейИтого;
Обл.Параметры.РК = РКИтого;
ПолеОтчета.Вывести(Обл);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьКаналыБронирования()
КаналыБронирования.Очистить();

НоваяСтрока = КаналыБронирования.Добавить();
НоваяСтрока.КаналБронирования = Справочники.КаналыБронирования.НашCайт;

НоваяСтрока = КаналыБронирования.Добавить();
НоваяСтрока.КаналБронирования = Справочники.КаналыБронирования.ЭлектроннаяПочта;

НоваяСтрока = КаналыБронирования.Добавить();
НоваяСтрока.КаналБронирования = Справочники.КаналыБронирования.Телефон;

НоваяСтрока = КаналыБронирования.Добавить();
НоваяСтрока.КаналБронирования = Справочники.КаналыБронирования.Трэвеллайн;

НоваяСтрока = КаналыБронирования.Добавить();
НоваяСтрока.КаналБронирования = Справочники.КаналыБронирования.ОтСтойки;

НоваяСтрока = КаналыБронирования.Добавить();
НоваяСтрока.КаналБронирования = Справочники.КаналыБронирования.WhatsApp;

//НоваяСтрока = КаналыБронирования.Добавить();
//НоваяСтрока.КаналБронирования = Справочники.КаналыБронирования.МобильноеПриложение;
КонецФункции

&НаСервере
Функция ЗаполнитьКаналыБронированияИзСправочника()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КаналыБронирования.Ссылка КАК КаналБронирования
                      |ИЗ
                      |	Справочник.КаналыБронирования КАК КаналыБронирования
                      |ГДЕ
                      |	КаналыБронирования.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КаналыБронирования.СортировкаОтчет,
                      |	КаналыБронирования.Наименование");	

ТЗ = Запрос.Выполнить().Выгрузить();

КаналыБронирования.Очистить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = КаналыБронирования.Добавить();
	НоваяСтрока.КаналБронирования = Строка.КаналБронирования;
КонецЦикла;
КонецФункции

&НаСервере
Функция ЗаполнитьИсточникиБронирования(ТЗ_Данные)

ИсточникиБронирования.Очистить();
ТЗ_ИсточникиБронированияАгенты = ИсточникиБронирования.Выгрузить(Неопределено);
ТЗ_ИсточникиБронированияАгенты.Колонки.Добавить("Номер_пп", Новый ОписаниеТипов("Число"));

НоваяСтрока = ИсточникиБронирования.Добавить();
НоваяСтрока.Наименование = "% иные агенства";
НоваяСтрока.ЭтоИныеАгентства = Истина;       

Для Каждого Строка Из ТЗ_Данные Цикл
	//Если Строка.Ссылка.Бронирует.ВидКлиента <> Справочники.ВидыКлиентов.ИныеАгентства Тогда Продолжить; КонецЕсли;
	Если Строка.Ссылка.Бронирует.ПрограммныйКод <> "АГЕНТЫ"  
	И Строка.Ссылка.Бронирует.Родитель.ПрограммныйКод <> "АГЕНТЫ" 
	И Строка.Ссылка.Бронирует.Родитель.Родитель.ПрограммныйКод <> "АГЕНТЫ" 
	И Строка.Ссылка.Бронирует.Родитель.Родитель.Родитель.ПрограммныйКод <> "АГЕНТЫ" 
	Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = ТЗ_ИсточникиБронированияАгенты.Добавить();
	НоваяСтрока.ИсточникБронирования = Строка.Ссылка.Бронирует;
	
	//НоваяСтрока.Наименование = Строка.Ссылка.Бронирует.Наименование;
	Если ЗначениеЗаполнено(Строка.Ссылка.Бронирует.ТоварныйЗнак) Тогда
		НоваяСтрока.Наименование = Строка.Ссылка.Бронирует.ТоварныйЗнак;
	Иначе
		НоваяСтрока.Наименование = Строка.Ссылка.Бронирует.Наименование;
	КонецЕсли;
	
	НоваяСтрока.Номер_пп = Строка.Ссылка.Бронирует.Номер_пп_Статистика;
КонецЦикла;
ТЗ_ИсточникиБронированияАгенты.Свернуть("ИсточникБронирования, Номер_пп, Наименование, ЭтоИныеАгентства, ЭтоКорпорат, ЭтоЧастнаяБронь");
//ТЗ_ИсточникиБронированияАгенты.Сортировать("Наименование");
ТЗ_ИсточникиБронированияАгенты.Сортировать("Номер_пп, Наименование");

Для Каждого Строка Из ТЗ_ИсточникиБронированияАгенты Цикл
	НоваяСтрока = ИсточникиБронирования.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

НоваяСтрока = ИсточникиБронирования.Добавить();
НоваяСтрока.Наименование = "% корпоратов";
НоваяСтрока.ЭтоКорпорат = Истина;

НоваяСтрока = ИсточникиБронирования.Добавить();
НоваяСтрока.Наименование = "% Наш сайт";
НоваяСтрока.ЭтоНашСайт = Истина;

НоваяСтрока = ИсточникиБронирования.Добавить();
НоваяСтрока.Наименование = "% частные брони";
НоваяСтрока.ЭтоЧастнаяБронь = Истина;
КонецФункции
//

&НаСервере
Процедура ВывестиДиаграмму(Макет)
//
ОбластьМакета = Макет.ПолучитьОбласть("Гистограмма");
Круг = ОбластьМакета.Рисунки.D1;
Диаграмма = Круг.Объект;

ФорматПроцентовВПодписях = "ЧДЦ=0";
Диаграмма.ФорматПроцентовВПодписях = ФорматПроцентовВПодписях;

ТЗДиаграммы = Новый ТаблицаЗначений;
ТЗДиаграммы.Колонки.Добавить("Измерение");
//ТЗДиаграммы.Колонки.Добавить("Точка");
ТЗДиаграммы.Колонки.Добавить("Ресурс");
ТЗДиаграммы.Колонки.Добавить("ЭтоИныеАгентства");
ТЗДиаграммы.Колонки.Добавить("ЭтоЧастнаяБронь");
ТЗДиаграммы.Колонки.Добавить("ЭтоКорпорат");
ТЗДиаграммы.Колонки.Добавить("ЭтоНашСайт");


Для Каждого Строка Из ИсточникиБронирования Цикл
	Если НЕ (Строка.ЭтоИныеАгентства ИЛИ Строка.ЭтоЧастнаяБронь ИЛИ Строка.ЭтоКорпорат ИЛИ Строка.ЭтоНашСайт) Тогда Продолжить; КонецЕсли; 
	
	НоваяСтрока = ТЗДиаграммы.Добавить();
	
	НоваяСтрока.Измерение = Строка.Наименование;
	НоваяСтрока.Ресурс = Строка.КоличествоНомеровНочей;
	
	НоваяСтрока.ЭтоИныеАгентства = Строка.ЭтоИныеАгентства;
	НоваяСтрока.ЭтоЧастнаяБронь = Строка.ЭтоЧастнаяБронь;
	НоваяСтрока.ЭтоКорпорат = Строка.ЭтоКорпорат;
	НоваяСтрока.ЭтоНашСайт = Строка.ЭтоНашСайт;
КонецЦикла;

ТекущаяТочка = Диаграмма.УстановитьТочку("");

Для Каждого Строка из ТЗДиаграммы цикл
   // Получить серию, точку и значение для них
   ТекущаяСерия = Диаграмма.УстановитьСерию(Строка.Измерение);
   
	Если Строка.ЭтоИныеАгентства Тогда
	   ТекущаяСерия.Цвет = Новый Цвет(227, 172, 130);
	ИначеЕсли Строка.ЭтоЧастнаяБронь Тогда
	   ТекущаяСерия.Цвет = Новый Цвет(255, 255, 0);
	ИначеЕсли Строка.ЭтоКорпорат Тогда
	   ТекущаяСерия.Цвет = Новый Цвет(153, 204, 0);
	ИначеЕсли Строка.ЭтоНашСайт Тогда
	   ТекущаяСерия.Цвет = Новый Цвет(0, 204, 255);
	КонецЕсли;   
   
   //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
   Диаграмма.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, Строка.Ресурс, ,) ;
   
   //ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
   ////ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
   //Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
   
  //ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
  //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
  // Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
КонецЦикла;
ПолеОтчета.Вывести(ОбластьМакета);
//

//
ОтборСтроки = Новый Структура("ЭтоИныеАгентства, ЭтоЧастнаяБронь, ЭтоКорпорат, ЭтоНашСайт", Ложь, Ложь, Ложь, Ложь);
ТЗ_Диаграмма = ИсточникиБронирования.Выгрузить(ОтборСтроки);

Итого = ТЗ_Диаграмма.Итог("КоличествоНомеровНочей");

ТЗ_Диаграмма.Колонки.Добавить("Процент");
Для Каждого Строка Из ТЗ_Диаграмма Цикл
	//Строка.Процент = Окр((Строка.КоличествоНомеровНочей / Итого) * 100, 2);			
	Строка.Процент = Окр((Строка.КоличествоНомеровНочей / Итого) * 100);	
КонецЦикла;

ТЗ_Диаграмма.Сортировать("Процент Убыв");
	
ОбластьМакета = Макет.ПолучитьОбласть("Гистограмма_1");

//СтрокВсего = ТЗ_Диаграмма.Количество();
//Если СтрокВсего > 5 Тогда 
//	
//	ВысотаТаблицы = ОбластьМакета.ВысотаТаблицы;
//	
//	Индекс = 1;
//	Пока Индекс < ВысотаТаблицы Цикл
//		ОбластьМакета.Область(индекс, , индекс).ВысотаСтроки = 40;
//		
//		Индекс = Индекс + 1;
//	КонецЦикла;
//КонецЕсли;

Рисунок = ОбластьМакета.Рисунки.D1;

Диаграмма = Рисунок.Объект;

Серия = Диаграмма.УстановитьСерию("");

Цвет = Новый Цвет(255, 0, 0);
Серия.Цвет = Цвет;

Индекс = 1;
Для Каждого Строка Из ТЗ_Диаграмма Цикл
	//Серия = Диаграмма.УстановитьСерию(Строка.Процент);
	Точка = Диаграмма.УстановитьТочку(Строка.Наименование + " (" + Строка(Строка.КоличествоНомеровНочей) + ")");
	Диаграмма.УстановитьЗначение(Точка, Серия, Строка.Процент);
	
	//Серия = Диаграмма.Серии.Добавить("Строка.Наименование");	
	//Цвет = Новый Цвет(255, 0, 0);
	//Серия.Цвет = Цвет;
	//Серия = Диаграмма.УстановитьСерию(Строка.Наименование);

	//Диаграмма.УстановитьЗначение(Точка, Серия, Строка.КоличествоНомеровНочей);
	
	Индекс = Индекс + 1;
	Если Индекс > 15 Тогда Прервать; КонецЕсли;
КонецЦикла;

ПолеОтчета.Вывести(ОбластьМакета);
//   

////  
//ТЗДиаграммы = Новый ТаблицаЗначений;
//ТЗДиаграммы.Колонки.Добавить("Измерение1");
//ТЗДиаграммы.Колонки.Добавить("Измерение2");
//ТЗДиаграммы.Колонки.Добавить("Точка");
//ТЗДиаграммы.Колонки.Добавить("Ресурс1");
//ТЗДиаграммы.Колонки.Добавить("Ресурс2");

  //НовСтр = ТЗДиаграммы.Добавить();
  //НовСтр.Измерение1="Склад1";
  //НовСтр.Измерение2="Склад2";
  //НовСтр.Точка="01/01/01";
  //НовСтр.Ресурс1=10;
  //НовСтр.Ресурс2=15;
 
////  НовСтр = ТЗДиаграммы.Добавить();
  //НовСтр.Измерение1="Склад1";
  //НовСтр.Измерение2="Склад2";
  //НовСтр.Точка="01/02/01";
  //НовСтр.Ресурс1=5;
  //НовСтр.Ресурс2=9;
 
   // Заполнить диаграмму
  //Для Каждого ТекСтр из ТЗДиаграммы цикл
  //     // Получить серию, точку и значение для них
  //     ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение1);
  //     ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
  //     Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс1, ,) ;
  //   
  //     ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
  //     //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
  //     Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
  //     
  //    //ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
  //    //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
  //    // Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
  // КонецЦикла;
   
  //// Раскрасить серии своими цветами
  //Для Каждого Серия из Диаграмма.Серии Цикл
  //   Если Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
  //      Серия.Цвет = WEBЦвета.Желтый;
  //   ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
  //      Серия.Цвет = WEBЦвета.Зеленый;
  //   ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Невыход Тогда
  //      Серия.Цвет = WEBЦвета.Красный;
  //   КонецЕсли;
  //КонецЦикла;
   
   // Разрешить обновление диаграммы
   //Диаграм.Обновление = Истина;
////  
	
//ПолеОтчета.Вывести(ОбластьМакета);
КонецПроцедуры

&НаСервере
Процедура ВывестиГистограмму_Пример()
//Область = ТД.Область(2, 3, 4, 5);
МакетОбработки = Обработки.Тест.ПолучитьМакет("Макет");

ОбластьМакета = МакетОбработки.ПолучитьОбласть("Диа");
//ПутьККартинке = "G:Логотип.png";
//Картинка = Новый Картинка(ПутьККартинке);

//Картинка = Новый Картинка();

//ОбластьМакета.Рисунки.D1.Картинка = Картинка;

Диа= ОбластьМакета.Рисунки.D1;

Диаграм = Диа.Объект;

Серия = Диаграм.Серии.Добавить("АБ");	
//СимволСерия =  КодСимвола(Серия, 1);
Цвет = Новый Цвет(255, 0, 0);
Серия.Цвет = Цвет;
Для Значение = 1 По 10 Цикл
	
	Точка = Диаграм.УстановитьТочку("А" + Строка(Значение) + "    ");
	//Точка.Текст = "То";
	Диаграм.УстановитьЗначение(Точка, Серия, Значение);
	
	//СимволСерия = СимволСерия + 1;
	//ИмяСерия = "А" + Символ(СимволСерия);
	//Серия = Диаграмма_1.Серии.Добавить(ИмяСерия);	

КонецЦикла;


//ТД.Вывести(ОбластьМакета); 


	ОбластьМакета = МакетОбработки.ПолучитьОбласть("Круг");

	Круг= ОбластьМакета.Рисунки.D1;
	Диаграм = Круг.Объект;
	
		
ТЗДиаграммы = Новый ТаблицаЗначений;
  ТЗДиаграммы.Колонки.Добавить("Измерение1");
  ТЗДиаграммы.Колонки.Добавить("Измерение2");
  ТЗДиаграммы.Колонки.Добавить("Точка");
  ТЗДиаграммы.Колонки.Добавить("Ресурс1");
  ТЗДиаграммы.Колонки.Добавить("Ресурс2");

  НовСтр = ТЗДиаграммы.Добавить();
  НовСтр.Измерение1="Склад1";
  НовСтр.Измерение2="Склад2";
  НовСтр.Точка="01/01/01";
  НовСтр.Ресурс1=10;
  НовСтр.Ресурс2=15;
 
  НовСтр = ТЗДиаграммы.Добавить();
  НовСтр.Измерение1="Склад1";
  НовСтр.Измерение2="Склад2";
  НовСтр.Точка="01/02/01";
  НовСтр.Ресурс1=5;
  НовСтр.Ресурс2=9;

 
   // Заполнить диаграмму
  Для Каждого ТекСтр из ТЗДиаграммы цикл
       // Получить серию, точку и значение для них
       ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение1);
       ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
       Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс1, ,) ;
     
	   ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
	   //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
	   Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
	   
	  //ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
	  //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
	  // Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
   КонецЦикла;
   
  //// Раскрасить серии своими цветами
  //Для Каждого Серия из Диаграмма.Серии Цикл
  //   Если Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
  //      Серия.Цвет = WEBЦвета.Желтый;
  //   ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
  //      Серия.Цвет = WEBЦвета.Зеленый;
  //   ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Невыход Тогда
  //      Серия.Цвет = WEBЦвета.Красный;
  //   КонецЕсли;
  //КонецЦикла;
   
   // Разрешить обновление диаграммы
   Диаграм.Обновление = Истина;
 
 //ТД.Вывести(ОбластьМакета);
  //ТД.Защита = Ложь;
  //ТД.ТолькоПросмотр = Истина;	
КонецПроцедуры
//

//
&НаКлиенте
Процедура СформироватьСтатистикуПоРаздельнымКроватям(Команда)
	СформироватьСтатистикуПоРаздельнымКроватямНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьСтатистикуПоРаздельнымКроватямНаСервере()
	ЗапросРК=Новый Запрос("ВЫБРАТЬ
	                      |	ЗанятостьНомеров.Номер КАК Номер,
	                      |	ЗанятостьНомеров.Регистратор.РаздельныеКровати КАК рк,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗанятостьНомеров.Регистратор) КАК Кол
	                      |ИЗ
	                      |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                      |ГДЕ
	                      |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                      |	И ЗанятостьНомеров.Клиент.ВидКлиента.Наименование <> &Наименование
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗанятостьНомеров.Номер,
	                      |	ЗанятостьНомеров.Регистратор.РаздельныеКровати
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Номер,
	                      |	рк");
	ЗапросРК.УстановитьПараметр("ДН",Отчет.ДН);						  
	ЗапросРК.УстановитьПараметр("ДК",Отчет.ДК);
	ЗапросРК.УстановитьПараметр("Наименование","Исключить из отчетов");
	ТЗ=ЗапросРК.Выполнить().Выгрузить();
	
	//Макет=ПолучитьМакет("МакетСтатистикаРК");
	Макет=отчеты.СтатистикаПоНомерам.ПолучитьМакет("МакетСтатистикаРК");
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	ТЗНом=Новый ТаблицаЗначений;
	ТЗНом.Колонки.Добавить("НК");
	ТЗНом.Колонки.Добавить("О");
	ТЗНом.Колонки.Добавить("РК");
	Для каждого Стр Из ТЗ Цикл
		Поиск=ТЗНом.Найти(Стр.Номер,"НК");
		Если Поиск=Неопределено тогда
			НовНом=ТЗНом.Добавить();
			НовНом.НК=Стр.номер;
			НовНом.О=0;
			НовНом.РК=0;
			Поиск=НовНом;
		конецесли;
		Если Стр.РК тогда
			Поиск.РК=Стр.Кол;
		иначе
			Поиск.О=Стр.Кол;
		Конецесли;
		
	
		
	
	КонецЦикла; 
	Для каждого Стр Из ТЗНом Цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(Стр);
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);
	КонецЦикла; 
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.НК="ИТОГО";
		Обл.Параметры.РК=ТЗНом.Итог("РК");
		Обл.Параметры.О=ТЗНом.Итог("О");
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);
КонецПроцедуры
//

