
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
РаботаСИнтерфейсомСервер.УстановитьТолькоПросмотр(ЭтаФорма); 	

ЕстьЗаявкаНаБронирование = ЕстьЗаявкаНаБронирование();
Если ЕстьЗаявкаНаБронирование Тогда
	Элементы.ЕстьЗаявкаНаБронирование.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
	Элементы.ЕстьЗаявкаНаБронирование.ШрифтЗаголовка = Новый Шрифт(,,Истина);
КонецЕсли;
	
Если Объект.Тариф = 1 Тогда
	ТарифТекст = "стандартный"
ИначеЕсли Объект.Тариф = 2 Тогда
	ТарифТекст = "невозвратный"
КонецЕсли;
	
Если Объект.ТипОплаты = 2 Тогда
	ТипОплатыТекст = "карта"
ИначеЕсли Объект.ТипОплаты = 3 Тогда
	ТипОплатыТекст = "при заселении "
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаБронирование(Команда)
Если ЭтаФорма.ТолькоПросмотр Тогда Возврат; КонецЕсли;
	
//Если ЕстьЗаявкаНаБронирование() Тогда Возврат; КонецЕсли;
Если ЕстьЗаявкаНаБронирование Тогда 
	ПоказатьПредупреждение(, "Заявка уже создана");
	
	Возврат; 
КонецЕсли;
	
ПараметрыФормы = Новый Структура("ЗаявкаСайт", Объект.Ссылка);	

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_ЗаявкаНаБронирование", ЭтаФорма);	
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//СоздатьЗаявкуНаБронированиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы_ЗаявкаНаБронирование(Результат, ДополнительныеПараметры) Экспорт
ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
КонецПроцедуры

&НаСервере
Функция ЕстьЗаявкаНаБронирование()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.ЗаявкаСайт = &ЗаявкаСайт");

Запрос.УстановитьПараметр("ЗаявкаСайт", Объект.Ссылка);
Результат = Запрос.Выполнить();

ЕстьЗаявкаНаБронирование = НЕ Результат.Пустой();
Возврат ЕстьЗаявкаНаБронирование; 
КонецФункции

