
Функция ДокументПредставление(Документ) Экспорт
Если НЕ ЗначениеЗаполнено(Документ)	Тогда Возврат ""; КонецЕсли;

ТипЗнч_Документ = ТипЗнч(Документ);
Если ТипЗнч_Документ  = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	ДокументПредставление = "ЗБ ";	
ИначеЕсли ТипЗнч_Документ  = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	ДокументПредставление = "ГС ";	
ИначеЕсли ТипЗнч_Документ  = Тип("ДокументСсылка.КоворкингСчета") Тогда
	ДокументПредставление = "СК ";	
ИначеЕсли ТипЗнч_Документ  = Тип("ДокументСсылка.ВыпискаБанка") Тогда
	ДокументПредставление = "ВБ ";	
ИначеЕсли ТипЗнч_Документ  = Тип("ДокументСсылка.КассовыйДокумент") Тогда
	ДокументПредставление = "КД ";	
ИначеЕсли ТипЗнч_Документ  = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
	ДокументПредставление = "ПО ";	
Иначе
	ДокументПредставление = "" + ТипЗнч_Документ + " ";	
КонецЕсли;	
	
ДокументПредставление = ДокументПредставление + Документ.Номер + " от " + Формат(Документ.Дата, "ДФ=dd.MM.yy"); 	
Возврат ДокументПредставление;	
КонецФункции

Функция ЭтоНовыйРасчет(Ссылка) Экспорт
Возврат Ссылка.НовыйРассчет;
КонецФункции 	

//
Функция ИменаМакетовСчетов() Экспорт
ИменаМакетовСчетов = Новый Структура("МакСчет, МакСчетФЛ", "СчетГУК", "СчетФизЛицоГУК");
Возврат ИменаМакетовСчетов;
КонецФункции	

Функция ПолучитьМакетДокументаЗаявкаНаБронирование(ИмяМакета) Экспорт
МакетИмя = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();	
МакетИмя = ИмяМакета + "_" + МакетИмя;

Макет = Документы.ЗаявкаНаБронирование.ПолучитьМакет(МакетИмя);
Возврат Макет;
КонецФункции
//

//
Функция ТоварКлиент_Олд(ДокументДолгСсылка, Счет) Экспорт
Если ДокументДолгСсылка.Оплачивает.Турагентство Тогда
	Клиент = ДокументДолгСсылка.Клиент;	
	Клиент2 = ДокументДолгСсылка.Клиент2;
Иначе
	Если Счет.РазделитьСчет Тогда
		Клиент = Счет.Клиент;	
		Клиент2 = ДокументДолгСсылка.Клиент2;
	Иначе
		Клиент = Счет.Клиент;	
		Клиент2 = Неопределено;
	КонецЕсли;
КонецЕсли;

ТоварКлиент = "" + Клиент;
Если ЗначениеЗаполнено(Клиент2) Тогда 
	Если Клиент <> Клиент2 Тогда 
		ТоварКлиент = ТоварКлиент + ", " + Клиент2;
	КонецЕсли;
КонецЕсли;

Возврат ТоварКлиент;
КонецФункции

Функция НаименованиеДляДокумента(Строка)
Если Строка.Услуга Тогда	
	НаименованиеДляДокумента = ?(ЗначениеЗаполнено(Строка.НазваниеДляЧека), Строка.НазваниеДляЧека
					       , Строка.НаименованиеДолг) + " " + Формат(Строка.ДатаДолг, "ДФ=dd.MM.yy");
Иначе
	ДатаПо = Строка.ДатаДолг + 24 * 60 * 60;						   
	//НаименованиеДляДокумента = "Проживание с " + Формат(Строка.ДатаДолг, "ДФ=dd.MM.yy") + " по " + Формат(ДатаПо, "ДФ=dd.MM.yy") 					   
	НаименованиеДляДокумента = "Услуги по предоставлению мест для временного проживания в гостинице" + " с " + Формат(Строка.ДатаДолг, "ДФ=dd.MM.yy") + " по " + Формат(ДатаПо, "ДФ=dd.MM.yy"); 					   
КонецЕсли;	
Возврат НаименованиеДляДокумента;
КонецФункции

Функция ИтогиЗаявка(СчетаДетальноДолги, СтавкаНДС, ВсеСНДС)
СуммаПроживание = 0;
КоличествоПроживание = 0;
СуммаУслуги = 0;
СуммаНДС = 0;

ДатаС_Проживание = '30010101';
ДатаПо_Проживание = '00010101';

ДатаС_Услуги = '30010101';
ДатаПо_Услуги = '00010101';

ЕстьНДС0 = Ложь;
ЕстьНДСНе0 = Ложь;
Для Каждого Строка Из СчетаДетальноДолги Цикл
	Если Строка.Услуга Тогда
		Если Строка.ПрограммныйКодУслуги = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ Тогда
			СуммаПроживание = СуммаПроживание + Строка.СуммаДолг;
			
			Если ВсеСНДС Тогда
				СуммаНДС = СуммаНДС + ДокументыСервер.СуммаНДС(СтавкаНДС, Строка.СуммаДолг);
			КонецЕсли;
			
			ЕстьНДС0 = Истина;
		Иначе
			СуммаУслуги = СуммаУслуги + Строка.СуммаДолг;
			СуммаНДС = СуммаНДС + ДокументыСервер.СуммаНДС(СтавкаНДС, Строка.СуммаДолг);
			
			ЕстьНДСНе0 = Истина;
		КонецЕсли;
		
		ДатаС_Услуги = Мин(ДатаС_Услуги, Строка.ДатаДолг); 
		ДатаПо_Услуги = Макс(ДатаПо_Услуги, Строка.ДатаДолг); 
		
	Иначе
		ДатаС_Проживание = Мин(ДатаС_Проживание, Строка.ДатаДолг); 
		ДатаПо_Проживание = Макс(ДатаПо_Проживание, Строка.ДатаДолг); 
		
		СуммаПроживание = СуммаПроживание + Строка.СуммаДолг;
		КоличествоПроживание = КоличествоПроживание + Строка.Количество;
		
		Если ВсеСНДС Тогда
			СуммаНДС = СуммаНДС + ДокументыСервер.СуммаНДС(СтавкаНДС, Строка.СуммаДолг);
		КонецЕсли;
		
		ЕстьНДС0 = Истина;
	КонецЕсли;		
КонецЦикла;

Если ДатаС_Проживание = '30010101' Тогда ДатаС_Проживание = '00010101'; КонецЕсли;
Если ДатаС_Услуги = '30010101' Тогда ДатаС_Услуги = '00010101'; КонецЕсли;

Возврат Новый Структура("СуммаПроживание, КоличествоПроживание, СуммаУслуги, СуммаНДС" 
					+ ", ДатаС_Проживание, ДатаПо_Проживание, ДатаС_Услуги, ДатаПо_Услуги"
					+ ", ЕстьНДС0, ЕстьНДСНе0"
						, СуммаПроживание, КоличествоПроживание, СуммаУслуги, СуммаНДС
						, ДатаС_Проживание, ДатаПо_Проживание, ДатаС_Услуги, ДатаПо_Услуги						
						, ЕстьНДС0, ЕстьНДСНе0
						);
КонецФункции
//

Функция ДокументТелоСтроки(ДокументДолгСсылка, Счет, ЭтоПечатьАктаНаПолнуюСумму = Ложь) Экспорт
	
ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("НомерСтроки");
ТЗ.Колонки.Добавить("Категория");
ТЗ.Колонки.Добавить("Клиент");
ТЗ.Колонки.Добавить("НаименованиеТовара");
//ТЗ.Колонки.Добавить("КодЕдиницыИзмерения");
ТЗ.Колонки.Добавить("ЕдиницаИзмерения");
ТЗ.Колонки.Добавить("Количество");
ТЗ.Колонки.Добавить("Цена");
ТЗ.Колонки.Добавить("НалоговаяСтавка");
ТЗ.Колонки.Добавить("СуммаНДС");
ТЗ.Колонки.Добавить("СуммаБезНДС");
ТЗ.Колонки.Добавить("СуммаСНДС");
ТЗ.Колонки.Добавить("ЭтоУслуга");
ТЗ.Колонки.Добавить("Дата");
ТЗ.Колонки.Добавить("ДатаС");	
ТЗ.Колонки.Добавить("ДатаПо");	

ТоварКлиент = "" + ТоварКлиент(ДокументДолгСсылка, Счет); // + ". ";
	
//НомерВРезерв = ДокументДолгСсылка.НомерВРезерв;	

ДатаУчетаНДС = ДокументДолгСсылка.РезервПо;
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС; 

ЭтоФизЛицо = Счет.Контрагент.ТипКлиента <> Перечисления.ТипыКлиентов.ЮрЛицо;	
СвернутьВСчете = Счет.СвернутьВСчете;

ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
СчетаДетальноДолги = ДокументДолгСсылка.СчетаДетальноДолги.Выгрузить(ОтборСтроки);

Если ЭтоПечатьАктаНаПолнуюСумму Тогда
	Проживание = ДокументДолгСсылка.Проживание;
	Для Каждого Строка Из СчетаДетальноДолги Цикл
		Если Строка.Услуга Тогда Продолжить; КонецЕсли;
		
		ОтборСтроки = Новый Структура("ГУИД", Строка.ДолгиГУИД);
		ПроживаниеСтроки = Проживание.НайтиСтроки(ОтборСтроки);
		Если ПроживаниеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		Строка.СуммаДолг = ПроживаниеСтроки[0].СуммаБезСкидки;
	КонецЦикла;
КонецЕсли;	

ИтогиЗаявка = ИтогиЗаявка(СчетаДетальноДолги, СтавкаНДС, ВсеСНДС);
ВсегоСуммаПроживание = ИтогиЗаявка.СуммаПроживание;
ВсегоКоличествоПроживание = ИтогиЗаявка.КоличествоПроживание;
ВсегоСуммаУслуги = ИтогиЗаявка.СуммаУслуги;
ВсегоСуммаНДС = ИтогиЗаявка.СуммаНДС;

СчетчикСтрок = 0;
Если СвернутьВСчете Тогда
	Сумма = ВсегоСуммаПроживание + ВсегоСуммаУслуги; 
	
	НоваяСтрока = ТЗ.Добавить();
	
	Если Сумма <> 0 Тогда
		СчетчикСтрок = СчетчикСтрок + 1;
		НоваяСтрока.НомерСтроки = СчетчикСтрок;
		
		//НаименованиеДляСчета = "Услуги гостиницы";
		НаименованиеДляСчета = "Услуги по предоставлению мест для временного проживания в гостинице";
		Если ЭтоФизЛицо Тогда
			Товар = НаименованиеДляСчета;
		Иначе
			Товар = ТоварКлиент + ". " + НаименованиеДляСчета;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИтогиЗаявка.ДатаС_Проживание) Тогда
			НоваяСтрока.ДатаС = ИтогиЗаявка.ДатаС_Проживание; 
			НоваяСтрока.ДатаПо = ИтогиЗаявка.ДатаПо_Проживание;
			
			ДатаПо = НоваяСтрока.ДатаПо + 24 * 60 * 60;
			ДатыСПо = " с " + Формат(НоваяСтрока.ДатаС,"ДФ=dd.MM.yy") 
				+ " по " + Формат(ДатаПо,"ДФ=dd.MM.yy") ;
		Иначе
			НоваяСтрока.ДатаС = ИтогиЗаявка.ДатаС_Услуги;
			НоваяСтрока.ДатаПо = ИтогиЗаявка.ДатаПо_Услуги;
			
			Если НоваяСтрока.ДатаС = НоваяСтрока.ДатаПо Тогда
				ДатыСПо = Формат(НоваяСтрока.ДатаС,"ДФ=dd.MM.yy"); 
			Иначе
				ДатаПо = НоваяСтрока.ДатаПо;
				ДатыСПо = " с " + Формат(НоваяСтрока.ДатаС,"ДФ=dd.MM.yy") 
					+ " по " + Формат(ДатаПо,"ДФ=dd.MM.yy") ;
			КонецЕсли;		
		КонецЕсли;
		НоваяСтрока.НаименованиеТовара = Товар + " " + ДатыСПо;
		
		НоваяСтрока.Клиент = ТоварКлиент;
		
		НоваяСтрока.Категория = ДокументДолгСсылка.КатегорияНомера.Наименование;
		
		//НаименованиеДляСчета = "Услуги гостиницы";
		//Если ЭтоФизЛицо Тогда
		//	Товар = НаименованиеДляСчета;
		//Иначе
		//	Товар = ТоварКлиент + НаименованиеДляСчета;
		//КонецЕсли;
		
		//Если НоваяСтрока.ДатаС = НоваяСтрока.ДатаПо Тогда
		//	ДатыСПо = Формат(НоваяСтрока.ДатаС,"ДФ=dd.MM.yy"); 
		//Иначе
		//	ДатаПо = НоваяСтрока.ДатаПо + 24 * 60 * 60;
		//	ДатыСПо = " с " + Формат(НоваяСтрока.ДатаС,"ДФ=dd.MM.yy") 
		//		+ " по " + Формат(ДатаПо,"ДФ=dd.MM.yy") ;
		//КонецЕсли;		
		//НоваяСтрока.НаименованиеТовара = Товар + " " + ДатыСПо;

		Если ВсегоКоличествоПроживание = 0 Тогда
			 ВсегоКоличествоПроживание = 1;
		КонецЕсли;
		НоваяСтрока.Количество = ВсегоКоличествоПроживание;
		
		НоваяСтрока.ЕдиницаИзмерения = "сутки";
			
		НоваяСтрока.Цена = Окр(Сумма / ВсегоКоличествоПроживание, 2);
		НоваяСтрока.СуммаСНДС = Сумма;
		
		НоваяСтрока.ЭтоУслуга = Ложь;
	КонецЕсли;	
Иначе	
	Для Каждого Строка Из СчетаДетальноДолги Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		
		СчетчикСтрок = СчетчикСтрок + 1;
		НоваяСтрока.НомерСтроки = СчетчикСтрок;
		
		НоваяСтрока.Клиент = ТоварКлиент;
		
		НаименованиеДляСчета = НаименованиеДляДокумента(Строка);

		Если ЭтоФизЛицо Тогда
			Товар = НаименованиеДляСчета;
		Иначе
			Товар = ТоварКлиент + ". " + НаименованиеДляСчета;
		КонецЕсли;
		НоваяСтрока.НаименованиеТовара = Товар;

		НоваяСтрока.ДатаС = Строка.ДатаДолг;
		НоваяСтрока.ДатаПо = Строка.ДатаДолг;		
		
		Если Строка.Количество = 0 Тогда
			 Количество = 1;
		Иначе	 
			 Количество = Строка.Количество;
		КонецЕсли;
		НоваяСтрока.Количество = Количество;
		
		Если Строка.Услуга Тогда
			НоваяСтрока.ЭтоУслуга = Истина;
			НоваяСтрока.ЕдиницаИзмерения = "шт";
		Иначе			
			НоваяСтрока.ЭтоУслуга = Ложь;
			НоваяСтрока.ЕдиницаИзмерения = "сутки";
			НоваяСтрока.Категория = ДокументДолгСсылка.КатегорияНомера.Наименование;
		КонецЕсли;
			
		Сумма = Строка.СуммаДолг;
		НоваяСтрока.СуммаСНДС = Сумма;
		
		Цена = Окр(Сумма / Количество, 2);
		НоваяСтрока.Цена = Цена;
		
	КонецЦикла;		
КонецЕсли;	

Возврат Новый Структура("ТЗСтроки, СчетаДетальноДолги", ТЗ, СчетаДетальноДолги);
КонецФункции

Процедура ПечатьДокументаТело(ТабДок, Макет, СчетчикСтрок, СуммаДляПечатиОбщая, ДокументДолгСсылка, Счет, УчитыватьНДС
	, ПечататьВсегоКОплате, ЭтоПечатьАктаНаПолнуюСумму = Ложь)

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();    

СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; 

ДатаУчетаНДС = ДокументДолгСсылка.РезервПо;
СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);

ВсеСНДС = ТекущаяОрганизация.ВсеСНДС; 

ЭтоФизЛицо = Счет.Контрагент.ТипКлиента <> Перечисления.ТипыКлиентов.ЮрЛицо;	
СвернутьВСчете = Счет.СвернутьВСчете;

ЭтоШтрафЗаНезаезд = ЭтоШтрафЗаНезаезд(ДокументДолгСсылка, Счет);

Ответ = ДокументТелоСтроки(ДокументДолгСсылка, Счет, ЭтоПечатьАктаНаПолнуюСумму);
ТЗСтроки = Ответ.ТЗСтроки;
СчетаДетальноДолги = Ответ.СчетаДетальноДолги; 

ИтогиЗаявка = ИтогиЗаявка(СчетаДетальноДолги, СтавкаНДС, ВсеСНДС);
ВсегоСуммаПроживание = ИтогиЗаявка.СуммаПроживание;
ВсегоКоличествоПроживание = ИтогиЗаявка.КоличествоПроживание;
ВсегоСуммаУслуги = ИтогиЗаявка.СуммаУслуги;
ВсегоСуммаНДС = ИтогиЗаявка.СуммаНДС;

Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
ОбластьПовтора = ТабДок.Вывести(Область);
ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовтора;

СчетчикСтрок = 0;
Для Каждого Строка Из ТЗСтроки Цикл
	СтрокаТабл = Макет.ПолучитьОбласть("Строка");
	СтрокаТаблПараметры = СтрокаТабл.Параметры;
	
	СтрокаТаблПараметры.НомерСтроки = Строка.НомерСтроки;
			
	СтрокаТаблПараметры.Товар = Строка.НаименованиеТовара;
	
	СтрокаТаблПараметры.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;
	
	СтрокаТаблПараметры.Количество = Строка.Количество;
	СтрокаТаблПараметры.Цена = Строка.Цена;
	
	СтрокаТаблПараметры.Сумма = Строка.СуммаСНДС;
	
	ТабДок.Вывести(СтрокаТабл);
	
	СчетчикСтрок = СчетчикСтрок + 1;
КонецЦикла;

ВсегоИтого = ВсегоСуммаПроживание + ВсегоСуммаУслуги;

//
ИтогоСтр=Макет.ПолучитьОбласть("Итоги");
ИтогоСтр.Параметры.Всего = ВсегоИтого;
ТабДок.Вывести(ИтогоСтр);

Если ЭтоШтрафЗаНезаезд Тогда
	СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
КонецЕсли;

ПечатьИтогиНДС(ТабДок, Макет, УчитыватьНДС, ВсеСНДС, СтавкаНДС, ВсегоСуммаНДС, СвернутьВСчете
	, ИтогиЗаявка.ЕстьНДС0, ИтогиЗаявка.ЕстьНДСНе0);

Если ПечататьВсегоКОплате Тогда
	ИтогоСтр=Макет.ПолучитьОбласть("ВсегоКОплате");
	ИтогоСтр.Параметры.ВсегоКОплате = ВсегоИтого;
	ТабДок.Вывести(ИтогоСтр);
КонецЕсли;

ИтогоСтр=Макет.ПолучитьОбласть("СуммаПрописью");  
ИтогоСтр.Параметры.ИтоговаяСтрока="Всего "+Строка(СчетчикСтрок) + " наименований на сумму:";
ИтогоСтр.Параметры.СуммаПрописью=ЧислоПрописью(ВсегоИтого,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");

ТабДок.Вывести(ИтогоСтр);	

СуммаДляПечатиОбщая = ВсегоИтого;
КонецПроцедуры

Функция ЭтоШтрафЗаНезаезд(ДокументДолгСсылка, Счет) Экспорт
ЭтоШтрафЗаНезаезд_1 = Счет.ТолькоУслуги И (ДокументДолгСсылка.Статус = Перечисления.СтатусБрони.Неустойка);

ОтборСтроки = Новый Структура("СчетГУИД, Услуга", Счет.СчетГУИД, Истина);
СчетаДетальноДолги = ДокументДолгСсылка.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

ЭтоШтрафЗаНезаезд_2 = Ложь;
Для Каждого Строка Из СчетаДетальноДолги Цикл
	ОтборСтроки = Новый Структура("ГУИД", Строка.ДолгиГУИД);
	ДопУслуги = ДокументДолгСсылка.ДопУслуги.НайтиСтроки(ОтборСтроки);
	Если ДопУслуги.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Если ДопУслуги[0].Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ШТРАФ Тогда
		ЭтоШтрафЗаНезаезд_2 = Истина;
		Прервать;
	КонецЕсли;	
КонецЦикла;

ЭтоШтрафЗаНезаезд = ЭтоШтрафЗаНезаезд_1 ИЛИ ЭтоШтрафЗаНезаезд_2;

Возврат ЭтоШтрафЗаНезаезд;	
КонецФункции

Процедура ПечатьИтогиНДС(ТабДок, Макет, УчитыватьНДС, ВсеСНДС, СтавкаНДС, ВсегоСуммаНДС, СвернутьВСчете, ЕстьНДС0, ЕстьНДСНе0)
Если НЕ УчитыватьНДС Тогда
	ВсегоНДС = ВсегоНДС(Перечисления.СтавкиНДС.БезНДС, 0, Ложь, Ложь); 
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
	ВсегоНДС = ВсегоНДС(Перечисления.СтавкиНДС.БезНДС, 0, Ложь, Ложь); 
Иначе		
	Если СвернутьВСчете Тогда
		ВсегоНДС = ВсегоНДС(Перечисления.СтавкиНДС.НДС0, 0, Истина, Ложь);
	Иначе	
		Если ВсеСНДС Тогда 
			ВсегоНДС = ВсегоНДС(СтавкаНДС, ВсегоСуммаНДС, Ложь, Истина);
		Иначе	
			ВсегоНДС = ВсегоНДС(СтавкаНДС, ВсегоСуммаНДС, ЕстьНДС0, ЕстьНДСНе0);
		КонецЕсли;
	КонецЕсли;
КонецЕсли;

ВсегоНДСТекст = ВсегоНДС.ВсегоНДСТекст;
ВсегоНДССумма = ВсегоНДС.ВсегоНДССумма;

ИтогоСтр=Макет.ПолучитьОбласть("ИтогоНДС");
ИтогоСтр.Параметры.ВсегоНДСТекст =ВсегоНДСТекст;
ИтогоСтр.Параметры.ВсегоНДССумма =ВсегоНДССумма;
ТабДок.Вывести(ИтогоСтр);

КонецПроцедуры

Функция ВсегоНДС(СтавкаНДС, ВсегоСуммаНДС, ЕстьНДС0, ЕстьНДСНе0)

Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС 
ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка()
Тогда
	ВсегоНДСТекст = "Без налога (НДС):";		
ИначеЕсли ЕстьНДС0 И ЕстьНДСНе0 Тогда
	ВсегоНДСТекст = "В том числе НДС:";		
ИначеЕсли ЕстьНДС0 Тогда
	ВсегоНДСТекст = "НДС 0%:";		
ИначеЕсли ЕстьНДСНе0 Тогда
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
		ВсегоНДСТекст = "В том числе НДС 22%:";	
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		ВсегоНДСТекст = "В том числе НДС 20%:";	
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
		ВсегоНДСТекст = "В том числе НДС 5%:";		
	КонецЕсли;	
Иначе	
	ВсегоНДСТекст = "В том числе НДС:";		
КонецЕсли; 

Если ВсегоСуммаНДС = 0 ТОгда
	ВсегоНДССумма = "-";
Иначе
	ВсегоНДССумма = ВсегоСуммаНДС;
КонецЕсли;	
Возврат Новый Структура("ВсегоНДСТекст, ВсегоНДССумма", ВсегоНДСТекст, ВсегоНДССумма);
КонецФункции

///////// + Печать Счета
Функция ТабличныйДокументСчет(ДокументДолгСсылка, Счет) Экспорт
ТабличныйДокумент = Новый ТабличныйДокумент;
 
Результат = ПечатьСервер.ПечатьСчета_Счет(ТабличныйДокумент, ДокументДолгСсылка, Счет);

ТабличныйДокумент.ОтображатьСетку = Ложь;
ТабличныйДокумент.Защита = Ложь;
ТабличныйДокумент.ТолькоПросмотр = Истина;
ТабличныйДокумент.ОтображатьЗаголовки = Ложь;

Возврат ТабличныйДокумент;	
КонецФункции	

Функция ПечатьСчета_Счет(ТабДок, ДокументДолгСсылка, Счет) Экспорт
//ИменаМакетовСчетов = ИменаМакетовСчетов();	
//МакСчет = ИменаМакетовСчетов.МакСчет;
//МакСчетФЛ = ИменаМакетовСчетов.МакСчетФЛ;
	
Оплачивает = Счет.Контрагент;	
Если Оплачивает.ТипКлиента = Перечисления.ТипыКлиентов.ПустаяСсылка() Тогда
	Сообщить("У клиента: " + Оплачивает + " не заполнен 'Тип клиента'. ПЕЧАТЬ СЧЕТА ОТМЕНЯЕТСЯ ...");
	
	Возврат Истина;
КонецЕсли;

ОплачиваетЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Оплачивает);
Если ОплачиваетЮрЛицо Тогда
	//МакетЮрЛицо = ПолучитьМакетДокументаЗаявкаНаБронирование(МакСчет);
	МакетЮрЛицо = ПолучитьОбщийМакет("СчетЮрЛицо");
	
	ПечатьСчетаЮрЛицо_Счет(ТабДок, МакетЮрЛицо, ДокументДолгСсылка, Счет); 
Иначе	
	//МакетФизЛицо = ПолучитьМакетДокументаЗаявкаНаБронирование(МакСчетФЛ);
	МакетФизЛицо = ПолучитьОбщийМакет("СчетФизЛицо");

	ПечатьСчетаФизЛицо_Счет(ТабДок, МакетФизЛицо, ДокументДолгСсылка, Счет);
КонецЕсли;

Возврат ТабДок;
КонецФункции	

//
Процедура ПечатьСчетаЮрЛицо_Счет(ТабДок, Макет, ДокументДолгСсылка, Счет) Экспорт
НомерДокумента = НомерСчетаДляПечати(ДокументДолгСсылка.Номер, Счет.НомерСчета);
ДатаДокумента = Счет.ДатаСчета;

УчитыватьНДС = ДокументыСервер.УчитыватьНДС(Счет.ДатаПо);

Контрагент = Счет.Контрагент;

ТекстЗаголовка = ПечатьСчетаЮрЛицоШапка_Счет(ТабДок, Макет, НомерДокумента, ДатаДокумента, Контрагент);

СчетчикСтрок = 0; СуммаДляПечатиОбщая = 0; 
ПечатьДокументаТело(ТабДок, Макет, СчетчикСтрок, СуммаДляПечатиОбщая, ДокументДолгСсылка, Счет, УчитыватьНДС, Истина);

ПечатьСчетаЮрЛицоПодвал_Счет(ТабДок, Макет); 
КонецПроцедуры

Функция ПечатьСчетаЮрЛицоШапка_Счет(ТабДок, Макет, НомерДокумента, ДатаДокумента, Контрагент)  Экспорт  

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

Область = Макет.ПолучитьОбласть("ЗаголовокСчета");
Область.Параметры.БанкПолучателя = ТекущаяОрганизация.СчетЮрЛицоБанкПолучателя;
Область.Параметры.БИКБанкаПолучателя = ТекущаяОрганизация.СчетЮрЛицоБИКБанкаПолучателя;
Область.Параметры.КорСчетБанкаПолучателя = ТекущаяОрганизация.СчетЮрЛицоКорСчетБанкаПолучателя;
Область.Параметры.СчетБанкаПолучателя = ТекущаяОрганизация.СчетЮрЛицоСчетБанкаПолучателя;
Область.Параметры.ЗаголовокИНН = ТекущаяОрганизация.ИНН;
Область.Параметры.ЗаголовокКПП = ТекущаяОрганизация.КПП;

//Область.Параметры.Получатель = ТекущаяОрганизация.ОрганизацияДляДокументов;
Область.Параметры.Получатель = "Гостиница " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " ИНН " + ТекущаяОрганизация.ИНН + " КПП " + ТекущаяОрганизация.КПП
	+ " " + ТекущаяОрганизация.ОрганизацияДляДокументов;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Заголовок");
ТекстЗаголовка="Счет № " + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yy");	
Область.Параметры.ТекстЗаголовка = ТекстЗаголовка;

Область.Параметры.Поставщик = "Гостиница " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " ИНН " + ТекущаяОрганизация.ИНН + " КПП " + ТекущаяОрганизация.КПП
	+ " " + ТекущаяОрганизация.ОрганизацияДляДокументов
	+ " " + ТекущаяОрганизация.ОрганизацияАдресДляДокументов;	
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Поставщик");
ПредставлениеПолучателя = ОбщееСервер.ПолучитьПредставлениеКлиента(Контрагент);
Область.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
ТабДок.Вывести(Область);

Возврат ТекстЗаголовка;  
КонецФункции

Процедура ПечатьСчетаЮрЛицоПодвал_Счет(ТабДок, Макет) 
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

ИтогоСтр=Макет.ПолучитьОбласть("ПодвалСчета");
ИтогоСтр.Параметры.Руководитель = ТекущаяОрганизация.ОрганизацияФИОРуководительДляДокументов; 
ИтогоСтр.Параметры.Бухгалтер = ТекущаяОрганизация.ОрганизацияФИОБухгалтерДляДокументов; 
ТабДок.Вывести(ИтогоСтр);

Папка_C_BASE = ОбщееСервер.КаталогИБ();
Печать = Неопределено;
//Если НастройкиСервер.ЭтоРеноме() Тогда
//	Печать = Новый Картинка(Папка_C_BASE + "ОбразцыДокументов\Печать ГУК.png"); 
//ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда
//	Печать = Новый Картинка(Папка_C_BASE + "ОбразцыДокументов\Печать Новые отели.bmp"); 
//ИначеЕсли НастройкиСервер.ЭтоДомСоветов() 
//ИЛИ НастройкиСервер.ЭтоЧехов() 
//ИЛИ НастройкиСервер.ЭтоЛайв() 
//Тогда
//	Печать = Новый Картинка(Папка_C_BASE + "ОбразцыДокументов\Печать АГ.png"); 
//КонецЕсли;	
Если НастройкиСервер.ЭтоРеноме() Тогда
	Печать = Новый Картинка(Папка_C_BASE + "ОбразцыДокументов\Печать ГУК.png"); 
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() 
ИЛИ НастройкиСервер.ЭтоДомСоветов()
Тогда
	Печать = Новый Картинка(Папка_C_BASE + "ОбразцыДокументов\Печать Новые отели.bmp"); 
ИначеЕсли НастройкиСервер.ЭтоЧехов() 
ИЛИ НастройкиСервер.ЭтоЛайв() 
Тогда
	Печать = Новый Картинка(Папка_C_BASE + "ОбразцыДокументов\Печать АГ.png"); 
КонецЕсли;	
Если Печать <> Неопределено Тогда
	ОбластьКартинка=Макет.ПолучитьОбласть("ОбластьКартинка");  
	ОбластьКартинка.Рисунки.Печать.Картинка  = Печать; 
	ТабДок.Вывести(ОбластьКартинка); 
КонецЕсли;	
КонецПроцедуры
//

//
Процедура ПечатьСчетаФизЛицо_Счет(ТабДок, Макет, ДокументДолгСсылка, Счет) Экспорт
УчитыватьНДС = ДокументыСервер.УчитыватьНДС(Счет.ДатаПо);

НомерДокумента = НомерСчетаДляПечати(ДокументДолгСсылка.Номер, Счет.НомерСчета);
ДатаДокумента = Счет.ДатаСчета;

ТекстЗагловка = ПечатьСчетаФизЛицоШапка_Счет(ТабДок, Макет, НомерДокумента, ДатаДокумента, ДокументДолгСсылка, Счет);	

СчетчикСтрок = 0; СуммаПечатиОбщая = 0; 
ПечатьДокументаТело(ТабДок, Макет, СчетчикСтрок, СуммаПечатиОбщая, ДокументДолгСсылка, Счет, УчитыватьНДС, Истина);

ПечатьСчетаФизЛицоПодвал(ТабДок, Макет);	
КонецПроцедуры

Функция ПечатьСчетаФизЛицоШапка_Счет(ТабДок, Макет, НомерДокумента, ДатаДокумента, ДокументДолгСсылка, Счет) Экспорт
ЭтоГрупповойСчет = (ТипЗнч(ДокументДолгСсылка) = Тип("ДокументСсылка.ГрупповыеСчета"));

Если ЭтоГрупповойСчет Тогда
	Контрагент = ДокументДолгСсылка.Контрагент;
	
Иначе	
	Контрагент = Счет.Контрагент;
	НомерВРезерв = ДокументДолгСсылка.НомерВРезерв;	

	ДатаЗаезда = Счет.ДатаС;
	ДатаВыезда = Счет.ДатаПо;
КонецЕсли;

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

Область = Макет.ПолучитьОбласть("ЗаголовокСчета");
СчетФизЛицоЗаголовокСчета = "Гостиница " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " ИНН " + ТекущаяОрганизация.ИНН + " КПП " + ТекущаяОрганизация.КПП
	+ " " + ТекущаяОрганизация.ОрганизацияДляДокументов
	+ Символы.ПС + ТекущаяОрганизация.ОрганизацияАдресДляДокументов;

Область.Параметры.ЗаголовокСчета = СчетФизЛицоЗаголовокСчета;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.Поставщик = "Гостиница " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " ИНН " + ТекущаяОрганизация.ИНН + " КПП " + ТекущаяОрганизация.КПП
	+ " " + ТекущаяОрганизация.ОрганизацияДляДокументов
	+ " " + ТекущаяОрганизация.ОрганизацияАдресДляДокументов;	

ТекстЗаголовка="Счет № " + НомерДокумента + " от "+ Формат(ДатаДокумента, "ДФ=dd.MM.yy");
Область.Параметры.ТекстЗаголовка = ТекстЗаголовка;
ТабДок.Вывести(Область);

Если ЗначениеЗаполнено(Контрагент) Тогда 
	Область = Макет.ПолучитьОбласть("Поставщик");
	Область.Параметры.ПредставлениеПолучателя = ОбщееСервер.ПолучитьПредставлениеКлиента(Контрагент);			
	ТабДок.Вывести(Область);
КонецЕсли;

Если НЕ ЭтоГрупповойСчет Тогда
	Область = Макет.ПолучитьОбласть("ЗаездВыезд");
	Область.Параметры.ПредставлениеЗаездВыезд = "Заезд: " + Формат(ДатаЗаезда, "ДФ=dd.MM.yyyy") 
											+ ". Выезд: " + Формат(ДатаВыезда, "ДФ=dd.MM.yyyy"); 
	ТабДок.Вывести(Область);

	Если ЗначениеЗаполнено(НомерВРезерв) Тогда 
		Область = Макет.ПолучитьОбласть("ПредставлениеНомера");

		Область.Параметры.ПредставлениеНомера="Комната: " + НомерВРезерв.Наименование;	
		ТабДок.Вывести(Область);
	КонецЕсли;
КонецЕсли;

Возврат ТекстЗаголовка;  
КонецФункции

Функция ПечатьСчетаФизЛицоПодвал(ТабДок, Макет) 
ИтогоСтр=Макет.ПолучитьОбласть("ПодвалСчета");
ТабДок.Вывести(ИтогоСтр);
КонецФункции
//


////
Функция ПечатьСчетаНаАнглийском(Объект, ТолькоУслуги, ТолькоПроживание) Экспорт 
ТабДок = Новый ТабличныйДокумент;

//Макет = Документы.ЗаявкаНаБронирование.ПолучитьМакет("СчетАнгл");
Макет = ПолучитьМакетДокументаЗаявкаНаБронирование("СчетАнгл");

// Заголовок
Область = Макет.ПолучитьОбласть("ЗаголовокСчета");
ТабДок.Вывести(Область);
Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.ТекстЗаголовка=" Invoice № "+Формат(Объект.Номер, "ЧГ=")+" printed "+ Формат(Объект.Дата, "ДФ=dd.MM.yy");	
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Поставщик");
Область.Параметры.ПредставлениеПолучателя="Guest : "+Объект.Клиент.Наименование;	
Область.Параметры.ПредставлениеНомера="Room number: "+Объект.НомерВРезерв.Наименование;	
Область.Параметры.ПредставлениеКорпуса="Check in : "+Формат(Объект.РезервС, "ДФ=dd.MM.yy")+" 12:00";	
Область.Параметры.ПредставлениеКорпуса2="Check out : "+Формат(Объект.РезервПо, "ДФ=dd.MM.yy")+" 12:00";
ТабДок.Вывести(Область);

//Оплачивает2 = Объект.Оплачивает;

СуммаДляПечати=0;
//СуммаПроживание=РассчитатьСуммуЗаПроживание(Неопределено,Объект.ПеременныйТариф);//Тариф.Цена*КолВо;
Первый = Истина; РазделитьСчет = Ложь;
СуммаПроживание = 0;
Если (НЕ ТолькоУслуги) Тогда
	Для Каждого Строка Из Объект.Проживание Цикл
		СуммаПроживание = СуммаПроживание + Строка.Сумма; 	
	КонецЦикла;	
КонецЕсли;

//СуммаДляПечати = ?(Объект.ВСчет, СуммаДляПечати + СуммаПроживание, СуммаДляПечати);
СуммаДляПечати = СуммаПроживание;
Если (НЕ ТолькоПроживание) Тогда
	Для каждого ДопУсл Из Объект.ДопУслуги Цикл
		Если НЕ ДопУсл.ВСчет тогда Продолжить; конецесли;
		
		СуммаДляПечати = СуммаДляПечати + ДопУсл.Количество*ДопУсл.Цена;
	КонецЦикла; 
КонецЕсли;

// Шапка
Шапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
ТабДок.Вывести(Шапка);

СтрокаТабл = Макет.ПолучитьОбласть("Строка");
Если Объект.СвернутьВСчете тогда
	//	НомерСтроки	Товар	Количество	ЕдиницаИзмерения	Цена	Сумма
	
	СтрокаТабл.Параметры.НомерСтроки=1;
	
	СтрокаТабл.Параметры.Товар="Standart";// +Тариф.Наименование+ " " + Клиент.Наименование + " с "+ Формат(РезервС, "ДФ=dd.MM.yy")+ " по "+ Формат(РезервПо, "ДФ=dd.MM.yy");
	СтрокаТабл.Параметры.Период=Объект.КолВо;
	////СтрокаТабл.Параметры.Период="С "+Формат(РезервС, "ДФ=dd.MM.yy")+ " по "+Формат(РезервПо, "ДФ=dd.MM.yy");
	
	//СтрокаТабл.Параметры.Цена=Формат(?(Объект.Колво=0, Объект.Тариф.Цена, Окр(СуммаДляПечати/Объект.КолВо,2)), "ЧДЦ=0");
	СтрокаТабл.Параметры.Цена = Формат(?(Объект.Колво=0, 0, ДокументыСервер.ОкруглитьЦену(СуммаДляПечати / Объект.КолВо))
		, "ЧДЦ=0");
		
	СтрокаТабл.Параметры.Сумма=Формат(ДокументыСервер.ОкруглитьСумма(СуммаДляПечати), "ЧДЦ=0");
	ТабДок.Вывести(СтрокаТабл);
	
	сч=1;
иначе
	//Если Объект.Всчет тогда
	Если (НЕ ТолькоУслуги) тогда
		сч=0;
		
		Для каждого Стр Из Объект.Проживание Цикл
			сч = сч + 1;
			СтрокаТабл.Параметры.НомерСтроки = сч;
			
			СтрокаТабл.Параметры.Товар="Проживание с " + Формат(Стр.ДеньПроживания, "ДФ=dd.MM.yy")
				+ " по "+ Формат(Стр.ДеньПроживания+86400, "ДФ=dd.MM.yy")
				//+ " " + Объект.НомерВРезерв.КатегорияНомера.Наименование
				//+ " " + Объект.КатегорияНомера.Наименование
				;
			СтрокаТабл.Параметры.Период=1;
			
			//Скидка = ДокументыСервер.ИтогоСкидка(Объект);
			Скидка = ДокументыСервер.ИтогоСкидкаКлиент(Объект, Истина);
			
			//Цена = Окр(Стр.Цена*(1 - Скидка/100), 2);
			Цена = ДокументыСервер.ОкруглитьЦену(Стр.Цена*(1 - Скидка/100));
			СтрокаТабл.Параметры.Цена = Формат(Цена, "ЧДЦ=0");
			
			Сумма = ДокументыСервер.ОкруглитьСумма(Стр.Сумма);
			СтрокаТабл.Параметры.Сумма = Формат(Сумма, "ЧДЦ=0");

			ТабДок.Вывести(СтрокаТабл);
		КонецЦикла; 
	иначе
		
		Сч=0;
	конецесли;
	
	Если НЕ ТолькоПроживание тогда
		Для каждого Усл Из Объект.ДопУслуги Цикл
			Если НЕ Усл.ВСчет тогда Продолжить; конецесли;
			
			сч = сч + 1;
			СтрокаТабл.Параметры.НомерСтроки = сч;
			
			СтрокаТабл.Параметры.Товар=Усл.Услуга.Наименование;
			СтрокаТабл.Параметры.Период=Усл.Количество;
			////СтрокаТабл.Параметры.Период="С "+Формат(РезервС, "ДФ=dd.MM.yy")+ " по "+Формат(РезервПо, "ДФ=dd.MM.yy");
			
			СтрокаТабл.Параметры.Цена=Формат(Усл.Цена, "ЧДЦ=0");
			СтрокаТабл.Параметры.Сумма=Формат(Усл.Цена * Усл.Количество, "ЧДЦ=0");
			
			ТабДок.Вывести(СтрокаТабл);
		КонецЦикла; 
	КонецЕсли;
КонецЕсли;

ИтогоСтр=Макет.ПолучитьОбласть("Итого");
ИтогоСтр.Параметры.Всего=СуммаДляПечати;
ТабДок.Вывести(ИтогоСтр);

ИтогоСтр=Макет.ПолучитьОбласть("ПодвалЗаказа");
ТабДок.Вывести(ИтогоСтр);

ТабДок.ОтображатьСетку = Ложь;
ТабДок.Защита = Ложь;
ТабДок.ТолькоПросмотр = Истина;
ТабДок.ОтображатьЗаголовки = Ложь;

Возврат ТабДок;			
КонецФункции
////

///////// - Печать Счета

// 
Функция НомерСчетаДляПечати(НомерДокумента, НомерСчета) Экспорт
НомерДокумента_П = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(НомерДокумента);	
Возврат НомерДокумента_П + "/" + НомерСчета;    
КонецФункции 	

Функция НомерДатаДокумента(ДокументОбъект, НомерСчета, СчетДатаПо) Экспорт
НомерДокумента = НомерСчетаДляПечати(ДокументОбъект.Номер, НомерСчета);
ДатаДокумента = СчетДатаПо;

Возврат Новый Структура("Номер, Дата", НомерДокумента, ДатаДокумента);  
КонецФункции
// 


//////
Функция ПечатьАктаСчетНаСервере(ПечатьАктаНаПолнуюСумму, ТС, ДокументОбъект) Экспорт
Счет = ДокументОбъект.Счета.НайтиПоИдентификатору(ТС);	
	
ТабДок = Новый ТабличныйДокумент;

//МакАкт="АктГУК";
//Макет = ПечатьСервер.ПолучитьМакетДокументаЗаявкаНаБронирование(МакАкт);

НомерАктаДатаАкта = НомерДатаДокумента(ДокументОбъект, Счет.НомерСчета, Счет.ДатаПо);
НомерАкта = НомерАктаДатаАкта.Номер;
ДатаАкта = НомерАктаДатаАкта.Дата;

ТабДок = ПечатьАктаСчетДействие(НомерАкта, ДатаАкта, Счет, ДокументОбъект, ПечатьАктаНаПолнуюСумму);

ТабДок.ОтображатьСетку = Ложь; ТабДок.Защита = Ложь; ТабДок.ТолькоПросмотр = Истина; ТабДок.ОтображатьЗаголовки = Ложь;
Возврат ТабДок;
КонецФункции

Функция ПечатьАктаСчетДействие(НомерАкта, ДатаАкта, Счет, ДокументОбъект, ПечатьАктаНаПолнуюСумму) 
ТабДок = Новый ТабличныйДокумент;

УчитыватьНДС = ДокументыСервер.УчитыватьНДС(ДокументОбъект.РезервПо);

//МакАкт="АктГУК";
//Макет = ПечатьСервер.ПолучитьМакетДокументаЗаявкаНаБронирование(МакАкт);
Макет = ПолучитьОбщийМакет("Акт");

Контрагент = Счет.Контрагент; 

ТекстЗаголовка = ПечатьАкта_Шапка(ТабДок, Макет, НомерАкта, ДатаАкта, Контрагент);  

СчетчикСтрок = 0; СуммаПечатиОбщая = 0;
ПечатьДокументаТело(ТабДок, Макет, СчетчикСтрок, СуммаПечатиОбщая, ДокументОбъект.Ссылка, Счет, УчитыватьНДС, Ложь
	, ПечатьАктаНаПолнуюСумму);

//
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

ИтогоСтр=Макет.ПолучитьОбласть("Подписи");
ИтогоСтр.Параметры.Исполнитель = ТекущаяОрганизация.ОрганизацияФИОРуководительДляДокументов;
ТабДок.Вывести(ИтогоСтр);
//

ТабДок.ВерхнийКолонтитул.ТекстВЦентре = ТекстЗаголовка;
ТабДок.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
ТабДок.ВерхнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.ВерхнийКолонтитул.Шрифт = мШрифт;
//ТабДок.ВерхнийКолонтитул.Выводить = Истина;
ТабДок.ВерхнийКолонтитул.Выводить = Ложь;

ТабДок.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы] из [&СтраницВсего]";
ТабДок.НижнийКолонтитул.Выводить = Истина;
ТабДок.НижнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.НижнийКолонтитул.Шрифт = мШрифт;

Возврат ТабДок;
КонецФункции

Функция ПечатьАкта_Шапка(ТабДок, Макет, Номер, Дата, Контрагент) Экспорт
// Заголовок

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

ТекстЗаголовка="Акт № " + Номер + " от "+ Формат(Дата, "ДФ=dd.MM.yy");

Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.ТекстЗаголовка = ТекстЗаголовка;
Область.Параметры.ЗаголовокОрганизация = "Гостиница " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " ИНН " + ТекущаяОрганизация.ИНН + " КПП " + ТекущаяОрганизация.КПП
	+ " " + ТекущаяОрганизация.ОрганизацияДляДокументов;
Область.Параметры.АдресОрганизации = ТекущаяОрганизация.ОрганизацияАдресДляДокументов;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Покупатель");
ПредставлениеКлиента = ОбщееСервер.ПолучитьПредставлениеКлиента(Контрагент);	
Область.Параметры.ПредставлениеПолучателя = ПредставлениеКлиента;	
ТабДок.Вывести(Область);

Возврат ТекстЗаголовка;
КонецФункции

Функция УбратьНезначащиеНули(Строка) Экспорт
Возврат ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Строка);	
КонецФункции	

//////

Функция ГрупповойСчетНомерДата(ГрупповойСчетОбъект) Экспорт
Номер = "Г-" + Строка(ГрупповойСчетОбъект.НомерСчета);
Дата = ГрупповойСчетОбъект.ДатаДокумента;	

Возврат Новый Структура("Номер, Дата", Номер, Дата); 
КонецФункции

//////

//
Функция ГрупповойСчетТелоСтроки(Счетчик, СуммаДляПечатиОбщая, СуммаДляПечатиОбщаяНДС
	, ЕстьНДС0, ЕстьНДСНе0
	, ГрупповойСчетОбъект) Экспорт
		
ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("Бронь");
ТЗ.Колонки.Добавить("КолвоЧеловек");
ТЗ.Колонки.Добавить("Категория");

ТЗ.Колонки.Добавить("НомерСтроки");
ТЗ.Колонки.Добавить("Клиент");
ТЗ.Колонки.Добавить("НаименованиеТовара");
//ТЗ.Колонки.Добавить("КодЕдиницыИзмерения");
ТЗ.Колонки.Добавить("ЕдиницаИзмерения");
ТЗ.Колонки.Добавить("Количество");
ТЗ.Колонки.Добавить("Цена");
ТЗ.Колонки.Добавить("НалоговаяСтавка");
ТЗ.Колонки.Добавить("СуммаНДС");
ТЗ.Колонки.Добавить("СуммаБезНДС");
ТЗ.Колонки.Добавить("СуммаСНДС");
ТЗ.Колонки.Добавить("ЭтоУслуга");
ТЗ.Колонки.Добавить("Дата");
ТЗ.Колонки.Добавить("ДатаС");	
ТЗ.Колонки.Добавить("ДатаПо");	
		
ДокументыДолги = ГрупповойСчетОбъект.ДокументыДолги.Выгрузить();
ДокументыДолги.Сортировать("ДокументДолг");

Если ДокументыДолги.Количество() = 0 тогда Возврат Неопределено; КонецЕсли; 	

ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(ГрупповойСчетОбъект);
УчитыватьНДС = ДокументыСервер.УчитыватьНДС(ДатаУчетаНДС);

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;

Контрагент = ГрупповойСчетОбъект.Контрагент; 

ТолькоПроживание = Ложь;
ТолькоУслуги = Ложь;

СвернутьВСчете = ГрупповойСчетОбъект.СвернутьВСчете;

сч=0;

ЕстьНДС0 = Ложь;
ЕстьНДСНе0 = Ложь;

СуммаДляПечатиОбщая = 0;
СуммаДляПечатиОбщаяНДС = 0;
Для каждого СтрокаТаблицы Из ДокументыДолги Цикл
	ДокументДолг = СтрокаТаблицы.ДокументДолг;
	СчетГУИД = СтрокаТаблицы.СчетГУИД;
	
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД); 
	Счета_М = ДокументДолг.Счета.НайтиСтроки(ОтборСтроки); 
	Если Счета_М.Количество() = 0 Тогда Продолжить; КонецЕсли; 
	Счет = Счета_М[0]; 
	
	СчетаДетальноДолги_М = ДокументДолг.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки); 
	
	ТоварКлиент = "" + ТоварКлиент(ДокументДолг, Счет);

	ИтогиЗаявка = ИтогиЗаявка(СчетаДетальноДолги_М, СтавкаНДС, ВсеСНДС);
	СуммаПроживание = ИтогиЗаявка.СуммаПроживание;
	КоличествоСуток = ИтогиЗаявка.КоличествоПроживание;
	СуммаУслуги = ИтогиЗаявка.СуммаУслуги;
	СуммаНДС = ИтогиЗаявка.СуммаНДС ;
	
	Если СвернутьВСчете тогда
		СуммаВсего = СуммаПроживание + СуммаУслуги;
		
		//Если  СуммаПроживание > 0 Тогда
		Если  СуммаВсего > 0 Тогда
			//СтрокаТабл = Макет.ПолучитьОбласть("Строка");
			
			СтрокаТабл = ТЗ.Добавить();
			
			сч=сч+1;
			СтрокаТабл.НомерСтроки = сч;
			
			СтрокаТабл.Бронь = ДокументДолг;
			СтрокаТабл.Категория = ДокументДолг.КатегорияНомера.Наименование;
			СтрокаТабл.КолвоЧеловек = ДокументДолг.КолвоЧеловек;

			СтрокаТабл.Клиент = ТоварКлиент;
			
			НаименованиеТовара = ТоварКлиент + ". Услуги гостиницы" 
				+ " с "+ Формат(Счет.ДатаС, "ДФ=dd.MM.yy")+ " по "+ Формат(Счет.ДатаПо, "ДФ=dd.MM.yy");
			СтрокаТабл.НаименованиеТовара = НаименованиеТовара;
			
			СтрокаТабл.ДатаС = Счет.ДатаС;
			СтрокаТабл.ДатаПо = Счет.ДатаПо;
			
			Если КоличествоСуток = 0 Тогда
				 КоличествоСуток = 1;
			КонецЕсли;
			СтрокаТабл.Количество = КоличествоСуток;
			СтрокаТабл.ЕдиницаИзмерения="сутки";
			
			//Сумма = СуммаПроживание;
			Сумма = СуммаВсего;
			
			СтрокаТабл.Цена=?(КоличествоСуток = 0, 0, Окр(Сумма/КоличествоСуток,2));
			СтрокаТабл.СуммаСНДС = Сумма;
			
			//ТабДок.Вывести(СтрокаТабл);
			
			ЕстьНДС0 = Истина;	
		КонецЕсли;	
		
		//Если  СуммаУслуги > 0 Тогда
		//	//СтрокаТабл = Макет.ПолучитьОбласть("Строка");
		//	
		//	СтрокаТабл = ТЗ.Добавить();
		//	
		//	сч=сч+1;
		//	СтрокаТабл.НомерСтроки = сч;
		//	
		//	СтрокаТабл.Бронь = ДокументДолг;
		//	//СтрокаТабл.Категория = ДокументДолг.КатегорияНомера.Наименование;
		//	//СтрокаТабл.КолвоЧеловек = ДокументДолг.КолвоЧеловек;
		//	
		//	СтрокаТабл.Клиент = ТоварКлиент;

		//	НаименованиеТовара = ТоварКлиент + ". Дополнительные услуги гостиницы" 
		//		+ " с "+ Формат(Счет.ДатаС, "ДФ=dd.MM.yy")+ " по "+ Формат(Счет.ДатаПо, "ДФ=dd.MM.yy");
		//	СтрокаТабл.НаименованиеТовара = НаименованиеТовара;
		//		
		//	СтрокаТабл.ДатаС = Счет.ДатаС;
		//	СтрокаТабл.ДатаПо = Счет.ДатаПо;
		//	
		//	Количество = 1;
		//	
		//	СтрокаТабл.Количество = Количество;
		//	СтрокаТабл.ЕдиницаИзмерения="шт";
		//	
		//	Сумма = СуммаУслуги;
		//	
		//	СтрокаТабл.Цена = Сумма;
		//	СтрокаТабл.СуммаСНДС = Сумма;
		//				
		//	СтрокаТабл.ЭтоУслуга = Истина;
		//	//ТабДок.Вывести(СтрокаТабл);
		//	
		//	ЕстьНДСНе0 = Истина;		
		//КонецЕсли;	
		//
		
	иначе
		
		Если СуммаПроживание <> 0 Тогда
			//СтрокаТабл = Макет.ПолучитьОбласть("Строка");
			
			СтрокаТабл = ТЗ.Добавить();
			
			сч=сч+1;
			СтрокаТабл.НомерСтроки = сч;
			
			СтрокаТабл.Бронь = ДокументДолг;
			СтрокаТабл.Категория = ДокументДолг.КатегорияНомера.Наименование;
			СтрокаТабл.КолвоЧеловек = ДокументДолг.КолвоЧеловек;
			
			СтрокаТабл.Клиент = ТоварКлиент;
			
			НаименованиеТовара = ТоварКлиент + ". Услуги гостиницы" 
				+ " с "+ Формат(Счет.ДатаС, "ДФ=dd.MM.yy")+ " по "+ Формат(Счет.ДатаПо, "ДФ=dd.MM.yy");
			СтрокаТабл.НаименованиеТовара = НаименованиеТовара;
				
			СтрокаТабл.ДатаС = Счет.ДатаС;
			СтрокаТабл.ДатаПо = Счет.ДатаПо;
			
			Если КоличествоСуток = 0 Тогда
				 КоличествоСуток = 1;
			КонецЕсли;
			СтрокаТабл.Количество = КоличествоСуток;
			СтрокаТабл.ЕдиницаИзмерения="сутки";
			
			СуммаДляПечати = СуммаПроживание;
			
			СтрокаТабл.Цена=?(КоличествоСуток = 0, 0, Окр(СуммаДляПечати/КоличествоСуток,2));
			СтрокаТабл.СуммаСНДС = СуммаДляПечати;
						
			//ТабДок.Вывести(СтрокаТабл);
			
			ЕстьНДС0 = Истина;		
		КонецЕсли;	
		//
		
		Для каждого Стр Из СчетаДетальноДолги_М Цикл
			Если НЕ Стр.Услуга Тогда Продолжить; КонецЕсли;
			Если Стр.ПрограммныйКодУслуги = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ 
			Тогда Продолжить; КонецЕсли;
			
			//СтрокаТабл = Макет.ПолучитьОбласть("Строка");
			СтрокаТабл = ТЗ.Добавить();
			
			сч=сч+1;
			СтрокаТабл.НомерСтроки = сч;
			
			СтрокаТабл.Бронь = ДокументДолг;
			//СтрокаТабл.Категория = ДокументДолг.КатегорияНомера.Наименование;
			//СтрокаТабл.КолвоЧеловек = ДокументДолг.КолвоЧеловек;
			
			СтрокаТабл.Клиент = ТоварКлиент;
			
			//Товар = ТоварКлиент + Стр.НаименованиеДолг;
			НаименованиеТовара = ТоварКлиент
				+ " " + ?(ЗначениеЗаполнено(Стр.НазваниеДляЧека), Стр.НазваниеДляЧека, Стр.НаименованиеДолг)
				+ " " + Формат(Стр.ДатаДолг, "ДФ=dd.MM.yy");
			СтрокаТабл.НаименованиеТовара = НаименованиеТовара;
			
			СтрокаТабл.Дата = Стр.ДатаДолг;
			
			СтрокаТабл.ДатаС = Счет.ДатаС;
			СтрокаТабл.ДатаПо = Счет.ДатаПо;

			Если Стр.Количество = 0 Тогда
				 Количество = 1;
			Иначе
				 Количество = Стр.Количество;
			КонецЕсли;	 
			СтрокаТабл.Количество = Количество;
			
			СтрокаТабл.ЕдиницаИзмерения="шт";
				
			СтрокаТабл.Цена = Окр(Стр.СуммаДолг/Количество,2);
			СтрокаТабл.СуммаСНДС = Стр.СуммаДолг;
		
			//ТабДок.Вывести(СтрокаТабл);
			
			СтрокаТабл.ЭтоУслуга = Истина;
			
			ЕстьНДСНе0 = Истина;		
		КонецЦикла; 
	КонецЕсли;
	
	СуммаДляПечатиОбщая = СуммаДляПечатиОбщая + СуммаПроживание + СуммаУслуги;		
	СуммаДляПечатиОбщаяНДС = СуммаДляПечатиОбщаяНДС + СуммаНДС;		
КонецЦикла; 

//ИтогоСтр=Макет.ПолучитьОбласть("Итоги");
//ИтогоСтр.Параметры.Всего = СуммаДляПечатиОбщая;
//ТабДок.Вывести(ИтогоСтр);

//ПечатьИтогиНДС(ТабДок, Макет, УчитыватьНДС, ВсеСНДС, СтавкаНДС, СуммаДляПечатиОбщаяНДС, СвернутьВСчете
//	, ЕстьНДС0, ЕстьНДСНе0);

//Если ПечататьВсегоКоплате Тогда
//	ИтогоСтр=Макет.ПолучитьОбласть("ВсегоКОплате");
//	ИтогоСтр.Параметры.ВсегоКОплате = СуммаДляПечатиОбщая;
//	ТабДок.Вывести(ИтогоСтр);
//КонецЕсли;
	
Счетчик = сч;
Возврат ТЗ;
КонецФункции

Функция ПечатьГрупповогоСчетаТело(ТабДок, Макет, Счетчик, СуммаДляПечатиОбщая, СуммаДляПечатиОбщаяНДС
	, ГрупповойСчетОбъект, ПечататьВсегоКоплате) Экспорт
		
		
ДокументыДолги = ГрупповойСчетОбъект.ДокументыДолги.Выгрузить();
ДокументыДолги.Сортировать("ДокументДолг");

Если ДокументыДолги.Количество() = 0 тогда Возврат Неопределено; КонецЕсли; 	

ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(ГрупповойСчетОбъект);
УчитыватьНДС = ДокументыСервер.УчитыватьНДС(ДатаУчетаНДС);

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;

//Контрагент = ГрупповойСчетОбъект.Контрагент; 

//ТолькоПроживание = Ложь;
//ТолькоУслуги = Ложь;

СвернутьВСчете = ГрупповойСчетОбъект.СвернутьВСчете;

сч=0;

ЕстьНДС0 = Ложь;
ЕстьНДСНе0 = Ложь;

СуммаДляПечатиОбщая = 0;
СуммаДляПечатиОбщаяНДС = 0;

ГрупповойСчетТелоСтроки = ГрупповойСчетТелоСтроки(Счетчик, СуммаДляПечатиОбщая, СуммаДляПечатиОбщаяНДС
	, ЕстьНДС0, ЕстьНДСНе0 
	, ГрупповойСчетОбъект);		

Для каждого СтрокаГрупповойСчетТелоСтроки Из ГрупповойСчетТелоСтроки Цикл
		СтрокаТабл = Макет.ПолучитьОбласть("Строка");
		
		СтрокаТабл.Параметры.НомерСтроки = СтрокаГрупповойСчетТелоСтроки.НомерСтроки;
		
		СтрокаТабл.Параметры.Товар = СтрокаГрупповойСчетТелоСтроки.НаименованиеТовара;
			
		СтрокаТабл.Параметры.Количество = СтрокаГрупповойСчетТелоСтроки.Количество;
		
		СтрокаТабл.Параметры.ЕдиницаИзмерения = СтрокаГрупповойСчетТелоСтроки.ЕдиницаИзмерения;
			
		СтрокаТабл.Параметры.Цена = СтрокаГрупповойСчетТелоСтроки.Цена;
		СтрокаТабл.Параметры.Сумма = СтрокаГрупповойСчетТелоСтроки.СуммаСНДС;
	
		ТабДок.Вывести(СтрокаТабл);
КонецЦикла; 

ИтогоСтр=Макет.ПолучитьОбласть("Итоги");
ИтогоСтр.Параметры.Всего = СуммаДляПечатиОбщая;
ТабДок.Вывести(ИтогоСтр);

ПечатьИтогиНДС(ТабДок, Макет, УчитыватьНДС, ВсеСНДС, СтавкаНДС, СуммаДляПечатиОбщаяНДС, СвернутьВСчете
	, ЕстьНДС0, ЕстьНДСНе0);

Если ПечататьВсегоКоплате Тогда
	ИтогоСтр=Макет.ПолучитьОбласть("ВсегоКОплате");
	ИтогоСтр.Параметры.ВсегоКОплате = СуммаДляПечатиОбщая;
	ТабДок.Вывести(ИтогоСтр);
КонецЕсли;
	
Счетчик = сч;
Возврат ТабДок;
КонецФункции
//

//
Функция ПечатьГрупповогоСчета(ГрупповойСчетОбъект) Экспорт
ТабДок = Новый ТабличныйДокумент;	

ГрупповойСчетНомерДата = ГрупповойСчетНомерДата(ГрупповойСчетОбъект); 
НомерДокумента = ГрупповойСчетНомерДата.Номер;
//ДатаДокумента = ГрупповойСчетНомерДата.Дата;
ДатаДокумента = ГрупповойСчетОбъект.ДатаСчета;

Контрагент = ГрупповойСчетОбъект.Контрагент;  
Если Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда
	Макет = ПолучитьОбщийМакет("СчетЮрЛицо");	
	ТекстЗаголовка = ПечатьСчетаЮрЛицоШапка_Счет(ТабДок, Макет, НомерДокумента, ДатаДокумента, Контрагент);	
Иначе
	Макет = ПолучитьОбщийМакет("СчетФизЛицо");	
	ТекстЗаголовка = ПечатьСчетаФизЛицоШапка_Счет(ТабДок, Макет, НомерДокумента, ДатаДокумента, ГрупповойСчетОбъект.Ссылка, Неопределено);	
КонецЕсли;
	
СуммаДляПечатиОбщая = 0; СуммаДляПечатиОбщаяНДС = 0; Счетчик = 0;
ПечатьГрупповогоСчетаТело(ТабДок, Макет, Счетчик, СуммаДляПечатиОбщая, СуммаДляПечатиОбщаяНДС, ГрупповойСчетОбъект, Истина);

УчитыватьНДС = ДокументыСервер.УчитыватьНДС(ДатаДокумента);

Если Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда
	 ПечатьСчетаЮрЛицоПодвал_Счет(ТабДок, Макет);	
Иначе
	 ПечатьСчетаФизЛицоПодвал(ТабДок, Макет);	
КонецЕсли;	 

ТабДок.ОтображатьСетку = Ложь; ТабДок.Защита = Ложь; ТабДок.ТолькоПросмотр = Истина; ТабДок.ОтображатьЗаголовки = Ложь;

Возврат ТабДок;
КонецФункции

Процедура ПечатьГрупповогоСчетаПодвал(ТабДок, Макет, Счетчик, СуммаДляПечатиОбщая, ТекстЗаголовка) Экспорт

ИтогоСтр=Макет.ПолучитьОбласть("СуммаПрописью");  
ИтогоСтр.Параметры.ИтоговаяСтрока="Всего "+Строка(Счетчик) + " наименований на сумму:";
ИтогоСтр.Параметры.СуммаПрописью=ЧислоПрописью(СуммаДляПечатиОбщая,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
ТабДок.Вывести(ИтогоСтр);	

ИтогоСтр=Макет.ПолучитьОбласть("ПодвалСчета");
ТабДок.Вывести(ИтогоСтр);

ТабДок.ОтображатьСетку = Ложь; ТабДок.Защита = Ложь; ТабДок.ТолькоПросмотр = Истина; ТабДок.ОтображатьЗаголовки = Ложь;

ТабДок.ВерхнийКолонтитул.ТекстВЦентре = ТекстЗаголовка;
ТабДок.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
ТабДок.ВерхнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.ВерхнийКолонтитул.Шрифт = мШрифт;
//ТабДок.ВерхнийКолонтитул.Выводить = Истина;
ТабДок.ВерхнийКолонтитул.Выводить = Ложь;

ТабДок.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы] из [&СтраницВсего]";
ТабДок.НижнийКолонтитул.Выводить = Истина;
ТабДок.НижнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.НижнийКолонтитул.Шрифт = мШрифт;

КонецПроцедуры
//

Функция ПечатьГрупповогоАкта(ГрупповойСчетОбъект) Экспорт
ТабДок = Новый ТабличныйДокумент;	
	
Макет =ПолучитьОбщийМакет("Акт");
ТекстЗаголовка = ПечатьГрупповогоАктаШапка(ТабДок, Макет, ТекстЗаголовка, ГрупповойСчетОбъект);	

СуммаДляПечатиОбщая = 0; СуммаДляПечатиОбщаяНДС = 0; Счетчик = 0;
ПечатьГрупповогоСчетаТело(ТабДок, Макет, Счетчик, СуммаДляПечатиОбщая, СуммаДляПечатиОбщаяНДС, ГрупповойСчетОбъект, Ложь);

ПечатьГрупповогоАктаПодвал(ТабДок, Макет, Счетчик, СуммаДляПечатиОбщая, ТекстЗаголовка);

ТабДок.ОтображатьСетку = Ложь; ТабДок.Защита = Ложь; ТабДок.ТолькоПросмотр = Истина; ТабДок.ОтображатьЗаголовки = Ложь;

Возврат ТабДок;
КонецФункции/////

Функция ПечатьГрупповогоАктаШапка(ТабДок, Макет, ТекстЗаголовка, ГрупповойСчетОбъект) Экспорт
Контрагент = ГрупповойСчетОбъект.Контрагент; 

ГрупповойСчетНомерДата = ГрупповойСчетНомерДата(ГрупповойСчетОбъект); 
НомерДокумента = ГрупповойСчетНомерДата.Номер;
ДатаДокумента = ГрупповойСчетНомерДата.Дата;

Макет = ПолучитьОбщийМакет("Акт");
ТекстЗаголовка = ПечатьАкта_Шапка(ТабДок, Макет, НомерДокумента, ДатаДокумента, Контрагент);       

Возврат ТекстЗаголовка;
КонецФункции

Функция ПечатьГрупповогоАктаПодвал(ТабДок, Макет, Счетчик, СуммаДляПечатиОбщая, ТекстЗаголовка) Экспорт
ИтогоСтр=Макет.ПолучитьОбласть("СуммаПрописью");  
ИтогоСтр.Параметры.ИтоговаяСтрока="Всего оказанно услуг на сумму:";
ИтогоСтр.Параметры.СуммаПрописью=ЧислоПрописью(СуммаДляПечатиОбщая,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
ТабДок.Вывести(ИтогоСтр);	

ИтогоСтр=Макет.ПолучитьОбласть("Подписи");
ТабДок.Вывести(ИтогоСтр);

ТабДок.ОтображатьСетку = Ложь; ТабДок.Защита = Ложь; ТабДок.ТолькоПросмотр = Истина; ТабДок.ОтображатьЗаголовки = Ложь;
ТабДок.ОтображатьГруппировки = Ложь;

ТабДок.ВерхнийКолонтитул.ТекстВЦентре = ТекстЗаголовка;
ТабДок.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
ТабДок.ВерхнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.ВерхнийКолонтитул.Шрифт = мШрифт;
//ТабДок.ВерхнийКолонтитул.Выводить = Истина;
ТабДок.ВерхнийКолонтитул.Выводить = Ложь;

ТабДок.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы] из [&СтраницВсего]";
ТабДок.НижнийКолонтитул.Выводить = Истина;
ТабДок.НижнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.НижнийКолонтитул.Шрифт = мШрифт;

Возврат ТабДок;
КонецФункции/////

//////

/////
Функция ДополнениеТекст(ДокументДолгСсылка) Экспорт
//Организация = ОбщийМодульНастройки.ПолучитьТекущуюОрганизацию();
//ДополнениеТекст = " от " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") 
//	+ " Номер заявки " +  ДокументДолгСсылка.Номер + " от " + Формат(ДокументДолгСсылка.Дата, "ДФ=dd.MM.yyyy"); 	
	
ДополнениеТекст = "Номер заявки " +  ДокументДолгСсылка.Номер + " от " + Формат(ДокументДолгСсылка.Дата, "ДФ=dd.MM.yyyy"); 	
	
Возврат ДополнениеТекст;
КонецФункции

Функция ОрганизацияНаименование() Экспорт
Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
	
Возврат Организация.Наименование;
КонецФункции

/////
Функция ПечатьСчетаФактураНаСервере(ТС, ДокументОбъект) Экспорт
Счет = ДокументОбъект.Счета.НайтиПоИдентификатору(ТС);

НомерАктаДатаАкта = ПечатьСервер.НомерДатаДокумента(ДокументОбъект, Счет.НомерСчета, Счет.ДатаПо);
Номер = НомерАктаДатаАкта.Номер;
Дата =  НомерАктаДатаАкта.Дата;

ДокументОтгрузки = "Акт № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
	
ТабДок = ПечатьСервер.ПечатьСчетаФактуры(Номер, Дата, ДокументОбъект.Ссылка, Счет);

Возврат ТабДок;	
КонецФункции

Функция ПечатьСчетаФактуры(Номер, Дата, Заявка, Счет) Экспорт
ТабДок = Новый ТабличныйДокумент;	
	
Макет = ПолучитьОбщийМакет("СчетФактураМакет");

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; 
//ДатаУчетаНДС = Счет.Ссылка.РезервПо; 
ДатаУчетаНДС = Счет.ДатаПо;

СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС; 

Область = Макет.ПолучитьОбласть("Заголовок");

Область.Параметры.Номер = Номер;
Область.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");

ДокументОтгрузки = "Акт № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
Область.Параметры.ДокументОтгрузки = ДокументОтгрузки;
	
Продавец = ТекущаяОрганизация.ОрганизацияДляДокументов;
АдресПродавца = ТекущаяОрганизация.ОрганизацияАдресДляДокументов;
ИННКПППродавца = ТекущаяОрганизация.ИНН + "/" + ТекущаяОрганизация.КПП;

Область.Параметры.Продавец = Продавец;
Область.Параметры.АдресПродавца = АдресПродавца;
Область.Параметры.ИННКПППродавца = ИННКПППродавца;

Контрагент = Счет.Контрагент;
Область.Параметры.Покупатель = ?(ЗначениеЗаполнено(Контрагент.НаименованиеЮрЛица)
									, Контрагент.НаименованиеЮрЛица, Контрагент.Наименование);
Область.Параметры.АдресПокупателя = Контрагент.Адрес;
Область.Параметры.ИННКПППокупателя = Контрагент.ИНН + "/" + Контрагент.КПП;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
СчетаДетальноДолги_П = Заявка.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
ИтогиЗаявка = ИтогиЗаявка(СчетаДетальноДолги_П, СтавкаНДС, ВсеСНДС);

ВсегоСуммаПроживание = ИтогиЗаявка.СуммаПроживание;
ВсегоКоличествоПроживание = ИтогиЗаявка.КоличествоПроживание;
ВсегоСуммаУслуги = ИтогиЗаявка.СуммаУслуги;
ВсегоСуммаНДС = ИтогиЗаявка.СуммаНДС;

//ТЗ = СчетФактураСтроки(СчетаДетальноДолги, СвернутьВСчете);


ТЗСтроки = ПечатьСервер.СчетФактураСтроки(Заявка, Счет);


ИтогоСумма = 0;
ИтогоСуммаБезНДС = 0;
ИтогоСуммаНДС = 0;
	
Для Каждого Строка Из ТЗСтроки Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.НомерСтроки = Строка.НомерСтроки;
	
	Область.Параметры.НаименованиеТовара = Строка.НаименованиеТовара; 
	
	Область.Параметры.КодЕдиницыИзмерения =Строка.КодЕдиницыИзмерения;
	Область.Параметры.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;
	
	Область.Параметры.Количество = Строка.Количество;
	Область.Параметры.Цена = Строка.Цена;
	
	Область.Параметры.НалоговаяСтавка = Строка.НалоговаяСтавка;

	Область.Параметры.СуммаНДС = Строка.СуммаНДС;
	Область.Параметры.СуммаБезНДС = Строка.СуммаБезНДС;
	Область.Параметры.СуммаСНДС = Строка.СуммаСНДС;
	
	ТабДок.Вывести(Область);
	
	ИтогоСуммаБезНДС = ИтогоСуммаБезНДС + Строка.СуммаБезНДС;
	ИтогоСуммаНДС = ИтогоСуммаНДС + Строка.СуммаНДС;
	ИтогоСумма = ИтогоСумма + Строка.СуммаСНДС;
КонецЦикла;
	
Область = Макет.ПолучитьОбласть("Итоги");

Область.Параметры.СуммаБезНДС = ИтогоСуммаБезНДС;
Область.Параметры.СуммаНДС = ИтогоСуммаНДС;
Область.Параметры.СуммаСНДС = ИтогоСумма;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Подвал");

Область.Параметры.Руководитель =  ТекущаяОрганизация.ОрганизацияФИОРуководительДляДокументов;
Область.Параметры.Бухгалтер =  ТекущаяОрганизация.ОрганизацияФИОБухгалтерДляСчетаФактуры;

ТабДок.Вывести(Область);

ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
ТабДок.АвтоМасштаб = Истина;

Возврат ТабДок;
КонецФункции

Функция СчетФактураСтроки(ДокументДолгСсылка, Счет) Экспорт
ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
СчетаДетальноДолги = ДокументДолгСсылка.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

СвернутьВСчете = Счет.СвернутьВСчете;

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; 
ДатаУчетаНДС = ДокументДолгСсылка.РезервПо;
СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС; 

ИтогиЗаявка = ИтогиЗаявка(СчетаДетальноДолги, СтавкаНДС, ВсеСНДС);

ВсегоСуммаПроживание = ИтогиЗаявка.СуммаПроживание;
ВсегоКоличествоПроживание = ИтогиЗаявка.КоличествоПроживание;
ВсегоСуммаУслуги = ИтогиЗаявка.СуммаУслуги;
ВсегоСуммаНДС = ИтогиЗаявка.СуммаНДС;

ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("НомерСтроки");
ТЗ.Колонки.Добавить("НаименованиеТовара");
ТЗ.Колонки.Добавить("КодЕдиницыИзмерения");
ТЗ.Колонки.Добавить("ЕдиницаИзмерения");
ТЗ.Колонки.Добавить("Количество");
ТЗ.Колонки.Добавить("Цена");
ТЗ.Колонки.Добавить("НалоговаяСтавка");
ТЗ.Колонки.Добавить("СуммаНДС");
ТЗ.Колонки.Добавить("СуммаБезНДС");
ТЗ.Колонки.Добавить("СуммаСНДС");
ТЗ.Колонки.Добавить("ЭтоУслуга");
ТЗ.Колонки.Добавить("Дата");

ТоварКлиент = ТоварКлиент(ДокументДолгСсылка, Счет); 

сч =0;
Если СвернутьВСчете Тогда
	СтрокаТЗ = ТЗ.Добавить();
	
	СтрокаТЗ.НомерСтроки = сч;
	
	ДатаС = ИтогиЗаявка.ДатаС_Проживание; 
	Если ЗначениеЗаполнено(ДатаС) Тогда
		ДатаПо = ИтогиЗаявка.ДатаПо_Проживание + 24 * 60 * 60;
	Иначе 
		ДатаС = ИтогиЗаявка.ДатаС_Услуги; 
		Если ЗначениеЗаполнено(ДатаС) Тогда
			ДатаПо = ИтогиЗаявка.ДатаПо_Услуги;
		КонецЕсли;
	КонецЕсли;
	
	НаименованиеТовара = "" + ТоварКлиент + ", услуги по предоставлению мест для временного проживания в гостинице";
	Если ЗначениеЗаполнено(ДатаС) Тогда
		Если ДатаС = ДатаПо Тогда
			ДатаСПо = " " + Формат(ДатаС, "ДФ=dd.MM.yy"); 
		Иначе
			ДатаСПо = " с " + Формат(ДатаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаПо, "ДФ=dd.MM.yy"); 
		КонецЕсли;
	Иначе		
		ДатаСПо = "";
	КонецЕсли;
		
	СтрокаТЗ.НаименованиеТовара = НаименованиеТовара + ДатаСПо; 
	
	СтрокаТЗ.КодЕдиницыИзмерения = "359"; 
	СтрокаТЗ.ЕдиницаИзмерения = "сутки";
	
	Если ВсегоКоличествоПроживание = 0 Тогда
		 ВсегоКоличествоПроживание = 1;
	КонецЕсли;
	
	Сумма = ВсегоСуммаПроживание + ВсегоСуммаУслуги; 
	
	СтрокаТЗ.Количество = ВсегоКоличествоПроживание;
	СтрокаТЗ.Цена = Окр(Сумма / ВсегоКоличествоПроживание, 2);
	
	Если ВсеСНДС Тогда
		СтрокаТЗ.НалоговаяСтавка = СтавкаНДС;
		
		СуммаНДС = ВсегоСуммаНДС;
		СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, Сумма);
	Иначе
		Если СтрокаТЗ.НалоговаяСтавка = Перечисления.СтавкиНДС.БезНДС
		ИЛИ СтрокаТЗ.НалоговаяСтавка = Перечисления.СтавкиНДС.ПустаяСсылка()
		Тогда 
			СтавкаНДС_П = СтавкаНДС;
		Иначе	
			СтавкаНДС_П = Перечисления.СтавкиНДС.НДС0;
		КонецЕсли;
		
		СтрокаТЗ.НалоговаяСтавка = СтавкаНДС_П;
		
		СуммаНДС = 0;
		СуммаБезНДС = Сумма;
	КонецЕсли;
	
	СтрокаТЗ.СуммаНДС = СуммаНДС;
	СтрокаТЗ.СуммаБезНДС = СуммаБезНДС;
	СтрокаТЗ.СуммаСНДС = Сумма;
	
	СтрокаТЗ.ЭтоУслуга = Ложь;
	СтрокаТЗ.Дата = '00010101';
Иначе
	Сумма = ВсегоСуммаПроживание; 

	Если Сумма <> 0 Тогда		
		
		СтрокаТЗ = ТЗ.Добавить();
		
		сч = сч + 1;
		СтрокаТЗ.НомерСтроки = сч;
		
		ДатаС = ИтогиЗаявка.ДатаС_Проживание; 
		ДатаПо = ИтогиЗаявка.ДатаПо_Проживание + 24 * 60 * 60;
		
		НаименованиеТовара = "" + ТоварКлиент + ", услуги по предоставлению мест для временного проживания в гостинице"
			+ " с " + Формат(ДатаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаПо, "ДФ=dd.MM.yy"); 
		
		СтрокаТЗ.НаименованиеТовара = НаименованиеТовара; 
		
		СтрокаТЗ.КодЕдиницыИзмерения = "359";
		СтрокаТЗ.ЕдиницаИзмерения = "сутки";
		
		Если ВсегоКоличествоПроживание = 0 Тогда
			 ВсегоКоличествоПроживание = 1;
		КонецЕсли;
		
		СтрокаТЗ.Количество = ВсегоКоличествоПроживание;
		СтрокаТЗ.Цена = Окр(Сумма / ВсегоКоличествоПроживание, 2);
		
		Если ВсеСНДС Тогда
			СтавкаНДС_П = СтавкаНДС;
			
			СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, Сумма);
			СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, Сумма);
		Иначе	
			Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС
			ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка()
			Тогда 
				СтавкаНДС_П = СтавкаНДС;
			Иначе	
				СтавкаНДС_П = Перечисления.СтавкиНДС.НДС0;
			КонецЕсли;
			
			СуммаНДС = 0;
			СуммаБезНДС = Сумма;
		КонецЕсли;
	
		СтрокаТЗ.НалоговаяСтавка = СтавкаНДС_П;
		
		СтрокаТЗ.СуммаНДС = СуммаНДС;
		СтрокаТЗ.СуммаБезНДС = СуммаБезНДС;
		СтрокаТЗ.СуммаСНДС = Сумма;
		
		СтрокаТЗ.ЭтоУслуга = Ложь;
		СтрокаТЗ.Дата = '00010101';
	КонецЕсли;

	Для Каждого Строка Из СчетаДетальноДолги Цикл
		Если НЕ Строка.Услуга Тогда Продолжить; КонецЕсли;
		Если Строка.ПрограммныйКодУслуги = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ
		Тогда Продолжить; КонецЕсли;
		
		СтрокаТЗ = ТЗ.Добавить();
		
		сч = сч + 1;
	    СтрокаТЗ.НомерСтроки = сч;
		
		НаименованиеТовара = НаименованиеДляДокумента(Строка);
		НаименованиеТовара = "" + ТоварКлиент + ". " + НаименованиеТовара;
		
		СтрокаТЗ.НаименованиеТовара = НаименованиеТовара;

		СтрокаТЗ.КодЕдиницыИзмерения = "796";
		СтрокаТЗ.ЕдиницаИзмерения = "шт";
		
		Если Строка.Количество = 0 Тогда
		     Количество = 1;
		Иначе
		     Количество = Строка.Количество;
		КонецЕсли;
			
		СтрокаТЗ.Количество = Количество;
		СтрокаТЗ.Цена = Строка.Цена;
		
		СтрокаТЗ.НалоговаяСтавка = СтавкаНДС;
		
		СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, Строка.СуммаДолг);
		СтрокаТЗ.СуммаБезНДС = СуммаБезНДС;
		
		СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, Строка.СуммаДолг);;
		СтрокаТЗ.СуммаНДС = СуммаНДС;

		СтрокаТЗ.СуммаСНДС = Строка.СуммаДолг;
		
		СтрокаТЗ.ЭтоУслуга = Истина;
		СтрокаТЗ.Дата = Строка.ДатаДолг;
	КонецЦикла;	
КонецЕсли;

Возврат ТЗ;
КонецФункции

Функция ТоварКлиент(ДокументДолгСсылка, Счет) Экспорт
Клиент = Счет.Клиент;
	
Если Счет.РазделитьСчет Тогда
	ТоварКлиент = Клиент;
Иначе
	Клиент2 = ДокументДолгСсылка.Клиент2;
	Если ЗначениеЗаполнено(Клиент2)  
	И Клиент <> Клиент2 Тогда 
		ТоварКлиент = "" + Клиент + ", " + Клиент2;
	Иначе
		ТоварКлиент = Клиент;
	КонецЕсли;	
КонецЕсли;	

Возврат ТоварКлиент;
КонецФункции
//

//
Функция ПечатьУПДНаСервере(ТС, ДокументОбъект) Экспорт
Счет = ДокументОбъект.Счета.НайтиПоИдентификатору(ТС);

НомерАктаДатаАкта = ПечатьСервер.НомерДатаДокумента(ДокументОбъект, Счет.НомерСчета, Счет.ДатаПо);
Номер = НомерАктаДатаАкта.Номер;
Дата =  НомерАктаДатаАкта.Дата;

ДокументОтгрузки = "Акт № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
	
ТабДок = ПечатьСервер.ПечатьУПД(Номер, Дата, ДокументОбъект.Ссылка, Счет);

Возврат ТабДок;	
КонецФункции

Функция ПечатьУПД(Номер, Дата, Заявка, Счет) Экспорт
ТабДок = Новый ТабличныйДокумент;	
	
Макет = ПолучитьОбщийМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент2026");

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; 
//ДатаУчетаНДС = Счет.Ссылка.РезервПо; 
ДатаУчетаНДС = Счет.ДатаПо;

СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС; 

Область = Макет.ПолучитьОбласть("Шапка");

Область.Параметры.СтатусУПД = 1;

Область.Параметры.Номер = Номер;
Область.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");

ДокументОтгрузки = "Акт № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
Область.Параметры.ДокументыОбОтгрузке = ДокументОтгрузки;
	
Продавец = ТекущаяОрганизация.ОрганизацияДляДокументов;
АдресПродавца = ТекущаяОрганизация.ОрганизацияАдресДляДокументов;
ИННКПППродавца = ТекущаяОрганизация.ИНН + "/" + ТекущаяОрганизация.КПП;

Область.Параметры.ПредставлениеПоставщика = Продавец;
Область.Параметры.АдресПоставщика = АдресПродавца;
Область.Параметры.ИННПоставщика	 = ИННКПППродавца;

Контрагент = Счет.Контрагент;
Область.Параметры.ПредставлениеПокупателя = ?(ЗначениеЗаполнено(Контрагент.НаименованиеЮрЛица)
									, Контрагент.НаименованиеЮрЛица, Контрагент.Наименование);
Область.Параметры.АдресПокупателя = Контрагент.Адрес;
Область.Параметры.ИННПокупателя	 = Контрагент.ИНН + "/" + Контрагент.КПП;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
ТабДок.Вывести(Область);

ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
СчетаДетальноДолги_П = Заявка.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
ИтогиЗаявка = ИтогиЗаявка(СчетаДетальноДолги_П, СтавкаНДС, ВсеСНДС);

ВсегоСуммаПроживание = ИтогиЗаявка.СуммаПроживание;
ВсегоКоличествоПроживание = ИтогиЗаявка.КоличествоПроживание;
ВсегоСуммаУслуги = ИтогиЗаявка.СуммаУслуги;
ВсегоСуммаНДС = ИтогиЗаявка.СуммаНДС;

//ТЗ = СчетФактураСтроки(СчетаДетальноДолги, СвернутьВСчете);


ТЗСтроки = ПечатьСервер.УПДСтроки(Заявка, Счет);


ИтогоСумма = 0;
ИтогоСуммаБезНДС = 0;
ИтогоСуммаНДС = 0;
	
Для Каждого Строка Из ТЗСтроки Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.НомерСтроки = Строка.НомерСтроки;
	
	Область.Параметры.ТоварНаименование = Строка.НаименованиеТовара; 
	
	Область.Параметры.ЕдиницаИзмеренияКод =Строка.КодЕдиницыИзмерения;
	Область.Параметры.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;
	
	Область.Параметры.Количество = Строка.Количество;
	Область.Параметры.Цена = Строка.Цена;
	
	Область.Параметры.Стоимость = Строка.СуммаБезНДС;
	
	Область.Параметры.СтавкаНДС = Строка.НалоговаяСтавка;

	Область.Параметры.СуммаНДС = Строка.СуммаНДС;
	Область.Параметры.Всего = Строка.СуммаСНДС;
	
	ТабДок.Вывести(Область);
	
	ИтогоСуммаБезНДС = ИтогоСуммаБезНДС + Строка.СуммаБезНДС;
	ИтогоСуммаНДС = ИтогоСуммаНДС + Строка.СуммаНДС;
	ИтогоСумма = ИтогоСумма + Строка.СуммаСНДС;
КонецЦикла;
	
Область = Макет.ПолучитьОбласть("Итого");

Область.Параметры.ИтогоСтоимость = ИтогоСуммаБезНДС;
Область.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДС;
Область.Параметры.ИтогоВсего = ИтогоСумма;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Подвал");

Область.Параметры.ФИОРуководителя =  ТекущаяОрганизация.ОрганизацияФИОРуководительДляДокументов;
Область.Параметры.ФИОГлавногоБухгалтера =  ТекущаяОрганизация.ОрганизацияФИОБухгалтерДляСчетаФактуры;

ТабДок.Вывести(Область);

ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
ТабДок.АвтоМасштаб = Истина;

Возврат ТабДок;
КонецФункции

Функция УПДСтроки(ДокументДолгСсылка, Счет) Экспорт
ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
СчетаДетальноДолги = ДокументДолгСсылка.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

СвернутьВСчете = Счет.СвернутьВСчете;

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; 
ДатаУчетаНДС = ДокументДолгСсылка.РезервПо;
СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС; 

ИтогиЗаявка = ИтогиЗаявка(СчетаДетальноДолги, СтавкаНДС, ВсеСНДС);

ВсегоСуммаПроживание = ИтогиЗаявка.СуммаПроживание;
ВсегоКоличествоПроживание = ИтогиЗаявка.КоличествоПроживание;
ВсегоСуммаУслуги = ИтогиЗаявка.СуммаУслуги;
ВсегоСуммаНДС = ИтогиЗаявка.СуммаНДС;

ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("НомерСтроки");
ТЗ.Колонки.Добавить("НаименованиеТовара");
ТЗ.Колонки.Добавить("КодЕдиницыИзмерения");
ТЗ.Колонки.Добавить("ЕдиницаИзмерения");
ТЗ.Колонки.Добавить("Количество");
ТЗ.Колонки.Добавить("Цена");
ТЗ.Колонки.Добавить("НалоговаяСтавка");
ТЗ.Колонки.Добавить("СуммаНДС");
ТЗ.Колонки.Добавить("СуммаБезНДС");
ТЗ.Колонки.Добавить("СуммаСНДС");
ТЗ.Колонки.Добавить("ЭтоУслуга");
ТЗ.Колонки.Добавить("Дата");

ТоварКлиент = ТоварКлиент(ДокументДолгСсылка, Счет); 

сч =0;
Если СвернутьВСчете Тогда
	СтрокаТЗ = ТЗ.Добавить();
	
	СтрокаТЗ.НомерСтроки = сч;
	
	ДатаС = ИтогиЗаявка.ДатаС_Проживание; 
	Если ЗначениеЗаполнено(ДатаС) Тогда
		ДатаПо = ИтогиЗаявка.ДатаПо_Проживание + 24 * 60 * 60;
	Иначе 
		ДатаС = ИтогиЗаявка.ДатаС_Услуги; 
		Если ЗначениеЗаполнено(ДатаС) Тогда
			ДатаПо = ИтогиЗаявка.ДатаПо_Услуги;
		КонецЕсли;
	КонецЕсли;
	
	НаименованиеТовара = "" + ТоварКлиент + ", услуги по предоставлению мест для временного проживания в гостинице";
	Если ЗначениеЗаполнено(ДатаС) Тогда
		Если ДатаС = ДатаПо Тогда
			ДатаСПо = " " + Формат(ДатаС, "ДФ=dd.MM.yy"); 
		Иначе
			ДатаСПо = " с " + Формат(ДатаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаПо, "ДФ=dd.MM.yy"); 
		КонецЕсли;
	Иначе		
		ДатаСПо = "";
	КонецЕсли;
		
	СтрокаТЗ.НаименованиеТовара = НаименованиеТовара + ДатаСПо; 
	
	СтрокаТЗ.КодЕдиницыИзмерения = "359"; 
	СтрокаТЗ.ЕдиницаИзмерения = "сутки";
	
	Если ВсегоКоличествоПроживание = 0 Тогда
		 ВсегоКоличествоПроживание = 1;
	КонецЕсли;
	
	Сумма = ВсегоСуммаПроживание + ВсегоСуммаУслуги; 
	
	СтрокаТЗ.Количество = ВсегоКоличествоПроживание;
	СтрокаТЗ.Цена = Окр(Сумма / ВсегоКоличествоПроживание, 2);
	
	Если ВсеСНДС Тогда
		СтрокаТЗ.НалоговаяСтавка = СтавкаНДС;
		
		СуммаНДС = ВсегоСуммаНДС;
		СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, Сумма);
	Иначе
		Если СтрокаТЗ.НалоговаяСтавка = Перечисления.СтавкиНДС.БезНДС
		ИЛИ СтрокаТЗ.НалоговаяСтавка = Перечисления.СтавкиНДС.ПустаяСсылка()
		Тогда 
			СтавкаНДС_П = СтавкаНДС;
		Иначе	
			СтавкаНДС_П = Перечисления.СтавкиНДС.НДС0;
		КонецЕсли;
		
		СтрокаТЗ.НалоговаяСтавка = СтавкаНДС_П;
		
		СуммаНДС = 0;
		СуммаБезНДС = Сумма;
	КонецЕсли;
	
	СтрокаТЗ.СуммаНДС = СуммаНДС;
	СтрокаТЗ.СуммаБезНДС = СуммаБезНДС;
	СтрокаТЗ.СуммаСНДС = Сумма;
	
	СтрокаТЗ.ЭтоУслуга = Ложь;
	СтрокаТЗ.Дата = '00010101';
Иначе
	Сумма = ВсегоСуммаПроживание; 

	Если Сумма <> 0 Тогда		
		
		СтрокаТЗ = ТЗ.Добавить();
		
		сч = сч + 1;
		СтрокаТЗ.НомерСтроки = сч;
		
		ДатаС = ИтогиЗаявка.ДатаС_Проживание; 
		ДатаПо = ИтогиЗаявка.ДатаПо_Проживание + 24 * 60 * 60;
		
		НаименованиеТовара = "" + ТоварКлиент + ", услуги по предоставлению мест для временного проживания в гостинице"
			+ " с " + Формат(ДатаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаПо, "ДФ=dd.MM.yy"); 
		
		СтрокаТЗ.НаименованиеТовара = НаименованиеТовара; 
		
		СтрокаТЗ.КодЕдиницыИзмерения = "359";
		СтрокаТЗ.ЕдиницаИзмерения = "сутки";
		
		Если ВсегоКоличествоПроживание = 0 Тогда
			 ВсегоКоличествоПроживание = 1;
		КонецЕсли;
		
		СтрокаТЗ.Количество = ВсегоКоличествоПроживание;
		СтрокаТЗ.Цена = Окр(Сумма / ВсегоКоличествоПроживание, 2);
		
		Если ВсеСНДС Тогда
			СтавкаНДС_П = СтавкаНДС;
			
			СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, Сумма);
			СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, Сумма);
		Иначе	
			Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС
			ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка()
			Тогда 
				СтавкаНДС_П = СтавкаНДС;
			Иначе	
				СтавкаНДС_П = Перечисления.СтавкиНДС.НДС0;
			КонецЕсли;
			
			СуммаНДС = 0;
			СуммаБезНДС = Сумма;
		КонецЕсли;
	
		СтрокаТЗ.НалоговаяСтавка = СтавкаНДС_П;
		
		СтрокаТЗ.СуммаНДС = СуммаНДС;
		СтрокаТЗ.СуммаБезНДС = СуммаБезНДС;
		СтрокаТЗ.СуммаСНДС = Сумма;
		
		СтрокаТЗ.ЭтоУслуга = Ложь;
		СтрокаТЗ.Дата = '00010101';
	КонецЕсли;

	Для Каждого Строка Из СчетаДетальноДолги Цикл
		Если НЕ Строка.Услуга Тогда Продолжить; КонецЕсли;
		Если Строка.ПрограммныйКодУслуги = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ
		Тогда Продолжить; КонецЕсли;
		
		СтрокаТЗ = ТЗ.Добавить();
		
		сч = сч + 1;
	    СтрокаТЗ.НомерСтроки = сч;
		
		НаименованиеТовара = НаименованиеДляДокумента(Строка);
		НаименованиеТовара = "" + ТоварКлиент + ". " + НаименованиеТовара;
		
		СтрокаТЗ.НаименованиеТовара = НаименованиеТовара;

		СтрокаТЗ.КодЕдиницыИзмерения = "796";
		СтрокаТЗ.ЕдиницаИзмерения = "шт";
		
		Если Строка.Количество = 0 Тогда
		     Количество = 1;
		Иначе
		     Количество = Строка.Количество;
		КонецЕсли;
			
		СтрокаТЗ.Количество = Количество;
		СтрокаТЗ.Цена = Строка.Цена;
		
		СтрокаТЗ.НалоговаяСтавка = СтавкаНДС;
		
		СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, Строка.СуммаДолг);
		СтрокаТЗ.СуммаБезНДС = СуммаБезНДС;
		
		СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, Строка.СуммаДолг);;
		СтрокаТЗ.СуммаНДС = СуммаНДС;

		СтрокаТЗ.СуммаСНДС = Строка.СуммаДолг;
		
		СтрокаТЗ.ЭтоУслуга = Истина;
		СтрокаТЗ.Дата = Строка.ДатаДолг;
	КонецЦикла;	
КонецЕсли;

Возврат ТЗ;
КонецФункции

Функция ТоварКлиент_1(ДокументДолгСсылка, Счет) Экспорт
Клиент = Счет.Клиент;
	
Если Счет.РазделитьСчет Тогда
	ТоварКлиент = Клиент;
Иначе
	Клиент2 = ДокументДолгСсылка.Клиент2;
	Если ЗначениеЗаполнено(Клиент2)  
	И Клиент <> Клиент2 Тогда 
		ТоварКлиент = "" + Клиент + ", " + Клиент2;
	Иначе
		ТоварКлиент = Клиент;
	КонецЕсли;	
КонецЕсли;	

Возврат ТоварКлиент;
КонецФункции
//

//ТабличныйДокумент.Записать("\\bu\" + ИмяФайлаPDF, ТипФайлаТабличногоДокумента.PDF);
//ВыбранныйФайл = Новый Файл("\\bu\" + ИмяФайлаPDF);
//ВыбранныйФайл.УстановитьТолькоЧтение(Истина);



//
Процедура ПечатьГрупповогоСчетаФактуры(ТабДок, Номер, Дата, Групповойсчет) Экспорт
Макет = ПолучитьОбщийМакет("СчетФактураМакет");

ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(Групповойсчет);

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;

Контрагент = Групповойсчет.Контрагент; 
СвернутьВСчете = Групповойсчет.СвернутьВСчете;

Область = Макет.ПолучитьОбласть("Заголовок");

Область.Параметры.Номер = Номер;
Область.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");

ДокументОтгрузки = "Акт № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
Область.Параметры.ДокументОтгрузки = ДокументОтгрузки;
	
Продавец = ТекущаяОрганизация.ОрганизацияДляДокументов;
АдресПродавца = ТекущаяОрганизация.ОрганизацияАдресДляДокументов;
ИННКПППродавца = ТекущаяОрганизация.ИНН + "/" + ТекущаяОрганизация.КПП;

Область.Параметры.Продавец = Продавец;
Область.Параметры.АдресПродавца = АдресПродавца;
Область.Параметры.ИННКПППродавца = ИННКПППродавца;

Область.Параметры.Покупатель = ?(ЗначениеЗаполнено(Контрагент.НаименованиеЮрЛица)
									, Контрагент.НаименованиеЮрЛица, Контрагент.Наименование);
Область.Параметры.АдресПокупателя = Контрагент.Адрес;
Область.Параметры.ИННКПППокупателя = Контрагент.ИНН + "/" + Контрагент.КПП;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

//
ДокументыДолги = ГрупповойСчет.ДокументыДолги; 

сч=0;

ИтогоСумма = 0;
ИтогоСуммаБезНДС = 0;
ИтогоСуммаНДС = 0;

СтрокиСчетаФактуры = ГрупповойСчетФактурыСтроки(Групповойсчет);

Для каждого СчетФактураСтрока Из СтрокиСчетаФактуры Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.НомерСтроки = СчетФактураСтрока.НомерСтроки;
	Область.Параметры.НаименованиеТовара = СчетФактураСтрока.НаименованиеТовара;
	Область.Параметры.КодЕдиницыИзмерения = СчетФактураСтрока.КодЕдиницыИзмерения;
	Область.Параметры.ЕдиницаИзмерения = СчетФактураСтрока.ЕдиницаИзмерения;
	Область.Параметры.Количество = СчетФактураСтрока.Количество;
	Область.Параметры.Цена = СчетФактураСтрока.Цена;
	Область.Параметры.СуммаБезНДС = СчетФактураСтрока.СуммаБезНДС;
	Область.Параметры.НалоговаяСтавка = СчетФактураСтрока.НалоговаяСтавка;
	Область.Параметры.СуммаНДС = СчетФактураСтрока.СуммаНДС;
	Область.Параметры.СуммаСНДС = СчетФактураСтрока.СуммаСНДС;

	ТабДок.Вывести(Область);

	ИтогоСумма = ИтогоСумма + СчетФактураСтрока.СуммаСНДС;
	ИтогоСуммаБезНДС = ИтогоСуммаБезНДС + СчетФактураСтрока.СуммаБезНДС;
	ИтогоСуммаНДС = ИтогоСуммаНДС + СчетФактураСтрока.СуммаНДС;
КонецЦикла;

//
Область = Макет.ПолучитьОбласть("Итоги");

Область.Параметры.СуммаБезНДС = ИтогоСуммаБезНДС;
Область.Параметры.СуммаНДС = ИтогоСуммаНДС;
Область.Параметры.СуммаСНДС = ИтогоСумма;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Подвал");

Область.Параметры.Руководитель =  ТекущаяОрганизация.ОрганизацияФИОРуководительДляДокументов;
Область.Параметры.Бухгалтер =  ТекущаяОрганизация.ОрганизацияФИОБухгалтерДляСчетаФактуры;

ТабДок.Вывести(Область);
//

ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры

Функция ГрупповойСчетФактурыСтроки(Групповойсчет) Экспорт   
ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(Групповойсчет);
	
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;

СвернутьВСчете = Групповойсчет.СвернутьВСчете;


ДокументыДолги = ГрупповойСчет.ДокументыДолги; 

ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("НомерСтроки");
ТЗ.Колонки.Добавить("НаименованиеТовара");
ТЗ.Колонки.Добавить("КодЕдиницыИзмерения");
ТЗ.Колонки.Добавить("ЕдиницаИзмерения");
ТЗ.Колонки.Добавить("Количество");
ТЗ.Колонки.Добавить("Цена");
ТЗ.Колонки.Добавить("СуммаБезНДС");
ТЗ.Колонки.Добавить("НалоговаяСтавка");
ТЗ.Колонки.Добавить("СуммаНДС");
ТЗ.Колонки.Добавить("СуммаСНДС");
ТЗ.Колонки.Добавить("ЭтоУслуга");
ТЗ.Колонки.Добавить("Дата");

сч=0;

ИтогоСумма = ИтогоСумма = 0;
ИтогоСуммаБезНДС = 0;
ИтогоСуммаНДС = 0;

Для каждого СтрокаТаблицы Из ДокументыДолги Цикл
	Если СтрокаТаблицы.ДокументДолг.Статус = Перечисления.СтатусБрони.Бронь 
	Тогда Продолжить; КонецЕсли;	

	Если СтрокаТаблицы.ДокументДолг.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
	Тогда Продолжить; КонецЕсли;		
	
	Если СтрокаТаблицы.ДокументДолг.Статус = Перечисления.СтатусБрони.ОтказОтБронирования 
	Тогда Продолжить; КонецЕсли;		
	
	ДокументДолг = СтрокаТаблицы.ДокументДолг;
	СчетГУИД = СтрокаТаблицы.СчетГУИД;
	
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД); 
	Счета_М = ДокументДолг.Счета.НайтиСтроки(ОтборСтроки); 
	Если Счета_М.Количество() = 0 Тогда Продолжить; КонецЕсли; 
	Счет = Счета_М[0]; 
	
	СчетаДетальноДолги_М = ДокументДолг.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки); 
	
	ТоварКлиент = "" + ТоварКлиент(ДокументДолг, Счет) + ". ";
	
	ИтогиЗаявка = ИтогиЗаявка(СчетаДетальноДолги_М, СтавкаНДС, ВсеСНДС);
	
	СуммаПроживаниеЗаявка = ИтогиЗаявка.СуммаПроживание;
	КоличествоСутокЗаявка = ИтогиЗаявка.КоличествоПроживание;
	СуммаУслугиЗаявка = ИтогиЗаявка.СуммаУслуги;
	СуммаНДСЗаявка = ИтогиЗаявка.СуммаНДС;
	
	Если СуммаПроживаниеЗаявка <> 0 Тогда
		СтрокаСчетаФактуры = ТЗ.Добавить();
		
		сч = сч + 1;	
	    СтрокаСчетаФактуры.НомерСтроки = сч;
		
		ДатаПо_Проживание = ИтогиЗаявка.ДатаПо_Проживание + 24 * 60 * 60;
		НаименованиеТовара = ТоварКлиент + "Услуги гостиницы" 
			+ " с "+ Формат(ИтогиЗаявка.ДатаС_Проживание, "ДФ=dd.MM.yy")+ " по "+ Формат(ДатаПо_Проживание, "ДФ=dd.MM.yy");
		СтрокаСчетаФактуры.НаименованиеТовара = НаименованиеТовара;
		
		СтрокаСчетаФактуры.КодЕдиницыИзмерения = "359";
		СтрокаСчетаФактуры.ЕдиницаИзмерения = "сутки";
		
		Если КоличествоСутокЗаявка = 0 Тогда 
			Количество = 1;
		Иначе
		    Количество = КоличествоСутокЗаявка;
		Конецесли;
		СтрокаСчетаФактуры.Количество = Количество;
		
		СтрокаСчетаФактуры.Цена = Окр(СуммаПроживаниеЗаявка / Количество, 2);
		
		Если ВсеСНДС Тогда
			СтрокаСчетаФактуры.НалоговаяСтавка = СтавкаНДС;
			
			СуммаНДС = СуммаНДСЗаявка;
			СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, СуммаПроживаниеЗаявка);
		Иначе
			Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС
			ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка()
			Тогда 
				СтавкаНДС_П = СтавкаНДС;
			Иначе	
				СтавкаНДС_П = Перечисления.СтавкиНДС.НДС0;
			КонецЕсли;
			
			СтрокаСчетаФактуры.НалоговаяСтавка = СтавкаНДС_П;
			
			СуммаНДС = 0;
			СуммаБезНДС = СуммаПроживаниеЗаявка;
		КонецЕсли;

		СтрокаСчетаФактуры.СуммаНДС = СуммаНДС;
		СтрокаСчетаФактуры.СуммаБезНДС = СуммаБезНДС;
		СтрокаСчетаФактуры.СуммаСНДС = СуммаПроживаниеЗаявка;
		
		СтрокаСчетаФактуры.ЭтоУслуга = Ложь;
		СтрокаСчетаФактуры.Дата = '00010101';
	КонецЕсли;
//
	Если СвернутьВСчете Тогда
		Если СуммаУслугиЗаявка <> 0 Тогда
			СтрокаСчетаФактуры = ТЗ.Добавить();
			
			сч = сч + 1;	
			СтрокаСчетаФактуры.НомерСтроки = сч;
			
			НаименованиеТовара = ТоварКлиент + ". Дополнительные услуги гостиницы" 
				+ " с "+ Формат(Счет.ДатаС, "ДФ=dd.MM.yy")+ " по "+ Формат(Счет.ДатаПо, "ДФ=dd.MM.yy");
			СтрокаСчетаФактуры.НаименованиеТовара = НаименованиеТовара;
			
			СтрокаСчетаФактуры.КодЕдиницыИзмерения = "796";
			СтрокаСчетаФактуры.ЕдиницаИзмерения = "шт";
			
			Количество = 1;

			СтрокаСчетаФактуры.Количество = Количество;
			
			СтрокаСчетаФактуры.Цена = СуммаУслугиЗаявка;
			
			СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, СуммаУслугиЗаявка); 
			СтрокаСчетаФактуры.СуммаБезНДС = СуммаБезНДС;
			СтрокаСчетаФактуры.НалоговаяСтавка = СтавкаНДС;
			
			СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, СуммаУслугиЗаявка);
			СтрокаСчетаФактуры.СуммаНДС = СуммаНДС;

			СтрокаСчетаФактуры.СуммаСНДС = СуммаУслугиЗаявка;
			
			СтрокаСчетаФактуры.ЭтоУслуга = Истина;
			СтрокаСчетаФактуры.Дата = '00010101';
		КонецЕсли;
	Иначе
		Для Каждого Строка Из СчетаДетальноДолги_М Цикл
			Если НЕ Строка.Услуга Тогда Продолжить; КонецЕсли;
			Если Строка.ПрограммныйКодУслуги = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ
			Тогда Продолжить; КонецЕсли;
			
			СтрокаСчетаФактуры = ТЗ.Добавить();
			
			сч = сч + 1;	
		    СтрокаСчетаФактуры.НомерСтроки = сч;
			
			СтрокаСчетаФактуры.НаименованиеТовара = "" + ТоварКлиент 
				+ " " + ?(ЗначениеЗаполнено(Строка.НазваниеДляЧека), Строка.НазваниеДляЧека, Строка.НаименованиеДолг)
				+ ". " + Формат(Строка.ДатаДолг, "ДФ=dd.MM.yy"); 
			
			СтрокаСчетаФактуры.КодЕдиницыИзмерения = "796";
			СтрокаСчетаФактуры.ЕдиницаИзмерения = "шт";
			
			СтрокаСчетаФактуры.Количество = Строка.Количество;
			СтрокаСчетаФактуры.Цена = Строка.Цена;
			
			СтрокаСчетаФактуры.НалоговаяСтавка = СтавкаНДС;
			
			СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, Строка.СуммаДолг);
			СтрокаСчетаФактуры.СуммаБезНДС = СуммаБезНДС;
			
			СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, Строка.СуммаДолг);;
			СтрокаСчетаФактуры.СуммаНДС = СуммаНДС;

			СтрокаСчетаФактуры.СуммаСНДС = Строка.СуммаДолг;
			
			СтрокаСчетаФактуры.ЭтоУслуга = Истина;
			СтрокаСчетаФактуры.Дата = '00010101';
		КонецЦикла;	
	КонецЕсли;
КонецЦикла; 

Возврат ТЗ;
КонецФункции
//

//
Процедура ПечатьГрупповогоУПД(ТабДок, Номер, Дата, Групповойсчет) Экспорт
Макет = ПолучитьОбщийМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент2026");

ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(Групповойсчет);

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;

Контрагент = Групповойсчет.Контрагент; 
СвернутьВСчете = Групповойсчет.СвернутьВСчете;

Область = Макет.ПолучитьОбласть("Шапка");

Область.Параметры.СтатусУПД = 1;    

Область.Параметры.Номер = Номер;
Область.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");

ДокументОтгрузки = "Акт № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
Область.Параметры.ДокументыОбОтгрузке = ДокументОтгрузки;
	
Продавец = ТекущаяОрганизация.ОрганизацияДляДокументов;
АдресПродавца = ТекущаяОрганизация.ОрганизацияАдресДляДокументов;
ИННКПППродавца = ТекущаяОрганизация.ИНН + "/" + ТекущаяОрганизация.КПП;

Область.Параметры.ПредставлениеПоставщика = Продавец;
Область.Параметры.АдресПоставщика = АдресПродавца;
Область.Параметры.ИННПоставщика = ИННКПППродавца;

Область.Параметры.ПредставлениеПокупателя = ?(ЗначениеЗаполнено(Контрагент.НаименованиеЮрЛица)
									, Контрагент.НаименованиеЮрЛица, Контрагент.Наименование);
Область.Параметры.АдресПокупателя = Контрагент.Адрес;
Область.Параметры.ИННПокупателя = Контрагент.ИНН + "/" + Контрагент.КПП;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
ТабДок.Вывести(Область);

//
ДокументыДолги = ГрупповойСчет.ДокументыДолги; 

сч=0;

ИтогоСумма = 0;
ИтогоСуммаБезНДС = 0;
ИтогоСуммаНДС = 0;

СтрокиСчетаФактуры = ГрупповойСчетФактурыСтроки(Групповойсчет);

Для каждого СчетФактураСтрока Из СтрокиСчетаФактуры Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.НомерСтроки = СчетФактураСтрока.НомерСтроки;
	Область.Параметры.ТоварНаименование	 = СчетФактураСтрока.НаименованиеТовара;
	Область.Параметры.ЕдиницаИзмеренияКод = СчетФактураСтрока.КодЕдиницыИзмерения;
	Область.Параметры.ЕдиницаИзмеренияКод = СчетФактураСтрока.ЕдиницаИзмерения;
	Область.Параметры.Количество = СчетФактураСтрока.Количество;
	Область.Параметры.Цена = СчетФактураСтрока.Цена;
	Область.Параметры.Стоимость = СчетФактураСтрока.СуммаБезНДС;
	Область.Параметры.СтавкаНДС = СчетФактураСтрока.НалоговаяСтавка;
	Область.Параметры.СуммаНДС = СчетФактураСтрока.СуммаНДС;
	Область.Параметры.Всего = СчетФактураСтрока.СуммаСНДС;

	ТабДок.Вывести(Область);

	ИтогоСумма = ИтогоСумма + СчетФактураСтрока.СуммаСНДС;
	ИтогоСуммаБезНДС = ИтогоСуммаБезНДС + СчетФактураСтрока.СуммаБезНДС;
	ИтогоСуммаНДС = ИтогоСуммаНДС + СчетФактураСтрока.СуммаНДС;
КонецЦикла;

//
Область = Макет.ПолучитьОбласть("Итого");

Область.Параметры.ИтогоСтоимость = ИтогоСуммаБезНДС;
Область.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДС;
Область.Параметры.ИтогоВсего = ИтогоСумма;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Подвал");

Область.Параметры.ФИОРуководителя =  ТекущаяОрганизация.ОрганизацияФИОРуководительДляДокументов;
Область.Параметры.ФИОГлавногоБухгалтера =  ТекущаяОрганизация.ОрганизацияФИОБухгалтерДляСчетаФактуры;

ТабДок.Вывести(Область);
//

ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры
//

////
Процедура ВывестиИсториюКлиента(ТабДок, Клиент, ДатаЗаявки) Экспорт
//Макет = Документы.ЗаявкаНаБронирование.ПолучитьМакет("МакетИсторииКлиента");
Макет = Справочники.Клиенты.ПолучитьМакет("МакетИсторииКлиента");

Обл=Макет.ПолучитьОбласть("Строка");
Для каждого Пок Из Клиент.ПрочаяИнформация Цикл
	Если Пок.Информация="" тогда
		Продолжить;
	КонецЕсли;
	
	Обл.Параметры.Показатель=Пок.ВидИнформации.Наименование;
	Обл.Параметры.Значение=Пок.Информация;
	ТабДок.Вывести(Обл);	
КонецЦикла; 

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	ИсторияКлиентаДопПожелания.Клиент КАК Клиент,
                    |	ИсторияКлиентаДопПожелания.ЗаявкаГУИД КАК ЗаявкаГУИД,
                    |	ИсторияКлиентаДопПожелания.ДопПожеланияИндекс КАК ДопПожеланияИндекс,
                    |	ИсторияКлиентаДопПожелания.Информация КАК Информация,
                    |	ИсторияКлиентаДопПожелания.ВидИнформации КАК ВидИнформации,
                    |	ИсторияКлиентаДопПожелания.ДатаРегистрации КАК ДатаРегистрации
                    |ИЗ
                    |	РегистрСведений.ИсторияКлиентаДопПожелания КАК ИсторияКлиентаДопПожелания
                    |ГДЕ
                    |	ИсторияКлиентаДопПожелания.Клиент = &Клиент
                    |	И ИсторияКлиентаДопПожелания.ЗаявкаГУИД = &ЗаявкаГУИД
                    |
                    |УПОРЯДОЧИТЬ ПО
                    |	ДатаРегистрации УБЫВ");

					//|	И ИсторияКлиентаДопПожелания.Заявка = ЗНАЧЕНИЕ(Документ.ЗаявкаНаБронирование.ПустаяСсылка)

Запрос.УстановитьПараметр("Клиент", Клиент);
УникальныйИдентификаторПустой = ОбщийФункционалСервер.УникальныйИдентификаторПустой();
Запрос.УстановитьПараметр("ЗаявкаГУИД", УникальныйИдентификаторПустой);

ДопПожелания = Запрос.Выполнить().Выгрузить();

Обл=Макет.ПолучитьОбласть("Шапка");
Если ДопПожелания.Количество()=0 тогда
	//Обл.Параметры.СтрокаПос="Пожелания отсутствуют";
иначе
	Обл.Параметры.СтрокаПос="Обшие пожелания:";
конецесли;
ТабДок.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Для каждого Доп Из ДопПожелания Цикл
	Если Доп.Информация="" тогда
		Продолжить;
	КонецЕсли;
	Обл.Параметры.Показатель=Доп.ВидИнформации;
	Обл.Параметры.Значение=Доп.Информация;
	ТабДок.Вывести(Обл);	
КонецЦикла; 

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	ИсторияКлиента.Клиент КАК Клиент,
                    |	ИсторияКлиента.ЗаявкаГУИД КАК ЗаявкаГУИД,
                    |	ИсторияКлиента.ДатаЗаявки КАК ДатаЗаявки,
                    |	ИсторияКлиента.РезервС КАК РезервС,
                    |	ИсторияКлиента.РезервПо КАК РезервПо,
                    |	ИсторияКлиента.НомерВрезерв КАК НомерВрезерв
                    |ИЗ
                    |	РегистрСведений.ИсторияКлиента КАК ИсторияКлиента
                    |ГДЕ
                    |	ИсторияКлиента.Клиент = &Клиент
                    |	И ИсторияКлиента.ДатаЗаявки < &ДатаЗаявки
                    |
                    |УПОРЯДОЧИТЬ ПО
                    |	РезервС УБЫВ");
Запрос.УстановитьПараметр("Клиент", Клиент);						
Запрос.УстановитьПараметр("ДатаЗаявки", ДатаЗаявки);

ТЗ =Запрос.Выполнить().Выгрузить();

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	ИсторияКлиентаДопПожелания.Клиент КАК Клиент,
                    |	ИсторияКлиентаДопПожелания.ЗаявкаГУИД КАК ЗаявкаГУИД,
                    |	ИсторияКлиентаДопПожелания.ДопПожеланияИндекс КАК ДопПожеланияИндекс,
                    |	ИсторияКлиентаДопПожелания.Информация КАК Информация,
                    |	ИсторияКлиентаДопПожелания.ВидИнформации КАК ВидИнформации,
                    |	ИсторияКлиентаДопПожелания.ДатаРегистрации КАК ДатаРегистрации
                    |ИЗ
                    |	РегистрСведений.ИсторияКлиента КАК ИсторияКлиента
                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКлиентаДопПожелания КАК ИсторияКлиентаДопПожелания
                    |		ПО ИсторияКлиента.ЗаявкаГУИД = ИсторияКлиентаДопПожелания.ЗаявкаГУИД
                    |ГДЕ
                    |	ИсторияКлиентаДопПожелания.Клиент = &Клиент
					//|	И ИсторияКлиентаДопПожелания.ЗаявкаГУИД = &ЗаявкаГУИД
                    |
                    |УПОРЯДОЧИТЬ ПО
                    |	ДатаРегистрации УБЫВ");
					
					//|		ПО ИсторияКлиента.Заявка = ИсторияКлиентаДопПожелания.Заявка
					
Запрос.УстановитьПараметр("Клиент", Клиент);						
//Запрос.УстановитьПараметр("ЗаявкаГУИД", СтрПос.ЗаявкаГУИД);

ТЗ_ДопПожелания =Запрос.Выполнить().Выгрузить();

Для каждого СтрПос Из ТЗ Цикл
	Обл=Макет.ПолучитьОбласть("Шапка");
	//Обл.Параметры.СтрокаПос="Проживание с " + Формат(СтрПос.Ссылка.РезервС, "ДФ=dd.MM.yy") + " по " + Формат(СтрПос.Ссылка.РезервПо, "ДФ=dd.MM.yy") + " " + СтрПос.Ссылка.НомерВРезерв.Наименование;
	Обл.Параметры.СтрокаПос="Проживание с " + Формат(СтрПос.РезервС, "ДФ=dd.MM.yy") + " по " + Формат(СтрПос.РезервПо, "ДФ=dd.MM.yy") + " " + СтрПос.НомерВРезерв;
	ТабДок.Вывести(Обл);
	
	ОтборСтроки = Новый Структура("ЗаявкаГУИД", СтрПос.ЗаявкаГУИД);
	ДопПожелания = ТЗ_ДопПожелания.НайтиСтроки(ОтборСтроки);
	
	Если ДопПожелания.Количество()=0 тогда
		Обл.Параметры.СтрокаПос="Пожелания отсутствуют";
	иначе
		Обл.Параметры.СтрокаПос="Пожелания:";
	конецесли;
	ТабДок.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Для каждого Доп Из ДопПожелания Цикл
		Если Доп.Информация="" тогда
			Продолжить;
		КонецЕсли;
		Обл.Параметры.Показатель=Доп.ВидИнформации;
		Обл.Параметры.Значение=Доп.Информация;
		ТабДок.Вывести(Обл);	
	КонецЦикла; 
КонецЦикла;	
Конецпроцедуры	
////

////////////////////////////////////////////////////////////////


//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++



