
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("СформироватьОтчет", СформироватьОтчет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если СформироватьОтчет Тогда
	ДвойныеИНН(Неопределено);	
КонецЕсли;
КонецПроцедуры

//
&НаКлиенте
Процедура ДвойныеИНН(Команда)
ДвойныеИНННаСервере();
ПолеОтчетаЗаполнено = Истина;
КонецПроцедуры

&НаСервере
Процедура ДвойныеИНННаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Ссылка,
                      |	Клиенты.ИНН КАК ИНН,
                      |	Клиенты.ПометкаУдаления КАК ПометкаУдаления,
                      |	КлиентыДвойные.Количество КАК Количество,
                      |	Заявки.ЗаявкиКоличество КАК ЗаявкиКоличество,
                      |	ГрупповыеСчета.ГрупповыеСчетаКоличество КАК ГрупповыеСчетаКоличество,
                      |	Выписки.ВыпискиКоличество КАК ВыпискиКоличество
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			Клиенты.ИНН КАК ИНН,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Клиенты.Ссылка) КАК Количество
                      |		ИЗ
                      |			Справочник.Клиенты КАК Клиенты
                      |		ГДЕ
                      |			Клиенты.ИНН <> """"
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			Клиенты.ИНН) КАК КлиентыДвойные
                      |		ПО Клиенты.ИНН = КлиентыДвойные.ИНН
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК ЗаявкиКоличество
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронирование.Оплачивает) КАК Заявки
                      |		ПО Клиенты.Ссылка = Заявки.Оплачивает
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчета.Контрагент КАК Контрагент,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчета.Ссылка) КАК ГрупповыеСчетаКоличество
                      |		ИЗ
                      |			Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчета.Контрагент) КАК ГрупповыеСчета
                      |		ПО Клиенты.Ссылка = ГрупповыеСчета.Контрагент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ОтКого КАК ОтКого,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыпискаБанка.Ссылка) КАК ВыпискиКоличество
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ОтКого) КАК Выписки
                      |		ПО Клиенты.Ссылка = Выписки.ОтКого
                      |ГДЕ
                      |	КлиентыДвойные.Количество > 1
                      |	И Клиенты.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ИНН,
                      |	Ссылка");

ОтчетТаблица = Запрос.Выполнить().Выгрузить();

МассивКудалению = Новый Массив;
Для Каждого Строка Из ОтчетТаблица Цикл
	Если СокрЛП(Строка.ИНН) = "" Тогда
		МассивКудалению.Добавить(Строка);		
	КонецЕсли;
КонецЦикла;
ОбщийФункционалСервер.УдалитьСтроки(ОтчетТаблица, МассивКудалению); 

//
ПолеОтчета.Очистить();
ПолеОтчета.ФиксацияСверху = 1;
ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ОтчетПоле.ОтображатьСетку = Истина;

Макет = Обработки.КлиентыДвойныеИНН.ПолучитьМакет("ДвойныеИНН");

Шапка = Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(Шапка);
	
ИННСвертка = Неопределено;
Счетчик = 0;
Для Каждого СтрокаТаблица Из ОтчетТаблица Цикл
	Если СтрокаТаблица.ИНН <> ИННСвертка Тогда  
		ПолеОтчета.ЗакончитьАвтогруппировкуСтрок();
		
		ПолеОтчета.НачатьАвтогруппировкуСтрок();
		
		СтрокаОтчета = Макет.ПолучитьОбласть("СтрокаЗаголовок");
		СтрокаОтчета.Параметры.ИНН = СтрокаТаблица.ИНН; 
		
		СтрокаОтчета.Параметры.Количество = СтрокаТаблица.Количество;  
		
		СтрокаОтчета.Параметры.РасшифровкаИНН = СтрокаТаблица.ИНН; 
		
		ПолеОтчета.Вывести(СтрокаОтчета, 1);
		
		ИННСвертка = СтрокаТаблица.ИНН;
	КонецЕсли;
	
	СтрокаОтчета = Макет.ПолучитьОбласть("Строка");
	СтрокаОтчета.Параметры.ИНН = СтрокаТаблица.ИНН; 
	СтрокаОтчета.Параметры.Клиент = СтрокаТаблица.Ссылка; 
	СтрокаОтчета.Параметры.ЗаявкиКоличество = СтрокаТаблица.ЗаявкиКоличество; 
	СтрокаОтчета.Параметры.ГрупповыеСчетаКоличество = СтрокаТаблица.ГрупповыеСчетаКоличество; 
	СтрокаОтчета.Параметры.ВыпискиКоличество = СтрокаТаблица.ВыпискиКоличество; 
	
	СтрокаОтчета.Параметры.ПометкаУдаления = ?(СтрокаТаблица.ПометкаУдаления, "V", ""); 
	
	ТекущийРодитель = "";
	ОбщийФункционалСервер.ПолнаяПапкаРодитель(СтрокаТаблица.Ссылка, ТекущийРодитель);
	СтрокаОтчета.Параметры.ПолнаяПапкаРодитель = ТекущийРодитель; 
	
	СтрокаОтчета.Параметры.РасшифровкаКлиент = СтрокаТаблица.Ссылка; 
	
	СтрокаОтчета.Параметры.РасшифровкаИНН = СтрокаТаблица.ИНН; 
	ПолеОтчета.Вывести(СтрокаОтчета, 2);
	
	Счетчик = Счетчик + 1;
КонецЦикла;

ПолеОтчета.ЗакончитьАвтогруппировкуСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
СтандартнаяОбработка = Ложь;

Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Клиенты") Тогда
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Расшифровка);

	ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрыФормы,ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецЕсли;		
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбъединитьКонтрагентов(Команда)
ПараметрыФормы = Новый Структура();

Если ПолеОтчетаЗаполнено Тогда	
	МассивВыделенныхОбластей = Элементы.ПолеОтчета.ПолучитьВыделенныеОбласти();
	Если МассивВыделенныхОбластей.Количество() = 0 Тогда Возврат; КонецЕсли;

	Расшифровка = МассивВыделенныхОбластей[0].Расшифровка;
	Если ТипЗнч(Расшифровка) = Тип("Строка") Тогда  
		ПараметрыФормы.Вставить("ИННОтбор", Расшифровка); 
	КонецЕсли;	
КонецЕсли;	
	
ОткрытьФорму("Обработка.КлиентыОбъединиение.Форма.ФормаОбъединениеКонтрагентов", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//




