&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр();
ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр; 
	
ОбновитьСписок();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
ЭлементОтбораПометкаУдаления = Неопределено;

ПометкаУдаления = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
Для Каждого Строка Из Список.Отбор.Элементы Цикл
	Если Строка.ЛевоеЗначение = ПометкаУдаления Тогда
		ЭлементОтбораПометкаУдаления = Строка;
		Прервать;
	КонецЕсли;
КонецЦикла;
	
Если Все Тогда
	Если ЭлементОтбораПометкаУдаления <> Неопределено Тогда Список.Отбор.Элементы.Удалить(Строка); КонецЕсли;
	
Иначе
	Если ЭлементОтбораПометкаУдаления <> Неопределено Тогда
		ЭлементОтбора = ЭлементОтбораПометкаУдаления;
	Иначе
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Ложь;	
	
КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ВсеПриИзменении(Элемент)
ОбновитьСписок();
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//УстановитьПользовательскийОтборДинамическогоСписка(ЭтаФорма.Список, "ПометкаУдаления", Ложь, ВидСравненияКомпоновкиДанных.Равно);
//КонецПроцедуры


//&НаКлиенте
//Процедура ВсеПриИзменении(Элемент)
//Если Все Тогда
//	СброситьПользовательскийОтборДинамическогоСписка(ЭтаФорма.Список, "ПометкаУдаления");
//Иначе
//	УстановитьПользовательскийОтборДинамическогоСписка(ЭтаФорма.Список, "ПометкаУдаления", Ложь, ВидСравненияКомпоновкиДанных.Равно);
//КонецЕсли;	
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля, Значение, ВидСравнения)
//	
//	Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
//		
//		Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
//			
//			ПользовательскийОтбор = ЭлементОтбора.Элементы;
//			
//			НовыйЭлементОтбора = Неопределено;
//			
//			Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
//				
//				Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
//					
//					НовыйЭлементОтбора = СуществующийЭлементОтбора;
//					
//					 Прервать;
//					
//				КонецЕсли;	
//					
//			КонецЦикла;
//			
//			Если СуществующийЭлементОтбора = Неопределено Тогда
//				
//				НовыйЭлементОтбора = ПользовательскийОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//				
//				НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
//				
//			КонецЕсли;
//		
//			НовыйЭлементОтбора.ВидСравнения = ВидСравнения;
//			НовыйЭлементОтбора.Использование = Истина;
//			НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
//			НовыйЭлементОтбора.ПравоеЗначение = Значение;			
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СброситьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля)
//	
//	Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
//		
//		Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
//			
//			ПользовательскийОтбор = ЭлементОтбора.Элементы;
//			
//			НовыйЭлементОтбора = Неопределено;
//			
//			Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
//				
//				Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
//					
//					НовыйЭлементОтбора = СуществующийЭлементОтбора;
//					
//					 Прервать;
//					
//				КонецЕсли;	
//					
//			КонецЦикла;
//			
//			Если СуществующийЭлементОтбора = Неопределено Тогда Возврат; КонецЕсли;
//			ПользовательскийОтбор.Удалить(СуществующийЭлементОтбора);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры;



