
Функция СписокИННЭквайринг() Экспорт
СписокИННЭквайринг = Новый СписокЗначений;

НаборЗаписей = РегистрыСведений.ИННЭквайринг.СоздатьНаборЗаписей();
НаборЗаписей.Прочитать();

Для Каждого Строка Из НаборЗаписей Цикл
	СписокИННЭквайринг.Добавить(Строка.ИНН);	
КонецЦикла;	
//СписокИННЭквайринг.Добавить("7707083893");
//СписокИННЭквайринг.Добавить("7744000302");
//СписокИННЭквайринг.Добавить("7702070139");
Возврат СписокИННЭквайринг;
КонецФункции

Функция СписокИННКоворкинг() Экспорт
СписокИННКоворкинг = Новый СписокЗначений;	
СписокИННКоворкинг.Добавить("666000524970");
Возврат СписокИННКоворкинг;
КонецФункции

