
//
&НаКлиенте
Процедура ПриОткрытии__()
	//Если Авто тогда
	//	ПоискДок=Документы.ЕжедневныйАудит.Выбрать(НачалоДня(ТекущаяДата()-86400),КонецДня(ТекущаяДата()-86400));
	//	Если ПоискДок.Следующий() тогда
	//	иначе
	//		
	//		НовДок=Документы.ЕжедневныйАудит.СоздатьДокумент();
	//		НовДок.Автор=ТекПол;
	//		НовДок.Дата=НачалоДня(ТекущаяДата()-86400);
	//		НовДок.Записать(РежимЗаписиДокумента.Запись);
	//		ФРМ=НовДок.ПолучитьФорму();
	//		ФРМ.Открыть();
	//	конецесли;
	//	//	ФРМ.Закрыть();
	//	
	//	//Если ДеньНедели(ТекущаяДата())=1 тогда
	//	//	ОтчетАудит(ТекущаяДата()-3*86400);
	//	//	ОтчетАудит(ТекущаяДата()-2*86400);		
	//	//КонецЕсли;
	//	ОтчетАудит(ТекущаяДата()-86400); 
	//	ОтчетМесяц(ТекущаяДата());	
	//	ОтчетДень(ТекущаяДата()-86400);
	//	
	//	//ОтправитьМылом
	//	//ОтправитьМылом("Финансовые отчеты Реноме","C:\BASE\REP\F_mth.xls","C:\BASE\REP\F_day.xls","guz@5sreda.ru");
	//	ЭтаФорма.Закрыть();
	//конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если Параметры.Свойство("ЗавершитьРаботу") Тогда	
	 ЗавершитьРаботу = Параметры.ЗавершитьРаботу;
Иначе
	 ЗавершитьРаботу = Ложь;
КонецЕсли;	 

Если Параметры.Свойство("Авто") Тогда	
	 Авто = Параметры.Авто;
Иначе
	 Авто = Ложь;
КонецЕсли;	 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если Авто тогда
	//ПоискДок=Документы.ЕжедневныйАудит.Выбрать(НачалоДня(ТекущаяДата()-86400),КонецДня(ТекущаяДата()-86400));
	//Если ПоискДок.Следующий() тогда
	//иначе
	//	
	//	НовДок=Документы.ЕжедневныйАудит.СоздатьДокумент();
	//	НовДок.Автор=ТекПол;
	//	НовДок.Дата=НачалоДня(ТекущаяДата()-86400);
	//	НовДок.Записать(РежимЗаписиДокумента.Запись);
	//	
	//	ФРМ=НовДок.ПолучитьФорму();
	//	ФРМ.Открыть();
	//конецесли;
	
	ЕжедневныйАудитСсылка = СоздатьЕжедневныйАудит();

	Если НЕ ЕжедневныйАудитСсылка = Неопределено Тогда 
		Парам = Новый Структура("Ключ", ЕжедневныйАудитСсылка); 
		ОткрытьФорму("Документ.ЕжедневныйАудит.Форма.ФормаДокумента", Парам, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
	////	ФРМ.Закрыть();
	//
	////Если ДеньНедели(ТекущаяДата())=1 тогда
	////	ОтчетАудит(ТекущаяДата()-3*86400);
	////	ОтчетАудит(ТекущаяДата()-2*86400);		
	////КонецЕсли;
	
	ОтчетАудит(ТекущаяДата() - 86400); 
	
	ОтчетМесяц(ТекущаяДата());	
	
	ОтчетДень(ТекущаяДата()-86400);
	
	//
	////ОтправитьМылом
	////ОтправитьМылом("Финансовые отчеты Реноме","C:\BASE\REP\F_mth.xls","C:\BASE\REP\F_day.xls","guz@5sreda.ru");
	//ЭтаФорма.Закрыть();
конецесли;


Если ЗавершитьРаботу Тогда
	Отказ = Истина;	
КонецЕсли;
КонецПроцедуры
//

&НаСервере
Функция СоздатьЕжедневныйАудит()
ПоискДок=Документы.ЕжедневныйАудит.Выбрать(НачалоДня(ТекущаяДата()-86400),КонецДня(ТекущаяДата()-86400));
Если ПоискДок.Следующий() тогда
иначе
	
	НовДок=Документы.ЕжедневныйАудит.СоздатьДокумент();
	
	//НовДок.Автор=ТекПол;
	НовДок.Автор=ПараметрыСеанса.ТекущийПользователь;
	
	НовДок.Дата=НачалоДня(ТекущаяДата()-86400);
	НовДок.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат НовДок.Ссылка;
	
	//ФРМ=НовДок.ПолучитьФорму();
	//ФРМ.Открыть();
конецесли;

Возврат Неопределено;
КонецФункции

//
&НаКлиенте
Процедура ОтчетАудит___(ДТ)
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//|	ЕжедневныйАудитПроданныеНомера.Ссылка,
	//|	ЕжедневныйАудитПроданныеНомера.НомерСтроки КАК НомерСтроки,
	//|	ЕжедневныйАудитПроданныеНомера.Бронь,
	//|	ЕжедневныйАудитПроданныеНомера.Клиент,
	//|	ЕжедневныйАудитПроданныеНомера.НомерВРезерв,
	//|	ЕжедневныйАудитПроданныеНомера.Коэф,
	//|	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживание,
	//|	ЕжедневныйАудитПроданныеНомера.Заезд,
	//|	ЕжедневныйАудитПроданныеНомера.ЗаездКоррекция,
	//|	ЕжедневныйАудитПроданныеНомера.Выезд,
	//|	ЕжедневныйАудитПроданныеНомера.ВыездКоррекция,
	//|	ЕжедневныйАудитПроданныеНомера.Тариф,
	//|	ЕжедневныйАудитПроданныеНомера.ТарифКоррекция,
	//|	ЕжедневныйАудитПроданныеНомера.СуммаКоррекция,
	//|	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживаниеПлан,
	//|	ЕжедневныйАудитПроданныеНомера.Комментарий,
	//|	ЕжедневныйАудитПроданныеНомера.Скидка,
	//|	ЕжедневныйАудитПроданныеНомера.СкидкаКоррекция
	//|ИЗ
	//|	Документ.ЕжедневныйАудит.ПроданныеНомера КАК ЕжедневныйАудитПроданныеНомера
	//|ГДЕ
	//|	ЕжедневныйАудитПроданныеНомера.Ссылка.Дата МЕЖДУ &ДН И &ДК
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки");	
	//Запрос.УстановитьПараметр("ДН",НачалоДня(ДТ));
	//Запрос.УстановитьПараметр("ДК",КонецДня(ДТ));
	//ТЗ=Запрос.Выполнить().Выгрузить();
	//Макет=ПолучитьМакет("МакетАудит");
	//ТабДок=Новый ТабличныйДокумент;
	//
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ТабДок.Вывести(Обл);
	//
	//Для каждого стр из ТЗ цикл
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	Обл.Параметры.Заполнить(стр);
	//	ТабДок.Вывести(Обл);
	//КонецЦикла;
	//ТЗ.Свернуть("Ссылка","СуммаКоррекция,СуммаЗаПроживаниеПлан,СуммаЗаПроживание");
	//Обл=Макет.ПолучитьОбласть("СтрокаИТОГО");
	//Попытка
	//	Обл.Параметры.Заполнить(ТЗ[0]);
	//исключение
	//конецпопытки;
	//
	//ТабДок.Вывести(Обл);
	////Политов
	//Обл=Макет.ПолучитьОбласть("Комментарий");
	//Обл.Параметры.Коммент=ТЗ[0].ссылка.Комментарий;
	//ТабДок.Вывести(Обл);
	/////Политов
	//Обл=Макет.ПолучитьОбласть("Автор");
	//Обл.Параметры.Админ=ТЗ[0].ссылка.Автор;
	//ТабДок.Вывести(Обл);
	////ТабДок.Показать();
	//ТабДок.Записать("C:\BASE\REP\Audit_"+Формат(ДТ, "ДФ=ddMMyy")+".xls",ТипФайлаТабличногоДокумента.XLS97);
	//ОтправитьМылом("Аудит за " + Формат(ДТ, "ДФ=dd.MM.yy"),"C:\BASE\REP\Audit_"+Формат(ДТ, "ДФ=ddMMyy")+".xls","1@renome-hotel.ru");
	//
	//
	////НЕЗАЕЗДЫ
	//
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//|	ЕжедневныйАудитНезаезды.Ссылка,
	//|	ЕжедневныйАудитНезаезды.НомерСтроки КАК НомерСтроки,
	//|	ЕжедневныйАудитНезаезды.Бронь,
	//|	ЕжедневныйАудитНезаезды.Клиент,
	//|	ЕжедневныйАудитНезаезды.НомерВРезерв,
	//|	ЕжедневныйАудитНезаезды.Комментарий
	//|ИЗ
	//|	Документ.ЕжедневныйАудит.Незаезды КАК ЕжедневныйАудитНезаезды
	//|ГДЕ
	//|	ЕжедневныйАудитНезаезды.Ссылка.Дата МЕЖДУ &ДН И &ДК
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки");	
	//Запрос.УстановитьПараметр("ДН",НачалоДня(ДТ));
	//Запрос.УстановитьПараметр("ДК",КонецДня(ДТ));
	//ТЗ=Запрос.Выполнить().Выгрузить();
	//Макет=ПолучитьМакет("МакетНезаезд");
	//ТабДок=Новый ТабличныйДокумент;
	//
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ТабДок.Вывести(Обл);
	//
	//Для каждого стр из ТЗ цикл
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	Обл.Параметры.Заполнить(стр);
	//	ТабДок.Вывести(Обл);
	//КонецЦикла;
	//
	//ТабДок.Вывести(Обл);
	////ТабДок.Показать();
	//ТабДок.Записать("C:\BASE\REP\NZ_"+Формат(ДТ, "ДФ=ddMMyy")+".xls",ТипФайлаТабличногоДокумента.XLS97);
	//ОтправитьМылом("Незаезды за " + Формат(ДТ, "ДФ=dd.MM.yy"),"C:\BASE\REP\NZ_"+Формат(ДТ, "ДФ=ddMMyy")+".xls","1@renome-hotel.ru");
	//
	//
	////НЕЗАЕЗДЫ
	//
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//|	ЕжедневныйАудитАннуляции.Ссылка,
	//|	ЕжедневныйАудитАннуляции.НомерСтроки КАК НомерСтроки,
	//|	ЕжедневныйАудитАннуляции.Бронь,
	//|	ЕжедневныйАудитАннуляции.Клиент,
	//|	ЕжедневныйАудитАннуляции.НомерВРезерв,
	//|	ЕжедневныйАудитАннуляции.Комментарий,
	//|	ЕжедневныйАудитАннуляции.Бронь.РезервС КАК РезервС,
	//|	ЕжедневныйАудитАннуляции.Бронь.РезервПо КАК РезервПо
	//|ИЗ
	//|	Документ.ЕжедневныйАудит.Аннуляции КАК ЕжедневныйАудитАннуляции
	//|ГДЕ
	//|	ЕжедневныйАудитАннуляции.Ссылка.Дата МЕЖДУ &ДН И &ДК
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки");	
	//Запрос.УстановитьПараметр("ДН",НачалоДня(ДТ));
	//Запрос.УстановитьПараметр("ДК",КонецДня(ДТ));
	//ТЗ=Запрос.Выполнить().Выгрузить();
	//Макет=ПолучитьМакет("МакетАннуляции");
	//ТабДок=Новый ТабличныйДокумент;
	//
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ТабДок.Вывести(Обл);
	//
	//Для каждого стр из ТЗ цикл
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	Обл.Параметры.Заполнить(стр);
	//	ТабДок.Вывести(Обл);
	//КонецЦикла;
	//
	//ТабДок.Вывести(Обл);
	////ТабДок.Показать();
	//ТабДок.Записать("C:\BASE\REP\ANN_"+Формат(ДТ, "ДФ=ddMMyy")+".xls",ТипФайлаТабличногоДокумента.XLS97);
	//ОтправитьМылом("Аннуляции за " + Формат(ДТ, "ДФ=dd.MM.yy"),"C:\BASE\REP\ANN_"+Формат(ДТ, "ДФ=ddMMyy")+".xls","1@renome-hotel.ru");
	//
КонецПроцедуры

&НаКлиенте
Процедура ОтчетАудит(ДТ)
Ответы = ОтчетАудитНаСервере(ДТ);

Для Каждого Ответ из Ответы Цикл
	ОтветЗначение = Ответ.Значение;
	Тема = ОтветЗначение.Тема;
	
	Файлы = Новый СписокЗначений;
	Файлы.Добавить(ОтветЗначение.Файл);
	
	Получатели = Новый СписокЗначений;
	Получатели.Добавить("postnikov_sn@invina.ru");
	
	//Получатели.Добавить("isaeva_js@invina.ru");
	//Получатели.Добавить("Sabolotskih_EV@invina.ru");
	//Получатели.Добавить("kantorov_ee@invina.ru");
	//Получатели.Добавить("fomina_as@invina.ru");
	//Получатели.Добавить("serkova_nv@invina.ru");       
	//Получатели.Добавить("Derendyaeva_AA@invina.ru");

	
	СлужебныеСервер.ОтправитьМейлом(Тема, Файлы, Получатели);
КонецЦикла
КонецПроцедуры

&НаСервере
Функция ОтчетАудитНаСервере(ДТ)
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЕжедневныйАудитПроданныеНомера.Ссылка,
	|	ЕжедневныйАудитПроданныеНомера.НомерСтроки КАК НомерСтроки,
	|	ЕжедневныйАудитПроданныеНомера.Бронь,
	|	ЕжедневныйАудитПроданныеНомера.Клиент,
	|	ЕжедневныйАудитПроданныеНомера.НомерВРезерв,
	|	ЕжедневныйАудитПроданныеНомера.Коэф,
	|	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживание,
	|	ЕжедневныйАудитПроданныеНомера.Заезд,
	|	ЕжедневныйАудитПроданныеНомера.ЗаездКоррекция,
	|	ЕжедневныйАудитПроданныеНомера.Выезд,
	|	ЕжедневныйАудитПроданныеНомера.ВыездКоррекция,
	|	ЕжедневныйАудитПроданныеНомера.Тариф_НеИспользуется,
	|	ЕжедневныйАудитПроданныеНомера.ТарифКоррекция,
	|	ЕжедневныйАудитПроданныеНомера.СуммаКоррекция,
	|	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживаниеПлан,
	|	ЕжедневныйАудитПроданныеНомера.Комментарий,
	|	ЕжедневныйАудитПроданныеНомера.Скидка,
	|	ЕжедневныйАудитПроданныеНомера.СкидкаКоррекция
	|ИЗ
	|	Документ.ЕжедневныйАудит.ПроданныеНомера КАК ЕжедневныйАудитПроданныеНомера
	|ГДЕ
	|	ЕжедневныйАудитПроданныеНомера.Ссылка.Дата МЕЖДУ &ДН И &ДК
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");	
	Запрос.УстановитьПараметр("ДН",НачалоДня(ДТ));
	Запрос.УстановитьПараметр("ДК",КонецДня(ДТ));
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	//Макет=ПолучитьМакет("МакетАудит");
	Макет = Отчеты.ЕжемесячныеФинансы.ПолучитьМакет("МакетАудит");
	
	ТабДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Обл);
	
	Для каждого стр из ТЗ цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(стр);
		ТабДок.Вывести(Обл);
	КонецЦикла;
	ТЗ.Свернуть("Ссылка","СуммаКоррекция,СуммаЗаПроживаниеПлан,СуммаЗаПроживание");
	Обл=Макет.ПолучитьОбласть("СтрокаИТОГО");
	Попытка
		Обл.Параметры.Заполнить(ТЗ[0]);
	исключение
	конецпопытки;
	
	ТабДок.Вывести(Обл);
	//Политов
	Обл=Макет.ПолучитьОбласть("Комментарий");
	Если ТЗ.Количество() > 0 Тогда
		Обл.Параметры.Коммент=ТЗ[0].ссылка.Комментарий;
	КонецЕсли;	
	ТабДок.Вывести(Обл);
	///Политов
	Обл=Макет.ПолучитьОбласть("Автор");
	Если ТЗ.Количество() > 0 Тогда
		Обл.Параметры.Админ=ТЗ[0].ссылка.Автор;
	КонецЕсли;	
	ТабДок.Вывести(Обл);
	////ТабДок.Показать();
	
	ИмяФайла = Константы.Папка_C_BASE.Получить();
	ИмяФайла = ИмяФайла + "REP\Audit_"+Формат(ДТ, "ДФ=ddMMyy")+".xls";  

	//ТабДок.Записать("C:\BASE\REP\Audit_"+Формат(ДТ, "ДФ=ddMMyy")+".xls",ТипФайлаТабличногоДокумента.XLS97);
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS97);
	
	//ОтправитьМылом("Аудит за " + Формат(ДТ, "ДФ=dd.MM.yy"),"C:\BASE\REP\Audit_"+Формат(ДТ, "ДФ=ddMMyy")+".xls","1@renome-hotel.ru");
	
	Ответ1 = Новый Структура;
	Ответ1.Вставить("Тема", "Аудит за " + Формат(ДТ, "ДФ=dd.MM.yy"));  
	Ответ1.Вставить("Файл", ИмяФайла);  
	//Ответ1.Вставить("Получатель", "postnikov_sn@invina.ru");  

	Ответ = Новый Структура;
	Ответ.Вставить("Ответ1", Ответ1);
	
	//НЕЗАЕЗДЫ
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЕжедневныйАудитНезаезды.Ссылка,
	|	ЕжедневныйАудитНезаезды.НомерСтроки КАК НомерСтроки,
	|	ЕжедневныйАудитНезаезды.Бронь,
	|	ЕжедневныйАудитНезаезды.Клиент,
	|	ЕжедневныйАудитНезаезды.НомерВРезерв,
	|	ЕжедневныйАудитНезаезды.Комментарий
	|ИЗ
	|	Документ.ЕжедневныйАудит.Незаезды КАК ЕжедневныйАудитНезаезды
	|ГДЕ
	|	ЕжедневныйАудитНезаезды.Ссылка.Дата МЕЖДУ &ДН И &ДК
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");	
	Запрос.УстановитьПараметр("ДН",НачалоДня(ДТ));
	Запрос.УстановитьПараметр("ДК",КонецДня(ДТ));
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	//Макет=ПолучитьМакет("МакетНезаезд");
	Макет=Отчеты.ЕжемесячныеФинансы.ПолучитьМакет("МакетНезаезд");
	
	ТабДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Обл);
	
	Для каждого стр из ТЗ цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(стр);
		ТабДок.Вывести(Обл);
	КонецЦикла;
	
	ТабДок.Вывести(Обл);
	////ТабДок.Показать();
	
	ИмяФайла = Константы.Папка_C_BASE.Получить();
	ИмяФайла = ИмяФайла + "REP\NZ_"+Формат(ДТ, "ДФ=ddMMyy")+".xls"; 
	
	//ТабДок.Записать("C:\BASE\REP\NZ_"+Формат(ДТ, "ДФ=ddMMyy")+".xls",ТипФайлаТабличногоДокумента.XLS97);
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS97);
	
	//ОтправитьМылом("Незаезды за " + Формат(ДТ, "ДФ=dd.MM.yy"),"C:\BASE\REP\NZ_"+Формат(ДТ, "ДФ=ddMMyy")+".xls","1@renome-hotel.ru");
	Ответ2 = Новый Структура;
	Ответ2.Вставить("Тема", "Незаезды за " + Формат(ДТ, "ДФ=dd.MM.yy"));  
	Ответ2.Вставить("Файл", ИмяФайла);  
	//Ответ2.Вставить("Получатель", "postnikov_sn@invina.ru");  

	Ответ.Вставить("Ответ2", Ответ2);
	
	//НЕЗАЕЗДЫ
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЕжедневныйАудитАннуляции.Ссылка,
	|	ЕжедневныйАудитАннуляции.НомерСтроки КАК НомерСтроки,
	|	ЕжедневныйАудитАннуляции.Бронь,
	|	ЕжедневныйАудитАннуляции.Клиент,
	|	ЕжедневныйАудитАннуляции.НомерВРезерв,
	|	ЕжедневныйАудитАннуляции.Комментарий,
	|	ЕжедневныйАудитАннуляции.Бронь.РезервС КАК РезервС,
	|	ЕжедневныйАудитАннуляции.Бронь.РезервПо КАК РезервПо
	|ИЗ
	|	Документ.ЕжедневныйАудит.Аннуляции КАК ЕжедневныйАудитАннуляции
	|ГДЕ
	|	ЕжедневныйАудитАннуляции.Ссылка.Дата МЕЖДУ &ДН И &ДК
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");	
	Запрос.УстановитьПараметр("ДН",НачалоДня(ДТ));
	Запрос.УстановитьПараметр("ДК",КонецДня(ДТ));
	ТЗ=Запрос.Выполнить().Выгрузить();
	
//	Макет=ПолучитьМакет("МакетАннуляции");
	Макет = Отчеты.ЕжемесячныеФинансы.ПолучитьМакет("МакетАннуляции");
	
	ТабДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Обл);
	
	Для каждого стр из ТЗ цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(стр);
		ТабДок.Вывести(Обл);
	КонецЦикла;
	
	ТабДок.Вывести(Обл);
	////ТабДок.Показать();
	
	ИмяФайла = Константы.Папка_C_BASE.Получить();
	ИмяФайла = ИмяФайла + "REP\ANN_"+Формат(ДТ, "ДФ=ddMMyy")+".xls";
		
	//ТабДок.Записать("C:\BASE\REP\ANN_"+Формат(ДТ, "ДФ=ddMMyy")+".xls",ТипФайлаТабличногоДокумента.XLS97);
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS97);
	
	
	//ОтправитьМылом("Аннуляции за " + Формат(ДТ, "ДФ=dd.MM.yy"),"C:\BASE\REP\ANN_"+Формат(ДТ, "ДФ=ddMMyy")+".xls","1@renome-hotel.ru");
	
	Ответ3 = Новый Структура;
	Ответ3.Вставить("Тема", "Аннуляции за " + Формат(ДТ, "ДФ=dd.MM.yy"));  
	Ответ3.Вставить("Файл", ИмяФайла);  
	//Ответ3.Вставить("Получатель", "postnikov_sn@invina.ru");  

	Ответ.Вставить("Ответ3", Ответ3);

	Возврат Ответ;
КонецФункции
//

&НаКлиенте
Функция ОтчетМесяц___(ДТО)
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//
	//ЗапросОстатков=Новый Запрос("ВЫБРАТЬ
	//|	СУММА(ДеньгиОстатки.СуммаОстаток) КАК СуммаОстаток,
	//|	ДеньгиОстатки.ВидОплаты
	//|ИЗ
	//|	РегистрНакопления.Деньги.Остатки(&ДТ, ) КАК ДеньгиОстатки
	//|ГДЕ
	//|	ДеньгиОстатки.КредитнаяКарта = ЛОЖЬ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДеньгиОстатки.ВидОплаты");
	//
	//ЗапросОстатков.УстановитьПараметр("ДТ",НачалоДня(ДТО));								
	//ТЗОст=ЗапросОстатков.Выполнить().Выгрузить();
	//Макет=ПолучитьМакет("Макет");
	//ЗапросПоДням=Новый Запрос("ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(Деньги.Период, ДЕНЬ) КАК ДТ,
	//|	Деньги.Регистратор,
	//|	Деньги.ВидОплаты,
	//|	СУММА(ВЫБОР
	//|			КОГДА Деньги.ВидДвижения = &ВидД
	//|				ТОГДА Деньги.Сумма
	//|			ИНАЧЕ Деньги.Сумма * -1
	//|		КОНЕЦ) КАК Сумма,
	//|	Деньги.ВидОперации,
	//|	Деньги.ВидДвижения,
	//|	Деньги.ДокументОплаты,
	//|	Деньги.КредитнаяКарта,
	//|	Деньги.Оплата
	//|ИЗ
	//|	РегистрНакопления.Деньги КАК Деньги
	//|ГДЕ
	//|	Деньги.Период >= &Период
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Деньги.Регистратор,
	//|	Деньги.ВидОплаты,
	//|	Деньги.ВидОперации,
	//|	Деньги.ВидДвижения,
	//|	НАЧАЛОПЕРИОДА(Деньги.Период, ДЕНЬ),
	//|	Деньги.ДокументОплаты,
	//|	Деньги.КредитнаяКарта,
	//|	Деньги.Оплата");	
	//ЗапросПоДням.УстановитьПараметр("Период",НачалоМесяца(ДТО));
	//ЗапросПоДням.УстановитьПараметр("ВидД",ВидДвиженияНакопления.Приход);
	//
	//ТЗПодням=ЗапросПоДням.Выполнить().Выгрузить();
	//ТЗПодням.Колонки.Добавить("ОплатаСтр");
	//Для Каждого ТЗД из ТЗПодням цикл
	//	//  Если ТипЗнч(ТЗД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//	
	//	
	//	//	ТЗД.ОплатаСтр=?(ТипЗнч(ТЗД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование"),"Проживание",ТЗД.Оплата.Родитель.Наименование);	  
	//	//иначе
	//	Попытка
	//		ТЗД.ОплатаСтр=?(ТЗД.Оплата.Пустая(),ТЗД.ВидОперации.Наименование,ТЗД.ОплатаСтр);	  
	//	Исключение
	//		ТЗД.ОплатаСтр="";
	//	КонецПопытки;
	//	//конецесли;
	//конеццикла;
	//
	//Обл=Макет.ПолучитьОбласть("ШапкаОбщ");
	//ОстатокПоКассе=ТЗОст.Найти(Перечисления.ВидОплаты.Наличные,"ВидОплаты");
	//ОстатокПоБанку=ТЗОст.Найти(Перечисления.ВидОплаты.Безнал,"ВидОплаты");
	//Обл.Параметры.Касса=?(ОстатокПоКассе=Неопределено,"--",ОстатокПоКассе.СуммаОстаток);
	//Обл.Параметры.Банк=?(ОстатокПоБанку=Неопределено,"--",ОстатокПоБанку.СуммаОстаток);
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//// по дням
	//
	//Для каждого Вывод Из ТЗПодням Цикл
	//	Если ТипЗнч(Вывод.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда			  
	//		Если Вывод.ВидОплаты=Перечисления.ВидОплаты.Наличные или Вывод.КредитнаяКарта тогда
	//			Если Вывод.Оплата.Бронирует.Турагенство тогда		
	//				НовВывод=ТЗПодням.Добавить();
	//				НовВывод.ДТ=Вывод.ДТ;
	//				НовВывод.ВидОплаты=Вывод.ВидОплаты;
	//				НовВывод.ВидДвижения=ВидДвиженияНакопления.Приход;
	//				НовВывод.КредитнаяКарта=Вывод.КредитнаяКарта;
	//				НовВывод.ОплатаСтр="агентское вознаграждение";
	//				НовВывод.Сумма=Вывод.сумма*(Вывод.Оплата.Бронирует.ПроцентАгент/100);	
	//			конецесли;					
	//		конецесли;
	//	иначеесли Вывод.Оплата=Справочники.ДопУслуги.НайтиПоКоду("000000160") тогда
	//		Вывод.ОплатаСтр="агентское вознаграждение";
	//		
	//	конецесли;
	//КонецЦикла; 
	//
	//ТЗДней=ТЗПодням.Скопировать();
	//ТЗДней.Свернуть("ДТ","Сумма");
	//ТЗКатегорий=ТЗПодням.Скопировать();
	//ТЗКатегорий.Свернуть("ВидОплаты,ВидДвижения,ДокументОплаты","Сумма");
	//ТЗДляВывода=ТЗПодням.Скопировать();
	//ТЗДляВывода.Свернуть("ВидОплаты,ВидДвижения,КредитнаяКарта,ОплатаСтр","Сумма");
	//
	//ТЗВидПоДням=ТЗПодням.Скопировать();
	//ТЗВидПоДням.Свернуть("ВидОплаты,ВидОперации,ДТ","Сумма");
	//ТаблДок=Новый ТабличныйДокумент;
	//Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
	//ТаблДок.Присоединить(Обл);
	//Обл=Макет.ПолучитьОбласть("Шапка|ДТ");
	//Для каждого ДТ Из ТЗДней Цикл
	//	Обл.Параметры.Период=Формат(ДТ.ДТ, "ДФ=dd.MM.yy");			
	//	ТаблДок.Присоединить(Обл);
	//КонецЦикла;
	//Обл=Макет.ПолучитьОбласть("Шапка|Итог");
	//
	//
	//ТаблДок.Присоединить(Обл);
	//
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	//
	//ТЗДляВывода.Колонки.Добавить("ВидДеятельности");
	//ТЗДляВывода.Колонки.Добавить("ВидОплатыСтр");
	//
	//Для каждого Вывод Из ТЗДляВывода Цикл
	//	Вывод.ВидДеятельности=ОпределитьВидДеятельности(Справочники.ВидыОпераций.ПустаяСсылка());
	//	Вывод.ВидОплатыСтр=?(Вывод.ВидОплаты=Перечисления.ВидОплаты.Безнал,"Безналичный расчет","Наличные");
	//	Вывод.ВидОплатыСтр=?(Вывод.КредитнаяКарта,"Кредитная карта",Вывод.ВидОплатыСтр);
	//	
	//	
	//	Вывод.Сумма=?(Вывод.КредитнаяКарта,Вывод.Сумма-Вывод.Сумма*0.019,Вывод.Сумма);
	//	
	//КонецЦикла; 
	//
	//ТЗДляВывода.Сортировать("ВидДеятельности,ВидДвижения,ВидОплатыСтр,ОплатаСтр");
	//Для каждого Вывод Из ТЗДляВывода Цикл
	//	ТаблДок=Новый ТабличныйДокумент;
	//	Обл=Макет.ПолучитьОбласть("КатМал|ШапкаВерх");
	//	Обл.Параметры.КатегорияБол=Вывод.ВидОплатыСтр;
	//	//Обл.Параметры.Категория=Вывод.ВидОперации;
	//	Обл.Параметры.ВидОперации=Вывод.ВидДвижения;
	//	Обл.Параметры.ВидДеятельности=Вывод.ВидДеятельности;
	//	Обл.Параметры.Статья=Вывод.ОплатаСтр;
	//	
	//	ТаблДок.Присоединить(Обл);
	//	Обл=Макет.ПолучитьОбласть("КатМал|ДТ");
	//	Для каждого ДТ Из ТЗДней Цикл
	//		Отбор=Новый Структура("ДТ,ВидОплаты,ВидДвижения,ОплатаСтр,КредитнаяКарта",ДТ.ДТ,Вывод.ВидОплаты,Вывод.ВидДвижения,Вывод.ОплатаСтр,Вывод.КредитнаяКарта);
	//		СуммаДляВывода=0;
	//		СтрокиДТ=ТЗПодням.НайтиСтроки(Отбор);
	//		
	//		Для каждого СтрДТ Из СтрокиДТ Цикл
	//			Если Вывод.КредитнаяКарта тогда
	//				СтрДТ.Сумма=СтрДТ.Сумма-СтрДТ.Сумма*0.019;
	//			конецесли;
	//			
	//			СуммаДляВывода=СуммаДляВывода+СтрДТ.Сумма;
	//			
	//		КонецЦикла; 
	//		Обл.Параметры.Сумма=Формат(СуммаДляВывода, "ЧГ=");  
	//		ТаблДок.Присоединить(Обл);			  
	//	КонецЦикла;	
	//	Обл=Макет.ПолучитьОбласть("КатМал|Итог");
	//	
	//	Обл.Параметры.Сумма=Формат(Вывод.Сумма, "ЧГ=");  
	//	ТаблДок.Присоединить(Обл);
	//	ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	//КонецЦикла; 
	//ТаблДок=Новый ТабличныйДокумент;
	//Обл=Макет.ПолучитьОбласть("ИтогНиз|ШапкаВерх");
	//ТаблДок.Присоединить(Обл);
	//СуммаДляВывода=0;
	//Обл=Макет.ПолучитьОбласть("КатМал|Итог");
	//
	//Для каждого ДТ Из ТЗДней Цикл
	//	Обл.Параметры.Сумма=Формат(ДТ.Сумма, "ЧГ=");
	//	СуммаДляВывода=СуммаДляВывода+ДТ.Сумма;
	//	ТаблДок.Присоединить(Обл);			  
	//КонецЦикла;	
	//Обл.Параметры.Сумма=Формат(СуммаДляВывода, "ЧГ=");
	//ТаблДок.Присоединить(Обл);	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	//
	//// ГОСТ
	//
	//Обл=Макет.ПолучитьОбласть("ГОСТ");
	//// Долги
	//
	//ЗапросДенег=Новый Запрос("ВЫБРАТЬ
	//|	СУММА(Деньги.Сумма) КАК Сумма,
	//|	Деньги.Оплата,
	//|	Деньги.ВидДвижения,
	//|	Деньги.ВидОплаты,
	//|	Деньги.ВидОперации
	//|ИЗ
	//|	РегистрНакопления.Деньги КАК Деньги
	//|ГДЕ
	//|	Деньги.Период >= &Период
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Деньги.Оплата,
	//|	Деньги.ВидДвижения,
	//|	Деньги.ВидОплаты,
	//|	Деньги.ВидОперации");
	//ЗапросДенег.УстановитьПараметр("Период",НачалоМесяца(ДТО));
	//ТЗДенег=ЗапросДенег.Выполнить().Выгрузить();
	//
	//
	//ЗапросДолгов=Новый Запрос("ВЫБРАТЬ
	//|	СУММА(ДолгиОстатки.СуммаОстаток) КАК СуммаОстаток
	//|ИЗ
	//|	РегистрНакопления.Долги.Остатки(&Пер, ) КАК ДолгиОстатки
	//|ГДЕ
	//|	ДолгиОстатки.ДокументОплаты.Дата <= &Пер
	//|	И ДолгиОстатки.ДокументОплаты.Статус <> &Статус");
	//ЗапросДолгов.УстановитьПараметр("Статус",Неопределено);								  								  
	//ЗапросДолгов.УстановитьПараметр("Пер",НачалоДня(ДТО));								  
	//ТЗД=ЗапросДолгов.Выполнить().Выгрузить();
	//
	////Обл.Параметры.Неопл=?(ТЗД.Количество()=0,0,(-1)*ТЗД[0].СуммаОстаток);
	//ВырОсн=0;
	//Обл.Параметры.ВырОсн=ВырОсн;
	//ВырОснКасс=0;
	//Для каждого СтрД Из ТЗДенег Цикл	
	//	Попытка
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если не СтрД.Оплата.Пустая() тогда					
	//				ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//			конецесли;			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Проживание" тогда
	//			ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		иначеесли Стрд.ВидОперации.Код="000000001" тогда
	//			ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		конецесли;
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЦикла; 
	//Обл.Параметры.ВырОснКасс=ВырОснКасс;
	//
	//ВырТранс=0;
	//Попытка
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				Если СтрД.ВидОперации.Код="000000022" тогда
	//					ВырТранс=ВырТранс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//				конецесли;
	//				
	//			конецесли;			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Транспортные услуги" тогда
	//			ВырТранс=ВырТранс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//
	//Обл.Параметры.ВырТранс=ВырТранс;
	//
	//ВырПрод=0;
	//Попытка
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				Если СтрД.ВидОперации.Код="000000003" или СтрД.ВидОперации.Код="000000013" тогда
	//					ВырПрод=ВырПрод+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//				конецесли;
	//				
	//			конецесли;			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Бар" или СтрД.Оплата.Родитель.Наименование="Минибар" тогда
	//			ВырПрод=ВырПрод+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		конецесли;
	//	КонецЦикла; 
	//	Обл.Параметры.ВырПрод=ВырПрод;
	//Исключение
	//КонецПопытки;
	//
	//
	//ВырТел=0;
	//Попытка
	//	
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				Если СтрД.ВидОперации.Код="000000012" тогда
	//					ВырТел=ВырТел+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//				конецесли;
	//				
	//			конецесли;			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Телефон" тогда
	//			ВырТел=ВырТел+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//Обл.Параметры.ВырТел=ВырТел;
	//
	//Расходы=0;
	//Попытка
	//	
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				Если СтрД.ВидОперации.Код<>"000000012" И СтрД.ВидОперации.Код<>"000000013"// И СтрД.ВидОперации.Код<>"000000003"
	//					И СтрД.ВидОперации.Код<>"000000022" и СтрД.ВидОперации.Код<>"000000011" тогда
	//					Расходы=Расходы+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,0,-1);						
	//				конецесли;					
	//			конецесли;			
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//Обл.Параметры.Расходы=Расходы;
	//
	//ВырОснНал=0;
	//ОстНал=0;
	//Попытка
	//	Для каждого СтрД Из ТЗДенег Цикл
	//		Если СтрД.ВидОплаты=Перечисления.ВидОплаты.Безнал тогда
	//			Продолжить;
	//		конецесли;
	//		
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если не СтрД.Оплата.Пустая() тогда					
	//				ВырОснНал=ВырОснНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//			иначе
	//				ОстНал=ОстНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//			конецесли;			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Проживание" или Стрд.ВидОперации.Код="000000001" тогда
	//			ВырОснНал=ВырОснНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		иначе
	//			ОстНал=ОстНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//
	//
	//Обл.Параметры.ВырОснНал=ВырОснНал;
	//Обл.Параметры.ОстНал=ОстНал;
	//
	//
	//Изъятия=0;
	//Попытка
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				Если СтрД.ВидОперации.Код="000000011" тогда
	//					Изъятия=Изъятия+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//				конецесли;					
	//			конецесли;			
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//Обл.Параметры.Изъятия=Изъятия;
	//
	//Обл.Параметры.Касса=ОстатокПоКассе.СуммаОстаток;
	//
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//
	//
	//
	//
	//
	////Касса
	////ПроверкаВыр
	////ПроверкаНал
	////ТекРезультат
	//Если Авто тогда
	//	ЭлементыФормы.ПолеОтчета.Записать("C:\BASE\REP\F_mth.xls",ТипФайлаТабличногоДокумента.XLS97);
	//конецесли;
	//
	//
	//
КонецФункции

&НаКлиенте
Функция ОтчетМесяц(ДТО)
ОтчетМесяцНаСервере(ДТО);	
КонецФункции
	
&НаСервере
Функция ОтчетМесяцНаСервере(ДТО)
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	ЗапросОстатков=Новый Запрос("ВЫБРАТЬ
	|	СУММА(ДеньгиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ДеньгиОстатки.ВидОплаты
	|ИЗ
	|	РегистрНакопления.Деньги.Остатки(&ДТ, ) КАК ДеньгиОстатки
	|ГДЕ
	|	ДеньгиОстатки.КредитнаяКарта = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДеньгиОстатки.ВидОплаты");
	
	ЗапросОстатков.УстановитьПараметр("ДТ",НачалоДня(ДТО));								
	ТЗОст=ЗапросОстатков.Выполнить().Выгрузить();
	
	//Макет=ПолучитьМакет("Макет");
	Макет = Отчеты.ЕжемесячныеФинансы.ПолучитьМакет("Макет");
	
	ЗапросПоДням=Новый Запрос("ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Деньги.Период, ДЕНЬ) КАК ДТ,
	|	Деньги.Регистратор,
	|	Деньги.ВидОплаты,
	|	СУММА(ВЫБОР
	|			КОГДА Деньги.ВидДвижения = &ВидД
	|				ТОГДА Деньги.Сумма
	|			ИНАЧЕ Деньги.Сумма * -1
	|		КОНЕЦ) КАК Сумма,
	|	Деньги.ВидОперации,
	|	Деньги.ВидДвижения,
	|	Деньги.ДокументОплаты,
	|	Деньги.КредитнаяКарта,
	|	Деньги.Оплата
	|ИЗ
	|	РегистрНакопления.Деньги КАК Деньги
	|ГДЕ
	|	Деньги.Период >= &Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Деньги.Регистратор,
	|	Деньги.ВидОплаты,
	|	Деньги.ВидОперации,
	|	Деньги.ВидДвижения,
	|	НАЧАЛОПЕРИОДА(Деньги.Период, ДЕНЬ),
	|	Деньги.ДокументОплаты,
	|	Деньги.КредитнаяКарта,
	|	Деньги.Оплата");	
	ЗапросПоДням.УстановитьПараметр("Период",НачалоМесяца(ДТО));
	ЗапросПоДням.УстановитьПараметр("ВидД",ВидДвиженияНакопления.Приход);
	
	ТЗПодням=ЗапросПоДням.Выполнить().Выгрузить();
	ТЗПодням.Колонки.Добавить("ОплатаСтр");
	Для Каждого ТЗД из ТЗПодням цикл
		////  Если ТипЗнч(ТЗД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
		//
		//
		////	ТЗД.ОплатаСтр=?(ТипЗнч(ТЗД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование"),"Проживание",ТЗД.Оплата.Родитель.Наименование);	  
		////иначе
		Попытка
			ТЗД.ОплатаСтр=?(ТЗД.Оплата.Пустая(),ТЗД.ВидОперации.Наименование,ТЗД.ОплатаСтр);	  
		Исключение
			ТЗД.ОплатаСтр="";
		КонецПопытки;
		////конецесли;
	конеццикла;
	
	Обл=Макет.ПолучитьОбласть("ШапкаОбщ");
	ОстатокПоКассе=ТЗОст.Найти(Перечисления.ВидОплаты.Наличные,"ВидОплаты");
	ОстатокПоБанку=ТЗОст.Найти(Перечисления.ВидОплаты.Безнал,"ВидОплаты");
	Обл.Параметры.Касса=?(ОстатокПоКассе=Неопределено,"--",ОстатокПоКассе.СуммаОстаток);
	Обл.Параметры.Банк=?(ОстатокПоБанку=Неопределено,"--",ОстатокПоБанку.СуммаОстаток);
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	// по дням
	
	Для каждого Вывод Из ТЗПодням Цикл
		Если ТипЗнч(Вывод.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда			  
			Если Вывод.ВидОплаты=Перечисления.ВидОплаты.Наличные или Вывод.КредитнаяКарта тогда
				Если Вывод.Оплата.Бронирует.Турагентство тогда		
					НовВывод=ТЗПодням.Добавить();
					НовВывод.ДТ=Вывод.ДТ;
					НовВывод.ВидОплаты=Вывод.ВидОплаты;
					НовВывод.ВидДвижения=ВидДвиженияНакопления.Приход;
					НовВывод.КредитнаяКарта=Вывод.КредитнаяКарта;
					НовВывод.ОплатаСтр="агентское вознаграждение";
					НовВывод.Сумма=Вывод.сумма*(Вывод.Оплата.Бронирует.ПроцентАгент_OLD/100);	
				конецесли;					
			конецесли;
		иначеесли Вывод.Оплата=Справочники.ДопУслуги.НайтиПоКоду("000000160") тогда
			Вывод.ОплатаСтр="агентское вознаграждение";
			
		конецесли;
	КонецЦикла; 
	
	ТЗДней=ТЗПодням.Скопировать();
	ТЗДней.Свернуть("ДТ","Сумма");
	ТЗКатегорий=ТЗПодням.Скопировать();
	ТЗКатегорий.Свернуть("ВидОплаты,ВидДвижения,ДокументОплаты","Сумма");
	ТЗДляВывода=ТЗПодням.Скопировать();
	ТЗДляВывода.Свернуть("ВидОплаты,ВидДвижения,КредитнаяКарта,ОплатаСтр","Сумма");
	
	ТЗВидПоДням=ТЗПодням.Скопировать();
	ТЗВидПоДням.Свернуть("ВидОплаты,ВидОперации,ДТ","Сумма");
	ТаблДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
	ТаблДок.Присоединить(Обл);
	Обл=Макет.ПолучитьОбласть("Шапка|ДТ");
	Для каждого ДТ Из ТЗДней Цикл
		Обл.Параметры.Период=Формат(ДТ.ДТ, "ДФ=dd.MM.yy");			
		ТаблДок.Присоединить(Обл);
	КонецЦикла;
	Обл=Макет.ПолучитьОбласть("Шапка|Итог");
	
	
	ТаблДок.Присоединить(Обл);
	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	ПолеОтчета.Вывести(ТаблДок);
	
	ТЗДляВывода.Колонки.Добавить("ВидДеятельности");
	ТЗДляВывода.Колонки.Добавить("ВидОплатыСтр");
	
	Для каждого Вывод Из ТЗДляВывода Цикл
		Вывод.ВидДеятельности=ОпределитьВидДеятельности(Справочники.ВидыОпераций.ПустаяСсылка());
		Вывод.ВидОплатыСтр=?(Вывод.ВидОплаты=Перечисления.ВидОплаты.Безнал,"Безналичный расчет","Наличные");
		Вывод.ВидОплатыСтр=?(Вывод.КредитнаяКарта,"Кредитная карта",Вывод.ВидОплатыСтр);
		
		
		Вывод.Сумма=?(Вывод.КредитнаяКарта,Вывод.Сумма-Вывод.Сумма*0.019,Вывод.Сумма);
		
	КонецЦикла; 
	
	ТЗДляВывода.Сортировать("ВидДеятельности,ВидДвижения,ВидОплатыСтр,ОплатаСтр");
	Для каждого Вывод Из ТЗДляВывода Цикл
		ТаблДок=Новый ТабличныйДокумент;
		Обл=Макет.ПолучитьОбласть("КатМал|ШапкаВерх");
		Обл.Параметры.КатегорияБол=Вывод.ВидОплатыСтр;
		////Обл.Параметры.Категория=Вывод.ВидОперации;
		Обл.Параметры.ВидОперации=Вывод.ВидДвижения;
		Обл.Параметры.ВидДеятельности=Вывод.ВидДеятельности;
		Обл.Параметры.Статья=Вывод.ОплатаСтр;
		
		ТаблДок.Присоединить(Обл);
		Обл=Макет.ПолучитьОбласть("КатМал|ДТ");
		Для каждого ДТ Из ТЗДней Цикл
			Отбор=Новый Структура("ДТ,ВидОплаты,ВидДвижения,ОплатаСтр,КредитнаяКарта",ДТ.ДТ,Вывод.ВидОплаты,Вывод.ВидДвижения,Вывод.ОплатаСтр,Вывод.КредитнаяКарта);
			СуммаДляВывода=0;
			СтрокиДТ=ТЗПодням.НайтиСтроки(Отбор);
			
			Для каждого СтрДТ Из СтрокиДТ Цикл
				Если Вывод.КредитнаяКарта тогда
					СтрДТ.Сумма=СтрДТ.Сумма-СтрДТ.Сумма*0.019;
				конецесли;
				
				СуммаДляВывода=СуммаДляВывода+СтрДТ.Сумма;
				
			КонецЦикла; 
			Обл.Параметры.Сумма=Формат(СуммаДляВывода, "ЧГ=");  
			ТаблДок.Присоединить(Обл);			  
		КонецЦикла;	
		Обл=Макет.ПолучитьОбласть("КатМал|Итог");
		
		Обл.Параметры.Сумма=Формат(Вывод.Сумма, "ЧГ=");  
		ТаблДок.Присоединить(Обл);
		
		//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
		ПолеОтчета.Вывести(ТаблДок);
		
	КонецЦикла; 
	ТаблДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("ИтогНиз|ШапкаВерх");
	ТаблДок.Присоединить(Обл);
	СуммаДляВывода=0;
	Обл=Макет.ПолучитьОбласть("КатМал|Итог");
	
	Для каждого ДТ Из ТЗДней Цикл
		Обл.Параметры.Сумма=Формат(ДТ.Сумма, "ЧГ=");
		СуммаДляВывода=СуммаДляВывода+ДТ.Сумма;
		ТаблДок.Присоединить(Обл);			  
	КонецЦикла;	
	Обл.Параметры.Сумма=Формат(СуммаДляВывода, "ЧГ=");
	ТаблДок.Присоединить(Обл);	
	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	ПолеОтчета.Вывести(ТаблДок);
	
	// ГОСТ
	
	Обл=Макет.ПолучитьОбласть("ГОСТ");
	// Долги
	
	ЗапросДенег=Новый Запрос("ВЫБРАТЬ
	|	СУММА(Деньги.Сумма) КАК Сумма,
	|	Деньги.Оплата,
	|	Деньги.ВидДвижения,
	|	Деньги.ВидОплаты,
	|	Деньги.ВидОперации
	|ИЗ
	|	РегистрНакопления.Деньги КАК Деньги
	|ГДЕ
	|	Деньги.Период >= &Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Деньги.Оплата,
	|	Деньги.ВидДвижения,
	|	Деньги.ВидОплаты,
	|	Деньги.ВидОперации");
	ЗапросДенег.УстановитьПараметр("Период",НачалоМесяца(ДТО));
	ТЗДенег=ЗапросДенег.Выполнить().Выгрузить();
	
	
	ЗапросДолгов=Новый Запрос("ВЫБРАТЬ
	|	СУММА(ДолгиОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Долги.Остатки(&Пер, ) КАК ДолгиОстатки
	|ГДЕ
	|	ДолгиОстатки.ДокументОплаты.Дата <= &Пер
	|	И ДолгиОстатки.ДокументОплаты.Статус <> &Статус");
	ЗапросДолгов.УстановитьПараметр("Статус",Неопределено);								  								  
	ЗапросДолгов.УстановитьПараметр("Пер",НачалоДня(ДТО));								  
	ТЗД=ЗапросДолгов.Выполнить().Выгрузить();
	
	////Обл.Параметры.Неопл=?(ТЗД.Количество()=0,0,(-1)*ТЗД[0].СуммаОстаток);
	ВырОсн=0;
	Обл.Параметры.ВырОсн=ВырОсн;
	ВырОснКасс=0;
	Для каждого СтрД Из ТЗДенег Цикл	
		Попытка
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если не СтрД.Оплата.Пустая() тогда					
					ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
				конецесли;			
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Проживание" тогда
				ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			иначеесли Стрд.ВидОперации.Код="000000001" тогда
				ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			конецесли;
		Исключение
		КонецПопытки;
		
	КонецЦикла; 
	Обл.Параметры.ВырОснКасс=ВырОснКасс;
	
	ВырТранс=0;
	Попытка
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					Если СтрД.ВидОперации.Код="000000022" тогда
						ВырТранс=ВырТранс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
					конецесли;
					
				конецесли;			
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Транспортные услуги" тогда
				ВырТранс=ВырТранс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	
	Обл.Параметры.ВырТранс=ВырТранс;
	
	ВырПрод=0;
	Попытка
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					Если СтрД.ВидОперации.Код="000000003" или СтрД.ВидОперации.Код="000000013" тогда
						ВырПрод=ВырПрод+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
					конецесли;
					
				конецесли;			
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Бар" или СтрД.Оплата.Родитель.Наименование="Минибар" тогда
				ВырПрод=ВырПрод+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			конецесли;
		КонецЦикла; 
		Обл.Параметры.ВырПрод=ВырПрод;
	Исключение
	КонецПопытки;
	
	
	ВырТел=0;
	Попытка
		
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					Если СтрД.ВидОперации.Код="000000012" тогда
						ВырТел=ВырТел+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
					конецесли;
					
				конецесли;			
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Телефон" тогда
				ВырТел=ВырТел+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Обл.Параметры.ВырТел=ВырТел;
	
	Расходы=0;
	Попытка
		
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					Если СтрД.ВидОперации.Код<>"000000012" И СтрД.ВидОперации.Код<>"000000013"// И СтрД.ВидОперации.Код<>"000000003"
						И СтрД.ВидОперации.Код<>"000000022" и СтрД.ВидОперации.Код<>"000000011" тогда
						Расходы=Расходы+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,0,-1);						
					конецесли;					
				конецесли;			
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Обл.Параметры.Расходы=Расходы;
	
	ВырОснНал=0;
	ОстНал=0;
	Попытка
		Для каждого СтрД Из ТЗДенег Цикл
			Если СтрД.ВидОплаты=Перечисления.ВидОплаты.Безнал тогда
				Продолжить;
			конецесли;
			
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если не СтрД.Оплата.Пустая() тогда					
					ВырОснНал=ВырОснНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
				иначе
					ОстНал=ОстНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
				конецесли;			
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Проживание" или Стрд.ВидОперации.Код="000000001" тогда
				ВырОснНал=ВырОснНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			иначе
				ОстНал=ОстНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	
	
	Обл.Параметры.ВырОснНал=ВырОснНал;
	Обл.Параметры.ОстНал=ОстНал;
	
	
	Изъятия=0;
	Попытка
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					Если СтрД.ВидОперации.Код="000000011" тогда
						Изъятия=Изъятия+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
					конецесли;					
				конецесли;			
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Обл.Параметры.Изъятия=Изъятия;
	
	Обл.Параметры.Касса=ОстатокПоКассе.СуммаОстаток;
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	
	
	
	
	
	////Касса
	////ПроверкаВыр
	////ПроверкаНал
	////ТекРезультат
	Если Авто тогда
		//ЭлементыФормы.ПолеОтчета.Записать("C:\BASE\REP\F_mth.xls",ТипФайлаТабличногоДокумента.XLS97);
		ИмяФайла = Константы.Папка_C_BASE.Получить();
		ИмяФайла = ИмяФайла + "REP\F_mth" + ".xls";
		
		ПолеОтчета.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS97);
	конецесли;
	
КонецФункции

&НаСервере
Функция ОпределитьВидДеятельности(Вид) 
	Попытка
		Если Вид.Пустая() или Вид.Код="000000001" тогда
			Возврат "1) Основная деятельность";
		иначеесли Найти(Вид.Наименование,"Продукты")>0 или Найти(Вид.Наименование,"продукты")>0 тогда
			Возврат "2) Бар";
		иначеесли Найти(Вид.Наименование,"Транспорт")>0 тогда
			Возврат "3) Транспорт";
		иначе
			Возврат "4) Другое";
		конецесли;
	Исключение
		Возврат "1 Основная деятельность";
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция ОтчетДень___(ДТ)
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//ДеньОтчета=ДТ;
	//ЗапросОстатков=Новый Запрос("ВЫБРАТЬ
	//|	СУММА(ДеньгиОстатки.СуммаОстаток) КАК СуммаОстаток,
	//|	ДеньгиОстатки.ВидОплаты
	//|ИЗ
	//|	РегистрНакопления.Деньги.Остатки(&ДТ, ) КАК ДеньгиОстатки
	//|ГДЕ
	//|	ДеньгиОстатки.КредитнаяКарта = ЛОЖЬ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДеньгиОстатки.ВидОплаты");
	//
	//ЗапросОстатков.УстановитьПараметр("ДТ",НачалоДня(ДТ));								
	//ТЗОст=ЗапросОстатков.Выполнить().Выгрузить();
	//
	//ЗапросОстатков=Новый Запрос("ВЫБРАТЬ
	//|	СУММА(ДеньгиОстатки.СуммаОстаток) КАК СуммаОстаток,
	//|	ДеньгиОстатки.ВидОплаты
	//|ИЗ
	//|	РегистрНакопления.Деньги.Остатки(&ДТ, ) КАК ДеньгиОстатки
	//|ГДЕ
	//|	ДеньгиОстатки.КредитнаяКарта = ЛОЖЬ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДеньгиОстатки.ВидОплаты");
	//
	//ЗапросОстатков.УстановитьПараметр("ДТ",КонецДня(ДТ));								
	//ТЗОстКД=ЗапросОстатков.Выполнить().Выгрузить();
	//
	//
	//Макет=ПолучитьМакет("Макет1");
	//ЗапросПоДням=Новый Запрос("ВЫБРАТЬ
	//|	Деньги.Регистратор,
	//|	Деньги.ВидОплаты,
	//|	СУММА(ВЫБОР
	//|			КОГДА Деньги.ВидДвижения = &ВидД
	//|				ТОГДА Деньги.Сумма
	//|			ИНАЧЕ Деньги.Сумма * -1
	//|		КОНЕЦ) КАК Сумма,
	//|	Деньги.ВидОперации,
	//|	Деньги.ВидДвижения,
	//|	Деньги.ДокументОплаты,
	//|	Деньги.Контрагент,
	//|	Деньги.КредитнаяКарта,
	//|	Деньги.Оплата
	//|ИЗ
	//|	РегистрНакопления.Деньги КАК Деньги
	//|ГДЕ
	//|	Деньги.Период МЕЖДУ &ДН И &ДК
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Деньги.Регистратор,
	//|	Деньги.ВидОплаты,
	//|	Деньги.ВидОперации,
	//|	Деньги.ВидДвижения,
	//|	Деньги.ДокументОплаты,
	//|	Деньги.Контрагент,
	//|	Деньги.КредитнаяКарта,
	//|	Деньги.Оплата");	
	//ЗапросПоДням.УстановитьПараметр("ДН",НачалоДня(ДТ));
	//ЗапросПоДням.УстановитьПараметр("ДК",КонецДня(ДТ));
	//ЗапросПоДням.УстановитьПараметр("ВидД",ВидДвиженияНакопления.Приход);
	//
	//ТЗПодням=ЗапросПоДням.Выполнить().Выгрузить();
	//ТЗПодням.Колонки.Добавить("ОплатаСтр");
	//Для Каждого ТЗД из ТЗПодням цикл
	//	ТЗД.ОплатаСтр=?(ТипЗнч(ТЗД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование"),"Проживание",ТЗД.Оплата.Родитель.Наименование);	  
	//	ТЗД.ОплатаСтр=?(ТЗД.Оплата.Пустая(),ТЗД.ВидОперации.Наименование,ТЗД.ОплатаСтр);		  
	//конеццикла;
	//
	//Обл=Макет.ПолучитьОбласть("ШапкаОбщ");
	//
	//ОстатокПоКассе=ТЗОст.Найти(Перечисления.ВидОплаты.Наличные,"ВидОплаты");
	//ОстатокПоКассеКД=ТЗОстКД.Найти(Перечисления.ВидОплаты.Наличные,"ВидОплаты");
	//ОстатокПоБанку=ТЗОст.Найти(Перечисления.ВидОплаты.Безнал,"ВидОплаты");
	//Обл.Параметры.ТекОст="Текущие остатки на " + Формат(ДТ, "ДЛФ=DD");
	//Обл.Параметры.Касса=?(ОстатокПоКассе=Неопределено,"--",ОстатокПоКассе.СуммаОстаток);
	//Обл.Параметры.КассаКД=?(ОстатокПоКассеКД=Неопределено,"--",ОстатокПоКассеКД.СуммаОстаток);
	//Обл.Параметры.КассаДельта=?(ОстатокПоКассеКД=Неопределено,"--",ОстатокПоКассеКД.СуммаОстаток-ОстатокПоКассе.СуммаОстаток);
	//Обл.Параметры.Банк=?(ОстатокПоБанку=Неопределено,"--",ОстатокПоБанку.СуммаОстаток);
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//// по дням
	//Для каждого Вывод Из ТЗПодням Цикл
	//	Если ТипЗнч(Вывод.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//		Если Вывод.ВидОплаты=Перечисления.ВидОплаты.Наличные или Вывод.КредитнаяКарта тогда
	//			Если Вывод.Оплата.Бронирует.Турагенство тогда		
	//				НовВывод=ТЗПодням.Добавить();
	//				НовВывод.Контрагент=Вывод.Контрагент;
	//				НовВывод.ВидОплаты=Вывод.ВидОплаты;
	//				НовВывод.ВидДвижения=ВидДвиженияНакопления.Приход;
	//				НовВывод.КредитнаяКарта=Вывод.КредитнаяКарта;
	//				НовВывод.ОплатаСтр="агентское вознаграждение";
	//				НовВывод.Сумма=Вывод.сумма*(Вывод.Оплата.Бронирует.ПроцентАгент/100);	
	//				Если Вывод.КредитнаяКарта тогда
	//					Вывод.Сумма=Вывод.Сумма-Вывод.Сумма*0.019;
	//				конецесли;
	//				Вывод.сумма=Вывод.сумма-НовВывод.Сумма;					  
	//			ИначеЕсли Вывод.КредитнаяКарта тогда
	//				Вывод.Сумма=Вывод.Сумма-Вывод.Сумма*0.019;
	//				
	//			конецесли;					
	//			
	//			
	//		конецесли;
	//	иначеесли Вывод.Оплата=Справочники.ДопУслуги.НайтиПоКоду("000000160") тогда
	//		Вывод.ОплатаСтр="агентское вознаграждение";
	//		
	//	конецесли;
	//КонецЦикла; 
	////Для каждого Вывод Из ТЗПодням Цикл
	//
	////			Если Вывод.КредитнаяКарта и Вывод.ОплатаСтр<>"агентское вознаграждение" тогда
	//// 			  Вывод.Сумма=Вывод.Сумма-Вывод.Сумма*0.019;
	//// 		  конецесли;
	////КонецЦикла;
	//
	//ТЗДней=ТЗПодням.Скопировать();
	//ТЗДней.Свернуть("Контрагент","Сумма");
	//ТЗКатегорий=ТЗПодням.Скопировать();
	//ТЗКатегорий.Свернуть("ВидОплаты,ВидДвижения,ДокументОплаты","Сумма");
	//ТЗДляВывода=ТЗПодням.Скопировать();
	//ТЗДляВывода.Свернуть("ВидОплаты,ВидДвижения,КредитнаяКарта,ОплатаСтр","Сумма");
	//
	//ТЗВидПоДням=ТЗПодням.Скопировать();
	//ТЗВидПоДням.Свернуть("ВидОплаты,ВидОперации,Контрагент","Сумма");
	//ТаблДок=Новый ТабличныйДокумент;
	//Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
	//ТаблДок.Присоединить(Обл);
	//Обл=Макет.ПолучитьОбласть("Шапка|ДТ");
	//Для каждого ДТ Из ТЗДней Цикл
	//	Обл.Параметры.Период=ДТ.Контрагент;			
	//	ТаблДок.Присоединить(Обл);
	//КонецЦикла;
	//Обл=Макет.ПолучитьОбласть("Шапка|Итог");
	//
	//
	//ТаблДок.Присоединить(Обл);
	//ТЗДляВывода.Колонки.Добавить("ВидДеятельности");
	//ТЗДляВывода.Колонки.Добавить("ВидОплатыСтр");
	//
	//Для каждого Вывод Из ТЗДляВывода Цикл
	//	Вывод.ВидДеятельности=ОпределитьВидДеятельности(Справочники.ВидыОпераций.ПустаяСсылка());
	//	Вывод.ВидОплатыСтр=?(Вывод.ВидОплаты=Перечисления.ВидОплаты.Безнал,"Безналичный расчет","Наличные");
	//	Вывод.ВидОплатыСтр=?(Вывод.КредитнаяКарта,"Кредитная карта",Вывод.ВидОплатыСтр);		  
	//	//Если Вывод.ОплатаСтр<>"агентское вознаграждение" тогда
	//	//Вывод.Сумма=?(Вывод.КредитнаяКарта,Вывод.Сумма-Вывод.Сумма*0.019,Вывод.Сумма);		  
	//	//конецесли;
	//КонецЦикла; 
	//
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	//ТЗДляВывода.Сортировать("ВидДвижения,ВидОплатыСтр,ОплатаСтр");
	//Для каждого Вывод Из ТЗДляВывода Цикл
	//	ТаблДок=Новый ТабличныйДокумент;
	//	Обл=Макет.ПолучитьОбласть("КатМал|ШапкаВерх");
	//	Обл.Параметры.КатегорияБол=Вывод.ВидОплатыСтр;
	//	//Обл.Параметры.Категория=Вывод.ВидОперации;
	//	Обл.Параметры.ВидОперации=Вывод.ВидДвижения;
	//	Обл.Параметры.Статья=Вывод.ОплатаСтр;
	//	ТаблДок.Присоединить(Обл);
	//	Обл=Макет.ПолучитьОбласть("КатМал|ДТ");
	//	Для каждого ДТ Из ТЗДней Цикл
	//		Отбор=Новый Структура("Контрагент,ВидОплаты,ВидДвижения,КредитнаяКарта,ОплатаСтр",ДТ.Контрагент,Вывод.ВидОплаты,Вывод.ВидДвижения,Вывод.КредитнаяКарта,Вывод.ОплатаСтр);
	//		СуммаДляВывода=0;
	//		СтрокиДТ=ТЗПодням.НайтиСтроки(Отбор);
	//		Для каждого СтрДТ Из СтрокиДТ Цикл
	//			//Если Вывод.КредитнаяКарта и Вывод.ОплатаСтр<>"агентское вознаграждение" тогда
	//			//   	СтрДТ.Сумма=СтрДТ.Сумма-СтрДТ.Сумма*0.019;
	//			//   конецесли;
	//			СуммаДляВывода=СуммаДляВывода+СтрДТ.Сумма;
	//			
	//		КонецЦикла; 
	//		Обл.Параметры.Сумма=Формат(СуммаДляВывода, "ЧГ=");  
	//		ТаблДок.Присоединить(Обл);			  
	//	КонецЦикла;	
	//	Обл=Макет.ПолучитьОбласть("КатМал|Итог");
	//	
	//	Обл.Параметры.Сумма=Формат(Вывод.Сумма, "ЧГ=");  
	//	ТаблДок.Присоединить(Обл);
	//	ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	//КонецЦикла; 
	//ТаблДок=Новый ТабличныйДокумент;
	//Обл=Макет.ПолучитьОбласть("ИтогНиз|ШапкаВерх");
	//ТаблДок.Присоединить(Обл);
	//СуммаДляВывода=0;
	//Обл=Макет.ПолучитьОбласть("КатМал|Итог");
	//
	//Для каждого ДТ Из ТЗДней Цикл
	//	Обл.Параметры.Сумма=Формат(ДТ.Сумма, "ЧГ=");
	//	СуммаДляВывода=СуммаДляВывода+ДТ.Сумма;
	//	ТаблДок.Присоединить(Обл);			  
	//КонецЦикла;	
	//Обл.Параметры.Сумма=Формат(СуммаДляВывода, "ЧГ=");
	//ТаблДок.Присоединить(Обл);	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	//// ГОСТ
	//
	//Обл=Макет.ПолучитьОбласть("ГОСТ");
	//// Долги
	//
	//ЗапросДенег=Новый Запрос("ВЫБРАТЬ
	//|	СУММА(Деньги.Сумма) КАК Сумма,
	//|	Деньги.Оплата,
	//|	Деньги.ВидДвижения,
	//|	Деньги.ВидОплаты,
	//|	Деньги.ВидОперации,
	//|	Деньги.Период,
	//|	Деньги.КредитнаяКарта
	//|ИЗ
	//|	РегистрНакопления.Деньги КАК Деньги
	//|ГДЕ
	//|	Деньги.Период МЕЖДУ &ПериодН И &ПериодК
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Деньги.Оплата,
	//|	Деньги.ВидДвижения,
	//|	Деньги.ВидОплаты,
	//|	Деньги.ВидОперации,
	//|	Деньги.Период,
	//|	Деньги.КредитнаяКарта");
	//ЗапросДенег.УстановитьПараметр("ПериодН",НачалоМесяца(ДеньОтчета));
	//ЗапросДенег.УстановитьПараметр("ПериодК",КонецДня(ДеньОтчета));
	//ТЗДенег=ЗапросДенег.Выполнить().Выгрузить();
	//
	//
	//ЗапросДолгов=Новый Запрос("ВЫБРАТЬ
	//|	ДолгиОстатки.СуммаОстаток
	//|ИЗ
	//|	РегистрНакопления.Долги.Остатки(&Пер, ) КАК ДолгиОстатки");
	//ЗапросДолгов.УстановитьПараметр("Пер",НачалоДня(ДеньОтчета));								  
	//ТЗД=ЗапросДолгов.Выполнить().Выгрузить();
	//
	////Обл.Параметры.Неопл=?(ТЗД.Количество()=0,0,(-1)*ТЗД[0].СуммаОстаток);
	//ВырОсн=0;
	//Обл.Параметры.ВырОсн=ВырОсн;
	//ВырОснКасс=0;
	//Агент=0;
	//
	//Для каждого СтрД Из ТЗДенег Цикл
	//	Если Стрд.КредитнаяКарта  тогда
	//		СуммаККДо=Стрд.Сумма;
	//		Стрд.Сумма=Стрд.Сумма-Стрд.Сумма*0.019;	
	//	конецесли;
	//	Попытка
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если не СтрД.Оплата.Пустая() или Стрд.ВидОперации.Код="000000001" тогда					
	//				ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//			конецесли;			
	//			Если СтрД.ВидОплаты=Перечисления.ВидОплаты.Наличные или СтрД.КредитнаяКарта тогда
	//				Если СтрД.Оплата.Бронирует.Турагенство тогда
	//					ВырОснКасс=ВырОснКасс-?(СтрД.КредитнаяКарта,СуммаККДо,СТрД.сумма)*(СтрД.Оплата.Бронирует.ПроцентАгент/100)*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);								
	//					Агент=Агент+?(СтрД.КредитнаяКарта,СуммаККДо,СТрД.сумма)*(СтрД.Оплата.Бронирует.ПроцентАгент/100)*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);	
	//				конецесли;
	//				
	//				Продолжить;
	//			конецесли;
	//			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Проживание" тогда
	//			ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//			//иначеесли Стрд.ВидОперации.Код="000000001" тогда
	//			//	ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		конецесли;
	//	Исключение
	//	КонецПопытки;
	//КонецЦикла; 
	//Обл.Параметры.ВырОснКасс=ВырОснКасс;
	//
	//ВырТранс=0;
	//Попытка
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				Если СтрД.ВидОперации.Код="000000022" тогда
	//					ВырТранс=ВырТранс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//				конецесли;
	//				
	//			конецесли;			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Транспортные услуги" тогда
	//			ВырТранс=ВырТранс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//Обл.Параметры.ВырТранс=ВырТранс;
	//
	//ВырПрод=0;
	//попытка
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				//СтрД.ВидОперации.Код="000000003" или 
	//				Если СтрД.ВидОперации.Код="000000013" тогда
	//					ВырПрод=ВырПрод+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//				конецесли;
	//				
	//			конецесли;			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Бар" или СтрД.Оплата.Родитель.Наименование="Минибар" тогда
	//			ВырПрод=ВырПрод+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//Обл.Параметры.ВырПрод=ВырПрод;
	//
	//
	//ВырТел=0;
	//Попытка
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				Если СтрД.ВидОперации.Код="000000012" тогда
	//					ВырТел=ВырТел+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//				конецесли;
	//				
	//			конецесли;			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Телефон" тогда
	//			ВырТел=ВырТел+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//Обл.Параметры.ВырТел=ВырТел;
	//
	//Расходы=0;
	//Попытка
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				Если СтрД.ВидОперации.Код<>"000000012" И СтрД.ВидОперации.Код<>"000000013" /// И СтрД.ВидОперации.Код<>"000000003"
	//					И СтрД.ВидОперации.Код<>"000000015" И СтрД.ВидОперации.Код<>"000000022" И СтрД.ВидОперации.Код<>"000000011" тогда
	//					
	//					Если СтрД.ВидДвижения=ВидДвиженияНакопления.Приход тогда
	//						Продолжить;
	//					конецесли;
	//					
	//					Расходы=Расходы+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,0,-1);						
	//				иначеесли СтрД.ВидОперации.Код="000000015" тогда
	//					Если СтрД.ВидДвижения=ВидДвиженияНакопления.Приход тогда
	//						Продолжить;
	//					конецесли;
	//					
	//					Агент=Агент+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,0,-1);						
	//					
	//				конецесли;					
	//			конецесли;			
	//		иначеесли СтрД.Оплата=Справочники.ДопУслуги.НайтиПоКоду("000000160") тогда
	//			Агент=Агент+СТрД.сумма;
	//			
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//Обл.Параметры.Расходы=Расходы;
	//Обл.Параметры.Агент=Агент;
	//
	//ВырОснНал=0;
	//ОстНал=0;
	//Попытка
	//	Для каждого СтрД Из ТЗДенег Цикл
	//		Если СтрД.ВидОплаты=Перечисления.ВидОплаты.Безнал или СтрД.КредитнаяКарта тогда
	//			Продолжить;
	//		конецесли;
	//		если СтрД.ВидОперации.Код="000000011" тогда 
	//			Продолжить;
	//		конецесли;
	//		
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если (не СтрД.Оплата.Пустая()) ИЛИ (Стрд.ВидОперации.Код="000000001" ) тогда					
	//				ВырОснНал=ВырОснНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);											
	//			иначе
	//				ОстНал=ОстНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//			конецесли;			
	//		иначеЕсли СтрД.Оплата.Родитель.Наименование="Проживание" тогда
	//			ВырОснНал=ВырОснНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
	//		иначе
	//			ОстНал=ОстНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//Обл.Параметры.ВырОснНал=ВырОснНал-Агент;
	//Обл.Параметры.ОстНал=ОстНал+Агент;
	//
	//
	//Изъятия=0;
	//Попытка
	//	Для каждого СтрД Из ТЗДенег Цикл		    	
	//		Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
	//			Если СтрД.Оплата.Пустая() тогда	
	//				Если СтрД.ВидОперации.Код="000000011" тогда
	//					Изъятия=Изъятия+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
	//				конецесли;					
	//			конецесли;			
	//		конецесли;
	//	КонецЦикла; 
	//Исключение
	//КонецПопытки;
	//Обл.Параметры.Изъятия=Изъятия;
	//
	//Обл.Параметры.Касса=ОстатокПоКассеКД.СуммаОстаток;
	//ЗапросДолжников=Новый Запрос("ВЫБРАТЬ
	//|	ДолгиОстатки.Контрагент КАК Клиент,
	//|	СУММА(ДолгиОстатки.СуммаОстаток) КАК СуммаОстаток,
	//|	ДолгиОстатки.ДокументОплаты КАК Регистратор,
	//|	ДолгиОстатки.ДокументОплаты.НомерВРезерв КАК Номер
	//|ИЗ
	//|	РегистрНакопления.Долги.Остатки(, ДокументОплаты.Статус = &Статус) КАК ДолгиОстатки
	//|ГДЕ
	//|	ДолгиОстатки.СуммаОстаток > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДолгиОстатки.Контрагент,
	//|	ДолгиОстатки.ДокументОплаты
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДолгиОстатки.ДокументОплаты.НомерВРезерв.Наименование");
	//ЗапросДолжников.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Выехал);
	//СписокДолжников=ЗапросДолжников.Выполнить().Выгрузить();
	//
	//сч=1;  
	//Долг=0;
	//Для каждого КлДР Из СписокДолжников Цикл
	//	Долг=Долг+КлДР.СуммаОстаток;
	//КонецЦикла; 
	//Обл.Параметры.Долг=Долг;
	//
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//
	//
	//Если Авто тогда
	//	ЭлементыФормы.ПолеОтчета.Записать("C:\BASE\REP\F_day.xls",ТипФайлаТабличногоДокумента.XLS97);
	//конецесли;
	//
КонецФункции


&НаКлиенте
Функция ОтчетДень(ДТО)
ОтчетДеньНаСервере(ДТО);	
КонецФункции
 
&НаСервере
Функция ОтчетДеньНаСервере(Знач ДТ)
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	ДеньОтчета=ДТ;
	ЗапросОстатков=Новый Запрос("ВЫБРАТЬ
	|	СУММА(ДеньгиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ДеньгиОстатки.ВидОплаты
	|ИЗ
	|	РегистрНакопления.Деньги.Остатки(&ДТ, ) КАК ДеньгиОстатки
	|ГДЕ
	|	ДеньгиОстатки.КредитнаяКарта = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДеньгиОстатки.ВидОплаты");
	
	ЗапросОстатков.УстановитьПараметр("ДТ",НачалоДня(ДТ));								
	ТЗОст=ЗапросОстатков.Выполнить().Выгрузить();
	
	ЗапросОстатков=Новый Запрос("ВЫБРАТЬ
	|	СУММА(ДеньгиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ДеньгиОстатки.ВидОплаты
	|ИЗ
	|	РегистрНакопления.Деньги.Остатки(&ДТ, ) КАК ДеньгиОстатки
	|ГДЕ
	|	ДеньгиОстатки.КредитнаяКарта = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДеньгиОстатки.ВидОплаты");
	
	ЗапросОстатков.УстановитьПараметр("ДТ",КонецДня(ДТ));								
	ТЗОстКД=ЗапросОстатков.Выполнить().Выгрузить();
	
	
	//Макет=ПолучитьМакет("Макет1");
	Макет=Отчеты.ЕжемесячныеФинансы.ПолучитьМакет("Макет1");
	
	ЗапросПоДням=Новый Запрос("ВЫБРАТЬ
	|	Деньги.Регистратор,
	|	Деньги.ВидОплаты,
	|	СУММА(ВЫБОР
	|			КОГДА Деньги.ВидДвижения = &ВидД
	|				ТОГДА Деньги.Сумма
	|			ИНАЧЕ Деньги.Сумма * -1
	|		КОНЕЦ) КАК Сумма,
	|	Деньги.ВидОперации,
	|	Деньги.ВидДвижения,
	|	Деньги.ДокументОплаты,
	|	Деньги.Контрагент,
	|	Деньги.КредитнаяКарта,
	|	Деньги.Оплата
	|ИЗ
	|	РегистрНакопления.Деньги КАК Деньги
	|ГДЕ
	|	Деньги.Период МЕЖДУ &ДН И &ДК
	|
	|СГРУППИРОВАТЬ ПО
	|	Деньги.Регистратор,
	|	Деньги.ВидОплаты,
	|	Деньги.ВидОперации,
	|	Деньги.ВидДвижения,
	|	Деньги.ДокументОплаты,
	|	Деньги.Контрагент,
	|	Деньги.КредитнаяКарта,
	|	Деньги.Оплата");	
	ЗапросПоДням.УстановитьПараметр("ДН",НачалоДня(ДТ));
	ЗапросПоДням.УстановитьПараметр("ДК",КонецДня(ДТ));
	ЗапросПоДням.УстановитьПараметр("ВидД",ВидДвиженияНакопления.Приход);
	
	ТЗПодням=ЗапросПоДням.Выполнить().Выгрузить();
	ТЗПодням.Колонки.Добавить("ОплатаСтр");
	
// + ПСН
	//Для Каждого ТЗД из ТЗПодням цикл
	//	ТЗД.ОплатаСтр=?(ТипЗнч(ТЗД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование"),"Проживание",ТЗД.Оплата.Родитель.Наименование);	  
	//	ТЗД.ОплатаСтр=?(ТЗД.Оплата.Пустая(),ТЗД.ВидОперации.Наименование,ТЗД.ОплатаСтр);		  
	//конеццикла;

	Для Каждого ТЗД из ТЗПодням цикл
		Если ЗначениеЗаполнено(ТЗД.Оплата) Тогда
			Если ТипЗнч(ТЗД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
				ТЗД.ОплатаСтр = "Проживание";
			Иначе 	
				ТЗД.ОплатаСтр = ТЗД.Оплата.Родитель.Наименование;
			КонецЕсли;	
			ТЗД.ОплатаСтр=?(ТЗД.Оплата.Пустая(),ТЗД.ВидОперации.Наименование,ТЗД.ОплатаСтр);		  
		Иначе
			ТЗД.ОплатаСтр = "";
			ТЗД.ОплатаСтр = ТЗД.ВидОперации.Наименование;		  
		КонецЕсли;
		
		//ТЗД.ОплатаСтр=?(ТипЗнч(ТЗД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование"),"Проживание",ТЗД.Оплата.Родитель.Наименование);	  
		//ТЗД.ОплатаСтр=?(ТЗД.Оплата.Пустая(),ТЗД.ВидОперации.Наименование,ТЗД.ОплатаСтр);		  
	конеццикла;
// - ПСН
	
	Обл=Макет.ПолучитьОбласть("ШапкаОбщ");
	
	ОстатокПоКассе=ТЗОст.Найти(Перечисления.ВидОплаты.Наличные,"ВидОплаты");
	ОстатокПоКассеКД=ТЗОстКД.Найти(Перечисления.ВидОплаты.Наличные,"ВидОплаты");
	ОстатокПоБанку=ТЗОст.Найти(Перечисления.ВидОплаты.Безнал,"ВидОплаты");
	Обл.Параметры.ТекОст="Текущие остатки на " + Формат(ДТ, "ДЛФ=DD");
	Обл.Параметры.Касса=?(ОстатокПоКассе=Неопределено,"--",ОстатокПоКассе.СуммаОстаток);
	Обл.Параметры.КассаКД=?(ОстатокПоКассеКД=Неопределено,"--",ОстатокПоКассеКД.СуммаОстаток);
	Обл.Параметры.КассаДельта=?(ОстатокПоКассеКД=Неопределено,"--",ОстатокПоКассеКД.СуммаОстаток-ОстатокПоКассе.СуммаОстаток);
	Обл.Параметры.Банк=?(ОстатокПоБанку=Неопределено,"--",ОстатокПоБанку.СуммаОстаток);
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	// по дням
	Для каждого Вывод Из ТЗПодням Цикл
		Если ТипЗнч(Вывод.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
			Если Вывод.ВидОплаты=Перечисления.ВидОплаты.Наличные или Вывод.КредитнаяКарта тогда
				Если Вывод.Оплата.Бронирует.Турагентство тогда		
					НовВывод=ТЗПодням.Добавить();
					НовВывод.Контрагент=Вывод.Контрагент;
					НовВывод.ВидОплаты=Вывод.ВидОплаты;
					НовВывод.ВидДвижения=ВидДвиженияНакопления.Приход;
					НовВывод.КредитнаяКарта=Вывод.КредитнаяКарта;
					НовВывод.ОплатаСтр="агентское вознаграждение";
					НовВывод.Сумма=Вывод.сумма*(Вывод.Оплата.Бронирует.ПроцентАгент_OLD/100);	
					Если Вывод.КредитнаяКарта тогда
						Вывод.Сумма=Вывод.Сумма-Вывод.Сумма*0.019;
					конецесли;
					Вывод.сумма=Вывод.сумма-НовВывод.Сумма;					  
				ИначеЕсли Вывод.КредитнаяКарта тогда
					Вывод.Сумма=Вывод.Сумма-Вывод.Сумма*0.019;
					
				конецесли;					
				
				
			конецесли;
		иначеесли Вывод.Оплата=Справочники.ДопУслуги.НайтиПоКоду("000000160") тогда
			Вывод.ОплатаСтр="агентское вознаграждение";
			
		конецесли;
	КонецЦикла; 
	////Для каждого Вывод Из ТЗПодням Цикл
	//
	////			Если Вывод.КредитнаяКарта и Вывод.ОплатаСтр<>"агентское вознаграждение" тогда
	//// 			  Вывод.Сумма=Вывод.Сумма-Вывод.Сумма*0.019;
	//// 		  конецесли;
	////КонецЦикла;
	
	ТЗДней=ТЗПодням.Скопировать();
	ТЗДней.Свернуть("Контрагент","Сумма");
	ТЗКатегорий=ТЗПодням.Скопировать();
	ТЗКатегорий.Свернуть("ВидОплаты,ВидДвижения,ДокументОплаты","Сумма");
	ТЗДляВывода=ТЗПодням.Скопировать();
	ТЗДляВывода.Свернуть("ВидОплаты,ВидДвижения,КредитнаяКарта,ОплатаСтр","Сумма");
	
	ТЗВидПоДням=ТЗПодням.Скопировать();
	ТЗВидПоДням.Свернуть("ВидОплаты,ВидОперации,Контрагент","Сумма");
	ТаблДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
	ТаблДок.Присоединить(Обл);
	Обл=Макет.ПолучитьОбласть("Шапка|ДТ");
	Для каждого ДТ Из ТЗДней Цикл
		Обл.Параметры.Период=ДТ.Контрагент;			
		ТаблДок.Присоединить(Обл);
	КонецЦикла;
	Обл=Макет.ПолучитьОбласть("Шапка|Итог");
	
	
	ТаблДок.Присоединить(Обл);
	ТЗДляВывода.Колонки.Добавить("ВидДеятельности");
	ТЗДляВывода.Колонки.Добавить("ВидОплатыСтр");
	
	Для каждого Вывод Из ТЗДляВывода Цикл
		Вывод.ВидДеятельности=ОпределитьВидДеятельности(Справочники.ВидыОпераций.ПустаяСсылка());
		Вывод.ВидОплатыСтр=?(Вывод.ВидОплаты=Перечисления.ВидОплаты.Безнал,"Безналичный расчет","Наличные");
		Вывод.ВидОплатыСтр=?(Вывод.КредитнаяКарта,"Кредитная карта",Вывод.ВидОплатыСтр);		  
		////Если Вывод.ОплатаСтр<>"агентское вознаграждение" тогда
		////Вывод.Сумма=?(Вывод.КредитнаяКарта,Вывод.Сумма-Вывод.Сумма*0.019,Вывод.Сумма);		  
		////конецесли;
	КонецЦикла; 
	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	ПолеОтчета.Вывести(ТаблДок);
	
	ТЗДляВывода.Сортировать("ВидДвижения,ВидОплатыСтр,ОплатаСтр");
	Для каждого Вывод Из ТЗДляВывода Цикл
		ТаблДок=Новый ТабличныйДокумент;
		Обл=Макет.ПолучитьОбласть("КатМал|ШапкаВерх");
		Обл.Параметры.КатегорияБол=Вывод.ВидОплатыСтр;
		////Обл.Параметры.Категория=Вывод.ВидОперации;
		Обл.Параметры.ВидОперации=Вывод.ВидДвижения;
		Обл.Параметры.Статья=Вывод.ОплатаСтр;
		ТаблДок.Присоединить(Обл);
		Обл=Макет.ПолучитьОбласть("КатМал|ДТ");
		Для каждого ДТ Из ТЗДней Цикл
			Отбор=Новый Структура("Контрагент,ВидОплаты,ВидДвижения,КредитнаяКарта,ОплатаСтр",ДТ.Контрагент,Вывод.ВидОплаты,Вывод.ВидДвижения,Вывод.КредитнаяКарта,Вывод.ОплатаСтр);
			СуммаДляВывода=0;
			СтрокиДТ=ТЗПодням.НайтиСтроки(Отбор);
			Для каждого СтрДТ Из СтрокиДТ Цикл
				////Если Вывод.КредитнаяКарта и Вывод.ОплатаСтр<>"агентское вознаграждение" тогда
				////   	СтрДТ.Сумма=СтрДТ.Сумма-СтрДТ.Сумма*0.019;
				////   конецесли;
				СуммаДляВывода=СуммаДляВывода+СтрДТ.Сумма;
				
			КонецЦикла; 
			Обл.Параметры.Сумма=Формат(СуммаДляВывода, "ЧГ=");  
			ТаблДок.Присоединить(Обл);			  
		КонецЦикла;	
		Обл=Макет.ПолучитьОбласть("КатМал|Итог");
		
		Обл.Параметры.Сумма=Формат(Вывод.Сумма, "ЧГ=");  
		ТаблДок.Присоединить(Обл);
		
		//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
		ПолеОтчета.Вывести(ТаблДок);
		
	КонецЦикла; 
	ТаблДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("ИтогНиз|ШапкаВерх");
	ТаблДок.Присоединить(Обл);
	СуммаДляВывода=0;
	Обл=Макет.ПолучитьОбласть("КатМал|Итог");
	
	Для каждого ДТ Из ТЗДней Цикл
		Обл.Параметры.Сумма=Формат(ДТ.Сумма, "ЧГ=");
		СуммаДляВывода=СуммаДляВывода+ДТ.Сумма;
		ТаблДок.Присоединить(Обл);			  
	КонецЦикла;	
	Обл.Параметры.Сумма=Формат(СуммаДляВывода, "ЧГ=");
	ТаблДок.Присоединить(Обл);	
	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	ПолеОтчета.Вывести(ТаблДок);
	// ГОСТ
	
	Обл=Макет.ПолучитьОбласть("ГОСТ");
	// Долги
	
	ЗапросДенег=Новый Запрос("ВЫБРАТЬ
	|	СУММА(Деньги.Сумма) КАК Сумма,
	|	Деньги.Оплата,
	|	Деньги.ВидДвижения,
	|	Деньги.ВидОплаты,
	|	Деньги.ВидОперации,
	|	Деньги.Период,
	|	Деньги.КредитнаяКарта
	|ИЗ
	|	РегистрНакопления.Деньги КАК Деньги
	|ГДЕ
	|	Деньги.Период МЕЖДУ &ПериодН И &ПериодК
	|
	|СГРУППИРОВАТЬ ПО
	|	Деньги.Оплата,
	|	Деньги.ВидДвижения,
	|	Деньги.ВидОплаты,
	|	Деньги.ВидОперации,
	|	Деньги.Период,
	|	Деньги.КредитнаяКарта");
	ЗапросДенег.УстановитьПараметр("ПериодН",НачалоМесяца(ДеньОтчета));
	ЗапросДенег.УстановитьПараметр("ПериодК",КонецДня(ДеньОтчета));
	ТЗДенег=ЗапросДенег.Выполнить().Выгрузить();
	
	
	ЗапросДолгов=Новый Запрос("ВЫБРАТЬ
	|	ДолгиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Долги.Остатки(&Пер, ) КАК ДолгиОстатки");
	ЗапросДолгов.УстановитьПараметр("Пер",НачалоДня(ДеньОтчета));								  
	ТЗД=ЗапросДолгов.Выполнить().Выгрузить();
	
	////Обл.Параметры.Неопл=?(ТЗД.Количество()=0,0,(-1)*ТЗД[0].СуммаОстаток);
	ВырОсн=0;
	Обл.Параметры.ВырОсн=ВырОсн;
	ВырОснКасс=0;
	Агент=0;
	
	Для каждого СтрД Из ТЗДенег Цикл
		Если Стрд.КредитнаяКарта  тогда
			СуммаККДо=Стрд.Сумма;
			Стрд.Сумма=Стрд.Сумма-Стрд.Сумма*0.019;	
		конецесли;
		Попытка
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если не СтрД.Оплата.Пустая() или Стрд.ВидОперации.Код="000000001" тогда					
					ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
				конецесли;			
				Если СтрД.ВидОплаты=Перечисления.ВидОплаты.Наличные или СтрД.КредитнаяКарта тогда
					Если СтрД.Оплата.Бронирует.Турагентство тогда
						ВырОснКасс=ВырОснКасс-?(СтрД.КредитнаяКарта,СуммаККДо,СТрД.сумма)*(СтрД.Оплата.Бронирует.ПроцентАгент_OLD/100)*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);								
						Агент=Агент+?(СтрД.КредитнаяКарта,СуммаККДо,СТрД.сумма)*(СтрД.Оплата.Бронирует.ПроцентАгент_OLD/100)*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);	
					конецесли;
					
					Продолжить;
				конецесли;
				
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Проживание" тогда
				ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
				////иначеесли Стрд.ВидОперации.Код="000000001" тогда
				////	ВырОснКасс=ВырОснКасс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			конецесли;
		Исключение
		КонецПопытки;
	КонецЦикла; 
	Обл.Параметры.ВырОснКасс=ВырОснКасс;
	
	ВырТранс=0;
	Попытка
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					Если СтрД.ВидОперации.Код="000000022" тогда
						ВырТранс=ВырТранс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
					конецесли;
					
				конецесли;			
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Транспортные услуги" тогда
				ВырТранс=ВырТранс+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Обл.Параметры.ВырТранс=ВырТранс;
	
	ВырПрод=0;
	попытка
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					////СтрД.ВидОперации.Код="000000003" или 
					Если СтрД.ВидОперации.Код="000000013" тогда
						ВырПрод=ВырПрод+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
					конецесли;
					
				конецесли;			
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Бар" или СтрД.Оплата.Родитель.Наименование="Минибар" тогда
				ВырПрод=ВырПрод+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Обл.Параметры.ВырПрод=ВырПрод;
	
	
	ВырТел=0;
	Попытка
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					Если СтрД.ВидОперации.Код="000000012" тогда
						ВырТел=ВырТел+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
					конецесли;
					
				конецесли;			
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Телефон" тогда
				ВырТел=ВырТел+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Обл.Параметры.ВырТел=ВырТел;
	
	Расходы=0;
	Попытка
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					Если СтрД.ВидОперации.Код<>"000000012" И СтрД.ВидОперации.Код<>"000000013" /// И СтрД.ВидОперации.Код<>"000000003"
						И СтрД.ВидОперации.Код<>"000000015" И СтрД.ВидОперации.Код<>"000000022" И СтрД.ВидОперации.Код<>"000000011" тогда
						
						Если СтрД.ВидДвижения=ВидДвиженияНакопления.Приход тогда
							Продолжить;
						конецесли;
						
						Расходы=Расходы+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,0,-1);						
					иначеесли СтрД.ВидОперации.Код="000000015" тогда
						Если СтрД.ВидДвижения=ВидДвиженияНакопления.Приход тогда
							Продолжить;
						конецесли;
						
						Агент=Агент+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,0,-1);						
						
					конецесли;					
				конецесли;			
			иначеесли СтрД.Оплата=Справочники.ДопУслуги.НайтиПоКоду("000000160") тогда
				Агент=Агент+СТрД.сумма;
				
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Обл.Параметры.Расходы=Расходы;
	Обл.Параметры.Агент=Агент;
	
	ВырОснНал=0;
	ОстНал=0;
	Попытка
		Для каждого СтрД Из ТЗДенег Цикл
			Если СтрД.ВидОплаты=Перечисления.ВидОплаты.Безнал или СтрД.КредитнаяКарта тогда
				Продолжить;
			конецесли;
			если СтрД.ВидОперации.Код="000000011" тогда 
				Продолжить;
			конецесли;
			
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если (не СтрД.Оплата.Пустая()) ИЛИ (Стрд.ВидОперации.Код="000000001" ) тогда					
					ВырОснНал=ВырОснНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);											
				иначе
					ОстНал=ОстНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
				конецесли;			
			иначеЕсли СтрД.Оплата.Родитель.Наименование="Проживание" тогда
				ВырОснНал=ВырОснНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);
			иначе
				ОстНал=ОстНал+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Обл.Параметры.ВырОснНал=ВырОснНал-Агент;
	Обл.Параметры.ОстНал=ОстНал+Агент;
	
	
	Изъятия=0;
	Попытка
		Для каждого СтрД Из ТЗДенег Цикл		    	
			Если ТипЗнч(СтрД.Оплата)=Тип("ДокументСсылка.ЗаявкаНаБронирование") тогда
				Если СтрД.Оплата.Пустая() тогда	
					Если СтрД.ВидОперации.Код="000000011" тогда
						Изъятия=Изъятия+СТрД.сумма*?(СтрД.ВидДвижения=ВидДвиженияНакопления.Приход,1,-1);						
					конецесли;					
				конецесли;			
			конецесли;
		КонецЦикла; 
	Исключение
	КонецПопытки;
	Обл.Параметры.Изъятия=Изъятия;
	
	Обл.Параметры.Касса=ОстатокПоКассеКД.СуммаОстаток;
	ЗапросДолжников=Новый Запрос("ВЫБРАТЬ
	|	ДолгиОстатки.Контрагент КАК Клиент,
	|	СУММА(ДолгиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ДолгиОстатки.ДокументОплаты КАК Регистратор,
	|	ДолгиОстатки.ДокументОплаты.НомерВРезерв КАК Номер
	|ИЗ
	|	РегистрНакопления.Долги.Остатки(, ДокументОплаты.Статус = &Статус) КАК ДолгиОстатки
	|ГДЕ
	|	ДолгиОстатки.СуммаОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолгиОстатки.Контрагент,
	|	ДолгиОстатки.ДокументОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДолгиОстатки.ДокументОплаты.НомерВРезерв.Наименование");
	ЗапросДолжников.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Выехал);
	СписокДолжников=ЗапросДолжников.Выполнить().Выгрузить();
	
	сч=1;  
	Долг=0;
	Для каждого КлДР Из СписокДолжников Цикл
		Долг=Долг+КлДР.СуммаОстаток;
	КонецЦикла; 
	Обл.Параметры.Долг=Долг;
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);  
	
	
	
	Если Авто тогда
		//ЭлементыФормы.ПолеОтчета.Записать("C:\BASE\REP\F_day.xls",ТипФайлаТабличногоДокумента.XLS97);
		ИмяФайла = Константы.Папка_C_BASE.Получить();
		ИмяФайла = ИмяФайла + "REP\F_day" + ".xls";
		
		ПолеОтчета.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS97);
	
	конецесли;
	
КонецФункции

//
&НаКлиенте
Процедура ОсновныеДействияФормыЗаМесяц__(Кнопка)
	//ДатаОтчета=ТекущаяДата();
	//ВвестиДату(ДатаОтчета);
	//ОтчетМесяц(ДатаОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ЗаМесяц(Команда)
	ДатаОтчета=ТекущаяДата();
	
	//ВвестиДату(ДатаОтчета);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВводДатыЗаМесяц", ЭтаФорма);
	ПоказатьВводДаты(Оповещение, ДатаОтчета,,ЧастиДаты.Дата);
	
	//ОтчетМесяцНаСервере(ДатаОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВводДатыЗаМесяц(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли; 	

ОтчетМесяцНаСервере(Результат);
КонецПроцедуры	
//

//
&НаКлиенте
Процедура ОсновныеДействияФормыОтчетАудитЗаДату__(Кнопка)
	//ДТ=ТекущаяДата();
	//ВвестиДату(ДТ);
	//ОтчетАудит(ДТ);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетАудитЗаДату(Команда)
	ДТ=ТекущаяДата();
	
	//ВвестиДату(ДТ);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВводДатыОтчетАудитЗаДату", ЭтаФорма);
	ПоказатьВводДаты(Оповещение, ДТ,,ЧастиДаты.Дата);
	
	//ОтчетАудит(ДТ);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВводДатыОтчетАудитЗаДату(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли; 	

ОтчетАудит(Результат);
КонецПроцедуры	
//

//
&НаКлиенте
Процедура КнопкаСформироватьНажатие__(Кнопка)
	////ОтчетМесяц();
	//ДТ=ТекущаяДата();
	//ВвестиЗначение(ДТ);
	//ОтчетДень(ДТ);
	
КонецПроцедуры

&НаКлиенте
Процедура Ежедневный(Команда)
	////ОтчетМесяц();
	
	ДТ=ТекущаяДата();
	
	//ВвестиЗначение(ДТ);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВводДатыЕжедневный", ЭтаФорма);
	ПоказатьВводДаты(Оповещение, ДТ,,ЧастиДаты.Дата);
	
	//ОтчетДень(ДТ);
КонецПроцедуры

 
&НаКлиенте
Процедура ЗавершениеВводДатыЕжедневный(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли; 	

ОтчетДень(Результат);
КонецПроцедуры	
//


// +++++++++++++++++++++++++++++++++++++++++++++
&НаКлиенте
Процедура ОтправитьМылом_КУдалению(Тема,Файло,Получатель,Полные=Ложь) Экспорт
	////Если СокрЛП(Константы.СМТПСервер.Получить())="" или Константы.АдресЭлПочтыОтправителя.Получить()="" или Константы.ПарольОтправителя.Получить()="" тогда
	////	Сообщить("Не настроены параметры рассылки.",СтатусСообщения.ОченьВажное);
	////	Возврат;
	////КонецЕсли;
	ЛогФайл = "Рассылка.log";
	
// + ПСН
	//ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	//ПочтовыйПрофиль.АдресСервераSMTP   = "127.0.0.1"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
	////Если Константы.ПользовательКакЕмеил.Получить() тогда
	//смтпПользователь="renomehotel@gmail.com";//Константы.АдресЭлПочтыОтправителя.Получить();
	////иначе
	////	Акк = Константы.АдресЭлПочтыОтправителя.Получить();
	////	СтрПоз = Найти(Акк, "@");
	////	Если СтрПоз > 0 Тогда
	////		смтпПользователь = Лев(Акк, СтрПоз-1);
	////	Иначе
	////		ВЛог("Не заполнена константа ""Эл. адрес отправителя"". Рассылка невозможна.",ЛогФайл,,Истина);
	////		Возврат;
	////	КонецЕсли;
	////КонецЕсли;
	//ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	//ПочтовыйПрофиль.ПарольSMTP         = "zxcvnm*258"; 
	//ПочтовыйПрофиль.Пароль = "zxcvnm*258";
	//ПочтовыйПрофиль.ВремяОжидания      = 15;                 
	//ПочтовыйПрофиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;   
// - ПСН	

	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	ПочтовыйПрофиль.АдресСервераSMTP   = "srvex1.corp.invina.ru"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
	смтпПользователь="postnikov_sn";//Константы.АдресЭлПочтыОтправителя.Получить();
	
	ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	ПочтовыйПрофиль.ПарольSMTP         = "<HFNyjcjhju*14"; 

	Почта = Новый ИнтернетПочта(); 
	
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		//ОбщийМодульСервер.ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки(),ЛогФайл, , Истина); 
		Сообщить("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " ,СтатусСообщения.ОченьВажное); 
		Возврат; 
	КонецПопытки; 
	ТелоСообщения = "
	|
	|-------------------------------------------------------------------------
	|Данное сообщение сгенерировано автоматически.
	|Отвечать на это письмо по адресу отправителя не имеет смысла.
	|-------------------------------------------------------------------------";
	
	
	
	ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение; 
	
	ПочтовоеСообщение.Тема = Тема + " " + ТекущаяДата();
	ПочтовоеСообщение.Тексты.Добавить(ТелоСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);
	Если НЕ ЗначениеЗаполнено(Получатель) тогда
		//Рассылка=Справочники.СписокРассылки.Выбрать();
		//Пока Рассылка.Следующий() цикл
		//	Если НЕ Рассылка.ПометкаУдаления тогда
		//		ПочтовоеСообщение.Получатели.Добавить(СокрЛП(Рассылка.Наименование));
		//	КонецЕсли;
		//КонецЦикла;
	иначе
		ПочтовоеСообщение.Получатели.Добавить(Получатель);
		Если Полные тогда
			
		конецесли;
		
		////	ПочтовоеСообщение.Получатели.Добавить("guz@agent5.ru");
		//ПочтовоеСообщение.Получатели.Добавить("isaeva_js@invina.ru");
		//ПочтовоеСообщение.Получатели.Добавить("Sabolotskih_EV@invina.ru");
		//ПочтовоеСообщение.Получатели.Добавить("kantorov_ee@invina.ru");
		//ПочтовоеСообщение.Получатели.Добавить("fomina_as@invina.ru");
		//ПочтовоеСообщение.Получатели.Добавить("serkova_nv@invina.ru");       
		//ПочтовоеСообщение.Получатели.Добавить("Derendyaeva_AA@invina.ru");
		
		ПочтовоеСообщение.Получатели.Добавить("postnikov_sn@invina.ru");
		
	КонецЕсли;
	
	ПочтовоеСообщение.Отправитель = "renomehotel@gmail.com";
	ПочтовоеСообщение.ИмяОтправителя = "Уведомление RENOME - АУДИТ";
	//Если значениезаполнено(Файло) тогда
	//	Для каждого СТФ Из Файло Цикл
	
	ПочтовоеСообщение.Вложения.Добавить(Файло);
	
	//	КонецЦикла; 
	//	
	//КонецЕсли;
	Если ПочтовоеСообщение.Получатели.Количество()>0 тогда	
		Попытка
			Почта.Послать(ПочтовоеСообщение);
			//ОбщийМодульСервер.ВЛог(ТЕма +" отправлен",ЛогФайл);
		Исключение
			//ОбщийМодульСервер.ВЛог(ОписаниеОшибки(),ЛогФайл,,Истина);
			Сообщить(ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
		КонецПопытки;
	иначе
//		Сообщить("Не заполнен справочник ""Список рассылки""!",СтатусСообщения.ОченьВажное);
		Сообщить("Не заполнен Получатель в письме""!",СтатусСообщения.ОченьВажное);
	КонецЕсли;
КонецПроцедуры	









