#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса_Исходный(ИменаПараметровСеанса)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияВызовСервера.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец ПодключаемоеОборудование

КонецПроцедуры

#КонецОбласти

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)

	// УниверсальныеМеханизмы
	Если ИменаПараметровСеанса = Неопределено Тогда

		// Раздел безусловной установки параметров сеанса.
		// + ПСН 
		УстановкаПараметровСеансаТекущийПользователь();
		// - ПСН 
		
	// Конец УниверсальныеМеханизмы
	
	// Переопределяемый блок
	//
	// Конец переопределяемого блока.
	
	// УниверсальныеМеханизмы
	Иначе
		// Установка параметров сеанса "по требованию".
		
		// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. для того, чтобы избежать их повторной инициализации, 
		// имена уже установленных параметров сеанса сохраняются в структуре УстановленныеПараметры.
		УстановленныеПараметры = Новый Массив();
		Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
		
	КонецЕсли;
	// Конец УниверсальныеМеханизмы
	
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	// Конец УниверсальныеМеханизмы
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Конец УниверсальныеМеханизмы

	// Переопределяемый блок

	// ПодключаемоеОборудование
	МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры);
	// Конец ПодключаемоеОборудование

	// Конец переопределяемого блока.

КонецПроцедуры


#КонецЕсли

Процедура УстановкаПараметровСеансаТекущийПользователь()

	//Сп=Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя());
	Сп=Справочники.Пользователи.НайтиПоКоду(ИмяПользователя());
	Если СП=Справочники.Пользователи.ПустаяСсылка() тогда
		Сп=Справочники.Пользователи.СоздатьЭлемент();
		Сп.код=ИмяПользователя();
		Сп.Наименование=ИмяПользователя();
		Сп.Записать();
	конецесли;
	
	ПараметрыСеанса.ТекущийПользователь = Сп.Ссылка;
	
	//Папка_C_BASE = КаталогИБ(); 
	Папка_C_BASE = ОбщееСервер.КаталогИБ(); 
	Константы.Папка_C_BASE.Установить(Папка_C_BASE);
	
	//ПАПКА_ВыгрузкаДляФМС = Папка_C_BASE;
	//ПАПКА_ВыгрузкаДляФМС = ПАПКА_ВыгрузкаДляФМС + "Обмен\";
	//Константы.ПАПКА_ВыгрузкаДляФМС.Установить(ПАПКА_ВыгрузкаДляФМС);
	
	Папка_C_BONUS = "C:\_Base1C\BONUS";
	Константы.Папка_C_BONUS.Установить(Папка_C_BONUS);
	
	//Папка_СКАНЫ = "c:\_Base1C\scan 1c";
	//Константы.Папка_СКАНЫ.Установить(Папка_СКАНЫ); 
	
	ПАПКА_Подтверждения = Константы.ПАПКА_Подтверждения.Получить();
	Если СокрЛП(ПАПКА_Подтверждения) = "" Тогда 
		ПАПКА_Подтверждения = Папка_C_BASE + "Подтверждения\";
		
		ПАПКА_Подтверждения_П = Лев(ПАПКА_Подтверждения, СтрДлина(ПАПКА_Подтверждения) - 1);
		КаталогНаДиске = Новый Файл(ПАПКА_Подтверждения_П);
	    Если НЕ КаталогНаДиске.Существует() Тогда
	        СоздатьКаталог(ПАПКА_Подтверждения_П);
		КонецЕсли; 
		
		Константы.ПАПКА_Подтверждения.Установить(ПАПКА_Подтверждения);
	КонецЕсли;
	
	ПараметрыСеанса.ТипСервера = ПолучитьТипСервера();
	
	ПараметрыСеанса.СоединениеГорничнныеАдресВХранилище = "";
	ПараметрыСеанса.СоединениеБОНУСАдресВХранилище = "";
	
	ПараметрыСеанса.СоединениеКартинкаАдресВХранилище = "";
	
	ПараметрыСеанса.ДанныеОбработатьДанныеОперации = "";
КонецПроцедуры

// Для SQL
Функция ПолучитьТипСервера()
Папка_C_BASE = Константы.Папка_C_BASE.Получить();
ИмяФайла =  Папка_C_BASE + "ТипСервера.txt";
ВыбФайл = Новый Файл(ИмяФайла);
Если ВыбФайл.Существует() Тогда
	
	Текст = Новый ЧтениеТекста(
        ИмяФайла, // имя
        КодировкаТекста.ANSI, // кодировка
        Символы.ПС, // разделитель строк (необ.)
        ,
        Истина // монопольный режим (необ.)
    );
 
     Строка = Текст.ПрочитатьСтроку();
     Если Строка = Неопределено Тогда
		Возврат "";
     Иначе
		Возврат СокрЛП(Строка);
    КонецЕсли;
Иначе
	Возврат Неопределено;	
КонецЕсли;	
КонецФункции 
