
Функция ЗапросГорничныеДанные() Экспорт
ЗапросТекст = "ВЫБРАТЬ
              |	УборкиНомеров.Горничная КАК Горничная,
              |	СУММА(ВЫБОР
              |			КОГДА УборкиНомеров.ТипУборкиПризнак = ""Т""
              |				ТОГДА 1
              |			ИНАЧЕ 0
              |		КОНЕЦ) КАК Т,
              |	СУММА(ВЫБОР
              |			КОГДА УборкиНомеров.ТипУборкиПризнак = ""Г""
              |				ТОГДА 1
              |			ИНАЧЕ 0
              |		КОНЕЦ) КАК Г,
              |	СУММА(ВЫБОР
              |			КОГДА УборкиНомеров.ТипУборкиПризнак = ""ТС""
              |				ТОГДА 1
              |			ИНАЧЕ 0
              |		КОНЕЦ) КАК ТС,
              |	СУММА(ВЫБОР
              |			КОГДА УборкиНомеров.РаздельныеКроватиОбработка
              |				ТОГДА 1
              |			ИНАЧЕ 0
              |		КОНЕЦ) КАК РК,
              |	СУММА(ВЫБОР
              |			КОГДА УборкиНомеров.Регистратор.МанипуляцияКровати
              |				ТОГДА 1
              |			ИНАЧЕ 0
              |		КОНЕЦ) КАК МК,
              |	СУММА(ВЫБОР
              |			КОГДА УборкиНомеров.Регистратор.МанипуляцияДопМесто_1
              |				ТОГДА 1
              |			ИНАЧЕ 0
              |		КОНЕЦ) КАК МДМ_1,
              |	СУММА(ВЫБОР
              |			КОГДА УборкиНомеров.Регистратор.МанипуляцияДопМесто_2
              |				ТОГДА 1
              |			ИНАЧЕ 0
              |		КОНЕЦ) КАК МДМ_2,
              |	СУММА(ВЫБОР
              |			КОГДА УборкиНомеров.Регистратор.МанипуляцияДопМесто_1
              |				ТОГДА 1
              |			ИНАЧЕ 0
              |		КОНЕЦ) + СУММА(ВЫБОР
              |			КОГДА УборкиНомеров.Регистратор.МанипуляцияДопМесто_2
              |				ТОГДА 1
              |			ИНАЧЕ 0
              |		КОНЕЦ) КАК МДМ,
              |	0 КАК Замечания
              |ИЗ
              |	РегистрСведений.УборкиНомеров КАК УборкиНомеров
              |ГДЕ
              |	УборкиНомеров.ВремяУброки МЕЖДУ &ДН И &ДК
              |
              |СГРУППИРОВАТЬ ПО
              |	УборкиНомеров.Горничная";
	
Возврат ЗапросТекст;	
КонецФункции

Функция ЗапросГорничныеПомещенияДанные() Экспорт
ЗапросТекст = "ВЫБРАТЬ
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.Горничная КАК Горничная,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.ГорничныеПомещение КАК Помещение,
              |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка) КАК Количество
              |ИЗ
              |	Документ.ГорничныеОбслуживаниеПомещения.ПомещенияУборки КАК ГорничныеОбслуживаниеПомещенияПомещенияУборки
              |ГДЕ
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.ПометкаУдаления = ЛОЖЬ
              |	И ГорничныеОбслуживаниеПомещенияПомещенияУборки.Обслужено = ИСТИНА
              |	И ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.ДатаОбслуживания МЕЖДУ &ДН И &ДК
              |
              |СГРУППИРОВАТЬ ПО
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.Горничная,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.ГорничныеПомещение";

Возврат ЗапросТекст;	
КонецФункции

Функция ЗапросГорничныеПомещенияДанные_2() Экспорт
//ЗапросТекст = "ВЫБРАТЬ
//                      |	ГорничныеОбслуживаниеПомещения.Горничная КАК Горничная,
//                      |	ГорничныеОбслуживаниеПомещения.ГорничныеПомещение КАК Помещение,
//                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГорничныеОбслуживаниеПомещения.Ссылка) КАК Количество
//                      |ИЗ
//                      |	Документ.ГорничныеОбслуживаниеПомещения КАК ГорничныеОбслуживаниеПомещения
//                      |ГДЕ
//                      |	ГорничныеОбслуживаниеПомещения.ДатаОбслуживания >= &ДН
//                      |	И ГорничныеОбслуживаниеПомещения.ДатаОбслуживания <= &ДК
//                      |	И ГорничныеОбслуживаниеПомещения.Обслужено = ИСТИНА
//                      |
//                      |СГРУППИРОВАТЬ ПО
//                      |	ГорничныеОбслуживаниеПомещения.Горничная,
//                      |	ГорничныеОбслуживаниеПомещения.ГорничныеПомещение";

ЗапросТекст = "ВЫБРАТЬ
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Горничная КАК Горничная,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.ГорничныеПомещение КАК Помещение,
              |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка) КАК Количество
              |ИЗ
              |	Документ.ГорничныеОбслуживаниеПомещения.ПомещенияУборки КАК ГорничныеОбслуживаниеПомещенияПомещенияУборки
              |ГДЕ
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.ПометкаУдаления = ЛОЖЬ
              |	И ГорничныеОбслуживаниеПомещенияПомещенияУборки.Обслужено = ИСТИНА
              |	И ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.ДатаОбслуживания МЕЖДУ &ДН И &ДК
              |
              |СГРУППИРОВАТЬ ПО
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Горничная,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.ГорничныеПомещение";

Возврат ЗапросТекст;	
КонецФункции

Функция ЗапросГорничныеПомещенияДанные_1() Экспорт
ЗапросТекст = "ВЫБРАТЬ
                      |	ГорничныеОбслуживаниеПомещения.Горничная КАК Горничная,
                      |	ГорничныеОбслуживаниеПомещения.ГорничныеПомещение КАК Помещение,
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГорничныеОбслуживаниеПомещения.Ссылка) КАК Количество
                      |ИЗ
                      |	Документ.ГорничныеОбслуживаниеПомещения КАК ГорничныеОбслуживаниеПомещения
                      |ГДЕ
                      |	ГорничныеОбслуживаниеПомещения.ДатаОбслуживания >= &ДН
                      |	И ГорничныеОбслуживаниеПомещения.ДатаОбслуживания <= &ДК
                      |	И ГорничныеОбслуживаниеПомещения.Обслужено = ИСТИНА
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ГорничныеОбслуживаниеПомещения.Горничная,
                      |	ГорничныеОбслуживаниеПомещения.ГорничныеПомещение";

Возврат ЗапросТекст;	
КонецФункции
