&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры


//
&НаКлиенте
Процедура ДатаЗаездаПриИзменении(Элемент)
	ДатаЗаездаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаЗаездаПриИзмененииНаСервере()
ВыборкаБроней=Новый Запрос("ВЫБРАТЬ
                           |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
                           |	ЗаявкаНаБронирование.Клиент КАК Клиент,
                           |	ЗаявкаНаБронирование.Клиент2 КАК Клиент2
                           |ИЗ
                           |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                           |ГДЕ
                           |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                           |	И НАЧАЛОПЕРИОДА(ЗаявкаНаБронирование.ВремяЗаездаТочное, ДЕНЬ) = &ВремяЗаездаТочное");

ВыборкаБроней.УстановитьПараметр("ВремяЗаездаТочное",НачалоДня(Объект.ДатаЗаезда));
ТЗБ=ВыборкаБроней.Выполнить().Выгрузить();   

Объект.ТаблицаДляВыгрузки.Очистить();   

Для каждого Стр Из ТЗБ Цикл
   Нов= Объект.ТаблицаДляВыгрузки.Добавить();
   Нов.Выгружать=Истина;
   Нов.Бронирование=Стр.ссылка;
   Нов.Клиент=Стр.Клиент;
   
   Если НЕ Стр.Клиент2.Пустая() тогда
	   Нов=Объект.ТаблицаДляВыгрузки.Добавить();
	   Нов.Выгружать=Истина;
	   Нов.Бронирование=Стр.ссылка;
	   Нов.Клиент=Стр.Клиент2;
	   
   конецесли;
   
КонецЦикла; 
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтметитьВсе(Команда)
Для каждого Стр Из Объект.ТаблицаДляВыгрузки Цикл
	Стр.Выгружать=Истина;
КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
Для каждого Стр Из Объект.ТаблицаДляВыгрузки Цикл
	Стр.Выгружать=Ложь;
КонецЦикла; 
КонецПроцедуры
//

//
&НаКлиенте
Процедура КнопкаВыполнитьНажатие__(Кнопка)
//Текст=Новый ТекстовыйДокумент;
//Для каждого Стр Из ТаблицаДляВыгрузки Цикл
//    Если Стр.Выгружать тогда
//	Текст.ДобавитьСтроку(СформироватьСтрокуДляФМС(Стр.Клиент,Стр.Бронирование));
//	конецесли;

//КонецЦикла; 

//Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
//Диалог.Фильтр="Текстовый документ(*.csv)|*.csv";
////Политов
//Диалог.Каталог = "D:\scan 1c\Обмен";
//ИмяФайла = Лев(Строка(ТекущаяДата()),10)+".csv";
//Диалог.ПолноеИмяФайла = ИмяФайла;
/////Политов

//Если Диалог.Выбрать() тогда
//	Текст.Записать(Диалог.ПолноеИмяФайла);
//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
Текст=Новый ТекстовыйДокумент;

Текст.ДобавитьСтроку("#v.2.0.0;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;");

Для каждого Стр Из Объект.ТаблицаДляВыгрузки Цикл
	Если Стр.Выгружать тогда
		СтрокаДляФМС = СформироватьСтрокуДляФМС(Стр.Клиент, Стр.Бронирование); 
		Текст.ДобавитьСтроку(СтрокаДляФМС);
	конецесли;
КонецЦикла; 

Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
Диалог.Фильтр="Текстовый документ(*.csv)|*.csv";
//Политов

//Диалог.Каталог = "D:\scan 1c\Обмен";
Каталог = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("ПАПКА_ВыгрузкаДляФМС");
//Диалог.Каталог = Каталог + "\Обмен";
//Диалог.Каталог = Каталог + "Обмен";
Диалог.Каталог = Каталог;

ИмяФайла = Лев(Строка(ТекущаяДата()),10)+".csv";
Диалог.ПолноеИмяФайла =  ИмяФайла;
///Политов

ДопПараметры = Новый Структура("Текст", Текст);
Оповещение = Новый ОписаниеОповещения("ЗавершитьДиалогВыбораФайла", ЭтаФорма, ДопПараметры);
Диалог.Показать(Оповещение);


//Если Диалог.Выбрать() тогда
//	Текст.Записать(Диалог.ПолноеИмяФайла);
//КонецЕсли;
//	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьДиалогВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

Текст = ДополнительныеПараметры.Текст;
ПолноеИмяФайла = Результат[0];

Текст.НачатьЗапись(, ПолноеИмяФайла);
КонецПроцедуры
//

//
&НаСервере
Функция СформироватьСтрокуДляФМС(Клиент,Бронь)
ТекстДляФМС=?(Клиент.ИностранныйГражданин,"1","0")+";"; // ин. гражд.

ТекстДляФМС=ТекстДляФМС+";"; // номер дела

ТекстДляФМС=ТекстДляФМС+Клиент.Фамилия+";"; //Фамилия
ТекстДляФМС=ТекстДляФМС+Клиент.ФамилияЛатиницей+";"; //Фамилия (лат) -
ТекстДляФМС=ТекстДляФМС+Клиент.Имя+";"; //Имя
ТекстДляФМС=ТекстДляФМС+Клиент.ИмяЛатиницей+";"; //Имя (лат) -
ТекстДляФМС=ТекстДляФМС+Клиент.Отчество+";"; //Отчество -
ТекстДляФМС=ТекстДляФМС+";"; //Отчество (лат) -

ТекстДляФМС=ТекстДляФМС+?(Клиент.Пол=Перечисления.Пол.Женский,"Ж","М")+";"; //Пол

ТекстДляФМС=ТекстДляФМС+Формат(Клиент.ДатаРождения, "ДФ=dd.MM.yyyy")+";"; //Дата рождения	ДД.ММ.ГГГГ

//// + Место рождения
//ТекстДляФМС=ТекстДляФМС + Формат(Клиент.СтранаРожденияФМС_NEW.CODE_ALPHA3, "ЧГ=")+";"; //	Страна рождения
ТекстДляФМС=ТекстДляФМС + Клиент.РождениеСтранаФМС_NEW.CODE_ALPHA3 + ";"; //	Страна рождения
// - ПСН 

ТекстДляФМС=ТекстДляФМС + Клиент.РождениеРегион_NEW + ";"; //Регион -
ТекстДляФМС=ТекстДляФМС + Клиент.РождениеРайон + ";";  //Район   -
ТекстДляФМС=ТекстДляФМС + Клиент.РождениеГород + ";"; //Город    -
ТекстДляФМС=ТекстДляФМС + Клиент.РождениеНасПункт + ";"; //Нас. пункт -

// + ПСН 
//ТекстДляФМС=ТекстДляФМС+Формат(Клиент.ГражданствоФМС_OLD.Код, "ЧГ=")+";"; //Гражданство 
Если Клиент.ИностранныйГражданин Тогда 
	ГражданствоФМС_NEW = Клиент.ГражданствоФМС_NEW.CODE_ALPHA3; //Гражданство 
Иначе
	ГражданствоФМС_NEW = "RUS";
КонецЕсли;	
ТекстДляФМС=ТекстДляФМС + ГражданствоФМС_NEW + ";";
// - ПСН 
//// - Место рождения

//// + Документ, удостоверяющий личность
// - ПСН 
//ТекстДляФМС=ТекстДляФМС+Формат(?(Клиент.ТипДокументаФМС_OLD.пустая(),103008,Клиент.ТипДокументаФМС_OLD.Код), "ЧГ=")+";"; //Тип
Если Клиент.ИностранныйГражданин Тогда
	ТипДокументаФМС_NEW_ID = Формат(Клиент.ТипДокументаФМС_NEW.ID, "ЧГ="); //Тип
Иначе
	ПаспортРФ_ID = 103008; 
	ТипДокументаФМС_NEW_ID = Формат(?(Клиент.ТипДокументаФМС_NEW.пустая(), ПаспортРФ_ID, Клиент.ТипДокументаФМС_NEW.ID), "ЧГ="); //Тип
КонецЕсли;	
ТекстДляФМС=ТекстДляФМС + ТипДокументаФМС_NEW_ID + ";"; //Тип
// - ПСН 

ТекстДляФМС=ТекстДляФМС+Клиент.Серия+";"; //Серия-
ТекстДляФМС=ТекстДляФМС+Клиент.Номер+";"; //Номер
ТекстДляФМС=ТекстДляФМС+Формат(Клиент.ДатаВыдачи, "ДФ=dd.MM.yyyy")+";"; //Дата выдачи	ДД.ММ.ГГГГ

// + ПСН 
//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,"",Формат(Клиент.ДатаДействияДокументаФМС, "ДФ=dd.MM.yyyy"))+";"; //Срок действия	ДД.ММ.ГГГГ (русский - обязательно)
ТекстДляФМС=ТекстДляФМС+";"; //Срок действия с -
ТекстДляФМС=ТекстДляФМС+Формат(Клиент.СрокОсновнойДокументПо, "ДФ=dd.MM.yyyy")+";"; // Срок действия до   -
// - ПСН 

ПунктыВыдачиФМС_NEW = ПунктВыдачиДокументаФМС(Клиент.ПунктыВыдачиФМС_NEW);
ТекстДляФМС=ТекстДляФМС + ПунктыВыдачиФМС_NEW + ";"; //ПунктыВыдачиФМС -
//// - Документ, удостоверяющий личность

//// + Адрес регистрации из документа, удостоверяющего личность 
//ТекстДляФМС=ТекстДляФМС+";"; //Регион-
ТекстДляФМС=ТекстДляФМС+Клиент.ПроживаниеРегион_NEW+";"; // Регион-
ТекстДляФМС=ТекстДляФМС+Клиент.ПроживаниеРайон+";"; //Район-
ТекстДляФМС=ТекстДляФМС+Клиент.ПроживаниеГород+";"; //Город-
ТекстДляФМС=ТекстДляФМС+Клиент.ПроживаниеНасПункт+";"; //Населенный пункт-

// + ПСН
ТекстДляФМС=ТекстДляФМС+";"; // Строение-
// - ПСН

ТекстДляФМС=ТекстДляФМС+Клиент.ПроживаниеУлица+";"; //Улица-
ТекстДляФМС=ТекстДляФМС+Клиент.ПроживаниеДом+";"; //Дом-
ТекстДляФМС=ТекстДляФМС+Клиент.ПроживаниеКорпус+";"; //Корпус-
ТекстДляФМС=ТекстДляФМС+Клиент.ПроживаниеКвартира+";"; //Квартира-
//// - Адрес регистрации из документа, удостоверяющего личность 

//// + Адрес прежнего места проживания в РФ
ТекстДляФМС=ТекстДляФМС + Клиент.ПрежнееПроживаниеРегион + ";"; //Регион-
ТекстДляФМС=ТекстДляФМС + Клиент.ПрежнееПроживаниеРайон + ";"; //Район-
ТекстДляФМС=ТекстДляФМС + Клиент.ПрежнееПроживаниеГород + ";"; //Город-
ТекстДляФМС=ТекстДляФМС + Клиент.ПрежнееПроживаниеНаселенныйПункт + ";"; //Населенный пункт-

// + ПСН
ТекстДляФМС=ТекстДляФМС+";"; // Строение-
// - ПСН

ТекстДляФМС=ТекстДляФМС + Клиент.ПрежнееПроживаниеУлица + ";"; //Улица-
ТекстДляФМС=ТекстДляФМС + Клиент.ПрежнееПроживаниеДом + ";"; //Дом-
ТекстДляФМС=ТекстДляФМС + Клиент.ПрежнееПроживаниеКорпус + ";"; //Корпус-
ТекстДляФМС=ТекстДляФМС + Клиент.ПрежнееПроживаниеКвартира + ";"; //Квартира-
//// - Адрес прежнего места проживания в РФ

//// + Документы на право пребывания в РФ 
//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ВидДокументаНаПребываниеФМС_OLD.Код, "ЧГ="),"")+";"; //Вид документа (на пребывание в РФ) инн. - обяз.
ТекстДляФМС=ТекстДляФМС + ?(Клиент.ИностранныйГражданин, Формат(Клиент.ПребываниеВидДокументаФМС_NEW.ID, "ЧГ="),"")+";"; 

ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ПребываниеСерияДокумента, "ЧГ="),"")+";"; //Серия-
ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ПребываниеНомерДокумента, "ЧГ="),"")+";"; //Номер инн. - обяз.
ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ПребываниеДатаВыдачиДокументаНаПребывание, "ДФ=dd.MM.yyyy"),"")+";";  //Дата выдачи	ДД.ММ.ГГГГ инн. - обяз

ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ПребываниеСрокДокументаС, "ДФ=dd.MM.yyyy"),"")+";"; //Срок действия с	ДД.ММ.ГГГГ инн. - обяз
ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ПребываниеСрокДокументаПо, "ДФ=dd.MM.yyyy"),"")+";"; //Срок действия до	ДД.ММ.ГГГГ инн. - обяз

// + ПСН
//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ТипВизыФМС_OLD.Код, "ЧГ="),"")+";"; //Тип визы (категория) инн. - обяз 
//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.КратностьВизыФМС_OLD.Код, "ЧГ="),"")+";"; //Кратность визы инн. - обяз

ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ТипВизыФМС_NEW.ID, "ЧГ="),"")+";"; //Тип визы (категория) инн. - обяз 
ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.КратностьВизыФМС_NEW.ID, "ЧГ="),"")+";"; //Кратность визы инн. - обяз
// - ПСН

ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин, Клиент.ИдентификаторВизыФМС,"")+";"; //Идентификатор визы инн. - обяз
// + ПСН

ТекстДляФМС=ТекстДляФМС + ";"; // Разрешенный срок пребывания 	
ТекстДляФМС=ТекстДляФМС + ";"; // Номер приглашения 

// Кем выдан	Справочник dict_officialorgan_fms (ID) для разрешения на временное пребывание ЛБГ или ИГ, иначе - строка
ПунктВыдачиДокументаНаПребывание_NEW = ПунктВыдачиДокументаФМС(Клиент.ПребываниеПунктВыдачиДокумента_NEW);
ТекстДляФМС = ТекстДляФМС + ПунктВыдачиДокументаНаПребывание_NEW + ";";  // Кем выдан
	
ТекстДляФМС=ТекстДляФМС + Клиент.НомерРешения_NEW + ";"; // Номер решения 	
ТекстДляФМС=ТекстДляФМС + Формат(Клиент.ДатаРешения_NEW, "ДФ=dd.MM.yyyy") + ";"; // Дата решения
// - ПСН
//// - Документы на право пребывания в РФ 

//// + Регистрация по месту жительства даты
// + ПСН
ТекстДляФМС = ТекстДляФМС + Формат(Клиент.ДатаПропискиС, "ДФ=dd.MM.yyyy") + ";"; // Зарегистрирован по месту жительства с
ТекстДляФМС = ТекстДляФМС + Формат(Клиент.ДатаПропискиПо_NEW, "ДФ=dd.MM.yyyy") + ";";	// Зарегистрирован по месту жительства по 

Если Клиент.ИностранныйГражданин Тогда
	АдресРегистрацииОтсутствует = "True";
Иначе
	АдресРегистрацииОтсутствует = ?(Клиент.АдресРегистрацииОтсутствует, "True", "False");
КонецЕсли;	
ТекстДляФМС=ТекстДляФМС + АдресРегистрацииОтсутствует + ";"; // Адрес регистрации отсутствует
// - ПСН                                                         
//// - Регистрация по месту жительства даты

// + ПСН
ТекстДляФМС=ТекстДляФМС + ";"; // Строка (59) для расширения функциональности csv
// - ПСН

//// + Миграционная карта (60-64)
ТекстДляФМС=ТекстДляФМС+Клиент.МиграционнаяКартаСерия+";"; //Серия-
ТекстДляФМС=ТекстДляФМС+Клиент.МиграционнаяКартаНомер+";"; //Номер  инн. - обяз
	
//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ПунктПересеченияГраницыФМС.Код, "ЧГ="),"")+";"; //Пункт пересечения границы (КПП въезда)  инн. - обяз
//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(УдалитьПробелы(Клиент.ПунктПересеченияГраницыФМС_OLD.Код), "ЧГ="),"")+";";     //Политов: в коде затесались неразрывные пробелы 
ТекстДляФМС=ТекстДляФМС + ?(Клиент.ИностранныйГражданин,Формат(Клиент.ПунктПересеченияГраницыФМС_NEW.ID, "ЧГ="),"")+";";     //Политов: в коде затесались неразрывные пробелы 

ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин, Формат(Клиент.ДатаВъездаВРФФМС, "ДФ=dd.MM.yyyy"),"")  + ";"; //Дата въезда в РФ  инн. - обяз
	
//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.СрокПребыванияВ_РФ_ФМС, "ДФ=dd.MM.yyyy"),"")+";"; //Срок пребывания до - 
ТекстДляФМС = ТекстДляФМС + ";"; // Срок пребывания до 
//// - Миграционная карта (60-64)

////// + Сведения о законном представителе (65-80)	
//ТекстДляФМС=ТекстДляФМС + ?(Клиент.ИностранныйГражданин, Клиент.ФамилияПредставителяФМС,"")+";"; //Фамилия инн. - обяз
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительФамилияФМС + ";"; //Фамилия инн. - обяз
// + ПСН
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительФамилияЛатиницаФМС + ";"; // Фамилия (латинские буквы)
// - ПСН

//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин, Клиент.ИмяПредставителяФМС,"")+";"; //Имя инн. - обяз
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительИмяФМС + ";"; //Имя инн. - обяз
// + ПСН
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительИмяЛатиницаФМС + ";"; // Имя (латинские буквы)
// - ПСН

//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин, Клиент.ОтчествоПредставителяФМС,"")+";"; //Отчество-
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительОтчествоФМС + ";"; //Отчество-
// + ПСН
ТекстДляФМС=ТекстДляФМС + ";"; // Отчество (латинские буквы)
// - ПСН

// + ПСН
Если ЗначениеЗаполнено(Клиент.ПредставительПолФМС_NEW) Тогда
	ПредставительПолФМС_NEW = ?(Клиент.ПредставительПолФМС_NEW = Перечисления.Пол.Женский, "Ж", "М"); //Пол
Иначе 
	ПредставительПолФМС_NEW = "";
КонецЕсли;
ТекстДляФМС = ТекстДляФМС + ПредставительПолФМС_NEW + ";";

//ТекстДляФМС=ТекстДляФМС + ?(Клиент.ИностранныйГражданин, Формат(Клиент.ПредставительДатаРожденияФМС_NEW, "ДФ=dd.MM.yyyy"), "") + ";"; //Дата рождения	ДД.ММ.ГГГГ
Если ЗначениеЗаполнено(Клиент.ПредставительДатаРожденияФМС_NEW) Тогда
	ПредставительДатаРожденияФМС_NEW = Формат(Клиент.ПредставительДатаРожденияФМС_NEW, "ДФ=dd.MM.yyyy"); 
Иначе 
	ПредставительДатаРожденияФМС_NEW = "";
КонецЕсли;
ТекстДляФМС= ТекстДляФМС + ПредставительДатаРожденияФМС_NEW + ";";

//ТекстДляФМС=ТекстДляФМС + ?(Клиент.ИностранныйГражданин, Формат(Клиент.ПредставительГражданствоРожденияФМС_NEW.CODE_ALPHA3, "ЧГ="), "") + ";"; //Гражданство 
Если ЗначениеЗаполнено(Клиент.ПредставительГражданствоРожденияФМС_NEW) Тогда
	ПредставительГражданствоРожденияФМС_NEW = Клиент.ПредставительГражданствоРожденияФМС_NEW.CODE_ALPHA3; 
Иначе 
	ПредставительГражданствоРожденияФМС_NEW = "";
КонецЕсли;
ТекстДляФМС= ТекстДляФМС + ПредставительГражданствоРожденияФМС_NEW + ";";
// - ПСН

// + ПСН
//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин, Формат(Клиент.ТипДокументаПредставителяФМС.Код, "ЧГ="),"")+";"; //Дата рождения	ДД.ММ.ГГГГ-
Если ЗначениеЗаполнено(Клиент.ПредставительТипДокументаФМС_NEW) Тогда
	ПредставительТипДокументаФМС_NEW_ID = Клиент.ПредставительТипДокументаФМС_NEW.ID;
	ПредставительТипДокументаФМС_NEW = Формат(ПредставительТипДокументаФМС_NEW_ID, "ЧГ="); //Пол
Иначе 
	ПредставительТипДокументаФМС_NEW = "";
КонецЕсли;
ТекстДляФМС= ТекстДляФМС + ПредставительТипДокументаФМС_NEW + ";";
//ТекстДляФМС=ТекстДляФМС+";"; //Тип документа инн. - обяз
// - ПСН

//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин, Клиент.СерияДокументаПредставителяФМС,"")+";"; //Серия-
//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин, Клиент.НомерДокументаПредставителяФМС,"")+";"; //Номер инн. - обяз
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительСерияДокументаФМС + ";"; //Серия-
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительНомерДокументаФМС + ";"; //Номер инн. - обяз

//ПунктыВыдачиФМС_NEW = Клиент.ПредставительПунктыВыдачиФМС_NEW.ID;			
//ТекстДляФМС=ТекстДляФМС + ПунктыВыдачиФМС_NEW + ";"; //ПунктыВыдачиФМС -

Если ЗначениеЗаполнено(Клиент.ПредставительПунктыВыдачиФМС_NEW) Тогда
	ПредставительПунктыВыдачиФМС_NEW = ПунктВыдачиДокументаФМС(Клиент.ПредставительПунктыВыдачиФМС_NEW);
Иначе 
	ПредставительПунктыВыдачиФМС_NEW = "";
КонецЕсли;
ТекстДляФМС= ТекстДляФМС + ПредставительПунктыВыдачиФМС_NEW + ";";

//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ДатаВыдачиДокументаПредставителя_ФМС, "ДФ=dd.MM.yyyy"),"")+";"; //Дата выдачи документа законного представителя инн. - обяз
//ТекстДляФМС=ТекстДляФМС + Формат(Клиент.ПредставительДатаВыдачиДокументаФМС, "ДФ=dd.MM.yyyy") + ";"; //Дата выдачи документа законного представителя инн. - обяз
Если ЗначениеЗаполнено(Клиент.ПредставительДатаВыдачиДокументаФМС) Тогда
	ПредставительДатаВыдачиДокументаФМС = Формат(Клиент.ПредставительДатаВыдачиДокументаФМС, "ДФ=dd.MM.yyyy");
Иначе 
	ПредставительДатаВыдачиДокументаФМС = "";
КонецЕсли;
ТекстДляФМС= ТекстДляФМС + ПредставительДатаВыдачиДокументаФМС + ";";

ТекстДляФМС=ТекстДляФМС + ";"; //	Действует с
ТекстДляФМС=ТекстДляФМС + ";"; //	Действует до

//// + Место рождения зак.представителя (81-85)	
//ТекстДляФМС=ТекстДляФМС + ";"; //	Страна рождения
Если ЗначениеЗаполнено(Клиент.ПредставительРождениеСтрана) Тогда
	ПредставительСтранаРождения = Клиент.ПредставительРождениеСтрана.CODE_ALPHA3;
Иначе 
	ПредставительСтранаРождения = "";
КонецЕсли;
ТекстДляФМС= ТекстДляФМС + ПредставительСтранаРождения + ";";

ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительРождениеРегион + ";"; //	Регион
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительРождениеРайон + ";"; //	Район 
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительРождениеГород + ";"; //	Город
ТекстДляФМС=ТекстДляФМС + Клиент.ПредставительРождениеНаселенныйПункт + ";"; //	Нас. пункт
//// - Место рождения зак.представителя (81-85)	
////// - Сведения о законном представителе (65-80)

ТекстДляФМС=ТекстДляФМС+";"; //№ комнаты в гостинице - 	
ТекстДляФМС=ТекстДляФМС+Формат(Бронь.РезервС, "ДФ=dd.MM.yyyy")+";"; //Дата заезда в гостиницу
ТекстДляФМС=ТекстДляФМС+Формат(Бронь.РезервПо, "ДФ=dd.MM.yyyy")+";"; //Дата выезда русский - обяз.

ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ЦельВъездаФМС_NEW.ID, "ЧГ="),"")+";"; //Цель въезда инн. обяз 
ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ЦельПоездкиФМС_NEW.CODE_0, "ЧГ="),"")+";"; //Цель поездки/приезда инн. обяз

ТекстДляФМС=ТекстДляФМС+";"; //Участник гос. программы -
ТекстДляФМС=ТекстДляФМС+";"; //Профессия-

//// + Сведения о заполняющем	
ТекстДляФМС=ТекстДляФМС+";"; // Дата заполнения
ТекстДляФМС=ТекстДляФМС + Формат(Клиент.СтепеньРодства.ID, "ЧГ=") + ";"; //Степень родства (законный представитель)
//// - Сведения о заполняющем	

Возврат ТекстДляФМС;

// + ПСН Не нужно
////// + Дополнительные поля адреса регистрации из документа, удостоверяющего личность (95-96)
//ТекстДляФМС=ТекстДляФМС+";"; // Внутригородская территория
//ТекстДляФМС=ТекстДляФМС+";"; // Планировочная структура
////// - Дополнительные поля адреса регистрации из документа, удостоверяющего личность (95-96)

////// + Дополнительные поля адреса прежнего места проживания в РФ (97-98)
//ТекстДляФМС=ТекстДляФМС+";"; // Внутригородская территория
//ТекстДляФМС=ТекстДляФМС+";"; // Планировочная структура
////// - Дополнительные поля адреса прежнего места проживания в РФ (97-98)

//Возврат ТекстДляФМС;
// - ПСН Не нужно
КонецФункции

&НаСервере
Функция ПунктВыдачиДокументаФМС(ПунктВыдачиДокумента)   
 Если ТипЗнч(ПунктВыдачиДокумента) = Тип("Строка") Тогда
	ПунктВыдачиДокументаФМС = ПунктВыдачиДокумента; 
ИначеЕсли ТипЗнч(ПунктВыдачиДокумента) = Тип("СправочникСсылка.ПунктыВыдачиФМС_NEW") Тогда
	ПунктВыдачиДокументаФМС = Формат(ПунктВыдачиДокумента.ID, "ЧГ="); // Кем выдан	
Иначе
	ПунктВыдачиДокументаФМС = "";
КонецЕсли;

Возврат ПунктВыдачиДокументаФМС;
КонецФункции


&НаСервереБезКонтекста
Функция УдалитьПробелы(Штрихкод)  //Политов 
    
    ШтрихкодБезПробелов = "";
    
    Для Сч = 1 По СтрДлина(Штрихкод) Цикл
        Символ = Сред(Штрихкод, Сч, 1);
        Если Символ <> Символы.НПП и Символ <> " " Тогда
            ШтрихкодБезПробелов = ШтрихкодБезПробелов + Строка(Символ);
        КонецЕсли;
    КонецЦикла;
    
    Возврат ШтрихкодБезПробелов;
    
КонецФункции

&НаКлиенте
Процедура ТаблицаДляВыгрузкиКлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
КонецПроцедуры

//

