

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КнопкаПереключитьАктивность = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаПереключитьАктивность");	
КнопкаПереключитьАктивность.Видимость = Ложь;

УстановитьФильтр();
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтр()
НаборЗаписей_П = РегистрыСведений.ЕжедневныйОтчетФакт.СоздатьНаборЗаписей();
НаборЗаписей_П.Отбор.Месяц.Использование       = Истина;
НаборЗаписей_П.Отбор.Месяц.ВидСравнения       = ВидСравнения.Равно;
НаборЗаписей_П.Отбор.Месяц.Значение             = Месяц;
НаборЗаписей_П.Прочитать();   
ЗначениеВДанныеФормы(НаборЗаписей_П,НаборЗаписей); 	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
Месяц = НачалоМесяца(Месяц);

УстановитьФильтр();
КонецПроцедуры


&НаКлиенте
Процедура НаборЗаписейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура НаборЗаписейПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

