
// + Кнопка 12
&НаКлиенте
Процедура Кассовые__(Элемент)
	//документы.КассовыйДокумент.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Касса(Команда)
ПараметрыФормы = Новый Структура();
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
ОткрытьФорму("Документ.КассовыйДокумент.ФормаСписка", ПараметрыФормы, ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры
// - Кнопка 12

// + ПСН Добавлено
&НаКлиенте
Процедура ОтчетКассоваяСмена(Команда)
ОткрытьФорму("Отчет.ОтчетКассоваяСмена.Форма.ФормаОтчета", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСтатистикаПоНомерам(Команда)
ОткрытьФорму("Отчет.СтатистикаПоНомерам.Форма.ФормаОтчета", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоЗагрузкеНомеров(Команда)
ОткрытьФорму("Обработка.ОтчетПоЗагрузкеНомеров.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ФинасовыйРезультат(Команда)
ОткрытьФорму("Обработка.ФинансовыйРезультат.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетДолгиЗаявки(Команда)
ОткрытьФорму("Обработка.ОтчетДолгиЗаявки.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВыписка(Команда)
ОткрытьФорму("Обработка.ОтчетВыписка.Форма.Форма", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
// - ПСН Добавлено


///////////// Пока не готово //////////

// + Кнопка 13
&НаКлиенте
Процедура Банковские__(Элемент)
//	документы.ВыпискаБанка.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Банк(Команда)
ОткрытьФорму("Документ.ВыпискаБанка.ФормаСписка",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка 13

// + Кнопка 14
&НаКлиенте
Процедура Отчет___(Элемент)
	//Отчеты.ЕжемесячныеФинансы.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Отчет(Команда)
ОткрытьФорму("Отчет.ЕжемесячныеФинансы.Форма.ФормаОтчета",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка 14

// + Кнопка 15
&НаКлиенте
Процедура Кнопка15Нажатие___(Элемент)
	//Документы.ГашениеДолгов.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ГашениеДолгов(Команда)
ОткрытьФорму("Документ.ГашениеДолгов_Старая.ФормаСписка",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// + Кнопка 15

// + Кнопка16
&НаКлиенте
Процедура ОтчетПоПоказателям___(Элемент)
	//Отчеты.ОтчетПоПоказателям.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПоказателям(Команда)
ОткрытьФорму("Отчет.ОтчетПоПоказателям.Форма.ФормаОтчета",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка16

// + Кнопка17
&НаКлиенте
Процедура СатПоНомерам___(Элемент)
	//Отчеты.СтатистикаПоНомерам.ПолучитьФорму().Открыть();
КонецПроцедуры
 
&НаКлиенте
Процедура СтатистикаПоНомерам(Команда)
ОткрытьФорму("Отчет.СтатистикаПоНомерам_Исходная.Форма.ФормаОтчета",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка17

// + Кнопка18
&НаКлиенте
Процедура ПроданыеН___(Элемент)
	//Отчеты.ПроданыеНомера.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПроданныеНомера(Команда)
ОткрытьФорму("Отчет.ПроданыеНомера.Форма.ФормаОтчета",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка18


// + Кнопка18
&НаКлиенте
Процедура ЗакрД___(Элемент)
	//ДЗ=Документы.ЗакрытиеДней.СоздатьДокумент();
	//ДЗ.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеДней(Команда)
ОткрытьФорму("Документ.ЗакрытиеДней_OLD.Форма.ФормаДокумента", , ЭтаФорма	
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка18


// + Кнопка43
&НаКлиенте
Процедура Кнопка43Нажатие___(Элемент)
	//Отчеты.ОтчетПоИсточникамБронирования.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоИсточникамБронирования(Команда)
ОткрытьФорму("Отчет.ОтчетПоИсточникамБронирования.Форма.ФормаОтчета",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка43

// + Кнопка45
&НаКлиенте
Процедура Кнопка45Нажатие(Элемент)
	//Отчеты.СверкаПоЮрЛицам.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СверкаПоЮрЛицам(Команда)
//ОткрытьФорму("Отчет.СверкаПоЮрЛицам.Форма.ФормаОтчета",,ЭтаФорма
//	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка45

// + Кнопка20
&НаКлиенте
Процедура Аудит___(Элемент)
	//Документы.ЕжедневныйАудит.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЕжедневныйАудит(Команда)
ОткрытьФорму("Документ.ЕжедневныйАудит.ФормаСписка",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка20


// + Кнопка21
&НаКлиенте
Процедура Датчики___(Элемент)
	//Отчеты.ОтчетПоДатчикам.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоДатчикам(Команда)
//ОткрытьФорму("Отчет.ОтчетПоДатчикам.Форма.ФормаОтчета",,ЭтаФорма
//	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка21

// + Кнопка22
&НаКлиенте
Процедура Настройки___(Элемент)
	//Константы.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
ОткрытьФорму("ОбщаяФорма.ФормаКонстант",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка22

// + Кнопка35
&НаКлиенте
Процедура Кнопка35Нажатие___(Элемент)
//Отчеты.СтатистикаПоАнкетам.ПолучитьФорму().Открыть();

КонецПроцедуры

&НаКлиенте
Процедура СтатистикаПоАнкетам(Команда)
ОткрытьФорму("Отчет.СтатистикаПоАнкетам.Форма.ФормаОтчета",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка35

// + Кнопка36
&НаКлиенте
Процедура Кнопка36Нажатие___(Элемент)
	//отчеты.ОтчетПоПродажамМенджера.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПоМенджерам(Команда)
ОткрытьФорму("Отчет.ОтчетПоПродажамМенджера.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка36


// + Кнопка40
&НаКлиенте
Процедура Кнопка40Нажатие___(Элемент)
//Отчеты.ФинансовыйОтчет.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйОтчет(Команда)
ОткрытьФорму("Отчет.ФинансовыйОтчет.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка40

// + Кнопка41
&НаКлиенте
Процедура Кнопка41Нажатие___(Элемент)
	//Отчеты.ОтчетПоГлубинеБронирования.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоГлубинеБронирования(Команда)
ОткрытьФорму("Отчет.ОтчетПоГлубинеБронирования.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка41

// + Кнопка42
&НаКлиенте
Процедура Кнопка42Нажатие___(Элемент)
	//Отчеты.ОтчетПоОтменамБронирования.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОтменамБронирования(Команда)
ОткрытьФорму("Отчет.ОтчетПоОтменамБронирования.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка42

// + Кнопка44
&НаКлиенте
Процедура Кнопка44Нажатие___(Элемент)
	//Отчеты.ОтчетПоВремениЗаезда.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоВремениЗаезда(Команда)
ОткрытьФорму("Отчет.ОтчетПоВремениЗаезда.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка44

// + Кнопка46
&НаКлиенте
Процедура Кнопка46Нажатие___(Элемент)
	//Отчеты.ПроданыеСНаценкой.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПроданныеСНаценкой(Команда)
//ОткрытьФорму("Отчет.ПроданыеСНаценкой_OLD.Форма",,ЭтаФорма
//	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка46



// + Кнопка23
&НаКлиенте
Процедура Кнопка23Нажатие___(Элемент)
	//Документы.ПоступлениеТоваров.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеТоваров(Команда)
ОткрытьФорму("Документ.ПоступлениеТоваров.ФормаСписка",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка23

// + Кнопка24
&НаКлиенте
Процедура Кнопка24Нажатие__(Элемент)
	//Отчеты.ОтчетПоОстаткамТМЦ.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОстаткамТМЦ(Команда)
ОткрытьФорму("Отчет.ОтчетПоОстаткамТМЦ.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка24

// + Кнопка25
&НаКлиенте
Процедура Кнопка25Нажатие___(Элемент)
	//Отчеты.ОтчетПоПродажам.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПродажам(Команда)
ОткрытьФорму("Отчет.ОтчетПоПродажам.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка25

// + Кнопка26
&НаКлиенте
Процедура Кнопка26Нажатие__(Элемент)
	//Справочники.Товары.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Товары(Команда)
ОткрытьФорму("Справочник.Товары.ФормаСписка",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка26

// + Кнопка27
&НаКлиенте
Процедура Кнопка27Нажатие___(Элемент)
////	Документы.Инвентарицация.ПолучитьФормуСписка().Открыть();
//ПолучитьФорму("ФормаБар").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Бар(Команда)
ОткрытьФорму("Обработка.Интерфейс.Форма.ФормаБар",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка27

// + Кнопка28
&НаКлиенте
Процедура ОтчетыПоГорничной___(Элемент)
	//Отчеты.ОбщийОтчетПоГорничным.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбщийОтчетПоГорничным(Команда)
ОткрытьФорму("Отчет.ОбщийОтчетПоГорничным.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка28

// + Кнопка29
&НаКлиенте
Процедура МиниБарПоГорничной___(Элемент)
	//Обработки.ФиксацияПоказанийМиниБара.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ФиксацияПоказанийМиниБара(Команда)
ОткрытьФорму("Обработка.ФиксацияПоказанийМиниБара_OLD.Форма.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка29

// + Кнопка30
&НаКлиенте
Процедура ЗамечанияПоУборкам___(Элемент)
	//Отчеты.ОтчетПоПроверкамНомеров.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗамечанияПоУборкам(Команда)
ОткрытьФорму("Отчет.ОтчетПоПроверкамНомеров.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка30


// + Кнопка37
&НаКлиенте
Процедура Кнопка37Нажатие___(Элемент)
//Отчеты.ДолгиВыехавшихПоМинибаруЗаПериод.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДолгиВыехавшихПоМинибаруЗаПериод(Команда)
ОткрытьФорму("Отчет.ДолгиВыехавшихПоМинибаруЗаПериод.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка37

// + Кнопка38
&НаКлиенте
Процедура Кнопка38Нажатие___(Элемент)
	//Обработки.ОтчетПоПропавшимПолотенцам.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПропавшимПолотенцам(Команда)
ОткрытьФорму("Обработка.ОтчетПоПропавшимПолотенцам.Форма.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка38

// + Кнопка39
&НаКлиенте
Процедура Кнопка39Нажатие___(Элемент)
	//Обработки.ВыгрузкаДляФМС.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаДляФМС(Команда)
ОткрытьФорму("Обработка.ВыгрузкаДляФМС_Исходная.Форма.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка39


// + Кнопка34
&НаКлиенте
Процедура ЗамечанияАудитора___(Элемент)
	//Отчеты.ЗамечанияАудитора.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗамечанияАудитора(Команда)
ОткрытьФорму("Отчет.ЗамечанияАудитора.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка34

// + Кнопка33
&НаКлиенте
Процедура ЗагрузкаГорничных___(Элемент)
	//ЗагрузкаТек();
	//ЗагрузкаАрхива();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаГорничных(Команда)
//ОбщийМодульСервер.ЗагрузкаТек();
//ОбщийМодульСервер.ЗагрузкаАрхива();

//ДатаОбслуживания = ТекущаяДата
//ОбщийМодульСервер.ЗагрузкаТекущихДанныхГорничных(ДатаОбслуживания);

ОткрытьФорму("Обработка.ЗагрузкаГорничные.Форма.Форма",, ЭтаФорма);
КонецПроцедуры
// - Кнопка33

// + Кнопка32
&НаКлиенте
Процедура РаспространенныеЗамечания___(Элемент)
	//Отчеты.РаспространенныеЗамечания.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура РаспространенныеЗамечания(Команда)
ОткрытьФорму("Отчет.РаспространенныеЗамечания.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка32

// + Кнопка31
&НаКлиенте
Процедура ЗамечанияПоГорничным__(Элемент)
	//Отчеты.ЗамечанияПоГорничным.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗамечанияПоГорничным(Команда)
ОткрытьФорму("Отчет.ЗамечанияПоГорничным.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка31


// + Нет на форме
&НаКлиенте
Процедура Кнопка1ОтчетПоЗагрузкеНомеров(Кнопка)
	//Обработки.ОтчетПоЗагрузкеНомеров.ПолучитьФорму().Открыть();
КонецПроцедуры




// - Нет на форме













