
Функция КоличествоНомеровЗаСмену(Проживающие, ДатаСмены) Экспорт 
ОтборСтроки = новый Структура("Дата", ДатаСмены);

НайденныеСтроки = Проживающие.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() = 0 Тогда
	Возврат 0;
Иначе
	Возврат НайденныеСтроки[0].КоличествоНомеров;
КонецЕсли;
КонецФункции

Функция ДатаВремяСмена(ДатаСмены, НомерСмены, ДлинаСмены, ПереработкаЧасы) Экспорт 

Если НомерСмены = 1 Тогда 
	ДатаВремяС = ДатаСмены + 9 * 60 * 60;
	//ДатаВремяПо = ДатаВремяС + (ДлинаСмены + ПереработкаЧасы) * 60 * 60;
	ДатаВремяПо = ДатаВремяС + (ДлинаСмены) * 60 * 60;
ИначеЕсли НомерСмены = 2 Тогда
	ДатаВремяС = ДатаСмены + 21*60*60;
	//ДатаВремяПо = ДатаВремяС + (ДлинаСмены + ПереработкаЧасы) * 60 * 60;
	ДатаВремяПо = ДатаВремяС + (ДлинаСмены) * 60 * 60;
Иначе 	
	ДатаВремяС = '00010101';
	ДатаВремяПо = '00010101';
КонецЕсли;

ДатаВремяСмена = Новый Структура("ДатаВремяС, ДатаВремяПо", ДатаВремяС, ДатаВремяПо);
Возврат ДатаВремяСмена;
КонецФункции

Функция АдминистраторыВСмену(ЗарплатаСмены, ДатаСмены) Экспорт
//Если НомерСмены = 0 Тогда Возврат Новый Массив; КонецЕсли;	
	
Дата_С = Формат(ДатаСмены, "ДФ=dd.MM.yy");
Дата_И = СтрЗаменить(Дата_С, ".", "");
	
ИмяДатаСмены = "Дата_" + Дата_И;	

ОтборСтроки = Новый Структура(ИмяДатаСмены, ДатаСмены); 	
НайденныеСтроки = ЗарплатаСмены.НайтиСтроки(ОтборСтроки);

Администраторы = Новый Массив;
ИмяНомерСмены = "НомерСмены_" + Дата_И;
Для Каждого Строка Из НайденныеСтроки Цикл
	Если Строка[ИмяНомерСмены] = 0 Тогда Продолжить; КонецЕсли;
	
	Администраторы.Добавить(Строка);
КонецЦикла;

Возврат Администраторы;
КонецФункции

Функция СуммаЗаПроживающихЗаСмену(АдминистраторыСуммаЗаПроживающих, КоличествоНомеров, ДлинаСмены) Экспорт

Если АдминистраторыСуммаЗаПроживающих.Количество() = 0 Тогда Возврат 0; КонецЕсли;

Для Каждого Строка Из АдминистраторыСуммаЗаПроживающих Цикл
	Если КоличествоНомеров >= Строка.КоличествоНомеровС И КоличествоНомеров < Строка.КоличествоНомеровПо Тогда
		Если ДлинаСмены <= 12 Тогда
			Возврат Строка.Сумма_12;
		Иначе
			Возврат Строка.Сумма_24;
		КонецЕсли;
	КонецЕсли;
КонецЦикла;

Возврат 0;
КонецФункции
//




