
//// + Проведение 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
Отказ = ПроверкаЗаполнения();
Если Отказ Тогда Возврат; КонецЕсли;
	
//Если ЭтотОбъект.ПочасоваяОплата Тогда Возврат; КонецЕсли;
//Если ЭтотОбъект.ПериодАренды = "ДЕНЬ" Тогда Возврат; КонецЕсли;
	
Результат = КоворкингСервер.ПроверкаЗанятостиКоворкинг(ЭтотОбъект);
Если Результат.Ошибка Тогда
	ТекстСообщения = "";
	Для Каждого Строка Из Результат.Сообщение Цикл
		ТекстСообщения = ТекстСообщения + Строка + " ";
	КонецЦикла;	
	ТекстСообщения = ТекстСообщения + " ЗАПИСЬ ОТМЕНЯЕТСЯ ***";	
	Сообщить(ТекстСообщения);
	
	Отказ = Истина; Возврат;	
КонецЕсли;	
	
Если ЭтотОбъект.КоворкингНомер.ПочасоваяОплата Тогда 
	ТемпС = НачалоЧаса(ЭтотОбъект.ДатаС) + ЭтотОбъект.ЧасС * 3600;
	ТемпПо = НачалоЧаса(ЭтотОбъект.ДатаПо) + ЭтотОбъект.ЧасПо * 3600 - 1;
Иначе
	ТемпС = НачалоДня(ЭтотОбъект.ДатаС);
	ТемпПо = НачалоДня(ЭтотОбъект.ДатаПо);
КонецЕсли;	
	
Движения.ЗанятостьНомеровКоворкинг.Записывать = Истина;
Пока ТемпС<=ТемпПо цикл
	Движение = Движения.ЗанятостьНомеровКоворкинг.Добавить();
	Движение.КоворкингНомер = ЭтотОбъект.КоворкингНомер;
	Движение.ДокументРегистратор = ЭтотОбъект.Ссылка;
	Движение.ПериодРезерва = ТемпС;
	Движение.Клиент = ЭтотОбъект.Клиент;
	Движение.Зарезервирован = Истина;
	
	Если ЭтотОбъект.КоворкингНомер.ПочасоваяОплата Тогда 
		ТемпС = ТемпС + 3600;
	Иначе
		ТемпС = ТемпС + 3600 * 24;
	КонецЕсли;	
КонецЦикла;
КонецПроцедуры

// + ПроверкаЗаполнения
Функция ПроверкаЗаполнения()
ТекстСообщения = КоворкингСервер.ПроверкаЗаполненияКоворкингЗаявкаТекстСообщения(ЭтотОбъект, " ");
Если ТекстСообщения <> "" Тогда
	ТекстСообщения = ТекстСообщения + " ЗАПИСЬ ОТМЕНЯЕТСЯ."; 
	Сообщить(ТекстСообщения);
	
	Возврат Истина;
КонецЕсли;	

Возврат Ложь;	
КонецФункции
// - ПроверкаЗаполнения
//// - Проведение 

Процедура ПередЗаписью_Вариант(Отказ, РежимЗаписи, РежимПроведения)
Если ЭтотОбъект.ПометкаУдаления И НЕ ЭтотОбъект.Ссылка.ПометкаУдаления Тогда
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	КоворкингСчета.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.КоворкингСчета КАК КоворкингСчета
	                      |ГДЕ
	                      |	КоворкингСчета.ПометкаУдаления = ЛОЖЬ
	                      |	И КоворкингСчета.КоворкингЗаявка = &КоворкингЗаявка");
	
	Запрос.УстановитьПараметр("КоворкингЗаявка", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Сообщить("У Заявки есть счета. ПОМЕТКА УДАЛЕНИЯ ОТМЕНЯЕТСЯ. ДОКУМЕНТ НЕ СОХРАНЕН.");
		
		Отказ = Истина; Возврат; 	
	КонецЕсли;
КонецЕсли;
	
КонецПроцедуры
