
&НаСервере
Процедура ПосмотретьНастройкиНаСервере()
Выборка = ХранилищеСистемныхНастроек.Выбрать();

Пока Выборка.Следующий() Цикл
	
	ТекстСообщения = "КлючНастроек " + Выборка.КлючНастроек
						+ "; КлючОбъекта " + Выборка.КлючОбъекта
						+ "; Пользователь " + Выборка.Пользователь
						+ "; Представление" + Выборка.Представление;
	
	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	ОбщегоНазначенияБПО.СообщитьПользователю(ТекстСообщения);
	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьНастройки(Команда)
	ПосмотретьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкиНаСервере()
ХранилищеСистемныхНастроек.Удалить(Неопределено, Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройки(Команда)
	УдалитьНастройкиНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СписокЗаявка(Команда)
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаСписка1");	
КонецПроцедуры

