
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотрАдминистратор();	

Если Параметры.Свойство("ЕстьДокументДолг") Тогда
	ЕстьДокументДолг = Параметры.ЕстьДокументДолг;
	ДокументДолг = Параметры.ДокументДолг;
	СуммаОперации = Параметры.СуммаОперации; 
КонецЕсли;

Если Параметры.Свойство("ТолькоБезКассовогоЧека") Тогда
	ТолькоБезКассовогоЧека = Параметры.ТолькоБезКассовогоЧека;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ДокументДолгЗначениеЗаполнено = ЗначениеЗаполнено(ДокументДолг);
Если ЕстьДокументДолг Тогда 	
	УстановитьПользовательскийОтборДинамическогоСписка(Список, "ДокументДолг", ДокументДолг, ВидСравненияКомпоновкиДанных.Равно
		, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, ДокументДолгЗначениеЗаполнено);
Иначе 
	СброситьПользовательскийОтборДинамическогоСписка(Список, "ДокументДолг");
КонецЕсли;
		
УстановитьПользовательскийОтборДинамическогоСписка(Список, "СуммаОперации", СуммаОперации, ВидСравненияКомпоновкиДанных.Равно
	, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, ЕстьДокументДолг);
	
УстановитьПользовательскийОтборДинамическогоСписка(Список, "НомерКарты", "", ВидСравненияКомпоновкиДанных.Содержит
	, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, Ложь);
	
ТекущийПользовательНаименование	= ОбщийФункционалСервер.ТекущийПользовательНаименование();
ТекущийПользовательКодРавноАдминистратор = НастройкиСервер.ТекущийПользовательКодРавноАдминистратор();
Если ТекущийПользовательКодРавноАдминистратор Тогда
	СброситьПользовательскийОтборДинамическогоСписка(Список, "ИдентификаторУстройстваНаименование");
Иначе		
	УстановитьПользовательскийОтборДинамическогоСписка(Список, "ИдентификаторУстройстваНаименование", "эмулятор"
		, ВидСравненияКомпоновкиДанных.НеСодержит, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный, Истина);
КонецЕсли;
	
УстановитьОтборКассовыйЧек();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля, Значение, ВидСравнения, РежимОтображения, Использование)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				 Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НовыйЭлементОтбора = Неопределено Тогда
			НовыйЭлементОтбора = ПользовательскийОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
		
		НовыйЭлементОтбора.ВидСравнения = ВидСравнения;
		НовыйЭлементОтбора.Использование = Использование;
		//НовыйЭлементОтбора.Использование = Истина;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		НовыйЭлементОтбора.РежимОтображения = РежимОтображения;
		НовыйЭлементОтбора.ПравоеЗначение = Значение;
		
		НовыйЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СброситьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НовыйЭлементОтбора = Неопределено Тогда Возврат; КонецЕсли;
		ПользовательскийОтбор.Удалить(НовыйЭлементОтбора);
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборКассовыйЧек()
КассовыйЧек_ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных("КассовыйЧек");

ЭлементыОтбора = Список.Отбор.Элементы;
ЕстьПоле = Ложь;
Для Каждого Элемент Из ЭлементыОтбора Цикл
	Если Элемент.ЛевоеЗначение = КассовыйЧек_ПолеКомпоновкиДанных Тогда
		ЕстьПоле = Истина;
		Прервать;
	КонецЕсли;	
КонецЦикла;

Если ТолькоБезКассовогоЧека Тогда
	Если ЕстьПоле Тогда
		ЭлементОтбора = Элемент;
	Иначе		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	КонецЕсли;		
	
	ЭлементОтбора.ЛевоеЗначение = КассовыйЧек_ПолеКомпоновкиДанных;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Ложь;
Иначе
	Если ЕстьПоле Тогда
		ЭлементыОтбора.Удалить(Элемент); 
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТолькоБезКассовогоЧекаПриИзменении(Элемент)
УстановитьОтборКассовыйЧек();
КонецПроцедуры


