
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр();  
ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр; 

Элементы.ГорничнаяГУИДСтрока.Видимость = НастройкиСервер.ТекущийПользовательКодРавноАдминистратор();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаПриАктивизацииСтроки(Элемент)
ТД = Элемент.ТекущиеДанные;
Если ТД = Неопределено Тогда
	ДатаНачалаОтпуска_OldValue = Неопределено;
	ДатаОкончанияОтпуска_OldValue = Неопределено;
Иначе
	ДатаНачалаОтпуска_OldValue = ТД.ДатаНачалаОтпуска;
	ДатаОкончанияОтпуска_OldValue = ТД.ДатаОкончанияОтпуска;
КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
Если ОтменаРедактирования Тогда
	ТД = Элемент.ТекущиеДанные;

	ТД.ДатаНачалаОтпуска = ДатаНачалаОтпуска_OldValue;
	ТД.ДатаОкончанияОтпуска = ДатаОкончанияОтпуска_OldValue;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаДатаНачалаОтпускаПриИзменении(Элемент)
ТД = Элементы.Отпуска.ТекущиеДанные;
Если ПроверитьДаты(ТД) Тогда
	ТД.ДатаНачалаОтпуска = ДатаНачалаОтпуска_OldValue;	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаДатаОкончанияОтпускаПриИзменении(Элемент)
ТД = Элементы.Отпуска.ТекущиеДанные;
Если ПроверитьДаты(ТД) Тогда
	ТД.ДатаОкончанияОтпуска = ДатаОкончанияОтпуска_OldValue;	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДаты(ТД)
Если НЕ (ЗначениеЗаполнено(ТД.ДатаНачалаОтпуска) И ЗначениеЗаполнено(ТД.ДатаОкончанияОтпуска)) 
Тогда Возврат Ложь; КонецЕсли;

Если ТД.ДатаНачалаОтпуска > ТД.ДатаОкончанияОтпуска ТОгда
	ПоказатьПредупреждение(, "Дата начала отпуска > Дата окончания отпуска");
	Возврат Истина;
КонецЕсли;	
	
Возврат Ложь;
КонецФункции





