
//// + Проведение 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
Отказ=Не ПроверкаЗаполнения();
Если Отказ Тогда Возврат; КонецЕсли;
	
Результат = КоворкингСервер.ПроверкаЗанятостиКоворкинг(ЭтотОбъект);
Если Результат.Ошибка Тогда
	ТекстСообщения = "";
	Для Каждого Строка Из Результат.Сообщение Цикл
		ТекстСообщения = ТекстСообщения + Строка + " ";
	КонецЦикла;	
	ТекстСообщения = ТекстСообщения + " ЗАПИСЬ ОТМЕНЯЕТСЯ ***";	
	Сообщить(ТекстСообщения);
	
	Отказ = Истина; Возврат;	
КонецЕсли;	

Если ЭтотОбъект.ПочасоваяОплата Тогда 
	ТемпС = НачалоЧаса(ЭтотОбъект.ДатаС) + ЭтотОбъект.ЧасС * 3600;
	ТемпПо = НачалоЧаса(ЭтотОбъект.ДатаПо) + ЭтотОбъект.ЧасПо * 3600 - 1;
Иначе
	ТемпС = НачалоДня(ЭтотОбъект.ДатаС);
	ТемпПо = НачалоДня(ЭтотОбъект.ДатаПо);
КонецЕсли;	
	
Движения.ЗанятостьНомеровКоворкинг.Записывать = Истина;
КоворкингНомер = ЭтотОбъект.КоворкингЗаявка.КоворкингНомер; 
Пока ТемпС<=ТемпПо цикл
	Движение = Движения.ЗанятостьНомеровКоворкинг.Добавить();
	Движение.КоворкингНомер = КоворкингНомер;
	Движение.ПериодРезерва = ТемпС;
	Движение.ДокументРегистратор = Ссылка;
	
	Движение.Клиент = ЭтотОбъект.КоворкингЗаявка.Клиент;
	Движение.Зарезервирован = Истина;
	
	Если ЭтотОбъект.ПочасоваяОплата Тогда 
		ТемпС = ТемпС + 3600;
	Иначе
		ТемпС = ТемпС + 3600 * 24;
	КонецЕсли;	
КонецЦикла;
КонецПроцедуры

// + ПроверкаЗаполнения
Функция ПроверкаЗаполнения()
ТекстСообщения = КоворкингСервер.ПроверкаЗаполненияКоворкингСчетТекстСообщения(ЭтотОбъект, " ");
Если ТекстСообщения <> "" Тогда
	ТекстСообщения = ТекстСообщения + " ЗАПИСЬ ОТМЕНЯЕТСЯ."; 
	Сообщить(ТекстСообщения);
	Возврат Ложь;
КонецЕсли;	

Возврат Истина;	
КонецФункции
// - ПроверкаЗаполнения
//// - Проведение 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
	Если ЭтотОбъект.ПометкаУдаления Тогда
		Если ЭтотОбъект.ДокументыОплаты.Количество() > 0 Тогда 
			
			Сообщить("У счета есть оплаты. ПОМЕТКА УДАЛЕНИЯ ОТМЕНЯЕТСЯ. ДОКУМЕНТ НЕ СОХРАНЕН.");
			
			Отказ = Истина; Возврат;
		КонецЕсли;
	КонецЕсли;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СчетГУИД) тогда 
	ЭтотОбъект.СчетГУИД = Новый УникальныйИдентификатор();
КонецЕсли;

ТЗ = РаспределениеОплатКоворкинг.Выгрузить(, "СуммаОплаты");
СуммаОплаты_П = ТЗ.Итог("СуммаОплаты");
СуммаОплачено = СуммаОплаты_П;
КонецПроцедуры


