
Функция ОбновитьPayKeeperПлатежи(Строка, ДатаСоздания, ДатаОплаты) Экспорт
НаборЗаписей = РегистрыСведений.PayKeeperПлатежи.СоздатьНаборЗаписей();

НаборЗаписей.Отбор.ИД_Платежа.Установить(Строка.ИД_Платежа); 

НаборЗаписей.Прочитать();
ЭтоНоваяЗапись = (НаборЗаписей.Количество() = 0); 
Если ЭтоНоваяЗапись Тогда 
	ГУИД_Исходный = Неопределено;
	ДатаСоздания_Исходный = Неопределено;
	ДатаОплаты_Исходный = Неопределено;
Иначе
	ГУИД_Исходный = НаборЗаписей[0].ГУИД;
	ДатаСоздания_Исходный = НаборЗаписей[0].ДатаСоздания;
	ДатаОплаты_Исходный = НаборЗаписей[0].ДатаОплаты;
КонецЕсли;
	
НаборЗаписей.Очистить();

НоваяЗапись = НаборЗаписей.Добавить(); 

Если  ЭтоНоваяЗапись Тогда
	НоваяЗапись.ГУИД = Новый УникальныйИдентификатор();
Иначе
	НоваяЗапись.ГУИД = ГУИД_Исходный;
КонецЕсли;

НоваяЗапись.ИД_Платежа = Строка.ИД_Платежа;
НоваяЗапись.Плательщик = Строка.Плательщик;
НоваяЗапись.НомерСчета = Строка.НомерСчета;
НоваяЗапись.Сумма = Строка.СуммаПлатежа;
НоваяЗапись.Статус = Строка.Статус;

Если ЗначениеЗаполнено(ДатаСоздания) Тогда
	НоваяЗапись.ДатаСоздания = ДатаСоздания;
Иначе	
	Если ЭтоНоваяЗапись Тогда
		НоваяЗапись.ДатаСоздания = ТекущаяДата();
	Иначе
		НоваяЗапись.ДатаСоздания = ДатаСоздания_Исходный; 
	КонецЕсли;
КонецЕсли;

Если ЗначениеЗаполнено(ДатаОплаты) Тогда
	НоваяЗапись.ДатаОплаты = ДатаОплаты;
Иначе	
	НоваяЗапись.ДатаОплаты = ДатаОплаты_Исходный;
КонецЕсли;

НаборЗаписей.Записать(); 

Возврат НаборЗаписей;
КонецФункции
 
Функция ПолучитьИОбработатьСписокПлатежей() Экспорт
Результат = PayKeeperКлиентСервер.СписокПлатежейPayKeeper();
Если Результат.Ошибка Тогда
	Возврат Результат;
КонецЕсли;

СписокПлатежей = Результат.СписокПлатежей;	

Для Каждого СтрокаПлатежа Из СписокПлатежей Цикл
	ИД_ПлатежаСтрока = СтрокаПлатежа.id;
	ИД_Платежа = ОбщийФункционалКлиентСервер.ПолучитьЧисло(ИД_ПлатежаСтрока);
	
	СуммаПлатежаСтрока = СтрокаПлатежа.pay_amount;
	СуммаПлатежа = ОбщийФункционалКлиентСервер.ПолучитьЧисло(СуммаПлатежаСтрока);
	
	Строка = Новый Структура("ИД_платежа, Плательщик, НомерСчета, СуммаПлатежа, Статус"
			 , ИД_Платежа, СтрокаПлатежа.clientid, СтрокаПлатежа.orderid, СуммаПлатежа, СтрокаПлатежа.status); 
			 
	ДатаОплатыСтрока = СтрокаПлатежа.success_datetime;
	Если ЗначениеЗаполнено(ДатаОплатыСтрока) Тогда
		//ДатаОплатыСтрока = СтрЗаменить(ДатаОплатыСтрока ,"-" ,".");
		ДатаОплаты = ОбщийФункционалКлиентСервер.ПолучитьДату(ДатаОплатыСтрока);
	Иначе
		ДатаОплаты = Неопределено;
	КонецЕсли;
	
	НаборЗаписей = PayKeeperСервер.ОбновитьPayKeeperПлатежи(Строка, Неопределено, ДатаОплаты);
	
	СтрокаНабора = НаборЗаписей[0];
	Если СтрокаНабора.Статус <> "success" Тогда Продолжить; КонецЕсли;
		
	PayKeeperСервер.СвязатьPayKeeperПлатежи(СтрокаНабора.ИД_Платежа);  
КонецЦикла;

Возврат Результат;
КонецФункции

//
Процедура СвязатьPayKeeperПлатежи(ИД_Платежа) Экспорт
Запись = РегистрыСведений.PayKeeperПлатежи.СоздатьМенеджерЗаписи();
Запись.ИД_Платежа = ИД_Платежа;
Запись.Прочитать();

Если НЕ Запись.Выбран() Тогда Возврат; КонецЕсли; 

НомерСчета = Запись.НомерСчета;
ГУИДЗагрузка  = Запись.ГУИД;
ДатаПлатежа = Запись.ДатаОплаты;
СуммаОплаты = Запись.Сумма;

Если НЕ ЗначениеЗаполнено(ДатаПлатежа) Тогда Возврат; КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.ГУИДЗагрузка = &ГУИДЗагрузка");

Запрос.УстановитьПараметр("ГУИДЗагрузка", ГУИДЗагрузка);
ТЗ = Запрос.Выполнить().Выгрузить(); 

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда Возврат; КонецЕсли;

ИмяЗаявкаСчетPayKeeper = PayKeeperКлиентСервер.ИмяЗаявкаСчетPayKeeper();
ИмяКоворкингСчетPayKeeper = PayKeeperКлиентСервер.ИмяКоворкингСчетPayKeeper();
ИмяГрупповойСчетPayKeeper = PayKeeperКлиентСервер.ИмяГрупповойСчетPayKeeper();

Если Лев(НомерСчета, ИмяЗаявкаСчетPayKeeper.Длина)  = ИмяЗаявкаСчетPayKeeper.Имя	Тогда
	НомерСчета_П = Сред(НомерСчета, ИмяЗаявкаСчетPayKeeper.Длина + 1);
	Индекс = СтрНайти(НомерСчета_П, "/");
	Если Индекс = 0 Тогда Возврат; КонецЕсли;
	
	ДокументДолгНомер = Лев(НомерСчета_П, Индекс - 1);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
	                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
	                      |	ЗаявкаНаБронированиеСчета.Контрагент КАК Контрагент
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
	                      |ГДЕ
	                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
	                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Номер = &НомерДокумента
	                      |	И ЗаявкаНаБронированиеСчета.НомерСчета = &НомерСчета");
	
	ДлинаНомера = Метаданные.Документы.ЗаявкаНаБронирование.ДлинаНомера;
	КоличествоПовторов = ДлинаНомера - СтрДлина(ДокументДолгНомер);
	СтрокаИз_0 = СтрСоединить(новый массив(КоличествоПовторов + 1), "0");  
	
	ДокументДолгНомер_П = СтрокаИз_0 + ДокументДолгНомер;
	НомерСчета_З = Сред(НомерСчета_П, Индекс + 1); 
	НомерСчета_З = ОбщийФункционалКлиентСервер.ПолучитьЧисло(НомерСчета_З);
	
	Запрос.УстановитьПараметр("НомерДокумента", ДокументДолгНомер_П);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета_З);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда Возврат; КонецЕсли;
	
	ДокументДолг = Выборка.Ссылка;
	СчетГУИД = Выборка.СчетГУИД;
	Контрагент = Выборка.Контрагент;
	
ИначеЕсли Лев(НомерСчета, ИмяКоворкингСчетPayKeeper.Длина)  = ИмяКоворкингСчетPayKeeper.Имя	Тогда
	НомерСчета_П = Сред(НомерСчета, ИмяКоворкингСчетPayKeeper.Длина + 1);
	
	ДокументДолгНомер = НомерСчета_П;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КоворкингСчета.Ссылка КАК Ссылка,
	                      |	КоворкингСчета.СчетГУИД КАК СчетГУИД,
	                      |	ВЫБОР
	                      |		КОГДА КоворкингСчета.ОплачиваетСчет = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
	                      |			ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
	                      |		ИНАЧЕ КоворкингСчета.ОплачиваетСчет
	                      |	КОНЕЦ КАК Контрагент
	                      |ИЗ
	                      |	Документ.КоворкингСчета КАК КоворкингСчета
	                      |ГДЕ
	                      |	КоворкингСчета.ПометкаУдаления = ЛОЖЬ
	                      |	И КоворкингСчета.Номер = &НомерДокумента");
	
	ДлинаНомера = Метаданные.Документы.ЗаявкаНаБронирование.ДлинаНомера;
	КоличествоПовторов = ДлинаНомера - СтрДлина(ДокументДолгНомер);
	СтрокаИз_0 = СтрСоединить(новый массив(КоличествоПовторов + 1), "0");  
	
	ДокументДолгНомер_П = СтрокаИз_0 + ДокументДолгНомер;
	
	Запрос.УстановитьПараметр("НомерДокумента", ДокументДолгНомер_П);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда Возврат; КонецЕсли;
	
	ДокументДолг = Выборка.Ссылка;
	СчетГУИД = Выборка.СчетГУИД;
	Контрагент = Выборка.Контрагент;
	
ИначеЕсли Лев(НомерСчета, ИмяГрупповойСчетPayKeeper.Длина)  = ИмяГрупповойСчетPayKeeper.Имя	Тогда
	НомерСчета_П = Сред(НомерСчета, ИмяГрупповойСчетPayKeeper.Длина + 1);
	
	ДокументДолгНомер = НомерСчета_П;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ГрупповыеСчета.Ссылка КАК Ссылка,
	                      |	ГрупповыеСчета.Контрагент КАК Контрагент,
	                      |	ГрупповыеСчета.СчетГУИД КАК СчетГУИД
	                      |ИЗ
	                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета
	                      |ГДЕ
	                      |	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
	                      |	И ГрупповыеСчета.Номер = &НомерДокумента");
	
	ДлинаНомера = Метаданные.Документы.ЗаявкаНаБронирование.ДлинаНомера;
	КоличествоПовторов = ДлинаНомера - СтрДлина(ДокументДолгНомер);
	СтрокаИз_0 = СтрСоединить(новый массив(КоличествоПовторов + 1), "0");  
	
	ДокументДолгНомер_П = СтрокаИз_0 + ДокументДолгНомер;
	
	Запрос.УстановитьПараметр("НомерДокумента", ДокументДолгНомер_П);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда Возврат; КонецЕсли;
	
	ДокументДолг = Выборка.Ссылка;
	СчетГУИД = Выборка.СчетГУИД;
	Контрагент = Выборка.Контрагент;
Иначе	
	Возврат;
КонецЕсли;

ПолучательПлатежаБезнал = Константы.ПолучательПлатежаБезнал.Получить();
Запись.ПолучательПлатежа = ПолучательПлатежаБезнал;

ИмяРеквизитаСумма = ИмяРеквизитаСумма(ПолучательПлатежаБезнал);
Запись[ИмяРеквизитаСумма] = Запись.Сумма;

НачатьТранзакцию();

Запись.Записать();

ПК_ЭквайрингЗаполнитьДокументДолгДокументОплаты(ДокументДолг, СчетГУИД, Контрагент
	, ДатаПлатежа, ГУИДЗагрузка	, СуммаОплаты);
	
//ОтменитьТранзакцию();	
ЗафиксироватьТранзакцию();	
КонецПроцедуры


Функция ИмяРеквизитаСумма(ПолучательПлатежа)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	БезналНастройки.ИмяРеквизитаДанные КАК ИмяРеквизитаДанные
                      |ИЗ
                      |	РегистрСведений.БезналНастройки КАК БезналНастройки
                      |ГДЕ
                      |	БезналНастройки.ПолучательПлатежа = &ПолучательПлатежа");

Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);  

Выборка = Запрос.Выполнить().Выбрать();
Если НЕ Выборка.Следующий() Тогда Возврат Неопределено; КонецЕсли;

Возврат Выборка.ИмяРеквизитаДанные;         
КонецФункции	

Функция ПК_ЭквайрингЗаполнитьДокументДолгДокументОплаты(ДокументДолг, СчетГУИД, Контрагент
	, ДатаПлатежа, ГУИДЗагрузка, СуммаРаспределено) Экспорт
		
// + Выписка
ВыпискаОбъект = Документы.ВыпискаБанка.СоздатьДокумент();	
ВыпискаОбъект.Дата = ТекущаяДата();
ВыпискаОбъект.Приход = Истина;

ВыпискаОбъект.ДатаОплаты = ДатаПлатежа;

ВыпискаОбъект.ОтКого = Контрагент;

ВыпискаОбъект.Сумма = СуммаРаспределено;

ВыпискаОбъект.ТекстПлатежа = "Эквайринг. ";
ВыпискаОбъект.ЭтоЭквайринг = Истина;

ВыпискаОбъект.ГУИДЗагрузка = ГУИДЗагрузка;

ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
// -Выписка

ДокументОплаты = ВыпискаОбъект.Ссылка;

ПК_ЗаполнитьДокументДолгДокументОплаты(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено);

Возврат ДокументОплаты;
КонецФункции

Функция ПК_ЗаполнитьДокументДолгДокументОплаты(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено)
//ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено, Ложь);

ДокументДолгОбъект = ДокументДолг.ПолучитьОбъект(); 
Если ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	
	СчетаДетальноОплаты = ДокументДолгОбъект.СчетаДетальноОплаты;
		
	НоваяОплата = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(СчетаДетальноОплаты, ДокументОплаты, Ложь);
	
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
	СчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

	РаспределениеОплатДолги = ДокументДолгОбъект.РаспределениеОплатДолги;
	
	// + Аудит
	СуммаРаспределено_П = СуммаРаспределено;
	// - Аудит
	
	ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(НоваяОплата, СуммаРаспределено
		,СчетаДетальноДолги, РаспределениеОплатДолги);

	ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	// + Аудит
	//ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено, Истина);
	ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено_П, Истина);
	// - Аудит
	
ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	
	ГрупповойСчетСервер.ДобавитьИЗаписатьДокументОплатыВГрупповойСчетОбъект(ДокументОплаты, ДокументДолгОбъект
		, СуммаРаспределено);	
	ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаРаспределено, Истина);
	
ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.КоворкингСчета") Тогда
	
	ДокументыОплаты = ДокументДолгОбъект.ДокументыОплаты;
	
	ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);	
	НайденныеСтроки = ДокументыОплаты.НайтиСтроки(ОтборСтроки);

	Если НайденныеСтроки.Количество() = 0 Тогда 
		СтрокаОплаты = ДокументыОплаты.Добавить();	
		СтрокаОплаты.ДокументОплаты = ДокументОплаты; 
	Иначе
		СтрокаОплаты = НайденныеСтроки[0];
	КонецЕсли;
	
	СтрокаОплаты.СуммаРаспределено = СуммаРаспределено;
	
	КоворкингСервер.ОбновитьОплатыКоворкинг(ДокументДолгОбъект);
	
	ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЕсли;
КонецФункции
//

//
//Функция ОтправитьВPayKeeperДолг(СтрокаДанные, ОбъектДанные, УникальныйИдентификатор
//			, EmailОтправить, ТелефонОтправить, ЭкранОтправить) Экспорт
Функция ОтправитьВPayKeeperДолг(ОбъектДанные, СчетГУИД, УникальныйИдентификатор
			, EmailОтправить, ТелефонОтправить, ЭкранОтправить) Экспорт
Результат = Новый Структура("ИД_Платежа, Ошибка, КодОшибки, ОписаниеОшибки", 0, Ложь, 0, "");		

Если НЕ (EmailОтправить ИЛИ ТелефонОтправить ИЛИ ЭкранОтправить) Тогда
	Результат.Ошибка = Истина;
	
	Возврат Результат;
КонецЕсли;

//
Счет = Счет(ОбъектДанные, СчетГУИД);

Контрагент = Контрагент(ОбъектДанные, Счет);
Если Контрагент = Неопределено Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 1;
	Результат.ОписаниеОшибки = "Контрагент - Неопределено
		|
		|Платеж по Pay Keeper ОТМЕНЯЕТСЯ ...";
	
	Возврат Результат;
КонецЕсли;

ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Контрагент);
Если ЮрЛицо Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 1;
	Результат.ОписаниеОшибки = "Контрагент - Юр. лицо
		|
		|Платеж по Pay Keeper ЗАПРЕЩЕН ...";
	
	Возврат Результат;
КонецЕсли;	

Email = Контрагент.ЭлПочта;
Email = СокрЛП(Email);

КлиентТелефон = Контрагент.Телефон;

Если ТелефонОтправить Тогда
	Ответ = СлужебныеКлиентСервер.ПроверкаНомераТелефона(КлиентТелефон); 

	Если Ответ.КодОшибки = -1 И ТелефонОтправить Тогда
		Результат.Ошибка = Истина;
		Результат.КодОшибки = 1;
		Результат.ОписаниеОшибки = "ОТПРАВКА ПЛАТЕЖА
								|
								|Некорректный номер телефона у клиента: " + КлиентТелефон
			+ Символы.ПС + Символы.ПС + "ОТПРАВКА ПЛАТЕЖА НЕВОЗМОЖНА !";
		
		Возврат Результат;
	КонецЕсли;

	Телефон = Ответ.ТелефонНомер;
Иначе
	Телефон = "";
КонецЕсли;

Если (НЕ ЗначениеЗаполнено(Телефон)) И ТелефонОтправить Тогда
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 1;
	Результат.ОписаниеОшибки = "У контрагента отсутствует телефон"
			+ Символы.ПС + Символы.ПС + "ОТПРАВКА ПЛАТЕЖА НЕВОЗМОЖНА !";
	
	Возврат Результат;
КонецЕсли;

Если (НЕ ЗначениеЗаполнено(Email)) И EmailОтправить Тогда
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 1;
	Результат.ОписаниеОшибки = "У контрагента отсутствует Email"
			+ Символы.ПС + Символы.ПС + "ОТПРАВКА ПЛАТЕЖА НЕВОЗМОЖНА !";
	
	Возврат Результат;
КонецЕсли;

Ответ = НомерСчета(ОбъектДанные, Счет);
Если Ответ = Неопределено Тогда Возврат Результат; КонецЕсли;
НомерСчета = Ответ.НомерСчета;
НомерСчетаПочта = Ответ.НомерСчетаПочта;
НомерСчетаPayKeeper = Ответ.НомерСчетаPayKeeper;

Если ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	////
	//ОтборСтроки = Новый Структура("НомерСчета", НомерСчета); 
	//НайденныеСтроки = ОбъектДанные.Счета.НайтиСтроки(ОтборСтроки);
	//Если НайденныеСтроки.Количество() = 0 Тогда
	//	Сообщить("ПРОГРАММНАЯ ОШИБКА. Не найден счет: " + Строка(НомерСчета) 
	//		+ " Заявки " + ОбъектДанные.Ссылка);

	//	Возврат Результат;
	//КонецЕсли;
	//
	//Счет = НайденныеСтроки[0];
	//
	Если Счет.ТолькоПроживание Тогда
		НаименованиеУслуги = "Проживание";
	ИначеЕсли Счет.ТолькоУслуги Тогда
		НаименованиеУслуги = "Услуги";
	Иначе
		НаименованиеУслуги = "Проживание и услуги";
	КонецЕсли;
	//
	
	Помещение = ОбъектДанные.НомерВРезерв.Наименование;
		
ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда

	НаименованиеУслуги = "Услуга Коворкинг";
	
	Помещение = ОбъектДанные.КоворкингЗаявка.КоворкингНомер.Наименование;
	
ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	НаименованиеУслуги = "Проживание группы";
	
	Помещение = "";
Иначе
	Сообщить("ПРОГРАММНАЯ ОШИБКА. Неверный тип документа к оплате: " + ТипЗнч(ОбъектДанные.Ссылка)); 
	
	Возврат Результат;	
КонецЕсли;


//
//Email = "psn.invina@gmail.com";   
//Телефон = "+79826236241";

СоединениеPayKeeper = PayKeeperКлиентСервер.ПолучитьСоединениеPayKeeper();
Если СоединениеPayKeeper = Неопределено Тогда
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -1;
	Результат.ОписаниеОшибки = "Не определены данные соединения Pay Keeper"; 
	
	Возврат Результат;          
КонецЕсли;

Если СоединениеPayKeeper.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -1;
	Результат.ОписаниеОшибки = "Ошибка получения соединения с PayKeeper: " + СоединениеPayKeeper.Описание;
	
	Возврат Результат; 
КонецЕсли;


//Плательщик = Контрагент.Наименование;
Плательщик = ".";

EmailОтсылкиЧека = Email;
ТелефонОтсылкиСМСУведомления = Телефон;

Если ТелефонОтсылкиСМСУведомления = "" Тогда
	Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();	
	ТелефонУведомленияPayKeeper = Организация.ТелефонУведомленияPayKeeper;
	
	Ответ = СлужебныеКлиентСервер.ПроверкаНомераТелефона(ТелефонУведомленияPayKeeper); 

	Если Ответ.КодОшибки = -1 Тогда
		Результат.Ошибка = Истина;
		Результат.КодОшибки = 1;
		Результат.ОписаниеОшибки = "ОТПРАВКА ПЛАТЕЖА
								|
								|Некорректный номер телефона у отеля (организации): " + ТелефонУведомленияPayKeeper
			+ Символы.ПС + Символы.ПС + "ОТПРАВКА ПЛАТЕЖА НЕВОЗМОЖНА !";
		
		Возврат Результат;
	КонецЕсли;

	
	ТелефонОтсылкиСМСУведомления = Ответ.ТелефонНомер;
КонецЕсли;

Если ТелефонОтсылкиСМСУведомления = "" И  EmailОтсылкиЧека = "" Тогда
		Результат.Ошибка = Истина;
		Результат.КодОшибки = 100;
		Результат.ОписаниеОшибки = "Email отсылки чека - пусто." + Символы.ПС + "Телефон отсылки уведомления - пусто."; 		
		
		Возврат Результат; 
КонецЕсли;

//СуммаПлатежа = СтрокаДанные.СуммаПлатежа;

Если ЗначениеЗаполнено(EmailОтсылкиЧека) Тогда
	Попытка 
		PayKeeper.ПроверитьПараметр("PayKeeperСервер.ОтправитьВPayKeeperДолг", "EmailОтсылкиЧека", EmailОтсылкиЧека
			, Тип("Строка"),, "^[a-zA-Z0-9.!#$%&’*+/=?^_`{|}~-]+@[a-zA-Z0-9-]+(?:\.[a-zA-Z0-9-]+)*$");

	Исключение
		Результат.Ошибка = Истина;
		Результат.КодОшибки = 100;
		Результат.ОписаниеОшибки = "Некорректный Email. "; // + ОписаниеОшибки(); 		
		
		Возврат Результат; 
	КонецПопытки;
КонецЕсли;               

//none - нет НДС
//vat5 - НДС 5%
//vat20 - НДС 20%

//vat22 - НДС 22%

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;

Позиции = Новый Массив;
Если ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда 
	СтавкаНДС = ДокументыСервер.СтавкаНДС(Истина); 
	ДатаУчетаНДС = ОбъектДанные.ДатаПо;
	СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);	

	СуммыКОплатеКоворкинг = СуммыКОплатеКоворкинг(ОбъектДанные);
	
	Если СуммыКОплатеКоворкинг.СуммаКЗакрытию <= 0 Тогда 
		Результат.Ошибка = Истина;
		Результат.КодОшибки = 100;
		Результат.ОписаниеОшибки = "Нечего отправлять. "; // + ОписаниеОшибки(); 		
		
		Возврат Результат; 	
	КонецЕсли;
	                  
	//ТекстНДС = "Услуги коворкинг";
	//Позиция = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax"
	//			, "service", "prepay", ТекстНДС, СуммаПлатежа, 1, СуммаПлатежа, СтавкаНДСPayKeeper(СтавкаНДС));
	Если СуммыКОплатеКоворкинг.СуммаКЗакрытиюКоворкинг <> 0 Тогда
		ТекстНДС = "Услуги коворкинг";
		Позиция = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax"
					, "service", "full", ТекстНДС, СуммыКОплатеКоворкинг.СуммаКЗакрытиюКоворкинг, 1
					, СуммыКОплатеКоворкинг.СуммаКЗакрытиюКоворкинг, СтавкаНДСPayKeeper(СтавкаНДС));
		Позиции.Добавить(Позиция);			
	КонецЕсли;		
	Если СуммыКОплатеКоворкинг.СуммаКЗакрытиюДопУслуги <> 0 Тогда
		ТекстНДС = "Доп. услуги коворкинг";
		Позиция = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax"
					, "service", "full", ТекстНДС, СуммыКОплатеКоворкинг.СуммаКЗакрытиюДопУслуги, 1
					, СуммыКОплатеКоворкинг.СуммаКЗакрытиюДопУслуги, СтавкаНДСPayKeeper(СтавкаНДС));
					
		Позиции.Добавить(Позиция);			
	КонецЕсли;		
ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда 	
	ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(ОбъектДанные);
	
	СтавкаНДС = ДокументыСервер.СтавкаНДС(Ложь);
	СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);	
	
	СуммыКОплатеГрупповойСчетНДС = СуммыКОплатеГрупповойСчетНДС(ОбъектДанные);	
	Если СуммыКОплатеГрупповойСчетНДС.Итог("СуммаКЗакрытию") <= 0 Тогда 
		Результат.Ошибка = Истина;
		Результат.КодОшибки = 100;
		Результат.ОписаниеОшибки = "Нечего отправлять. "; // + ОписаниеОшибки(); 		
		
		Возврат Результат; 	
	КонецЕсли;
	
	Если ВсеСНДС Тогда 
		Для Каждого Строка Из СуммыКОплатеГрупповойСчетНДС Цикл 
			Если Строка.ЕстьНДС Тогда  
				ТекстНДС = "Доп. услуги гостиницы";
				Позиция = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax"
						, "service", "full", ТекстНДС, Строка.СуммаКЗакрытию, 1, Строка.СуммаКЗакрытию, СтавкаНДСPayKeeper(СтавкаНДС));
			Иначе
				ТекстНДС = "Услуги гостиницы";
				Позиция = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax"
						, "service", "full", ТекстНДС, Строка.СуммаКЗакрытию, 1, Строка.СуммаКЗакрытию, СтавкаНДСPayKeeper(СтавкаНДС));
			КонецЕсли;			
			Позиции.Добавить(Позиция);			
		КонецЦикла;		
	Иначе		
		
		Для Каждого Строка Из СуммыКОплатеГрупповойСчетНДС Цикл 
			Если Строка.ЕстьНДС Тогда  
				ТекстНДС = "Доп. услуги гостиницы";
				Позиция = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax"
						, "service", "full", ТекстНДС, Строка.СуммаКЗакрытию, 1, Строка.СуммаКЗакрытию, СтавкаНДСPayKeeper(СтавкаНДС));
			Иначе
				Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС 
				ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка()
				Тогда
					СтавкаНДС_П = СтавкаНДС;
					СтавкаНДС_П = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС_П, ДатаУчетаНДС);	
				Иначе
					СтавкаНДС_П = Перечисления.СтавкиНДС.НДС0;
				КонецЕсли;
				
				ТекстНДС = "Услуги гостиницы";
				Позиция = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax"
						, "service", "full", ТекстНДС, Строка.СуммаКЗакрытию, 1, Строка.СуммаКЗакрытию, СтавкаНДСPayKeeper(СтавкаНДС_П));
			КонецЕсли;			
			Позиции.Добавить(Позиция);			
		КонецЦикла;
	КонецЕсли;		
Иначе
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
	СтрокиСчета = ОбъектДанные.СчетаДетальноДолги.Выгрузить(ОтборСтроки);

	СтрокиСчета.Свернуть("ЕстьНДС", "СуммаДолг");
	
	ДатаУчетаНДС = ОбъектДанные.РезервПо;
	СтавкаНДС = ДокументыСервер.СтавкаНДС(Ложь);
	СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);	
	
	Для Каждого Строка Из СтрокиСчета Цикл
		Если Строка.ЕстьНДС Тогда  
			ТекстНДС = "Доп. услуги гостиницы";
			Позиция = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax"
					, "service", "full", ТекстНДС, Строка.СуммаДолг, 1, Строка.СуммаДолг, СтавкаНДСPayKeeper(СтавкаНДС));
		Иначе
			Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС 
			ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка()
			Тогда
				СтавкаНДС_П = СтавкаНДС;
				СтавкаНДС_П = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС_П, ДатаУчетаНДС);	
			Иначе
				СтавкаНДС_П = Перечисления.СтавкиНДС.НДС0;
			КонецЕсли;
			
			ТекстНДС = "Услуги гостиницы";
			Позиция = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax"
					, "service", "full", ТекстНДС, Строка.СуммаДолг, 1, Строка.СуммаДолг, СтавкаНДСPayKeeper(СтавкаНДС_П));
		КонецЕсли;			
		Позиции.Добавить(Позиция);	
	КонецЦикла;
КонецЕсли;

Ответ = PayKeeper.ПолучитьQRКод(СоединениеPayKeeper, Плательщик, НомерСчетаPayKeeper, НаименованиеУслуги, Неопределено
	, EmailОтсылкиЧека, ТелефонОтсылкиСМСУведомления, Позиции); 	
Если Ответ.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -1;
	Результат.ОписаниеОшибки = "Ошибка получения ИД платежа PayKeeper: " + Ответ.Описание;
	
	Возврат Результат; 
КонецЕсли;

ИД_Платежа = Ответ.ИдПлатежа;
АдресКартинки = Ответ.АдресКартинки;

ДанныеКартинкиBase64 = Ответ.ДанныеКартинкиBase64; 
ДвоичныеДанныеКартинки = Base64Значение(ДанныеКартинкиBase64);

//КартинкаИмяФайла = ПолучитьИмяВременногоФайла("jpg");

ПутьQR_Код = Константы.ПутьQR_Код.Получить();
Если ЗначениеЗаполнено(ПутьQR_Код) Тогда
	ПутьКартинка = ПутьQR_Код;
Иначе
	ПутьКартинка = Константы.Папка_C_BASE.Получить();
КонецЕсли;
КартинкаИмяФайла = ПутьКартинка + "QR_Picture.jpg";

ДвоичныеДанныеКартинки.Записать(КартинкаИмяФайла);

QR_Картинка = ПоместитьВоВременноеХранилище(Новый Картинка(ДвоичныеДанныеКартинки), УникальныйИдентификатор);

Если ЭкранОтправить Тогда
	ФайлКартинки = КартинкаИмяФайла;
	ОбменКартинкаСервер.ВыгрузитьКартинку(ФайлКартинки);
КонецЕсли;

СуммаПлатежа = 0;
Для Каждого Строка Из Позиции Цикл 
	СуммаПлатежа = СуммаПлатежа + Строка.sum;
КонецЦикла;

Если ЗначениеЗаполнено(Email) И EmailОтправить Тогда
	ТекстСообщения = "Счет " + НомерСчетаПочта + Символы.ПС;
	
	Если ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
		ТабДок = ПечатьСервер.ТабличныйДокументСчет(ОбъектДанные.Ссылка, Счет);
		
		ТекстСообщения = ТекстСообщения + "Номер: " + Помещение 
			+ ", дата заезда: " + Формат(ОбъектДанные.РезервС, "ДФ=dd.MM.yy") 
			+ ", дата выезда: " + Формат(ОбъектДанные.РезервПо, "ДФ=dd.MM.yy")
			+ ", сумма платежа: " + Строка(СуммаПлатежа) + ".";
	
	ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда
		ТабДок = КоворкингПечатьСервер.ТабличныйДокументСчетКоворкинг(ОбъектДанные.Ссылка);
		
		ТекстСообщения = ТекстСообщения + "Помещение: " + Помещение;
		Если ОбъектДанные.ПочасоваяОплата Тогда
			ТекстСообщения = ТекстСообщения
			+ ", дата " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") 
			+ ", начало " + Строка(ОбъектДанные.ЧасС)
			+ ", окончание: " + Строка(ОбъектДанные.ЧасПо);
		Иначе	
			ТекстСообщения = ТекстСообщения
			+ ", дата начала: " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") 
			+ ", дата окончания: " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy");
		КонецЕсли;
		ТекстСообщения = ТекстСообщения
		+ ", сумма платежа: " + Строка(СуммаПлатежа) + ".";
		
	ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
		ТабДок = ПечатьСервер.ПечатьГрупповогоСчета(ОбъектДанные);	
		
		ТекстСообщения = ТекстСообщения
			//+ ", дата с: " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") 
			//+ ", дата по: " + Формат(ОбъектДанные.ДатаПо, "ДФ=dd.MM.yy")
			//+ ", сумма платежа: " + Строка(СуммаПлатежа) + ".";
			+ "Сумма платежа: " + Строка(СуммаПлатежа) + ".";
	Иначе
		//Сообщить("ПРОГРАММНАЯ ОШИБКА. Неверный тип документа к оплате: " + ТипЗнч(ОбъектДанные.Ссылка)); 
		Результат.Ошибка = Истина;
		Результат.КодОшибки = -1;
		Результат.ОписаниеОшибки = "ПРОГРАММНАЯ ОШИБКА. Неверный тип документа к оплате: " + ТипЗнч(ОбъектДанные.Ссылка);
		
		Возврат Результат;	
	КонецЕсли;
//
	Если ТабДок = Неопределено Тогда
		Результат.Ошибка = Истина;
		Результат.КодОшибки = 1;
		Результат.ОписаниеОшибки = "Ошибка формирование файла счета
		|
		|ОТПРАВКА ПЛАТЕЖА ОТМЕНЯЕТСЯ !";

		Возврат Результат;
	КонецЕсли;

	Тема = "Счет на оплату " + НомерСчетаПочта;
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + Символы.ПС;  
	ТекстСообщения = ТекстСообщения + "Ссылка на оплату: " + АдресКартинки;

	СписокЗначенийФайлов = Новый СписокЗначений;
	//КартинкаИмяФайла = ПолучитьИмяВременногоФайла("jpg");
	//ДвоичныеДанныеКартинки.Записать(КартинкаИмяФайла);
	СписокЗначенийФайлов.Добавить(КартинкаИмяФайла);
	
	СчетФайл = ПолучитьИмяВременногоФайла("PDF");
	ТабДок.Записать(СчетФайл, ТипФайлаТабличногоДокумента.PDF);
	СписокЗначенийФайлов.Добавить(СчетФайл);
	
	СписокЗначенийПолучатели = Новый СписокЗначений;
	
	EmailПолучателя = Email;
	СписокЗначенийПолучатели.Добавить(EmailПолучателя);

	СлужебныеСервер.ОтправитьМейлом(Тема, СписокЗначенийФайлов, СписокЗначенийПолучатели, ТекстСообщения);
	
	СлужебныеСервер.УдалитьВременныеФайлыПочты(СписокЗначенийФайлов);
КонецЕсли;
	
Если ЗначениеЗаполнено(Телефон) И ТелефонОтправить Тогда 
	
	//СообщенияЧерезGREЕN_WhatsApp = Константы.СообщенияЧерезGREЕN_WhatsApp.Получить();
	МесенджерВключен = МесенджерСервер.МесенджерВключен();
	
	//Если НЕ (СообщенияЧерезGREЕN) Тогда Перейти ~СМС; КонецЕсли;
	//Если НЕ (СообщенияЧерезGREЕN_WhatsApp) Тогда Перейти ~СМС; КонецЕсли;
	Если НЕ (МесенджерВключен) Тогда Перейти ~СМС; КонецЕсли;
	
	ТекстСообщения = "Счет " + НомерСчетаПочта + Символы.ПС; 
	
	Если ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда 
		ТекстСообщения = ТекстСообщения + "Номер: " + Помещение + Символы.ПС  
			+ "Дата заезда: " + Формат(ОбъектДанные.РезервС, "ДФ=dd.MM.yy") + Символы.ПС
			+ "Дата выезда: " + Формат(ОбъектДанные.РезервПо, "ДФ=dd.MM.yy") + Символы.ПС 
			+ "Сумма платежа: " + Строка(СуммаПлатежа) + ".";
		
	ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда 	
		ТекстСообщения = ТекстСообщения + "Помещение: " + Помещение + Символы.ПС;  
		Если ОбъектДанные.ПочасоваяОплата Тогда
			ТекстСообщения = ТекстСообщения
			+ "Дата " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") + Символы.ПС 
			+ "Начало " + Строка(ОбъектДанные.ЧасС) + Символы.ПС
			+ "Окончание: " + Строка(ОбъектДанные.ЧасПо) + Символы.ПС;
		Иначе	
			ТекстСообщения = ТекстСообщения
			+ "Дата начала: " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") + Символы.ПС
			+ "Дата окончания: " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") + Символы.ПС;
		КонецЕсли;
		ТекстСообщения = ТекстСообщения
		+ "Сумма платежа: " + Строка(СуммаПлатежа) + ".";
			
	ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда 
		ТекстСообщения = ТекстСообщения  
			//+ "Дата С: " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") + Символы.ПС
			//+ "Дата По: " + Формат(ОбъектДанные.ДатаПо, "ДФ=dd.MM.yy") + Символы.ПС 
			+ "Сумма платежа: " + Строка(СуммаПлатежа) + ".";
		
	Иначе
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = "Неверный тип документа к оплате: " + ТипЗнч(ОбъектДанные.Ссылка);
		
		Возврат Результат;	
	КонецЕсли;
	
	//ТекстСообщения = ТекстСообщения + Символы.ПС + Символы.ПС;  
	//ТекстСообщения = ТекстСообщения + "Ссылка на оплату: " + АдресКартинки;

	//Ответ = СлужебныеСервер.ОтправитьWhatsApp(Телефон, ТекстСообщения);
	Ответ = МесенджерСервер.ОтправитьДанные_Месенджер("ОтправитьТекст", Телефон, ТекстСообщения, Неопределено, Неопределено);
	
	Если Ответ.Ошибка Тогда 
		Результат.Ошибка = Истина;
		Результат.КодОшибки = -2;
		Результат.ОписаниеОшибки = "Ошибка отправки текста сообщения в Месенджеры : " + Ответ.Описание;
			
		Перейти ~СМС; 
	КонецЕсли;
	
	СсылкаНаОплату = АдресКартинки;  
	Ответ = МесенджерСервер.ОтправитьДанные_Месенджер("ОтправитьСсылка", Телефон, "", Неопределено, СсылкаНаОплату);
	
	Если Ответ.Ошибка Тогда 
		Результат.Ошибка = Истина;
		Результат.КодОшибки = -2;
		Результат.ОписаниеОшибки = "Ошибка отправки ссылки на платеж в Месенджеры: " + Ответ.Описание;
			
		Перейти ~СМС; 
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("jpg");
	Файл = ПолучитьИзВременногоХранилища(QR_Картинка);
	Файл.Записать(ИмяФайла); 
	Изображение = ИмяФайла;
//		Изображение = КартинкаИмяФайла;
	
	
	//Ответ = СлужебныеСервер.ОтправитьWhatsApp(Телефон, Изображение);
	Ответ = МесенджерСервер.ОтправитьДанные_Месенджер("ОтправитьФайлИТекст", Телефон, "", Изображение, Неопределено);
	Если Ответ.Ошибка Тогда 
		Результат.Ошибка = Истина;
		Результат.КодОшибки = -2;
		Результат.ОписаниеОшибки = "Ошибка отправки QR-картинки в Месенджеры: " + Ответ.Описание;
			
		Перейти ~СМС; 
	КонецЕсли;

	Результат.ИД_Платежа = Ид_Платежа;
	
	Перейти ~ОБНОВИТЬ_PayKeeper_Платежи;
КонецЕсли;

~СМС:
Если ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда 

	ТекстСообщения = "Номер: " + Помещение + Символы.ПС
		+ "Заезд: " + Формат(ОбъектДанные.РезервС, "ДФ=dd.MM.yy") + Символы.ПС 
		+ "Выезд: " +Формат(ОбъектДанные.РезервПо, "ДФ=dd.MM.yy") + Символы.ПС 
		+ "Сумма: " + Строка(СуммаПлатежа) + ".";

ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда 	
	ТекстСообщения = "Помещение: " + Помещение + Символы.ПС;
	Если ОбъектДанные.ПочасоваяОплата Тогда
		ТекстСообщения = ТекстСообщения
		+ "Дата " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") + Символы.ПС 
		+ "Начало " + Строка(ОбъектДанные.ЧасС) + Символы.ПС
		+ "Окончание: " + Строка(ОбъектДанные.ЧасПо) + Символы.ПС;
	Иначе	
		ТекстСообщения = ТекстСообщения
		+ "Начало " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") + Символы.ПС
		+ "Окончание " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") + Символы.ПС;
	КонецЕсли;
	ТекстСообщения = ТекстСообщения
	+ "Сумма: " + Строка(СуммаПлатежа) + ".";
		
ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда 

	ТекстСообщения = "" 
		//+ "Дата С: " + Формат(ОбъектДанные.ДатаС, "ДФ=dd.MM.yy") + Символы.ПС 
		//+ "Дата По: " +Формат(ОбъектДанные.ДатаПо, "ДФ=dd.MM.yy") + Символы.ПС 
		+ "Сумма: " + Строка(СуммаПлатежа) + ".";
Иначе
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -1;
	Результат.ОписаниеОшибки = "ПРОГРАММНАЯ ОШИБКА. Неверный тип документа к оплате: " + ТипЗнч(ОбъектДанные.Ссылка);
	
	Возврат Результат;	
КонецЕсли;

ТекстСообщения = ТекстСообщения + Символы.ПС + Символы.ПС;  
ТекстСообщения = ТекстСообщения + "Ссылка на оплату: " + АдресКартинки;

СлужебныеСервер.ОтправитьBytehand(Телефон, ТекстСообщения);

Результат.ИД_Платежа = ИД_Платежа;
Перейти ~ОБНОВИТЬ_PayKeeper_Платежи;
//Возврат Результат;

~ОБНОВИТЬ_PayKeeper_Платежи:
ДатаСоздания = ТекущаяДата();
ДатаОплаты = Неопределено;

СтрокаОбновить = Новый Структура;
СтрокаОбновить.Вставить("ИД_Платежа", ИД_Платежа);
СтрокаОбновить.Вставить("Плательщик", Плательщик);
СтрокаОбновить.Вставить("НомерСчета", НомерСчетаPayKeeper);
СтрокаОбновить.Вставить("СуммаПлатежа", СуммаПлатежа);
СтрокаОбновить.Вставить("Статус", "");

ОбновитьPayKeeperПлатежи(СтрокаОбновить, ДатаСоздания, ДатаОплаты);
Возврат Результат;
КонецФункции

Функция  СтавкаНДСPayKeeper(СтавкаНДС)
Если СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
	СтавкаНДСPayKeeper = "vat0";
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
	СтавкаНДСPayKeeper = "vat5";
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
	СтавкаНДСPayKeeper = "vat20";
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
	СтавкаНДСPayKeeper = "vat22";
Иначе
	СтавкаНДСPayKeeper = "none";
КонецЕсли;

Возврат СтавкаНДСPayKeeper;
КонецФункции

Функция Счет(ОбъектДанные, СчетГУИД) 
Если ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
	НайденныеСтроки = ОбъектДанные.Счета.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда 
		Счет =  Неопределено;
	Иначе
		Счет = НайденныеСтроки[0];
	КонецЕсли;
Иначе
	Счет =  Неопределено;
КонецЕсли;

Возврат Счет;
КонецФункции

Функция Контрагент(ОбъектДанные, Счет) Экспорт
Если ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда
	Если ЗначениеЗаполнено(ОбъектДанные.ОплачиваетСчет) Тогда
		Контрагент = ОбъектДанные.ОплачиваетСчет;
	Иначе		
		Контрагент = ОбъектДанные.КоворкингЗаявка.Клиент;
	КонецЕсли;
ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	Контрагент = ОбъектДанные.Контрагент;
ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	Если Счет =  Неопределено Тогда
		Контрагент =  Неопределено;
	Иначе
		Контрагент = Счет.Контрагент;
	КонецЕсли;
Иначе
	Контрагент =  Неопределено;
КонецЕсли;

Возврат Контрагент;
КонецФункции

Функция СуммыКОплатеКоворкинг(ОбъектДанные) 
СуммаКЗакрытиюДопУслуги = СуммаКЗакрытиюДопУслугиКоворкинг(ОбъектДанные);
СуммаКЗакрытиюКоворкинг = ОбъектДанные.Сумма - ОбъектДанные.СуммаОплачено;
СуммаКЗакрытию = СуммаКЗакрытиюКоворкинг + СуммаКЗакрытиюДопУслуги;

СтрокаДанные = Новый Структура("СуммаКЗакрытиюКоворкинг, СуммаКЗакрытиюДопУслуги, СуммаКЗакрытию"
	, СуммаКЗакрытиюКоворкинг, СуммаКЗакрытиюДопУслуги, СуммаКЗакрытию);
	
Возврат СтрокаДанные;
КонецФункции

Функция СуммаКЗакрытиюДопУслугиКоворкинг(ОбъектДанные)
СуммаКЗакрытиюДопУслуги = 0;	

Для Каждого Строка Из ОбъектДанные.ДопУслугиКоворкинг Цикл
	СуммаКЗакрытиюДопУслуги = СуммаКЗакрытиюДопУслуги + Строка.Сумма - Строка.СуммаОплачено;		
КонецЦикла;		
	
Возврат СуммаКЗакрытиюДопУслуги;	
КонецФункции

Функция СуммыКОплатеГрупповойСчетНДС(ДокументДолгОбъектДанные) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкиДолги.ЕстьНДС КАК ЕстьНДС,
                      |	ЕСТЬNULL(СУММА(ЗаявкиДолги.СуммаКЗакрытию), 0) КАК СуммаКЗакрытию
                      |ИЗ
                      |	Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС КАК ЕстьНДС,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.ЕстьНДС) КАК ЗаявкиДолги
                      |		ПО ГрупповыеСчетаДокументыДолги.ДокументДолг = ЗаявкиДолги.Ссылка
                      |			И ГрупповыеСчетаДокументыДолги.СчетГУИД = ЗаявкиДолги.СчетГУИД
                      |ГДЕ
                      |	ГрупповыеСчетаДокументыДолги.Ссылка = &ДокументДолг
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЗаявкиДолги.ЕстьНДС");

Запрос.УстановитьПараметр("ДокументДолг", ДокументДолгОбъектДанные.Ссылка); 

ТЗ = Запрос.Выполнить().Выгрузить();

Возврат ТЗ;
КонецФункции


Функция НомерСчета(ОбъектДанные, Счет) Экспорт
НомерСчета = 0;
Если ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда
	
	НомерСчета_П = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(ОбъектДанные.Номер);
	НомерСчетаПочта = НомерСчета_П;
	
	Ответ = PayKeeperКлиентСервер.ИмяКоворкингСчетPayKeeper();
	ИмяЗаявкаСчетPayKeeper = Ответ.Имя;
	НомерСчетаPayKeeper = ИмяЗаявкаСчетPayKeeper + НомерСчета_П;
	
ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	
	НомерСчета_П = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(ОбъектДанные.Номер);
	НомерСчетаПочта = НомерСчета_П;
	
	Ответ = PayKeeperКлиентСервер.ИмяГрупповойСчетPayKeeper();
	ИмяЗаявкаСчетPayKeeper = Ответ.Имя;
	НомерСчетаPayKeeper = ИмяЗаявкаСчетPayKeeper + НомерСчета_П;
	
ИначеЕсли ТипЗнч(ОбъектДанные.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	НомерСчета = Счет.НомерСчета;

	НомерСчета_П = ПечатьСервер.НомерСчетаДляПечати(ОбъектДанные.Номер, НомерСчета);
	НомерСчетаПочта = НомерСчета_П;
	
	Ответ = PayKeeperКлиентСервер.ИмяЗаявкаСчетPayKeeper();
	ИмяЗаявкаСчетPayKeeper = Ответ.Имя;
	НомерСчетаPayKeeper = ИмяЗаявкаСчетPayKeeper + НомерСчета_П; 
Иначе
	
	Сообщить("ПРОГРАММНАЯ ОШИБКА. Неверный тип документа к оплате: " + ТипЗнч(ОбъектДанные.Ссылка)); 
	
	Возврат Неопределено;	
КонецЕсли;

Результат = Новый Структура("НомерСчета, НомерСчетаПочта, НомерСчетаPayKeeper"
	, НомерСчета, НомерСчетаПочта, НомерСчетаPayKeeper);
Возврат Результат;
КонецФункции
//


