
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если НЕ Параметры.Свойство("ОтКого") Тогда Отказ = Истина; Возврат; КонецЕсли;	

ЭтаФорма.ТолькоПросмотр = Истина;

ОтКого = Параметры.ОтКого;

Адрес_ТЗ = Параметры.ПрошлыйПериодДопУслуги;
ТЗ = ПолучитьИзВременногоХранилища(Адрес_ТЗ);  
ТЗ.Свернуть("ПрочиеОплатыДокументОплаты, ПрочиеОплатыДокументДолг", "Сумма");

Запрос = Новый Запрос;
Запрос.Текст = ЗаявкаСервер.ПрошлыйПериодДопУслуги_ТекстЗапроса();
Запрос.Текст = Запрос.Текст + "
                      |	И ПрочиеОплаты.ОтКого = &ОтКого
                      |	И ЕСТЬNULL(Долги.Сумма, 0) - ЕСТЬNULL(Закрыто.СуммаЗакрыто, 0) - ЕСТЬNULL(ТЗ.Сумма, 0) > 0
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаДолга";

Запрос.УстановитьПараметр("ОтКого", ОтКого);
Запрос.УстановитьПараметр("ТЗ", ТЗ);

ТЗ_1 = Запрос.Выполнить().Выгрузить();

ТЗ_Список.Очистить();

Для Каждого Строка Из ТЗ_1 Цикл
	НоваяСтрока = ТЗ_Список.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТЗ_СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Элемент.ТекущиеДанные; 	
Если Поле.Имя = "ТЗ_СписокДокументДолг" Тогда
	 СтандартнаяОбработка = Ложь;
	 
	 ПараметрыФормы = Новый Структура("Ключ", ТД.ДокументДолг); 
	 ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	 	,,,,,);
		
	Возврат;
КонецЕсли;
	
ВернутьИЗакрыть(Элемент, ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТЗ_СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ВернутьИЗакрыть(Элемент, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьИЗакрыть(Элемент, ВыбранныеСтроки);
МассивВозврат = Новый Массив;

Для Каждого Строка Из ВыбранныеСтроки Цикл
	ТД = ТЗ_Список.НайтиПоИдентификатору(Строка);
	
	МассивВозврат.Добавить(ТД);
КонецЦикла;	

Закрыть(МассивВозврат);
КонецПроцедуры

&НаКлиенте
Процедура ТЗ_СписокПриАктивизацииСтроки(Элемент)
ДанныеСтроки = Элемент.ТекущиеДанные;
Если ДанныеСтроки = Неопределено Тогда 
	СписокДопУслуг.Параметры.УстановитьЗначениеПараметра("ДокументДолг", Неопределено);	
	СписокДопУслуг.Параметры.УстановитьЗначениеПараметра("ДокументОплаты", Неопределено);
Иначе
	СписокДопУслуг.Параметры.УстановитьЗначениеПараметра("ДокументДолг", ДанныеСтроки.ДокументДолг);	
	СписокДопУслуг.Параметры.УстановитьЗначениеПараметра("ДокументОплаты", ДанныеСтроки.ДокументОплаты);	
КонецЕсли; 
КонецПроцедуры


