

////// + Чек оплаты

//
Процедура ЧекОплаты(ДопПараметры, Форма) Экспорт
Счет = ДопПараметры.Счет;
ДопПараметры.Вставить("Форма", Форма); 

Если ДопПараметры.Свойство("ЭтоСчетКоворкинг") Тогда 
	Если ДопПараметры.ЭтоСчетКоворкинг Тогда
		ЧекОплатыДействие(ДопПараметры);		
		
		Возврат;
	КонецЕсли;
КонецЕсли;

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаСвернутьВСчете", ЭтотОбъект, ДопПараметры);
ТекстВопроса = "Свернуть в счете: " + ?(Счет.СвернутьВСчете, "Установлен", "НЕ установлен")
	+ Символы.ПС + Символы.ПС + "ПРОДОЛЖИТЬ ..."; 
ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  	
КонецПроцедуры

Процедура ЗавершениеВопросаСвернутьВСчете(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Да Тогда
	ЧекОплатыДействие(ДополнительныеПараметры);		
КонецЕсли;	
КонецПроцедуры	

Процедура ЧекОплатыДействие(ДопПараметры) Экспорт    
Если НЕ ДопПараметры.Свойство("ЭтоЧекНаАванс") Тогда 
	ДопПараметры.Вставить("ЭтоЧекНаАванс", Ложь);
КонецЕсли;

Если НЕ ДопПараметры.Свойство("ЭтоГрупповойСчет") Тогда 
	ДопПараметры.Вставить("ЭтоГрупповойСчет", Ложь);
КонецЕсли;

Если НЕ ДопПараметры.Свойство("ЭтоСчетКоворкинг") Тогда 
	ДопПараметры.Вставить("ЭтоСчетКоворкинг", Ложь);
КонецЕсли;

Если НЕ ДопПараметры.Свойство("ЭтоСчетНаОплату") Тогда 
	ДопПараметры.Вставить("ЭтоСчетНаОплату", Ложь);
КонецЕсли;

Счет = ДопПараметры.Счет;

ДокументДолгОбъектДанные = ДопПараметры.ДокументДолгОбъектДанные; 


//
Если ДопПараметры.ЭтоСчетКоворкинг Тогда
	Если ЗначениеЗаполнено(ДокументДолгОбъектДанные.ОплачиваетСчет) Тогда 
		Контрагент = ДокументДолгОбъектДанные.ОплачиваетСчет;
	Иначе
		Контрагент = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ДокументДолгОбъектДанные.КоворкингЗаявка, "Клиент"); 
	КонецЕсли;
ИначеЕсли ДопПараметры.ЭтоЧекНаАванс Тогда 
	Контрагент = ДопПараметры.Контрагент;
Иначе	
	Контрагент = Счет.Контрагент;
КонецЕсли;	

Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
	Сообщить("Контрагент (Оплачивает) - пусто. Оплата отменяется. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
	
	Возврат;
КонецЕсли;	
//

Если ДопПараметры.ЭтоСчетКоворкинг Тогда
	
	СуммаКОплате = КоворкингСервер.СуммаКОплатеКоворкинг(ДокументДолгОбъектДанные);
		
ИначеЕсли ДопПараметры.ЭтоГрупповойСчет Тогда
	СуммаКОплате = ГрупповойСчетСервер.СуммаКОплатеГрупповойСчет(ДокументДолгОбъектДанные);
	
ИначеЕсли ДопПараметры.ЭтоСчетНаОплату Тогда
	СчетаДетальноДолги = ДопПараметры.СчетаДетальноДолги;
	
	СуммаКОплате = 0;
	Для Каждого Элемент Из СчетаДетальноДолги Цикл
		СуммаКОплате = СуммаКОплате + Элемент.СуммаКЗакрытию;
	КонецЦикла;
	
Иначе
	ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД); 
	СчетаДетальноДолги = ДокументДолгОбъектДанные.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
	
	СуммаКОплате = 0;
	Для Каждого Элемент Из СчетаДетальноДолги Цикл
		СуммаКОплате = СуммаКОплате + Элемент.СуммаКЗакрытию;
	КонецЦикла;
КонецЕсли;

//Если СуммаКОплате = 0 Тогда
//	ПоказатьПредупреждение(, "Счет уже оплачен");
//	Возврат;
//КонецЕсли;

ДопПараметры.Вставить("СуммаКОплате", СуммаКОплате);

Оповещение = Новый ОписаниеОповещения("ЗавершитьВводЗначения_СуммаОплаты", ЭтотОбъект, ДопПараметры);	
Сумма = СуммаКОплате;
ПоказатьВводЗначения(Оповещение, Сумма, "Сумма оплаты");
КонецПроцедуры

Процедура ЗавершитьВводЗначения_СуммаОплаты(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

СуммаОплаты = Результат;
СуммаКОплате = ДополнительныеПараметры.СуммаКОплате; 
ТекстПредупреждения = "";
Если Результат < 0 Тогда  
	ТекстПредупреждения = "Введенная сумма меньще 0."; 
КонецЕсли;

Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда 
	ПоказатьПредупреждение(, ТекстПредупреждения 
		+ Символы.ПС + Символы.ПС + "ОПЛАТА ОТМЕНЯЕТСЯ ...");
		
	Возврат;	
КонецЕсли;

ЭтоАванс = (СуммаОплаты < СуммаКОплате);
Если ЭтоАванс Тогда 
	РазрешениеОплаты = НастройкиСервер.ЭтоАдмин() ИЛИ НастройкиСервер.ЭтоАдминистратор();
	Если НЕ РазрешениеОплаты Тогда
		ТекстПредупреждения = "Введенная сумма меньше суммы к оплате.
		|Это аванс.
		| 
		|Вам запрещено оплачивать авансы.
		|Обратитесь к старшему администратору.
		|
		|ОПЛАТА ОТМЕНЯЕТСЯ ..."; 
		ПоказатьПредупреждение(, ТекстПредупреждения);
		
		Возврат;
	КонецЕсли;
КонецЕсли;

ДополнительныеПараметры.Вставить("СуммаОплаты", СуммаОплаты);

Если (СуммаОплаты > СуммаКОплате) Тогда 
	ЭтоАванс = Истина;
	ДополнительныеПараметры.Вставить("ЭтоАванс", ЭтоАванс);
	
	ДопПараметры = ДополнительныеПараметры;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВопроса_СуммаЧекаБольшеСуммыКОплате", ЭтотОбъект, ДопПараметры);
	
	Если СуммаКОплате = 0 Тогда 
		ТекстВопроса = "ВНИМАНИЕ ! Сумма к оплате = 0
		|
		|Будет отбит чек на АВАНС."; 
	Иначе
		ТекстВопроса = "ВНИМАНИЕ ! Сумма чека: " + СуммаОплаты + " > суммы к оплате: " + СуммаКОплате + ".
		            |
					|Будет отбит чек на АВАНС.";
	КонецЕсли;
	
	ТекстВопроса = ТекстВопроса + Символы.ПС + Символы.ПС + "ПРОДОЛЖИТЬ ?";
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
	Возврат;
КонецЕсли;

ДополнительныеПараметры.Вставить("ЭтоАванс", ЭтоАванс);
ОткрытьФормуЧек(ДополнительныеПараметры);
КонецПроцедуры

Процедура ЗавершениеВопроса_СуммаЧекаБольшеСуммыКОплате(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
	
ОткрытьФормуЧек(ДополнительныеПараметры);	
КонецПроцедуры
//

//
Процедура ОткрытьФормуЧек(ДопПараметры) Экспорт
ПозицииЧекаККМ = Новый Массив;

ДокументДолгОбъектДанные = ДопПараметры.ДокументДолгОбъектДанные;

ЭтоАванс = ДопПараметры.ЭтоАванс;
Если ДопПараметры.СуммаОплаты = 0 И ЭтоАванс Тогда
	ПоказатьПредупреждение(, "Сумма аванса = 0.
							|
							|ПЕЧАТЬ ЧЕКА ОТМЕНЯЕТСЯ ...");
	Возврат;
КонецЕсли;	

Если ЭтоАванс Тогда
	СуммаАванса = ДопПараметры.СуммаОплаты;
	ЗаполнитьПозицииЧекаККМАванс(ПозицииЧекаККМ, СуммаАванса);	
	
	СуммаПредыдущихОплат = 0;
Иначе
	
	Счет = ДопПараметры.Счет;
	Если ДопПараметры.ЭтоСчетКоворкинг Тогда
		СуммаКОплате = ДопПараметры.СуммаКОплате;
		
		ЗаполнитьПозицииЧекаККМОплатаКоворкинг(ПозицииЧекаККМ, ДокументДолгОбъектДанные);
		СуммаПредыдущихОплат = СуммаПредыдущихОплатКоворкинг(ДокументДолгОбъектДанные);		
	ИначеЕсли ДопПараметры.ЭтоГрупповойСчет Тогда
		ЗаполнитьПозицииЧекаККМОплатаГрупповойСчет(ПозицииЧекаККМ, ДокументДолгОбъектДанные);
			
		СуммаПредыдущихОплат = СуммаПредыдущихОплатГрупповойСчет(ДокументДолгОбъектДанные);	
	ИначеЕсли ДопПараметры.ЭтоСчетНаОплату Тогда
		СчетаДетальноДолги = ДопПараметры.СчетаДетальноДолги;
		
		ЗаполнитьПозицииЧекаККМОплата(ПозицииЧекаККМ, СчетаДетальноДолги, ДокументДолгОбъектДанные, Счет.СвернутьВСчете);
		
		РаспределениеОплатДолги = ДопПараметры.РаспределениеОплатДолги;
		СуммаПредыдущихОплат = СуммаПредыдущихОплат(Счет.СчетГУИД, РаспределениеОплатДолги);	
	Иначе
		ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД); 
		СчетаДетальноДолги = ДокументДолгОбъектДанные.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
		
		ЗаполнитьПозицииЧекаККМОплата(ПозицииЧекаККМ, СчетаДетальноДолги, ДокументДолгОбъектДанные, Счет.СвернутьВСчете);
		СуммаПредыдущихОплат = СуммаПредыдущихОплат(Счет.СчетГУИД, ДокументДолгОбъектДанные.РаспределениеОплатДолги);
	КонецЕсли;		
КонецЕсли;	
ДопПараметры.Вставить("ПозицииЧекаККМ", ПозицииЧекаККМ); 

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("СуммаКОплате", ДопПараметры.СуммаКОплате);
ПараметрыФормы.Вставить("СуммаОплаты", ДопПараметры.СуммаОплаты);
ПараметрыФормы.Вставить("СуммаПредыдущихОплат", СуммаПредыдущихОплат);
ПараметрыФормы.Вставить("ЭтоАванс", ДопПараметры.ЭтоАванс);
ПараметрыФормы.Вставить("ПозицииЧекаККМ", ПозицииЧекаККМ);   

ПараметрыФормы.Вставить("ДокументДолг", ДокументДолгОбъектДанные.Ссылка);   

Если ДопПараметры.Свойство("ЭтоКоворкинг") Тогда
	ПараметрыФормы.Вставить("ЭтоКоворкинг", ДопПараметры.ЭтоКоворкинг); 
КонецЕсли;

Форма = ДопПараметры.Форма;
ДопПараметры.Удалить("Форма");

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыЧек", ЭтотОбъект, ДопПараметры);
ОткрытьФорму("ОбщаяФорма.Чек", ПараметрыФормы, Форма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

Процедура ЗакрытиеФормыЧек(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;	

ОчиститьСообщения();

ФУ_Клиент.ПоказатьПодтверждениеСообщение(Результат);

Если  Результат.ОшибкаОперации Тогда Возврат; КонецЕсли;

СуммаНалЧекККМ = Результат.СуммаНаличные;
СуммаБезналЧекККМ = Результат.СуммаКарта;
СуммаДокументОплаты =  СуммаНалЧекККМ + СуммаБезналЧекККМ;   

ГУИД_ЭТ =  Результат.ГУИД_ЭТ;   

Если СуммаДокументОплаты = 0 Тогда Перейти ~ВЫХОД; КонецЕсли; 
// + КассовыйДокументСоздатьДокументПриход

ДопПараметры = Новый Структура;

ДокументДолгОбъектДанные = ДополнительныеПараметры.ДокументДолгОбъектДанные;
ДопПараметры.Вставить("ДокументДолгОбъектДанные", ДокументДолгОбъектДанные);

ЭтоЧекНаАванс = ДополнительныеПараметры.ЭтоЧекНаАванс;

ЭтоСчетКоворкинг = ДополнительныеПараметры.ЭтоСчетКоворкинг;
Если ЭтоСчетКоворкинг Тогда
	Если ЗначениеЗаполнено(ДокументДолгОбъектДанные.ОплачиваетСчет) Тогда 
		Контрагент = ДокументДолгОбъектДанные.ОплачиваетСчет;
	Иначе
		Клиент = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ДокументДолгОбъектДанные.КоворкингЗаявка, "Клиент"); 
		Контрагент = Клиент;
	КонецЕсли;
ИначеЕсли ЭтоЧекНаАванс Тогда 
	Счет = Неопределено;
	СчетГУИД = Неопределено;
	
	Контрагент = ДополнительныеПараметры.Контрагент;
Иначе	
	Счет = ДополнительныеПараметры.Счет;
	СчетГУИД = Счет.СчетГУИД;

	Контрагент = Счет.Контрагент;
КонецЕсли;	
ДопПараметры.Вставить("Оплачивает", Контрагент);

//ДопПараметры.Вставить("ЭтоАванс", ДополнительныеПараметры.ЭтоАванс);
ЭтоАванс = Результат.ЭтоАванс; 
ДопПараметры.Вставить("ЭтоАванс", ЭтоАванс);

ДопПараметры.Вставить("НомерСменыККМ", Результат.НомерСменыККМ);
ДопПараметры.Вставить("НомерЧекаККМ", Результат.НомерЧекаККМ);

ДопПараметры.Вставить("ПозицииЧекаККМ", ДополнительныеПараметры.ПозицииЧекаККМ);

ДопПараметры.Вставить("ГУИД_ЭТ", ГУИД_ЭТ);

ДокументОплаты = ОплатыОбщееСервер.КассовыйДокументСоздатьДокументПриход(СуммаНалЧекККМ, СуммаБезналЧекККМ, ДопПараметры);

// + Распределение
Если ЭтоСчетКоворкинг Тогда
	КоворкингСервер.ДобавитьДокументОплатаКоворкингСчет(ДокументОплаты, ДокументДолгОбъектДанные.Ссылка);
		
ИначеЕсли ДополнительныеПараметры.ЭтоГрупповойСчет Тогда
	ГрупповойСчетСервер.ДобавитьИЗаписатьДокументОплатыВГрупповойСчетОбъектТранзакция(ДокументОплаты
			, ДокументДолгОбъектДанные, СуммаДокументОплаты);	
			
ИначеЕсли ДополнительныеПараметры.ЭтоЧекНаАванс Тогда
	ЗаявкаСервер.ДобавитьДокументОплатаЗаявкаНаБронирование(ДокументОплаты, ДокументДолгОбъектДанные.Ссылка
		, Неопределено, ЭтоЧекНаАванс, ЭтоАванс);
		
ИначеЕсли ДополнительныеПараметры.ЭтоСчетНаОплату Тогда
	СчетаДетальноОплаты = ДополнительныеПараметры.СчетаДетальноОплаты;
	
	НоваяОплата = СчетаДетальноОплаты.Добавить();
	НоваяОплата.ДокументОплаты = ДокументОплаты;
	
	ДатаДокумента = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ДокументОплаты, "Дата");
	НоваяОплата.ДатаДокумента = ДатаДокумента;
	
	НоваяОплата.ДатаОплаты = ТекущаяДата();

	НоваяОплата.Аванс = ЭтоАванс;
	
	РаспределениеОплатДолги = ДополнительныеПараметры.РаспределениеОплатДолги;	
	
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
	СчетаДетальноДолги = ДополнительныеПараметры.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);	
	
	ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(НоваяОплата
		, СуммаДокументОплаты, СчетаДетальноДолги, РаспределениеОплатДолги);
		
	//Счет.Закрыт = ОбщийМодульОплатыСервер.СчетЗакрытСчетаДетальноДолги(СчетаДетальноДолги);	
	
Иначе	
	СчетСтруктура = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("ЗаявкаНаБронирование", "Счета");
	ЗаполнитьЗначенияСвойств(СчетСтруктура, Счет);
	
	ЗаявкаСервер.ДобавитьДокументОплатаЗаявкаНаБронирование(ДокументОплаты, ДокументДолгОбъектДанные.Ссылка
		, СчетСтруктура, ЭтоЧекНаАванс, ЭтоАванс);
КонецЕсли;
// - Распределение

//// Выход
~ВЫХОД:
ОповещениеЗавершениеЧек = ДополнительныеПараметры.ОповещениеЗавершениеЧек;
ДополнительныеПараметры.Удалить("ОповещениеЗавершениеЧек");

ДопПараметры = ОповещениеЗавершениеЧек.ДополнительныеПараметры;
ДопПараметры.Вставить("ДокументОплаты", ДокументОплаты);
ДопПараметры.Вставить("СчетГУИД", СчетГУИД);

ВыполнитьОбработкуОповещения(ОповещениеЗавершениеЧек);
КонецПроцедуры
//
////

//
Процедура ЗаполнитьПозицииЧекаККМОплата(ПозицииЧекаККМ, СчетаДетальноДолги, ДокументДолгОбъект, СвернутьВСчете) Экспорт
ПозицииЧекаККМ.Очистить();

ПозицииЧекаККМШаблон = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("КассовыйДокумент", "ЧекККМДетально");

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущаяОрганизация, "СтавкаНДС");
ДатаУчетаНДС = ДокументДолгОбъект.РезервПо; 
СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);  

ВсеСНДС = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущаяОрганизация, "ВсеСНДС"); 

ДатаУчета = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ДокументДолгОбъект.Ссылка, "РезервПо");
УчитыватьНДС = ДокументыСервер.УчитыватьНДС_Чек(ДатаУчета);

СуммаПроживание = 0; 
КоличествоСуток = 0;
Для Каждого Строка Из СчетаДетальноДолги Цикл
	Если Строка.Услуга Тогда Продолжить; КонецЕсли;
	
	//СуммаПроживание = СуммаПроживание + Строка.СуммаКЗакрытию; 	
	СуммаПроживание = СуммаПроживание + Строка.СуммаДолг; 	
	КоличествоСуток = КоличествоСуток + Строка.Количество;
КонецЦикла;	

СуммаУслуги = 0; 
Для Каждого Строка Из СчетаДетальноДолги Цикл
	Если НЕ Строка.Услуга Тогда Продолжить; КонецЕсли;
	
	Если УчитыватьНДС Тогда
		Если Строка.ПрограммныйКодУслуги = 
			ПредопределенноеЗначение("Перечисление.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ") 
		Тогда
			СуммаПроживание = СуммаПроживание + Строка.СуммаДолг; 
		Иначе	
			//СуммаУслуги = СуммаУслуги + Строка.СуммаКЗакрытию; 	
			СуммаУслуги = СуммаУслуги + Строка.СуммаДолг;
		КонецЕсли;
	Иначе
		СуммаУслуги = СуммаУслуги + Строка.СуммаДолг;
	КонецЕсли;
КонецЦикла;	

Если СвернутьВСчете Тогда
	СуммаКОплате = СуммаПроживание + СуммаУслуги;
	
	Если СуммаКОплате <> 0 Тогда 	
		НовЗапч = ОбщийФункционалСервер.СкопироватьСтруктуру(ПозицииЧекаККМШаблон);

		НовЗапч.Наименование="Услуги гостиницы " + Формат(КоличествоСуток, "ЧГ=") + " сут.";

		НовЗапч.Количество = 1;
		НовЗапч.Цена = СуммаКОплате;
		НовЗапч.Сумма=СуммаКОплате;
		
		НовЗапч.Скидка=0;
		
		Если УчитыватьНДС Тогда 
			Если ВсеСНДС Тогда
				НовЗапч.СтавкаНДС = СтавкаНДС;
				НовЗапч.СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, СуммаКОплате);
			Иначе
				Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС")
				ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка")
				Тогда
					СтавкаНДС_П = СтавкаНДС;
				Иначе
					СтавкаНДС_П = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
				КонецЕсли;
				
				НовЗапч.СтавкаНДС = СтавкаНДС_П;
				НовЗапч.СуммаНДС = 0;
			КонецЕсли;			
		КонецЕсли;
	
		ПозицииЧекаККМ.Добавить(НовЗапч);
	КонецЕсли;
Иначе

	Если СуммаПроживание <> 0 Тогда 	
		НовЗапч = ОбщийФункционалСервер.СкопироватьСтруктуру(ПозицииЧекаККМШаблон);

		НовЗапч.Наименование="Услуги гостиницы " + Формат(КоличествоСуток, "ЧГ=") + " сут.";

		НовЗапч.Количество=1;
		НовЗапч.Цена = СуммаПроживание;
		НовЗапч.Сумма = СуммаПроживание;
		
		НовЗапч.Скидка=0;
		
		Если УчитыватьНДС Тогда
			Если ВсеСНДС Тогда
				НовЗапч.СтавкаНДС = СтавкаНДС;
				НовЗапч.СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, СуммаПроживание);
			Иначе
				Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС")
				ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка")
				Тогда
					СтавкаНДС_П = СтавкаНДС;
				Иначе
					СтавкаНДС_П = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
				КонецЕсли;
				
				НовЗапч.СтавкаНДС = СтавкаНДС_П;
				НовЗапч.СуммаНДС = 0;
			КонецЕсли;
		КонецЕсли;
		
		ПозицииЧекаККМ.Добавить(НовЗапч);
	КонецЕсли;

	Если СуммаУслуги <> 0 Тогда
		НовЗапч = ОбщийФункционалСервер.СкопироватьСтруктуру(ПозицииЧекаККМШаблон);
		
		НовЗапч.СтавкаНДС = СтавкаНДС;
		НовЗапч.СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, СуммаУслуги);

		НовЗапч.Наименование="Дополнительные услуги гостиницы";

		НовЗапч.Количество=1;
		НовЗапч.Цена = СуммаУслуги;
		НовЗапч.Сумма = СуммаУслуги;
		
		НовЗапч.Скидка=0;
		
		Если УчитыватьНДС Тогда
			НовЗапч.СтавкаНДС = СтавкаНДС;
			НовЗапч.СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, СуммаУслуги);
		КонецЕсли;
		
		ПозицииЧекаККМ.Добавить(НовЗапч);		
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПозицииЧекаККМОплатаГрупповойСчет(ПозицииЧекаККМ, ДокументДолгОбъектДанные) Экспорт
ГрупповойСчетСервер.ЗаполнитьПозицииЧекаККМОплатаГрупповойСчет(ПозицииЧекаККМ, ДокументДолгОбъектДанные); 	
КонецПроцедуры

Процедура ЗаполнитьПозицииЧекаККМОплатаКоворкинг(ПозицииЧекаККМ, ДокументДолгОбъектДанные) Экспорт
ПозицииЧекаККМ.Очистить();

ДатаУчетаНДС = ДокументДолгОбъектДанные.ДатаПо;
СтавкаНДС = ДокументыСервер.СтавкаНДС(Истина); СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);

ДатаУчета = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ДокументДолгОбъектДанные.Ссылка, "ДатаПо");
УчитыватьНДС = ДокументыСервер.УчитыватьНДС_Чек(ДатаУчета);

ПозицииЧекаККМШаблон = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("КассовыйДокумент", "ЧекККМДетально");

Если ДокументДолгОбъектДанные.Сумма <> 0 Тогда 
	НовЗапч = ОбщийФункционалСервер.СкопироватьСтруктуру(ПозицииЧекаККМШаблон);

	КоличествоДниЧасы =  Формат(ДокументДолгОбъектДанные.Количество, "ЧГ=");
	Если ДокументДолгОбъектДанные.ПочасоваяОплата Тогда 
		КоличествоДниЧасы =  КоличествоДниЧасы + " час.";
	Иначе
		КоличествоДниЧасы =  КоличествоДниЧасы + " сут.";
	КонецЕсли;

	НовЗапч.Наименование="Коворкинг " + КоличествоДниЧасы;   

	НовЗапч.Количество=1;
	НовЗапч.Цена = ДокументДолгОбъектДанные.Сумма;
	НовЗапч.Сумма= ДокументДолгОбъектДанные.Сумма;

	НовЗапч.Скидка=0;
	
	Если УчитыватьНДС Тогда
		НовЗапч.СтавкаНДС = СтавкаНДС;
		НовЗапч.СуммаНДС = НовЗапч.СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, ДокументДолгОбъектДанные.Сумма);
	КонецЕсли;
	
	ПозицииЧекаККМ.Добавить(НовЗапч);
КонецЕсли;

ДопУслугиКоворкинг = ДокументДолгОбъектДанные.ДопУслугиКоворкинг;

СуммаУслуги = 0;
Для Каждого Строка Из ДопУслугиКоворкинг Цикл
	СуммаУслуги = СуммаУслуги + Строка.Сумма;	
КонецЦикла; 	

Если СуммаУслуги <> 0 Тогда 
	НовЗапч = ОбщийФункционалСервер.СкопироватьСтруктуру(ПозицииЧекаККМШаблон);

	НовЗапч.Наименование="Дополнительные услуги";

	Если УчитыватьНДС Тогда
		НовЗапч.СтавкаНДС = СтавкаНДС;
		НовЗапч.СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, СуммаУслуги);
	КонецЕсли;
	
	НовЗапч.Количество=1;
	НовЗапч.Цена = СуммаУслуги;
	НовЗапч.Сумма = СуммаУслуги;

	НовЗапч.Скидка=0;

	ПозицииЧекаККМ.Добавить(НовЗапч);
КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПозицииЧекаККМАванс(ПозицииЧекаККМ, СуммаАванса) Экспорт
ПозицииЧекаККМ.Очистить();

НовЗапч = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("КассовыйДокумент", "ЧекККМДетально");

НовЗапч.Наименование="АВАНС";

НовЗапч.Количество = 1;
//НовЗапч.Цена = СуммаАванса;
НовЗапч.Сумма=СуммаАванса;

НовЗапч.Скидка=0;
//НовЗапч.СтавкаНДС=0;

// + ПСН
//			НовЗапч.НомерСекции = 1;
// - ПСН
ПозицииЧекаККМ.Добавить(НовЗапч);
КонецПроцедуры

Функция СуммаПредыдущихОплат(СчетГУИД, РаспределениеОплатДолги) Экспорт
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);	

СуммаПредыдущихОплат = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	СуммаПредыдущихОплат = СуммаПредыдущихОплат + Строка.СуммаОплаты;
КонецЦикла;	

Возврат СуммаПредыдущихОплат; 
КонецФункции

Функция СуммаПредыдущихОплатГрупповойСчет(ДокументДолгОбъектДанные) Экспорт
СуммаПредыдущихОплат = 0;
Для Каждого Строка Из ДокументДолгОбъектДанные.РаспределениеОплат Цикл
	СуммаПредыдущихОплат = СуммаПредыдущихОплат + Строка.СуммаОплаты;
КонецЦикла;	

Возврат СуммаПредыдущихОплат; 	
КонецФункции	

Функция СуммаПредыдущихОплатКоворкинг(ДокументДолгОбъектДанные) Экспорт
СуммаПредыдущихОплатКоворкинг = 0;	
Для Каждого Строка Из ДокументДолгОбъектДанные.ДокументыОплаты Цикл
	СуммаПредыдущихОплатКоворкинг = СуммаПредыдущихОплатКоворкинг + Строка.СуммаРаспределено;	
КонецЦикла;		
	
Возврат СуммаПредыдущихОплатКоворкинг; 
КонецФункции
//

////// - Чек оплаты


//// + Копия Чека
Процедура КопияЧекаДействие(КассовыйДокумент, Форма) Экспорт
//ДанныеЧекаВТаблицаЧекаККМ(КассовыйДокумент, ТаблицаПозицииЧека);

ДокументДолг = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(КассовыйДокумент, "ДокументДолг");
ЭтоКоворкинг = (ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.КоворкингСчета"));

Строка = ПолучитьТекстКопииЧека(КассовыйДокумент, ЭтоКоворкинг);
ФУ_ПечатьТекста(Строка, ЭтоКоворкинг, Форма);
КонецПроцедуры

Функция ПолучитьТекстКопииЧека(КассовыйДокумент, ЭтоКоворкинг) 

	Строка = "";
	Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
	Если ЭтоКоворкинг И Организация.КоворкингОрганизацияЕсть Тогда
		НаименованиеДляФУ = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Организация, "КоворкингНаименованиеДляФУ");
	Иначе
		НаименованиеДляФУ = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Организация, "НаименованиеДляФУ");
	КонецЕсли;
	Строка = Строка + НаименованиеДляФУ;
	
	Пока СтрДлина(Строка)<32 цикл
		Строка=" " + Строка + " ";
	конеццикла;
	
	СуммаЧека=0;
	//Если НЕ ЗначениеЗаполнено(Результат) Тогда
	////	Результат = Обработка.ОткрытьЧек(Объект, Пароль, ПризнакВозврата, НомерЧека, НомерСмены, Истина);
//		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Позиция = Неопределено;
			КассовыйДокументЧекККМДетально = 
				ОбщийФункционалСервер.ТабличнаяЧастьДокументаВМассивСтруктур(КассовыйДокумент, "ЧекККМДетально");
			//Для Каждого Позиция Из КассовыйДокумент.ЧекККМДетально Цикл
			Для Каждого Позиция Из КассовыйДокументЧекККМДетально Цикл
				////ЗначениеСкидки = Позиция.Количество * Позиция.Цена * Позиция.Скидка * 0.01;
				////СуммаСоСкидкой1С = Окр(Позиция.Количество * Позиция.Цена - ЗначениеСкидки, 2);
				////СуммаСоСкидкойФР = Окр(Позиция.Количество * Позиция.Цена - Окр(ЗначениеСкидки, 2), 2);

				////Если СуммаСоСкидкой1С = СуммаСоСкидкойФР Тогда
				////	Результат = Обработка.ПечататьСтрокуНеФискал(Объект,
				////								   Позиция.Наименование,
				////								   Позиция.Количество,
				////								   Позиция.Цена,
				////								   Позиция.Скидка,
				////								   Позиция.НомерСекции,
				////								   Позиция.СтавкаНДС,МассивСтрок);
				////Иначе
				////	Результат = Обработка.ПечататьСтрокуНеФискал(Объект,
				////								   Позиция.Наименование,
				////								   1,
				////								   СуммаСоСкидкой1С,
				////								   0,
				////								   Позиция.НомерСекции,
				////								   Позиция.СтавкаНДС,МассивСтрок);
				////КонецЕсли;
				
				//МассивСтрок.Добавить("-------------------------------");
				//МассивСтрок.Добавить(Позиция.Наименование);
				Строка = Строка + Символы.ПС + "-------------------------------";
                Строка = Строка + Символы.ПС + Позиция.Наименование;
				
				//СтрСумма=Формат(Позиция.Цена*Позиция.Количество, "ЧГ=");
				СтрСумма=Формат(Позиция.Сумма, "ЧДЦ=2; ЧГ=");
				Пока СтрДлина(СтрСумма)<32 цикл
					СтрСумма=" "+СтрСумма;
				конеццикла;
				
				//МассивСтрок.Добавить(СтрСумма);
				Строка = Строка + Символы.ПС + СтрСумма;
				
				//СуммаЧека=СуммаЧека + Позиция.Цена*Позиция.Количество;
                СуммаЧека=СуммаЧека + Позиция.Сумма;
				////Если ЗначениеЗаполнено(Результат) Тогда
				////	Прервать;
				////КонецЕсли;
			КонецЦикла;
			
			СтрСумма="ИТОГ "+Формат(СуммаЧека, "ЧДЦ=2; ЧГ=");
				Пока СтрДлина(СтрСумма)<32 цикл
					СтрСумма=" "+СтрСумма;
				конеццикла;
				
			//МассивСтрок.Добавить(СтрСумма);
			//МассивСтрок.Добавить("-------------------------------");
			Строка = Строка + Символы.ПС + СтрСумма;
            Строка = Строка + Символы.ПС + "-------------------------------";
			
			ДокОснДата = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(КассовыйДокумент, "Дата");
			
			//МассивСтрок.Добавить(Формат(ДокОсн.Дата, "ДФ=dd.MM.yy"));
			//МассивСтрок.Добавить(Формат(ДокОснДата, "ДФ=dd.MM.yy"));
			Строка = Строка + Символы.ПС + Формат(ДокОснДата, "ДФ=dd.MM.yy");
			
			//МассивСтрок.Добавить("КОПИЯ ЧЕКА");
			Строка = Строка + Символы.ПС + "КОПИЯ ЧЕКА";
			
			////Если НЕ ЗначениеЗаполнено(Результат) Тогда
			////	Результат = Обработка.ЗакрытьЧек(Объект, СуммаНал, СуммаБезнал);
			////КонецЕсли;
			
			//Обработка.НапечататьСтроки(Объект,МассивСтрок,32);
			
		//КонецЕсли;

		//мОписаниеОшибки = Объект.ОписаниеОшибки;
	//Иначе
	//	мОписаниеОшибки = ПолучитьТекстОшибкиПодключенияТО("ФР");
	//КонецЕсли;

	//Возврат Результат;

	//Возврат МассивСтрок;
	Возврат Строка;
КонецФункции // ПечатьЧека()


Процедура ФУ_ПечатьТекста(СтрокиПечати, ЭтоКоворкинг, Форма)

Форма.Доступность = Ложь; //При необходимости разблокируем интерфейс пользователя.

ДопПараметры = Новый Структура("Форма", Форма); 
ДопПараметры.Вставить("ЭтоКоворкинг", ЭтоКоворкинг); 

ПараметрыОперации = Новый Структура("СтрокиТекста", СтрокиПечати);

ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_ПечатьТекстаЗавершение", ЭтотОбъект, ДопПараметры);
ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(ОповещениеПриЗавершении
, Форма.УникальныйИдентификатор
, 
, ПараметрыОперации                  
);
	
КонецПроцедуры

Процедура ФУ_ПечатьТекстаЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
Форма = ДополнительныеПараметры.Форма;
Форма.Доступность = Истина; //При необходимости разблокируем интерфейс пользователя.

Если НЕ РезультатВыполнения.Результат Тогда
  ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:""%ОписаниеОшибки%"".'");
  ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
  Сообщить(ТекстСообщения);
КонецЕсли;

КонецПроцедуры





// ++++++++++++++++++++++++++++++++++++++++++++++++++++++

