
//
Функция ПолучитьТЗБазовыеЦены(ДатаБазовойЦены) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	БазовыеЦены.Ссылка КАК Ссылка,
                      |	БазовыеЦены.Код КАК Код,
                      |	БазовыеЦены.Наименование КАК Наименование,
                      |	БазовыеЦены.ДатаУстановкиЦены КАК ДатаУстановкиЦены,
                      |	БазовыеЦены.БазоваяЦена КАК БазоваяЦена,
                      |	БазовыеЦены.ДоплатаЗаЗавтрак КАК ДоплатаЗаЗавтрак,
                      |	БазовыеЦены.ДоплатаЗаДвухместный КАК ДоплатаЗаДвухместный,
                      |	БазовыеЦены.Автор КАК Автор,
                      |	БазовыеЦены.ДатаИзменения КАК ДатаИзменения,
                      |	БазовыеЦены.ДоплатыЗаКатегории.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		КатегорияНомера КАК КатегорияНомера,
                      |		ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию
                      |	) КАК ДоплатыЗаКатегории
                      |ИЗ
                      |	Справочник.БазовыеЦены КАК БазовыеЦены
                      |ГДЕ
                      |	БазовыеЦены.ПометкаУдаления = ЛОЖЬ
                      |	И БазовыеЦены.ДатаУстановкиЦены <= &ДатаУстановкиЦены
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаУстановкиЦены УБЫВ");

Запрос.УстановитьПараметр("ДатаУстановкиЦены", ДатаБазовойЦены); 

ТЗ = Запрос.Выполнить().Выгрузить();

Возврат ТЗ;
КонецФункции

Функция ПолучитьКалендарьЦенБазовый(ДатаЦены, ВидЦены) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КалендарьЦенБазовый.ДатаЦены КАК ДатаЦены,
                      |	КалендарьЦенБазовый.ТипЦены КАК ТипЦены,
                      |	КалендарьЦенБазовый.ЦенаДоплата КАК ЦенаДоплата,
                      |	КалендарьЦенБазовый.Автор КАК Автор,
                      |	КалендарьЦенБазовый.ДатаИзменения КАК ДатаИзменения
                      |ИЗ
                      |	РегистрСведений.КалендарьЦенБазовый КАК КалендарьЦенБазовый
                      |ГДЕ
                      |	КалендарьЦенБазовый.ДатаЦены = &ДатаЦены
                      |	И КалендарьЦенБазовый.ВидЦены = &ВидЦены");

Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены); 
Запрос.УстановитьПараметр("ВидЦены", ВидЦены); 

ТЗ = Запрос.Выполнить().Выгрузить();

Возврат ТЗ;
КонецФункции

Функция ПолучитьБазоваяЦенаДня(ДатаЦены,КатегорияНомера, БезЗавтрака) Экспорт
	
ТЗ_БазовыеЦены = ПолучитьТЗБазовыеЦены(ДатаЦены);	

Если ТЗ_БазовыеЦены.Количество() = 0 Тогда
	БазоваяЦена = 0;	
	БазоваяДоплатаЗаЗавтрак = 0;	
	БазоваяДоплатаЗаДвухместный = 0;
	
	БазоваяДоплатаЗаКатегорию = 0;
Иначе
	Строка = ТЗ_БазовыеЦены[0];
	
	БазоваяЦена = Строка.БазоваяЦена;	
	БазоваяДоплатаЗаЗавтрак = Строка.ДоплатаЗаЗавтрак;	
	БазоваяДоплатаЗаДвухместный = Строка.ДоплатаЗаДвухместный;
	
	ДоплатыЗаКатегории = Строка.ДоплатыЗаКатегории;
	ОтборСтроки = Новый Структура("КатегорияНомера", КатегорияНомера); 	
	НайденныеСтроки = ДоплатыЗаКатегории.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		БазоваяДоплатаЗаКатегорию = 0;
	Иначе
		БазоваяДоплатаЗаКатегорию = НайденныеСтроки[0].ДоплатаЗаКатегорию;
	КонецЕсли;		
КонецЕсли;

БазоваяЦенаДняОдноместный = БазоваяЦена;	
БазоваяЦенаДняДвухместный = БазоваяЦена + БазоваяДоплатаЗаДвухместный;	

Если НЕ БезЗавтрака Тогда
	БазоваяЦенаДняОдноместный = БазоваяЦенаДняОдноместный + БазоваяДоплатаЗаЗавтрак;	
	БазоваяЦенаДняДвухместный = БазоваяЦенаДняДвухместный + 2 * БазоваяДоплатаЗаЗавтрак;	
КонецЕсли;
	
Результат = Новый Структура(
		"БазоваяЦена, БазоваяДоплатаЗаЗавтрак, БазоваяДоплатаЗаДвухместный, БазоваяДоплатаЗаКатегорию"
	+ ", БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный"
	, БазоваяЦена, БазоваяДоплатаЗаЗавтрак, БазоваяДоплатаЗаДвухместный, БазоваяДоплатаЗаКатегорию
	, БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный);
	
Возврат Результат;
КонецФункции

Функция ПолучитьДолгосрочнаяЦенаДня(ДатаЦены, КатегорияНомера, БезЗавтрака) Экспорт
Результат = ПолучитьБазоваяЦенаДня(ДатаЦены, КатегорияНомера, БезЗавтрака);
Цена = Результат.БазоваяЦена;
ДоплатаЗаДвухместный = Результат.БазоваяДоплатаЗаДвухместный;
ДоплатаЗаЗавтрак = Результат.БазоваяДоплатаЗаЗавтрак;
БазоваяДоплатаЗаКатегорию = Результат.БазоваяДоплатаЗаКатегорию;

ВидЦеныДолгосрочная = Перечисления.КалендарьЦенВидЦены.ДолгосрочнаяЦена;
ТЗ_КалендарьЦенБазовый = ПолучитьКалендарьЦенБазовый(ДатаЦены, ВидЦеныДолгосрочная);	

ИзменениеДолгосрочнойБазовойЦены = Ложь;
Если ТЗ_КалендарьЦенБазовый.Количество() > 0 Тогда

	Для Каждого Строка Из ТЗ_КалендарьЦенБазовый Цикл
		Если Строка.ТипЦены = Перечисления.КалендарьЦенТипЦены.БазоваяЦена Тогда
			Цена = Строка.ЦенаДоплата;
		ИначеЕсли Строка.ТипЦены =Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный Тогда
		    ДоплатаЗаДвухместный = Строка.ЦенаДоплата;
		ИначеЕсли Строка.ТипЦены = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак Тогда
		    ДоплатаЗаЗавтрак = Строка.ЦенаДоплата;
		КонецЕсли;		
		
		ИзменениеДолгосрочнойБазовойЦены = Истина;
	КонецЦикла;
КонецЕсли;

ТЗ_КалендарьЦенКатегории = ПолучитьТЗКалендарьЦенКатегории(ДатаЦены, КатегорияНомера, ВидЦеныДолгосрочная); 	

ИзменениеДолгосрочнойЦеныДняКатегория = Ложь;
Если ТЗ_КалендарьЦенКатегории.Количество() = 0 Тогда
	ДолгосрочнаяДоплатаЗаКатегорию = БазоваяДоплатаЗаКатегорию;
Иначе
	Строка = ТЗ_КалендарьЦенКатегории[0];
	ДолгосрочнаяДоплатаЗаКатегорию = Строка.ДоплатаЗаКатегорию;
	
	ИзменениеДолгосрочнойЦеныДняКатегория = Истина;
КонецЕсли;	

ДолгосрочнаяЦенаДняОдноместный = Цена;	
ДолгосрочнаяЦенаДняДвухместный = Цена + ДоплатаЗаДвухместный;	

Если НЕ БезЗавтрака Тогда
	ДолгосрочнаяЦенаДняОдноместный = ДолгосрочнаяЦенаДняОдноместный + ДоплатаЗаЗавтрак;	
	ДолгосрочнаяЦенаДняДвухместный = ДолгосрочнаяЦенаДняДвухместный + 2 * ДоплатаЗаЗавтрак;	
КонецЕсли;

ИзменениеДолгосрочнойЦеныДня = ИзменениеДолгосрочнойБазовойЦены ИЛИ ИзменениеДолгосрочнойЦеныДняКатегория;

СтруктураПоля = "ДолгосрочнаяЦенаДняОдноместный, ДолгосрочнаяЦенаДняДвухместный, ИзменениеДолгосрочнойЦеныДня"
			+ ", ДолгосрочнаяБазоваяЦена, ДолгосрочнаяДоплатаЗаДвухместный, ДолгосрочнаяДоплатаЗаЗавтрак"
			+ ", ДолгосрочнаяДоплатаЗаКатегорию";
Результат = Новый Структура(СтруктураПоля
	, ДолгосрочнаяЦенаДняОдноместный, ДолгосрочнаяЦенаДняДвухместный, ИзменениеДолгосрочнойЦеныДня
	, Цена, ДоплатаЗаДвухместный, ДоплатаЗаЗавтрак
	, ДолгосрочнаяДоплатаЗаКатегорию
);
	
Возврат Результат;
КонецФункции

Функция ПолучитьТекущаяЦенаДня(ДатаЦены, КатегорияНомера, БезЗавтрака) Экспорт
Результат = ПолучитьБазоваяЦенаДня(ДатаЦены, КатегорияНомера, БезЗавтрака);	
Цена = Результат.БазоваяЦена;
ДоплатаЗаЗавтрак = Результат.БазоваяДоплатаЗаЗавтрак;
ДоплатаЗаДвухместный = Результат.БазоваяДоплатаЗаДвухместный;
БазоваяДоплатаЗаКатегорию = Результат.БазоваяДоплатаЗаКатегорию;

Результат = ПолучитьДолгосрочнаяЦенаДня(ДатаЦены, КатегорияНомера, БезЗавтрака);	
ДолгосрочнаяЦенаДняОдноместный = Результат.ДолгосрочнаяЦенаДняОдноместный; 
ДолгосрочнаяЦенаДняДвухместный = Результат.ДолгосрочнаяЦенаДняДвухместный;
ДолгосрочнаяДоплатаЗаКатегорию = Результат.ДолгосрочнаяДоплатаЗаКатегорию;
ИзменениеДолгосрочнойЦеныДня = Результат.ИзменениеДолгосрочнойЦеныДня;

ВидЦеныТекущая = Перечисления.КалендарьЦенВидЦены.ТекущаяЦена;
ТЗ_КалендарьЦенБазовый = ПолучитьКалендарьЦенБазовый(ДатаЦены, ВидЦеныТекущая);	

ИзменениеТекущейБазовойЦены = Ложь;
Если ТЗ_КалендарьЦенБазовый.Количество() > 0 Тогда

	Для Каждого Строка Из ТЗ_КалендарьЦенБазовый Цикл
		Если Строка.ТипЦены = Перечисления.КалендарьЦенТипЦены.БазоваяЦена Тогда
			Цена = Строка.ЦенаДоплата;
		ИначеЕсли Строка.ТипЦены =Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный Тогда
		    ДоплатаЗаДвухместный = Строка.ЦенаДоплата;
		ИначеЕсли Строка.ТипЦены = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак Тогда
		    ДоплатаЗаЗавтрак = Строка.ЦенаДоплата;
		КонецЕсли;		                                          
	КонецЦикла;
	ИзменениеТекущейБазовойЦены = Истина;
	
	ТекущаяЦенаДняОдноместный = Цена;	
	ТекущаяЦенаДняДвухместный = Цена + ДоплатаЗаДвухместный;	

	Если НЕ БезЗавтрака Тогда
		ТекущаяЦенаДняОдноместный = ТекущаяЦенаДняОдноместный + ДоплатаЗаЗавтрак;	
		ТекущаяЦенаДняДвухместный = ТекущаяЦенаДняДвухместный + 2 * ДоплатаЗаЗавтрак;	
	КонецЕсли;
Иначе	
	ТекущаяЦенаДняОдноместный = ДолгосрочнаяЦенаДняОдноместный; 
	ТекущаяЦенаДняДвухместный = ДолгосрочнаяЦенаДняДвухместный;
КонецЕсли;

ТЗ_КалендарьЦенКатегории = ПолучитьТЗКалендарьЦенКатегории(ДатаЦены, КатегорияНомера, ВидЦеныТекущая); 	

ИзменениеТекущейЦеныДняКатегория = Ложь;
Если ТЗ_КалендарьЦенКатегории.Количество() = 0 Тогда
	ТекущаяДоплатаЗаКатегорию = ДолгосрочнаяДоплатаЗаКатегорию;
Иначе
	Строка = ТЗ_КалендарьЦенКатегории[0];
	ТекущаяДоплатаЗаКатегорию = Строка.ДоплатаЗаКатегорию;
	
	ИзменениеТекущейЦеныДняКатегория = Истина;
КонецЕсли;	

ТекущаяЦенаДняОдноместный = ТекущаяЦенаДняОдноместный + ТекущаяДоплатаЗаКатегорию; 
ТекущаяЦенаДняДвухместный = ТекущаяЦенаДняДвухместный + ТекущаяДоплатаЗаКатегорию;

ИзменениеТекущейЦеныДня = ИзменениеТекущейБазовойЦены ИЛИ ИзменениеТекущейЦеныДняКатегория;

Результат = Новый Структура("ТекущаяЦенаДняОдноместный, ТекущаяЦенаДняДвухместный, ТекущаяДоплатаЗаКатегорию, ИзменениеТекущейЦеныДня"
	, ТекущаяЦенаДняОдноместный, ТекущаяЦенаДняДвухместный, ТекущаяДоплатаЗаКатегорию, ИзменениеТекущейЦеныДня);
	
Возврат Результат;
КонецФункции

Функция ПолучитьТЗКалендарьЦенКатегории(ДатаЦены, КатегорияНомера, ВидЦены) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КалендарьЦенКатегории.ДатаЦены КАК ДатаЦены,
                      |	КалендарьЦенКатегории.КатегорияНомера КАК КатегорияНомера,
                      |	КалендарьЦенКатегории.ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию,
                      |	КалендарьЦенКатегории.Автор КАК Автор,
                      |	КалендарьЦенКатегории.ДатаИзменения КАК ДатаИзменения
                      |ИЗ
                      |	РегистрСведений.КалендарьЦенКатегории КАК КалендарьЦенКатегории
                      |ГДЕ
                      |	КалендарьЦенКатегории.ДатаЦены = &ДатаЦены
                      |	И КалендарьЦенКатегории.КатегорияНомера = &КатегорияНомера
                      |	И КалендарьЦенКатегории.ВидЦены = &ВидЦены");

Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены); 
Запрос.УстановитьПараметр("КатегорияНомера", КатегорияНомера); 
Запрос.УстановитьПараметр("ВидЦены", ВидЦены); 

ТЗ = Запрос.Выполнить().Выгрузить();
Возврат ТЗ;
КонецФункции

// + Аудит
//Функция ПолучитьЦенаДня(ДатаЦены, КатегорияНомера, ВидЦены
//	, БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный, БазоваяДоплатаЗаКатегорию) Экспорт
Функция ПолучитьЦенаДня_НеИспользуется(ДатаЦены, КатегорияНомера, ВидЦены
	, БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный, БазоваяДоплатаЗаКатегорию) Экспорт
// - Аудит
ТЗ_КалендарьЦенКатегории = ПолучитьТЗКалендарьЦенКатегории(ДатаЦены, КатегорияНомера, ВидЦены); 	

ИзменениеЦеныДня = Ложь;
Если ТЗ_КалендарьЦенКатегории.Количество() = 0 Тогда
	ЦенаДняОдноместный = БазоваяЦенаДняОдноместный	+ БазоваяДоплатаЗаКатегорию;
	ЦенаДняДвухместный = БазоваяЦенаДняДвухместный	+ БазоваяДоплатаЗаКатегорию;
Иначе
	Строка = ТЗ_КалендарьЦенКатегории[0];
	
	ЦенаДняОдноместный = БазоваяЦенаДняОдноместный	+ Строка.ДоплатаЗаКатегорию;
	ЦенаДняДвухместный = БазоваяЦенаДняДвухместный	+ Строка.ДоплатаЗаКатегорию;;
	
	ИзменениеЦеныДня = Истина;
КонецЕсли;	

Результат = Новый Структура("ЦенаДняОдноместный, ЦенаДняДвухместный, ИзменениЦеныДня"
	, ЦенаДняОдноместный, ЦенаДняДвухместный, ИзменениеЦеныДня);

Возврат Результат;
КонецФункции

Функция ПолучитьЦенаДняКатегория(ДатаЦены, КатегорияНомера, ВидЦены) Экспорт

ТЗ_КалендарьЦенКатегории = ПолучитьТЗКалендарьЦенКатегории(ДатаЦены, КатегорияНомера, ВидЦены); 	

ИзменениеЦеныДняКатегория = Ложь;
Если ТЗ_КалендарьЦенКатегории.Количество() = 0 Тогда
	ДоплатаЗаКатегорию = 0;
Иначе
	Строка = ТЗ_КалендарьЦенКатегории[0];
	ДоплатаЗаКатегорию = Строка.ДоплатаЗаКатегорию;
	
	ИзменениеЦеныДняКатегория = Истина;
КонецЕсли;	

Результат = Новый Структура("ДоплатаЗаКатегорию, ИзменениеЦеныДняКатегория"
	, ДоплатаЗаКатегорию, ИзменениеЦеныДняКатегория);

Возврат Результат;
КонецФункции
//

//
Функция ПолучитьТабДокРасшифровкаКонкурентыЦенаАналитика(ДатаРасшифровка, Знач ТЗОтели) Экспорт
//ДатаРасшифровка = Расшифровка.Дата;	
	
Макет = Обработки.КалендарьЦен.ПолучитьМакет("РасшифровкаКонкурентыАналитика");
ТабДок = Новый ТабличныйДокумент;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентовАналитикаДанныеДата.Ссылка.ДатаЗадания КАК ДатаЗадания,
                      |	ЦеныКонкурентовАналитикаДанныеДата.ЗанятоПроцент КАК ЗанятоПроцент,
                      |	ЦеныКонкурентовАналитикаДанныеДата.СреднийADR КАК СреднийADR,
                      |	ЦеныКонкурентовАналитикаДанныеДата.ГлубинаБронирования КАК ГлубинаБронирования,
                      |	ЦеныКонкурентовАналитикаДанныеДата.НашаЦена КАК НашаЦена,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Отель КАК Отель,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Цена КАК Цена,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.ПродажиЗакрыты КАК ПродажиЗакрыты
                      |ИЗ
                      |	Документ.ЦеныКонкурентовАналитика.ДанныеДата КАК ЦеныКонкурентовАналитикаДанныеДата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЦеныКонкурентовАналитика.ДанныеОтели КАК ЦеныКонкурентовАналитикаДанныеОтели
                      |		ПО ЦеныКонкурентовАналитикаДанныеДата.Ссылка = ЦеныКонкурентовАналитикаДанныеОтели.Ссылка
                      |			И ЦеныКонкурентовАналитикаДанныеОтели.Дата = ЦеныКонкурентовАналитикаДанныеДата.Дата
                      |ГДЕ
                      |	ЦеныКонкурентовАналитикаДанныеДата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЦеныКонкурентовАналитикаДанныеДата.Дата = &Дата");

Запрос.УстановитьПараметр("Дата", ДатаРасшифровка);

ТЗ = Запрос.Выполнить().Выгрузить();

ТабДокДата = Новый ТабличныйДокумент;

Область = Макет.ПолучитьОбласть("Заголовок|Заголовки");
Область.Параметры.ДатаРасшифровка = Формат(ДатаРасшифровка, "ДФ=dd.MM.yy");
ТабДокДата.Вывести(Область);

ОбластьЗаголовки = Макет.ПолучитьОбласть("Строка|Заголовки");
ТабДокДата.Вывести(ОбластьЗаголовки);

ОбластьЗаголовки = Макет.ПолучитьОбласть("ОтелиШапка|Заголовки");
ТабДокДата.Вывести(ОбластьЗаголовки);

Для Каждого Строка Из ТЗОтели Цикл
	ОбластьЗаголовки = Макет.ПолучитьОбласть("ОтелиСтрока|Заголовки");
	ОбластьЗаголовки.Параметры.Отель = Строка.Отель;
	
	ТабДокДата.Вывести(ОбластьЗаголовки);
КонецЦикла;
ТабДок.Присоединить(ТабДокДата);

ОтборСтроки = Новый Структура("Отель", Справочники.КонкурентыОтели.ПустаяСсылка());
ТЗДаты = ТЗ.Скопировать(ОтборСтроки);
ТЗДаты.Свернуть("ДатаЗадания, ЗанятоПроцент, СреднийADR, ГлубинаБронирования, НашаЦена, Цена");  

Для Каждого Строка Из ТЗДаты Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ОбластьДата = Макет.ПолучитьОбласть("Заголовок|Дата");
	ТабДокДата.Вывести(ОбластьДата);
	
	ОбластьДата = Макет.ПолучитьОбласть("Строка|Дата");
	ОбластьДата.Параметры.Дата = Формат(Строка.ДатаЗадания, "ДФ=dd.MM.yy");
	ОбластьДата.Параметры.ЗагрузкаПроцент = Строка.ЗанятоПроцент;
	ОбластьДата.Параметры.СреднийADR = Строка.СреднийADR;
	ОбластьДата.Параметры.НашаЦена = Строка.НашаЦена;
	ОбластьДата.Параметры.ГлубинаБронирования = Строка.ГлубинаБронирования;
	
	ЦенаТравелЛайн = СредняяЦенаКонкурентовАналитика(ТЗ, Строка.Цена);
 
	ОбластьДата.Параметры.ЦенаТравелЛайн = ЦенаТравелЛайн;

	ТабДокДата.Вывести(ОбластьДата);
	
	ОбластьДата = Макет.ПолучитьОбласть("ОтелиШапка|Дата");
	ТабДокДата.Вывести(ОбластьДата);
	
	ОтборСтроки = Новый Структура("ДатаЗадания", Строка.ДатаЗадания);
	ТЗ_ОтелиДата = ТЗ.Скопировать(ОтборСтроки);
	Для Каждого СтрокаОтель Из ТЗ_ОтелиДата Цикл
		Если ЗначениеЗаполнено(СтрокаОтель.Отель) Тогда
			ОбластьДата = Макет.ПолучитьОбласть("ОтелиСтрока|Дата");
			ОбластьДата.Параметры.Цена = ОтчетЦенаОтель(СтрокаОтель);
			
			ТабДокДата.Вывести(ОбластьДата);      
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;

Возврат ТабДок;	
КонецФункции

Функция ПолучитьТабДокРасшифровкаКонкурентыЦенаАналитика_2(ДатаРасшифровка, Знач ТЗОтели) Экспорт
//ДатаРасшифровка = Расшифровка.Дата;	
	
Макет = Обработки.КалендарьЦен.ПолучитьМакет("РасшифровкаКонкурентыАналитика");
ТабДок = Новый ТабличныйДокумент;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентовАналитикаДанныеДата.Ссылка.ДатаЗадания КАК ДатаЗадания,
                      |	ЦеныКонкурентовАналитикаДанныеДата.ЗанятоПроцент КАК ЗанятоПроцент,
                      |	ЦеныКонкурентовАналитикаДанныеДата.СреднийADR КАК СреднийADR,
                      |	ЦеныКонкурентовАналитикаДанныеДата.ГлубинаБронирования КАК ГлубинаБронирования,
                      |	ЦеныКонкурентовАналитикаДанныеДата.НашаЦена КАК НашаЦена,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Отель КАК Отель,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Цена КАК Цена,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.ПродажиЗакрыты КАК ПродажиЗакрыты
                      |ИЗ
                      |	Документ.ЦеныКонкурентовАналитика.ДанныеДата КАК ЦеныКонкурентовАналитикаДанныеДата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЦеныКонкурентовАналитика.ДанныеОтели КАК ЦеныКонкурентовАналитикаДанныеОтели
                      |		ПО ЦеныКонкурентовАналитикаДанныеДата.Ссылка = ЦеныКонкурентовАналитикаДанныеОтели.Ссылка
                      |			И ЦеныКонкурентовАналитикаДанныеОтели.Дата = ЦеныКонкурентовАналитикаДанныеДата.Дата
                      |ГДЕ
                      |	ЦеныКонкурентовАналитикаДанныеДата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЦеныКонкурентовАналитикаДанныеДата.Дата = &Дата");


Запрос.УстановитьПараметр("Дата", ДатаРасшифровка);

ТЗ = Запрос.Выполнить().Выгрузить();

ТабДокДата = Новый ТабличныйДокумент;

Область = Макет.ПолучитьОбласть("Заголовок|Заголовки");
Область.Параметры.ДатаРасшифровка = Формат(ДатаРасшифровка, "ДФ=dd.MM.yy");
ТабДокДата.Вывести(Область);

ОбластьЗаголовки = Макет.ПолучитьОбласть("Строка|Заголовки");
ТабДокДата.Вывести(ОбластьЗаголовки);

ОбластьЗаголовки = Макет.ПолучитьОбласть("ОтелиШапка|Заголовки");
ТабДокДата.Вывести(ОбластьЗаголовки);

Для Каждого Строка Из ТЗОтели Цикл
	ОбластьЗаголовки = Макет.ПолучитьОбласть("ОтелиСтрока|Заголовки");
	ОбластьЗаголовки.Параметры.Отель = Строка.Отель;
	
	ТабДокДата.Вывести(ОбластьЗаголовки);
КонецЦикла;
ТабДок.Присоединить(ТабДокДата);

ОтборСтроки = Новый Структура("Отель", Справочники.КонкурентыОтели.ПустаяСсылка());
ТЗДаты = ТЗ.Скопировать(ОтборСтроки);
ТЗДаты.Свернуть("ДатаЗадания, ЗанятоПроцент, СреднийADR, ГлубинаБронирования, НашаЦена, Цена");  

Для Каждого Строка Из ТЗДаты Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ОбластьДата = Макет.ПолучитьОбласть("Заголовок|Дата");
	ТабДокДата.Вывести(ОбластьДата);
	
	ОбластьДата = Макет.ПолучитьОбласть("Строка|Дата");
	ОбластьДата.Параметры.Дата = Формат(Строка.ДатаЗадания, "ДФ=dd.MM.yy");
	ОбластьДата.Параметры.ЗагрузкаПроцент = Строка.ЗанятоПроцент;
	ОбластьДата.Параметры.СреднийADR = Строка.СреднийADR;
	ОбластьДата.Параметры.НашаЦена = Строка.НашаЦена;
	ОбластьДата.Параметры.ГлубинаБронирования = Строка.ГлубинаБронирования;
	
	ЦенаТравелЛайн = СредняяЦенаКонкурентовАналитика(ТЗ, Строка.Цена);
 
	ОбластьДата.Параметры.ЦенаТравелЛайн = ЦенаТравелЛайн;

	ТабДокДата.Вывести(ОбластьДата);
		
	//ТабДокДата_1 = Новый ТабличныйДокумент;
	//ОбластьДата = Макет.ПолучитьОбласть("ОтелиШапка|Дата");
	//ТабДокДата_1.Вывести(ОбластьДата);
	//Для Каждого СтрокаОтель Из ТЗ Цикл
	//	Если ЗначениеЗаполнено(СтрокаОтель.Отель) Тогда
	//		ОбластьДата = Макет.ПолучитьОбласть("ОтелиСтрока|Дата");
	//		ОбластьДата.Параметры.Цена = ОтчетЦенаОтель(СтрокаОтель);
	//		
	//		ТабДокДата_1.Вывести(ОбластьДата);      
	//	КонецЕсли;
	//КонецЦикла;
	//ТабДокДата.Присоединить(ТабДокДата_1);
	
	ОбластьДата = Макет.ПолучитьОбласть("ОтелиШапка|Дата");
	ТабДокДата.Вывести(ОбластьДата);
	//Для Каждого СтрокаОтель Из ТЗ Цикл
	//	Если ЗначениеЗаполнено(СтрокаОтель.Отель) Тогда
	//		ОбластьДата = Макет.ПолучитьОбласть("ОтелиСтрока|Дата");
	//		ОбластьДата.Параметры.Цена = ОтчетЦенаОтель(СтрокаОтель);
	//		
	//		ТабДокДата.Вывести(ОбластьДата);      
	//	КонецЕсли;
	//КонецЦикла;
	
	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;

Возврат ТабДок;	
КонецФункции

Функция ПолучитьТабДокРасшифровкаКонкурентыЦенаАналитика_1(ДатаРасшифровка, Знач ТЗОтели) Экспорт
//ДатаРасшифровка = Расшифровка.Дата;	
	
Макет = Обработки.КалендарьЦен.ПолучитьМакет("РасшифровкаКонкурентыАналитика");
ТабДок = Новый ТабличныйДокумент;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентовАналитикаДанныеДата.Ссылка.ДатаЗадания КАК ДатаЗадания,
                      |	ЦеныКонкурентовАналитикаДанныеДата.ЗанятоПроцент КАК ЗанятоПроцент,
                      |	ЦеныКонкурентовАналитикаДанныеДата.СреднийADR КАК СреднийADR,
                      |	ЦеныКонкурентовАналитикаДанныеДата.ГлубинаБронирования КАК ГлубинаБронирования,
                      |	ЦеныКонкурентовАналитикаДанныеДата.НашаЦена КАК НашаЦена,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Отель КАК Отель,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Цена КАК Цена,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.ПродажиЗакрыты КАК ПродажиЗакрыты
                      |ИЗ
                      |	Документ.ЦеныКонкурентовАналитика.ДанныеДата КАК ЦеныКонкурентовАналитикаДанныеДата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЦеныКонкурентовАналитика.ДанныеОтели КАК ЦеныКонкурентовАналитикаДанныеОтели
                      |		ПО ЦеныКонкурентовАналитикаДанныеДата.Ссылка = ЦеныКонкурентовАналитикаДанныеОтели.Ссылка
                      |			И ЦеныКонкурентовАналитикаДанныеОтели.Дата = ЦеныКонкурентовАналитикаДанныеДата.Дата
                      |ГДЕ
                      |	ЦеныКонкурентовАналитикаДанныеДата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЦеныКонкурентовАналитикаДанныеДата.Дата = &Дата");


Запрос.УстановитьПараметр("Дата", ДатаРасшифровка);

ТЗ = Запрос.Выполнить().Выгрузить();

ТабДокДата = Новый ТабличныйДокумент;

Область = Макет.ПолучитьОбласть("Заголовок|Заголовки");
Область.Параметры.ДатаРасшифровка = Формат(ДатаРасшифровка, "ДФ=dd.MM.yy");
ТабДокДата.Вывести(Область);

ОбластьЗаголовки = Макет.ПолучитьОбласть("Строка|Заголовки");
ТабДокДата.Вывести(ОбластьЗаголовки);

ОбластьЗаголовки = Макет.ПолучитьОбласть("ОтелиШапка|Заголовки");
ТабДокДата.Вывести(ОбластьЗаголовки);

Для Каждого Строка Из ТЗОтели Цикл
	ОбластьЗаголовки = Макет.ПолучитьОбласть("ОтелиСтрока|Заголовки");
	ОбластьЗаголовки.Параметры.Отель = Строка.Отель;
	
	ТабДокДата.Вывести(ОбластьЗаголовки);
КонецЦикла;
ТабДок.Присоединить(ТабДокДата);

ОтборСтроки = Новый Структура("Отель", Справочники.КонкурентыОтели.ПустаяСсылка());
ТЗДаты = ТЗ.Скопировать(ОтборСтроки);
ТЗДаты.Свернуть("ДатаЗадания, ЗанятоПроцент, СреднийADR, ГлубинаБронирования, НашаЦена, Цена");  

Для Каждого Строка Из ТЗДаты Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ОбластьДата = Макет.ПолучитьОбласть("Заголовок|Дата");
	ТабДокДата.Вывести(ОбластьДата);
	
	ОбластьДата = Макет.ПолучитьОбласть("Строка|Дата");
	ОбластьДата.Параметры.Дата = Формат(Строка.ДатаЗадания, "ДФ=dd.MM.yy");
	ОбластьДата.Параметры.ЗагрузкаПроцент = Строка.ЗанятоПроцент;
	ОбластьДата.Параметры.СреднийADR = Строка.СреднийADR;
	ОбластьДата.Параметры.НашаЦена = Строка.НашаЦена;
	ОбластьДата.Параметры.ГлубинаБронирования = Строка.ГлубинаБронирования;
	
	ЦенаТравелЛайн = СредняяЦенаКонкурентовАналитика(ТЗ, Строка.Цена);
 
	ОбластьДата.Параметры.ЦенаТравелЛайн = ЦенаТравелЛайн;

	ТабДокДата.Вывести(ОбластьДата);
		
	ОбластьДата = Макет.ПолучитьОбласть("ОтелиШапка|Дата");
	ТабДокДата.Вывести(ОбластьДата);
	Для Каждого СтрокаОтель Из ТЗ Цикл
		Если ЗначениеЗаполнено(СтрокаОтель.Отель) Тогда
			ОбластьДата = Макет.ПолучитьОбласть("ОтелиСтрока|Дата");
			ОбластьДата.Параметры.Цена = ОтчетЦенаОтель(СтрокаОтель);
			
			ТабДокДата.Вывести(ОбластьДата);      
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;

Возврат ТабДок;	
КонецФункции


Функция СредняяЦенаКонкурентовАналитика(СтрокиОтели, ЦенаКонкурентовАналитика) Экспорт
Цена = 0; Количество = 0;
Для Каждого Строка Из СтрокиОтели Цикл
	Если НЕ ЗначениеЗаполнено(Строка.Отель) Тогда Продолжить; КонецЕсли;
	Если Строка.Цена = 0 Тогда Продолжить; КонецЕсли;
	Если Строка.ПродажиЗакрыты Тогда Продолжить; КонецЕсли;
	
	Цена = Цена + Строка.Цена;
	Количество = Количество + 1;
КонецЦикла;

Если Количество = 0	Тогда
	СредняяЦенаКонкурентовАналитика = ЦенаКонкурентовАналитика;
Иначе
	СредняяЦенаКонкурентовАналитика = Окр(Цена / Количество);
КонецЕсли;	

Возврат СредняяЦенаКонкурентовАналитика;
КонецФункции


Функция ОтчетЦенаОтель(СтрокаОтель) Экспорт
Если СтрокаОтель.ПродажиЗакрыты Тогда
	ОтчетЦенаОтель = "Х";
Иначе	
	ОтчетЦенаОтель = СтрокаОтель.Цена;
КонецЕсли;

Возврат ОтчетЦенаОтель;
КонецФункции

//
Функция ТЗАналитикаЗапросТекст() Экспорт
ТЗАналитикаЗапросТекст = "ВЫБРАТЬ
                         |	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗанятостьНомеров.ПериодРезерва, ЧАС, -13), ДЕНЬ) КАК ЗанятыйДень,
                         |	ЗанятостьНомеров.Номер КАК Номер,
                         |	ЗанятостьНомеров.Регистратор КАК Регистратор
                         |ПОМЕСТИТЬ ВТ_Бронь_Регистратор
                         |ИЗ
                         |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                         |ГДЕ
                         |	ЗанятостьНомеров.ПериодРезерва >= &ПериодНачало
                         |	И ЗанятостьНомеров.ПериодРезерва <= &ПериодКонец
                         |	И ЧАС(ЗанятостьНомеров.ПериодРезерва) <> ЧАС(ДАТАВРЕМЯ(1, 1, 1, 12, 0, 0))
                         |	И ЗанятостьНомеров.Номер <> &Номер
                         |	И ЗанятостьНомеров.Регистратор.ТипБронирования <> &ТипБронирования
                         |
                         |СГРУППИРОВАТЬ ПО
                         |	ЗанятостьНомеров.Номер,
                         |	ЗанятостьНомеров.Регистратор,
                         |	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗанятостьНомеров.ПериодРезерва, ЧАС, -13), ДЕНЬ)
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	Заявки.ЗанятыйДень КАК ЗанятыйДень,
                         |	Заявки.Номер КАК Номер,
                         |	Заявки.Регистратор КАК Регистратор,
                         |	ЕСТЬNULL(Проживание.Сумма, 0) КАК Сумма
                         |ПОМЕСТИТЬ ВТ_Бронь
                         |ИЗ
                         |	ВТ_Бронь_Регистратор КАК Заявки
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
                         |			СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма,
                         |			ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания
                         |		ИЗ
                         |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			ЗаявкаНаБронированиеПроживание.Ссылка,
                         |			ЗаявкаНаБронированиеПроживание.ДеньПроживания) КАК Проживание
                         |		ПО Заявки.Регистратор = Проживание.Ссылка
                         |			И Заявки.ЗанятыйДень = Проживание.ДеньПроживания
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК ОбщееКоличество,
                         |	НомернойФонд.КатегорияНомера КАК КатегорияНомера
                         |ПОМЕСТИТЬ ВТ_КоличествоНомеров
                         |ИЗ
                         |	Справочник.НомернойФонд КАК НомернойФонд
                         |ГДЕ
                         |	НЕ НомернойФонд.ПометкаУдаления
                         |	И НомернойФонд.Ссылка <> &Номер
                         |
                         |СГРУППИРОВАТЬ ПО
                         |	НомернойФонд.КатегорияНомера
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоЗанятых,
                         |	ВТ_Бронь.ЗанятыйДень КАК ЗанятыйДень,
                         |	НомернойФонд.КатегорияНомера КАК КатегорияНомера,
                         |	СУММА(ВЫБОР
                         |			КОГДА ВТ_Бронь.Регистратор.РезервС = ВТ_Бронь.ЗанятыйДень
                         |				ТОГДА РАЗНОСТЬДАТ(ВТ_Бронь.Регистратор.Дата, ВТ_Бронь.Регистратор.РезервС, ДЕНЬ)
                         |			ИНАЧЕ 0
                         |		КОНЕЦ) КАК СуммаГлубинаБрони,
                         |	СУММА(ВЫБОР
                         |			КОГДА ВТ_Бронь.Регистратор.РезервС = ВТ_Бронь.ЗанятыйДень
                         |				ТОГДА 1
                         |			ИНАЧЕ 0
                         |		КОНЕЦ) КАК КоличествоГлубинаБрони,
                         |	СУММА(ВТ_Бронь.Сумма) КАК Сумма
                         |ПОМЕСТИТЬ ВТ_Номера
                         |ИЗ
                         |	Справочник.НомернойФонд КАК НомернойФонд
                         |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Бронь КАК ВТ_Бронь
                         |		ПО (ВТ_Бронь.Номер = НомернойФонд.Ссылка)
                         |ГДЕ
                         |	НЕ НомернойФонд.ПометкаУдаления
                         |	И НомернойФонд.Ссылка <> &Номер
                         |
                         |СГРУППИРОВАТЬ ПО
                         |	ВТ_Бронь.ЗанятыйДень,
                         |	НомернойФонд.КатегорияНомера
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	ТабДата.День КАК День
                         |ПОМЕСТИТЬ ВТ_Дни
                         |ИЗ
                         |	&ТабДата КАК ТабДата
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	ВТ_Дни.День КАК День,
                         |	МАКСИМУМ(ВТ_КоличествоНомеров.ОбщееКоличество) КАК ОбщееКоличество,
                         |	ВТ_КоличествоНомеров.КатегорияНомера КАК КатегорияНомера
                         |ПОМЕСТИТЬ ВТ_ДниС
                         |ИЗ
                         |	ВТ_Дни КАК ВТ_Дни,
                         |	ВТ_КоличествоНомеров КАК ВТ_КоличествоНомеров
                         |
                         |СГРУППИРОВАТЬ ПО
                         |	ВТ_КоличествоНомеров.КатегорияНомера,
                         |	ВТ_Дни.День
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	ЕСТЬNULL(ВТ_Номера.КоличествоЗанятых, 0) КАК ЗанятыеНомера,
                         |	ВТ_ДниС.День КАК ПериодДень,
                         |	ВТ_ДниС.ОбщееКоличество КАК ОбщееКоличество,
                         |	ВТ_ДниС.КатегорияНомера КАК КатегорияНомера,
                         |	ВТ_ДниС.КатегорияНомера.Наименование КАК Наименование,
                         |	ВТ_ДниС.ОбщееКоличество - ЕСТЬNULL(ВТ_Номера.КоличествоЗанятых, 0) КАК СвободныеНомера,
                         |	ЕСТЬNULL(ВТ_Номера.СуммаГлубинаБрони, 0) КАК СуммаГлубинаБрони,
                         |	ЕСТЬNULL(ВТ_Номера.КоличествоГлубинаБрони, 0) КАК КоличествоГлубинаБрони,
                         |	ВТ_Номера.Сумма КАК СуммаADR
                         |ИЗ
                         |	ВТ_ДниС КАК ВТ_ДниС
                         |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номера КАК ВТ_Номера
                         |		ПО ВТ_ДниС.День = ВТ_Номера.ЗанятыйДень
                         |			И ВТ_ДниС.КатегорияНомера = ВТ_Номера.КатегорияНомера
                         |
                         |УПОРЯДОЧИТЬ ПО
                         |	ПериодДень,
                         |	ВТ_Номера.КатегорияНомера.Номер_пп,
                         |	ВТ_Номера.КатегорияНомера.Наименование
                         |ИТОГИ
                         |	СУММА(ЗанятыеНомера),
                         |	СУММА(ОбщееКоличество),
                         |	СУММА(СуммаГлубинаБрони),
                         |	СУММА(КоличествоГлубинаБрони),
                         |	СУММА(СуммаADR)
                         |ПО
                         |	ПериодДень";

					  //|	СРЕДНЕЕ(РАЗНОСТЬДАТ(ВТ_Бронь.Регистратор.Дата, ВТ_Бронь.Регистратор.РезервС, ДЕНЬ)) КАК ГлубинаБрони
					  
Возврат ТЗАналитикаЗапросТекст;
КонецФункции
// ++++++++++++++++++++++


