
Процедура ЗаполнитьПозицииЧекаККМОплатаГрупповойСчет(ПозицииЧекаККМ, ДокументДолгОбъектДанные) Экспорт
ПозицииЧекаККМ.Очистить();

ПозицииЧекаККМШаблон = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("КассовыйДокумент", "ЧекККМДетально");

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
//СтавкаНДС = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущаяОрганизация, "СтавкаНДС");  
//ВсеСНДС = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущаяОрганизация, "ВсеСНДС"); 

ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(ДокументДолгОбъектДанные);
УчитыватьНДС = ДокументыСервер.УчитыватьНДС_Чек(ДатаУчетаНДС);

СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС); 
ВсеСНДС = ТекущаяОрганизация.ВсеСНДС;

СуммаПроживание = 0; 
СуммаУслуги = 0; 
СуммаУслугиДляЕстьНДС = 0; 

//КоличествоСуток = 0;
Для Каждого СтрокаСчетаДолги Из ДокументДолгОбъектДанные.ДокументыДолги Цикл
	СчетГУИД = СтрокаСчетаДолги.СчетГУИД;
	ОтборСтроки = Новый Структура("СчетГУИД", СтрокаСчетаДолги.СчетГУИД); 
	НайденныеСтроки = СтрокаСчетаДолги.ДокументДолг.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
	Для Каждого Строка Из НайденныеСтроки Цикл
		Если Строка.Услуга Тогда Продолжить; КонецЕсли;
		
		СуммаПроживание = СуммаПроживание + Строка.СуммаДолг; 	
		//КоличествоСуток = КоличествоСуток + Строка.Количество;
	КонецЦикла;	

	Для Каждого Строка Из НайденныеСтроки Цикл
		Если НЕ Строка.Услуга Тогда Продолжить; КонецЕсли;
		
		Если Строка.ПрограммныйКодУслуги = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ Тогда 
			СуммаПроживание = СуммаПроживание + Строка.СуммаДолг; 	
		Иначе
	    	СуммаУслуги = СуммаУслуги + Строка.СуммаДолг; 
		КонецЕсли;
	КонецЦикла;	
КонецЦикла;

Если СуммаПроживание <> 0 Тогда 	
	НовЗапч = ОбщийФункционалСервер.СкопироватьСтруктуру(ПозицииЧекаККМШаблон);

	НовЗапч.Наименование="Проживание";

	НовЗапч.Количество=1;
	НовЗапч.Цена = СуммаПроживание;
	НовЗапч.Сумма = СуммаПроживание;
	
	НовЗапч.Скидка=0;
	
	Если УчитыватьНДС Тогда
		Если ВсеСНДС Тогда				
			НовЗапч.СтавкаНДС = СтавкаНДС;
			НовЗапч.СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, СуммаПроживание);
		Иначе
			Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС")
			ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка")
			Тогда
				СтавкаНДС_П = СтавкаНДС;
			Иначе
				СтавкаНДС_П = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
			КонецЕсли;
			
			НовЗапч.СтавкаНДС = СтавкаНДС_П;
			НовЗапч.СуммаНДС = 0;
		КонецЕсли;		
	КонецЕсли;
	
	ПозицииЧекаККМ.Добавить(НовЗапч);
КонецЕсли;

Если СуммаУслуги > 0 Тогда
	НовЗапч = ОбщийФункционалСервер.СкопироватьСтруктуру(ПозицииЧекаККМШаблон);
	
	НовЗапч.Наименование="Дополнительные услуги гостиницы";

	НовЗапч.Количество=1;
	НовЗапч.Цена = СуммаУслуги;
	НовЗапч.Сумма = СуммаУслуги;
	
	НовЗапч.Скидка=0;
	
	Если УчитыватьНДС Тогда
		НовЗапч.СтавкаНДС = СтавкаНДС;
		НовЗапч.СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, СуммаУслуги);
	КонецЕсли;
	
	ПозицииЧекаККМ.Добавить(НовЗапч);	
КонецЕсли;
КонецПроцедуры

Функция ДатаУчетаНДС(ДокументДолгОбъектДанные) Экспорт
ДатаУчета = '00010101'; 
Для Каждого СтрокаСчетаДолги Из ДокументДолгОбъектДанные.ДокументыДолги Цикл
	ДатаУчета = Макс(ДатаУчета, СтрокаСчетаДолги.ДокументДолг.РезервПо);
КонецЦикла;
	
Возврат ДатаУчета;	
КонецФункции

//
Функция ЗапросТекстОтборСчетовЗаявокГрупповойСчет() Экспорт 
ЗапросТекст = "ВЫБРАТЬ
              |	ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
              |	ЗаявкаНаБронированиеСчета.Контрагент КАК Оплачивает,
              |	ЗаявкаНаБронированиеСчета.Ссылка.Клиент КАК Клиент,
              |	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует КАК Бронирует,
              |	ЗаявкаНаБронированиеСчета.Ссылка.РезервС КАК РезервС,
              |	ЗаявкаНаБронированиеСчета.Ссылка.РезервПо КАК РезервПо,
              |	ЗаявкаНаБронированиеСчета.Ссылка.НомерВРезерв КАК НомерВРезерв,
              |	ЕСТЬNULL(ДолгиПроживание.СуммаДолг, 0) + ЕСТЬNULL(ДолгиУслуги.СуммаДолг, 0) КАК СуммаДолг,
              |	ЕСТЬNULL(ДолгиПроживание.СуммаДолг, 0) КАК СуммаПроживание,
              |	ЕСТЬNULL(ДолгиУслуги.СуммаДолг, 0) КАК СуммаУслуги,
              |	ЕСТЬNULL(ОплатыСумма.СуммаОплаты, 0) КАК СуммаОплаты,
              |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК Номер,
              |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК Дата,
              |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
              |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
              |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
              |	ЗаявкаНаБронированиеСчета.ТолькоПроживание КАК ТолькоПроживание,
              |	ЗаявкаНаБронированиеСчета.ТолькоУслуги КАК ТолькоУслуги
              |ИЗ
              |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
              |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
              |		ИЗ
              |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
              |		
              |		СГРУППИРОВАТЬ ПО
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК ОплатыСумма
              |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ОплатыСумма.Ссылка
              |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ОплатыСумма.СчетГУИД
              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
              |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ГрупповыеСчетаДокументыДолги.ДокументДолг
              |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ГрупповыеСчетаДокументыДолги.СчетГУИД
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ЗаявкаСчетаДетальноДолги.Ссылка КАК Ссылка,
              |			ЗаявкаСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
              |			ЗаявкаСчетаДетальноДолги.СуммаДолг КАК СуммаДолг
              |		ИЗ
              |			(ВЫБРАТЬ
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
              |				СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
              |			ИЗ
              |				Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
              |			ГДЕ
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
              |			
              |			СГРУППИРОВАТЬ ПО
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ЗаявкаСчетаДетальноДолги
              |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
              |				ПО ЗаявкаСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
              |					И ЗаявкаСчетаДетальноДолги.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД
              |		ГДЕ
              |			ВЫБОР
              |					КОГДА &ТолькоПроживание
              |						ТОГДА ЗаявкаНаБронированиеСчета.ТолькоПроживание = &ТолькоПроживание
              |					ИНАЧЕ ИСТИНА
              |				КОНЕЦ) КАК ДолгиПроживание
              |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ДолгиПроживание.Ссылка
              |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиПроживание.СчетГУИД
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ЗаявкаСчетДетальноДолги.Ссылка КАК Ссылка,
              |			ЗаявкаСчетДетальноДолги.СчетГУИД КАК СчетГУИД,
              |			ЗаявкаСчетДетальноДолги.СуммаДолг КАК СуммаДолг
              |		ИЗ
              |			(ВЫБРАТЬ
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
              |				СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
              |			ИЗ
              |				Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
              |			ГДЕ
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
              |			
              |			СГРУППИРОВАТЬ ПО
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
              |				ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ЗаявкаСчетДетальноДолги
              |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
              |				ПО ЗаявкаСчетДетальноДолги.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
              |					И ЗаявкаСчетДетальноДолги.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД
              |		ГДЕ
              |			ВЫБОР
              |					КОГДА &ТолькоУслуги
              |						ТОГДА ЗаявкаНаБронированиеСчета.ТолькоУслуги = &ТолькоУслуги
              |					ИНАЧЕ ИСТИНА
              |				КОНЕЦ) КАК ДолгиУслуги
              |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ДолгиУслуги.Ссылка
              |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиУслуги.СчетГУИД
              |ГДЕ
              |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
              |	И ЗаявкаНаБронированиеСчета.Ссылка.Проведен = ИСТИНА
			  //|	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
			  //|	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
              |	И ЗаявкаНаБронированиеСчета.Ссылка.Проведен = ИСТИНА
              |	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ИСТИНА
              |	И ВЫБОР
              |			КОГДА &ТолькоПроживание
              |				ТОГДА ЕСТЬNULL(ДолгиПроживание.СуммаДолг, 0) > 0
              |			КОГДА &ТолькоУслуги
              |				ТОГДА ЕСТЬNULL(ДолгиУслуги.СуммаДолг, 0) > 0
              |			ИНАЧЕ ЕСТЬNULL(ДолгиПроживание.СуммаДолг, 0) + ЕСТЬNULL(ДолгиУслуги.СуммаДолг, 0) > 0
              |		КОНЕЦ
              |	И ЗаявкаНаБронированиеСчета.Ссылка.РезервС >= &РезервС
              |	И ЗаявкаНаБронированиеСчета.Ссылка.РезервПо <= &РезервПо
              |	И ЗаявкаНаБронированиеСчета.Контрагент = &КонтрагентОтбор
              |	И ГрупповыеСчетаДокументыДолги.Ссылка ЕСТЬ NULL";
			   
Возврат ЗапросТекст;
КонецФункции

Функция ЗапросТекстОтборЗаявокКомиссияСчет() Экспорт 
ЗапросТекст = "ВЫБРАТЬ
              |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
              |	ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
              |	ЗаявкаНаБронирование.Клиент КАК Клиент,
              |	ЗаявкаНаБронирование.Бронирует КАК Бронирует,
              |	ЗаявкаНаБронирование.РезервС КАК РезервС,
              |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
              |	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
              |	ЗаявкаНаБронирование.Дата КАК Дата,
              |	ЗаявкаНаБронирование.Номер КАК Номер,
              |	ЕСТЬNULL(ДолгиПроживание.Сумма, 0) КАК СуммаПроживание,
              |	ЕСТЬNULL(ОплатыСумма.СуммаОплаты, 0) КАК ОплатаПроживание,
              |	КлиентыБронирует.ПроцентКомиссии КАК ПроцентКомиссии,
              |	ЕСТЬNULL(ДолгиПроживание.Сумма, 0) * КлиентыБронирует.ПроцентКомиссии / 100 КАК СуммаКомиссии,
              |	ГрупповыеСчетаКомиссияДокументыДолги.Ссылка КАК ГрупповойСчет
              |ИЗ
              |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
              |			СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма
              |		ИЗ
              |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
              |		
              |		СГРУППИРОВАТЬ ПО
              |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК ДолгиПроживание
              |		ПО ЗаявкаНаБронирование.Ссылка = ДолгиПроживание.Ссылка
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
              |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
              |		ИЗ
              |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
              |		ГДЕ
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ЛОЖЬ
              |		
              |		СГРУППИРОВАТЬ ПО
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка) КАК ОплатыСумма
              |		ПО ЗаявкаНаБронирование.Ссылка = ОплатыСумма.Ссылка
              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрупповыеСчета.КомиссияДокументыДолги КАК ГрупповыеСчетаКомиссияДокументыДолги
              |		ПО ЗаявкаНаБронирование.Ссылка = ГрупповыеСчетаКомиссияДокументыДолги.ДокументДолг
              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК КлиентыБронирует
              |		ПО ЗаявкаНаБронирование.Бронирует = КлиентыБронирует.Ссылка
              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК КлиентыОплачивает
              |		ПО ЗаявкаНаБронирование.Оплачивает = КлиентыОплачивает.Ссылка
              |ГДЕ
              |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
              |	И ЗаявкаНаБронирование.Проведен = ИСТИНА
              |	И ВЫБОР
              |			КОГДА &Все
              |				ТОГДА ИСТИНА
              |			ИНАЧЕ ГрупповыеСчетаКомиссияДокументыДолги.Ссылка ЕСТЬ NULL
              |		КОНЕЦ
              |	И ЗаявкаНаБронирование.РезервС >= &РезервС
              |	И ЗаявкаНаБронирование.РезервПо <= &РезервПо
              |	И ЗаявкаНаБронирование.Бронирует = &КонтрагентОтбор
              |	И ВЫБОР
              |			КОГДА ЗаявкаНаБронирование.Бронирует.ТипОплатыСчета = ЗНАЧЕНИЕ(Перечисление.ТипОплатыСчета.ПолнаяОплатаТурагентствомСВозвратомКомиссии)
              |				ТОГДА ИСТИНА
              |			ИНАЧЕ ЗаявкаНаБронирование.Оплачивает <> ЗаявкаНаБронирование.Бронирует
              |		КОНЕЦ";

Возврат ЗапросТекст;
КонецФункции
//

//
Функция СуммаКОплатеГрупповойСчет(ДокументДолгОбъектДанные) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЕСТЬNULL(СУММА(ЕСТЬNULL(ЗаявкиДолги.СуммаКЗакрытию, 0)), 0) КАК СуммаКЗакрытию
                      |ИЗ
                      |	Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ЗаявкиДолги
                      |		ПО ГрупповыеСчетаДокументыДолги.ДокументДолг = ЗаявкиДолги.Ссылка
                      |			И ГрупповыеСчетаДокументыДолги.СчетГУИД = ЗаявкиДолги.СчетГУИД
                      |ГДЕ
                      |	ГрупповыеСчетаДокументыДолги.Ссылка = &ДокументДолг");

Запрос.УстановитьПараметр("ДокументДолг", ДокументДолгОбъектДанные.Ссылка); 

Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();

Возврат Выборка.СуммаКЗакрытию;
КонецФункции

Функция ЕстьОплатыГрупповогоСчета(ГрупповойСчет) Экспорт
ЕстьОплатыГрупповогоСчета = ГрупповойСчет.ДокументыОплаты.Количество() > 0;	
Возврат ЕстьОплатыГрупповогоСчета; 
КонецФункции

Процедура УдалитьДокументДолгГрупповойСчет(ДокументДолг, СчетГУИД) Экспорт
Заявкаобъект = ДокументДолг.Получитьобъект();
Если Заявкаобъект = Неопределено Тогда Возврат; КонецЕсли; 

ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = Заявкаобъект.Счета.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() = 0 Тогда Возврат; КонецЕсли;

Счет = НайденныеСтроки[0];

Если Счет.ЭтоПредварительныйГрупповойСчет Тогда
	Счет.ГрупповойСчет = Неопределено;
	
	НайденныеСтроки = Заявкаобъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
	Для Каждого Строка Из НайденныеСтроки Цикл
		Строка.ГрупповойСчет = Ложь;		
	КонецЦикла;
	
Иначе
	ЗаявкаСервер.УдалитьДанныеСчета(СчетГУИД, Заявкаобъект);
	Заявкаобъект.Счета.Удалить(Счет);
КонецЕсли;

Заявкаобъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

Функция ДобавитьОплатаЗачет(СуммаОплаты, Приход, Объект) Экспорт
ПрочиеОплатыОбъект = Документы.ПрочиеОплаты.СоздатьДокумент();
ПрочиеОплатыОбъект.Дата = ТекущаяДата();

ПрочиеОплатыОбъект.ДатаОплаты= ТекущаяДата();

ПрочиеОплатыОбъект.ВидОперации = Справочники.ВидыОпераций.Взаимозачет;

//ПрочиеОплатыОбъект.Приход = Истина;
ПрочиеОплатыОбъект.Приход = Приход;

ПрочиеОплатыОбъект.ОтКого = Объект.Контрагент;
ПрочиеОплатыОбъект.Сумма = СуммаОплаты;

ПрочиеОплатыОбъект.Основание = Объект.Ссылка;

НоваяСтрока = ПрочиеОплатыОбъект.ДолгиОплата.Добавить();
НоваяСтрока.ДокументДолг = Объект.Ссылка; 
НоваяСтрока.СчетГУИД = Объект.СчетГУИД; 
НоваяСтрока.Сумма = СуммаОплаты; 

ПрочиеОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);

Возврат ПрочиеОплатыОбъект.Ссылка; 
КонецФункции
//

//
Процедура ДобавитьСчетЗаявкиВГрупповомСчете(ДокументДолг, СчетГУИД, ГрупповойСчетОбъект, ГрупповойСчетСсылка
	, ТолькоПроживание, ТолькоУслуги) Экспорт

ДокументДолгОбъект = ДокументДолг.ПолучитьОбъект();

ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСчета = ДокументДолгОбъект.Счета.НайтиСтроки(ОтборСтроки);
Счет = НайденныеСчета[0];

Счет.ГрупповойСчет = ГрупповойСчетСсылка;

НайденныеСтроки = ДокументДолгОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
Для Каждого Строка Из НайденныеСтроки Цикл
	Строка.ГрупповойСчет = Истина;		
КонецЦикла;

ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);

НоваяСтрока = ГрупповойСчетОбъект.ДокументыДолги.Добавить();
НоваяСтрока.ДокументДолг = ДокументДолг;
НоваяСтрока.СчетГУИД = СчетГУИД;
КонецПроцедуры
//

////
Процедура УдалитьДокументОплатыИзДокументДолги(ДокументОплаты, Объект) Экспорт
// + Удаление оплат из Заявок
Для каждого Строка Из Объект.ДокументыДолги Цикл 	
	ДокументДолгОбъект = Строка.ДокументДолг.ПолучитьОбъект(); 

	Если ДокументДолгОбъект.СчетаДетальноОплаты.Найти(ДокументОплаты, "ДокументОплаты") 
		= Неопределено Тогда Продолжить; КонецЕсли;
		
	ЗаявкаСервер.УдалитьДокументОплаты(ДокументОплаты, ДокументДолгОбъект); 
	
	ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;	
// - Удаление оплат из Заявок
КонецПроцедуры

//
Функция ДобавитьИЗаписатьДокументОплатыВГрупповойСчетОбъектТранзакция(ДокументОплаты, ГрупповойСчетОбъектДанные, СуммаОплаты)  Экспорт
НачатьТранзакцию();	
ДобавитьИЗаписатьДокументОплатыВГрупповойСчетОбъект(ДокументОплаты, ГрупповойСчетОбъектДанные, СуммаОплаты);
ЗафиксироватьТранзакцию();	
КонецФункции

Функция ДобавитьИЗаписатьДокументОплатыВГрупповойСчетОбъект(ДокументОплаты, ГрупповойСчетОбъектДанные, СуммаОплаты)  Экспорт
	
ДанныеОплаты = ГрупповойСчетСервер.РаспределитьДокументОплатыГрупповойСчетОбъект(ДокументОплаты
	, ГрупповойСчетОбъектДанные, СуммаОплаты); 
	
ГрупповойСчетСервер.ЗаписатьДанныеОплатаГрупповойСчетВДокумент(ДанныеОплаты, ГрупповойСчетОбъектДанные.Ссылка);  

ГрупповойСчетОбъект = ГрупповойСчетОбъектДанные.Ссылка.ПолучитьОбъект();
ГрупповойСчетСервер.ЗаполнитьДокументОплатыДолгОплатаДляГрупповойСчет(ДокументОплаты
	, ГрупповойСчетОбъект);
КонецФункции

Функция ЗаписатьДанныеОплатаГрупповойСчетВДокумент(ДанныеОплата, ГрупповойСчетСсылка)  Экспорт
ГрупповойСчетОбъект = ГрупповойСчетСсылка.ПолучитьОбъект();

ЗаполнитьДанныеОплатаГрупповойСчетВДокумент(ДанныеОплата, ГрупповойСчетОбъект);	

ГрупповойСчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецФункции
//

//
Функция ДобавитьИЗаполнитьДокументОплатыВГрупповойСчетОбъект(ДокументОплаты, Объект, СуммаОплаты)  Экспорт
	
ДанныеОплаты = ГрупповойСчетСервер.РаспределитьДокументОплатыГрупповойСчетОбъект(ДокументОплаты
	, Объект, СуммаОплаты); 
	
ГрупповойСчетСервер.ЗаполнитьДанныеОплатаГрупповойСчетВДокумент(ДанныеОплаты, Объект);  

ГрупповойСчетСервер.ЗаполнитьДокументОплатыДолгОплатаДляГрупповойСчет(ДокументОплаты, Объект);
КонецФункции

Функция РаспределитьДокументОплатыГрупповойСчетОбъект(ДокументОплаты, ГрупповойСчетОбъектДанные, СуммаОплаты)  Экспорт
ОстатокСуммаОплаты =  СуммаОплаты;

ДобавленныеРаспределениеОплат = ГрупповойСчетОбъектДанные.РаспределениеОплат.Выгрузить(Новый Массив);
ГрупповойСчетРаспределениеОплатШаблон = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("ГрупповыеСчета", "РаспределениеОплат");

СуммаОплатыГрупповойСчет = 0;
Для Каждого Строка Из ГрупповойСчетОбъектДанные.ДокументыДолги Цикл
	// + Добавление оплаты в Заявку
	ЗаявкаОбъект = Строка.ДокументДолг.ПолучитьОбъект();
	СчетГУИД = Строка.СчетГУИД; 
	
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД); 
	СчетаДетальноДолги = ЗаявкаОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
	
	СуммаСчетаКЗакрытию = 0;
	Для Каждого СтрокаСчетаДетальноДолги Из СчетаДетальноДолги Цикл
		СуммаСчетаКЗакрытию = СуммаСчетаКЗакрытию + СтрокаСчетаДетальноДолги.СуммаКЗакрытию;
	КонецЦикла;

	Если СуммаСчетаКЗакрытию = 0 Тогда Продолжить; КонецЕсли;
	
	Если ОстатокСуммаОплаты <= СуммаСчетаКЗакрытию Тогда  
		СуммаОплатыЗаявка = ОстатокСуммаОплаты;
	Иначе 
		СуммаОплатыЗаявка = СуммаСчетаКЗакрытию;
	КонецЕсли;	
	СуммаОплатыЗаявка_П = СуммаОплатыЗаявка;

	ОстатокСуммаОплаты = ОстатокСуммаОплаты - СуммаСчетаКЗакрытию;
	
	СчетаДетальноОплаты = ЗаявкаОбъект.СчетаДетальноОплаты; 
	СтрокаОплаты = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(СчетаДетальноОплаты, ДокументОплаты, Истина);
	
	РаспределениеОплатДолги = ЗаявкаОбъект.РаспределениеОплатДолги;
	Ответ = ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(СтрокаОплаты
		, СуммаОплатыЗаявка, СчетаДетальноДолги, РаспределениеОплатДолги); 	
	
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	// - Добавление оплаты в Заявку

	ГрупповойСчетРаспределениеОплат = ОбщийФункционалСервер.СкопироватьСтруктуру(ГрупповойСчетРаспределениеОплатШаблон);
	ГрупповойСчетРаспределениеОплат.ДокументОплаты = ДокументОплаты; 
	ГрупповойСчетРаспределениеОплат.ДокументДолг = ЗаявкаОбъект.Ссылка;
	
	// + ПСН 24.02.25
	ГрупповойСчетРаспределениеОплат.СчетГУИД = СчетГУИД; 
	// - ПСН 24.02.25
	
	ГрупповойСчетРаспределениеОплат.СуммаОплаты = СуммаОплатыЗаявка_П; 
	
	НовыйДобавленныйРаспределениеОплат = ДобавленныеРаспределениеОплат.Добавить(); 
	ЗаполнитьЗначенияСвойств(НовыйДобавленныйРаспределениеОплат, ГрупповойСчетРаспределениеОплат);
	
	СуммаОплатыГрупповойСчет = СуммаОплатыГрупповойСчет + СуммаОплатыЗаявка_П;
	
	Если ОстатокСуммаОплаты <= 0 Тогда Прервать; КонецЕсли;
КонецЦикла;

Если ОстатокСуммаОплаты < 0 Тогда 
	ОстатокСуммаДокументОплаты = 0;
Иначе
	ОстатокСуммаДокументОплаты = ОстатокСуммаОплаты; 
КонецЕсли;

Результат = Новый Структура;
Результат.Вставить("ДокументОплаты", ДокументОплаты); 

Результат.Вставить("СуммаОплаты", СуммаОплатыГрупповойСчет); 
//Результат.Вставить("СуммаОплаты", СуммаОплаты); 

Результат.Вставить("ОстатокКРаспределению", ОстатокСуммаДокументОплаты); 
//Результат.Вставить("ОстатокКРаспределению", 0); 
МассивДобавленныеРаспределениеОплат = ОбщийФункционалСервер.ТаблицаЗначенийВМассивСтруктур(ДобавленныеРаспределениеОплат);
Результат.Вставить("МассивДобавленныеРаспределениеОплат", МассивДобавленныеРаспределениеОплат); 
Возврат  Результат;
КонецФункции

Функция ЗаполнитьДанныеОплатаГрупповойСчетВДокумент(ДанныеОплата, Объект)  Экспорт
ДокументОплаты = ДанныеОплата.ДокументОплаты;
ОстатокКРаспределению = ДанныеОплата.ОстатокКРаспределению;
МассивДобавленныеРаспределениеОплат = ДанныеОплата.МассивДобавленныеРаспределениеОплат;
СуммаОплаты = ДанныеОплата.СуммаОплаты;

Для каждого Строка Из МассивДобавленныеРаспределениеОплат Цикл 
	ОтборСтрок = Новый Структура("ДокументОплаты, ДокументДолг, СчетГУИД"
		, ДокументОплаты, Строка.ДокументДолг, Строка.СчетГУИД);
	НайденныеСтроки = Объект.РаспределениеОплат.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда   
		НоваяСтрока = Объект.РаспределениеОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	Иначе
		СтрокаРаспределениеОплат = НайденныеСтроки[0];  
		СтрокаРаспределениеОплат.СуммаОплаты = СтрокаРаспределениеОплат.СуммаОплаты + Строка.СуммаОплаты;
	КонецЕсли;
КонецЦикла;

ОтборСтрок = Новый Структура("ДокументОплаты", ДокументОплаты);
НайденныеСтроки = Объект.ДокументыОплаты.НайтиСтроки(ОтборСтрок);
Если НайденныеСтроки.Количество() = 0 Тогда   
	СтрокаОплаты = Объект.ДокументыОплаты.Добавить();
	СтрокаОплаты.ДокументОплаты = ДокументОплаты; 
Иначе
	СтрокаОплаты = НайденныеСтроки[0]; 
КонецЕсли;

СтрокаОплаты.СуммаРаспределено = СтрокаОплаты.СуммаРаспределено + СуммаОплаты;  
КонецФункции
//

Функция ЗаполнитьДокументОплатыДолгОплатаДляГрупповойСчет(ДокументОплаты, ДокументДолгОбъект) Экспорт 
ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);
ТЗ = ДокументДолгОбъект.РаспределениеОплат.Выгрузить(ОтборСтроки, "ДокументОплаты, СуммаОплаты");
ТЗ.Свернуть("ДокументОплаты", "СуммаОплаты"); 

Для Каждого Строка Из ТЗ Цикл
	ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты
		, ДокументДолгОбъект.Ссылка, ДокументДолгОбъект.СчетГУИД, Строка.СуммаОплаты, Истина); 
КонецЦикла;	
КонецФункции	

//
Процедура ПерераспределитьОплаты(Объект) Экспорт
// + Перераспределение остатков оплат 
Для Каждого СтрокаОплата Из Объект.ДокументыОплаты Цикл
	ДокументОплаты = СтрокаОплата.ДокументОплаты;
	
	//Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент")
	//ИЛИ	 ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка")
	//Тогда 
		// + Удаление оплат из Заявок
		ГрупповойСчетСервер.УдалитьДокументОплатыИзДокументДолги(ДокументОплаты, Объект);
		// - Удаление оплат из Заявок
		
		// + Удаление оплат из РаспределенияОплат
		ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);
		МассивКУдалению = Объект.РаспределениеОплат.НайтиСтроки(ОтборСтроки);
		ОбщийФункционалСервер.УдалитьСтроки(Объект.РаспределениеОплат, МассивКУдалению);
		// + Удаление оплат из РаспределенияОплат
	
		СуммаОстаткаОплаты = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(ДокументОплаты, Объект);
		
		// + Обнуление строки оплаты
		СтрокаОплата.СуммаРаспределено = 0;
		// - Обнуление строки оплаты
		
		ГрупповойСчетСервер.ДобавитьИЗаполнитьДокументОплатыВГрупповойСчетОбъект(ДокументОплаты
			, Объект, СуммаОстаткаОплаты);
	//КонецЕсли;
КонецЦикла;        
 // - Перераспределение остатков оплат 
КонецПроцедуры
//

//
Функция УменьшитьОплатыГрупповойСчетСуммаВозврата(ДокументОплаты, ДокументДолг) Экспорт
Если ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.КассовыйДокумент") 
И ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.ВыпискаБанка") Тогда Возврат Неопределено; КонецЕсли;
	
ДокументДолгОбъект = ДокументДолг.ПолучитьОбъект();
Если ДокументДолгОбъект = Неопределено Тогда Возврат Неопределено; КонецЕсли;

НачатьТранзакцию();

Для Каждого Строка Из ДокументДолгОбъект.РаспределениеОплат Цикл
	ДокументСтрока = Строка.ДокументДолг;
	ДокументСтрокаОбъект = ДокументСтрока.ПолучитьОбъект();
	
	ЗаявкаСервер.УдалитьДокументОплаты(ДокументОплаты, ДокументСтрокаОбъект); 

	ДокументСтрокаОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;

ОборСтрокиДокументОплаты = Новый Структура("ДокументОплаты", ДокументОплаты); 
РаспределениеОплат = ДокументДолгОбъект.РаспределениеОплат;
НайденныеСтрокиРаспределениеОплат = РаспределениеОплат.НайтиСтроки(ОборСтрокиДокументОплаты);
ОбщийФункционалСервер.УдалитьСтроки(РаспределениеОплат, НайденныеСтрокиРаспределениеОплат);
ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОборСтрокиДокументОплаты, ДокументДолгОбъект.ДокументыОплаты);

ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);

ОплатыОбщееСервер.УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты, ДокументДолг, ДокументДолг.СчетГУИД);

Запрос = Новый Запрос;
Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
	Запрос.Текст = "ВЫБРАТЬ
	               |	КассовыйДокумент.Ссылка КАК Ссылка,
	               |	КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) КАК ОстатокОплаты,
	               |	КассовыйДокумент.Сумма КАК СуммаДокументОплаты
	               |ИЗ
	               |	Документ.КассовыйДокумент КАК КассовыйДокумент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
	               |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент
	               |		ИЗ
	               |			Документ.КассовыйДокумент КАК КассовыйДокумент
	               |		ГДЕ
	               |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
	               |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
	               |ГДЕ
	               |	КассовыйДокумент.Ссылка = &Ссылка";
	
ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыпискаБанка.Ссылка КАК Ссылка,
	               |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) КАК ОстатокОплаты,
	               |	ВыпискаБанка.Сумма КАК СуммаДокументОплаты
	               |ИЗ
	               |	Документ.ВыпискаБанка КАК ВыпискаБанка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СУММА(ВыпискаБанка.Сумма) КАК Сумма,
	               |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент
	               |		ИЗ
	               |			Документ.ВыпискаБанка КАК ВыпискаБанка
	               |		ГДЕ
	               |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
	               |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
	               |ГДЕ
	               |	ВыпискаБанка.Ссылка = &Ссылка";
КонецЕсли;
		
Запрос.УстановитьПараметр("Ссылка", ДокументОплаты);
ТЗ = Запрос.Выполнить().Выгрузить();
СтрокаОплаты = ТЗ[0];		   
ОстатокСуммаОплаты = СтрокаОплаты.ОстатокОплаты;  

Если ОстатокСуммаОплаты > 0 Тогда
	ГрупповойСчетСервер.ДобавитьИЗаписатьДокументОплатыВГрупповойСчетОбъект(ДокументОплаты, ДокументДолгОбъект
		, ОстатокСуммаОплаты); 	
КонецЕсли;
	
ЗафиксироватьТранзакцию();
КонецФункции	

////

Функция СледующийНомерСчета_НеИспользуется(Счета) 
МаксНомер = 0;
Для Каждого Строка Из Счета Цикл
	МаксНомер = Макс(Строка.НомерСчета, МаксНомер); 	
КонецЦикла;

Возврат МаксНомер + 1; 	
КонецФункции

