
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ЭтоРасход", ЭтоРасход); 	
Параметры.Свойство("ЭтоСписание", ЭтоСписание); 	

Если ЭтоРасход Тогда
	
ИначеЕсли ЭтоСписание Тогда	
	Объект.Списание = Истина;
		
ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда	
	Объект.Списание = Истина;
КонецЕсли;

Если Объект.Списание Тогда
	Элементы.ДекорацияНадпись.Заголовок = "Списание";
	Элементы.ДатаДокументаРасхода.ТолькоПросмотр = Ложь;
	
	Элементы.РасходДокументИсточник.Видимость = Ложь;
	Элементы.РасходНомерОтель.Видимость = Ложь;
	
	Элементы.РасходЦена.Видимость = Ложь;
	Элементы.РасходСумма.Видимость = Ложь;
	
	Элементы.РасходТипСписания.Видимость = Истина;
	
Иначе
	Элементы.ДекорацияНадпись.Заголовок = "Расход";
	Элементы.ДатаДокументаРасхода.ТолькоПросмотр = Истина;
	
	Если Объект.Программно Тогда
		Элементы.РасходДокументИсточник.Видимость = Истина;
		Элементы.РасходНомерОтель.ТолькоПросмотр = Истина;
	Иначе
		Элементы.РасходДокументИсточник.Видимость = Ложь;
		Элементы.РасходНомерОтель.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Элементы.РасходТипСписания.Видимость = Истина;
КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
Для Каждого Строка Из Объект.Расход Цикл
	Строка.Сумма = Окр(Строка.Количество * Строка.Цена, 2);	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасходНомеклатураПриИзменении(Элемент)
ТекущаяСтрока = Элементы.Расход.ТекущаяСтрока;
РасходНомеклатураПриИзмененииНаСервере(ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура РасходНомеклатураПриИзмененииНаСервере(ТекущаяСтрока)
ТекущиеДанные = Объект.Расход.НайтиПоИдентификатору(ТекущаяСтрока);

Если Объект.Списание Тогда 
	ТекущиеДанные.Цена = 0;
Иначе
	ТекущиеДанные.Цена = ТекущиеДанные.Номенклатура.Цена;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасходПередНачаломИзменения(Элемент, Отказ)
ТекущиеДанные = Элемент.ТекущиеДанные;	
Расход_OldValue.Очистить();
НоваяСтрока = Расход_OldValue.Добавить();

ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасходПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
ТекущиеДанные = Элемент.ТекущиеДанные;

Если ОтменаРедактирования Тогда 
	Если НЕ НоваяСтрока Тогда
		Строка = Расход_OldValue[0];
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Строка);
	КонецЕсли;	
		
	Возврат;	
КонецЕсли;	

//Если ТекущиеДанные.ДатаРасхода < НачалоМесяца(Объект.ДатаДокументаРасхода)
//ИЛИ ТекущиеДанные.ДатаРасхода > КонецМесяца(Объект.ДатаДокументаРасхода)
//Тогда 
//	ПоказатьПредупреждение(, "ДатаРасхода д. б. >= " + НачалоМесяца(Объект.ДатаДокументаРасхода) + "
//							 |ИЛИ ДатаРасхода д. б. <= " + КонецМесяца(Объект.ДатаДокументаРасхода));
//	
//	Отказ = Истина;
//	Возврат;
//КонецЕсли;

ТекстОшибки = ПроверкаДатаРасхода(ТекущиеДанные);
Если ТекстОшибки <> "" Тогда
	ПоказатьПредупреждение(, ТекстОшибки);
	Отказ = Истина; Возврат;
КонецЕсли;
	
Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда 
	ПоказатьПредупреждение(, "Заполните номенклатуру ...");
	
	Отказ = Истина; Возврат;
КонецЕсли;

ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Цена * ТекущиеДанные.Количество, 2);	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаДатаРасхода(ТекущиеДанные)
ТекстОшибки = "";	
Если ТекущиеДанные.ДатаРасхода < НачалоМесяца(Объект.ДатаДокументаРасхода)
ИЛИ ТекущиеДанные.ДатаРасхода > КонецМесяца(Объект.ДатаДокументаРасхода)
Тогда 
	ТекстОшибки = "ДатаРасхода: " + Формат(ТекущиеДанные.ДатаРасхода, "ДФ=dd.MM.yy") 
		+ " д. б. >= " + Формат(НачалоМесяца(Объект.ДатаДокументаРасхода), "ДФ=dd.MM.yy")+ "
			| ИЛИ ДатаРасхода д. б. <= " + Формат(КонецМесяца(Объект.ДатаДокументаРасхода), "ДФ=dd.MM.yy");
КонецЕсли;

Возврат ТекстОшибки;
КонецФункции

&НаКлиенте
Процедура РасходПриАктивизацииСтроки(Элемент)
ТекущиеДанные = Элемент.ТекущиеДанные; 
Если ТекущиеДанные <> Неопределено Тогда 
	Элементы.РасходНомерОтель.ТолькоПросмотр = ЗначениеЗаполнено(ТекущиеДанные.ДокументИсточник); 
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
ТекстОшибки = "";	
Для Каждого Строка Из Объект.Расход Цикл
	ТекстОшибки_П = ПроверкаДатаРасхода(Строка);
	Если ТекстОшибки_П <> "" Тогда
		ТекстОшибки_П = "Номер строки " + Строка.НомерСтроки + ": " + ТекстОшибки_П;
		ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, ТекстОшибки_П, Символы.ПС);  
	КонецЕсли;
КонецЦикла;

Если ТекстОшибки <> "" Тогда 
	ТекстПредупреждения = ТекстОшибки + "
		|
		|ЗАПИСЬ ОТМЕНЯЕТСЯ ...";
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
	ТекстСообщения = ТекстОшибки + "
		|ЗАПИСЬ ОТМЕНЯЕТСЯ ...";
	Сообщить(ТекстСообщения);
	
	Отказ = Истина; Возврат	
КонецЕсли;
КонецПроцедуры



