
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Поля = Новый Массив;
Поля.Добавить("ПолныйПутьРодитель");

Список.УстановитьОграниченияИспользованияВГруппировке(Поля);
Список.УстановитьОграниченияИспользованияВОтборе(Поля);
Список.УстановитьОграниченияИспользованияВПорядке(Поля);
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ТД = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
 
ЗавершитьВыбор(ТД);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКлиента(Команда)
ТД = Элементы.Список.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ЗавершитьВыбор(ТД);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыбор(ТД)
Если ТД.ЭтоГруппа Тогда Возврат; КонецЕсли;	
	
ЗначениеВыбора = ТД.Клиент; 	
ОповеститьОВыборе(ЗначениеВыбора);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
Для Каждого СтрокаСписка Из Строки Цикл
	ТекущийРодитель = "";
	ОбщийФункционалСервер.ПолнаяПапкаРодитель(СтрокаСписка.Ключ, ТекущийРодитель); 
	СтрокаСписка.Значение.Данные["ПолныйПутьРодитель"] = ТекущийРодитель;	
КонецЦикла;
КонецПроцедуры



