
&НаКлиенте
Процедура СоздатьПлатеж(Команда)
СоединениеPayKeeper = ПолучитьСоединение();
Если СоединениеPayKeeper.Ошибка Тогда Сообщить(СоединениеPayKeeper.Описание); Возврат; КонецЕсли;

Плательщик = "ПСН";
НомерСчёта = "Тест Номер счета";
НаименованиеУслуги = "Тест Услуга";
СуммаПлатежа = 1;
EmailОтсылкиЧека = "psn.invina@gmail.com";
ТелефонОтсылкиСМСУведомления = "+79826236241";

Результат = PayKeeper.ПолучитьQRКод(СоединениеPayKeeper, Плательщик, НомерСчёта, НаименованиеУслуги, СуммаПлатежа, EmailОтсылкиЧека, ТелефонОтсылкиСМСУведомления) ;
Если Результат.Ошибка Тогда Сообщить(Результат.Описание); Возврат; КонецЕсли;

ИдПлатежа = Результат.ИдПлатежа;
АдресКартинки = Результат.АдресКартинки;

ДанныеКартинкиBase64 = Результат.ДанныеКартинкиBase64; 
ДвоичныеДанныеКартинки = Base64Значение(ДанныеКартинкиBase64);

Если ЭтаФорма.КлючУникальности = Неопределено Тогда
	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор();
Иначе
	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор(ЭтаФорма.КлючУникальности);
КонецЕсли;	
QR_Картинка = ПоместитьВоВременноеХранилище(Новый Картинка(ДвоичныеДанныеКартинки), УникальныйИдентификаторФормы);

ИмяФайла = ПолучитьИмяВременногоФайла("jpg");
ДвоичныеДанныеКартинки.Записать(ИмяФайла);
МассивФайлов = Новый Массив;
МассивФайлов.Добавить(ИмяФайла);

МассивПолучатели = Новый Массив;
EmailПолучателя = "psn.invina@gmail.com";
МассивПолучатели.Добавить(EmailПолучателя);

Тема = "Счет на оплату";

ТекстСообщения = "";
ТекстСообщения = ТекстСообщения + "Счет";

ТекстСообщения = ТекстСообщения + Символы.ПС + + Символы.ПС;  
ТекстСообщения = "Адрес картинки: " + АдресКартинки;

Если ЭтаФорма.КлючУникальности = Неопределено Тогда
	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор();
Иначе
	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор(ЭтаФорма.КлючУникальности);
КонецЕсли;	
ФайлыКУдалению = МассивФайлов;

СлужебныеКлиент.ОтправитьEmail(Тема, МассивФайлов, МассивПолучатели, ТекстСообщения
	, ФайлыКУдалению, УникальныйИдентификаторФормы);

//СлужебныеСервер.ОтправитьWhatsApp("+79826236241", АдресКартинки);
МесенджерСервер.ОтправитьДанные_Месенджер("ОтправитьСсылка", "+79826236241", "", Неопределено, АдресКартинки);

Картинка = ПолучитьИзВременногоХранилища(QR_Картинка);
ДвоичныеДанныеКартинки = Картинка.ПолучитьДвоичныеДанные(); 
Изображение = Base64Строка(ДвоичныеДанныеКартинки);
//СлужебныеСервер.ОтправитьWhatsApp("+79826236241", Изображение);
МесенджерСервер.ОтправитьДанные_Месенджер("ОтправитьФайлИТекст", "+79826236241", Изображение, Неопределено, Неопределено );

СлужебныеСервер.ОтправитьBytehand("+79826236241", АдресКартинки);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСоединение()
Адрес = "renomme-hotel.server.paykeeper.ru";
ИмяПользователя = "admin";
ПарольПользователя = "puPW0Mag2QmMXk7w"; 
СоединениеPayKeeper_П = PayKeeper.СоздатьСоединение(Адрес, ИмяПользователя, ПарольПользователя);

Возврат СоединениеPayKeeper_П;
КонецФункции

&НаСервере
Функция ПолучитьСоединениеСервер()
Адрес = "renomme-hotel.server.paykeeper.ru";
ИмяПользователя = "admin";
ПарольПользователя = "puPW0Mag2QmMXk7w"; 
СоединениеPayKeeper_П = PayKeeper.СоздатьСоединение(Адрес, ИмяПользователя, ПарольПользователя);

Возврат СоединениеPayKeeper_П;
КонецФункции

&НаКлиенте
Процедура ПолучитьСписокПлатежей(Команда)
Результат = PayKeeperСервер.ПолучитьИОбработатьСписокПлатежей();
Если Результат.Ошибка Тогда
	Сообщить(Результат.ОписаниеОшибки);
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеPayKeeper(Команда)
ОткрытьФорму("ОбщаяФорма.PayKeeperРаспределение_Тест", , ЭтаФорма);	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СвязатьОплатыДолги(Команда)
СвязатьОплатыДолгиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СвязатьОплатыДолгиНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	PayKeeperПлатежи.ИД_Платежа КАК ИД_Платежа,
                      |	PayKeeperПлатежи.ГУИД КАК ГУИД,
                      |	PayKeeperПлатежи.Плательщик КАК Плательщик,
                      |	PayKeeperПлатежи.НомерСчета КАК НомерСчета,
                      |	PayKeeperПлатежи.Сумма КАК Сумма,
                      |	PayKeeperПлатежи.Статус КАК Статус,
                      |	PayKeeperПлатежи.ДатаСоздания КАК ДатаСоздания,
                      |	PayKeeperПлатежи.ДатаОплаты КАК ДатаОплаты,
                      |	PayKeeperПлатежи.Отменено КАК Отменено,
                      |	PayKeeperПлатежи.Организация КАК Организация,
                      |	PayKeeperПлатежи.ПолучательПлатежа КАК ПолучательПлатежа,
                      |	PayKeeperПлатежи.СуммаЧехов КАК СуммаЧехов,
                      |	PayKeeperПлатежи.СуммаЛайв КАК СуммаЛайв,
                      |	PayKeeperПлатежи.СуммаДомСоветов КАК СуммаДомСоветов,
                      |	PayKeeperПлатежи.СуммаРеноме КАК СуммаРеноме,
                      |	PayKeeperПлатежи.СуммаСтритАрт КАК СуммаСтритАрт
                      |ИЗ
                      |	РегистрСведений.PayKeeperПлатежи КАК PayKeeperПлатежи");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Если Строка.Статус <> "success" Тогда Продолжить; КонецЕсли;
	
	PayKeeperСервер.СвязатьPayKeeperПлатежи(Строка.ИД_Платежа);	
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтправкаPayKeeperФорма(Команда)
ОткрытьФорму("ОбщаяФорма.ОтправкаPayKeeperФорма",,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//
&НаКлиенте
Процедура ПоказатьКартинку(Команда)
//СоединениеPayKeeper = ПолучитьСоединение();
//Если СоединениеPayKeeper.Ошибка Тогда Сообщить(СоединениеPayKeeper.Описание); Возврат; КонецЕсли;

//Плательщик = "ПСН";
//НомерСчёта = "Тест Номер счета";
//НаименованиеУслуги = "Тест Услуга";
//СуммаПлатежа = 1;
//EmailОтсылкиЧека = "psn.invina@gmail.com";
//ТелефонОтсылкиСМСУведомления = "+79826236241";

//Результат = PayKeeper.ПолучитьQRКод(СоединениеPayKeeper, Плательщик, НомерСчёта, НаименованиеУслуги, СуммаПлатежа, EmailОтсылкиЧека, ТелефонОтсылкиСМСУведомления) ;
//Если Результат.Ошибка Тогда Сообщить(Результат.Описание); Возврат; КонецЕсли;

//ИдПлатежа = Результат.ИдПлатежа;
//АдресКартинки = Результат.АдресКартинки;

//ДанныеКартинкиBase64 = Результат.ДанныеКартинкиBase64; 
//ДвоичныеДанныеКартинки = Base64Значение(ДанныеКартинкиBase64);

////Если ЭтаФорма.КлючУникальности = Неопределено Тогда
////	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор();
////Иначе
////	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор(ЭтаФорма.КлючУникальности);
////КонецЕсли;	
////QR_Картинка = ПоместитьВоВременноеХранилище(Новый Картинка(ДвоичныеДанныеКартинки), УникальныйИдентификаторФормы);


////ПоказатьКартинкуНаСервере();

//ФайлКартинки = "C:\_Base1C\ЛАЙВ\Street Art Logo in Black.png";
//ОбменКартинкаСервер.ВыгрузитьКартинку(ФайлКартинки);
////ОбменКартинкаКлиент.ВыгрузитьКартинку(ФайлКартинки);

ПоказатьКартинкуНаСервере();

КонецПроцедуры
//


//
&НаСервере
Процедура ПоказатьКартинкуНаСервере()
//СоединениеPayKeeper = ПолучитьСоединениеСервер();
//Если СоединениеPayKeeper.Ошибка Тогда Сообщить(СоединениеPayKeeper.Описание); Возврат; КонецЕсли;

//Плательщик = "ПСН";
//НомерСчёта = "Тест Номер счета";
//НаименованиеУслуги = "Тест Услуга";
//СуммаПлатежа = 1;
//EmailОтсылкиЧека = "psn.invina@gmail.com";
//ТелефонОтсылкиСМСУведомления = "+79826236241";

//Результат = PayKeeper.ПолучитьQRКод(СоединениеPayKeeper, Плательщик, НомерСчёта, НаименованиеУслуги, СуммаПлатежа, EmailОтсылкиЧека, ТелефонОтсылкиСМСУведомления) ;
//Если Результат.Ошибка Тогда Сообщить(Результат.Описание); Возврат; КонецЕсли;

//ИдПлатежа = Результат.ИдПлатежа;
//АдресКартинки = Результат.АдресКартинки;

//ДанныеКартинкиBase64 = Результат.ДанныеКартинкиBase64; 
//ДвоичныеДанныеКартинки = Base64Значение(ДанныеКартинкиBase64);

//КартинкаИмяФайла = ПолучитьИмяВременногоФайла("jpg");
//ДвоичныеДанныеКартинки.Записать(КартинкаИмяФайла);

//ПоказатьКартинкуНаСервере();
//ФайлКартинки = КартинкаИмяФайла;

Каталог = Константы.Папка_C_BASE.Получить();
ФайлКартинки = Каталог + "Street Art Logo in Black.png";
ОбменКартинкаСервер.ВыгрузитьКартинку(ФайлКартинки);

КонецПроцедуры
//
