
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаС_С = Неопределено;
ДатаС_По = Неопределено;

Если ЗначениеЗаполнено(ДатаС_По) Тогда
	ДатаС_По_П = ДатаС_По;
Иначе	
	ДатаС_По_П = '30010101';
КонецЕсли;
	
Список.Параметры.УстановитьЗначениеПараметра("ДатаС_С", ДатаС_С);	
Список.Параметры.УстановитьЗначениеПараметра("ДатаС_По", ДатаС_По_П);
КонецПроцедуры


&НаКлиенте
Функция ПроверкаДат()
Если НЕ ЗначениеЗаполнено(ДатаС_С)
ИЛИ НЕ ЗначениеЗаполнено(ДатаС_По)
Тогда Возврат Истина; КонецЕсли;

Возврат Ложь; 	
КонецФункции	


&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
//Если ПроверкаДат() Тогда Возврат; КонецЕсли;
	
Список.Параметры.УстановитьЗначениеПараметра("ДатаС_С", ДатаС_С);	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
//Если ПроверкаДат() Тогда Возврат; КонецЕсли;
Если ЗначениеЗаполнено(ДатаС_По) Тогда
	ДатаС_По_П = ДатаС_По;
Иначе	
	ДатаС_По_П = '30010101';
КонецЕсли;
	
Список.Параметры.УстановитьЗначениеПараметра("ДатаС_По", ДатаС_По_П);
КонецПроцедуры

