
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если Запись.ЗаявкаГУИД = ОбщийФункционалСервер.УникальныйИдентификаторПустой() Тогда 
	Заявка = Документы.ЗаявкаНаБронирование.ПустаяСсылка();
Иначе
	ЗаявкаСсылка = Документы.ЗаявкаНаБронирование.ПолучитьСсылку(Запись.ЗаявкаГУИД);
	
	ЗаявкаОбъект = ЗаявкаСсылка.ПолучитьОбъект();
	Если ЗаявкаОбъект = Неопределено Тогда 
		Заявка = Документы.ЗаявкаНаБронирование.ПустаяСсылка();
	Иначе	
		Заявка = ЗаявкаСсылка; 
	КонецЕсли;
КонецЕсли;
	
КонецПроцедуры


