Перем ПомещениеГорничные_OldValue;

Процедура ПередЗаписью(Отказ)
Если ЭтотОбъект.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;	
	
ПомещениеГорничные_OldValue = ЭтотОбъект.Ссылка.ПомещениеГорничные; 
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
Если ЭтотОбъект.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;	
//Если ТекущийОбъект.НомерГорничные = ТекущийОбъект.Ссылка.НомерГорничные Тогда Возврат; КонецЕсли;

ОбменСГорничными = Константы.ОбменСГорничными.Получить(); 	
Если НЕ ОбменСГорничными Тогда Возврат; КонецЕсли; 

Папка_Горничные = Константы.Папка_Горничные.Получить();
Если НЕ ЗначениеЗаполнено(Папка_Горничные) Тогда Возврат; КонецЕсли;  

Соединение = ОбменГорничныеСервер.Соединение();
Если Соединение = Неопределено Тогда Возврат; КонецЕсли;

ПомещениеДанные = Новый Структура;
ПомещениеДанные.Вставить("ПомещениеГорничные", ЭтотОбъект.ПомещениеГорничные);
ПомещениеДанные.Вставить("ПометкаУдаления", ЭтотОбъект.ПометкаУдаления);
ПомещениеДанные.Вставить("Наименование", ЭтотОбъект.Наименование);       

Попытка 
	Соединение.ОбменГорничныеСервер.ОбновитьПомещениеГорничные(ПомещениеГорничные_OldValue, ПомещениеДанные);
Исключение
	Сообщить("Ошибка записи в БД Горничные.ОбновитьПомещениеГорничные. " + ОписаниеОшибки());   	
КонецПопытки;
КонецПроцедуры

