&НаКлиенте
Перем ПредыдущийНомерСтрокиДолги, ПредыдущийНомерСтрокиСписание;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//Список.Параметры.УстановитьЗначениеПараметра("ДатаС", ДатаС);	
//Список.Параметры.УстановитьЗначениеПараметра("ДатаПо", ДатаПо);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//ПредыдущийНомерСтрокиДолги = 1;
//ПредыдущийНомерСтрокиСписание = 1;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
ПолеОтчетаДолги = ЗаполнитьОтчетДолгиНаСервере();
ПолеОтчетаДолги.ФиксацияСверху = 5;

ПолеОтчетаСписание = ЗаполнитьОтчетСписаниеНаСервере();
ПолеОтчетаСписание.ФиксацияСверху = 2;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьОтчетДолгиНаСервере()
ТабДок = Обработки.ЗакрытиеФинансовогоПериода.ЗаполнитьОтчетДолгиНаСервере(ДатаС, ДатаПо, ДанныеДолги, НомерСтрокиШапкаДолги, НомерКомментарий_Долги);
Возврат ТабДок;	
КонецФункции	

&НаСервере               
Функция ЗаполнитьОтчетСписаниеНаСервере()
ТабДок = Обработки.ЗакрытиеФинансовогоПериода.ЗаполнитьОтчетСписаниеНаСервере(ДатаС, ДатаПо);
Возврат ТабДок;		
КонецФункции

&НаСервере
Функция ЗаполнитьОтчетНаСервере_ПокаСохранить()  
ТабДок = Новый ТабличныйДокумент;

Запрос = Новый Запрос;
ТекстЗапроса = "ВЫБРАТЬ
               |	ЗаявкаНаБронирование.Ссылка КАК ЗаявкаНаБронирование,
               |	ЗаявкаНаБронирование.РезервС КАК РезервС,
               |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
               |	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
               |	ЗаявкаНаБронирование.Клиент КАК Клиент,
               |	ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
               |	ЗаявкаНаБронирование.Статус КАК Статус,
               |	ПроживаниеСумма.Сумма КАК СуммаПроживание,
               |	УслугиСумма.Сумма КАК СуммаУслуги,
               |	ЕСТЬNULL(ПроживаниеСумма.Сумма, 0) + ЕСТЬNULL(УслугиСумма.Сумма, 0) КАК СуммаЗаявки,
               |	ЕСТЬNULL(СчетаПроживание.СуммаДолг, 0) + ЕСТЬNULL(СчетаУслуги.СуммаДолг, 0) КАК СуммаЗаявкиСчета,
               |	СчетаПроживание.СуммаДолг КАК СуммаПроживаниеСчета,
               |	СчетаУслуги.СуммаДолг КАК СуммаУслугиСчета,
               |	СчетаПроживание.СуммаКЗакрытию КАК СуммаДолгаПроживание,
               |	СчетаУслуги.СуммаКЗакрытию КАК СуммаДолгаУслуги,
               |	СписаниеПроживания.СуммаОплаты КАК СуммаСписанияПроживание,
               |	СписаниеУслуги.СуммаОплаты КАК СуммаСписанияУслуги,
               |	ЕСТЬNULL(СчетаПроживание.СуммаКЗакрытию, 0) + ЕСТЬNULL(СчетаУслуги.СуммаКЗакрытию, 0) КАК СуммаДолга,
               |	ЗаявкаНаБронирование.КомментарийОтветственного КАК КомментарийОтветственного
               |ИЗ
               |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК ПроживаниеСумма
               |		ПО ЗаявкаНаБронирование.Ссылка = ПроживаниеСумма.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеДопУслуги.Количество * ЗаявкаНаБронированиеДопУслуги.Цена) КАК Сумма
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
               |		ГДЕ
               |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка) КАК УслугиСумма
               |		ПО ЗаявкаНаБронирование.Ссылка = УслугиСумма.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК СчетаПроживание
               |		ПО ЗаявкаНаБронирование.Ссылка = СчетаПроживание.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК СчетаУслуги
               |		ПО ЗаявкаНаБронирование.Ссылка = СчетаУслуги.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
               |		ГДЕ
               |			ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
               |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ЛОЖЬ
               |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет))
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка) КАК СписаниеПроживания
               |		ПО ЗаявкаНаБронирование.Ссылка = СписаниеПроживания.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
               |		ГДЕ
               |			ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
               |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ИСТИНА
               |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка) КАК СписаниеУслуги
               |		ПО ЗаявкаНаБронирование.Ссылка = СписаниеУслуги.Ссылка
               |ГДЕ
               |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
               |	И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
               |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
               |	И ЗаявкаНаБронирование.РезервПо <= &ДатаПо
               |	И ЗаявкаНаБронирование.РезервПо >= &ДатаС";

//                      |	И ЕСТЬNULL(СчетаПроживание.СуммаКЗакрытию, 0) + ЕСТЬNULL(СчетаУслуги.СуммаКЗакрытию, 0) - ЕСТЬNULL(СписаниеПроживания.СуммаОплаты, 0) - ЕСТЬNULL(СписаниеУслуги.СуммаОплаты, 0) - ЕСТЬNULL(Списание.СуммаОплаты, 0) > 0
//                      |
//                      |УПОРЯДОЧИТЬ ПО
//                      |	РезервС,
//                      |	НомерВРезерв";	

Запрос.Текст = ТекстЗапроса;

Запрос.Текст = Запрос.Текст + "
                      |	И ЕСТЬNULL(СчетаПроживание.СуммаКЗакрытию, 0) + ЕСТЬNULL(СчетаУслуги.СуммаКЗакрытию, 0) > 0
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	РезервС,
                      |	НомерВРезерв";

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

//МакетОбработки = Обработки.ЗакрытиеФинансовогоПериода_2.ПолучитьМакет("Макет");
Обработка = РеквизитФормыВЗначение("Объект");
МакетОбработки = Обработка.ПолучитьМакет("МакетДолги");

//ПолеОтчета.Очистить();
Область = МакетОбработки.ПолучитьОбласть("Заголовок");
ОтельСсылка = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Отель = ОтельСсылка.Наименование;
Область.Параметры.Отель = Отель;
Область.Параметры.ДатаС = Формат(ДатаС, "ДФ=dd.MM.yy");
Область.Параметры.ДатаПо = Формат(ДатаПо, "ДФ=dd.MM.yy");
ТабДок.Вывести(Область);

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК КоличествоЗаявок,
                      |	СУММА(ДолгиКЗакрытию.СуммаДолг) КАК СуммаЗаявок
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК ДолгиКЗакрытию
                      |		ПО ЗаявкаНаБронирование.Ссылка = ДолгиКЗакрытию.Ссылка
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                      |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
                      |	И ЗаявкаНаБронирование.РезервПо <= &ДатаПо
                      |	И ЗаявкаНаБронирование.РезервПо >= &ДатаС
                      |	И ДолгиКЗакрытию.СуммаКЗакрытию = 0");

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_ЗакрытоЗаявок = Запрос.Выполнить().Выгрузить();
Если ТЗ_ЗакрытоЗаявок.Количество() = 0 Тогда
	КоличествоЗаявок = 0; 	
	СуммаЗаявок = 0;
Иначе
	КоличествоЗаявок = ТЗ_ЗакрытоЗаявок[0].КоличествоЗаявок; 	
	СуммаЗаявок = ТЗ_ЗакрытоЗаявок[0].СуммаЗаявок;
КонецЕсли;
	
Область = МакетОбработки.ПолучитьОбласть("ЗакрытоЗаявок");
Область.Параметры.КоличествоЗаявок = Строка(КоличествоЗаявок);
Область.Параметры.СуммаЗаявок = Строка(СуммаЗаявок);
ТабДок.Вывести(Область);
//

//
Область = МакетОбработки.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

ДанныеДолги.Очистить();
НомерКомментарий_Долги = Область.ШиринаТаблицы;

ДолгиСдвиг_Долги = ТабДок.ВысотаТаблицы;

НомерКолонкиСуммаПроживание = 10;
Для Каждого Строка Из ТЗ Цикл
	Область = МакетОбработки.ПолучитьОбласть("Строка");
	
	Область.Параметры.Заполнить(Строка);
	Область.Параметры.РезервС = Формат(Строка.РезервС, "ДФ=dd.MM.yy");
	Область.Параметры.РезервПо = Формат(Строка.РезервПо, "ДФ=dd.MM.yy");
	
	Область.Параметры.Заявка = Строка.ЗаявкаНаБронирование.Номер + " от " + Формат(Строка.ЗаявкаНаБронирование.Дата, "ДФ=dd.MM.yy");
	Область.Параметры.ЗаявкаНаБронирование = Строка.ЗаявкаНаБронирование;
	
	Если Строка.СуммаПроживаниеСчета = Строка.СуммаПроживание Тогда
		Область.Область(1, НомерКолонкиСуммаПроживание, 1, НомерКолонкиСуммаПроживание).ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	ИмяОбласти = "R1C" + Строка(НомерКомментарий_Долги);
	Область.Область(ИмяОбласти).Значение = Строка.КомментарийОтветственного;
	ТабДок.Вывести(Область);
	
	НоваяСтрока = ДанныеДолги.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	НоваяСтрока.ТипСтроки = "Долги";
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("Подножие");
//Область.Параметры.СуммаЗаявки = ТЗ.Итог("СуммаЗаявки");
//Область.Параметры.СуммаПроживаниеСчета = ТЗ.Итог("СуммаПроживаниеСчета");
//Область.Параметры.СуммаПроживание = ТЗ.Итог("СуммаПроживание");
//Область.Параметры.СуммаУслугиСчета = ТЗ.Итог("СуммаУслугиСчета");
//Область.Параметры.СуммаУслуги = ТЗ.Итог("СуммаУслуги");
Область.Параметры.СуммаДолга = ТЗ.Итог("СуммаДолга");
ТабДок.Вывести(Область) ;

Область = МакетОбработки.ПолучитьОбласть("ПустаяОбласть");
ТабДок.Вывести(Область) ;
ТабДок.Вывести(Область) ;

ДолгиСдвиг_Списание = ТабДок.ВысотаТаблицы;

ТабДок_1 = Новый ТабличныйДокумент;
Запрос = Новый Запрос;

Запрос.Текст = ТекстЗапроса;
Запрос.Текст = Запрос.Текст + "
	|	И (ЕСТЬNULL(СписаниеПроживания.СуммаОплаты, 0) <> 0 
	| ИЛИ ЕСТЬNULL(СписаниеУслуги.СуммаОплаты, 0) <> 0 ИЛИ ЕСТЬNULL(Списание.СуммаОплаты, 0) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РезервС,
	|	НомерВРезерв";	
	
Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

//МакетОбработки = Обработки.ЗакрытиеФинансовогоПериода_2.ПолучитьМакет("Макет");
Обработка = РеквизитФормыВЗначение("Объект");
МакетОбработки = Обработка.ПолучитьМакет("МакетСписание");

//ПолеОтчета.Очистить();
Область = МакетОбработки.ПолучитьОбласть("Шапка");
ТабДок_1.Вывести(Область);

//Данные.Очистить();
НомерКомментарий_Списание = Область.ШиринаТаблицы;
Для Каждого Строка Из ТЗ Цикл
	Область = МакетОбработки.ПолучитьОбласть("Строка");
	
	Область.Параметры.Заполнить(Строка);
	Область.Параметры.РезервС = Формат(Строка.РезервС, "ДФ=dd.MM.yy");
	Область.Параметры.РезервПо = Формат(Строка.РезервПо, "ДФ=dd.MM.yy");
	
	Область.Параметры.Заявка = Строка.ЗаявкаНаБронирование.Номер + " от " + Формат(Строка.ЗаявкаНаБронирование.Дата, "ДФ=dd.MM.yy");
	Область.Параметры.ЗаявкаНаБронирование = Строка.ЗаявкаНаБронирование;
	
	ИмяОбласти = "R1C" + Строка(НомерКомментарий_Списание);
	Область.Область(ИмяОбласти).Значение = Строка.КомментарийОтветственного;
	ТабДок_1.Вывести(Область);
	
	НоваяСтрока = ДанныеДолги.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	НоваяСтрока.ТипСтроки = "Списание";
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("Подножие");
//Область.Параметры.СуммаЗаявки = ТЗ.Итог("СуммаЗаявки");
//Область.Параметры.СуммаПроживаниеСчета = ТЗ.Итог("СуммаПроживаниеСчета");
//Область.Параметры.СуммаПроживание = ТЗ.Итог("СуммаПроживание");
//Область.Параметры.СуммаУслугиСчета = ТЗ.Итог("СуммаУслугиСчета");
//Область.Параметры.СуммаУслуги = ТЗ.Итог("СуммаУслуги");
Область.Параметры.СуммаДолга = ТЗ.Итог("СуммаДолга");
Область.Параметры.СуммаСписанияПроживание = ТЗ.Итог("СуммаСписанияПроживание");
Область.Параметры.СуммаСписанияУслуги = ТЗ.Итог("СуммаСписанияУслуги");
Область.Параметры.СуммаСписания = ТЗ.Итог("СуммаСписания");
ТабДок_1.Вывести(Область) ;



//Сумма списания неоплаченных  доп.услуг - 11950, из них БАР/МИНИБАР - 11550, прачечная  - 400
Запрос = Новый Запрос( "ВЫБРАТЬ
                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
                       |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                       |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты
                       |ИЗ
                       |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                       |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                       |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                       |ГДЕ
                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
                       |	И (ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                       |			ИЛИ ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо <= &ДатаПо
                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо >= &ДатаС
                       |	И ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                       |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ИСТИНА
                       |	И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))");

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_ДопУслуги = Запрос.Выполнить().Выгрузить();

СуммаОплаты = 0;
СуммаМинибар = 0;
СуммаПрачечная = 0;
Для Каждого Строка Из ТЗ_ДопУслуги Цикл
		Результат = Справочники.ДопУслуги.ПустаяСсылка();
		Ссылка = Строка.Услуга; 
		ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
		
		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР 
		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР 
		Тогда
			СуммаМинибар = СуммаМинибар + Строка.СуммаОплаты;
		КонецЕсли;
		
		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
		Тогда
			СуммаПрачечная = СуммаПрачечная + Строка.СуммаОплаты;
		КонецЕсли;
		
		СуммаОплаты = СуммаОплаты + Строка.СуммаОплаты;
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("ИтогиУслуги");
Область.Параметры.СуммаДопУслуг = СуммаОплаты; 
Область.Параметры.СуммаМинибар = СуммаМинибар; 
Область.Параметры.СуммаПрачечная = СуммаПрачечная; 
ТабДок_1.Вывести(Область);

//Область = МакетОбработки.ПолучитьОбласть("ПустаяОбласть");
//ТабДок_1.Вывести(Область);
//ТабДок_1.Вывести(Область);

ОбщийФункционалСервер.ВставитьТабличныйДокумент(ТабДок, ТабДок_1);

//ТабДок.ФиксацияСверху = 1;
Возврат ТабДок;
КонецФункции


// + Перенесено в модуль менеджера
&НаСервере
Функция ТекстЗапроса()
ТекстЗапроса = "ВЫБРАТЬ
               |	ЗаявкаНаБронирование.Ссылка КАК ЗаявкаНаБронирование,
               |	ЗаявкаНаБронирование.Ссылка КАК ДокументДолг,
               |	ЗаявкаНаБронирование.РезервС КАК РезервС,
               |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
               |	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
               |	ЗаявкаНаБронирование.Клиент КАК Клиент,
               |	ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
               |	ЗаявкаНаБронирование.Статус КАК Статус,
               |	ПроживаниеСумма.Сумма КАК СуммаПроживание,
               |	УслугиСумма.Сумма КАК СуммаУслуги,
               |	ЕСТЬNULL(ПроживаниеСумма.Сумма, 0) + ЕСТЬNULL(УслугиСумма.Сумма, 0) КАК СуммаЗаявки,
               |	ЕСТЬNULL(СчетаПроживание.СуммаДолг, 0) + ЕСТЬNULL(СчетаУслуги.СуммаДолг, 0) КАК СуммаЗаявкиСчета,
               |	СчетаПроживание.СуммаДолг КАК СуммаПроживаниеСчета,
               |	СчетаУслуги.СуммаДолг КАК СуммаУслугиСчета,
               |	СчетаПроживание.СуммаКЗакрытию КАК СуммаДолгаПроживание,
               |	СчетаУслуги.СуммаКЗакрытию КАК СуммаДолгаУслуги,
               |	СписаниеПроживания.СуммаОплаты КАК СуммаСписанияПроживание,
               |	СписаниеУслуги.СуммаОплаты КАК СуммаСписанияУслуги,
               |	ЕСТЬNULL(СписаниеПроживания.СуммаОплаты, 0) + ЕСТЬNULL(СписаниеУслуги.СуммаОплаты, 0) КАК СуммаСписания,
               |	ЕСТЬNULL(СчетаПроживание.СуммаКЗакрытию, 0) + ЕСТЬNULL(СчетаУслуги.СуммаКЗакрытию, 0) КАК СуммаДолга,
               |	ЗаявкаНаБронирование.КомментарийОтветственного КАК КомментарийОтветственного
               |ИЗ
               |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК ПроживаниеСумма
               |		ПО ЗаявкаНаБронирование.Ссылка = ПроживаниеСумма.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеДопУслуги.Количество * ЗаявкаНаБронированиеДопУслуги.Цена) КАК Сумма
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
               |		ГДЕ
               |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка) КАК УслугиСумма
               |		ПО ЗаявкаНаБронирование.Ссылка = УслугиСумма.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК СчетаПроживание
               |		ПО ЗаявкаНаБронирование.Ссылка = СчетаПроживание.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК СчетаУслуги
               |		ПО ЗаявкаНаБронирование.Ссылка = СчетаУслуги.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
               |		ГДЕ
               |			ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
               |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ЛОЖЬ
               |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка) КАК СписаниеПроживания
               |		ПО ЗаявкаНаБронирование.Ссылка = СписаниеПроживания.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
               |		ГДЕ
               |			ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
               |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ИСТИНА
               |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка) КАК СписаниеУслуги
               |		ПО ЗаявкаНаБронирование.Ссылка = СписаниеУслуги.Ссылка
               |ГДЕ
               |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
               |	И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
               |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
               |	И ЗаявкаНаБронирование.РезервПо <= &ДатаПо
               |	И ЗаявкаНаБронирование.РезервПо >= &ДатаС";

Возврат ТекстЗапроса;
КонецФункции

&НаСервере
Функция ЗаявкаТекст(ЗаявкаНаБронирование)
ЗаявкаТекст = ЗаявкаНаБронирование.Номер + " от " + Формат(ЗаявкаНаБронирование.Дата, "ДФ=dd.MM.yy");
Возврат ЗаявкаТекст;
КонецФункции

&НаСервере
Функция ЗаполнитьОтчетДолгиНаСервере_Перенесено()  
ТабДок = Новый ТабличныйДокумент;

Запрос = Новый Запрос;

Запрос.Текст = ТекстЗапроса();

Запрос.Текст = Запрос.Текст + "
                      |	И ЕСТЬNULL(СчетаПроживание.СуммаКЗакрытию, 0) + ЕСТЬNULL(СчетаУслуги.СуммаКЗакрытию, 0) > 0
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	РезервС,
                      |	НомерВРезерв";

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

Обработка = РеквизитФормыВЗначение("Объект");
МакетОбработки = Обработка.ПолучитьМакет("МакетДолги");

Область = МакетОбработки.ПолучитьОбласть("Заголовок");
ОтельСсылка = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Отель = ОтельСсылка.Наименование;
Область.Параметры.Отель = Отель;
Область.Параметры.ДатаС = Формат(ДатаС, "ДФ=dd.MM.yy");
Область.Параметры.ДатаПо = Формат(ДатаПо, "ДФ=dd.MM.yy");
ТабДок.Вывести(Область);

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК КоличествоЗаявок,
                      |	СУММА(ДолгиКЗакрытию.СуммаДолг) КАК СуммаЗаявок
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК ДолгиКЗакрытию
                      |		ПО ЗаявкаНаБронирование.Ссылка = ДолгиКЗакрытию.Ссылка
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                      |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
                      |	И ЗаявкаНаБронирование.РезервПо <= &ДатаПо
                      |	И ЗаявкаНаБронирование.РезервПо >= &ДатаС
                      |	И ДолгиКЗакрытию.СуммаКЗакрытию = 0");

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_ЗакрытоЗаявок = Запрос.Выполнить().Выгрузить();
Если ТЗ_ЗакрытоЗаявок.Количество() = 0 Тогда
	КоличествоЗаявок = 0; 	
	СуммаЗаявок = 0;
Иначе
	КоличествоЗаявок = ТЗ_ЗакрытоЗаявок[0].КоличествоЗаявок; 	
	СуммаЗаявок = ТЗ_ЗакрытоЗаявок[0].СуммаЗаявок;
КонецЕсли;
	
Область = МакетОбработки.ПолучитьОбласть("ЗакрытоЗаявок");
Область.Параметры.КоличествоЗаявок = Строка(КоличествоЗаявок);
Область.Параметры.СуммаЗаявок = Строка(СуммаЗаявок);
ТабДок.Вывести(Область);
//

//
Область = МакетОбработки.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

ДанныеДолги.Очистить();
НомерКомментарий_Долги = Область.ШиринаТаблицы;
НомерСтрокиШапкаДолги = ТабДок.ВысотаТаблицы;

НомерКолонкиСуммаПроживание = 10;
НомерКолонкиСуммаУслуги = 12;
Для Каждого Строка Из ТЗ Цикл
	Область = МакетОбработки.ПолучитьОбласть("Строка");
	
	Область.Параметры.Заполнить(Строка);
	Область.Параметры.РезервС = Формат(Строка.РезервС, "ДФ=dd.MM.yy");
	Область.Параметры.РезервПо = Формат(Строка.РезервПо, "ДФ=dd.MM.yy");
	
	Область.Параметры.Заявка = Строка.ЗаявкаНаБронирование.Номер + " от " + Формат(Строка.ЗаявкаНаБронирование.Дата, "ДФ=dd.MM.yy");
	Область.Параметры.ЗаявкаНаБронирование = Строка.ЗаявкаНаБронирование;
	
	Если Строка.СуммаПроживаниеСчета <> Строка.СуммаПроживание Тогда
		Область.Область(1, НомерКолонкиСуммаПроживание, 1, НомерКолонкиСуммаПроживание).ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	Если Строка.СуммаУслугиСчета <> Строка.СуммаУслуги Тогда
		Область.Область(1, НомерКолонкиСуммаУслуги, 1, НомерКолонкиСуммаУслуги).ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	ИмяОбласти = "R1C" + Строка(НомерКомментарий_Долги);
	Область.Область(ИмяОбласти).Значение = Строка.КомментарийОтветственного;
	ТабДок.Вывести(Область);
	
	НоваяСтрока = ДанныеДолги.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("Подножие");
//Область.Параметры.СуммаЗаявки = ТЗ.Итог("СуммаЗаявки");
//Область.Параметры.СуммаПроживаниеСчета = ТЗ.Итог("СуммаПроживаниеСчета");
//Область.Параметры.СуммаПроживание = ТЗ.Итог("СуммаПроживание");
//Область.Параметры.СуммаУслугиСчета = ТЗ.Итог("СуммаУслугиСчета");
//Область.Параметры.СуммаУслуги = ТЗ.Итог("СуммаУслуги");
Область.Параметры.СуммаДолга = ТЗ.Итог("СуммаДолга");
ТабДок.Вывести(Область) ;

//Область = МакетОбработки.ПолучитьОбласть("ПустаяОбласть");
//ТабДок.Вывести(Область) ;
//ТабДок.Вывести(Область) ;

//ТабДок.ФиксацияСверху = 1;
Возврат ТабДок;
КонецФункции

&НаСервере               
Функция ЗаполнитьОтчетСписаниеНаСервере_Перенесено()  
ТабДок = Новый ТабличныйДокумент;

//
ИмяОбъекта = "СписаниеДопУслуг";
УслугиРодительСправочник = Новый ТаблицаЗначений;
УслугиРодительСправочник.Колонки.Добавить("УслугаРодитель");
УслугиРодительСправочник.Колонки.Добавить("ЗаголовокОтчеты");
УслугиРодительСправочник.Колонки.Добавить("НомерПП");
УслугиРодительСправочник.Колонки.Добавить("Номер");
УслугиРодительСправочник.Колонки.Добавить("СуммаИтого");

Документы[ИмяОбъекта].ЗаполнитьУслугиРодительСправочник(УслугиРодительСправочник);

Для Каждого Строка Из УслугиРодительСправочник Цикл
	Строка.СуммаИтого = 0;	
КонецЦикла;
//

Запрос = Новый Запрос;

Запрос.Текст = ТекстЗапроса();
Запрос.Текст = Запрос.Текст + "
	|	И (ЕСТЬNULL(СписаниеПроживания.СуммаОплаты, 0) <> 0 
	| ИЛИ ЕСТЬNULL(СписаниеУслуги.СуммаОплаты, 0) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РезервС,
	|	НомерВРезерв";	
	
Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

Обработка = РеквизитФормыВЗначение("Объект");
МакетОбработки = Обработка.ПолучитьМакет("МакетСписание");

Область = МакетОбработки.ПолучитьОбласть("Заголовок");
ОтельСсылка = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Отель = ОтельСсылка.Наименование;
Область.Параметры.Отель = Отель;
Область.Параметры.ДатаС = Формат(ДатаС, "ДФ=dd.MM.yy");
Область.Параметры.ДатаПо = Формат(ДатаПо, "ДФ=dd.MM.yy");
ТабДок.Вывести(Область);

Область = МакетОбработки.ПолучитьОбласть("Шапка|Лево");
ТабДок.Вывести(Область);

Для Каждого Строка Из УслугиРодительСправочник Цикл
	ОбластьУслуги = МакетОбработки.ПолучитьОбласть("Шапка|Услуга");
	ОбластьУслуги.Параметры.ШапкаУслуга = Строка.ЗаголовокОтчеты;
	ТабДок.Присоединить(ОбластьУслуги);
КонецЦикла;

//Возврат ТабДок_1;

НомерСтрокиШапкаСписание = ТабДок.ВысотаТаблицы;     

//Данные.Очистить();
НомерКомментарий_Списание = Область.ШиринаТаблицы;
НомерСтрокиШапкаСписание = ТабДок.ВысотаТаблицы;

НомерКолонкиСуммаПроживание = 10;
НомерКолонкиСуммаУслуги = 12;

Для Каждого Строка Из ТЗ Цикл
	Область = МакетОбработки.ПолучитьОбласть("Строка|Лево");
	
	Область.Параметры.Заполнить(Строка);
	Область.Параметры.РезервС = Формат(Строка.РезервС, "ДФ=dd.MM.yy");
	Область.Параметры.РезервПо = Формат(Строка.РезервПо, "ДФ=dd.MM.yy");
	
	Область.Параметры.Заявка = Строка.ЗаявкаНаБронирование.Номер + " от " + Формат(Строка.ЗаявкаНаБронирование.Дата, "ДФ=dd.MM.yy");
	Область.Параметры.ЗаявкаНаБронирование = Строка.ЗаявкаНаБронирование;
	
	Если Строка.СуммаПроживаниеСчета <> Строка.СуммаПроживание Тогда
		Область.Область(1, НомерКолонкиСуммаПроживание, 1, НомерКолонкиСуммаПроживание).ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	Если Строка.СуммаУслугиСчета <> Строка.СуммаУслуги Тогда
		Область.Область(1, НомерКолонкиСуммаУслуги, 1, НомерКолонкиСуммаУслуги).ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	//
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
	                      |	СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации КАК ДокументОплатыВидОперации,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга КАК Услуга,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                      |ГДЕ
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = &ДокументДолг
	                      |	И ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
	                      |	И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
	                      |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
	                      |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДокументОплатыВидОперации");

	Запрос.УстановитьПараметр("ДокументДолг", Строка.ДокументДолг); 

	ТЗ_СписанияДолгиГУИД = Запрос.Выполнить().Выгрузить();
	
	ТЗ_Списания = ТЗ_СписанияДолгиГУИД.Скопировать();
	ТЗ_Списания.Свернуть("Ссылка, ДокументОплатыВидОперации", "СуммаОплаты");  
	
	Если ТЗ_Списания.Количество() = 1 Тогда  
		Область.Параметры.ВидОперации = ТЗ_Списания[0].ДокументОплатыВидОперации;
	КонецЕсли;	
	//	
	
	//ИмяОбласти = "R1C" + Строка(НомерКомментарий_Списание);
	//Область.Область(ИмяОбласти).Значение = Строка.КомментарийОтветственного;
	ТабДок.Вывести(Область);
	
	//НоваяСтрока = ДанныеСписание.Добавить();        
	//ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	//	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронирование.Ссылка КАК ДокументДолг,
	                      |	ДопУслугиОплаты.Услуга КАК Услуга,
	                      |	ЕСТЬNULL(ДопУслугиОплаты.СуммаДолг, 0) КАК СуммаДолг,
	                      |	ЕСТЬNULL(ДопУслугиОплаты.СуммаОплаты, 0) КАК СуммаОплаты
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
	                      |			ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
	                      |			ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК СуммаДолг,
	                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты
	                      |		ИЗ
	                      |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
	                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                      |				ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка
	                      |					И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД
	                      |		ГДЕ
	                      |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
	                      |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
	                      |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
	                      |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))) КАК ДопУслугиОплаты
	                      |		ПО ЗаявкаНаБронирование.Ссылка = ДопУслугиОплаты.Ссылка
	                      |ГДЕ
	                      |	ЗаявкаНаБронирование.Ссылка = &ДокументДолг");

	Запрос.УстановитьПараметр("ДокументДолг", Строка.ДокументДолг); 
	ТЗ_Услуги = Запрос.Выполнить().Выгрузить();	
		
	ТЗ_УслугиРодитель = ТЗ_Услуги.Скопировать();
	ТЗ_УслугиРодитель.Колонки.Добавить("УслугаРодитель");
	Для Каждого СтрокаУслуга Из ТЗ_УслугиРодитель Цикл 
		Результат = Справочники.ДопУслуги.ПустаяСсылка();
		Ссылка = СтрокаУслуга.Услуга; 
		ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
		
		СтрокаУслуга.УслугаРодитель = Результат;	
	КонецЦикла;	
	ТЗ_УслугиРодитель.Свернуть("ДокументДолг, УслугаРодитель", "СуммаДолг, СуммаОплаты");

	Для каждого СтрокаУслугиСправочник Из УслугиРодительСправочник Цикл
		ОбластьУслуга = МакетОбработки.ПолучитьОбласть("Строка|Услуга");
		
		ОтборСтроки = Новый Структура("ДокументДолг, УслугаРодитель", Строка.ДокументДолг, СтрокаУслугиСправочник.УслугаРодитель);
		СтрокиУслугиРодитель = ТЗ_УслугиРодитель.НайтиСтроки(ОтборСтроки);
		Если СтрокиУслугиРодитель.Количество() > 0 Тогда 
			СтрокиУслугиРодитель = СтрокиУслугиРодитель[0]; 
			ОбластьУслуга.Параметры.СуммаУслуга = СтрокиУслугиРодитель.СуммаОплаты;
			
			СтрокаУслугиСправочник.СуммаИтого = СтрокаУслугиСправочник.СуммаИтого + СтрокиУслугиРодитель.СуммаОплаты; 
		КонецЕсли;
		
		ТабДок.Присоединить(ОбластьУслуга);
		
	КонецЦикла;
	
	Если ТЗ_Списания.Количество() > 1 Тогда
	
		Для Каждого СтрокаСписания Из ТЗ_Списания Цикл
			Область = МакетОбработки.ПолучитьОбласть("СтрокаДополнительно|Лево");
			Область.Параметры.ВидОперации = СтрокаСписания.ДокументОплатыВидОперации;  
			Область.Параметры.СуммаСписания = СтрокаСписания.СуммаОплаты;  
			
			ОтборСтроки = Новый Структура("Ссылка, ДокументОплатыВидОперации, Услуга"
				, СтрокаСписания.Ссылка, СтрокаСписания.ДокументОплатыВидОперации, Ложь);
			ТЗ_СписанияПроживания = ТЗ_СписанияДолгиГУИД.Скопировать(ОтборСтроки);
			ТЗ_СписанияПроживания.Свернуть( ,"СуммаОплаты");
			Если ТЗ_СписанияПроживания.Количество() > 0 Тогда
				СтрокаСписанияпроживание = ТЗ_СписанияПроживания[0]; 
				Область.Параметры.СуммаСписанияПроживание = СтрокаСписанияпроживание.СуммаОплаты;  
			КонецЕсли;		
			
			ТабДок.Вывести(Область);
			
			
			//	
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ЗаявкаНаБронирование.Ссылка КАК ДокументДолг,
			                      |	ДопУслугиОплаты.Услуга КАК Услуга,
			                      |	ЕСТЬNULL(ДопУслугиОплаты.СуммаДолг, 0) КАК СуммаДолг,
			                      |	ЕСТЬNULL(ДопУслугиОплаты.СуммаОплаты, 0) КАК СуммаОплаты
			                      |ИЗ
			                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			                      |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
			                      |			ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
			                      |			ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК СуммаДолг,
			                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты
			                      |		ИЗ
			                      |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
			                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
			                      |				ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка
			                      |					И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД
			                      |		ГДЕ
			                      |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
			                      |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
			                      |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
			                      |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))
			                      |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД В(&ДолгиГУИД)) КАК ДопУслугиОплаты
			                      |		ПО ЗаявкаНаБронирование.Ссылка = ДопУслугиОплаты.Ссылка
			                      |ГДЕ
			                      |	ЗаявкаНаБронирование.Ссылка = &ДокументДолг");

			Запрос.УстановитьПараметр("ДокументДолг", Строка.ДокументДолг); 
			
			ОтборСтроки = Новый Структура("Ссылка, ДокументОплатыВидОперации, Услуга"
				, СтрокаСписания.Ссылка, СтрокаСписания.ДокументОплатыВидОперации, Истина);
				
			ТЗ_СписанияУслуги = ТЗ_СписанияДолгиГУИД.Скопировать(ОтборСтроки);	
			ДолгиГУИД = ТЗ_СписанияУслуги.ВыгрузитьКолонку("ДолгиГУИД");		
			Запрос.УстановитьПараметр("ДолгиГУИД", ДолгиГУИД); 
			
			ТЗ_Услуги = Запрос.Выполнить().Выгрузить();	
				
			ТЗ_УслугиРодитель = ТЗ_Услуги.Скопировать();
			ТЗ_УслугиРодитель.Колонки.Добавить("УслугаРодитель");
			Для Каждого СтрокаУслуга Из ТЗ_УслугиРодитель Цикл 
				Результат = Справочники.ДопУслуги.ПустаяСсылка();
				Ссылка = СтрокаУслуга.Услуга; 
				ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
				
				СтрокаУслуга.УслугаРодитель = Результат;	
			КонецЦикла;	
			ТЗ_УслугиРодитель.Свернуть("ДокументДолг, УслугаРодитель", "СуммаДолг, СуммаОплаты");

			Для каждого СтрокаУслугиСправочник Из УслугиРодительСправочник Цикл
				ОбластьУслуга = МакетОбработки.ПолучитьОбласть("Строка|Услуга");
				
				ОтборСтроки = Новый Структура("ДокументДолг, УслугаРодитель", Строка.ДокументДолг, СтрокаУслугиСправочник.УслугаРодитель);
				СтрокиУслугиРодитель = ТЗ_УслугиРодитель.НайтиСтроки(ОтборСтроки);
				Если СтрокиУслугиРодитель.Количество() > 0 Тогда 
					СтрокиУслугиРодитель = СтрокиУслугиРодитель[0]; 
					ОбластьУслуга.Параметры.СуммаУслуга = СтрокиУслугиРодитель.СуммаОплаты;
				КонецЕсли;
				
				ТабДок.Присоединить(ОбластьУслуга);
				
			КонецЦикла;
		
		КонецЦикла;
	КонецЕсли;
	
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("Подножие|Лево");
//Область.Параметры.СуммаЗаявки = ТЗ.Итог("СуммаЗаявки");
//Область.Параметры.СуммаПроживаниеСчета = ТЗ.Итог("СуммаПроживаниеСчета");
//Область.Параметры.СуммаПроживание = ТЗ.Итог("СуммаПроживание");
//Область.Параметры.СуммаУслугиСчета = ТЗ.Итог("СуммаУслугиСчета");
//Область.Параметры.СуммаУслуги = ТЗ.Итог("СуммаУслуги");
Область.Параметры.СуммаДолга = ТЗ.Итог("СуммаДолга");
Область.Параметры.СуммаСписанияПроживание = ТЗ.Итог("СуммаСписанияПроживание");
Область.Параметры.СуммаСписанияУслуги = ТЗ.Итог("СуммаСписанияУслуги");
Область.Параметры.СуммаСписания = ТЗ.Итог("СуммаСписания");
ТабДок.Вывести(Область) ;

Для каждого СтрокаУслугиСправочник Из УслугиРодительСправочник Цикл
	ОбластьУслуга = МакетОбработки.ПолучитьОбласть("Подножие|Услуга");
	
	//ОтборСтроки = Новый Структура("ДокументДолг, УслугаРодитель", Строка.ДокументДолг, СтрокаУслугиСправочник.УслугаРодитель);
	//СтрокиУслугиРодитель = ТЗ_УслугиРодитель.НайтиСтроки(ОтборСтроки);
	//Если СтрокиУслугиРодитель.Количество() > 0 Тогда 
		//СтрокиУслугиРодитель = СтрокиУслугиРодитель[0]; 
		ОбластьУслуга.Параметры.СуммаУслуга = СтрокаУслугиСправочник.СуммаИтого;
	//КонецЕсли;
	
	ТабДок.Присоединить(ОбластьУслуга);
	
КонецЦикла;

//Сумма списания неоплаченных  доп.услуг - 11950, из них БАР/МИНИБАР - 11550, прачечная  - 400
Запрос = Новый Запрос( "ВЫБРАТЬ
                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
                       |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                       |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты
                       |ИЗ
                       |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                       |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                       |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                       |ГДЕ
                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
                       |	И (ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                       |			ИЛИ ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо <= &ДатаПо
                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо >= &ДатаС
                       |	И ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                       |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ИСТИНА
                       |	И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))");

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_ДопУслуги = Запрос.Выполнить().Выгрузить();

СуммаОплаты = 0;
СуммаМинибар = 0;
СуммаПрачечная = 0;
Для Каждого Строка Из ТЗ_ДопУслуги Цикл
		Результат = Справочники.ДопУслуги.ПустаяСсылка();
		Ссылка = Строка.Услуга; 
		ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
		
		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР 
		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР                 
		Тогда
			СуммаМинибар = СуммаМинибар + Строка.СуммаОплаты;
		КонецЕсли;
		
		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
		Тогда
			СуммаПрачечная = СуммаПрачечная + Строка.СуммаОплаты;
		КонецЕсли;
		
		СуммаОплаты = СуммаОплаты + Строка.СуммаОплаты;
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("ИтогиУслуги");
Область.Параметры.СуммаДопУслуг = СуммаОплаты; 
Область.Параметры.СуммаМинибар = СуммаМинибар; 
Область.Параметры.СуммаПрачечная = СуммаПрачечная; 
ТабДок.Вывести(Область);

//Область = МакетОбработки.ПолучитьОбласть("ПустаяОбласть");
//ТабДок_1.Вывести(Область);
//ТабДок_1.Вывести(Область);

//ТабДок_1.ФиксацияСверху = 1;
Возврат ТабДок;
КонецФункции
// - Перенесено в модуль менеджера

&НаСервере               
Функция ЗаполнитьОтчетСписаниеНаСервере_OLD()  
ТабДок_1 = Новый ТабличныйДокумент;
Запрос = Новый Запрос;

Запрос.Текст = ТекстЗапроса();
Запрос.Текст = Запрос.Текст + "
	|	И (ЕСТЬNULL(СписаниеПроживания.СуммаОплаты, 0) <> 0 
	| ИЛИ ЕСТЬNULL(СписаниеУслуги.СуммаОплаты, 0) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РезервС,
	|	НомерВРезерв";	
	
Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

//МакетОбработки = Обработки.ЗакрытиеФинансовогоПериода_2.ПолучитьМакет("Макет");
Обработка = РеквизитФормыВЗначение("Объект");
МакетОбработки = Обработка.ПолучитьМакет("МакетСписание");

Область = МакетОбработки.ПолучитьОбласть("Заголовок");
ОтельСсылка = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Отель = ОтельСсылка.Наименование;
Область.Параметры.Отель = Отель;
Область.Параметры.ДатаС = Формат(ДатаС, "ДФ=dd.MM.yy");
Область.Параметры.ДатаПо = Формат(ДатаПо, "ДФ=dd.MM.yy");
ТабДок_1.Вывести(Область);

//ПолеОтчета.Очистить();
Область = МакетОбработки.ПолучитьОбласть("Шапка");
ТабДок_1.Вывести(Область);

НомерСтрокиШапкаСписание = ТабДок_1.ВысотаТаблицы;

//Данные.Очистить();
НомерКомментарий_Списание = Область.ШиринаТаблицы;
НомерСтрокиШапкаСписание = ТабДок_1.ВысотаТаблицы;

Для Каждого Строка Из ТЗ Цикл
	Область = МакетОбработки.ПолучитьОбласть("Строка");
	
	Область.Параметры.Заполнить(Строка);
	Область.Параметры.РезервС = Формат(Строка.РезервС, "ДФ=dd.MM.yy");
	Область.Параметры.РезервПо = Формат(Строка.РезервПо, "ДФ=dd.MM.yy");
	
	Область.Параметры.Заявка = Строка.ЗаявкаНаБронирование.Номер + " от " + Формат(Строка.ЗаявкаНаБронирование.Дата, "ДФ=dd.MM.yy");
	Область.Параметры.ЗаявкаНаБронирование = Строка.ЗаявкаНаБронирование;
	
	ИмяОбласти = "R1C" + Строка(НомерКомментарий_Списание);
	Область.Область(ИмяОбласти).Значение = Строка.КомментарийОтветственного;
	ТабДок_1.Вывести(Область);
	
	НоваяСтрока = ДанныеСписание.Добавить();        
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("Подножие");
//Область.Параметры.СуммаЗаявки = ТЗ.Итог("СуммаЗаявки");
//Область.Параметры.СуммаПроживаниеСчета = ТЗ.Итог("СуммаПроживаниеСчета");
//Область.Параметры.СуммаПроживание = ТЗ.Итог("СуммаПроживание");
//Область.Параметры.СуммаУслугиСчета = ТЗ.Итог("СуммаУслугиСчета");
//Область.Параметры.СуммаУслуги = ТЗ.Итог("СуммаУслуги");
Область.Параметры.СуммаДолга = ТЗ.Итог("СуммаДолга");
Область.Параметры.СуммаСписанияПроживание = ТЗ.Итог("СуммаСписанияПроживание");
Область.Параметры.СуммаСписанияУслуги = ТЗ.Итог("СуммаСписанияУслуги");
Область.Параметры.СуммаСписания = ТЗ.Итог("СуммаСписания");
ТабДок_1.Вывести(Область) ;

//Сумма списания неоплаченных  доп.услуг - 11950, из них БАР/МИНИБАР - 11550, прачечная  - 400
Запрос = Новый Запрос( "ВЫБРАТЬ
                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
                       |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                       |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты
                       |ИЗ
                       |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                       |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                       |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                       |ГДЕ
                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
                       |	И (ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                       |			ИЛИ ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо <= &ДатаПо
                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо >= &ДатаС
                       |	И ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                       |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ИСТИНА
                       |	И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))");

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_ДопУслуги = Запрос.Выполнить().Выгрузить();

СуммаОплаты = 0;
СуммаМинибар = 0;
СуммаПрачечная = 0;
Для Каждого Строка Из ТЗ_ДопУслуги Цикл
		Результат = Справочники.ДопУслуги.ПустаяСсылка();
		Ссылка = Строка.Услуга; 
		ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
		
		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР 
		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР                 
		Тогда
			СуммаМинибар = СуммаМинибар + Строка.СуммаОплаты;
		КонецЕсли;
		
		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
		Тогда
			СуммаПрачечная = СуммаПрачечная + Строка.СуммаОплаты;
		КонецЕсли;
		
		СуммаОплаты = СуммаОплаты + Строка.СуммаОплаты;
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("ИтогиУслуги");
Область.Параметры.СуммаДопУслуг = СуммаОплаты; 
Область.Параметры.СуммаМинибар = СуммаМинибар; 
Область.Параметры.СуммаПрачечная = СуммаПрачечная; 
ТабДок_1.Вывести(Область);

//Область = МакетОбработки.ПолучитьОбласть("ПустаяОбласть");
//ТабДок_1.Вывести(Область);
//ТабДок_1.Вывести(Область);

ТабДок_1.ФиксацияСверху = 1;
Возврат ТабДок_1;
КонецФункции

&НаСервере               
Функция ЗаполнитьОтчетСписание_АктыНаСервере_НеИспользуется()  
ТабДок_1 = Новый ТабличныйДокумент;

Запрос = Новый Запрос( "ВЫБРАТЬ
                       |	СписаниеДопУслуг.Ссылка КАК Ссылка
                       |ИЗ
                       |	Документ.СписаниеДопУслуг КАК СписаниеДопУслуг
                       |ГДЕ
                       |	СписаниеДопУслуг.ПометкаУдаления = ЛОЖЬ
                       |	И СписаниеДопУслуг.РезервСОтбор >= &РезервСОтбор
                       |	И СписаниеДопУслуг.РезервПоОтбор <= &РезервПоОтбор");

Запрос.УстановитьПараметр("РезервСОтбор", ДатаС);
Запрос.УстановитьПараметр("РезервПоОтбор", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Возврат ТабДок_1; КонецЕсли;

ИмяОбъекта = "СписаниеДопУслуг";
УслугиРодительСправочник = Новый ТаблицаЗначений;
УслугиРодительСправочник.Колонки.Добавить("УслугаРодитель");
УслугиРодительСправочник.Колонки.Добавить("ЗаголовокОтчеты");
УслугиРодительСправочник.Колонки.Добавить("НомерПП");
УслугиРодительСправочник.Колонки.Добавить("Номер");

Документы[ИмяОбъекта].ЗаполнитьУслугиРодительСправочник(УслугиРодительСправочник);

Для Каждого Строка Из ТЗ Цикл
	СписаниеОбъект = Строка.Ссылка.ПолучитьОбъект();
	Документы[ИмяОбъекта].ПечатьТелоАктаНаСервере(ТабДок_1, ИмяОбъекта, СписаниеОбъект, УслугиРодительСправочник); 
КонецЦикла;


//Сумма списания неоплаченных  доп.услуг - 11950, из них БАР/МИНИБАР - 11550, прачечная  - 400
Обработка = РеквизитФормыВЗначение("Объект");
МакетОбработки = Обработка.ПолучитьМакет("МакетДолги");

Запрос = Новый Запрос( "ВЫБРАТЬ
                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
                       |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                       |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты
                       |ИЗ
                       |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                       |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                       |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                       |ГДЕ
                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
                       |	И (ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                       |			ИЛИ ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо <= &ДатаПо
                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо >= &ДатаС
                       |	И ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                       |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ИСТИНА
                       |	И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))");

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_ДопУслуги = Запрос.Выполнить().Выгрузить();

СуммаОплаты = 0;
СуммаМинибар = 0;
СуммаПрачечная = 0;
Для Каждого Строка Из ТЗ_ДопУслуги Цикл
		Результат = Справочники.ДопУслуги.ПустаяСсылка();
		Ссылка = Строка.Услуга; 
		ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
		
		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР 
		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР                 
		Тогда
			СуммаМинибар = СуммаМинибар + Строка.СуммаОплаты;
		КонецЕсли;
		
		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
		Тогда
			СуммаПрачечная = СуммаПрачечная + Строка.СуммаОплаты;
		КонецЕсли;
		
		СуммаОплаты = СуммаОплаты + Строка.СуммаОплаты;
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("ИтогиУслуги");
Область.Параметры.СуммаДопУслуг = СуммаОплаты; 
Область.Параметры.СуммаМинибар = СуммаМинибар; 
Область.Параметры.СуммаПрачечная = СуммаПрачечная; 
ТабДок_1.Вывести(Область);


Возврат ТабДок_1;
КонецФункции

//
&НаКлиенте
Процедура ПолеОтчетаПриАктивизации(Элемент)
ИмяЭлемента = Элемент.Имя;
НомерСтроки = Элемент.ТекущаяОбласть.Верх;

Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда 
	ПредыдущийНомерСтроки = ПредыдущийНомерСтрокиДолги;
ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
	ПредыдущийНомерСтроки = ПредыдущийНомерСтрокиСписание;
Иначе
	Возврат;	
Конецесли;

Если ПредыдущийНомерСтроки <> Неопределено И НомерСтроки <> ПредыдущийНомерСтроки Тогда
    ЭтаФорма[ИмяЭлемента].Область(ПредыдущийНомерСтроки,,ПредыдущийНомерСтроки).ЦветФона = Новый Цвет;        
КонецЕсли;

ЭтаФорма[Элемент.Имя].Область(НомерСтроки,,НомерСтроки).ЦветФона = WebЦвета.АкварельноСиний;

Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда 
	ПредыдущийНомерСтрокиДолги = НомерСтроки;
ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
	ПредыдущийНомерСтрокиСписание = НомерСтроки;
Иначе
	Возврат;	
Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаДолгиПриАктивизации(Элемент)
ПолеОтчетаПриАктивизации(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаСписаниеПриАктивизации(Элемент)
ПолеОтчетаПриАктивизации(Элемент);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ПолеОтчетаПриИзменении_OLD(Элемент)
ИмяЭлемента = Элемент.Имя;
Имя = Элемент.ТекущаяОбласть.Имя;

Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда 
	НомерСтрокиШапка = НомерСтрокиШапкаДолги; 
	НомерКомментарий = НомерКомментарий_Долги;
ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
	НомерСтрокиШапка = НомерСтрокиШапкаСписание;
	НомерКомментарий = НомерКомментарий_Списание;
Иначе
	Возврат;	
Конецесли;

Индекс = СтрНайти(Имя,":");
Если Индекс <> 0 Тогда Возврат; КонецЕсли;

ИндексC = СтрНайти(Имя,"C"); 

НомерСтрокиСтрока = Сред(Имя, 2, ИндексC - 2);
НомерСтроки = ОбщийФункционалКлиентСервер.ПолучитьЧисло(НомерСтрокиСтрока);
Если НомерСтроки <= НомерСтрокиШапка Тогда Возврат; КонецЕсли;
Если НомерСтроки > ЭтаФорма[ИмяЭлемента].ВысотаТаблицы - 1 Тогда Возврат; КонецЕсли;

НомерСтолбцаСтрока = Сред(Имя, ИндексC + 1);
НомерСтолбца = ОбщийФункционалКлиентСервер.ПолучитьЧисло(НомерСтолбцаСтрока);

Если НомерСтолбца <> НомерКомментарий Тогда Возврат; КонецЕсли;
//Если НомерСтолбца <> Элемент.ТекущаяОбласть.Лево Тогда Возврат; КонецЕсли;

ИмяКомментарий = "R" + НомерСтрокиСтрока + "C" + НомерСтолбцаСтрока;
//Попытка 
	ЗначениеЯчейки = Элемент.ТекущаяОбласть.Значение;
//Исключение
//	Возврат;
//КонецПопытки;

Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда 
	СтрокаДанные = ДанныеДолги[НомерСтроки - НомерСтрокиШапка - 1];
ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
	СтрокаДанные = ДанныеСписание[НомерСтроки - НомерСтрокиШапка - 1];
Иначе
	Возврат;	
Конецесли;

Если ЗначениеЯчейки <> СтрокаДанные.КомментарийОтветственного Тогда
	СтрокаДанные.КомментарийОтветственного = ЗначениеЯчейки;
	СтрокаДанные.ЕстьИзменения = Истина;
	
	ЗаявкаНаБронирование = СтрокаДанные.ЗаявкаНаБронирование;
	ОтборСтроки = Новый Структура("ЗаявкаНаБронирование", ЗаявкаНаБронирование);
	Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда
		НайденныеСтроки = ДанныеСписание.НайтиСтроки(ОтборСтроки);
	ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
		НайденныеСтроки = ДанныеДолги.НайтиСтроки(ОтборСтроки);
	Иначе
		Возврат;	
	Конецесли;
	
	Если НайденныеСтроки.Количество() = 0 Тогда Возврат; КонецЕсли;
	НайденнаяСтрока = НайденныеСтроки[0];
	
	НайденнаяСтрока.КомментарийОтветственного = ЗначениеЯчейки;
	НайденнаяСтрока.ЕстьИзменения = Истина;                           
	
	ЗаявкаТекст = ЗаявкаТекст(ЗаявкаНаБронирование);
	Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда
		ЗаполнитьКомментарийПолеОтчета(ЗначениеЯчейки, ЗаявкаТекст, ПолеОтчетаСписание,  НомерКомментарий_Списание);
	ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
		ЗаполнитьКомментарийПолеОтчета(ЗначениеЯчейки, ЗаявкаТекст, ПолеОтчетаДолги, НомерКомментарий_Долги);
	Иначе
		Возврат;	
	Конецесли;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПриИзменении(Элемент)
ИмяЭлемента = Элемент.Имя;
Имя = Элемент.ТекущаяОбласть.Имя;

//Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда 
//	НомерСтрокиШапка = НомерСтрокиШапкаДолги; 
//	НомерКомментарий = НомерКомментарий_Долги;
//ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
//	НомерСтрокиШапка = НомерСтрокиШапкаСписание;
//	НомерКомментарий = НомерКомментарий_Списание;
//Иначе
//	Возврат;	
//Конецесли;

НомерСтрокиШапка = НомерСтрокиШапкаДолги; 
НомерКомментарий = НомерКомментарий_Долги;

Индекс = СтрНайти(Имя,":");
Если Индекс <> 0 Тогда Возврат; КонецЕсли;

ИндексC = СтрНайти(Имя,"C"); 

НомерСтрокиСтрока = Сред(Имя, 2, ИндексC - 2);
НомерСтроки = ОбщийФункционалКлиентСервер.ПолучитьЧисло(НомерСтрокиСтрока);
Если НомерСтроки <= НомерСтрокиШапка Тогда Возврат; КонецЕсли;
Если НомерСтроки > ЭтаФорма[ИмяЭлемента].ВысотаТаблицы - 1 Тогда Возврат; КонецЕсли;

НомерСтолбцаСтрока = Сред(Имя, ИндексC + 1);
НомерСтолбца = ОбщийФункционалКлиентСервер.ПолучитьЧисло(НомерСтолбцаСтрока);

Если НомерСтолбца <> НомерКомментарий Тогда Возврат; КонецЕсли;
//Если НомерСтолбца <> Элемент.ТекущаяОбласть.Лево Тогда Возврат; КонецЕсли;

ИмяКомментарий = "R" + НомерСтрокиСтрока + "C" + НомерСтолбцаСтрока;
//Попытка 
	ЗначениеЯчейки = Элемент.ТекущаяОбласть.Значение;
//Исключение
//	Возврат;
//КонецПопытки;

//Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда 
//	СтрокаДанные = ДанныеДолги[НомерСтроки - НомерСтрокиШапка - 1];
//ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
//	СтрокаДанные = ДанныеСписание[НомерСтроки - НомерСтрокиШапка - 1];
//Иначе
//	Возврат;	
//Конецесли;

СтрокаДанные = ДанныеДолги[НомерСтроки - НомерСтрокиШапка - 1];

Если ЗначениеЯчейки <> СтрокаДанные.КомментарийОтветственного Тогда
	СтрокаДанные.КомментарийОтветственного = ЗначениеЯчейки;
	СтрокаДанные.ЕстьИзменения = Истина;
	
	ЗаявкаНаБронирование = СтрокаДанные.ЗаявкаНаБронирование;
	ОтборСтроки = Новый Структура("ЗаявкаНаБронирование", ЗаявкаНаБронирование);
	//Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда
	//	НайденныеСтроки = ДанныеСписание.НайтиСтроки(ОтборСтроки);
	//ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
	//	НайденныеСтроки = ДанныеДолги.НайтиСтроки(ОтборСтроки);
	//Иначе
	//	Возврат;	
	//Конецесли;
	НайденныеСтроки = ДанныеСписание.НайтиСтроки(ОтборСтроки);
	
	Если НайденныеСтроки.Количество() = 0 Тогда Возврат; КонецЕсли;
	НайденнаяСтрока = НайденныеСтроки[0];
	
	НайденнаяСтрока.КомментарийОтветственного = ЗначениеЯчейки;
	НайденнаяСтрока.ЕстьИзменения = Истина;                           
	
	//ЗаявкаТекст = ЗаявкаТекст(ЗаявкаНаБронирование);
	//Если ИмяЭлемента = "ПолеОтчетаДолги" Тогда
	//	ЗаполнитьКомментарийПолеОтчета(ЗначениеЯчейки, ЗаявкаТекст, ПолеОтчетаСписание,  НомерКомментарий_Списание);
	//ИначеЕсли ИмяЭлемента = "ПолеОтчетаСписание" Тогда
	//	ЗаполнитьКомментарийПолеОтчета(ЗначениеЯчейки, ЗаявкаТекст, ПолеОтчетаДолги, НомерКомментарий_Долги);
	//Иначе
	//	Возврат;	
	//Конецесли;
	
	ЗаявкаТекст = ЗаявкаТекст(ЗаявкаНаБронирование);
	ЗаполнитьКомментарийПолеОтчета(ЗначениеЯчейки, ЗаявкаТекст, ПолеОтчетаСписание,  НомерКомментарий_Списание);
КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьКомментарийПолеОтчета(Комментарий, Заявка, Полеотчета, НомерКомментарий)
ОбластьНайдено = Полеотчета.НайтиТекст(Заявка); 	

Если ОбластьНайдено = Неопределено Тогда Возврат; КонецЕсли;

Имя = ОбластьНайдено.Имя;
Индекс = СтрНайти(Имя, "C") - 2;
ИмяСтроки = "R" + Сред(Имя, 2, Индекс);
ИмяОбласть = ИмяСтроки + "C" + Строка(НомерКомментарий);

ПолеОтчета.Область(ИмяОбласть).Значение = Комментарий;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаДолгиПриИзменении(Элемент)
ПолеОтчетаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаСписаниеПриИзменении_НетПока(Элемент)
ПолеОтчетаПриИзменении(Элемент);
КонецПроцедуры
//

&НаСервере
Процедура ОбновитьКомментарийОтветственного(ЗаявкаНаБронирование, КомментарийОтветственного); 
ЗаявкаОбъект = ЗаявкаНаБронирование.ПолучитьОбъект();

ЗаявкаОбъект.КомментарийОтветственного = КомментарийОтветственного; 

ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);

Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
Для Каждого Строка Из ДанныеДолги Цикл
	Если НЕ Строка.ЕстьИзменения Тогда Продолжить; КонецЕсли; 
	
	ЗаявкаОбъект = Строка.ЗаявкаНаБронирование.ПолучитьОбъект();
	ЗаявкаОбъект.КомментарийОтветственного = Строка.КомментарийОтветственного; 
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Строка.ЕстьИзменения = Ложь;
КонецЦикла;	

Для Каждого Строка Из ДанныеСписание Цикл
	Если НЕ Строка.ЕстьИзменения Тогда Продолжить; КонецЕсли; 
	
	ЗаявкаОбъект = Строка.ЗаявкаНаБронирование.ПолучитьОбъект();
	ЗаявкаОбъект.КомментарийОтветственного = Строка.КомментарийОтветственного; 
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Строка.ЕстьИзменения = Ложь;
КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
Если флЗакрытиеФормы Тогда Возврат; КонецЕсли;

ЕстьИзменения = Ложь;	
Для Каждого Строка Из ДанныеДолги Цикл
	Если Строка.ЕстьИзменения Тогда ЕстьИзменения = Истина; Прервать; КонецЕсли;
КонецЦикла;

Если ЕстьИзменения Тогда	
	Отказ = Истина;
	Текст = "Есть изменения !
			|
			|ЗАВЕРШИТЬ БЕЗ ИЗМЕНЕНИЙ ?";
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_ПередЗакрытием", ЭтаФорма);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ОКОтмена); 
 
	
	Возврат;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_ПередЗакрытием(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

флЗакрытиеФормы = Истина;

Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПолныйОтчет(Команда)
ПолныйОтчет = ПолныйОтчетНаСервере();

//ТабДок.Показать();
ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ПолныйОтчет, "Долги Списания"); 
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ,Истина);
КонецПроцедуры

&НаСервере                                                             
Функция ПолныйОтчетНаСервере()
ТабДок = Обработки.ЗакрытиеФинансовогоПериода.ПолныйОтчетНаСервере(ДатаС, ДатаПо, ДанныеДолги, НомерСтрокиШапкаДолги, НомерКомментарий_Долги);

Возврат ТабДок;
КонецФункции

// + Перенесено в модуль менеджера
&НаСервере                                                             
Функция ПолныйОтчетНаСервере_Перенесено()
ТабДок = ЗаполнитьОтчетДолгиНаСервере();

ТабДок1 = ЗаполнитьОтчетСписаниеНаСервере();

ОбщийФункционалСервер.ВставитьТабличныйДокумент(ТабДок, ТабДок1);

Возврат ТабДок;
КонецФункции
// - Перенесено в модуль менеджера







