
Процедура УменьшениеВозврат(ДокументОплатыВозврат) Экспорт
Запрос = Новый Запрос ("ВЫБРАТЬ
                       |	КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                       |	КассовыйДокументДолгиОплата.НомерСтроки КАК НомерСтроки,
                       |	КассовыйДокументДолгиОплата.ДокументДолг КАК ДокументДолг,
                       |	КассовыйДокументДолгиОплата.СчетГУИД КАК СчетГУИД,
                       |	КассовыйДокументДолгиОплата.Сумма КАК Сумма,
                       |	КассовыйДокументДолгиОплата.Ссылка.ВозвратДокумент КАК ВозвратДокумент
                       |ИЗ
                       |	Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                       |ГДЕ
                       |	КассовыйДокументДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                       |	И КассовыйДокументДолгиОплата.Ссылка.ВозвратДокумент = &ВозвратДокумент");

Запрос.УстановитьПараметр("ВозвратДокумент", ДокументОплатыВозврат);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Возврат; КонецЕсли;

Для Каждого Строка Из ТЗ Цикл
	Объект_П = Строка.ДокументДолг.ПолучитьОбъект();
	Если Объект_П = Неопределено Тогда Продолжить; КонецЕсли;
	
	
	
КонецЦикла;

	
КонецПроцедуры