
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если НастройкиСервер.ЭтоРеноме() Тогда	
	ПодтверждениеWORD = Истина;	
КонецЕсли;
	
НаАнглийском = Параметры.НаАнглийском;

ТабличныйДокументПараметр = Параметры.ТабличныйДокумент;
Если ТабличныйДокументПараметр <> Неопределено Тогда ТабличныйДокумент = ТабличныйДокументПараметр; КонецЕсли;  

ДокументДолгСсылка = Параметры.ДокументДолгСсылка;  
СчетГУИД = Параметры.СчетГУИД;  
Контрагент = Параметры.Контрагент;

Если ТабличныйДокументПараметр = Неопределено Тогда 
	Элементы.ФормаОткрытьСчетВEXCEL.Видимость = Ложь; 
	Элементы.ФормаСохранитьСчетВEXCEL.Видимость = Ложь; 
	Элементы.ВключитьСчетВПочту.Видимость = Ложь; 
	ВключитьСчетВПочту = Ложь;
	
	Элементы.ТабличныйДокумент.Видимость = Ложь;
Иначе
	Элементы.ФормаОткрытьСчетВEXCEL.Видимость = Истина; 
	Элементы.ФормаСохранитьСчетВEXCEL.Видимость = Истина; 
	Элементы.ВключитьСчетВПочту.Видимость = Истина; 
	ВключитьСчетВПочту = Истина;
	
	Элементы.ТабличныйДокумент.Видимость = Истина;
КонецЕсли;

ВыводПодтверждения = Неопределено;
Параметры.Свойство("ВыводПодтверждения", ВыводПодтверждения);
Если ВыводПодтверждения = Неопределено Тогда ВыводПодтверждения = Ложь; КонецЕсли;
Элементы.ФормаОткрытьПодтверждение.Видимость = ВыводПодтверждения; 
Элементы.ФормаСоздатьПодтверждение.Видимость = ВыводПодтверждения; 
Элементы.ВключитьПодтверждениеВПочту.Видимость = ВыводПодтверждения; 

////
ЭтаФорма.АвтоЗаголовок = Ложь;
Заголовок = ""; 

Если ВключитьСчетВПочту Тогда Заголовок = Заголовок + "С";  КонецЕсли; 
Если ВключитьСчетВПочту И ВыводПодтверждения Тогда Заголовок = Заголовок + "и"; КонецЕсли;	
Если ВыводПодтверждения Тогда Заголовок = Заголовок + "П"; КонецЕсли;	
Заголовок = Заголовок + ": ";	
ЭтаФорма.Заголовок = Заголовок + Контрагент;

Почта = Контрагент.ЭлПочта;

ПочтаТема = ПочтаТема();
ПочтаТекстСообщения = ПочтаТекстСообщения();

ИмяФайлаСчет = "Счет на оплату " + ПечатьСервер.ДополнениеТекст(ДокументДолгСсылка);
ИмяФайлаПодтверждение = "Подтверждение бронирования " + ПечатьСервер.ДополнениеТекст(ДокументДолгСсылка);
ПолноеИмяФайлаПодтверждение = ПечатьКлиентСервер.ПолноеИмяФайлаПодтверждение(ИмяФайлаПодтверждение, ПодтверждениеWORD);   
КонецПроцедуры

&НаСервере
Функция ПочтаТема()
//ПочтаТема = ПечатьСервер.ОрганизацияНаименование() + ". ";

ПочтаТема = "";

Если ВключитьСчетВПочту Тогда ПочтаТема = ПочтаТема + "Счет на оплату"; КонецЕсли; 
Если ВключитьСчетВПочту И ВключитьПодтверждениеВПочту Тогда ПочтаТема = ПочтаТема + " и "; КонецЕсли; 
Если ВключитьПодтверждениеВПочту Тогда ПочтаТема = ПочтаТема + "Подтверждение бронирования"; КонецЕсли; 

Если ВключитьСчетВПочту ИЛИ ВключитьПодтверждениеВПочту Тогда
	ПочтаТема = ПочтаТема + " " + ПечатьСервер.ДополнениеТекст(ДокументДолгСсылка);
КонецЕсли;

Возврат ПочтаТема;
КонецФункции

&НаСервере
Функция ПочтаТекстСообщения() 
Если НЕ ВключитьСчетВПочту И НЕ ВключитьПодтверждениеВПочту Тогда 
	ПочтаТекстСообщения = " "; 
	
	Возврат ПочтаТекстСообщения;
КонецЕсли; 
	
ПочтаТекстСообщения = "Уважаемые коллеги!!!";
ПочтаТекстСообщения = ПочтаТекстСообщения + Символы.ПС  + Символы.ПС;

//Организация = Константы.Организация.Получить();
//Если Организация.ОрганизацияИмя = "Лайв" Тогда 
//	ОтельТекст = "city-отеле Live";
//ИначеЕсли Организация.ОрганизацияИмя = "ДомСоветов" Тогда 
//	ОтельТекст = "отеле Дом Советов";
//ИначеЕсли Организация.ОрганизацияИмя = "СтритАрт" Тогда 
//	ОтельТекст = "отеле Street Art";
//Иначе   
//	ОтельТекст = "нашем отеле";
//КонецЕсли;	

Если НастройкиСервер.ЭтоЛайв() Тогда 
	ОтельТекст = "city-отеле Live";
ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда 
	ОтельТекст = "отеле Дом Советов";
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда 
	ОтельТекст = "отеле Street Art";
ИначеЕсли НастройкиСервер.ЭтоРеноме() Тогда 
	ОтельТекст = "отеле Renomme";
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда 
	ОтельТекст = "отеле Чехов";
	
Иначе   
	ОтельТекст = "нашем отеле";
КонецЕсли;

ПочтаТекстСообщения = ПочтаТекстСообщения + 
	"Благодарим за бронирование в " + ОтельТекст +"!!!
	|Направляем ";
Если ВключитьСчетВПочту Тогда ПочтаТекстСообщения = ПочтаТекстСообщения + "счет"; КонецЕсли; 
Если ВключитьСчетВПочту И ВключитьПодтверждениеВПочту Тогда ПочтаТекстСообщения = ПочтаТекстСообщения + " и "; КонецЕсли; 
Если ВключитьПодтверждениеВПочту Тогда ПочтаТекстСообщения = ПочтаТекстСообщения + "подтверждение бронирования"; КонецЕсли; 
ПочтаТекстСообщения = ПочтаТекстСообщения + "!"; 

ПочтаТекстСообщения = ПочтаТекстСообщения + Символы.ПС  + Символы.ПС;

ПочтаТекстСообщения = ПочтаТекстСообщения + "Будем рады новым заявкам!";

Возврат ПочтаТекстСообщения;
КонецФункции 


&НаКлиенте
Процедура ПриОткрытии(Отказ)
ПочтаПриИзменении(Неопределено);
КонецПроцедуры

//
&НаКлиенте
Процедура ПочтаПриИзменении(Элемент)
//ЕстьПочта = ЗначениеЗаполнено(Почта);
//Элементы.ФормаОтправитьНаПочту.Доступность = ЕстьПочта;
//Элементы.ПочтаТема.Доступность = ЕстьПочта;
//Элементы.ПочтаТекстСообщения.Доступность = ЕстьПочта;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьПодтверждениеВПочтуПриИзменении(Элемент)
Если ВключитьПодтверждениеВПочту Тогда
	Если ПроверитьПодтверждение() Тогда
		ВключитьПодтверждениеВПочту = Ложь;		
	КонецЕсли;
КонецЕсли;

ПочтаТема = ПочтаТема();
ПочтаТекстСообщения = ПочтаТекстСообщения();
КонецПроцедуры

&НаКлиенте
Процедура ВключитьСчетВПочтуПриИзменении(Элемент)
ПочтаТема = ПочтаТема();
ПочтаТекстСообщения = ПочтаТекстСообщения();   
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтправитьНаПочту(Команда)
Получатели = Новый СписокЗначений;
Получатели.Добавить(Почта);

Файлы = Новый Массив;

КаталогВременныхФайлов = КаталогВременныхФайлов();

Если ВключитьСчетВПочту Тогда
	Если СокрЛП(ПолноеИмяФайлаСчет) = "" Тогда
		ВременныйФайлСчет = КаталогВременныхФайлов + ИмяФайлаСчет + ".PDF";
		ТабличныйДокумент.Записать(ВременныйФайлСчет, "PDF");
	Иначе
		Индекс = СтрНайти(ПолноеИмяФайлаСчет, "\", НаправлениеПоиска.СКонца);
		ИмяФайла = Сред(ПолноеИмяФайлаСчет, Индекс + 1);
		ВременныйФайлСчет = КаталогВременныхФайлов + ИмяФайла + ".PDF";
		
		Если СохранитьСчетPDF(ВременныйФайлСчет) Тогда Возврат; КонецЕсли;
	КонецЕсли;
	Файлы.Добавить(ВременныйФайлСчет);
КонецЕсли;
	
Если ВключитьПодтверждениеВПочту 
И  СокрЛП(ПолноеИмяФайлаПодтверждение) <> ""  
Тогда
	ВременныйФайлПодтверждение = КаталогВременныхФайлов + ИмяФайлаПодтверждение + ".PDF";
	СохранитьПодтверждениеPDF(ВременныйФайлПодтверждение);
	Файлы.Добавить(ВременныйФайлПодтверждение);
КонецЕсли;

Если ЭтаФорма.КлючУникальности = Неопределено Тогда
	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор();
Иначе
	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор(ЭтаФорма.КлючУникальности);
КонецЕсли;	
ФайлыКУдалению = Файлы;
СлужебныеКлиент.ОтправитьEmail(ПочтаТема, Файлы, Получатели, ПочтаТекстСообщения, ФайлыКУдалению, УникальныйИдентификаторФормы);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПодтверждениеPDF(ПолноеИмяФайла)
ФайлНаДиске = Новый Файл(ПолноеИмяФайлаПодтверждение);
Если НЕ ФайлНаДиске.Существует() Тогда Возврат; КонецЕсли;	

Если ПодтверждениеWORD Тогда
	MSWord = Новый COMОбъект("Word.Application");
	Документ = MSWord.Documents.Open(ПолноеИмяФайлаПодтверждение);

	wdFormatPDF = 17;
	Документ.SaveAs2(ПолноеИмяФайла, wdFormatPDF); 

	Попытка
		wdDoNotSaveChanges = 0;
		MSWord.Quit(wdDoNotSaveChanges);
		MSWord = Неопределено;
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
Иначе	
	MSExcel = Новый COMОбъект("Excel.Application");
	WorkBook = MSExcel.Workbooks.Open(ПолноеИмяФайлаПодтверждение); 

	xlTypePDF = 0;
	Попытка 
		WorkBook.ExportAsFixedFormat (xlTypePDF , ПолноеИмяФайла);
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	
	Попытка
		MSExcel.Quit();
		MSExcel = Неопределено;
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СохранитьСчетPDF(ВременныйФайлСчет)
MSExcel = Новый COMОбъект("Excel.Application");	   
Книга = MSExcel.WorkBooks.Open(ПолноеИмяФайлаСчет);

Попытка
	MSExcel.Application.DisplayAlerts = False; 
	
	xlTypePDF =	0; //	"PDF" — файл в формате PDF (PDF)
	//Книга.ExportAsFixedFormat(xlTypePDF , ВременныйФайлСчет);
	Попытка 
		Книга.ExportAsFixedFormat (xlTypePDF , ВременныйФайлСчет);
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	
	Попытка
		MSExcel.Quit();
		MSExcel = Неопределено;
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	//SaveChanges = False;
	//Книга.Close(SaveChanges);
	//Excel.Quit();	
Исключение
	Сообщить(ОписаниеОшибки());

	Возврат Истина; 
КонецПопытки;

Возврат Ложь; 
КонецФункции
//

////
&НаКлиенте
Процедура СохранитьСчетВEXCEL(Команда)
СохранитьСчетДиалогВEXCEL();
КонецПроцедуры

&НаКлиенте
Функция СохранитьСчетДиалогВEXCEL()
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
Диалог.Расширение = "XLSX";

//Фильтр = НСтр("ru = 'Текст'; en = 'Text'")
//    + "(*.PDF)|*.PDF";
	
Диалог.Фильтр = "(*.xlsx)|*.xlsx";;

Диалог.ПолноеИмяФайла = ИмяФайлаСчет;

Если Диалог.Выбрать() Тогда
	ПолноеИмяФайлаСчет = Диалог.ПолноеИмяФайла; 
    ТабличныйДокумент.Записать(Диалог.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Возврат Ложь;
КонецЕсли;

Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОткрытьСчетВEXCEL(Команда)
Если ПроверитьСчет() Тогда Возврат; КонецЕсли;

Excel = Новый COMОбъект("Excel.Application");
Excel.Visible = Истина;
Книга = Excel.WorkBooks.Open(ПолноеИмяФайлаСчет);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьСчет()
Если ПолноеИмяФайлаСчет = "" Тогда 	
    ПоказатьПредупреждение(,"Счет не сохранен");
	Возврат Истина;
КонецЕсли;

ФайлНаДиске = Новый Файл(ПолноеИмяФайлаСчет);
Если НЕ ФайлНаДиске.Существует() Тогда
    ПоказатьПредупреждение(,"Файл счета отсутствует");
	Возврат Истина;
КонецЕсли;	

Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ОткрытьСчетВEXCEL_Вариант(Команда)
Если ПолноеИмяФайлаСчет = "" Тогда Перейти ~СОХРАНИТЬ_ФАЙЛ; КонецЕсли;

ФайлНаДиске = Новый Файл(ПолноеИмяФайлаСчет);
Если ФайлНаДиске.Существует() Тогда Перейти ~ОТКРЫТЬ_ФАЙЛ; КонецЕсли;		

~СОХРАНИТЬ_ФАЙЛ:
Если СохранитьСчетДиалогВEXCEL() Тогда Возврат; КонецЕсли;

 ~ОТКРЫТЬ_ФАЙЛ:
Excel = Новый COMОбъект("Excel.Application");	   
Книга = Excel.WorkBooks.Open(ПолноеИмяФайлаСчет);

Excel.Activate();
КонецПроцедуры
////

////
&НаКлиенте
Процедура СоздатьПодтверждение(Команда)
ПараметрыФормы = Новый Структура();
ПараметрыФормы.Вставить("ДокументДолгСсылка", ДокументДолгСсылка);
ПараметрыФормы.Вставить("СчетГУИД", СчетГУИД);

ИмяФайлаПодтверждение = "Подтверждение бронирования " + ПечатьСервер.ДополнениеТекст(ДокументДолгСсылка); 
ПараметрыФормы.Вставить("ИмяФайла", ИмяФайлаПодтверждение);

ПараметрыФормы.Вставить("ПолноеИмяФайла", ПолноеИмяФайлаПодтверждение);

ПараметрыФормы.Вставить("НаАнглийском", НаАнглийском);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормыСозданиеПодтверждения", ЭтаФорма);	
Если ПодтверждениеWORD Тогда
	Форма = ОткрытьФорму("ОбщаяФорма.СозданиеПодтвержденияWORD", ПараметрыФормы , ЭтаФорма
	,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
Иначе	
	Форма = ОткрытьФорму("ОбщаяФорма.СозданиеПодтвержденияEXCEL", ПараметрыФормы , ЭтаФорма
		,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецЕсли;

Если Форма <> Неопределено Тогда	
	Форма.Запустить();	
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормыСозданиеПодтверждения(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;	

Если Результат.ТекстОшибки <> "" Тогда 
	СообщитьТекстОшибкиФайл(Результат);
	
	ВключитьПодтверждениеВПочту = Ложь;
Иначе
	ВключитьПодтверждениеВПочту = Истина;
КонецЕсли;

ПочтаТема = ПочтаТема();
ПочтаТекстСообщения = ПочтаТекстСообщения();
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПодтверждение()
//Если ПолноеИмяФайлаПодтверждение = "" Тогда 	
//    ПоказатьПредупреждение(,"Предупреждение не создано");
//	Возврат Истина;
//КонецЕсли;

ФайлНаДиске = Новый Файл(ПолноеИмяФайлаПодтверждение);
Если НЕ ФайлНаДиске.Существует() Тогда
    ПоказатьПредупреждение(,"Файл предупреждения отсутствует");
	Возврат Истина;
КонецЕсли;	

Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура СообщитьТекстОшибкиФайл(Результат) 
ТекстОшибки = Результат.ТекстОшибки;
ОписаниеОшибки = Результат.ОписаниеОшибки;

Если СтрНайти(ОписаниеОшибки,"Ошибка совместного доступа к файлу") > 0 Тогда
	ТекстПредупреждения = "Ошибка совместного доступа к файлу подтверждения
							|
							|ЗАКРОЙТЕ ОТКРЫТЫЙ ФАЙЛ ПОДТВЕРЖДЕНИИЯ ...";
	
	ТекстСообщения =  ТекстОшибки + ". ЗАКРОЙТЕ ОТКРЫТЫЙ ФАЙЛ ПОДТВЕРЖДЕНИИЯ."; 
Иначе	
	ТекстПредупреждения = ТекстОшибки;	
	ТекстСообщения =  ТекстОшибки + ": " + ОписаниеОшибки + ". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ."; 
КонецЕсли;

ПоказатьПредупреждение(, ТекстПредупреждения);
Сообщить(ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьПодтверждение(Команда)
Если ПроверитьПодтверждение() Тогда Возврат; КонецЕсли;

Если ПодтверждениеWORD Тогда
	MSWord = Новый COMОбъект("Word.Application");
	MSWord.Visible = Истина;
	Документ = MSWord.Documents.Open(ПолноеИмяФайлаПодтверждение);

	MSWord.Activate();
Иначе
	
	КнопкиСписок = Новый СписокЗначений;
	КнопкиСписок.Добавить("PDF", "PDF");
	КнопкиСписок.Добавить("EXCEL", "EXCEL");
	КнопкиСписок.Добавить("Отмена");
	Результат = Ждать ВопросАсинх("Открыть в формате",КнопкиСписок);
	
	Если Результат = "PDF" Тогда
		ВременныйФайлПодтверждение = КаталогВременныхФайлов() + ИмяФайлаПодтверждение + ".PDF";
		СохранитьПодтверждениеPDF(ВременныйФайлПодтверждение);
		ЗапуститьПриложение(ВременныйФайлПодтверждение);
	ИначеЕсли Результат = "EXCEL" Тогда
		
		MSExcel = Новый COMОбъект("Excel.Application");

		MSExcel.Visible = Истина;
		MSExcel.Workbooks.Open(ПолноеИмяФайлаПодтверждение); 
		
		xlNormalView = 1;
		MSExcel.ActiveWindow.View = xlNormalView;
	КонецЕсли;	
КонецЕсли;	
	
КонецПроцедуры
////

//////// +++++++++++++++++++++++++++++++++ 

&НаСервере
Процедура ЗаполнитьБроньТЕСТ()
НоваяСтрока	= НовНомера.Добавить();
НоваяСтрока.Бронь = Документы.ЗаявкаНаБронирование.НайтиПоНомеру("000000004"); 
НоваяСтрока.РезервС = "РезервС"; 
НоваяСтрока.РезервПо = "РезервПо";

НоваяСтрока.Колво = 1;
НоваяСтрока.СТ = 1;

НоваяСтрока	= НовНомера.Добавить();
НоваяСтрока.Бронь = Документы.ЗаявкаНаБронирование.НайтиПоНомеру("000000004"); 
НоваяСтрока.РезервС = "РезервС"; 
НоваяСтрока.РезервПо = "РезервПо";

НоваяСтрока.Колво = 1;
НоваяСтрока.СТ = 2;
КонецПроцедуры








