
Функция ПроверитьКонтрагента(Контрагент) Экспорт
Если Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ПустаяСсылка() 
Тогда Возврат "Тип клиента - пусто"; КонецЕсли;

Если Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.Физлицо
И ЗначениеЗаполнено(Контрагент.ИНН)
Тогда Возврат "Тип клиента - Физлицо и заполнено ИНН"; КонецЕсли;

Если Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.Юрлицо
И НЕ (СтрДлина(Контрагент.ИНН) = 10 ИЛИ СтрДлина(Контрагент.ИНН) = 12)
Тогда Возврат "Тип клиента - Юрлицо и длина ИНН <> 10 и длина ИНН <> 12"; КонецЕсли;
		
Возврат "";	
КонецФункции

//
Функция ПроверитьГрупповойСчет(ГрупповойСчет) Экспорт
Ответ = Новый Структура("Ошибка, ТекстОшибки, ТекстПредупреждения", Ложь, "", "");	
	
ДокументыДолги = ГрупповойСчет.ДокументыДолги;

ТекстОшибки = "";
НачалоМесяцаДатаПо = НачалоМесяца(ГрупповойСчет.ДатаДокумента);

Для Каждого Строка Из ДокументыДолги Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Заявка,
	                      |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаС,
	                      |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаПо
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
	                      |ГДЕ
	                      |	ЗаявкаНаБронированиеСчета.Ссылка = &ДокументДолг
	                      |	И ЗаявкаНаБронированиеСчета.СчетГУИД = &СчетГУИД");
	
	Запрос.УстановитьПараметр("ДокументДолг", Строка.ДокументДолг);
	Запрос.УстановитьПараметр("СчетГУИД", Строка.СчетГУИД);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	СтрокаТЗ = ТЗ[0];
	
	//Если ДатаПо <> Неопределено Тогда 
		//Если НачалоМесяца(СтрокаТЗ.ДатаПо) <> НачалоМесяцаДатаПо Тогда 
		//	Текст = " есть счет за другой месяц. Заявка " +  СтрокаТЗ.Заявка;
		//	ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Текст, "," + Символы.ПС);
		//КонецЕсли;	
	//КонецЕсли;	
	
	Если СтрокаТЗ.Заявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования 
	ИЛИ СтрокаТЗ.Заявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
	Тогда
		Текст = "Есть Заявка " + СтрокаТЗ.Заявка + " со статусом " + СтрокаТЗ.Заявка.Статус;
		ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Текст, "," + Символы.ПС);
	КонецЕсли;
КонецЦикла;

Если ТекстОшибки <> "" Тогда
	Ответ.ТекстОшибки = ТекстОшибки;
	Ответ.Ошибка = Истина;
КонецЕсли;

ЕстьБронь = Ложь;
Для Каждого Строка Из ДокументыДолги Цикл
	Если Строка.ДокументДолг.Статус = Перечисления.СтатусБрони.Бронь Тогда
		ЕстьБронь = Истина;
		
		Прервать;
	КонецЕсли;
КонецЦикла;

ЕстьНеБронь = Ложь;
Для Каждого Строка Из ДокументыДолги Цикл
	Если Строка.ДокументДолг.Статус <> Перечисления.СтатусБрони.Бронь Тогда
		ЕстьНеБронь = Истина;
		
		Прервать;
	КонецЕсли;
КонецЦикла;

Если ЕстьБронь И ЕстьНеБронь Тогда
	Текст = "Есть Заявки со статусом 'Бронь' и НЕ 'Бронь";
	Ответ.ТекстПредупреждения = Текст;
КонецЕсли;

Возврат Ответ;
КонецФункции
//

//
Функция УчитыватьНДС(ДатаУчета) Экспорт
Возврат (ДатаУчета >= '20250101');	
КонецФункции 

Функция УчитыватьНДС_Чек(ДатаУчета) Экспорт
Возврат (ТекущаяДата() >= '20250101');	
//Возврат (ДатаУчета >= '20250101');	
КонецФункции 

Функция СтавкаНДС(ЭтоКоворкинг) Экспорт
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

Если ЭтоКоворкинг И (ТекущаяОрганизация.КоворкингОрганизацияЕсть) Тогда
	СтавкаНДС = ТекущаяОрганизация.КоворкингСтавкаНДС;	
Иначе	
	СтавкаНДС = ТекущаяОрганизация.СтавкаНДС;	
КонецЕсли;

Возврат СтавкаНДС;
КонецФункции

Функция СтавкаНДСТекущая(СтавкаНДС, ДатаУчета) Экспорт
Если ДатаУчета < '20260101'                  
И СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда		
	Возврат Перечисления.СтавкиНДС.НДС20;
Иначе
	Возврат СтавкаНДС;
КонецЕсли;
КонецФункции

Функция СтавкаНДСЧисло(СтавкаНДС) Экспорт
Если СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
	Возврат 22;
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
	Возврат 20;
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
	Возврат 5;
КонецЕсли;
Возврат 0;
КонецФункции

Функция СуммаНДС(СтавкаНДС, Сумма) Экспорт
Если СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
	Возврат Окр(Сумма * (0.22 / 1.22), 2);
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
	Возврат Окр(Сумма * (0.2 / 1.2), 2);
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
	Возврат Окр(Сумма * (0.05 / 1.05), 2);
КонецЕсли;
Возврат 0;
КонецФункции

Функция СуммаБезНДС(СтавкаНДС, Сумма) Экспорт
Если СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
	Возврат Окр(Сумма / 1.22, 2);
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
	Возврат Окр(Сумма / 1.2, 2);
ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
	Возврат Окр(Сумма  / 1.05, 2);
КонецЕсли;
Возврат Сумма;
КонецФункции
//


//// + Заявка На бронирование
Функция ДвухМестный(ДанныеОбъект) Экспорт
Если ДанныеОбъект.КатегорияНомера.ТолькоОдноместный Тогда 
	Двухместный=Ложь;
	
	Возврат Двухместный;
КонецЕсли;
	
Если ДанныеОбъект.КолВоЧеловек = 1 Тогда
	Двухместный=Ложь;
ИначеЕсли ДанныеОбъект.КолВоЧеловек > 1 Тогда 
	Двухместный=Истина;
Иначе 
	Двухместный = Неопределено;
КонецЕсли;
 
Возврат Двухместный;  
КонецФункции

Функция ПроверкаЗаполненияЗаявкаНабронированиеТекстСообщения(ДанныеОбъект, Разделитель) Экспорт
ТекстСообщения = "";

Если ДанныеОбъект.Клиент.Пустая() тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнен клиент.", Разделитель);
конецесли;

Если ДанныеОбъект.КатегорияНомера.Пустая() тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнена категория номера.", Разделитель);
конецесли;

Если ДанныеОбъект.НомерВРезерв.Пустая() И НЕ ДанныеОбъект.ЛистОжидания тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнен номер.", Разделитель);
конецесли;

Если НЕ ЗначениеЗаполнено(ДанныеОбъект.РезервС) тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнено Резерв С.", Разделитель);
конецесли;

Если ДанныеОбъект.ВремяЗаезда.Пустая() тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнено время заезда.", Разделитель);
конецесли;

Если НЕ ЗначениеЗаполнено(ДанныеОбъект.РезервПо) тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнено Резерв По.", Разделитель);
конецесли;

Если ДанныеОбъект.ВремяВыезда.Пустая() тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнено время выезда.", Разделитель);
конецесли;

Если ДанныеОбъект.РезервС > ДанныеОбъект.РезервПо Тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Резерв С > Резерв По.", Разделитель);
конецесли;

Если НЕ ЗначениеЗаполнено(ДанныеОбъект.КаналБронирования) Тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Не заполнен Канал бронирования.", Разделитель);
конецесли;

Если НЕ ЗначениеЗаполнено(ДанныеОбъект.ТипБронирования) Тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Не заполнен Тип бронирования.", Разделитель);
конецесли;

Возврат ТекстСообщения;

// + ПСН
//Если Тариф.Пустая() тогда
//	Сообщить("Незаполнен Тариф");
//	Возврат Ложь;
//конецесли;
// - ПСН
КонецФункции

//
Функция ЗанятостьНомераПериодРезерва(РезервС, РезервПо, ВремяЗаезда, ВремяВыезда)  Экспорт
Заезд=0;
Если ВремяЗаезда=Перечисления.ВремяЗаезда.Вр0 тогда
	Заезд=0;
иначеесли ВремяЗаезда=Перечисления.ВремяЗаезда.Вр6 тогда
	Заезд=6;
иначеесли ВремяЗаезда=Перечисления.ВремяЗаезда.Вр14 тогда
	//Заезд=12;
	Заезд=14;
иначеесли ВремяЗаезда=Перечисления.ВремяЗаезда.Вр18 тогда
	Заезд=18;
конецесли;

Выезд=0;
Если ВремяВыезда=Перечисления.ВремяВыезда.Вр0 тогда
	//Выезд=0;
	Выезд=24;
иначеесли ВремяВыезда=Перечисления.ВремяВыезда.Вр6 тогда
	Выезд=6;
иначеесли ВремяВыезда=Перечисления.ВремяВыезда.Вр12 тогда
	//Выезд=14;
	Выезд=12;
иначеесли ВремяВыезда=Перечисления.ВремяВыезда.Вр18 тогда
	Выезд=18;
конецесли;

НачалоПериодаРезерва = НачалоЧаса(НачалоДня(РезервС)+Заезд*3600);
КонецПериодаРезерва = НачалоЧаса(НачалоДня(РезервПо)+Выезд*3600);

ПериодРезерва = Новый Структура("НачалоПериодаРезерва, КонецПериодаРезерва", НачалоПериодаРезерва, КонецПериодаРезерва);
Возврат ПериодРезерва; 
КонецФункции	

Функция ЗанятостьНомераПроверить(РезервС, РезервПо, ВремяЗаезда, ВремяВыезда, НомерКуда, БонШанс, ТекущийРегистратор)  Экспорт
Ответ = ЗанятостьНомераПериодРезерва(РезервС, РезервПо, ВремяЗаезда, ВремяВыезда);

НачалоПериодаРезерва = Ответ.НачалоПериодаРезерва;
КонецПериодаРезерва = Ответ.КонецПериодаРезерва;

ЗапросСвободных=Новый Запрос("ВЫБРАТЬ
                             |	ЗанятостьНомеров.Номер КАК Номер,
                             |	ЗанятостьНомеров.Регистратор КАК Регистратор,
                             |	МАКСИМУМ(ЗанятостьНомеров.ПериодРезерва) КАК ПериодРезерваМаксимум,
                             |	МИНИМУМ(ЗанятостьНомеров.ПериодРезерва) КАК ПериодРезерваМинимум
                             |ИЗ
                             |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                             |ГДЕ
                             |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ПериодН И &ПериодК
                             |	И ЗанятостьНомеров.Номер = &Номер
							 |  И ЗанятостьНомеров.Регистратор <> &Регистратор");

Если БонШанс Тогда
	ЗапросСвободных.Текст = ЗапросСвободных.Текст + " И ЗанятостьНомеров.БонШанс = ЛОЖЬ"; 
КонецЕсли;

ЗапросСвободных.Текст = ЗапросСвободных.Текст + "
							|
                             |СГРУППИРОВАТЬ ПО
                             |	ЗанятостьНомеров.Номер,
							 |  ЗанятостьНомеров.Регистратор"; 

ЗапросСвободных.УстановитьПараметр("ПериодН",НачалоПериодаРезерва);
ЗапросСвободных.УстановитьПараметр("ПериодК",КонецПериодаРезерва - 1);
ЗапросСвободных.УстановитьПараметр("Номер", НомерКуда);
ЗапросСвободных.УстановитьПараметр("Регистратор", ТекущийРегистратор);
ТЗсвободных=ЗапросСвободных.Выполнить().Выгрузить();
//Если ТЗсвободных.Количество()<> 0 тогда
//	Возврат Истина;
//конецесли;

Результат = ТЗсвободных.Количество() <>  0;
Если Результат Тогда
	Регистратор = ТЗсвободных[0].Регистратор;
Иначе
	Регистратор = Неопределено;
КонецЕсли;

Ответ = Новый Структура("Результат, НачалоПериодаРезерва, КонецПериодаРезерва, Регистратор"
	, Результат, НачалоПериодаРезерва, КонецПериодаРезерва, Регистратор);
Возврат Ответ;
КонецФункции	
//

Функция СуммаКомиссии(Заявка, ПроживаниеСуммаБезСкидки, Счета, СчетаДетальноДолги, СтрокиУслуги, ПроцентКомиссии) Экспорт
	
Если Заявка.Бронирует.Турагентство Тогда
	СуммаКомиссииПроживание = Окр(ПроживаниеСуммаБезСкидки * ПроцентКомиссии/100, 2); 

	СуммаКомиссииУслуги = 0;
	
	ОтборСтрокиСчета = Новый Структура("Контрагент", Заявка.Бронирует);  
	НайденныеСчета = Счета.НайтиСтроки(ОтборСтрокиСчета);
	Для Каждого Счет Из НайденныеСчета Цикл
		ОтборСтрокиУслугиСчетГУИД = Новый Структура("Услуга, СчетГУИД", Истина, Счет.СчетГУИД);	
		СтрокиДетальноДолги = СчетаДетальноДолги.НайтиСтроки(ОтборСтрокиУслугиСчетГУИД);
		
		Для Каждого СтрокаДетальноДолги Из СтрокиДетальноДолги Цикл 
            // + Аудит
			//ОтборСтрокиУслуги = Новый Структура("ГУИД", Истина, СтрокаДетальноДолги.ДолгиГУИД);	
			ОтборСтрокиУслуги = Новый Структура("ГУИД", СтрокаДетальноДолги.ДолгиГУИД);	
            // - Аудит
			НайденныеСтрокиУслуги = СтрокиУслуги.НайтиСтроки(ОтборСтрокиУслуги);
	
			Для Каждого СтрокаУслуга Из НайденныеСтрокиУслуги Цикл
				Результат = Справочники.ДопУслуги.ПустаяСсылка();
				Ссылка = СтрокаУслуга.Услуга; 
				ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
				
				Если СтрокаУслуга.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ 
				ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ 
				Тогда
					СуммаУслуга = СтрокаУслуга.Цена * СтрокаУслуга.Количество; 
					//СуммаУслуга = СтрокаУслуга.Сумма; 
					СуммаКомиссииУслуги = СуммаКомиссииУслуги + Окр(СуммаУслуга * ПроцентКомиссии/100, 2);;						
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;

	СуммаКомиссии = СуммаКомиссииПроживание + СуммаКомиссииУслуги;
Иначе	
	СуммаКомиссии = 0;
КонецЕсли;	

Возврат СуммаКомиссии;
КонецФункции
//// - Заявка На бронирование

Функция СуммаВ2В(СтрокаЗаявка, ПроцентВ2В, СтрокаПроживание) Экспорт
Если ПроцентВ2В <> 0  
И СтрокаЗаявка.В2В Тогда 
	СуммаВ2В = (Окр(СтрокаПроживание.Цена / ((100 - ПроцентВ2В)/ 100) - СтрокаПроживание.Цена) * СтрокаПроживание.Количество);
Иначе
	СуммаВ2В = 0;
КонецЕсли;

Возврат СуммаВ2В;
КонецФункции

//// + Цены, Суммы

Функция ДатаПереходаНаНовыйКалендарьЦен() Экспорт
Возврат '20240401';	
КонецФункции

// + ПСН
Функция ОкруглитьЦену(Цена) Экспорт
Возврат Цел(Цена);
КонецФункции

Функция ОкруглитьЦену_25(Цена) Экспорт
    Сотен = 100 * Цел(Цена/100);
    Рублей = Цена - Сотен;
    Если Рублей>=75 Тогда
        Рублей = 100;
    ИначеЕсли Рублей >= 25 Тогда
        Рублей = 50;
    Иначе
        Рублей = 0;        
    КонецЕсли;
    Возврат Сотен+Рублей;
КонецФункции

Функция ОкруглитьСумма(Сумма) Экспорт
//  Возврат Цел(Сумма);
Возврат Окр(Сумма, 2);
КонецФункции
// - ПСН

//
Функция ЦенаПроцентСкидкиБезЗавтрака(Цена, ПроцентСкидкиБезЗавтрака) Экспорт
Цена_П = Цена * (100.00 - ПроцентСкидкиБезЗавтрака)/100.00; 
Цена_П = ДокументыСервер.ОкруглитьЦену(Цена_П);

Возврат Цена_П;	
КонецФункции
//
Функция ПолучитьБонШансЦена(ДатаЦены)
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	ЦеныБонШанс.Цена КАК Цена
                      |ИЗ
                      |	РегистрСведений.ЦеныБонШанс КАК ЦеныБонШанс
                      |ГДЕ
                      |	ЦеныБонШанс.ДатаЦены <= &ДатаЦены
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ЦеныБонШанс.ДатаЦены УБЫВ");
Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены); 

Выборка = Запрос.Выполнить().Выбрать();

Если Выборка.Следующий() Тогда 
	Возврат Выборка.Цена;
Иначе 
	БонШансЦена = Константы.БонШансЦена.Получить();
	Возврат БонШансЦена;
КонецЕсли;
КонецФункции

// + ЗаполнитьТаблицуПроживания_Таблица 
Функция ЗаполнитьТаблицуПроживания_Таблица(Объект, Двухместный) Экспорт
//	
Если Объект.РезервПо < ДатаПереходаНаНовыйКалендарьЦен() Тогда
	ТЗ = ДокументыСервер_Старый.ЗаполнитьТаблицуПроживания_Таблица(Объект, Двухместный);
	Возврат ТЗ;
КонецЕсли;	
//

ПроцентСкидки = ИтогоСкидкаКлиент(Объект, Истина); 

Массив = Новый Массив();
ТЗ = Объект.Проживание.Выгрузить(Массив);

Если Объект.РезервС = Объект.РезервПо Тогда
	Если Объект.БонШанс Тогда
		НовДТ = ТЗ.Добавить();
		
		НовДТ.ДеньПроживания = Объект.РезервС;
		НовДТ.Количество = 1;
		
		Цена = ПолучитьБонШансЦена(НовДТ.ДеньПроживания);
		НовДТ.Цена = Цена;
		НовДТ.СуммаБезСкидки = НовДТ.Цена * НовДТ.Количество;
		НовДТ.Сумма = НовДТ.Цена * НовДТ.Количество;
		
	Иначе
		НовДТ = ТЗ.Добавить();
		
		НовДТ.ДеньПроживания = Объект.РезервС;
		
		НовДТ.Количество = 1;
		
		//Если Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр0 Тогда
		//	НовДТ.Количество = 2;
		//ИначеЕсли Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр6 Тогда
		//	НовДТ.Количество = 1.5;
		//Иначе
		//	НовДТ.Количество = 1;
		//КонецЕсли;		
		//
		//Если Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр18 Тогда	
		//	НовДТ.Количество = НовДТ.Количество + 0.5;
		//ИначеЕсли Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр0 Тогда	
		//	НовДТ.Количество = НовДТ.Количество + 1;
		//КонецЕсли;		
		
		ЗаполнитьЦенаСуммыСтрокаПроживание(НовДТ, Объект, Двухместный, ПроцентСкидки);
	КонецЕсли;		
	
Иначе

	ДТН=НачалоДня(Объект.РезервС);

	Пока ДТН<=НачалоДня(Объект.РезервПо - 86400) Цикл 
		НовДТ = ТЗ.Добавить();
		
		НовДТ.ДеньПроживания=ДТН;
		
		Если ДТН=НачалоДня(Объект.РезервС) Тогда 
			Если Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр0 Тогда
				НовДТ.Количество = 2;
			ИначеЕсли Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр6 Тогда
				НовДТ.Количество = 1.5;
			Иначе
				НовДТ.Количество = 1;
			КонецЕсли;		
		ИначеЕсли ДТН=НачалоДня(Объект.РезервПо-86400) Тогда // дата выезда
			Если Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр18 Тогда	
				НовДТ.Количество = 1.5;
			ИначеЕсли Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр0 Тогда	
				НовДТ.Количество = 2;
			Иначе	
				НовДТ.Количество = 1;
			КонецЕсли;
		Иначе 
			НовДТ.Количество=1;
		КонецЕсли;
		
		ЗаполнитьЦенаСуммыСтрокаПроживание(НовДТ, Объект, Двухместный, ПроцентСкидки);
		
		ДТН=ДТН+86400;
	КонецЦикла;
КонецЕсли;

Возврат ТЗ;
КонецФункции

Процедура ЗаполнитьЦенаСуммыСтрокаПроживание(Строка, Объект, Двухместный, ПроцентСкидки) Экспорт
ТарифныйПлан = Объект.ТарифныйПлан;

Если ЗначениеЗаполнено(ТарифныйПлан) Тогда
	Цена =  ДокументыСервер.ЦенаНаДеньТарифныйПлан(Строка.ДеньПроживания, ТарифныйПлан
		, Объект.КатегорияНомера, Объект.БезЗавтрака, Двухместный);
		
	Если Цена = 0 Тогда Перейти ~ЦЕНОВАЯ_ПОЛИТИКА; КонецЕсли;	

	Строка.Цена =  Цена;	
	Строка.СуммаБезСкидки = Строка.Цена * Строка.Количество;		
	
	Строка.Сумма = Строка.СуммаБезСкидки;
	
	Возврат;
КонецЕсли;

~ЦЕНОВАЯ_ПОЛИТИКА:	
Строка.Цена =  ДокументыСервер.ЦенаНаДень(Строка.ДеньПроживания, Объект.КатегорияНомера
	, Объект.БезЗавтрака, Двухместный);

Строка.СуммаБезСкидки = Строка.Цена * Строка.Количество;

ЗаполнитьСтрокаПроживаниеСкидкаСумма(Строка, ПроцентСкидки);
КонецПроцедуры

Функция ЦенаНаДень(ДТН, КатегорияНомера, БезЗавтрака, Двухместный) Экспорт
//	
Если ДТН < ДатаПереходаНаНовыйКалендарьЦен() Тогда
	Цена = ДокументыСервер_Старый.ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомера, БезЗавтрака, Двухместный);
	Возврат Цена;
КонецЕсли;	
//
	
Цена = ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомера, БезЗавтрака, Двухместный);
Возврат Цена;
КонецФункции	

Функция ЦенаНаДеньТарифныйПлан(ДТН, ТарифныйПлан, КатегорияНомера
			, Знач БезЗавтрака, Двухместный) Экспорт
	Если НЕ ЗначениеЗаполнено(ТарифныйПлан) Тогда Возврат 0; КонецЕсли; 
	
	Если Двухместный = Неопределено Тогда Возврат 0; КонецЕсли;	

	БезЗавтракаПараметр = БезЗавтрака;	
	
	ВыходнойДень = ДеньНедели(ДТН) > 4;
	
	ТарифныйПланСтроки = ТарифныйПлан.ТарифныйПланСтроки.Выгрузить();
	
	ТарифныйПланСтроки.Сортировать("ДатаТарифаС, ДатаТарифаПо");
	
	СтрокаТарифа = Неопределено;
	Для Каждого Строка Из ТарифныйПланСтроки Цикл
		Если ЗначениеЗаполнено(Строка.ДатаТарифаС) Тогда
			Если Строка.ДатаТарифаС > ДТН Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Строка.ДатаТарифаПо) Тогда
			Если Строка.ДатаТарифаПо < ДТН Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.КатегорияНомера) Тогда
			Если Строка.КатегорияНомера <> КатегорияНомера Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;           
		
		СтрокаТарифа = Строка;
		Прервать;
	КонецЦикла;
	
	Если СтрокаТарифа = Неопределено Тогда Возврат 0; КонецЕсли;	
	
	Если ВыходнойДень И Двухместный И БезЗавтракаПараметр  Тогда
		ЦенаВыходныеДвухБезЗавтрака = ?(СтрокаТарифа.ЦенаВыходныеДвухБезЗавтрака = 0
			, СтрокаТарифа.ЦенаВыходныеДвух, СтрокаТарифа.ЦенаВыходныеДвухБезЗавтрака); 
		
		Цена	= ЦенаВыходныеДвухБезЗавтрака;
	ИначеЕсли ВыходнойДень И Двухместный И (НЕ БезЗавтракаПараметр) Тогда
		Цена	= СтрокаТарифа.ЦенаВыходныеДвух;
		
	ИначеЕсли ВыходнойДень И (НЕ Двухместный) И БезЗавтракаПараметр  Тогда
		ЦенаВыходныеБезЗавтрака = ?(СтрокаТарифа.ЦенаВыходныеБезЗавтрака = 0
			, СтрокаТарифа.ЦенаВыходные, СтрокаТарифа.ЦенаВыходныеБезЗавтрака); 
		
		Цена	= ЦенаВыходныеБезЗавтрака;
	ИначеЕсли ВыходнойДень И (НЕ Двухместный) И (НЕ БезЗавтракаПараметр) Тогда
		Цена	= СтрокаТарифа.ЦенаВыходные;
		
//		
	ИначеЕсли (НЕ ВыходнойДень) И Двухместный И БезЗавтракаПараметр  Тогда
		ЦенаБудниДвухБезЗавтрака = ?(СтрокаТарифа.ЦенаБудниДвухБезЗавтрака = 0
			, СтрокаТарифа.ЦенаБудниДвух, СтрокаТарифа.ЦенаБудниДвухБезЗавтрака); 
			
		Цена	= ЦенаБудниДвухБезЗавтрака;
	ИначеЕсли (НЕ ВыходнойДень) И Двухместный И (НЕ БезЗавтракаПараметр) Тогда
		Цена	= СтрокаТарифа.ЦенаБудниДвух;
		
	ИначеЕсли (НЕ ВыходнойДень) И (НЕ Двухместный) И БезЗавтракаПараметр  Тогда
		ЦенаБудниБезЗавтрака = ?(СтрокаТарифа.ЦенаБудниБезЗавтрака = 0
			, СтрокаТарифа.ЦенаБудни, СтрокаТарифа.ЦенаБудниБезЗавтрака); 
		
		Цена	= ЦенаБудниБезЗавтрака;
	ИначеЕсли (НЕ ВыходнойДень) И (НЕ Двухместный) И (НЕ БезЗавтракаПараметр) Тогда
		Цена	= СтрокаТарифа.ЦенаБудни;
	КонецЕсли;

	Возврат Цена;
КонецФункции

Функция ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомера, БезЗавтрака, Двухместный) Экспорт
	
Если ДТН < ДатаПереходаНаНовыйКалендарьЦен() Тогда
	Цена = ДокументыСервер_Старый.ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомера, БезЗавтрака, Двухместный);
	Возврат Цена;
КонецЕсли;	

Результат = КалендарьЦен.ПолучитьТекущаяЦенаДня(ДТН, КатегорияНомера, БезЗавтрака);	
Если Двухместный Тогда
	Цена = Результат.ТекущаяЦенаДняДвухместный;
Иначе
	Цена = Результат.ТекущаяЦенаДняОдноместный;
КонецЕсли;

Возврат Цена;
КонецФункции

Процедура ЗаполнитьСтрокаПроживаниеСкидкаСумма(Строка, ПроцентСкидки) Экспорт
	//Строка.ПроцентСкидкиКлиента = ДокументыСервер.ИтогоСкидка(Объект);
	Строка.ПроцентСкидкиКлиента = ПроцентСкидки;
	ЗаполнитьСуммаСоСкидкойСтрокаПроживание(Строка);
КонецПроцедуры

Процедура ЗаполнитьСуммаСоСкидкойСтрокаПроживание(Строка) Экспорт
Строка.Сумма = ДокументыСервер.ОкруглитьСумма((Строка.СуммаБезСкидки * (1 - (Строка.ПроцентСкидкиКлиента/100))));
КонецПроцедуры	

Функция ИтогоСкидкаКлиент(Объект, ИзЗаявки) Экспорт
ИтогоСкидка = ДокументыСервер.ИтогоСкидка(Объект);	

Если ИзЗаявки Тогда
	СкидкаКлиент = Объект.СкидкаКлиента;
Иначе
	Результат = СкидкаКлиента(Объект);
	СкидкаКлиент = Результат.Скидка;
КонецЕсли;

Если ИтогоСкидка > СкидкаКлиент Тогда
	Возврат ИтогоСкидка;
Иначе
	Возврат СкидкаКлиент;
КонецЕсли;

КонецФункции


Функция СкидкаКлиента(Объект) Экспорт
Результат = Новый Структура("Скидка, Уровень", 0, 0);	
	
Если НЕ НастройкиСервер.ЭтоРеноме()	Тогда Возврат Результат; КонецЕсли;
	
Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда Возврат Результат; КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.РезервС) Тогда Возврат Результат; КонецЕсли;

Если Объект.Клиент.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда Возврат Результат; КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	СчетаДолги.КоличествоНочей КАК КоличествоНочей,
                      |	ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
                      |	ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет КАК ЭтоПредварительныйГрупповойСчет,
                      |	ЗаявкаНаБронированиеСчета.Контрагент КАК Контрагент,
                      |	ЗаявкаНаБронированиеСчета.Клиент КАК Клиент,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует КАК Бронирует
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД) КАК КоличествоНочей
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДолги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДолги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДолги.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                      |	И ЗаявкаНаБронированиеСчета.Клиент = &Клиент
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.РезервС < &РезервС
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.РезервС >= &НачалоСкидкаКлиента");

Запрос.УстановитьПараметр("РезервС", Объект.РезервС);
Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
НачалоСкидкаКлиента = НачалоСкидкаКлиента();
Запрос.УстановитьПараметр("НачалоСкидкаКлиента", НачалоСкидкаКлиента);

ТЗ = Запрос.Выполнить().Выгрузить();

КоличествоНочей = 0;
Для Каждого Строка Из ТЗ Цикл 
	//Если Строка.Бронирует.Турагентство 
	//ИЛИ Строка.Бронирует.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо 
	//Тогда Продолжить; КонецЕсли;
	
	Если Строка.ЭтоПредварительныйГрупповойСчет 
	ИЛИ ЗначениеЗаполнено(Строка.ГрупповойСчет) 
	Тогда
		Если Строка.Клиент <> Строка.Бронирует Тогда Продолжить; КонецЕсли;
	КонецЕсли;
	
	КоличествоНочей = КоличествоНочей + Строка.КоличествоНочей; 	
КонецЦикла;

Если КоличествоНочей = 0 Тогда Возврат Результат; КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	СкидкиКлиента.КоличествоНочей КАК КоличествоНочей,
                      |	СкидкиКлиента.Скидка КАК Скидка,
                      |	СкидкиКлиента.Уровень КАК Уровень
                      |ИЗ
                      |	РегистрСведений.СкидкиКлиента КАК СкидкиКлиента
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоличествоНочей");

ТЗ = Запрос.Выполнить().Выгрузить();

СкидкаКлиента = 0;
Для Каждого Строка Из ТЗ Цикл
	Если Строка.КоличествоНочей >= КоличествоНочей Тогда Прервать; КонецЕсли;
 	
	СкидкаКлиента = Строка.Скидка;		
	Уровень = Строка.Уровень;	
КонецЦикла;

Результат.Скидка = СкидкаКлиента;
Результат.Уровень = Уровень;
Возврат Результат;
КонецФункции

Функция НачалоСкидкаКлиента() 
НачалоСкидкаКлиента = '20250601';	
Возврат НачалоСкидкаКлиента;	
КонецФункции

Функция ИтогоСкидка(Объект) Экспорт
ИтогоСкидка = 0;
Если ЗначениеЗаполнено(Объект.Бронирует) Тогда 
	Если Объект.Бронирует.Турагентство Тогда 
		Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда
			Если Объект.Бронирует = Объект.Оплачивает Тогда 		
				Если Объект.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.Взаимозачет
				ИЛИ Объект.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой 
				Тогда
					ИтогоСкидка = ПроцентКомиссииКлиента(Объект.Бронирует, Объект.РезервС);
				Иначе	
					ИтогоСкидка=Объект.Оплачивает.Категория.Скидка;
				КонецЕсли;
			Иначе
				ИтогоСкидка=Объект.Оплачивает.Категория.Скидка;
			КонецЕсли;
		Иначе
			ИтогоСкидка=Объект.Клиент.Категория.Скидка;
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда
			ИтогоСкидка = Объект.Оплачивает.Категория.Скидка;
		Иначе
			ИтогоСкидка=Объект.Клиент.Категория.Скидка;
		КонецЕсли;		
	КонецЕсли;	
Иначе
	Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда
		ИтогоСкидка=Объект.Оплачивает.Категория.Скидка;
	Иначе
		ИтогоСкидка=Объект.Клиент.Категория.Скидка;
	КонецЕсли;		
КонецЕсли;		

Возврат ИтогоСкидка;
КонецФункции	

Функция ПроцентКомиссииКлиента(Клиент, ДатаНачалаДействия) Экспорт
ПроцентКомиссии = ПроцентКомиссии(Клиент, ДатаНачалаДействия);

Возврат ПроцентКомиссии;	
КонецФункции

Функция ПроцентКомиссии(Клиент, ДатаНачалаДействия) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	КлиентыПроцентыКомиссии.ПроцентКомиссии КАК ПроцентКомиссии
                      |ИЗ
                      |	Справочник.Клиенты.ПроцентыКомиссии КАК КлиентыПроцентыКомиссии
                      |ГДЕ
                      |	КлиентыПроцентыКомиссии.Ссылка = &Клиент
                      |	И КлиентыПроцентыКомиссии.ДатаНачалаДействия <= &ДатаНачалаДействия
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КлиентыПроцентыКомиссии.ДатаНачалаДействия УБЫВ");

Запрос.УстановитьПараметр("Клиент", Клиент);
Запрос.УстановитьПараметр("ДатаНачалаДействия", НачалоДня(ДатаНачалаДействия));
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	Возврат Клиент.ПроцентКомиссии;
Иначе
	Возврат ТЗ[0].ПроцентКомиссии;
КонецЕсли;

КонецФункции

Функция ПроцентВ2В(Клиент, ДатаНачалаДействия) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	КлиентыПроцентыВ2В.ПроцентВ2В КАК ПроцентВ2В
                      |ИЗ
                      |	Справочник.Клиенты.ПроцентыВ2В КАК КлиентыПроцентыВ2В
                      |ГДЕ
                      |	КлиентыПроцентыВ2В.Ссылка = &Клиент
                      |	И КлиентыПроцентыВ2В.ДатаНачалаДействия <= &ДатаНачалаДействия
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КлиентыПроцентыВ2В.ДатаНачалаДействия УБЫВ");

Запрос.УстановитьПараметр("Клиент", Клиент);
Запрос.УстановитьПараметр("ДатаНачалаДействия", НачалоДня(ДатаНачалаДействия));
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	Возврат Клиент.ПроцентВ2В;
Иначе
	Возврат ТЗ[0].ПроцентВ2В;
КонецЕсли;
	
КонецФункции

// + Не Используется
Функция СуммаСоСкидкой_НеИспользуется(Сумма, Объект) Экспорт
//Скидка = ИтогоСкидка(Объект);
Скидка = ИтогоСкидкаКлиент(Объект, Ложь);
СуммаСоСкидкой=ДокументыСервер.СуммаСоСкидкойСкидка(Сумма, Скидка); 

Возврат СуммаСоСкидкой;
КонецФункции

Функция СуммаСоСкидкойСкидка(Сумма, Скидка) Экспорт
СуммаСоСкидкой=ДокументыСервер.ОкруглитьСумма(Сумма - Сумма*(Скидка/100));

Возврат СуммаСоСкидкой;
КонецФункции
// - Не Используется

// - ЗаполнитьТаблицуПроживания_Таблица 

// 
Функция РассчитатьСуммуЗаПроживание(Объект) Экспорт 
Возврат Объект.Проживание.Итог("Сумма");
КонецФункции
// 
//// + Цены, Суммы

// 
Функция РасчитатьДолг(Бронь) Экспорт

ЗапросДолга=Новый запрос("ВЫБРАТЬ
                         |	ЕСТЬNULL(ПроживаниеСумма.Сумма, 0) КАК СуммаПроживание,
                         |	ЕСТЬNULL(Услуги.Сумма, 0) КАК СуммаУслуги,
                         |	ЕСТЬNULL(Оплаты.СуммаРаспределено, 0) КАК СуммаРаспределено,
                         |	ЕСТЬNULL(ПроживаниеСумма.Сумма, 0) + ЕСТЬNULL(Услуги.Сумма, 0) - ЕСТЬNULL(Оплаты.СуммаРаспределено, 0) КАК СуммаДолг
                         |ИЗ
                         |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
                         |			СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма
                         |		ИЗ
                         |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК ПроживаниеСумма
                         |		ПО ЗаявкаНаБронирование.Ссылка = ПроживаниеСумма.Ссылка
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
                         |			СУММА(ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество) КАК Сумма
                         |		ИЗ
                         |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                         |		ГДЕ
                         |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			ЗаявкаНаБронированиеДопУслуги.Ссылка) КАК Услуги
                         |		ПО ЗаявкаНаБронирование.Ссылка = Услуги.Ссылка
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК Ссылка,
                         |			СУММА(ЗаявкаНаБронированиеСчетаДетальноОплаты.СуммаРаспределено) КАК СуммаРаспределено
                         |		ИЗ
                         |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка) КАК Оплаты
                         |		ПО ЗаявкаНаБронирование.Ссылка = Оплаты.Ссылка
                         |ГДЕ
                         |	ЗаявкаНаБронирование.Ссылка = &Ссылка");

ЗапросДолга.УстановитьПараметр("Ссылка",Бронь.Ссылка);
//	 ЗапросДолга.УстановитьПараметр("ДТ",Дата);
ТЗДолг=ЗапросДолга.Выполнить().Выгрузить();
Долг=ТЗДолг[0].СуммаДолг;

Возврат Долг;
КонецФункции
//

//
Функция НовыйНомерГрупповогоСчета() Экспорт	
Запрос = Новый Запрос(	
"ВЫБРАТЬ
|	ГрупповыеСчета.НомерСчета КАК НомерСчета
|ИЗ
|	Документ.ГрупповыеСчета КАК ГрупповыеСчета
|ИТОГИ
|	МАКСИМУМ(НомерСчета)
|ПО
|	ОБЩИЕ");
ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	НовыйНомерГрупповогоСчета = 1;
Иначе
	НовыйНомерГрупповогоСчета = ТЗ[0].НомерСчета + 1;
КонецЕсли;	
Возврат НовыйНомерГрупповогоСчета;
КонецФункции	
//
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++

