
&НаСервереБезКонтекста
Функция ПолучитьДоступностьПоУзлу(Узел)
ДоступностьКнопок = Ложь;
// Определить наличие установленного непредопределенного узла.
Если Узел <> ПланыОбмена.ОбменГостиницы.ПустаяСсылка()
И Узел <> ПланыОбмена.ОбменГостиницы.ЭтотУзел()
И Узел.ПолучитьОбъект() <> Неопределено Тогда
	ДоступностьКнопок = Истина;
КонецЕсли;

Возврат ДоступностьКнопок;
КонецФункции
 
&НаКлиенте
Процедура УзелОбменаПриИзменении(Элемент)
ДоступностьКнопок = ПолучитьДоступностьПоУзлу(УзелОбмена);

// Установить доступность кнопок в зависимости от установленного узла обмена.
Элементы.ФормаЗагрузитьДанные.Доступность = ДоступностьКнопок;
Элементы.ФормаВыгрузитьДанные.Доступность = ДоступностьКнопок;
КонецПроцедуры

//
&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
Результат = ОбменГостиницы.ВыполнитьВыгрузкуУзла(УзелОбмена);   
КонецПроцедуры
//

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
Результат = ОбменГостиницы.ВыполнитьЗагрузкуУзла(УзелОбмена);  
КонецПроцедуры

//
&НаКлиенте                                  
Процедура ОбменДанными(Команда)
ОбменГостиницы.ВыполнитьОбменДанными();	
КонецПроцедуры
// ++++++++++++++++++++++++++++++++++++++++++++++++++



&НаКлиенте
Процедура ЗаписатьПодверждения(Команда)
	ЗаписатьПодвержденияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодвержденияНаСервере()
Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда Возврат; КонецЕсли;

Узел = УзелОбмена.ПолучитьОбъект();

//УзелОбмена.ПрочитатьСообщениеПодтверждения();
Узел.ЗаписатьСообщениеПодтверждения(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПодтвержения(Команда)
ЗагрузитьПодтверженияНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьПодтверженияНаСервере()
Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда Возврат; КонецЕсли;

Узел = УзелОбмена.ПолучитьОбъект();

//УзелОбмена.ПрочитатьСообщениеПодтверждения();
Узел.ПрочитатьСообщениеПодтверждения(); 
КонецПроцедуры
