
Функция Соединение() Экспорт
КоличествоПопыток = 0;	
~Соединение:
Если КоличествоПопыток > 3 Тогда Возврат Неопределено; КонецЕсли;

Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.СоединениеКартинкаАдресВХранилище) Тогда
	//Параметры = "File=""C:\_Base1C\hostess"";Usr=""Соединение"";Pwd=""123""";
	
	ИмяТекущаяОрганизация = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
	
	Папка_Картинка = "C:\_Base1C\" + ИмяТекущаяОрганизация + "_Картинка Планшет";
	
	Папка_Соединение = """" + Папка_Картинка + """";
	
	Параметры = "File=" + Папка_Соединение + ";Usr=""Соединение"";Pwd=""123""";
	
	COMConnector= Новый COMОбъект("V83.COMConnector");
	Попытка
		Соединение =  COMConnector.Connect(Параметры);
	Исключение
		Сообщить("Ошибка подключения к БД ЛАЙВ_Картинка. " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	СоединениеСтруктура = Новый Структура("Соединение", Соединение);
	ПараметрыСеанса.СоединениеКартинкаАдресВХранилище = ПоместитьВоВременноеХранилище(СоединениеСтруктура, Новый УникальныйИдентификатор());
КонецЕсли;

Соединение = ПолучитьИзВременногоХранилища(ПараметрыСеанса.СоединениеКартинкаАдресВХранилище).Соединение;
Попытка
	Соединение.ОбменДанными.ПроверкаСоединения();

	Возврат Соединение;
Исключение
	ПараметрыСеанса.СоединениеКартинкаАдресВХранилище = "";
	КоличествоПопыток = КоличествоПопыток + 1;
	Перейти ~Соединение;
КонецПопытки;	
КонецФункции

Процедура ВыгрузитьКартинку(ДанныеКартинки) Экспорт
	
Соединение = Соединение();
Если Соединение = Неопределено Тогда
	Сообщить("Ошибка подключения к БД Картинка. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	
	Возврат; 
КонецЕсли;

Попытка
	Соединение.ОбменДанными.ЗагрузитьКартинку(ДанныеКартинки);
Исключение
	Сообщить("Ошибка обмена с БД Картинка" + ". Описание ошибки: " + ОписаниеОшибки()); 	
КонецПопытки;	
КонецПроцедуры


//
Функция ПараметрыСеанса_СоединениеКартинкаАдресВХранилище(Параметры) Экспорт 
	COMConnector= Новый COMОбъект("V83.Application");
	Попытка
		Соединение =  COMConnector.Connect(Параметры);
	Исключение
		Сообщить("Ошибка подключения к БД ЛАЙВ_Картинка. " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	СоединениеСтруктура = Новый Структура("Соединение", COMConnector);
	ПараметрыСеанса_СоединениеКартинкаАдресВХранилище = ПоместитьВоВременноеХранилище(СоединениеСтруктура, Новый УникальныйИдентификатор());
	
Возврат ПараметрыСеанса_СоединениеКартинкаАдресВХранилище;	
КонецФункции