
&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//Макет=ПолучитьМакет("Макет");
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	////ЗапросБронирований=Новый Запрос("");
	//Если ВариантОтбора=0 тогда	
	//	//Брони=Документы.ЗаявкаНаБронирование.Выбрать(НачалоДня(ДатаС),КонецДня(ДатаПо));
	//	ЗапросБрони=Новый Запрос("ВЫБРАТЬ
	//	                         |	ЗаявкаНаБронирование.Ссылка
	//	                         |ИЗ
	//	                         |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//	                         |ГДЕ
	//	                         |	ЗаявкаНаБронирование.Дата МЕЖДУ &ДатаН И &ДатаК
	//							  |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента");
	//	ЗапросБрони.УстановитьПараметр("ДатаН",НачалоДня(ДатаС));								 
	//	ЗапросБрони.УстановитьПараметр("ДатаК",КонецДня(ДатаПо));
	//	ЗапросБрони.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

	//	ТЗБрони=ЗапросБрони.Выполнить().Выгрузить();
	//ИначеЕсли ВариантОтбора=1 тогда	
	//	ЗапросБрони=Новый Запрос("ВЫБРАТЬ
	//	                         |	ЗаявкаНаБронирование.Ссылка
	//	                         |ИЗ
	//	                         |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//	                         |ГДЕ
	//	                         |	ЗаявкаНаБронирование.ВремяЗаездаТочное МЕЖДУ &ДатаН И &ДатаК
	//							  |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента");
	//	ЗапросБрони.УстановитьПараметр("ДатаН",НачалоДня(ДатаС));								 
	//	ЗапросБрони.УстановитьПараметр("ДатаК",КонецДня(ДатаПо));
	//	ЗапросБрони.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

	//	ТЗБрони=ЗапросБрони.Выполнить().Выгрузить();
	//конецесли;
	//
	//ЗапросНомераПосещения=новый Запрос("ВЫБРАТЬ
	//                                   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК КолВо
	//                                   |ИЗ
	//                                   |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                                   |ГДЕ
	//                                   |	ЗаявкаНаБронирование.Дата < &Дата
	//                                   |	И ЗаявкаНаБронирование.Клиент = &Клиент");
	////Пока Брони.Следующий() цикл
	//Для каждого СтрБ Из ТЗБрони Цикл
	//
	//	Брони=СтрБ.Ссылка;
	//	Если Брони.ПометкаУдаления тогда
	//		Продолжить;
	//	конецесли;
	//	Если Брони.Статус<>Перечисления.СтатусБрони.Выехал тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	//ДТБ	Глубина	Клиент	Бронирует	ТипКлиента	ДатаЗаезда	ДатаВыезда	КолВоСуток	НомерКомнаты	КатегорияНомера	КолВоЧел	ОбщийТариф	ТарифГостя	Скидка
	//	ЗапросНомераПосещения.УстановитьПараметр("Дата",Брони.Дата);
	//	ЗапросНомераПосещения.УстановитьПараметр("Клиент",Брони.Клиент);
	//	ТЗБ=ЗапросНомераПосещения.Выполнить().Выгрузить();
	//	Если ТЗБ.Количество()=0 тогда
	//		Обл.Параметры.НомБ=0;
	//	иначе
	//		 Обл.Параметры.НомБ=ТЗБ[0].КолВо;
	//	 конецесли;
	//	 
	//	Обл.Параметры.ДТБ=Формат(Брони.Дата, "ДФ=dd.MM.yy");
	//	Обл.Параметры.Глубина=Окр((Брони.ВремяЗаездаТочное-Брони.Дата)/86400);
	//	Обл.Параметры.ГлубинаНед=Окр((Брони.ВремяЗаездаТочное-Брони.Дата)/604800);
	//	Обл.Параметры.Клиент=Брони.Клиент;
	//	Обл.Параметры.Бронирует=Брони.Бронирует;
	//	Обл.Параметры.ТипКлиента=Брони.Бронирует.ВидКлиента;
	//	Обл.Параметры.ВозможностьИзмененияТарифа=Брони.Бронирует.ВозможностьИзмененияТарифа;
	//	Обл.Параметры.ДатаЗаезда=Формат(Брони.ВремяЗаездаТочное, "ДФ=dd.MM.yy");
	//	Обл.Параметры.ДатаВыезда=Формат(Брони.ВремяВыездаТочное, "ДФ=dd.MM.yy");
	//	Обл.Параметры.КолВоСуток=Брони.КолВо;
	//	Обл.Параметры.НомерКомнаты=Брони.НомерВРезерв;
	//	Обл.Параметры.КатегорияНомера=Брони.НомерВРезерв.КатегорияНомера;
	//	Обл.Параметры.КолВоЧел=Брони.КолВоЧеловек;
	//	ОбщийТариф=РасчитатьСтоимостьПеременную(НачалоДня(Брони.ВремяЗаездаТочное),КонецДня(Брони.ВремяВыездаТочное),Брони.НомерВРезерв.КатегорияНомера,Брони.КолВоЧеловек);
	//	ТарифГостя=РассчитатьСтоимостьСтандарт(Брони.Ссылка);
	//	ОбщийТариф=ОбщийТариф*Брони.КолВо;
	//	Обл.Параметры.ОбщийТариф=ОбщийТариф;
	//	Обл.Параметры.ТарифГостя=ТарифГостя;
	//	Обл.Параметры.Скидка=?(ОбщийТариф=0,"-",Строка(Окр(((ОбщийТариф-ТарифГостя)/ОбщийТариф)*100))+"%");
	//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);		
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	//Макет=ПолучитьМакет("Макет");
	Макет = Отчеты.ОтчетПоГлубинеБронирования.ПолучитьМакет("Макет");
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	////ЗапросБронирований=Новый Запрос("");
	Если Отчет.ВариантОтбора=0 тогда	
		////Брони=Документы.ЗаявкаНаБронирование.Выбрать(НачалоДня(ДатаС),КонецДня(ДатаПо));
		ЗапросБрони=Новый Запрос("ВЫБРАТЬ
		                         |	ЗаявкаНаБронирование.Ссылка
		                         |ИЗ
		                         |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
		                         |ГДЕ
		                         |	ЗаявкаНаБронирование.Дата МЕЖДУ &ДатаН И &ДатаК
								  |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента");
		ЗапросБрони.УстановитьПараметр("ДатаН",НачалоДня(Отчет.ДатаС));								 
		ЗапросБрони.УстановитьПараметр("ДатаК",КонецДня(Отчет.ДатаПо));
		ЗапросБрони.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

		ТЗБрони=ЗапросБрони.Выполнить().Выгрузить();
	ИначеЕсли Отчет.ВариантОтбора=1 тогда	
		ЗапросБрони=Новый Запрос("ВЫБРАТЬ
		                         |	ЗаявкаНаБронирование.Ссылка
		                         |ИЗ
		                         |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
		                         |ГДЕ
		                         |	ЗаявкаНаБронирование.ВремяЗаездаТочное МЕЖДУ &ДатаН И &ДатаК
								  |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента");
		ЗапросБрони.УстановитьПараметр("ДатаН",НачалоДня(Отчет.ДатаС));								 
		ЗапросБрони.УстановитьПараметр("ДатаК",КонецДня(Отчет.ДатаПо));
		ЗапросБрони.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

		ТЗБрони=ЗапросБрони.Выполнить().Выгрузить();
	конецесли;
	
	ЗапросНомераПосещения=новый Запрос("ВЫБРАТЬ
	                                   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК КолВо
	                                   |ИЗ
	                                   |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                                   |ГДЕ
	                                   |	ЗаявкаНаБронирование.Дата < &Дата
	                                   |	И ЗаявкаНаБронирование.Клиент = &Клиент");
	////Пока Брони.Следующий() цикл
	Для каждого СтрБ Из ТЗБрони Цикл
	
		Брони=СтрБ.Ссылка;
		Если Брони.ПометкаУдаления тогда
			Продолжить;
		конецесли;
		Если Брони.Статус<>Перечисления.СтатусБрони.Выехал тогда
			Продолжить;
		КонецЕсли;
		
		Обл=Макет.ПолучитьОбласть("Строка");
		//ДТБ	Глубина	Клиент	Бронирует	ТипКлиента	ДатаЗаезда	ДатаВыезда	КолВоСуток	НомерКомнаты	КатегорияНомера	КолВоЧел	ОбщийТариф	ТарифГостя	Скидка
		ЗапросНомераПосещения.УстановитьПараметр("Дата",Брони.Дата);
		ЗапросНомераПосещения.УстановитьПараметр("Клиент",Брони.Клиент);
		ТЗБ=ЗапросНомераПосещения.Выполнить().Выгрузить();
		Если ТЗБ.Количество()=0 тогда
			Обл.Параметры.НомБ=0;
		иначе
			 Обл.Параметры.НомБ=ТЗБ[0].КолВо;
		 конецесли;
		 
		Обл.Параметры.ДТБ=Формат(Брони.Дата, "ДФ=dd.MM.yy");
		Обл.Параметры.Глубина=Окр((Брони.ВремяЗаездаТочное-Брони.Дата)/86400);
		Обл.Параметры.ГлубинаНед=Окр((Брони.ВремяЗаездаТочное-Брони.Дата)/604800);
		Обл.Параметры.Клиент=Брони.Клиент;
		Обл.Параметры.Бронирует=Брони.Бронирует;
		Обл.Параметры.ТипКлиента=Брони.Бронирует.ВидКлиента;
		//Обл.Параметры.ВозможностьИзмененияТарифа=Брони.Бронирует.ВозможностьИзмененияТарифа;
		Обл.Параметры.ДатаЗаезда=Формат(Брони.ВремяЗаездаТочное, "ДФ=dd.MM.yy");
		Обл.Параметры.ДатаВыезда=Формат(Брони.ВремяВыездаТочное, "ДФ=dd.MM.yy");
		Обл.Параметры.КолВоСуток=Брони.КолВо;
		Обл.Параметры.НомерКомнаты=Брони.НомерВРезерв;
		Обл.Параметры.КатегорияНомера=Брони.НомерВРезерв.КатегорияНомера;
		Обл.Параметры.КолВоЧел=Брони.КолВоЧеловек;
		ОбщийТариф=РасчитатьСтоимостьПеременную(НачалоДня(Брони.ВремяЗаездаТочное),КонецДня(Брони.ВремяВыездаТочное),Брони.НомерВРезерв.КатегорияНомера,Брони.КолВоЧеловек);
		ТарифГостя=РассчитатьСтоимостьСтандарт(Брони.Ссылка);
		ОбщийТариф=ОбщийТариф*Брони.КолВо;
		Обл.Параметры.ОбщийТариф=ОбщийТариф;
		Обл.Параметры.ТарифГостя=ТарифГостя;
		Обл.Параметры.Скидка=?(ОбщийТариф=0,"-",Строка(Окр(((ОбщийТариф-ТарифГостя)/ОбщийТариф)*100))+"%");
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);		
		ПолеОтчета.Вывести(Обл);		
 		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РасчитатьСтоимостьПеременную(ДТН,ДТК,Категория,КолВо)
	ЗапросСтоимости=Новый Запрос("ВЫБРАТЬ
	|	МАКСИМУМ(ЦеныПоДатам.Тариф_НеИспользуется) КАК Тариф_НеИспользуется
	|ИЗ
	|	РегистрСведений.ЦеныПоДатам КАК ЦеныПоДатам
	|ГДЕ
	|	ЦеныПоДатам.ДатаЦены МЕЖДУ &ДТН И &ДТК
	|	И ЦеныПоДатам.Категория = &Категория");
	ЗапросСтоимости.УстановитьПараметр("ДТН",ДТН);								 
	ЗапросСтоимости.УстановитьПараметр("ДТК",ДТК);
	ЗапросСтоимости.УстановитьПараметр("Категория",Категория);
	ТЗТ=ЗапросСтоимости.Выполнить().Выгрузить();
	Сумма=0;
	Попытка
		КолВоВых=0;
		НачДТ=НачалоДня(ДТН);
		Пока НачДТ<ДТК Цикл
			Если ДеньНедели(НачДТ)>=5 тогда
				КолВоВых=КолВоВых+1;
			конецесли;
			НачДТ=НачДТ+86400;
		КонецЦикла;
		
		Для каждого СтрТ Из ТЗТ Цикл
			Сумма=Сумма+СтрТ.Тариф_НеИспользуется.Цена+?(КолВо>1,800,0);
		КонецЦикла; 
		Сумма=Сумма-300*КолВоВых;
	Исключение
		Возврат 0;
	КонецПопытки;
	
	Возврат Сумма;
КонецФункции

&НаСервере
Функция РассчитатьСтоимостьСтандарт(Бронь)	
	Возврат РассчитатьСуммуЗапроживание(Бронь);
КонецФункции

&НаСервере
Функция РассчитатьСуммуЗапроживание(СсылкаДок)  
	СуммаОсн=0;
	СуммаИск=0;
		
	Для каждого СтрИскл Из СсылкаДок.Исключения Цикл
	
		СуммаИск=СуммаИск+СтрИскл.Тариф_НеИспользуется.Цена;
	
	КонецЦикла; 
	СуммаОсн=СсылкаДок.Тариф_НеИспользуется.Цена*(СсылкаДок.КолВо-СсылкаДок.Исключения.Количество())+СуммаИск;
	Если НЕ СсылкаДок.Оплачивает.Категория.Пустая() тогда
		СуммаОсн=Окр(СуммаОсн-СуммаОсн*(СсылкаДок.Оплачивает.Категория.Скидка/100));
	конецесли;
    Если СсылкаДок.ВидОплаты=Перечисления.ВидОплаты.Безнал и НЕ СсылкаДок.Турагентство.Пустая() тогда // дополнительно скидку турагенства
		СуммаОсн=Окр(-СуммаОсн*(СсылкаДок.Турагентство.Категория.Скидка/100));
	

	конецесли;

	Возврат СуммаОсн;
КонецФункции
