Функция ЭтоСтарыйРасчет(НовыйРасчет) Экспорт 
Если НЕ НовыйРасчет Тогда 
	ПоказатьПредупреждение(, "Печать счета по старому расчету НЕ поддерживается !" 
		+ Символы.ПС + "(Не установлен флаг 'Новый расчет')");
	Возврат Истина; 
КонецЕсли;
	
Возврат Ложь; 
КонецФункции	

//
Процедура ПечатьСчетаИПодтверждения(Форма, ДокументДолгСсылка, Счет, ВыводПодтверждения) Экспорт
ДокументДолгОбъектПараметр = ДокументДолгСсылка;

Контрагент = Счет.Контрагент;	

//ДокументДолгПараметр = ДокументДолгОбъект;                             
НовыйРасчет = ПечатьСервер.ЭтоНовыйРасчет(ДокументДолгСсылка);
Если ПечатьКлиент.ЭтоСтарыйРасчет(НовыйРасчет) Тогда Возврат; КонецЕсли;

//ТабличныйДокумент = ПечатьСчетаНаСервере();
ТабличныйДокумент = ПечатьСервер.ТабличныйДокументСчет(ДокументДолгСсылка, Счет);

Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;

ОткрытьФормуПечатьСчетаИПодтверждения(Форма, ДокументДолгСсылка, Счет.СчетГУИД, Контрагент, ТабличныйДокумент
	, ВыводПодтверждения);
КонецПроцедуры

Процедура ОткрытьФормуПечатьСчетаИПодтверждения(Форма, ДокументДолгСсылка, СчетГУИД, Контрагент, ТабличныйДокумент
	, ВыводПодтверждения, НаАнглийском = Ложь) Экспорт
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТабличныйДокумент", ТабличныйДокумент); 

ПараметрыФормы.Вставить("ДокументДолгСсылка", ДокументДолгСсылка);
ПараметрыФормы.Вставить("СчетГУИД", СчетГУИД);

ПараметрыФормы.Вставить("Контрагент", Контрагент);

ПараметрыФормы.Вставить("ВыводПодтверждения", ВыводПодтверждения);

ПараметрыФормы.Вставить("НаАнглийском", НаАнглийском);

ОткрытьФорму("ОбщаяФорма.ПечатьИОтправкаНаПочтуСчетаИПодтверждения", ПараметрыФормы, Форма
	, Истина,,,, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры

//
//////////////////////////////////////////////////////
