
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДолгиДетально = Параметры.ВыборДетальноДолги; 
Для Каждого Строка Из ДолгиДетально Цикл
	НоваяСтрока = СчетаДетальноДолги.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;	

ФормаОтладка();
КонецПроцедуры

&НаСервере
Процедура ФормаОтладка()
ЭтоОтладка = Константы.ЭтоОтладка.Получить();

Элементы.СчетаДетальноДолгиДолгиГУИД.Видимость = ЭтоОтладка;
КонецПроцедуры	


&НаКлиенте
Процедура СчетаДетальноДолгиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Результат = Элементы.СчетаДетальноДолги.ТекущиеДанные;	
	
ОповеститьОВыборе(Результат);	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
Если Элементы.СчетаДетальноДолги.ТекущиеДанные <> Неопределено Тогда	
	Результат = Элементы.СчетаДетальноДолги.ТекущиеДанные;	
		
	ОповеститьОВыборе(Результат);	
КонецЕсли;	
КонецПроцедуры



