
Функция ВыгрузитьЗаселения_КУдалению(ДатаС, ДатаПо) Экспорт
ДатаС_П = НачалоДня(ДатаПо) + 9 * 60 * 60;
ДатаПо_П = КонецДня(ДатаПо) + 21 * 60 * 60;

Запрос = Новый Запрос( "ВЫБРАТЬ
                       |	ЗаявкаНаБронирование.АвторЗаявки.Код КАК АвторЗаявкиКод,
                       |	ЗаявкаНаБронирование.ВремяЗаездаТочное КАК ВремяЗаезда
                       |ИЗ
                       |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                       |ГДЕ
                       |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                       |	И ЗаявкаНаБронирование.ВремяЗаездаТочное >= &ДатаС
                       |	И ЗаявкаНаБронирование.ВремяЗаездаТочное <= &ДатаПо
                       |
                       |УПОРЯДОЧИТЬ ПО
                       |	АвторЗаявкиКод,
                       |	ВремяЗаезда");

Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо_П);
 
ТЗ = Запрос.Выполнить().Выгрузить();

Возврат ТЗ;
КонецФункции

