Функция ПолучитьДанныеСоединенияPayKeeper() 
Результат = Новый Структура("Адрес, ИмяПользователя, ПарольПользователя", "", "", "");	
Если НастройкиСервер.ЭтоРеноме() Тогда
	Результат.Адрес = "renomme-hotel.server.paykeeper.ru";
	Результат.ИмяПользователя = "admin";
	Результат.ПарольПользователя = "puPW0Mag2QmMXk7w";
	
ИначеЕсли НастройкиСервер.ЭтоЛайв() Тогда
	Результат.Адрес = "live-ekb.server.paykeeper.ru";
	Результат.ИмяПользователя = "admin";
	Результат.ПарольПользователя = "vEg0ZjE-";
	
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда
	Результат.Адрес = "chekhov-hotel.server.paykeeper.ru";
	Результат.ИмяПользователя = "admin";
	Результат.ПарольПользователя = "1lSZ8vy-";
	
ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда
	//Результат.Адрес = "dom-sovetov-ekb.server.paykeeper.ru";
	//Результат.ИмяПользователя = "admin";
	//Результат.ПарольПользователя = "ca5b2f12f1d1";
	
	Результат.Адрес = "domsovetov-ekb.server.paykeeper.ru";
	Результат.ИмяПользователя = "admin";
	Результат.ПарольПользователя = "Milagro!*2026";
	
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда
	//Результат.Адрес = "renomme-hotel.server.paykeeper.ru";
	//Результат.ИмяПользователя = "admin";
	//Результат.ПарольПользователя = "puPW0Mag2QmMXk7w";
КонецЕсли;
 
Возврат Результат;
КонецФункции	

Функция ПолучитьСоединениеPayKeeper() Экспорт
//Адрес = "renomme-hotel.server.paykeeper.ru";
//ИмяПользователя = "admin";
//ПарольПользователя = "puPW0Mag2QmMXk7w"; 
Результат = Новый Структура("Ошибка, Описание", Ложь, "");

ДанныеСоединения = ПолучитьДанныеСоединенияPayKeeper();
Если ДанныеСоединения.Адрес = "" Тогда 
	Результат.Ошибка = Истина;
	Результат.Описание = "Не определены параметры соединения для отеля";
	
	Возврат Результат; 
КонецЕсли; 

СоединениеPayKeeper_П = PayKeeper.СоздатьСоединение(ДанныеСоединения.Адрес, ДанныеСоединения.ИмяПользователя, ДанныеСоединения.ПарольПользователя);

Возврат СоединениеPayKeeper_П;
КонецФункции

Функция СписокПлатежейPayKeeper() Экспорт
Результат = Новый Структура("СписокПлатежей, Ошибка, ОписаниеОшибки", Новый Массив, Ложь, "");	
	
СоединениеPayKeeper = ПолучитьСоединениеPayKeeper();
	
Если СоединениеPayKeeper.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.ОписаниеОшибки = СоединениеPayKeeper.Описание; 
	
	Возврат Результат; 
КонецЕсли;
	
Ответ =	PayKeeper.ПолучитьСписокПлатежныхСистем(СоединениеPayKeeper);
Если Ответ.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.ОписаниеОщибки = Ответ.Описание; 
	
	Возврат Результат; 
КонецЕсли;

СписокПлатежныхСистем = Ответ.СписокПлатежныхСистем;

НомерСтроки = 0;
Для Каждого Строка Из СписокПлатежныхСистем Цикл
	Если Строка.id = "127" Тогда
		СписокПлатежныхСистем.Удалить(НомерСтроки);
		
		Прервать;
	КонецЕсли;
	
	НомерСтроки = НомерСтроки + 1;
КонецЦикла;

СтрокаСписокПлатежныхСистем = "";
Для Каждого Строка Из СписокПлатежныхСистем Цикл
	СтрокаСписокПлатежныхСистем = СтрокаСписокПлатежныхСистем + Строка(Строка.id) + ",";
КонецЦикла;

Если СтрокаСписокПлатежныхСистем = "" Тогда 
	Результат.Ошибка = Истина;
	Результат.ОписаниеОщибки = "Платежные системв в Pay Keepr отсутствуют"; 
	
	Возврат Результат; 
КонецЕсли;

СтрокаСписокПлатежныхСистем = Лев(СтрокаСписокПлатежныхСистем, СтрДлина(СтрокаСписокПлатежныхСистем) - 1);

ДатаНач = НачалоМесяца(ТекущаяДата() - 24*60*60 * 15);
ДатаКон = ТекущаяДата();
НачСтрока = 0;
СтрокМакс = 500;
СписокСтатусов = "success,canceled,failed,refunding,partially_refunded,refunded,pending";

Ответ = PayKeeper.ПолучитьСписокПлатежей(СоединениеPayKeeper, ДатаНач, ДатаКон, НачСтрока, СтрокМакс
	, СписокСтатусов, СтрокаСписокПлатежныхСистем);
Если Результат.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.ОписаниеОщибки = Ответ.Описание; 
	
	Возврат Результат; 
КонецЕсли;
	
СписокПлатежей = Ответ.СписокПлатежей;	

Результат.СписокПлатежей = СписокПлатежей;

Возврат Результат;
КонецФункции
 
Функция ИмяЗаявкаСчетPayKeeper() Экспорт
//Заявка/Счет: 1
//123456789012
Результат = Новый Структура("Имя, Длина", "Заявка/Счет: ", 13); 
Возврат Результат;
КонецФункции

Функция ИмяКоворкингСчетPayKeeper() Экспорт
//Коворкинг счет: 1
//12345678901234567
Результат = Новый Структура("Имя, Длина", "Коворкинг счет: ", 16); 	
Возврат Результат;
КонецФункции

Функция ИмяГрупповойСчетPayKeeper() Экспорт
//Групповой счет: 1
//12345678901234567
Результат = Новый Структура("Имя, Длина", "Групповой счет: ", 16); 	
Возврат Результат;
КонецФункции
