
//
&НаКлиенте
Процедура КнопкаВыполнитьНажатие__(Кнопка)
//Текст=Новый ТекстовыйДокумент;
//Для каждого Стр Из ТаблицаДляВыгрузки Цикл
//    Если Стр.Выгружать тогда
//	Текст.ДобавитьСтроку(СформироватьСтрокуДляФМС(Стр.Клиент,Стр.Бронирование));
//	конецесли;

//КонецЦикла; 

//Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
//Диалог.Фильтр="Текстовый документ(*.csv)|*.csv";
////Политов
//Диалог.Каталог = "D:\scan 1c\Обмен";
//ИмяФайла = Лев(Строка(ТекущаяДата()),10)+".csv";
//Диалог.ПолноеИмяФайла = ИмяФайла;
/////Политов

//Если Диалог.Выбрать() тогда
//	Текст.Записать(Диалог.ПолноеИмяФайла);
//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
Текст=Новый ТекстовыйДокумент;
Для каждого Стр Из Объект.ТаблицаДляВыгрузки Цикл
    Если Стр.Выгружать тогда
		Текст.ДобавитьСтроку(СформироватьСтрокуДляФМС(Стр.Клиент,Стр.Бронирование));
	конецесли;

КонецЦикла; 

Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
Диалог.Фильтр="Текстовый документ(*.csv)|*.csv";
//Политов

//Диалог.Каталог = "D:\scan 1c\Обмен";
Каталог = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("ПАПКА_ВыгрузкаДляФМС");
//Диалог.Каталог = Каталог + "\Обмен";
//Диалог.Каталог = Каталог + "Обмен";
Диалог.Каталог = Каталог;

ИмяФайла = Лев(Строка(ТекущаяДата()),10)+".csv";
Диалог.ПолноеИмяФайла =  ИмяФайла;
///Политов

ДопПараметры = Новый Структура("Текст", Текст);
Оповещение = Новый ОписаниеОповещения("ЗавершитьДиалогВыбораФайла", ЭтаФорма, ДопПараметры);
Диалог.Показать(Оповещение);


//Если Диалог.Выбрать() тогда
//	Текст.Записать(Диалог.ПолноеИмяФайла);
//КонецЕсли;
//	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьДиалогВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

Текст = ДополнительныеПараметры.Текст;
ПолноеИмяФайла = Результат[0];

Текст.НачатьЗапись(, ПолноеИмяФайла);
КонецПроцедуры
//

&НаСервереБезКонтекста
Функция СформироватьСтрокуДляФМС(Клиент,Бронь)
	ТекстДляФМС=?(Клиент.ИностранныйГражданин,"1","0")+";"; // ин. гражд.
	ТекстДляФМС=ТекстДляФМС+";"; // номер дела
	ТекстДляФМС=ТекстДляФМС+Клиент.Фамилия+";"; //Фамилия
	ТекстДляФМС=ТекстДляФМС+Клиент.ФамилияЛатиницей+";"; //Фамилия (лат) -
	ТекстДляФМС=ТекстДляФМС+Клиент.Имя+";"; //Имя
	ТекстДляФМС=ТекстДляФМС+Клиент.ИмяЛатиницей+";"; //Имя (лат) -
	ТекстДляФМС=ТекстДляФМС+Клиент.Отчество+";"; //Отчество -
	ТекстДляФМС=ТекстДляФМС+?(Клиент.Пол=Перечисления.Пол.Женский,"Ж","М")+";"; //Пол
	ТекстДляФМС=ТекстДляФМС+Формат(Клиент.ДатаРождения, "ДФ=dd.MM.yyyy")+";"; //Дата рождения	ДД.ММ.ГГГГ
	Если  СокрЛП(Клиент.СтранаРожденияФМС.Наименование) = "СССР" Тогда
	ТекстДляФМС=ТекстДляФМС+"SUN;";	    //Политов
	Иначе	
	ТекстДляФМС=ТекстДляФМС+Формат(Клиент.СтранаРожденияФМС.Код, "ЧГ=")+";"; //	Страна рождения
	КонецЕсли;

	ТекстДляФМС=ТекстДляФМС+";"; //Регион -
	ТекстДляФМС=ТекстДляФМС+";"; //Район   -
	ТекстДляФМС=ТекстДляФМС+";"; //Город    -
	ТекстДляФМС=ТекстДляФМС+";"; //Нас. пункт -
	ТекстДляФМС=ТекстДляФМС+Формат(Клиент.ГражданствоФМС.Код, "ЧГ=")+";"; //Гражданство 
	
	ТекстДляФМС=ТекстДляФМС+Формат(?(Клиент.ТипДокументаФМС.пустая(),103008,Клиент.ТипДокументаФМС.Код), "ЧГ=")+";"; //Тип
	ТекстДляФМС=ТекстДляФМС+Клиент.Серия+";"; //Серия-
	ТекстДляФМС=ТекстДляФМС+Клиент.Номер+";"; //Номер
	ТекстДляФМС=ТекстДляФМС+Формат(Клиент.ДатаВыдачи, "ДФ=dd.MM.yyyy")+";"; //Дата выдачи	ДД.ММ.ГГГГ
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,"",Формат(Клиент.ДатаДействияДокументаФМС, "ДФ=dd.MM.yyyy"))+";"; //Срок действия	ДД.ММ.ГГГГ (русский - обязательно)
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,"",Формат(Клиент.ПунктыВыдачиФМС.Код, "ЧГ="))+";"; //Кем выдан (русский - обязательно)
	
	ТекстДляФМС=ТекстДляФМС+";"; //Регион-
	ТекстДляФМС=ТекстДляФМС+Клиент.РайонПроживания+";"; //Район-
	ТекстДляФМС=ТекстДляФМС+Клиент.ГородПроживания+";"; //Город-
	ТекстДляФМС=ТекстДляФМС+Клиент.НасПунктПроживания+";"; //Населенный пункт-
	ТекстДляФМС=ТекстДляФМС+Клиент.УлицаПроживания+";"; //Улица-
	ТекстДляФМС=ТекстДляФМС+Клиент.ДомПроживания+";"; //Дом-
	ТекстДляФМС=ТекстДляФМС+Клиент.КорпусПроживания+";"; //Корпус-
	ТекстДляФМС=ТекстДляФМС+Клиент.КвартираПроживания+";"; //Квартира-
	
	ТекстДляФМС=ТекстДляФМС+";"; //Регион-
	ТекстДляФМС=ТекстДляФМС+";"; //Район-
	ТекстДляФМС=ТекстДляФМС+";"; //Город-
	ТекстДляФМС=ТекстДляФМС+";"; //Населенный пункт-
	ТекстДляФМС=ТекстДляФМС+";"; //Улица-
	ТекстДляФМС=ТекстДляФМС+";"; //Дом-
	ТекстДляФМС=ТекстДляФМС+";"; //Корпус-
	ТекстДляФМС=ТекстДляФМС+";"; //Квартира-
	
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ВидДокументаНаПребываниеФМС.Код, "ЧГ="),"")+";"; //Вид документа (на пребывание в РФ) инн. - обяз.
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.СерияВизы, "ЧГ="),"")+";"; //Серия-
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.НомерВизы, "ЧГ="),"")+";"; //Номер инн. - обяз.
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ДатаВыдачи, "ДФ=dd.MM.yyyy"),"")+";";  //Дата выдачи	ДД.ММ.ГГГГ инн. - обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.СрокВизыС, "ДФ=dd.MM.yyyy"),"")+";"; //Срок действия с	ДД.ММ.ГГГГ инн. - обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.СрокВизыПо, "ДФ=dd.MM.yyyy"),"")+";"; //Срок действия до	ДД.ММ.ГГГГ инн. - обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ТипВизыФМС.Код, "ЧГ="),"")+";"; //Тип визы (категория) инн. - обяз 
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.КратностьВизыФМС.Код, "ЧГ="),"")+";"; //Кратность визы инн. - обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Клиент.ИдентификаторВизыФМС,"")+";"; //Идентификатор визы инн. - обяз
	
	ТекстДляФМС=ТекстДляФМС+Клиент.МиграционнаяКартаСерия+";"; //Серия-
	ТекстДляФМС=ТекстДляФМС+Клиент.МиграционнаяКартаНомер+";"; //Номер  инн. - обяз
	
		
	//ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ПунктПересеченияГраницыФМС.Код, "ЧГ="),"")+";"; //Пункт пересечения границы (КПП въезда)  инн. - обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(УдалитьПробелы(Клиент.ПунктПересеченияГраницыФМС.Код), "ЧГ="),"")+";";     //Политов: в коде затесались неразрывные пробелы 
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ДатаВъездаВРФ_ФМС, "ДФ=dd.MM.yyyy"),"")+";"; //Дата въезда в РФ  инн. - обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.СрокПребыванияВ_РФ_ФМС, "ДФ=dd.MM.yyyy"),"")+";"; //Срок пребывания до - 
	
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Клиент.ФамилияПредставителяФМС,"")+";"; //Фамилия инн. - обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Клиент.ИмяПредставителяФМС,"")+";"; //Имя инн. - обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Клиент.ОтчествоПредставителяФМС,"")+";"; //Отчество-
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ТипДокументаПредставителяФМС.Код, "ЧГ="),"")+";"; //Дата рождения	ДД.ММ.ГГГГ-
	ТекстДляФМС=ТекстДляФМС+";"; //Тип документа инн. - обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Клиент.СерияДокументаПредставителяФМС,"")+";"; //Серия-
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Клиент.НомерДокументаПредставителяФМС,"")+";"; //Номер инн. - обяз
	
	ТекстДляФМС=ТекстДляФМС+";"; //№ комнаты в гостинице - 	
	ТекстДляФМС=ТекстДляФМС+Формат(Бронь.РезервС, "ДФ=dd.MM.yyyy")+";"; //Дата заезда в гостиницу
	ТекстДляФМС=ТекстДляФМС+Формат(Бронь.РезервПо, "ДФ=dd.MM.yyyy")+";"; //Дата выезда русский - обяз.
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ЦельПриездаФМС.Код, "ЧГ="),"")+";"; //Цель поездки/приезда инн. обяз
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ЦельВъездаФМС.Код, "ЧГ="),"")+";"; //Цель въезда инн. обяз 
	ТекстДляФМС=ТекстДляФМС+";"; //Участник гос. программы -
	ТекстДляФМС=ТекстДляФМС+";"; //Профессия-
	ТекстДляФМС=ТекстДляФМС+?(Клиент.ИностранныйГражданин,Формат(Клиент.ДатаВыдачиДокументаПредставителя_ФМС, "ДФ=dd.MM.yyyy"),"")+";"; //Дата выдачи документа законного представителя инн. - обяз
	
	Возврат ТекстДляФМС;
КонецФункции

&НаСервереБезКонтекста
Функция УдалитьПробелы(Штрихкод)  //Политов 
    
    ШтрихкодБезПробелов = "";
    
    Для Сч = 1 По СтрДлина(Штрихкод) Цикл
        Символ = Сред(Штрихкод, Сч, 1);
        Если Символ <> Символы.НПП и Символ <> " " Тогда
            ШтрихкодБезПробелов = ШтрихкодБезПробелов + Строка(Символ);
        КонецЕсли;
    КонецЦикла;
    
    Возврат ШтрихкодБезПробелов;
    
КонецФункции


//
&НаКлиенте
Процедура ДатаЗаездаПриИзменении___(Элемент)
	//ВыборкаБроней=Новый Запрос("ВЫБРАТЬ
	//                           |	ЗаявкаНаБронирование.Ссылка,
	//                           |	ЗаявкаНаБронирование.Клиент,
	//                           |	ЗаявкаНаБронирование.Клиент2
	//                           |ИЗ
	//                           |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                           |ГДЕ
	//                           |	НАЧАЛОПЕРИОДА(ЗаявкаНаБронирование.ВремяЗаездаТочное, ДЕНЬ) = &ВремяЗаездаТочное");
	//						   ВыборкаБроней.УстановитьПараметр("ВремяЗаездаТочное",НачалоДня(ДатаЗаезда));
	//						   ТЗБ=ВыборкаБроней.Выполнить().Выгрузить();
	//						 ТаблицаДляВыгрузки.Очистить();  
	//						   Для каждого Стр Из ТЗБ Цикл
	//							   Нов=ТаблицаДляВыгрузки.Добавить();
	//							   Нов.Выгружать=Истина;
	//							   Нов.Бронирование=Стр.ссылка;
	//							   Нов.Клиент=Стр.Клиент;
	//						   	      Если НЕ Стр.Клиент2.Пустая() тогда
	//								   Нов=ТаблицаДляВыгрузки.Добавить();
	//								   Нов.Выгружать=Истина;
	//								   Нов.Бронирование=Стр.ссылка;
	//								   Нов.Клиент=Стр.Клиент2;
	//								   
	//							   конецесли;

	//						   
	//						   КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаездаПриИзменении(Элемент)
	ДатаЗаездаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаЗаездаПриИзмененииНаСервере()
ВыборкаБроней=Новый Запрос("ВЫБРАТЬ
           |	ЗаявкаНаБронирование.Ссылка,
           |	ЗаявкаНаБронирование.Клиент,
           |	ЗаявкаНаБронирование.Клиент2
           |ИЗ
           |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
           |ГДЕ
           |	НАЧАЛОПЕРИОДА(ЗаявкаНаБронирование.ВремяЗаездаТочное, ДЕНЬ) = &ВремяЗаездаТочное");
ВыборкаБроней.УстановитьПараметр("ВремяЗаездаТочное",НачалоДня(Объект.ДатаЗаезда));
ТЗБ=ВыборкаБроней.Выполнить().Выгрузить();   

Объект.ТаблицаДляВыгрузки.Очистить();   

Для каждого Стр Из ТЗБ Цикл
   Нов= Объект.ТаблицаДляВыгрузки.Добавить();
   Нов.Выгружать=Истина;
   Нов.Бронирование=Стр.ссылка;
   Нов.Клиент=Стр.Клиент;
   
   Если НЕ Стр.Клиент2.Пустая() тогда
	   Нов=Объект.ТаблицаДляВыгрузки.Добавить();
	   Нов.Выгружать=Истина;
	   Нов.Бронирование=Стр.ссылка;
	   Нов.Клиент=Стр.Клиент2;
	   
   конецесли;
   
КонецЦикла; 
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтметитьВсе(Команда)
Для каждого Стр Из Объект.ТаблицаДляВыгрузки Цикл
	Стр.Выгружать=Истина;
КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
Для каждого Стр Из Объект.ТаблицаДляВыгрузки Цикл
	Стр.Выгружать=Ложь;
КонецЦикла; 
КонецПроцедуры
//
