
Р¤СѓРЅРєС†РёСЏ РЎС„РѕСЂРјРёСЂРѕРІР°С‚СЊРћС‚С‡РµС‚РќР°РЎРµСЂРІРµСЂРµ(РњР°РєРµС‚, Р—РЅР°С‡ Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ, Р—РЅР°С‡ Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ, РўРёРїР”Р°С‚Р°РЎ, РўРёРїР”Р°С‚Р°РџРѕ, Р‘СЂРѕРЅРёСЂСѓРµС‚РћС‚Р±РѕСЂ
	, РќРµРџРѕРєР°Р·С‹РІР°С‚СЊР—Р°РєСЂС‹С‚С‹РµРќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹, Р­С‚РѕРћС‚С‡РµС‚) Р­РєСЃРїРѕСЂС‚
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‡РёСЃС‚РёС‚СЊ();

РўР°Р±Р”РѕРє = РќРѕРІС‹Р№ РўР°Р±Р»РёС‡РЅС‹Р№Р”РѕРєСѓРјРµРЅС‚;      

РџРѕР»РµРћС‚С‡РµС‚Р° = РќРѕРІС‹Р№ РўР°Р±Р»РёС‡РЅС‹Р№Р”РѕРєСѓРјРµРЅС‚;      

РџРѕР»РµРћС‚С‡РµС‚Р°.РћСЂРёРµРЅС‚Р°С†РёСЏРЎС‚СЂР°РЅРёС†С‹ = РћСЂРёРµРЅС‚Р°С†РёСЏРЎС‚СЂР°РЅРёС†С‹.Р›Р°РЅРґС€Р°С„С‚;
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‚РѕР±СЂР°Р¶Р°С‚СЊРЎРµС‚РєСѓ = РСЃС‚РёРЅР°;
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‚РѕР±СЂР°Р¶Р°С‚СЊР—Р°РіРѕР»РѕРІРєРё = РСЃС‚РёРЅР°;

Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	Р”РѕРїРЈСЃР»СѓРіРё.РЎСЃС‹Р»РєР° РљРђРљ РџР°РїРєР°,
                      |	Р”РѕРїРЈСЃР»СѓРіРё.РќРѕРјРµСЂРџРџ РљРђРљ РќРѕРјРµСЂРџРџ,
                      |	Р”РѕРїРЈСЃР»СѓРіРё.Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚С‹ РљРђРљ Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚С‹
                      |РР—
                      |	РЎРїСЂР°РІРѕС‡РЅРёРє.Р”РѕРїРЈСЃР»СѓРіРё РљРђРљ Р”РѕРїРЈСЃР»СѓРіРё
                      |Р“Р”Р•
                      |	Р”РѕРїРЈСЃР»СѓРіРё.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |	Р Р”РѕРїРЈСЃР»СѓРіРё.Р­С‚РѕР“СЂСѓРїРїР° = РРЎРўРРќРђ
                      |	Р Р”РѕРїРЈСЃР»СѓРіРё.Р РѕРґРёС‚РµР»СЊ = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°)
                      |
                      |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
                      |	РќРѕРјРµСЂРџРџ");

РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.РЎРѕСЂС‚РёСЂРѕРІР°С‚СЊ("РќРѕРјРµСЂРџРџ");

РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.Р”РѕР±Р°РІРёС‚СЊ();
РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РџР°РїРєР° = РЎРїСЂР°РІРѕС‡РЅРёРєРё.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°();

РћР±Р»Р°СЃС‚СЊР›РµРІРѕ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЁР°РїРєР°|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊР›РµРІРѕ, 0);

РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє = РћР±Р»Р°СЃС‚СЊР›РµРІРѕ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹;
РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЁР°РїРєР°|РљРѕР»РѕРЅРєР°РЈСЃР»СѓРіРё");
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
	Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°.РџР°РїРєР°) РўРѕРіРґР°		
		Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°.Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚С‹) РўРѕРіРґР°
			Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚Р° = РЎС‚СЂРѕРєР°.Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚С‹;
		РРЅР°С‡Рµ
			Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚Р° = РЎС‚СЂРѕРєР°.РџР°РїРєР°;
		РљРѕРЅРµС†Р•СЃР»Рё;
		
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЁР°РїРєР°Р”РѕРїРЈСЃР»СѓРіРё = Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚Р°;
	РРЅР°С‡Рµ
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЁР°РїРєР°Р”РѕРїРЈСЃР»СѓРіРё = "Р‘РµР· РїР°РїРєРё";
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊ, 0);
	
	РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє = РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє + 1;
РљРѕРЅРµС†Р¦РёРєР»Р°;

//РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЁР°РїРєР°|РљРѕР»РѕРЅРєРёРџСЂР°РІРѕ");
//РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊ);

РћР±Р»Р°СЃС‚СЊРЁР°РїРєР° = РџРѕР»РµРћС‚С‡РµС‚Р°.РћР±Р»Р°СЃС‚СЊ("R1"); 
РџРѕР»РµРћС‚С‡РµС‚Р°.РџРѕРІС‚РѕСЂСЏС‚СЊРџСЂРёРџРµС‡Р°С‚РёРЎС‚СЂРѕРєРё = РћР±Р»Р°СЃС‚СЊРЁР°РїРєР°;

РџРѕР»РµРћС‚С‡РµС‚Р°.Р¤РёРєСЃР°С†РёСЏРЎРІРµСЂС…Сѓ = 1;
РџРѕР»РµРћС‚С‡РµС‚Р°.РќР°С‡Р°С‚СЊРђРІС‚РѕРіСЂСѓРїРїРёСЂРѕРІРєСѓРЎС‚СЂРѕРє();

//
РС‚РѕРіРё = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°();
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РќРѕРјРµСЂР°", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РћРїР»Р°С‚С‹", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°", 0);

РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р°", 0);

РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё", 0);

РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє", 0);

Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё = РќРѕРІС‹Р№ РўР°Р±Р»РёС†Р°Р—РЅР°С‡РµРЅРёР№;
Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ");
Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЎСѓРјРјР°РЈСЃР»СѓРіРё");
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
	РќРѕРІР°СЏРЎС‚СЂРѕРєР° = Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё.Р”РѕР±Р°РІРёС‚СЊ();
	РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ = РЎС‚СЂРѕРєР°.РџР°РїРєР°;	
	РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РЈСЃР»СѓРіРё = 0;	
РљРѕРЅРµС†Р¦РёРєР»Р°;
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЈСЃР»СѓРіРёРС‚РѕРіРё", Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё);
//

//
РС‚РѕРіРёР”РµРЅСЊ = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°();
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РќРѕРјРµСЂР°", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РћРїР»Р°С‚С‹", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°", 0);

РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р°", 0);

РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё", 0);

РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє", 0);

РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё = РќРѕРІС‹Р№ РўР°Р±Р»РёС†Р°Р—РЅР°С‡РµРЅРёР№;
РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ");
РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЎСѓРјРјР°РЈСЃР»СѓРіРё");

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
	РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё.Р”РѕР±Р°РІРёС‚СЊ();
	РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ = РЎС‚СЂРѕРєР°.РџР°РїРєР°;	
	РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РЈСЃР»СѓРіРё = 0;	
РљРѕРЅРµС†Р¦РёРєР»Р°;
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё", РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё);
//

РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ = РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ(Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ, Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ);

Р—Р°РїСЂРѕСЃ =	РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ ("Р’Р«Р‘Р РђРўР¬
        	              |	РќРѕРјРµСЂРЅРѕР№Р¤РѕРЅРґ.РЎСЃС‹Р»РєР° РљРђРљ РќРѕРјРµСЂР’Р РµР·РµСЂРІ,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.РЎСЃС‹Р»РєР° РљРђРљ Р—Р°СЏРІРєР°,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.Р”Р°С‚Р° РљРђРљ Р”Р°С‚Р°,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.Р‘СЂРѕРЅРёСЂСѓРµС‚ РљРђРљ Р‘СЂРѕРЅРёСЂСѓРµС‚,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.РћРїР»Р°С‡РёРІР°РµС‚ РљРђРљ РћРїР»Р°С‡РёРІР°РµС‚,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.РЎС‚Р°С‚СѓСЃ РљРђРљ РЎС‚Р°С‚СѓСЃ,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.РљРѕР»Р’РѕР§РµР»РѕРІРµРє РљРђРљ РљРѕР»Р’РѕР§РµР»РѕРІРµРє,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ РљРђРљ РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.РќРѕРјРµСЂ РљРђРљ Р—Р°СЏРІРєР°РќРѕРјРµСЂ,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.Р”Р°С‚Р° РљРђРљ Р—Р°СЏРІРєР°Р”Р°С‚Р°,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.Р‘РµР·Р—Р°РІС‚СЂР°РєР° РљРђРљ Р‘РµР·Р—Р°РІС‚СЂР°РєР°,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.Р‘РѕРЅРЁР°РЅСЃ РљРђРљ Р‘РѕРЅРЁР°РЅСЃ,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.РЎСЃС‹Р»РєР°.Р РµР·РµСЂРІРЎ РљРђРљ Р РµР·РµСЂРІРЎ,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј РљРђРљ Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј РљРђРљ Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњРёРЅРёРјСѓРј РљРђРљ Р”Р°С‚Р°РЈСЃР»СѓРіРёРњРёРЅРёРјСѓРј,
        	              |	Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњР°РєСЃРёРјСѓРј РљРђРљ Р”Р°С‚Р°РЈСЃР»СѓРіРёРњР°РєСЃРёРјСѓРј
        	              |РР—
        	              |	РЎРїСЂР°РІРѕС‡РЅРёРє.РќРѕРјРµСЂРЅРѕР№Р¤РѕРЅРґ РљРђРљ РќРѕРјРµСЂРЅРѕР№Р¤РѕРЅРґ
        	              |		Р’РќРЈРўР Р•РќРќР•Р• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РќРѕРјРµСЂР’Р РµР·РµСЂРІ РљРђРљ РќРѕРјРµСЂР’Р РµР·РµСЂРІ,
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р‘СЂРѕРЅРёСЂСѓРµС‚ РљРђРљ Р‘СЂРѕРЅРёСЂСѓРµС‚,
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РћРїР»Р°С‡РёРІР°РµС‚ РљРђРљ РћРїР»Р°С‡РёРІР°РµС‚,
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎС‚Р°С‚СѓСЃ РљРђРљ РЎС‚Р°С‚СѓСЃ,
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РљРѕР»Р’РѕР§РµР»РѕРІРµРє РљРђРљ РљРѕР»Р’РѕР§РµР»РѕРІРµРє,
        	              |			РЎС‡РµС‚Р°РљРѕР»РёС‡РµСЃС‚РІРѕ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ РљРђРљ РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ,
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РќРѕРјРµСЂ РљРђРљ РќРѕРјРµСЂ,
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р”Р°С‚Р° РљРђРљ Р”Р°С‚Р°,
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р‘РµР·Р—Р°РІС‚СЂР°РєР° РљРђРљ Р‘РµР·Р—Р°РІС‚СЂР°РєР°,
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р‘РѕРЅРЁР°РЅСЃ РљРђРљ Р‘РѕРЅРЁР°РЅСЃ,
        	              |			Р•РЎРўР¬NULL(РџСЂРѕР¶РёРІР°РЅРёСЏ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) РљРђРљ Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј,
        	              |			Р•РЎРўР¬NULL(РџСЂРѕР¶РёРІР°РЅРёСЏ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) РљРђРљ Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј,
        	              |			Р•РЎРўР¬NULL(РўР§Р”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњРёРЅРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) РљРђРљ Р”Р°С‚Р°РЈСЃР»СѓРіРёРњРёРЅРёРјСѓРј,
        	              |			Р•РЎРўР¬NULL(РўР§Р”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњР°РєСЃРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) РљРђРљ Р”Р°С‚Р°РЈСЃР»СѓРіРёРњР°РєСЃРёРјСѓРј
        	              |		РР—
        	              |			Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ
        	              |				Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
        	              |					Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРЎС‡РµС‚Р°.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
        	              |					РљРћР›РР§Р•РЎРўР’Рћ(Р РђР—Р›РР§РќР«Р• Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРЎС‡РµС‚Р°.РЎС‡РµС‚Р“РЈРР”) РљРђРљ РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ
        	              |				РР—
        	              |					Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎС‡РµС‚Р° РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРЎС‡РµС‚Р°
        	              |				
        	              |				РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
        	              |					Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРЎС‡РµС‚Р°.РЎСЃС‹Р»РєР°) РљРђРљ РЎС‡РµС‚Р°РљРѕР»РёС‡РµСЃС‚РІРѕ
        	              |				РџРћ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎСЃС‹Р»РєР° = РЎС‡РµС‚Р°РљРѕР»РёС‡РµСЃС‚РІРѕ.РЎСЃС‹Р»РєР°
        	              |				Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
        	              |					Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
        	              |					РњРРќРРњРЈРњ(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ) РљРђРљ Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј,
        	              |					РњРђРљРЎРРњРЈРњ(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ) РљРђРљ Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј
        	              |				РР—
        	              |					Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РџСЂРѕР¶РёРІР°РЅРёРµ РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ
        	              |				
        	              |				РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
        	              |					Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.РЎСЃС‹Р»РєР°) РљРђРљ РџСЂРѕР¶РёРІР°РЅРёСЏ
        	              |				РџРћ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎСЃС‹Р»РєР° = РџСЂРѕР¶РёРІР°РЅРёСЏ.РЎСЃС‹Р»РєР°
        	              |				Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
        	              |					Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
        	              |					РњРРќРРњРЈРњ(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРё) РљРђРљ Р”Р°С‚Р°РЈСЃР»СѓРіРёРњРёРЅРёРјСѓРј,
        	              |					РњРђРљРЎРРњРЈРњ(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРё) РљРђРљ Р”Р°С‚Р°РЈСЃР»СѓРіРёРњР°РєСЃРёРјСѓРј
        	              |				РР—
        	              |					Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р”РѕРїРЈСЃР»СѓРіРё РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё
        	              |				Р“Р”Р•
        	              |					Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р’РЎС‡РµС‚ = РРЎРўРРќРђ
        	              |				
        	              |				РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
        	              |					Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.РЎСЃС‹Р»РєР°) РљРђРљ РўР§Р”РѕРїРЈСЃР»СѓРіРё
        	              |				РџРћ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎСЃС‹Р»РєР° = РўР§Р”РѕРїРЈСЃР»СѓРіРё.РЎСЃС‹Р»РєР°
        	              |		Р“Р”Р•
        	              |			Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
        	              |			Р Р’Р«Р‘РћР 
        	              |					РљРћР“Р”Рђ &РўРёРїР”Р°С‚Р°РЎ = ""Р’СЃРµР—Р°РџРµСЂРёРѕРґ""
        	              |							РР›Р &РўРёРїР”Р°С‚Р°РџРѕ = ""Р’СЃРµР—Р°РџРµСЂРёРѕРґ""
        	              |						РўРћР“Р”Рђ Р•РЎРўР¬NULL(РџСЂРѕР¶РёРІР°РЅРёСЏ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) >= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ
        	              |									Р Р•РЎРўР¬NULL(РџСЂРѕР¶РёРІР°РЅРёСЏ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) <= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ
        	              |								РР›Р Р•РЎРўР¬NULL(РўР§Р”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњР°РєСЃРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) >= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ
        	              |									Р Р•РЎРўР¬NULL(РўР§Р”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњРёРЅРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) <= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ
        	              |					РРќРђР§Р• Р’Р«Р‘РћР 
        	              |								РљРћР“Р”Рђ &РўРёРїР”Р°С‚Р°РЎ = ""Р”Р°С‚Р°Р’С‹РµР·РґР°""
        	              |									РўРћР“Р”Рђ Р•РЎРўР¬NULL(РџСЂРѕР¶РёРІР°РЅРёСЏ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) >= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ
        	              |											РР›Р Р•РЎРўР¬NULL(РўР§Р”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњР°РєСЃРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) >= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ
        	              |								РРќРђР§Р• Р•РЎРўР¬NULL(РџСЂРѕР¶РёРІР°РЅРёСЏ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) >= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ
        	              |										РР›Р Р•РЎРўР¬NULL(РўР§Р”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњРёРЅРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) >= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ
        	              |							РљРћРќР•Р¦
        	              |							Р Р’Р«Р‘РћР 
        	              |								РљРћР“Р”Рђ &РўРёРїР”Р°С‚Р°РџРѕ = ""Р”Р°С‚Р°Р’С‹РµР·РґР°""
        	              |									РўРћР“Р”Рђ Р•РЎРўР¬NULL(РџСЂРѕР¶РёРІР°РЅРёСЏ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) <= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ
        	              |											РР›Р Р•РЎРўР¬NULL(РўР§Р”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњР°РєСЃРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) <= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ
        	              |								РРќРђР§Р• Р•РЎРўР¬NULL(РџСЂРѕР¶РёРІР°РЅРёСЏ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) <= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ
        	              |										РР›Р Р•РЎРўР¬NULL(РўР§Р”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњРёРЅРёРјСѓРј, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) <= &Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ
        	              |							РљРћРќР•Р¦
        	              |				РљРћРќР•Р¦
        	              |			Р Р’Р«Р‘РћР 
        	              |					РљРћР“Р”Рђ РџСЂРѕР¶РёРІР°РЅРёСЏ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј Р•РЎРўР¬ NULL
        	              |						РўРћР“Р”Рђ РРЎРўРРќРђ
        	              |					РРќРђР§Р• Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎС‚Р°С‚СѓСЃ = Р—РќРђР§Р•РќРР•(РџРµСЂРµС‡РёСЃР»РµРЅРёРµ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.Р’С‹РµС…Р°Р»)
        	              |							РР›Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎС‚Р°С‚СѓСЃ = Р—РќРђР§Р•РќРР•(РџРµСЂРµС‡РёСЃР»РµРЅРёРµ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РџСЂРѕР¶РёРІР°РµС‚)
        	              |							РР›Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎС‚Р°С‚СѓСЃ = Р—РќРђР§Р•РќРР•(РџРµСЂРµС‡РёСЃР»РµРЅРёРµ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РќРµСѓСЃС‚РѕР№РєР°)
        	              |				РљРћРќР•Р¦
        	              |			Р Р’Р«Р‘РћР 
        	              |					РљРћР“Р”Рђ &Р‘СЂРѕРЅРёСЂСѓРµС‚РћС‚Р±РѕСЂ = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.РљР»РёРµРЅС‚С‹.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°)
        	              |						РўРћР“Р”Рђ РРЎРўРРќРђ
        	              |					РРќРђР§Р• Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р‘СЂРѕРЅРёСЂСѓРµС‚ = &Р‘СЂРѕРЅРёСЂСѓРµС‚РћС‚Р±РѕСЂ
        	              |				РљРћРќР•Р¦) РљРђРљ Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ
        	              |		РџРћ РќРѕРјРµСЂРЅРѕР№Р¤РѕРЅРґ.РЎСЃС‹Р»РєР° = Р—Р°СЏРІРєР°Р”Р°РЅРЅС‹Рµ.РќРѕРјРµСЂР’Р РµР·РµСЂРІ
        	              |Р“Р”Р•
        	              |	РќРѕРјРµСЂРЅРѕР№Р¤РѕРЅРґ.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
        	              |
        	              |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
        	              |	РќРѕРјРµСЂРЅРѕР№Р¤РѕРЅРґ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ,
        	              |	Р—Р°СЏРІРєР°");

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ", Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ);
Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ", Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ);
Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("РўРёРїР”Р°С‚Р°РЎ", РўРёРїР”Р°С‚Р°РЎ);
Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("РўРёРїР”Р°С‚Р°РџРѕ", РўРёРїР”Р°С‚Р°РџРѕ);
Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р‘СЂРѕРЅРёСЂСѓРµС‚РћС‚Р±РѕСЂ", Р‘СЂРѕРЅРёСЂСѓРµС‚РћС‚Р±РѕСЂ);
РўР—_Р—Р°СЏРІРєРё = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();

Р—Р°СЏРІРєРё = РўР—_Р—Р°СЏРІРєРё.Р’С‹РіСЂСѓР·РёС‚СЊРљРѕР»РѕРЅРєСѓ("Р—Р°СЏРІРєР°");
РўР—_РџСЂРѕР¶РёРІР°РЅРёРµР—Р°СЏРІРєРё = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўР—_РџСЂРѕР¶РёРІР°РЅРёРµР—Р°СЏРІРєРё(Р—Р°СЏРІРєРё);
РўР—_РЈСЃР»СѓРіРёР—Р°СЏРІРєРё = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўР—_РЈСЃР»СѓРіРёР—Р°СЏРІРєРё(Р—Р°СЏРІРєРё);
РўР—_РћРїР»Р°С‚С‹Р—Р°СЏРІРєРё = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўР—_РћРїР»Р°С‚С‹Р—Р°СЏРІРєРё(Р—Р°СЏРІРєРё);

РЎРїРёСЃРѕРєРљРѕРЅС‚СЂР°РіРµРЅС‚С‹РРРќ_Р­РєРІР°Р№СЂРёРЅРі = Р‘РµР·РЅР°Р»Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРЎРµСЂРІРµСЂ.РЎРїРёСЃРѕРєРРќРќР­РєРІР°Р№СЂРёРЅРі();
РџРѕР»СѓС‡Р°С‚РµР»СЊРџР»Р°С‚РµР¶Р° = РљРѕРЅСЃС‚Р°РЅС‚С‹.РџРѕР»СѓС‡Р°С‚РµР»СЊРџР»Р°С‚РµР¶Р°Р‘РµР·РЅР°Р».РџРѕР»СѓС‡РёС‚СЊ();

Р”Р°С‚Р°_Рџ = Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ;
РџРѕРєР° Р”Р°С‚Р°_Рџ <= Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ Р¦РёРєР»
	
	Р•СЃР»Рё РўР—_Р—Р°СЏРІРєРё.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0 РўРѕРіРґР° РџРµСЂРµР№С‚Рё ~РџР РћР”РћР›Р–РРўР¬_Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ; РљРѕРЅРµС†Р•СЃР»Рё;
	
	РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ = 0;;
	РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№ = 0;
	РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = 0;
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = 0;
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = 0;
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќРѕРјРµСЂР° = 0;
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = 0;
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = 0;
	
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = 0;
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = 0;
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° = 0;

	РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ = 0;;
	РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = 0;;
	
	РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє = 0;;
	
	РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё = РС‚РѕРіРёР”РµРЅСЊ.РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё;
	Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РС‚РѕРіРёР”РµРЅСЊ.РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё Р¦РёРєР»
		РЎС‚СЂРѕРєР°.РЎСѓРјРјР°РЈСЃР»СѓРіРё = 0;	
	РљРѕРЅРµС†Р¦РёРєР»Р°;
	
	РќРµС‚Р—Р°РіРѕР»РѕРІРѕРєРЎС‚СЂРѕРєР° = РСЃС‚РёРЅР°;
	Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР° РР· РўР—_Р—Р°СЏРІРєРё Р¦РёРєР»
		РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№ = 0;
		РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = 0;
		РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = 0;
		РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = 0;
		РЎСѓРјРјР°РќРѕРјРµСЂР° = 0;
		РЎСѓРјРјР°РћРїР»Р°С‚С‹ = 0;
		РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = 0;
		РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = 0;
		РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = 0;
		
		РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = 0;
		РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = 0;
		РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° = 0;
		
		РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє = 0;;
		
		//Р•СЃР»Рё РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°.РќРѕРјРµСЂР’Р РµР·РµСЂРІ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ <> "РќРѕРјРµСЂ 508" РўРѕРіРґР° РџСЂРѕРґРѕР»Р¶РёС‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;
		//Р•СЃР»Рё РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°.РќРѕРјРµСЂ <> "000015351" РўРѕРіРґР° РџСЂРѕРґРѕР»Р¶РёС‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;
		
		//Р•СЃР»Рё РќР• (РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°.Р РµР·РµСЂРІРЎ <= Р”Р°С‚Р°_Рџ Р РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°.Р РµР·РµСЂРІРџРѕ >= Р”Р°С‚Р°_Рџ) РўРѕРіРґР° 
		//	РџСЂРѕРґРѕР»Р¶РёС‚СЊ; 
		//РљРѕРЅРµС†Р•СЃР»Рё;
		
		//Р•СЃР»Рё РќР• (РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј <= Р”Р°С‚Р°_Рџ Р РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј >= Р”Р°С‚Р°_Рџ) РўРѕРіРґР° 
		//	РџСЂРѕРґРѕР»Р¶РёС‚СЊ; 
		//РљРѕРЅРµС†Р•СЃР»Рё; 
		РџСЂРѕР¶РёРІР°РЅРёРµР’РЅРµ = РќР• (РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњРёРЅРёРјСѓРј <= Р”Р°С‚Р°_Рџ Р РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏРњР°РєСЃРёРјСѓРј >= Р”Р°С‚Р°_Рџ); 
		РЈСЃР»СѓРіРёР’РЅРµ =  РќР• (РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњРёРЅРёРјСѓРј <= Р”Р°С‚Р°_Рџ Р РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р”Р°С‚Р°РЈСЃР»СѓРіРёРњР°РєСЃРёРјСѓРј >= Р”Р°С‚Р°_Рџ); 
		Р•СЃР»Рё РџСЂРѕР¶РёРІР°РЅРёРµР’РЅРµ Р РЈСЃР»СѓРіРёР’РЅРµ РўРѕРіРґР° РџСЂРѕРґРѕР»Р¶РёС‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;
		
		//РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўР—_РџСЂРѕР¶РёРІР°РЅРёРµР—Р°СЏРІРєР°Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ_Р§РµСЂРµР·Р—Р°РїСЂРѕСЃ(РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°, Р”Р°С‚Р°_Рџ);
		РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўР—_РџСЂРѕР¶РёРІР°РЅРёРµР—Р°СЏРІРєР°Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ(РўР—_РџСЂРѕР¶РёРІР°РЅРёРµР—Р°СЏРІРєРё, РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°, Р”Р°С‚Р°_Рџ);
		
		//РўР—_РЈСЃР»СѓРіРё = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўР—_РЈСЃР»СѓРіРёР—Р°СЏРІРєР°Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ_Р§РµСЂРµР·Р—Р°РїСЂРѕСЃ(РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°, Р”Р°С‚Р°_Рџ);
		РўР—_РЈСЃР»СѓРіРё = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўР—_РЈСЃР»СѓРіРёР—Р°СЏРІРєР°Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ(РўР—_РЈСЃР»СѓРіРёР—Р°СЏРІРєРё, РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°, Р”Р°С‚Р°_Рџ);

		Р•СЃР»Рё РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0 Р РўР—_РЈСЃР»СѓРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0 РўРѕРіРґР° РџСЂРѕРґРѕР»Р¶РёС‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;
	
		//РўР—_РћРїР»Р°С‚С‹ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўР—_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°_Р§РµСЂРµР·Р—Р°РїСЂРѕСЃ(РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°);
		РўР—_РћРїР»Р°С‚С‹ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўР—_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°(РўР—_РћРїР»Р°С‚С‹Р—Р°СЏРІРєРё, РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°);		
		
		Р•СЃР»Рё РќРµС‚Р—Р°РіРѕР»РѕРІРѕРєРЎС‚СЂРѕРєР° РўРѕРіРґР° 		
			РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("Р—Р°РіРѕР»РѕРІРѕРєРЎС‚СЂРѕРєР°");
			Р”Р°С‚Р° = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤='РґРґ.РњРњРњ РіРі'" );  
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = Р”Р°С‚Р°;	
			РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 0);
			
			РќРµС‚Р—Р°РіРѕР»РѕРІРѕРєРЎС‚СЂРѕРєР° = Р›РѕР¶СЊ;
		РљРѕРЅРµС†Р•СЃР»Рё;	
		
		РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°|РљРѕР»РѕРЅРєРёР›РµРІРѕ");

		Р”Р°С‚Р° = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤='Рґ.РњРњРњ РіРі'" );  
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = Р”Р°С‚Р°;		

		РњРµСЃСЏС† = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤='РњРњРњ РіРі'" );  
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РњРµСЃСЏС† = РњРµСЃСЏС†;		

		Р”РµРЅСЊРќРµРґРµР»Рё = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤=РґРґРґРґ");   
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”РµРЅСЊРќРµРґРµР»Рё = Р”РµРЅСЊРќРµРґРµР»Рё;
			
		РќРѕРјРµСЂРќР°РёРјРµРЅРѕРІР°РЅРёРµ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РќРѕРјРµСЂР’Р РµР·РµСЂРІ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ;
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂ = РќРѕРјРµСЂРќР°РёРјРµРЅРѕРІР°РЅРёРµ;
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°РќРѕРјРµСЂ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°;

		РљР°С‚РµРіРѕСЂРёСЏРќРѕРјРµСЂР° = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РќРѕРјРµСЂР’Р РµР·РµСЂРІ.РљР°С‚РµРіРѕСЂРёСЏРќРѕРјРµСЂР°;
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљР°С‚РµРіРѕСЂРёСЏРќРѕРјРµСЂР° = РљР°С‚РµРіРѕСЂРёСЏРќРѕРјРµСЂР°;

		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РљРѕР»Р’РѕР§РµР»РѕРІРµРє;
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎС‚Р°С‚СѓСЃ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РЎС‚Р°С‚СѓСЃ;
		
		РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = 0;
		Р•СЃР»Рё (РќР• РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘РµР·Р—Р°РІС‚СЂР°РєР°) Р (РќР• РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘РѕРЅРЁР°РЅСЃ) РўРѕРіРґР°
			РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РљРѕР»Р’РѕР§РµР»РѕРІРµРє;
		РљРѕРЅРµС†Р•СЃР»Рё;
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё;
		
		Р—Р°СЏРІРєР°Р—Р°РєСЂС‹С‚Р° = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°.Р—Р°РєСЂС‹С‚Рѕ;
		Р•СЃР»Рё Р—Р°СЏРІРєР°Р—Р°РєСЂС‹С‚Р° РўРѕРіРґР°
			//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р—Р°СЏРІРєР°Р—Р°РєСЂС‹С‚Р° = Р—Р°СЏРІРєР°Р—Р°РєСЂС‹С‚Р°;
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°Р—Р°РєСЂС‹С‚РёСЏР—Р°СЏРІРєРё = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°.Р”Р°С‚Р°Р—Р°РєСЂС‹С‚РёСЏ, "Р”Р¤=dd.MM.yy");
		РљРѕРЅРµС†Р•СЃР»Рё;
		
		Р‘СЂРѕРЅРёСЂСѓРµС‚ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚;
		Р­С‚РѕР®СЂР›РёС†Рѕ = РљР»РёРµРЅС‚С‹РЎРµСЂРІРµСЂ.Р­С‚РѕР®СЂР›РёС†Рѕ(Р‘СЂРѕРЅРёСЂСѓРµС‚);
		Р•СЃР»Рё Р­С‚РѕР®СЂР›РёС†Рѕ РўРѕРіРґР°
			//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р‘СЂРѕРЅРёСЂСѓРµС‚ = Р‘СЂРѕРЅРёСЂСѓРµС‚;
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р‘СЂРѕРЅРёСЂСѓРµС‚ = Р‘СЂРѕРЅРёСЂСѓРµС‚.РќР°РёРјРµРЅРѕРІР°РЅРёРµР®СЂР›РёС†Р°;
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р‘СЂРѕРЅРёСЂСѓРµС‚ = Р‘СЂРѕРЅРёСЂСѓРµС‚;
		РљРѕРЅРµС†Р•СЃР»Рё;
		
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р‘СЂРѕРЅРёСЂСѓРµС‚РРќРќ = Р‘СЂРѕРЅРёСЂСѓРµС‚.РРќРќ;
		
		РўР—_РџСЂРѕР¶РёРІР°РЅРёРµРљРѕР»РёС‡РµСЃС‚РІРѕ = РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ.РљРѕР»РёС‡РµСЃС‚РІРѕ();
		Р•СЃР»Рё РўР—_РџСЂРѕР¶РёРІР°РЅРёРµРљРѕР»РёС‡РµСЃС‚РІРѕ = 0 РўРѕРіРґР°  		
			РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ = РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РЎРµСЂРІРµСЂ.РЎС‚СЂСѓРєС‚СѓСЂР°РР·РўР°Р±Р»РёС†С‹(РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ);
			
			РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р¦РµРЅР° = 0;
			РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РљРѕР»РёС‡РµСЃС‚РІРѕ = 0;
			РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР°Р‘РµР·РЎРєРёРґРєРё = 0;
			РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР° = 0;
		РРЅР°С‡Рµ		
			РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ = РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ[0];
		РљРѕРЅРµС†Р•СЃР»Рё;
		
		Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р¦РµРЅР°;
		Р•СЃР»Рё Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ <> 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ; РљРѕРЅРµС†Р•СЃР»Рё;
		
		РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РљРѕР»РёС‡РµСЃС‚РІРѕ;
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„;
			
		РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё = Р”РѕРєСѓРјРµРЅС‚С‹РЎРµСЂРІРµСЂ.РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРёРљР»РёРµРЅС‚Р°(РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚, РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р РµР·РµСЂРІРЎ); //, РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°.Р’2Р’);
		
		РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = Р”РѕРєСѓРјРµРЅС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё(РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°, РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР°Р‘РµР·РЎРєРёРґРєРё
			, РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°.РЎС‡РµС‚Р°, РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°.РЎС‡РµС‚Р°Р”РµС‚Р°Р»СЊРЅРѕР”РѕР»РіРё, РўР—_РЈСЃР»СѓРіРё, РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё);
		
		Р•СЃР»Рё РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚.РўСѓСЂР°РіРµРЅС‚СЃС‚РІРѕ РўРѕРіРґР°
			РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР°Р‘РµР·РЎРєРёРґРєРё;
			
			Р•СЃР»Рё РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚.РўРёРїРћРїР»Р°С‚С‹РЎС‡РµС‚Р° = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РўРёРїРћРїР»Р°С‚С‹РЎС‡РµС‚Р°.Р’Р·Р°РёРјРѕР·Р°С‡РµС‚ РўРѕРіРґР°  
				Р•СЃР»Рё РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РћРїР»Р°С‡РёРІР°РµС‚ РўРѕРіРґР°  
					РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
					РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРљР’С‹РїР»Р°С‚Рµ = 0;
				РРЅР°С‡Рµ	
					РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = 0;
					РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
				РљРѕРЅРµС†Р•СЃР»Рё;	
			РРЅР°С‡РµР•СЃР»Рё РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚.РўРёРїРћРїР»Р°С‚С‹РЎС‡РµС‚Р° = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РўРёРїРћРїР»Р°С‚С‹РЎС‡РµС‚Р°.РћРїР»Р°С‚Р°РўСѓСЂР°РіРµРЅС‚СЃС‚РІРѕРјРЎРѕРЎРєРёРґРєРѕР№ РўРѕРіРґР° 
				Р•СЃР»Рё РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РћРїР»Р°С‡РёРІР°РµС‚ РўРѕРіРґР°  
					РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
					РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРљР’С‹РїР»Р°С‚Рµ = 0;
				РРЅР°С‡Рµ	
					РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = 0;
					РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
				РљРѕРЅРµС†Р•СЃР»Рё;					
			РРЅР°С‡РµР•СЃР»Рё РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚.РўРёРїРћРїР»Р°С‚С‹РЎС‡РµС‚Р° = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РўРёРїРћРїР»Р°С‚С‹РЎС‡РµС‚Р°.РџРѕР»РЅР°СЏРћРїР»Р°С‚Р°РўСѓСЂР°РіРµРЅС‚СЃС‚РІРѕРјРЎР’РѕР·РІСЂР°С‚РѕРјРљРѕРјРёСЃСЃРёРё РўРѕРіРґР° 
				РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = 0;
				РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
			РРЅР°С‡Рµ	
				РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = 0;
				РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
			РљРѕРЅРµС†Р•СЃР»Рё;	
			
		РРЅР°С‡Рµ	
			РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР°;  
			
			РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = 0;
			РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = 0; 
			РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = 0;
		РљРѕРЅРµС†Р•СЃР»Рё;	
		
		Р•СЃР»Рё РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ <> 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ; РљРѕРЅРµС†Р•СЃР»Рё;
		
		Р•СЃР»Рё РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ > 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ; РљРѕРЅРµС†Р•СЃР»Рё;
		Р•СЃР»Рё РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ <> 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ; РљРѕРЅРµС†Р•СЃР»Рё;
		
		Р•СЃР»Рё РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё <> 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё = РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё; РљРѕРЅРµС†Р•СЃР»Рё;

		РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ = 0;
		РљРѕРјРёСЃСЃРёСЏР”Р°С‚Р°РћРїР»Р°С‚С‹ = РќРµРѕРїСЂРµРґРµР»РµРЅРѕ;
		РљРѕРјРёСЃСЃРёСЏРўРёРїРћРїР»Р°С‚С‹ = РќРµРѕРїСЂРµРґРµР»РµРЅРѕ;

		РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°("Р—Р°СЏРІРєР°, Р”Р°С‚Р°", РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°, РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ); 
		РњР°СЃСЃРёРІ_РџР»Р°С‚РµР¶Рё = РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ.РќР°Р№С‚РёРЎС‚СЂРѕРєРё(РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё);
		Р•СЃР»Рё РњР°СЃСЃРёРІ_РџР»Р°С‚РµР¶Рё.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 1 РўРѕРіРґР° 
			РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р° = РњР°СЃСЃРёРІ_РџР»Р°С‚РµР¶Рё[0];
			
			РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
			
			РљРѕРјРёСЃСЃРёСЏР”Р°С‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°.Р”Р°С‚Р°РћРїР»Р°С‚С‹;
			РљРѕРјРёСЃСЃРёСЏРўРёРїРћРїР»Р°С‚С‹ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўРёРїРџР»Р°С‚РµР¶Р°РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°);
			
			Р Р°СЃС€РёС„СЂРѕРІРєР°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р° = РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°;
		РРЅР°С‡РµР•СЃР»Рё РњР°СЃСЃРёРІ_РџР»Р°С‚РµР¶Рё.РљРѕР»РёС‡РµСЃС‚РІРѕ() > 1 РўРѕРіРґР° 
			Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р° РР· РњР°СЃСЃРёРІ_РџР»Р°С‚РµР¶Рё Р¦РёРєР» 
				РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ + РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
			РљРѕРЅРµС†Р¦РёРєР»Р°;
		РљРѕРЅРµС†Р•СЃР»Рё;
		Р•СЃР»Рё РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ <> 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ; РљРѕРЅРµС†Р•СЃР»Рё;
		Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РљРѕРјРёСЃСЃРёСЏР”Р°С‚Р°РћРїР»Р°С‚С‹) РўРѕРіРґР° 
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕРјРёСЃСЃРёСЏР”Р°С‚Р°РћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РљРѕРјРёСЃСЃРёСЏР”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy"); 
			
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = Р Р°СЃС€РёС„СЂРѕРІРєР°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°; 
		РљРѕРЅРµС†Р•СЃР»Рё;
		Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РљРѕРјРёСЃСЃРёСЏРўРёРїРћРїР»Р°С‚С‹) РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕРјРёСЃСЃРёСЏРўРёРїРћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РљРѕРјРёСЃСЃРёСЏРўРёРїРћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy"); РљРѕРЅРµС†Р•СЃР»Рё;
		
		РЎСѓРјРјР°РћРїР»Р°С‚С‹ = 0;
		РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = 0;
		
		РњР°СЃСЃРёРІ_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР° = РќРѕРІС‹Р№ РњР°СЃСЃРёРІ;
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹ РР· РўР—_РћРїР»Р°С‚С‹ Р¦РёРєР»
			Р’РЎРїРёСЃРєРµ = РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РЎРµСЂРІРµСЂ.Р’РЎРїРёСЃРєРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕР»РіРёР“РЈРР”, "Р“РЈРР”", РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ);
			Р•СЃР»Рё Р’РЎРїРёСЃРєРµ РўРѕРіРґР°   
				РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎСѓРјРјР°РћРїР»Р°С‚С‹ + РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;		
				РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° + РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹) ;	
				
				РњР°СЃСЃРёРІ_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р”РѕР±Р°РІРёС‚СЊ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹); 				
			РљРѕРЅРµС†Р•СЃР»Рё;
			
			Р’РЎРїРёСЃРєРµ = РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РЎРµСЂРІРµСЂ.Р’РЎРїРёСЃРєРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕР»РіРёР“РЈРР”, "Р“РЈРР”", РўР—_РЈСЃР»СѓРіРё);
			Р•СЃР»Рё Р’РЎРїРёСЃРєРµ РўРѕРіРґР°   
				РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎСѓРјРјР°РћРїР»Р°С‚С‹ + РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;	
				РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° + РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹) ;					
				
				РњР°СЃСЃРёРІ_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р”РѕР±Р°РІРёС‚СЊ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹); 				
			РљРѕРЅРµС†Р•СЃР»Рё;
		РљРѕРЅРµС†Р¦РёРєР»Р°;
		
		Р•СЃР»Рё РЎСѓРјРјР°РћРїР»Р°С‚С‹ <> 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎСѓРјРјР°РћРїР»Р°С‚С‹; РљРѕРЅРµС†Р•СЃР»Рё;
		Р•СЃР»Рё РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° <> 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°; РљРѕРЅРµС†Р•СЃР»Рё;
		
		Р•СЃС‚СЊРћС€РёР±РєР° = Р›РѕР¶СЊ;
		Р•СЃР»Рё РњР°СЃСЃРёРІ_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 1 РўРѕРіРґР°
			РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР° = РњР°СЃСЃРёРІ_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°[0];
			
			//Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹) РўРѕРіРґР°
			Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) РўРѕРіРґР°
				РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy");
				
				РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїРћРїР»Р°С‚С‹ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўРёРїРћРїР»Р°С‚С‹РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.РўРёРїРћРїР»Р°С‚С‹);
				РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р“СЂСѓРїРїРѕРІР°СЏРћРїР»Р°С‚Р° = ?(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р“СЂСѓРїРїРѕРІР°СЏРћРїР»Р°С‚Р°, "V", "");
			
				Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ) РўРѕРіРґР° 
					РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћС‚РєСЂС‹С‚РёСЏРЎРјРµРЅС‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ, "Р”Р¤=dd.MM.yy");
				РљРѕРЅРµС†Р•СЃР»Рё;
				
				РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹;
			РРЅР°С‡Рµ
				РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = "РћС€РёР±РєР°";
				РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = "РћС€РёР±РѕС‡РЅС‹Р№ РґРѕРєСѓРјРµРЅС‚ РѕРїР»Р°С‚С‹";
				Р•СЃС‚СЊРћС€РёР±РєР° = РСЃС‚РёРЅР°;
			РљРѕРЅРµС†Р•СЃР»Рё;
			
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РћРїР»Р°С‚РёР»РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°);
			
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
			РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
			
		РљРѕРЅРµС†Р•СЃР»Рё;
		
		РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°РџСЂРѕР¶РёРІР°РЅРёРµ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°РџСЂРѕР¶РёРІР°РЅРёРµ(РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ, РўР—_РћРїР»Р°С‚С‹);
		РЎСѓРјРјР°РќРѕРјРµСЂР° = РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ - РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°РџСЂРѕР¶РёРІР°РЅРёРµ - РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
		Р•СЃР»Рё РЎСѓРјРјР°РќРѕРјРµСЂР° <> 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РќРѕРјРµСЂР° = РЎСѓРјРјР°РќРѕРјРµСЂР°; РљРѕРЅРµС†Р•СЃР»Рё;
		
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р—Р°СЏРІРєР°РќРѕРјРµСЂ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°РќРѕРјРµСЂ;
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р—Р°СЏРІРєР°Р”Р°С‚Р° = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°Р”Р°С‚Р°;
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ;
		
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р—Р°СЏРІРєР° = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°;
		
		РћР±Р»Р°СЃС‚СЊР’С‹РІРѕРґР° = РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 1);		
			
~РЈРЎР›РЈР“Р:
		РўР—_РЈСЃР»СѓРіРёРС‚РѕРіРѕ = РўР—_РЈСЃР»СѓРіРё.РЎРєРѕРїРёСЂРѕРІР°С‚СЊ();
		РўР—_РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ");
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_РЈСЃР»СѓРіРёРС‚РѕРіРѕ Р¦РёРєР» 
			Р РµР·СѓР»СЊС‚Р°С‚ = РЎРїСЂР°РІРѕС‡РЅРёРєРё.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°();
			РЎСЃС‹Р»РєР° = РЎС‚СЂРѕРєР°.РЈСЃР»СѓРіР°; 
			РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РЎРµСЂРІРµСЂ.Р’РµСЂС…РЅСЏСЏРџР°РїРєР°(РЎСЃС‹Р»РєР°, Р РµР·СѓР»СЊС‚Р°С‚);			
			
			РЎС‚СЂРѕРєР°.РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ = Р РµР·СѓР»СЊС‚Р°С‚;	
		РљРѕРЅРµС†Р¦РёРєР»Р°;	
		РўР—_РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎРІРµСЂРЅСѓС‚СЊ("Р”Р°С‚Р°РЈСЃР»СѓРіРё, РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ", "РЎСѓРјРјР°");
		
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
			Р•СЃС‚СЊРЎС‚СЂРѕРєР° = Р›РѕР¶СЊ;
			Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ РР· РўР—_РЈСЃР»СѓРіРёРС‚РѕРіРѕ Р¦РёРєР»
				Р•СЃР»Рё РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ = РЎС‚СЂРѕРєР°Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.РџР°РїРєР° РўРѕРіРґР° Р•СЃС‚СЊРЎС‚СЂРѕРєР° = РСЃС‚РёРЅР°; РџСЂРµСЂРІР°С‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;
			РљРѕРЅРµС†Р¦РёРєР»Р°;
			
			РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°|РљРѕР»РѕРЅРєР°РЈСЃР»СѓРіРё");
			Р•СЃР»Рё Р•СЃС‚СЊРЎС‚СЂРѕРєР° РўРѕРіРґР°
				Р•СЃР»Рё РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР° <> 0 РўРѕРіРґР°
					РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР°;
				РљРѕРЅРµС†Р•СЃР»Рё;	
			РљРѕРЅРµС†Р•СЃР»Рё;
			
			РћР±Р»Р°СЃС‚СЊР’С‹РІРѕРґР° = РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё, 1);
		РљРѕРЅРµС†Р¦РёРєР»Р°;
		
		Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ = РџРѕР»РµРћС‚С‡РµС‚Р°.РћР±Р»Р°СЃС‚СЊ(РћР±Р»Р°СЃС‚СЊР’С‹РІРѕРґР°.Р’РµСЂС…, , РћР±Р»Р°СЃС‚СЊР’С‹РІРѕРґР°.РќРёР·);

//
		Р•СЃР»Рё РњР°СЃСЃРёРІ_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 1 РР›Р Р•СЃС‚СЊРћС€РёР±РєР° РўРѕРіРґР°
			//Р•СЃР»Рё РњР°СЃСЃРёРІ_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°[0].РћСЃС‚Р°С‚РѕРєР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ > 0 РўРѕРіРґР° 
			//	Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.Р¦РІРµС‚РўРµРєСЃС‚Р° = РќРѕРІС‹Р№ Р¦РІРµС‚(0, 128, 0);
			//РљРѕРЅРµС†Р•СЃР»Рё;	
			Р•СЃР»Рё Р•СЃС‚СЊРћС€РёР±РєР° РўРѕРіРґР° 
				Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.Р¦РІРµС‚Р¤РѕРЅР° = РќРѕРІС‹Р№ Р¦РІРµС‚(220, 220, 220);
			РљРѕРЅРµС†Р•СЃР»Рё;	
		РљРѕРЅРµС†Р•СЃР»Рё;	

		РЎСѓРјРјР°РЈСЃР»СѓРіРё_Рџ = РўР—_РЈСЃР»СѓРіРё.РС‚РѕРі("РЎСѓРјРјР°");
		РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ_Рџ = РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР°; 
		
 		Р•СЃР»Рё РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ_Рџ + РЎСѓРјРјР°РЈСЃР»СѓРіРё_Рџ <> РЎСѓРјРјР°РћРїР»Р°С‚С‹ РўРѕРіРґР°
			//РЁСЂРёС„С‚РЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ РЁСЂРёС„С‚(Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.РЁСЂРёС„С‚, , , ,РСЃС‚РёРЅР°);
			РЁСЂРёС„С‚РЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ РЁСЂРёС„С‚("Arial" ,8 ,Р›РѕР¶СЊ  ,РСЃС‚РёРЅР°, Р›РѕР¶СЊ);
			
			Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.РЁСЂРёС„С‚ = РЁСЂРёС„С‚РЎС‚СЂРѕРєРё;

			Р¦РІРµС‚РўРµРєСЃС‚Р°РЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ Р¦РІРµС‚(255, 0, 0);
		РРЅР°С‡Рµ
			Р•СЃР»Рё РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ <> РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ РўРѕРіРґР°  		
				Р¦РІРµС‚РўРµРєСЃС‚Р°РЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ Р¦РІРµС‚(185, 30, 175);
			РРЅР°С‡Рµ
				Р¦РІРµС‚РўРµРєСЃС‚Р°РЎС‚СЂРѕРєРё = РќРµРѕРїСЂРµРґРµР»РµРЅРѕ;
			РљРѕРЅРµС†Р•СЃР»Рё;
		РљРѕРЅРµС†Р•СЃР»Рё;
		
		Р•СЃР»Рё Р¦РІРµС‚РўРµРєСЃС‚Р°РЎС‚СЂРѕРєРё <> РќРµРѕРїСЂРµРґРµР»РµРЅРѕ РўРѕРіРґР°
			Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.Р¦РІРµС‚РўРµРєСЃС‚Р° = Р¦РІРµС‚РўРµРєСЃС‚Р°РЎС‚СЂРѕРєРё;
		РљРѕРЅРµС†Р•СЃР»Рё;
		
// РџР»Р°С‚РµР¶Рё
		Р•СЃР»Рё РњР°СЃСЃРёРІ_РџР»Р°С‚РµР¶Рё.РљРѕР»РёС‡РµСЃС‚РІРѕ() > 1 РўРѕРіРґР°	
			Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Рё РР· РњР°СЃСЃРёРІ_РџР»Р°С‚РµР¶Рё Р¦РёРєР»
				РћР±Р»Р°СЃС‚СЊРџР»Р°С‚РµР¶Рё = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Рё|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
				
				РћР±Р»Р°СЃС‚СЊРџР»Р°С‚РµР¶Рё.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = ".";
				
				РћР±Р»Р°СЃС‚СЊРџР»Р°С‚РµР¶Рё.РџР°СЂР°РјРµС‚СЂС‹.Р—Р°СЏРІРєР°РќРѕРјРµСЂ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°РќРѕРјРµСЂ;
				РћР±Р»Р°СЃС‚СЊРџР»Р°С‚РµР¶Рё.РџР°СЂР°РјРµС‚СЂС‹.Р—Р°СЏРІРєР°Р”Р°С‚Р° = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°Р”Р°С‚Р°;
	
				РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
				
				РљРѕРјРёСЃСЃРёСЏР”Р°С‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°.Р”Р°С‚Р°РћРїР»Р°С‚С‹;
				РљРѕРјРёСЃСЃРёСЏРўРёРїРћРїР»Р°С‚С‹ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўРёРїРџР»Р°С‚РµР¶Р°РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°);
				
				Р Р°СЃС€РёС„СЂРѕРІРєР°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р° = РЎС‚СЂРѕРєР°РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°;
			
				Р•СЃР»Рё РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ <> 0 РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊРџР»Р°С‚РµР¶Рё.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ; РљРѕРЅРµС†Р•СЃР»Рё;
				Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РљРѕРјРёСЃСЃРёСЏР”Р°С‚Р°РћРїР»Р°С‚С‹) РўРѕРіРґР° 
					РћР±Р»Р°СЃС‚СЊРџР»Р°С‚РµР¶Рё.РџР°СЂР°РјРµС‚СЂС‹.РљРѕРјРёСЃСЃРёСЏР”Р°С‚Р°РћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РљРѕРјРёСЃСЃРёСЏР”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy"); 
					
					РћР±Р»Р°СЃС‚СЊРџР»Р°С‚РµР¶Рё.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = Р Р°СЃС€РёС„СЂРѕРІРєР°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°; 
				РљРѕРЅРµС†Р•СЃР»Рё;
				Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РљРѕРјРёСЃСЃРёСЏРўРёРїРћРїР»Р°С‚С‹) РўРѕРіРґР° РћР±Р»Р°СЃС‚СЊРџР»Р°С‚РµР¶Рё.РџР°СЂР°РјРµС‚СЂС‹.РљРѕРјРёСЃСЃРёСЏРўРёРїРћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РљРѕРјРёСЃСЃРёСЏРўРёРїРћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy"); РљРѕРЅРµС†Р•СЃР»Рё;
			РљРѕРЅРµС†Р¦РёРєР»Р°;
			
			РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРџР»Р°С‚РµР¶Рё, 1);
		РљРѕРЅРµС†Р•СЃР»Рё;
		
// РћРџР›РђРўР«
		Р•СЃР»Рё РњР°СЃСЃРёРІ_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР°.РљРѕР»РёС‡РµСЃС‚РІРѕ() > 1 РўРѕРіРґР°
			Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹ РР· РњР°СЃСЃРёРІ_РћРїР»Р°С‚С‹Р—Р°СЏРІРєР° Р¦РёРєР»
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
				
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = ".";
				
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р—Р°СЏРІРєР°РќРѕРјРµСЂ = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°РќРѕРјРµСЂ;
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р—Р°СЏРІРєР°Р”Р°С‚Р° = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°Р”Р°С‚Р°;
				
				Р•СЃС‚СЊРћС€РёР±РєР° = Р›РѕР¶СЊ;
				Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) РўРѕРіРґР°
					РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy");
					
					РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р“СЂСѓРїРїРѕРІР°СЏРћРїР»Р°С‚Р° = ?(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р“СЂСѓРїРїРѕРІР°СЏРћРїР»Р°С‚Р°, "V", "");
					РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р“СЂСѓРїРїРѕРІР°СЏРћРїР»Р°С‚Р° = ?(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р“СЂСѓРїРїРѕРІР°СЏРћРїР»Р°С‚Р°, "V", "");
				
				Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ) РўРѕРіРґР° 
						РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћС‚РєСЂС‹С‚РёСЏРЎРјРµРЅС‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ, "Р”Р¤=dd.MM.yy");
					РљРѕРЅРµС†Р•СЃР»Рё;
					
					РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹;
				РРЅР°С‡Рµ
					Р•СЃС‚СЊРћС€РёР±РєР° = РСЃС‚РёРЅР°;
					РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = "РћС€РёР±РєР°";
					РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = "РћС€РёР±РѕС‡РЅС‹Р№ РґРѕРєСѓРјРµРЅС‚ РѕРїР»Р°С‚С‹";
				РљРѕРЅРµС†Р•СЃР»Рё;
				
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
				
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹);
				//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°;
				
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р—Р°СЏРІРєР° = РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.Р—Р°СЏРІРєР°;
				
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РћРїР»Р°С‚РёР»РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹);
				
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
				РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
			
				Р•СЃР»Рё РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЈСЃР»СѓРіР° РўРѕРіРґР°
					
					Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
						РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°("Р“РЈРР”", РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕР»РіРёР“РЈРР”);
						РќР°Р№РґРµРЅРЅС‹РµРЎС‚СЂРѕРєРё = РўР—_РЈСЃР»СѓРіРё.РќР°Р№С‚РёРЎС‚СЂРѕРєРё(РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё);
						
						Р•СЃС‚СЊРЎС‚СЂРѕРєР° = Р›РѕР¶СЊ;
						Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РќР°Р№РґРµРЅРЅС‹РµРЎС‚СЂРѕРєРё Р¦РёРєР»
							Р РµР·СѓР»СЊС‚Р°С‚ = РЎРїСЂР°РІРѕС‡РЅРёРєРё.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°();
							РЎСЃС‹Р»РєР° = РЎС‚СЂРѕРєР°.РЈСЃР»СѓРіР°; 
							РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РЎРµСЂРІРµСЂ.Р’РµСЂС…РЅСЏСЏРџР°РїРєР°(РЎСЃС‹Р»РєР°, Р РµР·СѓР»СЊС‚Р°С‚);
							
							Р•СЃР»Рё Р РµР·СѓР»СЊС‚Р°С‚ = РЎС‚СЂРѕРєР°Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.РџР°РїРєР° РўРѕРіРґР°
								Р•СЃС‚СЊРЎС‚СЂРѕРєР° = РСЃС‚РёРЅР°;
								
								РџСЂРµСЂРІР°С‚СЊ;
							РљРѕРЅРµС†Р•СЃР»Рё;
						РљРѕРЅРµС†Р¦РёРєР»Р°;
						
						Р•СЃР»Рё Р•СЃС‚СЊРЎС‚СЂРѕРєР° РўРѕРіРґР° РџСЂРµСЂРІР°С‚СЊ;  РљРѕРЅРµС†Р•СЃР»Рё;
					РљРѕРЅРµС†Р¦РёРєР»Р°;	
					
					Р•СЃР»Рё Р•СЃС‚СЊРЎС‚СЂРѕРєР° РўРѕРіРґР°  
						РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹, 1);
					РљРѕРЅРµС†Р•СЃР»Рё;
					
					Р•СЃР»Рё Р•СЃС‚СЊРЎС‚СЂРѕРєР° РўРѕРіРґР° 
						Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
							РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°("Р“РЈРР”", РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕР»РіРёР“РЈРР”);
							РќР°Р№РґРµРЅРЅС‹РµРЎС‚СЂРѕРєРё = РўР—_РЈСЃР»СѓРіРё.РќР°Р№С‚РёРЎС‚СЂРѕРєРё(РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё);
							
							Р•СЃС‚СЊРЎС‚СЂРѕРєР° = Р›РѕР¶СЊ;
							Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РќР°Р№РґРµРЅРЅС‹РµРЎС‚СЂРѕРєРё Р¦РёРєР»
								Р РµР·СѓР»СЊС‚Р°С‚ = РЎРїСЂР°РІРѕС‡РЅРёРєРё.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°();
								РЎСЃС‹Р»РєР° = РЎС‚СЂРѕРєР°.РЈСЃР»СѓРіР°; 
								РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РЎРµСЂРІРµСЂ.Р’РµСЂС…РЅСЏСЏРџР°РїРєР°(РЎСЃС‹Р»РєР°, Р РµР·СѓР»СЊС‚Р°С‚);
								
								Р•СЃР»Рё Р РµР·СѓР»СЊС‚Р°С‚ = РЎС‚СЂРѕРєР°Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.РџР°РїРєР° РўРѕРіРґР°
									Р•СЃС‚СЊРЎС‚СЂРѕРєР° = РСЃС‚РёРЅР°;
									
									РџСЂРµСЂРІР°С‚СЊ;
								РљРѕРЅРµС†Р•СЃР»Рё;
							РљРѕРЅРµС†Р¦РёРєР»Р°;
							
							РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹|РљРѕР»РѕРЅРєР°РЈСЃР»СѓРіРё");
							Р•СЃР»Рё Р•СЃС‚СЊРЎС‚СЂРѕРєР° РўРѕРіРґР°
								РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
							РљРѕРЅРµС†Р•СЃР»Рё;
							
							РћР±Р»Р°СЃС‚СЊР’С‹РІРѕРґР° = РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё, 1);
						РљРѕРЅРµС†Р¦РёРєР»Р°;
					РљРѕРЅРµС†Р•СЃР»Рё;
				РРЅР°С‡Рµ
					Р’РЎРїРёСЃРєРµ = РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РЎРµСЂРІРµСЂ.Р’РЎРїРёСЃРєРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕР»РіРёР“РЈРР”, "Р“РЈРР”", РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ); 
					Р•СЃР»Рё Р’РЎРїРёСЃРєРµ РўРѕРіРґР° 
						РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
						РћР±Р»Р°СЃС‚СЊР’С‹РІРѕРґР° = РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРћРїР»Р°С‚С‹, 1);
					РљРѕРЅРµС†Р•СЃР»Рё;
				РљРѕРЅРµС†Р•СЃР»Рё;
			
				Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ = РџРѕР»РµРћС‚С‡РµС‚Р°.РћР±Р»Р°СЃС‚СЊ(РћР±Р»Р°СЃС‚СЊР’С‹РІРѕРґР°.Р’РµСЂС…, , РћР±Р»Р°СЃС‚СЊР’С‹РІРѕРґР°.РќРёР·);
				
				Р•СЃР»Рё Р•СЃС‚СЊРћС€РёР±РєР° РўРѕРіРґР°
					Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.Р¦РІРµС‚Р¤РѕРЅР° = РќРѕРІС‹Р№ Р¦РІРµС‚(220, 220, 220);
				РљРѕРЅРµС†Р•СЃР»Рё;
				Р•СЃР»Рё РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РћСЃС‚Р°С‚РѕРєР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ > 0 РўРѕРіРґР°
					Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.Р¦РІРµС‚РўРµРєСЃС‚Р° = РќРѕРІС‹Р№ Р¦РІРµС‚(0, 128, 0);
				РљРѕРЅРµС†Р•СЃР»Рё;
			РљРѕРЅРµС†Р¦РёРєР»Р°;
		РљРѕРЅРµС†Р•СЃР»Рё;		
////
		РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№ + 1;
		РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ + РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„;
		
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ + Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ;
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ + РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ;
		
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќРѕРјРµСЂР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќРѕРјРµСЂР° + РЎСѓРјРјР°РќРѕРјРµСЂР°;
		
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ + РЎСѓРјРјР°РћРїР»Р°С‚С‹;
		
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° + РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;  
		
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ + РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ;
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ + РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ;
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° + РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёР Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
		
		Р•СЃР»Рё РќР• (РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РЎС‚Р°С‚СѓСЃ = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РћС‚РјРµРЅР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёСЏ 
		РР›Р РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РЎС‚Р°С‚СѓСЃ = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РћС‚РєР°Р·РћС‚Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёСЏ) 
		РўРѕРіРґР° 
			РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ + 1;
		РљРѕРЅРµС†Р•СЃР»Рё;
		
		Р•СЃР»Рё РќР• (РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РЎС‚Р°С‚СѓСЃ = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РћС‚РјРµРЅР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёСЏ 
		РР›Р РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РЎС‚Р°С‚СѓСЃ = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РћС‚РєР°Р·РћС‚Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёСЏ) 
		РўРѕРіРґР° 
			РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё + РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё;
		РљРѕРЅРµС†Р•СЃР»Рё;
		
		РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє + РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РљРѕР»Р’РѕР§РµР»РѕРІРµРє;
		
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРѕ РР· РС‚РѕРіРёР”РµРЅСЊ.РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё Р¦РёРєР» 
			Р•СЃС‚СЊРЎС‚СЂРѕРєР° = Р›РѕР¶СЊ;
			Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ РР· РўР—_РЈСЃР»СѓРіРёРС‚РѕРіРѕ Р¦РёРєР»
				Р•СЃР»Рё РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРѕ.РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ РўРѕРіРґР° Р•СЃС‚СЊРЎС‚СЂРѕРєР° = РСЃС‚РёРЅР°; РџСЂРµСЂРІР°С‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;
			РљРѕРЅРµС†Р¦РёРєР»Р°;
			
			Р•СЃР»Рё Р•СЃС‚СЊРЎС‚СЂРѕРєР° РўРѕРіРґР° 
				Р•СЃР»Рё РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР° <> 0 РўРѕРіРґР°
					РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРѕ.РЎСѓРјРјР°РЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРѕ.РЎСѓРјРјР°РЈСЃР»СѓРіРё + РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР°;
				РљРѕРЅРµС†Р•СЃР»Рё;	
			РљРѕРЅРµС†Р•СЃР»Рё;	
		РљРѕРЅРµС†Р¦РёРєР»Р°;
	РљРѕРЅРµС†Р¦РёРєР»Р°;
	
//~РџР РћР”РћР›Р–РРўР¬_РќР•Р РђРЎРџР Р•Р”Р•Р›Р•РќРќР«Р•_РћРџР›РђРўР«:

	Р•СЃР»Рё РќРµС‚Р—Р°РіРѕР»РѕРІРѕРєРЎС‚СЂРѕРєР° РўРѕРіРґР° РџРµСЂРµР№С‚Рё ~РџР РћР”РћР›Р–РРўР¬_Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ; РљРѕРЅРµС†Р•СЃР»Рё; 	
		
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РС‚РѕРіРёР”РµРЅСЊ|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
	
	Р”Р°С‚Р° = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤='Рґ.РњРњРњ РіРі'" );  
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = Р”Р°С‚Р°;		

	РњРµСЃСЏС† = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤='РњРњРњ РіРі'" );  
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РњРµСЃСЏС† = РњРµСЃСЏС†;		

	Р”РµРЅСЊРќРµРґРµР»Рё = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤=РґРґРґРґ");   
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”РµРЅСЊРќРµРґРµР»Рё = Р”РµРЅСЊРќРµРґРµР»Рё;

	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂ = "РС‚РѕРіРѕ РќРѕС‡РµР№:";
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РљР°С‚РµРіРѕСЂРёСЏРќРѕРјРµСЂР° = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№;
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ;
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ;
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„;
	
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ;
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ;
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р°;
	
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РќРѕРјРµСЂР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќРѕРјРµСЂР°;
	
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ;
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё;
	
	РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє;

	РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРС‚РѕРіРёР”РµРЅСЊ, 0);
	
	Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ РР· РС‚РѕРіРёР”РµРЅСЊ.РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё Р¦РёРєР»
		РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РС‚РѕРіРёР”РµРЅСЊ|РљРѕР»РѕРЅРєР°РЈСЃР»СѓРіРё");
		Р•СЃР»Рё РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР°РЈСЃР»СѓРіРё <> 0 РўРѕРіРґР°
			РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР°РЈСЃР»СѓРіРё;
		РљРѕРЅРµС†Р•СЃР»Рё;	
		РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё, 0);
	РљРѕРЅРµС†Р¦РёРєР»Р°;

//
	РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№ = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№ + РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№;
	РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ + РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„;
	
	РС‚РѕРіРё.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРё.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ + РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ;
	РС‚РѕРіРё.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРё.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ + РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ;
	
	РС‚РѕРіРё.РЎСѓРјРјР°РќРѕРјРµСЂР° = РС‚РѕРіРё.РЎСѓРјРјР°РќРѕРјРµСЂР° + РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќРѕРјРµСЂР°;
	
	РС‚РѕРіРё.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РС‚РѕРіРё.РЎСѓРјРјР°РћРїР»Р°С‚С‹ + РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	
	РС‚РѕРіРё.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РС‚РѕРіРё.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° + РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;  
	
	РС‚РѕРіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = РС‚РѕРіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ + РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ;
	РС‚РѕРіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = РС‚РѕРіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ + РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ;
	РС‚РѕРіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° = РС‚РѕРіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° + РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р°;
	
	РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ + РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ;
	РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё + РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё;

	РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє + РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє;
	
	Р”Р»СЏ РРЅРґРµРєСЃ = 0 РџРѕ РС‚РѕРіРё.РЈСЃР»СѓРіРёРС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕ() - 1 Р¦РёРєР»
		РС‚РѕРіРё.РЈСЃР»СѓРіРёРС‚РѕРіРё[РРЅРґРµРєСЃ].РЎСѓРјРјР°РЈСЃР»СѓРіРё = РС‚РѕРіРё.РЈСЃР»СѓРіРёРС‚РѕРіРё[РРЅРґРµРєСЃ].РЎСѓРјРјР°РЈСЃР»СѓРіРё 
			+ РС‚РѕРіРёР”РµРЅСЊ.РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё[РРЅРґРµРєСЃ].РЎСѓРјРјР°РЈСЃР»СѓРіРё;		
	РљРѕРЅРµС†Р¦РёРєР»Р°;

~РџР РћР”РћР›Р–РРўР¬_Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ:	
	Р”Р°С‚Р°_Рџ = Р”Р°С‚Р°_Рџ + 60*60*24;	
РљРѕРЅРµС†Р¦РёРєР»Р°;	
РџРѕР»РµРћС‚С‡РµС‚Р°.Р—Р°РєРѕРЅС‡РёС‚СЊРђРІС‚РѕРіСЂСѓРїРїРёСЂРѕРІРєСѓРЎС‚СЂРѕРє();

РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РС‚РѕРіРё|РљРѕР»РѕРЅРєРёР›РµРІРѕ");

РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РС‚РѕРіРёР”Р°С‚С‹ = "РџРµСЂРёРѕРґ СЃ " + Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ, "Р”Р¤=dd.MM.yy") + " РїРѕ " + Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ, "Р”Р¤=dd.MM.yy");

РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂ = "РС‚РѕРіРѕ РќРѕС‡РµР№:";
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљР°С‚РµРіРѕСЂРёСЏРќРѕРјРµСЂР° = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРё.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРё.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„;

РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ = РС‚РѕРіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРРЅС„РѕСЂРјР°С†РёРѕРЅРЅРѕ;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ = РС‚РѕРіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР’С‹РїР»Р°С‚Рµ;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р° = РС‚РѕРіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРћРїР»Р°С‚Р°;

РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РС‚РѕРіРё.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РС‚РѕРіРё.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РќРѕРјРµСЂР° = РС‚РѕРіРё.РЎСѓРјРјР°РќРѕРјРµСЂР°;

РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё;

РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє = РС‚РѕРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕР§РµР»РѕРІРµРє;

РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 0);

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ РР· РС‚РѕРіРё.РЈСЃР»СѓРіРёРС‚РѕРіРё Р¦РёРєР»
	РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РС‚РѕРіРё|РљРѕР»РѕРЅРєР°РЈСЃР»СѓРіРё");
	Р•СЃР»Рё РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР°РЈСЃР»СѓРіРё <> 0 РўРѕРіРґР°
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР°РЈСЃР»СѓРіРё;
	РљРѕРЅРµС†Р•СЃР»Рё;	
	РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊ, 0);
РљРѕРЅРµС†Р¦РёРєР»Р°;

РўР°Р±Р”РѕРє.Р’С‹РІРµСЃС‚Рё(РџРѕР»РµРћС‚С‡РµС‚Р°);


////////////////////////////////////////////////////////////////

//// + РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹Рµ РѕРїР»Р°С‚С‹
//РќРµРџРѕРєР°Р·С‹РІР°С‚СЊР—Р°РєСЂС‹С‚С‹РµРќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹ = РСЃС‚РёРЅР°;

РџРѕР»РµРћС‚С‡РµС‚Р° = РќРѕРІС‹Р№ РўР°Р±Р»РёС‡РЅС‹Р№Р”РѕРєСѓРјРµРЅС‚;
Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	NULL РљРђРљ Р—Р°СЏРІРєР°,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
                      |	NULL РљРђРљ РЎС‡РµС‚Р“РЈРР”,
                      |	NULL РљРђРљ РЈСЃР»СѓРіР°,
                      |	NULL РљРђРљ Р”РѕР»РіРёР“РЈРР”,
                      |	Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”.РЎСѓРјРјР°, 0) РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РќР°Р»РёС‡РЅС‹Рµ,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РљР°СЂС‚Р° РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РљР°СЂС‚Р°,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ = 0
                      |				Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РљР°СЂС‚Р° > 0
                      |			РўРћР“Р”Рђ 1
                      |		РРќРђР§Р• Р’Р«Р‘РћР 
                      |				РљРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ > 0
                      |						Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РљР°СЂС‚Р° = 0
                      |					РўРћР“Р”Рђ 2
                      |				РРќРђР§Р• 0
                      |			РљРћРќР•Р¦
                      |	РљРћРќР•Р¦ РљРђРљ РўРёРїРћРїР»Р°С‚С‹,
                      |	Р›РћР–Р¬ РљРђРљ Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі,
                      |	""РљР”"" РљРђРљ РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РќРѕРјРµСЂ РљРђРљ РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р° РљРђРљ Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р°РћРїР»Р°С‚С‹ РљРђРљ Р”Р°С‚Р°РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РћС‚РљРѕРіРѕ РљРђРљ РћС‚РљРѕРіРѕ,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РћС‚РљРѕРіРѕ.РўРёРїРљР»РёРµРЅС‚Р° = Р—РќРђР§Р•РќРР•(РџРµСЂРµС‡РёСЃР»РµРЅРёРµ.РўРёРїС‹РљР»РёРµРЅС‚РѕРІ.Р®СЂР›РёС†Рѕ)
                      |			РўРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµР®СЂР›РёС†Р°
                      |		РРќРђР§Р• РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ
                      |	РљРћРќР•Р¦ РљРђРљ РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ,
                      |	Р•РЎРўР¬NULL(РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) РљРђРљ Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ
                      |РР—
                      |	Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚ РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
                      |			РЎРЈРњРњРђ(РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”РѕР»РіРёРћРїР»Р°С‚Р° РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚Р”РѕР»РіРёРћРїР»Р°С‚Р°
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСЃС‹Р»РєР°) РљРђРљ Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”
                      |		РџРћ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° = Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”.РЎСЃС‹Р»РєР°
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚ РљРђРљ Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚,
                      |			РЎРЈРњРњРђ(РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚ РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚
                      |		Р“Р”Р•
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚) РљРђРљ Р’РѕР·РІСЂР°С‚С‹
                      |		РџРћ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° = Р’РѕР·РІСЂР°С‚С‹.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
                      |			РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРў РљРђРљ РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРў,
                      |			РњРђРљРЎРРњРЈРњ(РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹) РљРђРљ РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚ РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚
                      |				Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР° РљРђРљ РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°
                      |				РџРћ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРњ = РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРў
                      |					Р (Р’Р«Р‘РћР 
                      |						РљРћР“Р”Рђ РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹ Р•РЎРўР¬ NULL
                      |							РўРћР“Р”Рђ РРЎРўРРќРђ
                      |						РРќРђР§Р• РќРђР§РђР›РћРџР•Р РРћР”Рђ(РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹, Р“РћР”) = РќРђР§РђР›РћРџР•Р РРћР”Рђ(РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р°РћРїР»Р°С‚С‹, Р“РћР”)
                      |					РљРћРќР•Р¦)
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР°,
                      |			РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРў) РљРђРљ РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°
                      |		РџРћ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° = РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹
                      |Р“Р”Р•
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџСЂРёС…РѕРґ = РРЎРўРРќРђ
                      |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р­С‚РѕРџСЂРѕРёР·РІРѕР»СЊРЅС‹Р№Р§РµРє = Р›РћР–Р¬
                      |	Р Р’Р«Р‘РћР 
                      |			РљРћР“Р”Рђ Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”.РЎСЃС‹Р»РєР° Р•РЎРўР¬ NULL
                      |				РўРћР“Р”Рђ Р’Р«Р‘РћР 
                      |						РљРћР“Р”Рђ &РќРµРџРѕРєР°Р·С‹РІР°С‚СЊР—Р°РєСЂС‹С‚С‹РµРќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹
                      |							РўРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР°, 0) - Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”.РЎСѓРјРјР°, 0) <> 0
                      |						РРќРђР§Р• РРЎРўРРќРђ
                      |					РљРћРќР•Р¦
                      |			РРќРђР§Р• РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР°, 0) - Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”.РЎСѓРјРјР°, 0) <> 0
                      |		РљРћРќР•Р¦
                      |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р°РћРїР»Р°С‚С‹ >= &Р”Р°С‚Р°РќР°С‡Р°Р»Р°
                      |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р°РћРїР»Р°С‚С‹ <= &Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ");		

Р”Р°С‚Р°РќР°С‡Р°Р»Р° = '20230101';

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РќР°С‡Р°Р»Р°", Р”Р°С‚Р°РќР°С‡Р°Р»Р°);
Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ = РўРµРєСѓС‰Р°СЏР”Р°С‚Р°();
Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ", Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ);		

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("РќРµРџРѕРєР°Р·С‹РІР°С‚СЊР—Р°РєСЂС‹С‚С‹РµРќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹", РќРµРџРѕРєР°Р·С‹РІР°С‚СЊР—Р°РєСЂС‹С‚С‹РµРќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹);		

РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();	

РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹ = РўР—.РЎРєРѕРїРёСЂРѕРІР°С‚СЊРљРѕР»РѕРЅРєРё();
РљРѕР»РѕРЅРєР°_Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.РќР°Р№С‚Рё("Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹");
РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.РЈРґР°Р»РёС‚СЊ(РљРѕР»РѕРЅРєР°_Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹);
РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹");

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР— Р¦РёРєР»
	РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕР±Р°РІРёС‚СЊ();
	Р—Р°РїРѕР»РЅРёС‚СЊР—РЅР°С‡РµРЅРёСЏРЎРІРѕР№СЃС‚РІ(РќРѕРІР°СЏРЎС‚СЂРѕРєР°, РЎС‚СЂРѕРєР°);
	
	Р•СЃР»Рё РќР• Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ) РўРѕРіРґР°
		РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ = РЎС‚СЂРѕРєР°.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ;	
	РљРѕРЅРµС†Р•СЃР»Рё;
РљРѕРЅРµС†Р¦РёРєР»Р°;

Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	NULL РљРђРљ Р—Р°СЏРІРєР°,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСЃС‹Р»РєР° РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
                      |	NULL РљРђРљ РЎС‡РµС‚Р“РЈРР”,
                      |	NULL РљРђРљ РЈСЃР»СѓРіР°,
                      |	Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘.РЎСѓРјРјР°, 0) РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	0 РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РљР°СЂС‚Р°,
                      |	0 РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РќР°Р»РёС‡РЅС‹Рµ,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі
                      |			РўРћР“Р”Рђ Р’Р«Р‘РћР 
                      |					РљРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РўРµРєСЃС‚РџР»Р°С‚РµР¶Р° РџРћР”РћР‘РќРћ ""%РЎР‘Рџ%""
                      |						РўРћР“Р”Рђ 5
                      |					РРќРђР§Р• 4
                      |				РљРћРќР•Р¦
                      |		РРќРђР§Р• 3
                      |	РљРћРќР•Р¦ РљРђРљ РўРёРїРћРїР»Р°С‚С‹,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі РљРђРљ Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі,
                      |	""Р’Р‘"" РљРђРљ РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РќРѕРјРµСЂ РљРђРљ РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р”Р°С‚Р° РљРђРљ Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р”Р°С‚Р°РћРїР»Р°С‚С‹ РљРђРљ Р”Р°С‚Р°РћРїР»Р°С‚С‹,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РћС‚РљРѕРіРѕ РљРђРљ РћС‚РљРѕРіРѕ,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РћС‚РљРѕРіРѕ.РўРёРїРљР»РёРµРЅС‚Р° = Р—РќРђР§Р•РќРР•(РџРµСЂРµС‡РёСЃР»РµРЅРёРµ.РўРёРїС‹РљР»РёРµРЅС‚РѕРІ.Р®СЂР›РёС†Рѕ)
                      |			РўРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµР®СЂР›РёС†Р°
                      |		РРќРђР§Р• Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ
                      |	РљРћРќР•Р¦ РљРђРљ РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ
                      |РР—
                      |	Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР° РљРђРљ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
                      |			РЎРЈРњРњРђ(Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р”РѕР»РіРёРћРїР»Р°С‚Р° РљРђРљ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°Р”РѕР»РіРёРћРїР»Р°С‚Р°
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСЃС‹Р»РєР°) РљРђРљ Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘
                      |		РџРћ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСЃС‹Р»РєР° = Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘.РЎСЃС‹Р»РєР°
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚ РљРђРљ Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚,
                      |			РЎРЈРњРњРђ(Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР° РљРђРљ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°
                      |		Р“Р”Р•
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚) РљРђРљ Р’РѕР·РІСЂР°С‚С‹
                      |		РџРћ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСЃС‹Р»РєР° = Р’РѕР·РІСЂР°С‚С‹.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚
                      |Р“Р”Р•
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |	Р Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РџСЂРёС…РѕРґ = РРЎРўРРќРђ
                      |	Р Р’Р«Р‘РћР 
                      |			РљРћР“Р”Рђ Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘.РЎСЃС‹Р»РєР° Р•РЎРўР¬ NULL
                      |				РўРћР“Р”Рђ Р’Р«Р‘РћР 
                      |						РљРћР“Р”Рђ &РќРµРџРѕРєР°Р·С‹РІР°С‚СЊР—Р°РєСЂС‹С‚С‹РµРќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹
                      |							РўРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР°, 0) - Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘.РЎСѓРјРјР°, 0) <> 0
                      |						РРќРђР§Р• РРЎРўРРќРђ
                      |					РљРћРќР•Р¦
                      |			РРќРђР§Р• Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР°, 0) - Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘.РЎСѓРјРјР°, 0) <> 0
                      |		РљРћРќР•Р¦
                      |	Р Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р”Р°С‚Р°РћРїР»Р°С‚С‹ >= &Р”Р°С‚Р°РќР°С‡Р°Р»Р°
                      |	Р Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р”Р°С‚Р°РћРїР»Р°С‚С‹ <= &Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ");		

//Р”Р°С‚Р°РќР°С‡Р°Р»Р° = '20230101';

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РќР°С‡Р°Р»Р°", Р”Р°С‚Р°РќР°С‡Р°Р»Р°);
Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ = РўРµРєСѓС‰Р°СЏР”Р°С‚Р°();
Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ", Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ);			

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("РќРµРџРѕРєР°Р·С‹РІР°С‚СЊР—Р°РєСЂС‹С‚С‹РµРќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹", РќРµРџРѕРєР°Р·С‹РІР°С‚СЊР—Р°РєСЂС‹С‚С‹РµРќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹);			

РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР— Р¦РёРєР»
	РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕР±Р°РІРёС‚СЊ();
	Р—Р°РїРѕР»РЅРёС‚СЊР—РЅР°С‡РµРЅРёСЏРЎРІРѕР№СЃС‚РІ(РќРѕРІР°СЏРЎС‚СЂРѕРєР°, РЎС‚СЂРѕРєР°);
	
	Р•СЃР»Рё РќР• Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ) РўРѕРіРґР°
		РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ = РЎС‚СЂРѕРєР°.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ;	
	РљРѕРЅРµС†Р•СЃР»Рё;
РљРѕРЅРµС†Р¦РёРєР»Р°;

Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
	|	NULL РљРђРљ Р—Р°СЏРІРєР°,
	|	Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.Р“РЈРР” РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
	|	NULL РљРђРљ РЎС‡РµС‚Р“РЈРР”,
	|	NULL РљРђРљ РЈСЃР»СѓРіР°,
	|	Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
	|	0 РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РљР°СЂС‚Р°,
	|	0 РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РќР°Р»РёС‡РЅС‹Рµ,
	|	NULL РљРђРљ РўРёРїРћРїР»Р°С‚С‹,
	|	РРЎРўРРќРђ РљРђРљ Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі,
	|	""РќРћ"" РљРђРљ РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
	|	NULL РљРђРљ РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
	|	NULL РљРђРљ Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
	|	NULL РљРђРљ РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
	|	Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.Р”Р°С‚Р°РћРїР»Р°С‚С‹ РљРђРљ Р”Р°С‚Р°РћРїР»Р°С‚С‹,
	|	Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РРќРќ РљРђРљ РљРѕРЅС‚СЂР°РіРµРЅС‚РРќРќ,
	|	Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РўРµРєСЃС‚РџР»Р°С‚РµР¶Р° РљРђРљ РўРµРєСЃС‚РџР»Р°С‚РµР¶Р°,
	|	Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ РљРђРљ РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ,
	|	Р•РЎРўР¬NULL(Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР°, 0) РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
	|	Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР°, 0) - Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РЎСѓРјРјР°РђРЅРЅСѓР»РёСЂРѕРІР°РЅРѕ РљРђРљ РћСЃС‚Р°С‚РѕРєР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹
	|РР—
	|	Р РµРіРёСЃС‚СЂРЎРІРµРґРµРЅРёР№.Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР° РљРђРљ Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°
	|		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
	|			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°РћРїР»Р°С‚Р°.Р“РЈРР”Р—Р°РіСЂСѓР·РєР° РљРђРљ Р“РЈРР”Р—Р°РіСЂСѓР·РєР°,
	|			РЎРЈРњРњРђ(Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°РћРїР»Р°С‚Р°.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°
	|		РР—
	|			Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР° РљРђРљ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°РћРїР»Р°С‚Р°
	|		
	|		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
	|			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°РћРїР»Р°С‚Р°.Р“РЈРР”Р—Р°РіСЂСѓР·РєР°) РљРђРљ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°
	|		РџРћ Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.Р“РЈРР” = Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р“РЈРР”Р—Р°РіСЂСѓР·РєР°
	|Р“Р”Р•
	|	Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РћС‚РјРµРЅРµРЅРѕ = Р›РћР–Р¬
	|	Р Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР°, 0) - Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РЎСѓРјРјР°РђРЅРЅСѓР»РёСЂРѕРІР°РЅРѕ <> 0
	|	Р (Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РџРѕР»СѓС‡Р°С‚РµР»СЊРџР»Р°С‚РµР¶Р° = """"
	|			РР›Р Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.РџРѕР»СѓС‡Р°С‚РµР»СЊРџР»Р°С‚РµР¶Р° = &РџРѕР»СѓС‡Р°С‚РµР»СЊРџР»Р°С‚РµР¶Р°)
	|	Р Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.Р”Р°С‚Р°РћРїР»Р°С‚С‹ >= &Р”Р°С‚Р°РќР°С‡Р°Р»Р°
	|	Р Р‘РµР·РЅР°Р»Р—Р°РіСЂСѓР·РєР°.Р”Р°С‚Р°РћРїР»Р°С‚С‹ <= &Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ
	|
	|РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
	|	Р”Р°С‚Р°РћРїР»Р°С‚С‹");


Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РќР°С‡Р°Р»Р°", Р”Р°С‚Р°РќР°С‡Р°Р»Р°);
Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ = РўРµРєСѓС‰Р°СЏР”Р°С‚Р°();
Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ", Р”Р°С‚Р°РћРєРѕРЅС‡Р°РЅРёСЏ);							  

//                      |	Р’Р«Р‘РћР 
//                      |		РљРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі
//                      |			РўРћР“Р”Рђ Р’Р«Р‘РћР 
//                      |					РљРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РўРµРєСЃС‚РџР»Р°С‚РµР¶Р° РџРћР”РћР‘РќРћ ""%РЎР‘Рџ%""
//                      |						РўРћР“Р”Рђ 5
//                      |					РРќРђР§Р• 4
//                      |				РљРћРќР•Р¦
//                      |		РРќРђР§Р• 3
//                      |	РљРћРќР•Р¦ РљРђРљ РўРёРїРћРїР»Р°С‚С‹,

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("РџРѕР»СѓС‡Р°С‚РµР»СЊРџР»Р°С‚РµР¶Р°", РџРѕР»СѓС‡Р°С‚РµР»СЊРџР»Р°С‚РµР¶Р°);		
РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР— Р¦РёРєР»
	РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕР±Р°РІРёС‚СЊ();
	Р—Р°РїРѕР»РЅРёС‚СЊР—РЅР°С‡РµРЅРёСЏРЎРІРѕР№СЃС‚РІ(РќРѕРІР°СЏРЎС‚СЂРѕРєР°, РЎС‚СЂРѕРєР°);
	
	Р—РЅР°С‡РµРЅРёРµРРќРќ = РЎРїРёСЃРѕРєРљРѕРЅС‚СЂР°РіРµРЅС‚С‹РРРќ_Р­РєРІР°Р№СЂРёРЅРі.РќР°Р№С‚РёРџРѕР—РЅР°С‡РµРЅРёСЋ(РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РРќРќ);
	Р•СЃС‚СЊР’РЎРїРёСЃРєРµ = (Р—РЅР°С‡РµРЅРёРµРРќРќ <> РќРµРѕРїСЂРµРґРµР»РµРЅРѕ);
	Р•СЃР»Рё Р•СЃС‚СЊР’РЎРїРёСЃРєРµ РўРѕРіРґР°
		Р•СЃР»Рё РЎС‚СЂРќР°Р№С‚Рё(РЎС‚СЂРѕРєР°.РўРµРєСЃС‚РџР»Р°С‚РµР¶Р°,"РЎР‘Рџ") > 0 РўРѕРіРґР°
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РўРёРїРћРїР»Р°С‚С‹ = 5;
		РРЅР°С‡Рµ	
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РўРёРїРћРїР»Р°С‚С‹ = 4;
		РљРѕРЅРµС†Р•СЃР»Рё;
	РРЅР°С‡Рµ
		РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РўРёРїРћРїР»Р°С‚С‹ = 3;
	РљРѕРЅРµС†Р•СЃР»Рё;
РљРѕРЅРµС†Р¦РёРєР»Р°;

РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°");
РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ");
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹ Р¦РёРєР»
	Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬ РџР•Р Р’Р«Р• 1
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° РљРђРљ РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°,
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ РљРђРљ РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ
	                      |РР—
	                      |	Р РµРіРёСЃС‚СЂРЎРІРµРґРµРЅРёР№.РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР° РљРђРљ РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°
	                      |Р“Р”Р•
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР° <= &Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР°
	                      |
	                      |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР° РЈР‘Р«Р’");

	//Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР°", РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹);
	Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР°", РЎС‚СЂРѕРєР°.Р”Р°С‚Р°РћРїР»Р°С‚С‹);

	РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° = ?(РўР—.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0, 0, РўР—[0].РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°); 			
	РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ = ?(РўР—.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0, 0, РўР—[0].РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ); 			
	
	РЎС‚СЂРѕРєР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° = РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°;
	РЎС‚СЂРѕРєР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ = РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ;
РљРѕРЅРµС†Р¦РёРєР»Р°;
// - РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹Рµ РѕРїР»Р°С‚С‹

РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РЎРѕСЂС‚РёСЂРѕРІР°С‚СЊ("Р”Р°С‚Р°РћРїР»Р°С‚С‹");

// + РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹Рµ РѕРїР»Р°С‚С‹
РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЁР°РїРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹Р”РѕРїРѕР»РЅРµРЅРёРµ|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 0);

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹ РР· РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹ Р¦РёРєР»
	РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹Р”РѕРїРѕР»РЅРµРЅРёРµ|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = ".";
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїРћРїР»Р°С‚С‹ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўРёРїРћРїР»Р°С‚С‹РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РўРёРїРћРїР»Р°С‚С‹);
	//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy");
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy");
	
	Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ) РўРѕРіРґР°
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћС‚РєСЂС‹С‚РёСЏРЎРјРµРЅС‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ, "Р”Р¤=dd.MM.yy");
	РљРѕРЅРµС†Р•СЃР»Рё;	
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ =РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹;
	
	Р•СЃР»Рё РўРёРїР—РЅС‡(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) = РўРёРї("РЈРЅРёРєР°Р»СЊРЅС‹Р№РРґРµРЅС‚РёС„РёРєР°С‚РѕСЂ") РўРѕРіРґР°
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = "РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅР°СЏ РІС‹РіСЂСѓР·РєР°";
	РРЅР°С‡Рµ	
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹;
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РћС‚РљРѕРіРѕ;
	//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РћРїР»Р°С‚РёР»РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹);
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РћРїР»Р°С‚РёР»РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹);
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹);
	
	РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 0);
	
	Р•СЃР»Рё РўРёРїР—РЅС‡(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) = РўРёРї("Р”РѕРєСѓРјРµРЅС‚РЎСЃС‹Р»РєР°.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°") РўРѕРіРґР°
		Р—Р°РїСЂРѕСЃ_Р’РѕР·РІСЂР°С‚ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ( "Р’Р«Р‘Р РђРўР¬
		                       |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
		                       |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°
		                       |РР—
		                       |	Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР° РљРђРљ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°
		                       |Р“Р”Р•
		                       |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
		                       |	Р Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚ = &Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚");
		
		РўРёРїР”РѕРєСѓРјРµРЅС‚Р°Р’РѕР·РІСЂР°С‚ = "Р’Р‘";
		
	РРЅР°С‡РµР•СЃР»Рё РўРёРїР—РЅС‡(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) = РўРёРї("Р”РѕРєСѓРјРµРЅС‚РЎСЃС‹Р»РєР°.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚") РўРѕРіРґР°
		Р—Р°РїСЂРѕСЃ_Р’РѕР·РІСЂР°С‚ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ( "Р’Р«Р‘Р РђРўР¬
		                       |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
		                       |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°
		                       |РР—
		                       |	Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚ РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚
		                       |Р“Р”Р•
		                       |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
		                       |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚ = &Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚");
		
		РўРёРїР”РѕРєСѓРјРµРЅС‚Р°Р’РѕР·РІСЂР°С‚ = "РљР”";
	РРЅР°С‡Рµ
		Р—Р°РїСЂРѕСЃ_Р’РѕР·РІСЂР°С‚ = РќРµРѕРїСЂРµРґРµР»РµРЅРѕ;
		
		РўРёРїР”РѕРєСѓРјРµРЅС‚Р°Р’РѕР·РІСЂР°С‚ = "";
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	Р•СЃР»Рё Р—Р°РїСЂРѕСЃ_Р’РѕР·РІСЂР°С‚ = РќРµРѕРїСЂРµРґРµР»РµРЅРѕ РўРѕРіРґР°
		РўР—_Р’РѕР·РІСЂР°С‚С‹ = РќРѕРІС‹Р№ РўР°Р±Р»РёС†Р°Р—РЅР°С‡РµРЅРёР№;
	РРЅР°С‡Рµ	
		Р—Р°РїСЂРѕСЃ_Р’РѕР·РІСЂР°С‚.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚", РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹);
		РўР—_Р’РѕР·РІСЂР°С‚С‹ = Р—Р°РїСЂРѕСЃ_Р’РѕР·РІСЂР°С‚.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°Р’РѕР·РІСЂР°С‚ РР· РўР—_Р’РѕР·РІСЂР°С‚С‹ Р¦РёРєР» 
		РћР±Р»Р°СЃС‚СЊ_Р’РѕР·РІСЂР°С‚ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°Р’РѕР·РІСЂР°С‚РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹Р”РѕРїРѕР»РЅРµРЅРёРµ|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
		
		РћР±Р»Р°СЃС‚СЊ_Р’РѕР·РІСЂР°С‚.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РўРёРїР”РѕРєСѓРјРµРЅС‚Р°Р’РѕР·РІСЂР°С‚;
		РћР±Р»Р°СЃС‚СЊ_Р’РѕР·РІСЂР°С‚.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂР”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°Р’РѕР·РІСЂР°С‚.РЎСЃС‹Р»РєР°.РќРѕРјРµСЂ;
		РћР±Р»Р°СЃС‚СЊ_Р’РѕР·РІСЂР°С‚.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°Р’РѕР·РІСЂР°С‚.РЎСЃС‹Р»РєР°.Р”Р°С‚Р°;
		РћР±Р»Р°СЃС‚СЊ_Р’РѕР·РІСЂР°С‚.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°Р’РѕР·РІСЂР°С‚.РЎСѓРјРјР°;
		
		РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ_Р’РѕР·РІСЂР°С‚, 0);
		РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ_Р’РѕР·РІСЂР°С‚, 0);
	РљРѕРЅРµС†Р¦РёРєР»Р°;
РљРѕРЅРµС†Р¦РёРєР»Р°;

РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РџРѕРґРЅРѕР¶РёРµРќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹Р”РѕРїРѕР»РЅРµРЅРёРµ|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 0);
// - РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹Рµ РѕРїР»Р°С‚С‹
	
	РўР°Р±Р”РѕРє.Р’С‹РІРµСЃС‚Рё(РџРѕР»РµРћС‚С‡РµС‚Р°);

////

РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
РљРѕР»РѕРЅРєР°РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ = РћР±Р»Р°СЃС‚СЊ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹;
РўР°Р±Р”РѕРє.РћР±Р»Р°СЃС‚СЊ(, РљРѕР»РѕРЅРєР°РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ, ,РљРѕР»РѕРЅРєР°РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‡РµС‚РѕРІ).Р’РёРґРёРјРѕСЃС‚СЊ = Р›РѕР¶СЊ; 

Р•СЃР»Рё Р­С‚РѕРћС‚С‡РµС‚ РўРѕРіРґР°
	//РљРѕР»РѕРЅРєР°_1 = РћР±Р»Р°СЃС‚СЊ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹ - 3;
	//РљРѕР»РѕРЅРєР°_2 = РћР±Р»Р°СЃС‚СЊ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹ - 1;
	//РўР°Р±Р”РѕРє.РћР±Р»Р°СЃС‚СЊ(, РљРѕР»РѕРЅРєР°_1, ,РљРѕР»РѕРЅРєР°_2).Р’РёРґРёРјРѕСЃС‚СЊ = Р›РѕР¶СЊ;   
РРЅР°С‡Рµ	
	РљРѕР»РѕРЅРєР°Р—Р°РІС‚СЂР°РєРёР—Р°СЏРІРєР° = РћР±Р»Р°СЃС‚СЊ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹ - 4;
	РўР°Р±Р”РѕРє.РћР±Р»Р°СЃС‚СЊ(, РљРѕР»РѕРЅРєР°Р—Р°РІС‚СЂР°РєРёР—Р°СЏРІРєР°, ,РљРѕР»РѕРЅРєР°Р—Р°РІС‚СЂР°РєРёР—Р°СЏРІРєР°).Р’РёРґРёРјРѕСЃС‚СЊ = Р›РѕР¶СЊ;   
	
	РљРѕР»РѕРЅРєР°РђРІС‚РѕСЂСЃРєРѕРµР’РѕР·РЅР°РіСЂР°Р¶РґРµРЅРёРµРћРїР»Р°С‚Р° = РћР±Р»Р°СЃС‚СЊ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹ - 9;
	РљРѕР»РѕРЅРєР°РђРІС‚РѕСЂСЃРєРѕРµР’РѕР·РЅР°РіСЂР°Р¶РґРµРЅРёРµР¤РѕСЂРјР°РћРїР»Р°С‚С‹ = РћР±Р»Р°СЃС‚СЊ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹ - 7;
	РўР°Р±Р”РѕРє.РћР±Р»Р°СЃС‚СЊ(, РљРѕР»РѕРЅРєР°РђРІС‚РѕСЂСЃРєРѕРµР’РѕР·РЅР°РіСЂР°Р¶РґРµРЅРёРµРћРїР»Р°С‚Р°, ,РљРѕР»РѕРЅРєР°РђРІС‚РѕСЂСЃРєРѕРµР’РѕР·РЅР°РіСЂР°Р¶РґРµРЅРёРµР¤РѕСЂРјР°РћРїР»Р°С‚С‹).Р’РёРґРёРјРѕСЃС‚СЊ = Р›РѕР¶СЊ;   
	
	РљРѕР»РѕРЅРєР°РћРїР»Р°С‚РёР» = РћР±Р»Р°СЃС‚СЊ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹ - 12;
	РўР°Р±Р”РѕРє.РћР±Р»Р°СЃС‚СЊ(, РљРѕР»РѕРЅРєР°РћРїР»Р°С‚РёР», ,РљРѕР»РѕРЅРєР°РћРїР»Р°С‚РёР»).Р’РёРґРёРјРѕСЃС‚СЊ = Р›РѕР¶СЊ;   
РљРѕРЅРµС†Р•СЃР»Рё;

//
РўР°Р±Р”РѕРє.РћСЂРёРµРЅС‚Р°С†РёСЏРЎС‚СЂР°РЅРёС†С‹ = РћСЂРёРµРЅС‚Р°С†РёСЏРЎС‚СЂР°РЅРёС†С‹.Р›Р°РЅРґС€Р°С„С‚;
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‚РѕР±СЂР°Р¶Р°С‚СЊРЎРµС‚РєСѓ = РСЃС‚РёРЅР°;
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‚РѕР±СЂР°Р¶Р°С‚СЊР—Р°РіРѕР»РѕРІРєРё = РСЃС‚РёРЅР°;

//РћР±Р»Р°СЃС‚СЊРЁР°РїРєР° = РўР°Р±Р”РѕРє.РћР±Р»Р°СЃС‚СЊ("R1"); 
РћР±Р»Р°СЃС‚СЊРЁР°РїРєР° = РўР°Р±Р”РѕРє.РћР±Р»Р°СЃС‚СЊ(0,,0); 
РўР°Р±Р”РѕРє.РџРѕРІС‚РѕСЂСЏС‚СЊРџСЂРёРџРµС‡Р°С‚РёРЎС‚СЂРѕРєРё = РћР±Р»Р°СЃС‚СЊРЁР°РїРєР°;

РўР°Р±Р”РѕРє.Р¤РёРєСЃР°С†РёСЏРЎРІРµСЂС…Сѓ = 1;
Р’РѕР·РІСЂР°С‚ РўР°Р±Р”РѕРє;
РљРѕРЅРµС†Р¤СѓРЅРєС†РёРё

Р¤СѓРЅРєС†РёСЏ РЎС„РѕСЂРјРёСЂРѕРІР°С‚СЊРћС‚С‡РµС‚РћРїР»Р°С‚С‹РќР°РЎРµСЂРІРµСЂРµ(РњР°РєРµС‚, Р”Р°С‚Р°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ, Р¤РѕСЂРјР°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ, Р­С‚РѕРћС‚С‡РµС‚) Р­РєСЃРїРѕСЂС‚
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‡РёСЃС‚РёС‚СЊ();
РџРѕР»РµРћС‚С‡РµС‚Р° = РќРѕРІС‹Р№ РўР°Р±Р»РёС‡РЅС‹Р№Р”РѕРєСѓРјРµРЅС‚;      

РџРѕР»РµРћС‚С‡РµС‚Р°.РћСЂРёРµРЅС‚Р°С†РёСЏРЎС‚СЂР°РЅРёС†С‹ = РћСЂРёРµРЅС‚Р°С†РёСЏРЎС‚СЂР°РЅРёС†С‹.Р›Р°РЅРґС€Р°С„С‚;
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‚РѕР±СЂР°Р¶Р°С‚СЊРЎРµС‚РєСѓ = РСЃС‚РёРЅР°;
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‚РѕР±СЂР°Р¶Р°С‚СЊР—Р°РіРѕР»РѕРІРєРё = РСЃС‚РёРЅР°;

Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	Р”РѕРїРЈСЃР»СѓРіРё.РЎСЃС‹Р»РєР° РљРђРљ РџР°РїРєР°,
                      |	Р”РѕРїРЈСЃР»СѓРіРё.РќРѕРјРµСЂРџРџ РљРђРљ РќРѕРјРµСЂРџРџ,
                      |	Р”РѕРїРЈСЃР»СѓРіРё.Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚С‹ РљРђРљ Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚С‹
                      |РР—
                      |	РЎРїСЂР°РІРѕС‡РЅРёРє.Р”РѕРїРЈСЃР»СѓРіРё РљРђРљ Р”РѕРїРЈСЃР»СѓРіРё
                      |Р“Р”Р•
                      |	Р”РѕРїРЈСЃР»СѓРіРё.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |	Р Р”РѕРїРЈСЃР»СѓРіРё.Р­С‚РѕР“СЂСѓРїРїР° = РРЎРўРРќРђ
                      |	Р Р”РѕРїРЈСЃР»СѓРіРё.Р РѕРґРёС‚РµР»СЊ = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°)
                      |
                      |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
                      |	РќРѕРјРµСЂРџРџ");

РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.РЎРѕСЂС‚РёСЂРѕРІР°С‚СЊ("РќРѕРјРµСЂРџРџ");

РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.Р”РѕР±Р°РІРёС‚СЊ();
РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РџР°РїРєР° = РЎРїСЂР°РІРѕС‡РЅРёРєРё.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°();

РћР±Р»Р°СЃС‚СЊР›РµРІРѕ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЁР°РїРєР°|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊР›РµРІРѕ, 0);

РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє = РћР±Р»Р°СЃС‚СЊР›РµРІРѕ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹;
РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЁР°РїРєР°|РљРѕР»РѕРЅРєР°РЈСЃР»СѓРіРё");
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
	Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°.РџР°РїРєР°) РўРѕРіРґР°		
		//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЁР°РїРєР°Р”РѕРїРЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°.РџР°РїРєР°;
		Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°.Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚С‹) РўРѕРіРґР°
			Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚Р° = РЎС‚СЂРѕРєР°.Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚С‹;
		РРЅР°С‡Рµ
			Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚Р° = РЎС‚СЂРѕРєР°.РџР°РїРєР°;
		РљРѕРЅРµС†Р•СЃР»Рё;
		
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЁР°РїРєР°Р”РѕРїРЈСЃР»СѓРіРё = Р—Р°РіРѕР»РѕРІРѕРєРћС‚С‡РµС‚Р°;
	РРЅР°С‡Рµ
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЁР°РїРєР°Р”РѕРїРЈСЃР»СѓРіРё = "Р‘РµР· РїР°РїРєРё";
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊ, 0);
	
	РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє = РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє + 1;
РљРѕРЅРµС†Р¦РёРєР»Р°;

//РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЁР°РїРєР°|РљРѕР»РѕРЅРєРёРџСЂР°РІРѕ");
//РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊ);

РћР±Р»Р°СЃС‚СЊРЁР°РїРєР° = РџРѕР»РµРћС‚С‡РµС‚Р°.РћР±Р»Р°СЃС‚СЊ("R1"); 
РџРѕР»РµРћС‚С‡РµС‚Р°.РџРѕРІС‚РѕСЂСЏС‚СЊРџСЂРёРџРµС‡Р°С‚РёРЎС‚СЂРѕРєРё = РћР±Р»Р°СЃС‚СЊРЁР°РїРєР°;

//РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
//РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє = РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє + РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕ() - 2;  // - 2 СЂР°СЃС€РёС„СЂРѕРІРєРё

//РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°|РљРѕР»РѕРЅРєРёРџСЂР°РІРѕ");
//РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє = РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє + РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕ() - 1 ; // - 1 СЂР°СЃС€РёС„СЂРѕРІРєРё

//РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє = РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє - 2;

РџРѕР»РµРћС‚С‡РµС‚Р°.Р¤РёРєСЃР°С†РёСЏРЎРІРµСЂС…Сѓ = 1;
РџРѕР»РµРћС‚С‡РµС‚Р°.РќР°С‡Р°С‚СЊРђРІС‚РѕРіСЂСѓРїРїРёСЂРѕРІРєСѓРЎС‚СЂРѕРє();

//Р”Р»СЏ С€ = 1 РџРѕ 100 Р¦РёРєР»
//	РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°");	
//	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = С€;
//	
//	РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ);
//РљРѕРЅРµС†Р¦РёРєР»Р°;

//
РС‚РѕРіРё = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°();
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РќРѕРјРµСЂР°", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РћРїР»Р°С‚С‹", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РџРѕР»РЅР°СЏРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё", 0);

РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ", 0);
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё", 0);

Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё = РќРѕРІС‹Р№ РўР°Р±Р»РёС†Р°Р—РЅР°С‡РµРЅРёР№;
Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ");
Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЎСѓРјРјР°РЈСЃР»СѓРіРё");
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
	РќРѕРІР°СЏРЎС‚СЂРѕРєР° = Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё.Р”РѕР±Р°РІРёС‚СЊ();
	РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ = РЎС‚СЂРѕРєР°.РџР°РїРєР°;	
	РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РЈСЃР»СѓРіРё = 0;	
РљРѕРЅРµС†Р¦РёРєР»Р°;
РС‚РѕРіРё.Р’СЃС‚Р°РІРёС‚СЊ("РЈСЃР»СѓРіРёРС‚РѕРіРё", Р”РѕРїРЈСЃР»СѓРіРёРС‚РѕРіРё);
//

//
РС‚РѕРіРёР”РµРЅСЊ = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°();
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РќРѕРјРµСЂР°", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РћРїР»Р°С‚С‹", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РџРѕР»РЅР°СЏРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё", 0);

РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё", 0);

РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё = РќРѕРІС‹Р№ РўР°Р±Р»РёС†Р°Р—РЅР°С‡РµРЅРёР№;
РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ");
РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЎСѓРјРјР°РЈСЃР»СѓРіРё");

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
	РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё.Р”РѕР±Р°РІРёС‚СЊ();
	РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ = РЎС‚СЂРѕРєР°.РџР°РїРєР°;	
	РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РЈСЃР»СѓРіРё = 0;	
РљРѕРЅРµС†Р¦РёРєР»Р°;
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё", РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё);
//

Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР° РљРђРљ Р—Р°СЏРІРєР°,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РћС‚РљРѕРіРѕ РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹РћС‚РљРѕРіРѕ,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РћС‚РљРѕРіРѕ.РўРёРїРљР»РёРµРЅС‚Р° = Р—РќРђР§Р•РќРР•(РџРµСЂРµС‡РёСЃР»РµРЅРёРµ.РўРёРїС‹РљР»РёРµРЅС‚РѕРІ.Р®СЂР›РёС†Рѕ)
                      |			РўРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµР®СЂР›РёС†Р°
                      |		РРќРђР§Р• Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ
                      |	РљРћРќР•Р¦ РљРђРљ РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎС‡РµС‚Р“РЈРР” РљРђРљ РЎС‡РµС‚Р“РЈРР”,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЈСЃР»СѓРіР° РљРђРљ РЈСЃР»СѓРіР°,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕР»РіРёР“РЈРР” РљРђРљ Р”РѕР»РіРёР“РЈРР”,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСѓРјРјР°РћРїР»Р°С‚С‹ РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РўРРџР—РќРђР§Р•РќРРЇ(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) = РўРРџ(Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚)
                      |			РўРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ
                      |		РРќРђР§Р• 0
                      |	РљРћРќР•Р¦ РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РќР°Р»РёС‡РЅС‹Рµ,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РўРРџР—РќРђР§Р•РќРРЇ(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) = РўРРџ(Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚)
                      |			РўРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РЎСѓРјРјР°РљР°СЂС‚Р°
                      |		РРќРђР§Р• 0
                      |	РљРћРќР•Р¦ РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РљР°СЂС‚Р°,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РўРРџР—РќРђР§Р•РќРРЇ(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) = РўРРџ(Р”РѕРєСѓРјРµРЅС‚.РџСЂРѕС‡РёРµРћРїР»Р°С‚С‹)
                      |			РўРћР“Р”Рђ Р’Р«Р‘РћР 
                      |					РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р’РёРґРћРїРµСЂР°С†РёРё = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.Р’РёРґС‹РћРїРµСЂР°С†РёР№.Р’Р·Р°РёРјРѕР·Р°С‡РµС‚)
                      |						РўРћР“Р”Рђ 9
                      |					РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р’РёРґРћРїРµСЂР°С†РёРё = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.Р’РёРґС‹РћРїРµСЂР°С†РёР№.РЎРїРёСЃР°РЅРёРµ)
                      |						РўРћР“Р”Рђ 10
                      |					РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р’РёРґРћРїРµСЂР°С†РёРё = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.Р’РёРґС‹РћРїРµСЂР°С†РёР№.РЎРїРёСЃР°РЅРёРµР”РѕРїРЈСЃР»СѓРі)
                      |						РўРћР“Р”Рђ 11
                      |					РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р’РёРґРћРїРµСЂР°С†РёРё = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.Р’РёРґС‹РћРїРµСЂР°С†РёР№.РЎРїРёСЃР°РЅРёРµР—Р°С‡РµС‚)
                      |						РўРћР“Р”Рђ 12
                      |					РРќРђР§Р• 10
                      |				РљРћРќР•Р¦
                      |		РРќРђР§Р• Р’Р«Р‘РћР 
                      |				РљРћР“Р”Рђ РўРРџР—РќРђР§Р•РќРРЇ(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) = РўРРџ(Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°)
                      |					РўРћР“Р”Рђ Р’Р«Р‘РћР 
                      |							РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р’РёРґРћРїРµСЂР°С†РёРё = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.Р’РёРґС‹РћРїРµСЂР°С†РёР№.Рѕverbooking)
                      |								РўРћР“Р”Рђ 8
                      |							РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі
                      |								РўРћР“Р”Рђ Р’Р«Р‘РћР 
                      |										РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РўРµРєСЃС‚РџР»Р°С‚РµР¶Р° РџРћР”РћР‘РќРћ ""%РЎР‘Рџ%""
                      |											РўРћР“Р”Рђ 5
                      |										РРќРђР§Р• 4
                      |									РљРћРќР•Р¦
                      |							РРќРђР§Р• 3
                      |						РљРћРќР•Р¦
                      |				РРќРђР§Р• Р’Р«Р‘РћР 
                      |						РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р’РёРґРћРїРµСЂР°С†РёРё = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.Р’РёРґС‹РћРїРµСЂР°С†РёР№.Рѕverbooking)
                      |							РўРћР“Р”Рђ 8
                      |						РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ = 0
                      |								Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РЎСѓРјРјР°РљР°СЂС‚Р° > 0
                      |							РўРћР“Р”Рђ 1
                      |						РРќРђР§Р• Р’Р«Р‘РћР 
                      |								РљРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ > 0
                      |										Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РЎСѓРјРјР°РљР°СЂС‚Р° = 0
                      |									РўРћР“Р”Рђ 2
                      |								РРќРђР§Р• 0
                      |							РљРћРќР•Р¦
                      |					РљРћРќР•Р¦
                      |			РљРћРќР•Р¦
                      |	РљРћРќР•Р¦ РљРђРљ РўРёРїРћРїР»Р°С‚С‹,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РўРРџР—РќРђР§Р•РќРРЇ(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) = РўРРџ(Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°)
                      |			РўРћР“Р”Рђ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі
                      |		РРќРђР§Р• Р›РћР–Р¬
                      |	РљРћРќР•Р¦ РљРђРљ Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р”Р°С‚Р°РћРїР»Р°С‚С‹,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ РљРђРљ Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРё РљРђРљ Р”Р°С‚Р°РЈСЃР»СѓРіРё,
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.РЈСЃР»СѓРіР° РљРђРљ Р”РѕРїРЈСЃР»СѓРіРёРЈСЃР»СѓРіР°,
                      |	Р•РЎРўР¬NULL(РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹, Р”РђРўРђР’Р Р•РњРЇ(1, 1, 1)) РљРђРљ Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ
                      |РР—
                      |	Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РџСЂРѕР¶РёРІР°РЅРёРµ РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ
                      |		РџРћ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР° = Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.РЎСЃС‹Р»РєР°
                      |			Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕР»РіРёР“РЈРР” = Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.Р“РЈРР”
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р”РѕРїРЈСЃР»СѓРіРё РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё
                      |		РџРћ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР° = Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.РЎСЃС‹Р»РєР°
                      |			Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕР»РіРёР“РЈРР” = Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р“РЈРР”
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
                      |			РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРў РљРђРљ РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРў,
                      |			РњРђРљРЎРРњРЈРњ(РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹) РљРђРљ РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚ РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚
                      |				Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР° РљРђРљ РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°
                      |				РџРћ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРњ = РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРў
                      |					Р (Р’Р«Р‘РћР 
                      |						РљРћР“Р”Рђ РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹ Р•РЎРўР¬ NULL
                      |							РўРћР“Р”Рђ РРЎРўРРќРђ
                      |						РРќРђР§Р• РќРђР§РђР›РћРџР•Р РРћР”Рђ(РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќР°С‡Р°Р»РѕРљР°СЃСЃРѕРІРѕР№РЎРјРµРЅС‹, Р“РћР”) = РќРђР§РђР›РћРџР•Р РРћР”Рђ(РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р°РћРїР»Р°С‚С‹, Р“РћР”)
                      |					РљРћРќР•Р¦)
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР°,
                      |			РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРў) РљРђРљ РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°
                      |		РџРћ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = РљР°СЃСЃРѕРІР°СЏРЎРјРµРЅР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹
                      |Р“Р”Р•
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = &Р”Р°С‚Р°РћРїР»Р°С‚С‹
                      |
                      |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
                      |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР°,
                      |	Р”Р°С‚Р°РЈСЃР»СѓРіРё,
                      |	Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р”Р°С‚Р°РћРїР»Р°С‚С‹,
                      |	Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹");

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћРїР»Р°С‚С‹", Р”Р°С‚Р°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ);
РўР—_РћРїР»Р°С‚С‹ = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();	
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_РћРїР»Р°С‚С‹ Р¦РёРєР»
	Р•СЃР»Рё РќР• Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ) РўРѕРіРґР°
		РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ = РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ;	
	РљРѕРЅРµС†Р•СЃР»Рё;
РљРѕРЅРµС†Р¦РёРєР»Р°;

РўР—_РћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°");
РўР—_РћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ");
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_РћРїР»Р°С‚С‹ Р¦РёРєР»
	Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬ РџР•Р Р’Р«Р• 1
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° РљРђРљ РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°,
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ РљРђРљ РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ
	                      |РР—
	                      |	Р РµРіРёСЃС‚СЂРЎРІРµРґРµРЅРёР№.РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР° РљРђРљ РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°
	                      |Р“Р”Р•
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР° < &Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР°
	                      |
	                      |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР° РЈР‘Р«Р’");

	Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР°", РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹);

	РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° = ?(РўР—.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0, 0, РўР—[0].РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°); 			
	РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ = ?(РўР—.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0, 0, РўР—[0].РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ); 			
	
	РЎС‚СЂРѕРєР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° = РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°;
	РЎС‚СЂРѕРєР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ = РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ;
РљРѕРЅРµС†Р¦РёРєР»Р°;

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹ РР· РўР—_РћРїР»Р°С‚С‹ Р¦РёРєР»
	Р•СЃР»Рё Р¤РѕСЂРјР°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ <> "" РўРѕРіРґР°
		Р•СЃР»Рё Р¤РѕСЂРјР°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ <> РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўРёРїРћРїР»Р°С‚С‹РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РўРёРїРћРїР»Р°С‚С‹) 
		РўРѕРіРґР° РџСЂРѕРґРѕР»Р¶РёС‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;
	РљРѕРЅРµС†Р•СЃР»Рё;	
	
	РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
	
	//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = ".";
	
	РќРѕРјРµСЂРџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ = "" + РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р—Р°СЏРІРєР°.РќРѕРјРµСЂР’Р РµР·РµСЂРІ + " / "
		 + РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РљР»РёРµРЅС‚РЎРµСЂРІРµСЂ.РЈР±СЂР°С‚СЊРќРµР·РЅР°С‡Р°С‰РёРµРќСѓР»Рё(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р—Р°СЏРІРєР°.РќРѕРјРµСЂ) + " РѕС‚ " + Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р—Р°СЏРІРєР°.Р”Р°С‚Р°, "Р”Р¤=dd.MM.yy");
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂ = РќРѕРјРµСЂРџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°РќРѕРјРµСЂ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р—Р°СЏРІРєР°;
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р—Р°СЏРІРєР°РќРѕРјРµСЂ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р—Р°СЏРІРєР°.РќРѕРјРµСЂ;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р—Р°СЏРІРєР°Р”Р°С‚Р° = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р—Р°СЏРІРєР°.Р”Р°С‚Р°;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р—Р°СЏРІРєР° = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р—Р°СЏРІРєР°;
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїРћРїР»Р°С‚С‹ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўРёРїРћРїР»Р°С‚С‹РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РўРёРїРћРїР»Р°С‚С‹);
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy");
	
	Р•СЃР»Рё Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ) РўРѕРіРґР°
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћС‚РєСЂС‹С‚РёСЏРЎРјРµРЅС‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РЎРјРµРЅС‹РљРљРњ, "Р”Р¤=dd.MM.yy");
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹;
	
	//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РћС‚РљРѕРіРѕ;
	//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РћРїР»Р°С‚РёР»РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹);
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РћРїР»Р°С‚РёР»РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹);
	
	РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	
	РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹);
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;
	
	Р•СЃР»Рё РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЈСЃР»СѓРіР° РўРѕРіРґР°
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РЈСЃР»СѓРіРё, "Р”Р¤=dd.MM.yy");
		РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 0);
					
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё РР· РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё Р¦РёРєР»
			
			Р РµР·СѓР»СЊС‚Р°С‚ = РЎРїСЂР°РІРѕС‡РЅРёРєРё.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°();
			РЎСЃС‹Р»РєР° = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРїРЈСЃР»СѓРіРёРЈСЃР»СѓРіР°; 
			РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РЎРµСЂРІРµСЂ.Р’РµСЂС…РЅСЏСЏРџР°РїРєР°(РЎСЃС‹Р»РєР°, Р РµР·СѓР»СЊС‚Р°С‚);
			
			Р•СЃС‚СЊРЎС‚СЂРѕРєР° = Р›РѕР¶СЊ;
			Р•СЃР»Рё Р РµР·СѓР»СЊС‚Р°С‚ = РЎС‚СЂРѕРєР°Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.РџР°РїРєР° РўРѕРіРґР°
				Р•СЃС‚СЊРЎС‚СЂРѕРєР° = РСЃС‚РёРЅР°;
			РљРѕРЅРµС†Р•СЃР»Рё;
			
			РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹|РљРѕР»РѕРЅРєР°РЈСЃР»СѓРіРё");
			Р•СЃР»Рё Р•СЃС‚СЊРЎС‚СЂРѕРєР° РўРѕРіРґР°
				РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
			РљРѕРЅРµС†Р•СЃР»Рё;
			
			РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё, 0);
		РљРѕРЅРµС†Р¦РёРєР»Р°;
	
	РРЅР°С‡Рµ
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ, "Р”Р¤=dd.MM.yy");
		РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
		
		РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 0);
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	
////
	//РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№ + 1;
	//РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ + РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„;
	//
	//РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ + Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ;
	
	//РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќРѕРјРµСЂР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќРѕРјРµСЂР° + РЎСѓРјРјР°РќРѕРјРµСЂР°;
	
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ + РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° + РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;  
	
	//РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё + РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
	//РС‚РѕРіРёР”РµРЅСЊ.РџРѕР»РЅР°СЏРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = РС‚РѕРіРёР”РµРЅСЊ.РџРѕР»РЅР°СЏРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё + РџРѕР»РЅР°СЏРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
	
	//Р•СЃР»Рё РќР• (РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РЎС‚Р°С‚СѓСЃ = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РћС‚РјРµРЅР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёСЏ 
	//РР›Р РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РЎС‚Р°С‚СѓСЃ = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РћС‚РєР°Р·РћС‚Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёСЏ) 
	//РўРѕРіРґР° 
	//	РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ + 1;
	//РљРѕРЅРµС†Р•СЃР»Рё;
	//
	//Р•СЃР»Рё РќР• (РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РЎС‚Р°С‚СѓСЃ = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РћС‚РјРµРЅР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёСЏ 
	//РР›Р РЎС‚СЂРѕРєР°Р—Р°СЏРІРєР°.РЎС‚Р°С‚СѓСЃ = РџРµСЂРµС‡РёСЃР»РµРЅРёСЏ.РЎС‚Р°С‚СѓСЃР‘СЂРѕРЅРё.РћС‚РєР°Р·РћС‚Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёСЏ) 
	//РўРѕРіРґР° 
	//	РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё;
	//РљРѕРЅРµС†Р•СЃР»Рё;
		
	Р•СЃР»Рё РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЈСЃР»СѓРіР° РўРѕРіРґР°
		Р РµР·СѓР»СЊС‚Р°С‚ = РЎРїСЂР°РІРѕС‡РЅРёРєРё.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°();
		РЎСЃС‹Р»РєР° = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРїРЈСЃР»СѓРіРёРЈСЃР»СѓРіР°; 
		РћР±С‰РёР№Р¤СѓРЅРєС†РёРѕРЅР°Р»РЎРµСЂРІРµСЂ.Р’РµСЂС…РЅСЏСЏРџР°РїРєР°(РЎСЃС‹Р»РєР°, Р РµР·СѓР»СЊС‚Р°С‚);
		
		РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°("РЈСЃР»СѓРіР°Р РѕРґРёС‚РµР»СЊ", Р РµР·СѓР»СЊС‚Р°С‚); 
		РќР°Р№РґРµРЅРЅС‹РµРЎС‚СЂРѕРєРё = РС‚РѕРіРёР”РµРЅСЊ.РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё.РќР°Р№С‚РёРЎС‚СЂРѕРєРё(РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё);
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РќР°Р№РґРµРЅРЅР°СЏРЎС‚СЂРѕРєР° РР· РќР°Р№РґРµРЅРЅС‹РµРЎС‚СЂРѕРєРё Р¦РёРєР»
			РќР°Р№РґРµРЅРЅР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РЈСЃР»СѓРіРё = РќР°Р№РґРµРЅРЅР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РЈСЃР»СѓРіРё + РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
		РљРѕРЅРµС†Р¦РёРєР»Р°;
	РРЅР°С‡Рµ	
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ + РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	РљРѕРЅРµС†Р•СЃР»Рё;		
	
РљРѕРЅРµС†Р¦РёРєР»Р°;

// + РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹Рµ РѕРїР»Р°С‚С‹
Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	NULL РљРђРљ Р—Р°СЏРІРєР°,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РћС‚РљРѕРіРѕ РљРђРљ РћС‚РљРѕРіРѕ,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РћС‚РљРѕРіРѕ.РўРёРїРљР»РёРµРЅС‚Р° = Р—РќРђР§Р•РќРР•(РџРµСЂРµС‡РёСЃР»РµРЅРёРµ.РўРёРїС‹РљР»РёРµРЅС‚РѕРІ.Р®СЂР›РёС†Рѕ)
                      |			РўРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµР®СЂР›РёС†Р°
                      |		РРќРђР§Р• РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ
                      |	РљРћРќР•Р¦ РљРђРљ РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ,
                      |	NULL РљРђРљ РЎС‡РµС‚Р“РЈРР”,
                      |	NULL РљРђРљ РЈСЃР»СѓРіР°,
                      |	NULL РљРђРљ Р”РѕР»РіРёР“РЈРР”,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР°, 0) - Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”.РЎСѓРјРјР°, 0) РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РќР°Р»РёС‡РЅС‹Рµ,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РљР°СЂС‚Р° РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹РљР°СЂС‚Р°,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ = 0
                      |				Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РљР°СЂС‚Р° > 0
                      |			РўРћР“Р”Рђ 1
                      |		РРќРђР§Р• Р’Р«Р‘РћР 
                      |				РљРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ > 0
                      |						Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РљР°СЂС‚Р° = 0
                      |					РўРћР“Р”Рђ 2
                      |				РРќРђР§Р• 0
                      |			РљРћРќР•Р¦
                      |	РљРћРќР•Р¦ РљРђРљ РўРёРїРћРїР»Р°С‚С‹,
                      |	Р›РћР–Р¬ РљРђРљ Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі
                      |РР—
                      |	Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚ РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
                      |			РЎРЈРњРњРђ(РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”РѕР»РіРёРћРїР»Р°С‚Р° РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚Р”РѕР»РіРёРћРїР»Р°С‚Р°
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСЃС‹Р»РєР°) РљРђРљ Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”
                      |		РџРћ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° = Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”.РЎСЃС‹Р»РєР°
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚ РљРђРљ Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚,
                      |			РЎРЈРњРњРђ(РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚ РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚
                      |		Р“Р”Р•
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚) РљРђРљ Р’РѕР·РІСЂР°С‚С‹
                      |		РџРћ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° = Р’РѕР·РІСЂР°С‚С‹.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚
                      |Р“Р”Р•
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР°, 0) - Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_РљР”.РЎСѓРјРјР°, 0) <> 0
                      |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџСЂРёС…РѕРґ = РРЎРўРРќРђ
                      |	Р РќР• РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р­С‚РѕРџСЂРѕРёР·РІРѕР»СЊРЅС‹Р№Р§РµРє
                      |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = &Р”Р°С‚Р°РћРїР»Р°С‚С‹");		

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћРїР»Р°С‚С‹", Р”Р°С‚Р°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ);		
РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();	

РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹ = РўР—.РЎРєРѕРїРёСЂРѕРІР°С‚СЊРљРѕР»РѕРЅРєРё();
РљРѕР»РѕРЅРєР°_Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.РќР°Р№С‚Рё("Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹");
РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.РЈРґР°Р»РёС‚СЊ(РљРѕР»РѕРЅРєР°_Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹);
РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹");

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР— Р¦РёРєР»
	РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕР±Р°РІРёС‚СЊ();
	Р—Р°РїРѕР»РЅРёС‚СЊР—РЅР°С‡РµРЅРёСЏРЎРІРѕР№СЃС‚РІ(РќРѕРІР°СЏРЎС‚СЂРѕРєР°, РЎС‚СЂРѕРєР°);
	
	Р•СЃР»Рё РќР• Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ) РўРѕРіРґР°
		РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ = РЎС‚СЂРѕРєР°.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ;	
	РљРѕРЅРµС†Р•СЃР»Рё;
РљРѕРЅРµС†Р¦РёРєР»Р°;

Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	NULL РљРђРљ Р—Р°СЏРІРєР°,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСЃС‹Р»РєР° РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РћС‚РљРѕРіРѕ РљРђРљ РћС‚РљРѕРіРѕ,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РћС‚РљРѕРіРѕ.РўРёРїРљР»РёРµРЅС‚Р° = Р—РќРђР§Р•РќРР•(РџРµСЂРµС‡РёСЃР»РµРЅРёРµ.РўРёРїС‹РљР»РёРµРЅС‚РѕРІ.Р®СЂР›РёС†Рѕ)
                      |			РўРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµР®СЂР›РёС†Р°
                      |		РРќРђР§Р• Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ
                      |	РљРћРќР•Р¦ РљРђРљ РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ,
                      |	NULL РљРђРљ РЎС‡РµС‚Р“РЈРР”,
                      |	NULL РљРђРљ РЈСЃР»СѓРіР°,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР°, 0) - Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘.РЎСѓРјРјР°, 0) РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚Р°РћРїР»Р°С‚С‹,
                      |	0 РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹РљР°СЂС‚Р°,
                      |	0 РљРђРљ РЎСѓРјРјР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹РќР°Р»РёС‡РЅС‹Рµ,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі
                      |			РўРћР“Р”Рђ Р’Р«Р‘РћР 
                      |					РљРћР“Р”Рђ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РўРµРєСЃС‚РџР»Р°С‚РµР¶Р° РџРћР”РћР‘РќРћ ""%РЎР‘Рџ""
                      |						РўРћР“Р”Рђ 5
                      |					РРќРђР§Р• 4
                      |				РљРћРќР•Р¦
                      |		РРќРђР§Р• 3
                      |	РљРћРќР•Р¦ РљРђРљ РўРёРїРћРїР»Р°С‚С‹,
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі РљРђРљ Р­С‚РѕР­РєРІР°Р№СЂРёРЅРі
                      |РР—
                      |	Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР° РљРђРљ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
                      |			РЎРЈРњРњРђ(Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р”РѕР»РіРёРћРїР»Р°С‚Р° РљРђРљ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°Р”РѕР»РіРёРћРїР»Р°С‚Р°
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°Р”РѕР»РіРёРћРїР»Р°С‚Р°.РЎСЃС‹Р»РєР°) РљРђРљ Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘
                      |		РџРћ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСЃС‹Р»РєР° = Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘.РЎСЃС‹Р»РєР°
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚ РљРђРљ Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚,
                      |			РЎРЈРњРњРђ(Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР° РљРђРљ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°
                      |		Р“Р”Р•
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚) РљРђРљ Р’РѕР·РІСЂР°С‚С‹
                      |		РџРћ Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСЃС‹Р»РєР° = Р’РѕР·РІСЂР°С‚С‹.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚
                      |Р“Р”Р•
                      |	Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |	Р Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РЎСѓРјРјР° - Р•РЎРўР¬NULL(Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР°, 0) - Р•РЎРўР¬NULL(Р”РѕР»РіРёРћРїР»Р°С‚Р°_Р’Р‘.РЎСѓРјРјР°, 0) <> 0
                      |	Р Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.РџСЂРёС…РѕРґ = РРЎРўРРќРђ
                      |	Р Р’С‹РїРёСЃРєР°Р‘Р°РЅРєР°.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = &Р”Р°С‚Р°РћРїР»Р°С‚С‹");

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћРїР»Р°С‚С‹", Р”Р°С‚Р°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ);		
РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР— Р¦РёРєР»
	РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕР±Р°РІРёС‚СЊ();
	Р—Р°РїРѕР»РЅРёС‚СЊР—РЅР°С‡РµРЅРёСЏРЎРІРѕР№СЃС‚РІ(РќРѕРІР°СЏРЎС‚СЂРѕРєР°, РЎС‚СЂРѕРєР°);
	
	Р•СЃР»Рё РќР• Р—РЅР°С‡РµРЅРёРµР—Р°РїРѕР»РЅРµРЅРѕ(РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ) РўРѕРіРґР°
		РЎС‚СЂРѕРєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚РќР°РёРјРµРЅРѕРІР°РЅРёРµ = РЎС‚СЂРѕРєР°.РћС‚РљРѕРіРѕ.РќР°РёРјРµРЅРѕРІР°РЅРёРµ;	
	РљРѕРЅРµС†Р•СЃР»Рё;
РљРѕРЅРµС†Р¦РёРєР»Р°;

РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°");
РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ");
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹ Р¦РёРєР»
	Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬ РџР•Р Р’Р«Р• 1
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° РљРђРљ РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°,
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ РљРђРљ РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ
	                      |РР—
	                      |	Р РµРіРёСЃС‚СЂРЎРІРµРґРµРЅРёР№.РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР° РљРђРљ РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°
	                      |Р“Р”Р•
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР° < &Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР°
	                      |
	                      |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
	                      |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР° РЈР‘Р«Р’");

	Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР°", РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹);

	РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° = ?(РўР—.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0, 0, РўР—[0].РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°); 			
	РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ = ?(РўР—.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0, 0, РўР—[0].РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°РЎР‘Рџ); 			
	
	РЎС‚СЂРѕРєР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° = РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°;
РљРѕРЅРµС†Р¦РёРєР»Р°;

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹ РР· РўР—_РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹ Р¦РёРєР»
	Р•СЃР»Рё Р¤РѕСЂРјР°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ <> "" РўРѕРіРґР°
		Р•СЃР»Рё Р¤РѕСЂРјР°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ <> РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўРёРїРћРїР»Р°С‚С‹РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РўРёРїРћРїР»Р°С‚С‹) 
		РўРѕРіРґР° РџСЂРѕРґРѕР»Р¶РёС‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;
	РљРѕРЅРµС†Р•СЃР»Рё;	
	
	РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = ".";
	
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїРћРїР»Р°С‚С‹ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўРёРїРћРїР»Р°С‚С‹РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РўРёРїРћРїР»Р°С‚С‹);
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy");
	
	РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р Р°СЃС€РёС„СЂРѕРІРєР°Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹;
	
	//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РћС‚РљРѕРіРѕ;
	//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РћРїР»Р°С‚РёР»РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹);
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РћРїР»Р°С‚РёР» = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РћРїР»Р°С‚РёР»РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹);
	
	РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°(РЎС‚СЂРѕРєР°РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹РµРћРїР»Р°С‚С‹);
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;
	
	РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 0);
	
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ + РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	
	РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° + РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;  

РљРѕРЅРµС†Р¦РёРєР»Р°;

	// - РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРЅС‹Рµ РѕРїР»Р°С‚С‹

РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РС‚РѕРіРёР”РµРЅСЊ|РљРѕР»РѕРЅРєРёР›РµРІРѕ");

//Р”Р°С‚Р° = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°РћРїР»Р°С‚С‹РћС‚Р±РѕСЂ, "Р”Р¤='Рґ.РњРњРњ РіРі'" );  
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = Р”Р°С‚Р°;		
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = ".";		


//РњРµСЃСЏС† = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤='РњРњРњ РіРі'" );  
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РњРµСЃСЏС† = РњРµСЃСЏС†;		

//Р”РµРЅСЊРќРµРґРµР»Рё = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤=РґРґРґРґ");   
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”РµРЅСЊРќРµРґРµР»Рё = Р”РµРЅСЊРќРµРґРµР»Рё;

//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂ = "РС‚РѕРіРѕ РќРѕС‡РµР№:";
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљР°С‚РµРіРѕСЂРёСЏРќРѕРјРµСЂР° = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРќРѕС‡РµР№;
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р¦РµРЅР°РџСЂРѕР¶РёРІР°РЅРёРµ;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РџСЂРѕР¶РёРІР°РЅРёРµ;
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎСѓС‚РѕРєРўР°СЂРёС„;
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РџРѕР»РЅР°СЏРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = РС‚РѕРіРёР”РµРЅСЊ.РџРѕР»РЅР°СЏРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РќРѕРјРµСЂР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќРѕРјРµСЂР°;

//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕРЎС‚Р°С‚СѓСЃ;
//РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё = РС‚РѕРіРёР”РµРЅСЊ.РљРѕР»РёС‡РµСЃС‚РІРѕР—Р°РІС‚СЂР°РєРё;
РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 0);

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ РР· РС‚РѕРіРёР”РµРЅСЊ.РЈСЃР»СѓРіРёР”РµРЅСЊРС‚РѕРіРё Р¦РёРєР»
	РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РС‚РѕРіРёР”РµРЅСЊ|РљРѕР»РѕРЅРєР°РЈСЃР»СѓРіРё");
	Р•СЃР»Рё РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР°РЈСЃР»СѓРіРё <> 0 РўРѕРіРґР°
		РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРёРС‚РѕРіРѕ.РЎСѓРјРјР°РЈСЃР»СѓРіРё;
	РљРѕРЅРµС†Р•СЃР»Рё;	
	РџРѕР»РµРћС‚С‡РµС‚Р°.РџСЂРёСЃРѕРµРґРёРЅРёС‚СЊ(РћР±Р»Р°СЃС‚СЊРЈСЃР»СѓРіРё, 0);
РљРѕРЅРµС†Р¦РёРєР»Р°;

Р’РѕР·РІСЂР°С‚ РџРѕР»РµРћС‚С‡РµС‚Р°;
РљРѕРЅРµС†Р¤СѓРЅРєС†РёРё

Р¤СѓРЅРєС†РёСЏ РЎС„РѕСЂРјРёСЂРѕРІР°С‚СЊРћС‚С‡РµС‚Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РќР°РЎРµСЂРІРµСЂРµ(РњР°РєРµС‚, Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ, Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ, Р­С‚РѕРћС‚С‡РµС‚) Р­РєСЃРїРѕСЂС‚
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‡РёСЃС‚РёС‚СЊ();
РџРѕР»РµРћС‚С‡РµС‚Р° = РќРѕРІС‹Р№ РўР°Р±Р»РёС‡РЅС‹Р№Р”РѕРєСѓРјРµРЅС‚;      

РџРѕР»РµРћС‚С‡РµС‚Р°.РћСЂРёРµРЅС‚Р°С†РёСЏРЎС‚СЂР°РЅРёС†С‹ = РћСЂРёРµРЅС‚Р°С†РёСЏРЎС‚СЂР°РЅРёС†С‹.Р›Р°РЅРґС€Р°С„С‚;
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‚РѕР±СЂР°Р¶Р°С‚СЊРЎРµС‚РєСѓ = РСЃС‚РёРЅР°;
//РџРѕР»РµРћС‚С‡РµС‚Р°.РћС‚РѕР±СЂР°Р¶Р°С‚СЊР—Р°РіРѕР»РѕРІРєРё = РСЃС‚РёРЅР°;

Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	Р”РѕРїРЈСЃР»СѓРіРё.РЎСЃС‹Р»РєР° РљРђРљ РџР°РїРєР°,
                      |	Р”РѕРїРЈСЃР»СѓРіРё.РќРѕРјРµСЂРџРџ РљРђРљ РќРѕРјРµСЂРџРџ
                      |РР—
                      |	РЎРїСЂР°РІРѕС‡РЅРёРє.Р”РѕРїРЈСЃР»СѓРіРё РљРђРљ Р”РѕРїРЈСЃР»СѓРіРё
                      |Р“Р”Р•
                      |	Р”РѕРїРЈСЃР»СѓРіРё.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |	Р Р”РѕРїРЈСЃР»СѓРіРё.Р­С‚РѕР“СЂСѓРїРїР° = РРЎРўРРќРђ
                      |	Р Р”РѕРїРЈСЃР»СѓРіРё.Р РѕРґРёС‚РµР»СЊ = Р—РќРђР§Р•РќРР•(РЎРїСЂР°РІРѕС‡РЅРёРє.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°)
                      |
                      |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
                      |	РќРѕРјРµСЂРџРџ");

РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.РЎРѕСЂС‚РёСЂРѕРІР°С‚СЊ("РќРѕРјРµСЂРџРџ");

РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_Р РѕРґРёС‚РµР»СЊРЈСЃР»СѓРіРё.Р”РѕР±Р°РІРёС‚СЊ();
РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РџР°РїРєР° = РЎРїСЂР°РІРѕС‡РЅРёРєРё.Р”РѕРїРЈСЃР»СѓРіРё.РџСѓСЃС‚Р°СЏРЎСЃС‹Р»РєР°();

РћР±Р»Р°СЃС‚СЊР›РµРІРѕ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЁР°РїРєР°|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊР›РµРІРѕ, 0);

РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє = РћР±Р»Р°СЃС‚СЊР›РµРІРѕ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹; 

РћР±Р»Р°СЃС‚СЊРЁР°РїРєР° = РџРѕР»РµРћС‚С‡РµС‚Р°.РћР±Р»Р°СЃС‚СЊ("R1"); 
РџРѕР»РµРћС‚С‡РµС‚Р°.РџРѕРІС‚РѕСЂСЏС‚СЊРџСЂРёРџРµС‡Р°С‚РёРЎС‚СЂРѕРєРё = РћР±Р»Р°СЃС‚СЊРЁР°РїРєР°;

РџРѕР»РµРћС‚С‡РµС‚Р°.Р¤РёРєСЃР°С†РёСЏРЎРІРµСЂС…Сѓ = 2;
РџРѕР»РµРћС‚С‡РµС‚Р°.РќР°С‡Р°С‚СЊРђРІС‚РѕРіСЂСѓРїРїРёСЂРѕРІРєСѓРЎС‚СЂРѕРє();

//

РС‚РѕРіРёР”РµРЅСЊ = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°();
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РћРїР»Р°С‚С‹", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РљР°СЂС‚Р°", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°", 0);

РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹", 0);
РС‚РѕРіРёР”РµРЅСЊ.Р’СЃС‚Р°РІРёС‚СЊ("РЎСѓРјРјР°РћРїР»Р°С‚С‹РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРѕ", 0);

//
РћР±Р»Р°СЃС‚СЊР’РёРґРћРїР»Р°С‚С‹ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("Р—Р°РіРѕР»РѕРІРѕРєР’РёРґРћРїР»Р°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ"); 
РћР±Р»Р°СЃС‚СЊР’РёРґРћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р’РёРґРћРїР»Р°С‚С‹ = "РљР°СЃСЃР°";
РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊР’РёРґРћРїР»Р°С‚С‹, 0);

Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџСЂРёС…РѕРґ РљРђРљ РџСЂРёС…РѕРґ,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РљР°СЂС‚Р° РљРђРљ РЎСѓРјРјР°РљР°СЂС‚Р°,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ РљРђРљ РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРњ РљРђРљ РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРњ,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РќРѕРјРµСЂР§РµРєР°РљРљРњ РљРђРљ РќРѕРјРµСЂР§РµРєР°РљРљРњ,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџСЂРёС…РѕРґ
                      |			РўРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°
                      |		РРќРђР§Р• -РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°
                      |	РљРћРќР•Р¦ РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
                      |	Р•РЎРўР¬NULL(Р’РѕР·РІСЂР°С‚С‹.РЎСѓРјРјР°, 0) РљРђРљ РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚,
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р°РћРїР»Р°С‚С‹ РљРђРљ Р”Р°С‚Р°РћРїР»Р°С‚С‹,
                      |	Р’Р«Р‘РћР 
                      |		РљРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ = 0
                      |				Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РљР°СЂС‚Р° > 0
                      |			РўРћР“Р”Рђ 1
                      |		РРќРђР§Р• Р’Р«Р‘РћР 
                      |				РљРћР“Р”Рђ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ > 0
                      |						Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°РљР°СЂС‚Р° = 0
                      |					РўРћР“Р”Рђ 2
                      |				РРќРђР§Р• -1
                      |			РљРћРќР•Р¦
                      |	РљРћРќР•Р¦ РљРђРљ РўРёРїРћРїР»Р°С‚С‹
                      |РР—
                      |	Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚ РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚
                      |		Р›Р•Р’РћР• РЎРћР•Р”РРќР•РќРР• (Р’Р«Р‘Р РђРўР¬
                      |			РЎРЈРњРњРђ(РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСѓРјРјР°) РљРђРљ РЎСѓРјРјР°,
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚ РљРђРљ Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚
                      |		РР—
                      |			Р”РѕРєСѓРјРµРЅС‚.РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚ РљРђРљ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚
                      |		Р“Р”Р•
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |			Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџСЂРёС…РѕРґ = Р›РћР–Р¬
                      |		
                      |		РЎР“Р РЈРџРџРР РћР’РђРўР¬ РџРћ
                      |			РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚) РљРђРљ Р’РѕР·РІСЂР°С‚С‹
                      |		РџРћ РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РЎСЃС‹Р»РєР° = Р’РѕР·РІСЂР°С‚С‹.Р’РѕР·РІСЂР°С‚Р”РѕРєСѓРјРµРЅС‚
                      |Р“Р”Р•
                      |	РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р°РћРїР»Р°С‚С‹ >= &Р”Р°С‚Р°РћРїР»Р°С‚С‹C
                      |	Р РљР°СЃСЃРѕРІС‹Р№Р”РѕРєСѓРјРµРЅС‚.Р”Р°С‚Р°РћРїР»Р°С‚С‹ <= &Р”Р°С‚Р°РћРїР»Р°С‚С‹РџРѕ
                      |
                      |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
                      |	Р”Р°С‚Р°РћРїР»Р°С‚С‹,
                      |	РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРњ");

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћРїР»Р°С‚С‹C", Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ );
Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РћРїР»Р°С‚С‹РџРѕ", Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ );
РўР—_РћРїР»Р°С‚С‹ = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();	

РўР—_РћРїР»Р°С‚С‹.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°");
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР—_РћРїР»Р°С‚С‹ Р¦РёРєР»
	Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬ РџР•Р Р’Р«Р• 1
	                  |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° РљРђРљ РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°
	                  |РР—
	                  |	Р РµРіРёСЃС‚СЂРЎРІРµРґРµРЅРёР№.РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР° РљРђРљ РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°
	                  |Р“Р”Р•
	                  |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР° < &Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР°
	                  |
	                  |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
	                  |	РџСЂРѕС†РµРЅС‚С‹Р­РєРІР°Р№СЂРёРЅРіР°.Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР° РЈР‘Р«Р’");

	Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РЈСЃС‚Р°РЅРѕРІРєРёРџСЂРѕС†РµРЅС‚Р°Р­РєРІР°Р№СЂРёРЅРіР°", РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹);

	РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° = ?(РўР—.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0, 0, РўР—[0].РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°); 			
	
	РЎС‚СЂРѕРєР°.РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР° = РџСЂРѕС†РµРЅС‚Р­РєРІР°Р№СЂРёРЅРіР°;
РљРѕРЅРµС†Р¦РёРєР»Р°;
	
Р”Р°С‚Р°_Рџ = '00010101';
Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹ РР· РўР—_РћРїР»Р°С‚С‹ Р¦РёРєР»
	Р•СЃР»Рё РќР• РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = Р”Р°С‚Р°_Рџ РўРѕРіРґР°
		Р•СЃР»Рё Р”Р°С‚Р°_Рџ <> '00010101' РўРѕРіРґР°
			РС‚РѕРіРёР”РµРЅСЊРћРїР»Р°С‚С‹Р’С‹РІРѕРґ(РџРѕР»РµРћС‚С‡РµС‚Р°, РњР°РєРµС‚, РС‚РѕРіРёР”РµРЅСЊ, Р”Р°С‚Р°_Рџ);						
		РљРѕРЅРµС†Р•СЃР»Рё;		
			
		РћР±Р»Р°СЃС‚СЊР”Р°С‚Р°РћРїР»Р°С‚С‹ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("Р—Р°РіРѕР»РѕРІРѕРєР”Р°С‚Р°|РљРѕР»РѕРЅРєРёР›РµРІРѕ"); 
		РћР±Р»Р°СЃС‚СЊР”Р°С‚Р°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy");
		РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊР”Р°С‚Р°РћРїР»Р°С‚С‹, 1);
		
		Р”Р°С‚Р°_Рџ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹;
		
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = 0;
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ = 0;
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљР°СЂС‚Р° = 0;
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = 0;

		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹ = 0;
		РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРѕ = 0;
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ"); 
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy");
	
	Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ = "РљР°СЃСЃРѕРІС‹Р№ РґРѕРєСѓРјРµРЅС‚ " + РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.РќРѕРјРµСЂ + " РѕС‚ " + Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹.Р”Р°С‚Р°, "Р”Р¤=dd.MM.yy");
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ;
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р Р°СЃС€РёС„СЂРѕРІРєР° = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹;
	
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїРћРїР»Р°С‚С‹ = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РўРёРїРћРїР»Р°С‚С‹РќР°РёРјРµРЅРѕРІР°РЅРёРµ(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РўРёРїРћРїР»Р°С‚С‹);

	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”Р°С‚Р°РћРїР»Р°С‚С‹, "Р”Р¤=dd.MM.yy");
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРњ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РќРѕРјРµСЂРЎРјРµРЅС‹РљРљРњ;
	
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљР°СЂС‚Р° = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РљР°СЂС‚Р°;
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ;
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚;
	
	РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РћС‚С‡РµС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹);
	РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;
	
	Р’С‹РІРµРґРµРЅРЅР°СЏРћР»Р°СЃС‚СЊ = РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹, 2);
	
	РС‚РѕРіРёР”РµРЅСЊР”РѕР±Р°РІРёС‚СЊ(РС‚РѕРіРёР”РµРЅСЊ, РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹, РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ, РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РљР°СЂС‚Р°, РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°
		, 0, 0);
	
//
	Р—Р°РїСЂРѕСЃРџСЂРѕР¶РёРІР°РЅРёРµ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
	                                |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР° РљРђРљ Р—Р°СЏРІРєР°,
	                                |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСѓРјРјР°РћРїР»Р°С‚С‹ РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
	                                |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ РљРђРљ Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ,
	                                |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.Р¦РµРЅР° РљРђРљ Р¦РµРЅР°,
	                                |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.РљРѕР»РёС‡РµСЃС‚РІРѕ РљРђРљ РљРѕР»РёС‡РµСЃС‚РІРѕ,
	                                |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°,
	                                |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР°Р‘РµР·РЎРєРёРґРєРё РљРђРљ РЎСѓРјРјР°Р‘РµР·РЎРєРёРґРєРё,
	                                |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.РџСЂРѕС†РµРЅС‚РЎРєРёРґРєРёРљР»РёРµРЅС‚Р° РљРђРљ РџСЂРѕС†РµРЅС‚РЎРєРёРґРєРёРљР»РёРµРЅС‚Р°
	                                |РР—
	                                |	Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё
	                                |		Р’РќРЈРўР Р•РќРќР•Р• РЎРћР•Р”РРќР•РќРР• Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РџСЂРѕР¶РёРІР°РЅРёРµ РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ
	                                |		РџРћ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР° = Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.РЎСЃС‹Р»РєР°
	                                |			Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕР»РіРёР“РЈРР” = Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµРџСЂРѕР¶РёРІР°РЅРёРµ.Р“РЈРР”
	                                |Р“Р”Р•
	                                |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР°.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
	                                |	Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = &Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹
	                                |
	                                |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
	                                |	Р—Р°СЏРІРєР°,
	                                |	Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ");

	Р—Р°РїСЂРѕСЃРџСЂРѕР¶РёРІР°РЅРёРµ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹", РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹);
	РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ = Р—Р°РїСЂРѕСЃРџСЂРѕР¶РёРІР°РЅРёРµ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	
	РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚ = 0;
	Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ РР· РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ Р¦РёРєР»
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ"); 
		
		Р—Р°СЏРІРєР°РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ = " " + РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р—Р°СЏРІРєР°.РќРѕРјРµСЂР’Р РµР·РµСЂРІ + " / ";
		Р—Р°СЏРІРєР°РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ = Р—Р°СЏРІРєР°РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ + 
			"Р—Р°СЏРІРєР° " + РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р—Р°СЏРІРєР°.РќРѕРјРµСЂ + " РѕС‚ " + Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р—Р°СЏРІРєР°.Р”Р°С‚Р°, "Р”Р¤=dd.MM.yy");
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹ = Р—Р°СЏРІРєР°РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ;
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹Р Р°СЃС€РёС„СЂРѕРІРєР° = РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р—Р°СЏРІРєР°;
		
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°Р—Р°С‚СЂР°С‚ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ, "Р”Р¤=dd.MM.yy");
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР—Р°С‚СЂР°С‚ = "РџСЂРѕР¶РёРІР°РЅРёРµ";
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
		
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р—Р°С‚СЂР°С‚ = РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР°;
	
		РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹, 2);
	РљРѕРЅРµС†Р¦РёРєР»Р°;
	
	РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚ = РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚ + РўР—_РџСЂРѕР¶РёРІР°РЅРёРµ.РС‚РѕРі("РЎСѓРјРјР°РћРїР»Р°С‚С‹");
//

//
	Р—Р°РїСЂРѕСЃРЈСЃР»СѓРіРё = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
	                            |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР° РљРђРљ Р—Р°СЏРІРєР°,
	                            |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСѓРјРјР°РћРїР»Р°С‚С‹ РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
	                            |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.РЈСЃР»СѓРіР° РљРђРљ РЈСЃР»СѓРіР°,
	                            |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р¦РµРЅР° РљРђРљ Р¦РµРЅР°,
	                            |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕ РљРђРљ РљРѕР»РёС‡РµСЃС‚РІРѕ,
	                            |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРё РљРђРљ Р”Р°С‚Р°РЈСЃР»СѓРіРё,
	                            |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р¦РµРЅР° * Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.РљРѕР»РёС‡РµСЃС‚РІРѕ РљРђРљ РЎСѓРјРјР°
	                            |РР—
	                            |	Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё
	                            |		Р’РќРЈРўР Р•РќРќР•Р• РЎРћР•Р”РРќР•РќРР• Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р”РѕРїРЈСЃР»СѓРіРё РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё
	                            |		РџРћ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР° = Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.РЎСЃС‹Р»РєР°
	                            |			Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕР»РіРёР“РЈРР” = Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р“РЈРР”
	                            |Р“Р”Р•
	                            |	Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.РЎСЃС‹Р»РєР°.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
	                            |	Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = &Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹
	                            |	Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµР”РѕРїРЈСЃР»СѓРіРё.Р’РЎС‡РµС‚ = РРЎРўРРќРђ
	                            |
	                            |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
	                            |	Р—Р°СЏРІРєР°");

	Р—Р°РїСЂРѕСЃРЈСЃР»СѓРіРё.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹", РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹);
	РўР—_РЈСЃР»СѓРіРё = Р—Р°РїСЂРѕСЃРЈСЃР»СѓРіРё.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	
	Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё РР· РўР—_РЈСЃР»СѓРіРё Р¦РёРєР»
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ"); 
		
		Р—Р°СЏРІРєР°РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ = " " + РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р—Р°СЏРІРєР°.РќРѕРјРµСЂР’Р РµР·РµСЂРІ + " / ";
		Р—Р°СЏРІРєР°РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ = Р—Р°СЏРІРєР°РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ + 
			"Р—Р°СЏРІРєР° " + РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р—Р°СЏРІРєР°.РќРѕРјРµСЂ + " РѕС‚ " + Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р—Р°СЏРІРєР°.Р”Р°С‚Р°, "Р”Р¤=dd.MM.yy");
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹ = Р—Р°СЏРІРєР°РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ;
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹Р Р°СЃС€РёС„СЂРѕРІРєР° = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р—Р°СЏРІРєР°;
		
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°Р—Р°С‚СЂР°С‚ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРё, "Р”Р¤=dd.MM.yy");
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР—Р°С‚СЂР°С‚ = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЈСЃР»СѓРіР°;
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
		
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р—Р°С‚СЂР°С‚ = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЎСѓРјРјР°;
	
		РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹, 2);
	РљРѕРЅРµС†Р¦РёРєР»Р°;

	РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚ = РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚ + РўР—_РЈСЃР»СѓРіРё.РС‚РѕРі("РЎСѓРјРјР°РћРїР»Р°С‚С‹");
//
	
//
	Р—Р°РїСЂРѕСЃРљРѕРІРѕСЂРєРёРЅРі = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
	                               |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРєСѓРјРµРЅС‚С‹РћРїР»Р°С‚С‹.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°,
	                               |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРєСѓРјРµРЅС‚С‹РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ РљРђРљ Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹,
	                               |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРєСѓРјРµРЅС‚С‹РћРїР»Р°С‚С‹.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ РљРђРљ РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ,
	                               |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРєСѓРјРµРЅС‚С‹РћРїР»Р°С‚С‹.РЎСЃС‹Р»РєР°.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°Р—Р°С‚СЂР°С‚
	                               |РР—
	                               |	Р”РѕРєСѓРјРµРЅС‚.РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°.Р”РѕРєСѓРјРµРЅС‚С‹РћРїР»Р°С‚С‹ РљРђРљ РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРєСѓРјРµРЅС‚С‹РћРїР»Р°С‚С‹
	                               |Р“Р”Р•
	                               |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРєСѓРјРµРЅС‚С‹РћРїР»Р°С‚С‹.РЎСЃС‹Р»РєР°.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
	                               |	Р РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРєСѓРјРµРЅС‚С‹РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = &Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹");

	Р—Р°РїСЂРѕСЃРљРѕРІРѕСЂРєРёРЅРі.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹", РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹);
	РўР—_РљРѕРІРѕСЂРєРёРЅРі = Р—Р°РїСЂРѕСЃРљРѕРІРѕСЂРєРёРЅРі.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	
	Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РљРѕРІРѕСЂРєРёРЅРі РР· РўР—_РљРѕРІРѕСЂРєРёРЅРі Р¦РёРєР»
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ"); 
		
		Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ = "РљРѕРІРѕСЂРєРёРЅРі " + РЎС‚СЂРѕРєР°РљРѕРІРѕСЂРєРёРЅРі.РЎСЃС‹Р»РєР°.РќРѕРјРµСЂ + " РѕС‚ " + Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РљРѕРІРѕСЂРєРёРЅРі.РЎСЃС‹Р»РєР°.Р”Р°С‚Р°, "Р”Р¤=dd.MM.yy");
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹ = Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹РџСЂРµРґСЃС‚Р°РІР»РµРЅРёРµ;
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹Р Р°СЃС€РёС„СЂРѕРІРєР° = РЎС‚СЂРѕРєР°РљРѕРІРѕСЂРєРёРЅРі.РЎСЃС‹Р»РєР°;
		
		//РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°Р—Р°С‚СЂР°С‚ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРё, "Р”Р¤=dd.MM.yy");
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР—Р°С‚СЂР°С‚ = "РљРѕРІРѕСЂРєРёРЅРі";
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РљРѕРІРѕСЂРєРёРЅРі.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
		
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р—Р°С‚СЂР°С‚ = РЎС‚СЂРѕРєР°РљРѕРІРѕСЂРєРёРЅРі.РЎСѓРјРјР°Р—Р°С‚СЂР°С‚;
	
		РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹, 2);
	РљРѕРЅРµС†Р¦РёРєР»Р°;

	РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚ = РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚ + РўР—_РљРѕРІРѕСЂРєРёРЅРі.РС‚РѕРі("РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ");
	
//
	Р—Р°РїСЂРѕСЃРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
	                                     |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РљРѕРІРѕСЂРєРёРЅРі.РЎСЃС‹Р»РєР° РљРђРљ РЎС‡РµС‚,
	                                     |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РљРѕРІРѕСЂРєРёРЅРі.РЎСѓРјРјР°РћРїР»Р°С‚С‹ РљРђРљ РЎСѓРјРјР°РћРїР»Р°С‚С‹,
	                                     |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРїРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі.РЈСЃР»СѓРіР° РљРђРљ РЈСЃР»СѓРіР°,
	                                     |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРїРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі.Р¦РµРЅР° РљРђРљ Р¦РµРЅР°,
	                                     |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРїРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі.РљРѕР»РёС‡РµСЃС‚РІРѕ РљРђРљ РљРѕР»РёС‡РµСЃС‚РІРѕ,
	                                     |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРїРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі.Р”Р°С‚Р°РЈСЃР»СѓРіРё РљРђРљ Р”Р°С‚Р°РЈСЃР»СѓРіРё,
	                                     |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРїРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі.РЎСѓРјРјР° РљРђРљ РЎСѓРјРјР°
	                                     |РР—
	                                     |	Р”РѕРєСѓРјРµРЅС‚.РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°.Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РљРѕРІРѕСЂРєРёРЅРі РљРђРљ РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РљРѕРІРѕСЂРєРёРЅРі
	                                     |		Р’РќРЈРўР Р•РќРќР•Р• РЎРћР•Р”РРќР•РќРР• Р”РѕРєСѓРјРµРЅС‚.РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°.Р”РѕРїРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі РљРђРљ РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРїРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі
	                                     |		РџРћ РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РљРѕРІРѕСЂРєРёРЅРі.РЎСЃС‹Р»РєР° = РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРїРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі.РЎСЃС‹Р»РєР°
	                                     |			Р РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РљРѕРІРѕСЂРєРёРЅРі.Р“РЈРР”Р”РѕР»РіРё = РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р”РѕРїРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі.Р“РЈРР”
	                                     |Р“Р”Р•
	                                     |	РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РљРѕРІРѕСЂРєРёРЅРі.РЎСЃС‹Р»РєР°.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
	                                     |	Р РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РљРѕРІРѕСЂРєРёРЅРі.Р­С‚РѕРЈСЃР»СѓРіР° = РРЎРўРРќРђ
	                                     |	Р РљРѕРІРѕСЂРєРёРЅРіРЎС‡РµС‚Р°Р Р°СЃРїСЂРµРґРµР»РµРЅРёРµРћРїР»Р°С‚РљРѕРІРѕСЂРєРёРЅРі.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹ = &Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹
	                                     |
	                                     |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
	                                     |	РЎС‡РµС‚");

	Р—Р°РїСЂРѕСЃРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹", РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹);
	РўР—_РЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі = Р—Р°РїСЂРѕСЃРЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();
	
	Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё РР· РўР—_РЈСЃР»СѓРіРёРљРѕРІРѕСЂРєРёРЅРі Р¦РёРєР»
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ"); 
		
		Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹ = " " + РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЎС‡РµС‚.РљРѕРІРѕСЂРєРёРЅРіР—Р°СЏРІРєР°.РљРѕРІРѕСЂРєРёРЅРіРќРѕРјРµСЂ + " / ";
		Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹ = Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹ + 
			"РЎС‡РµС‚ " + РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЎС‡РµС‚.РќРѕРјРµСЂ + " РѕС‚ " + Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЎС‡РµС‚.Р”Р°С‚Р°, "Р”Р¤=dd.MM.yy");
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹ = Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹;
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”РѕРєСѓРјРµРЅС‚Р—Р°С‚СЂР°С‚С‹Р Р°СЃС€РёС„СЂРѕРІРєР° = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЎС‡РµС‚;
		
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р°Р—Р°С‚СЂР°С‚ = Р¤РѕСЂРјР°С‚(РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРё, "Р”Р¤=dd.MM.yy");
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР—Р°С‚СЂР°С‚ = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЈСЃР»СѓРіР°;
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
		
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р—Р°С‚СЂР°С‚ = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.РЎСѓРјРјР°;
	
		РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹, 2);
	РљРѕРЅРµС†Р¦РёРєР»Р°;

	РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚ = РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚ + РўР—_РЈСЃР»СѓРіРё.РС‚РѕРі("РЎСѓРјРјР°РћРїР»Р°С‚С‹");
	//РЎСѓРјРјР°РќРµР Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ - РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚;
	Р•СЃР»Рё РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РџСЂРёС…РѕРґ РўРѕРіРґР°
		РЎСѓРјРјР°РќРµР Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ - РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.РЎСѓРјРјР°Р’РѕР·РІСЂР°С‚ - РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚;
	РРЅР°С‡Рµ
		РЎСѓРјРјР°РќРµР Р°СЃРїСЂРµРґРµР»РµРЅРѕ = 0;
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	Р•СЃР»Рё РЎСѓРјРјР°РќРµР Р°СЃРїСЂРµРґРµР»РµРЅРѕ <> 0 РўРѕРіРґР° 
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ"); 
		
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР—Р°С‚СЂР°С‚ = "РќРµ СЂР°СЃРїСЂРµРґРµР»РµРЅРѕ";
		РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РЎСѓРјРјР°РќРµР Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
		
		Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ = РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊРЎС‚СЂРѕРєР°Р—Р°С‚СЂР°С‚С‹, 2);
		Р”Р»СЏ РРЅРґРµРєСЃ = 0 РџРѕ РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє - 1 Р¦РёРєР» 
			РџРѕР»РµРћС‚С‡РµС‚Р°.РћР±Р»Р°СЃС‚СЊ(Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.Р’РµСЂС…, РРЅРґРµРєСЃ, Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.РќРёР·, РРЅРґРµРєСЃ + 1).РЁСЂРёС„С‚ 
			 //= РќРѕРІС‹Р№ РЁСЂРёС„С‚(РћР±Р»Р°СЃС‚СЊРћС„РѕСЂРјР»РµРЅРёСЏ.РЁСЂРёС„С‚, РћР±Р»Р°СЃС‚СЊРћС„РѕСЂРјР»РµРЅРёСЏ.РЁСЂРёС„С‚.Р Р°Р·РјРµСЂ, ,РСЃС‚РёРЅР°);
			 	= РќРѕРІС‹Р№ РЁСЂРёС„С‚("Arial", 8, ,РСЃС‚РёРЅР°);
			РџРѕР»РµРћС‚С‡РµС‚Р°.РћР±Р»Р°СЃС‚СЊ(Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.Р’РµСЂС…, РРЅРґРµРєСЃ, Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.РќРёР·, РРЅРґРµРєСЃ + 1).Р¦РІРµС‚РўРµРєСЃС‚Р° = РќРѕРІС‹Р№ Р¦РІРµС‚(255, 0, 0);
		РљРѕРЅРµС†Р¦РёРєР»Р°;

	РљРѕРЅРµС†Р•СЃР»Рё;
	
	РС‚РѕРіРёР”РµРЅСЊР”РѕР±Р°РІРёС‚СЊ(РС‚РѕРіРёР”РµРЅСЊ, 0, 0, 0, 0
		, РЎСѓРјРјР°РС‚РѕРіРѕР”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚, РЎСѓРјРјР°РќРµР Р°СЃРїСЂРµРґРµР»РµРЅРѕ);
РљРѕРЅРµС†Р¦РёРєР»Р°;

Р•СЃР»Рё Р”Р°С‚Р°_Рџ <> '00010101' РўРѕРіРґР°
	РС‚РѕРіРёР”РµРЅСЊРћРїР»Р°С‚С‹Р’С‹РІРѕРґ(РџРѕР»РµРћС‚С‡РµС‚Р°, РњР°РєРµС‚, РС‚РѕРіРёР”РµРЅСЊ, Р”Р°С‚Р°_Рџ);						
РљРѕРЅРµС†Р•СЃР»Рё;	

Р’РѕР·РІСЂР°С‚ РџРѕР»РµРћС‚С‡РµС‚Р°;
РљРѕРЅРµС†Р¤СѓРЅРєС†РёРё

//
РџСЂРѕС†РµРґСѓСЂР° РС‚РѕРіРёР”РµРЅСЊРћРїР»Р°С‚С‹Р’С‹РІРѕРґ(РџРѕР»РµРћС‚С‡РµС‚Р°, РњР°РєРµС‚, РС‚РѕРіРёР”РµРЅСЊ, Р”Р°С‚Р°_Рџ)
РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РС‚РѕРіРёР”РµРЅСЊРћРїР»Р°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ");

Р”Р°С‚Р° = Р¤РѕСЂРјР°С‚(Р”Р°С‚Р°_Рџ, "Р”Р¤='Рґ.РњРњРњ РіРі'" );  
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.Р”Р°С‚Р° = Р”Р°С‚Р°;		

РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РљР°СЂС‚Р° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљР°СЂС‚Р°;
РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;
РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 1);

Р•СЃР»Рё РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹ <> 0 РўРѕРіРґР°
	РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РС‚РѕРіРёР”РµРЅСЊР—Р°С‚СЂР°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР—Р°С‚СЂР°С‚ = "Р—Р°С‚СЂР°С‚С‹";
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹;
	РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 1);
РљРѕРЅРµС†Р•СЃР»Рё;

Р•СЃР»Рё РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРѕ <> 0 РўРѕРіРґР°
	РћР±Р»Р°СЃС‚СЊ = РњР°РєРµС‚.РџРѕР»СѓС‡РёС‚СЊРћР±Р»Р°СЃС‚СЊ("РС‚РѕРіРёР”РµРЅСЊР—Р°С‚СЂР°С‚С‹|РљРѕР»РѕРЅРєРёР›РµРІРѕ");
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РўРёРїР—Р°С‚СЂР°С‚ = "РќРµ СЂР°СЃРїСЂРµРґРµР»РµРЅРѕ";
	РћР±Р»Р°СЃС‚СЊ.РџР°СЂР°РјРµС‚СЂС‹.РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРѕ;
	Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ = РџРѕР»РµРћС‚С‡РµС‚Р°.Р’С‹РІРµСЃС‚Рё(РћР±Р»Р°СЃС‚СЊ, 1);

	РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє = РћР±Р»Р°СЃС‚СЊ.РЁРёСЂРёРЅР°РўР°Р±Р»РёС†С‹;
	Р”Р»СЏ РРЅРґРµРєСЃ = 0 РџРѕ РљРѕР»РёС‡РµСЃС‚РІРѕРљРѕР»РѕРЅРѕРє - 1 Р¦РёРєР» 
		РџРѕР»РµРћС‚С‡РµС‚Р°.РћР±Р»Р°СЃС‚СЊ(Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.Р’РµСЂС…, РРЅРґРµРєСЃ, Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.РќРёР·, РРЅРґРµРєСЃ + 1).РЁСЂРёС„С‚ 
		 //= РќРѕРІС‹Р№ РЁСЂРёС„С‚(РћР±Р»Р°СЃС‚СЊРћС„РѕСЂРјР»РµРЅРёСЏ.РЁСЂРёС„С‚, РћР±Р»Р°СЃС‚СЊРћС„РѕСЂРјР»РµРЅРёСЏ.РЁСЂРёС„С‚.Р Р°Р·РјРµСЂ, ,РСЃС‚РёРЅР°);
		 	= РќРѕРІС‹Р№ РЁСЂРёС„С‚("Arial", 8, ,РСЃС‚РёРЅР°);
		РџРѕР»РµРћС‚С‡РµС‚Р°.РћР±Р»Р°СЃС‚СЊ(Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.Р’РµСЂС…, РРЅРґРµРєСЃ, Р’С‹РІРµРґРµРЅРЅР°СЏРћР±Р»Р°СЃС‚СЊ.РќРёР·, РРЅРґРµРєСЃ + 1).Р¦РІРµС‚РўРµРєСЃС‚Р° = РќРѕРІС‹Р№ Р¦РІРµС‚(255, 0, 0);
	РљРѕРЅРµС†Р¦РёРєР»Р°;
РљРѕРЅРµС†Р•СЃР»Рё;
РљРѕРЅРµС†РџСЂРѕС†РµРґСѓСЂС‹

РџСЂРѕС†РµРґСѓСЂР° РС‚РѕРіРёР”РµРЅСЊР”РѕР±Р°РІРёС‚СЊ(РС‚РѕРіРёР”РµРЅСЊ, РЎСѓРјРјР°РћРїР»Р°С‚С‹, РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ, РЎСѓРјРјР°РљР°СЂС‚Р°, РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°
		, РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹, РЎСѓРјРјР°РћРїР»Р°С‚С‹РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРѕ)

РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹ + РЎСѓРјРјР°РћРїР»Р°С‚С‹;
РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ + РЎСѓРјРјР°РќР°Р»РёС‡РЅС‹Рµ ;
РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљР°СЂС‚Р° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РљР°СЂС‚Р° + РЎСѓРјРјР°РљР°СЂС‚Р° ;
РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР° + РЎСѓРјРјР°Р­РєРІР°Р№СЂРёРЅРіР°;

РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹ + РЎСѓРјРјР°РћРїР»Р°С‚С‹Р—Р°С‚СЂР°С‚С‹;
РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРѕ = РС‚РѕРіРёР”РµРЅСЊ.РЎСѓРјРјР°РћРїР»Р°С‚С‹РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРѕ  + РЎСѓРјРјР°РћРїР»Р°С‚С‹РќРµСЂР°СЃРїСЂРµРґРµР»РµРЅРѕ ;
РљРѕРЅРµС†РџСЂРѕС†РµРґСѓСЂС‹
//

////
Р¤СѓРЅРєС†РёСЏ РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ(Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ, Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ) Р­РєСЃРїРѕСЂС‚

Р—Р°РїСЂРѕСЃ = РќРѕРІС‹Р№ Р—Р°РїСЂРѕСЃ("Р’Р«Р‘Р РђРўР¬
                      |	Р“СЂСѓРїРїРѕРІС‹РµРЎС‡РµС‚Р°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚С‹Р”РѕР»РіРё.РЎСЃС‹Р»РєР° РљРђРљ Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚,
                      |	Р“СЂСѓРїРїРѕРІС‹РµРЎС‡РµС‚Р°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚С‹Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі РљРђРљ Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі,
                      |	Р“СЂСѓРїРїРѕРІС‹РµРЎС‡РµС‚Р°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚С‹Р”РѕР»РіРё.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљРѕРЅС‚СЂР°РіРµРЅС‚ РљРђРљ РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљРѕРЅС‚СЂР°РіРµРЅС‚
					  |РР—
                      |	Р”РѕРєСѓРјРµРЅС‚.Р“СЂСѓРїРїРѕРІС‹РµРЎС‡РµС‚Р°.РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚С‹Р”РѕР»РіРё РљРђРљ Р“СЂСѓРїРїРѕРІС‹РµРЎС‡РµС‚Р°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚С‹Р”РѕР»РіРё
                      |		Р’РќРЈРўР Р•РќРќР•Р• РЎРћР•Р”РРќР•РќРР• РЎРїСЂР°РІРѕС‡РЅРёРє.РљР»РёРµРЅС‚С‹ РљРђРљ РљР»РёРµРЅС‚С‹
                      |		РџРћ Р“СЂСѓРїРїРѕРІС‹РµРЎС‡РµС‚Р°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚С‹Р”РѕР»РіРё.РЎСЃС‹Р»РєР°.РљРѕРЅС‚СЂР°РіРµРЅС‚ = РљР»РёРµРЅС‚С‹.РЎСЃС‹Р»РєР°
                      |Р“Р”Р•
                      |	Р“СЂСѓРїРїРѕРІС‹РµРЎС‡РµС‚Р°РљРѕРјРёСЃСЃРёСЏР”РѕРєСѓРјРµРЅС‚С‹Р”РѕР»РіРё.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі Р’
                      |			(Р’Р«Р‘Р РђРўР¬
                      |				Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РЎСЃС‹Р»РєР° РљРђРљ РЎСЃС‹Р»РєР°
                      |			РР—
                      |				Р”РѕРєСѓРјРµРЅС‚.Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ РљРђРљ Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ
                      |			Р“Р”Р•
                      |				(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.РџРѕРјРµС‚РєР°РЈРґР°Р»РµРЅРёСЏ = Р›РћР–Р¬
                      |						Р РќР•(Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р РµР·РµСЂРІРЎ < &Р”Р°С‚Р°РЎ
                      |								Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р РµР·РµСЂРІРџРѕ < &Р”Р°С‚Р°РЎ)
                      |					РР›Р Р—Р°СЏРІРєР°РќР°Р‘СЂРѕРЅРёСЂРѕРІР°РЅРёРµ.Р РµР·РµСЂРІРЎ > &Р”Р°С‚Р°РџРѕ))
                      |
                      |РЈРџРћР РЇР”РћР§РРўР¬ РџРћ
                      |	Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚,
                      |	Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі");

Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РЎ", Р”Р°С‚Р°РћС‚С‡РµС‚Р°РЎ);
Р—Р°РїСЂРѕСЃ.РЈСЃС‚Р°РЅРѕРІРёС‚СЊРџР°СЂР°РјРµС‚СЂ("Р”Р°С‚Р°РџРѕ", Р”Р°С‚Р°РћС‚С‡РµС‚Р°РџРѕ);

РўР— = Р—Р°РїСЂРѕСЃ.Р’С‹РїРѕР»РЅРёС‚СЊ().Р’С‹РіСЂСѓР·РёС‚СЊ();

РўР—_РљРѕРјРёСЃСЃРёСЏ = РќРѕРІС‹Р№ РўР°Р±Р»РёС†Р°Р—РЅР°С‡РµРЅРёР№;
РўР—_РљРѕРјРёСЃСЃРёСЏ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚");
РўР—_РљРѕРјРёСЃСЃРёСЏ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р—Р°СЏРІРєР°");
РўР—_РљРѕРјРёСЃСЃРёСЏ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ");
РўР—_РљРѕРјРёСЃСЃРёСЏ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°");

//РўР—_РљРѕРјРёСЃСЃРёСЏ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё");


РўР—_Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р° = РќРѕРІС‹Р№ РўР°Р±Р»РёС†Р°Р—РЅР°С‡РµРЅРёР№;
РўР—_Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р°.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°");

РЎСѓРјРјР°РћРїР»Р°С‚С‹ = 0;
РћСЃС‚Р°С‚РѕРєРћРїР»Р°С‚С‹ = 0;
Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚_Рџ = РќРµРѕРїСЂРµРґРµР»РµРЅРѕ;

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР° РР· РўР— Р¦РёРєР»
	Р•СЃР»Рё РЎС‚СЂРѕРєР°.Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚ <> Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚_Рџ РўРѕРіРґР°  
		Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚_Рџ = РЎС‚СЂРѕРєР°.Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚;
		
		РўР—_Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р°.РћС‡РёСЃС‚РёС‚СЊ();
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹ РР· Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚_Рџ.Р”РѕРєСѓРјРµРЅС‚С‹РћРїР»Р°С‚С‹ Р¦РёРєР»
			Р•СЃР»Рё РўРёРїР—РЅС‡(РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹) = РўРёРї("Р”РѕРєСѓРјРµРЅС‚РЎСЃС‹Р»РєР°.РџСЂРѕС‡РёРµРћРїР»Р°С‚С‹") РўРѕРіРґР° 
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р° = РўР—_Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р°.Р”РѕР±Р°РІРёС‚СЊ();
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р° = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РћРїР»Р°С‚С‹;
			РљРѕРЅРµС†Р•СЃР»Рё;
		РљРѕРЅРµС†Р¦РёРєР»Р°;
		
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹ РР· Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚_Рџ.Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶РёРљРѕРЅС‚СЂР°РіРµРЅС‚Сѓ Р¦РёРєР»
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р° = РўР—_Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р°.Р”РѕР±Р°РІРёС‚СЊ();
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р° = РЎС‚СЂРѕРєР°РћРїР»Р°С‚С‹.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°;
		РљРѕРЅРµС†Р¦РёРєР»Р°;
	РљРѕРЅРµС†Р•СЃР»Рё;
	
	Р•СЃР»Рё РЎС‚СЂРѕРєР°.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљРѕРЅС‚СЂР°РіРµРЅС‚ = 0 РўРѕРіРґР°
		РЎСѓРјРјР°РС‚РѕРіРѕРџСЂРѕР¶РёРІР°РЅРёРµ = РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі.РџСЂРѕР¶РёРІР°РЅРёРµ.РС‚РѕРі("РЎСѓРјРјР°Р‘РµР·РЎРєРёРґРєРё");
		
		//РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё = РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі.Р‘СЂРѕРЅРёСЂСѓРµС‚.РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё;
		РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё = Р”РѕРєСѓРјРµРЅС‚С‹РЎРµСЂРІРµСЂ.РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРёРљР»РёРµРЅС‚Р°(РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі.Р‘СЂРѕРЅРёСЂСѓРµС‚, РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі.Р РµР·РµСЂРІРЎ); //, РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі.Р’2Р’);
		
		РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = Р”РѕРєСѓРјРµРЅС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё(РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі, РЎСѓРјРјР°РС‚РѕРіРѕРџСЂРѕР¶РёРІР°РЅРёРµ
			, РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі.РЎС‡РµС‚Р°, РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі.РЎС‡РµС‚Р°Р”РµС‚Р°Р»СЊРЅРѕР”РѕР»РіРё, РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі.Р”РѕРїРЈСЃР»СѓРіРё, РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё);
		
	РРЅР°С‡Рµ
		РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = РЎС‚СЂРѕРєР°.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљРѕРЅС‚СЂР°РіРµРЅС‚;
	РљРѕРЅРµС†Р•СЃР»Рё;		
	
	Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р° РР· РўР—_Р”РѕРєСѓРјРµРЅС‚С‹РџР»Р°С‚РµР¶Р° Р¦РёРєР»
		РћСЃС‚Р°С‚РѕРєРћРїР»Р°С‚С‹ = РЎС‚СЂРѕРєР°Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°.РЎСѓРјРјР°;
		
		РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_РљРѕРјРёСЃСЃРёСЏ.Р”РѕР±Р°РІРёС‚СЊ();
		
		РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚ = РЎС‚СЂРѕРєР°.Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚;
		РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р—Р°СЏРІРєР° = РЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚Р”РѕР»Рі;
		РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р° = РЎС‚СЂРѕРєР°Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°;
		
		Р•СЃР»Рё РћСЃС‚Р°С‚РѕРєРћРїР»Р°С‚С‹ >= РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё РўРѕРіРґР°  
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
			
			РћСЃС‚Р°С‚РѕРєРћРїР»Р°С‚С‹ = РћСЃС‚Р°С‚РѕРєРћРїР»Р°С‚С‹ - РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
			РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = 0;
			
			РџСЂРµСЂРІР°С‚СЊ;
		РРЅР°С‡Рµ
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РћСЃС‚Р°С‚РѕРєРћРїР»Р°С‚С‹;
			РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё - РћСЃС‚Р°С‚РѕРєРћРїР»Р°С‚С‹;
			
			РћСЃС‚Р°С‚РѕРєРћРїР»Р°С‚С‹ = 0;
		РљРѕРЅРµС†Р•СЃР»Рё;
	РљРѕРЅРµС†Р¦РёРєР»Р°;
РљРѕРЅРµС†Р¦РёРєР»Р°;

РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ = РќРѕРІС‹Р№ РўР°Р±Р»РёС†Р°Р—РЅР°С‡РµРЅРёР№;
РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚");
РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р—Р°СЏРІРєР°");
РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р”Р°С‚Р°");
РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР—Р°С‡РµС‚Сѓ");
РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ");
РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ.РљРѕР»РѕРЅРєРё.Р”РѕР±Р°РІРёС‚СЊ("Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°");

Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ РР· РўР—_РљРѕРјРёСЃСЃРёСЏ Р¦РёРєР»
	
	РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
	
	Р•СЃР»Рё РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.РџСЂРѕР¶РёРІР°РЅРёРµ.РљРѕР»РёС‡РµСЃС‚РІРѕ() = 0 РўРѕРіРґР°
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё РР· РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р”РѕРїРЈСЃР»СѓРіРё Р¦РёРєР»
			Р•СЃР»Рё РќР• РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р’РЎС‡РµС‚ РўРѕРіРґР° РџСЂРѕРґРѕР»Р¶РёС‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;      
			
			РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°("Р”РѕР»РіРёР“РЈРР”", РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р“РЈРР”);
			Р—Р°СЏРІРєР°РЎС‡РµС‚Р°Р”РµС‚Р°Р»СЊРЅРѕР”РѕР»РіРё = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.РЎС‡РµС‚Р°Р”РµС‚Р°Р»СЊРЅРѕР”РѕР»РіРё.Р’С‹РіСЂСѓР·РёС‚СЊ(РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё);
			Р—Р°СЏРІРєР°Р”РѕРїРЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р”РѕРїРЈСЃР»СѓРіРё.Р’С‹РіСЂСѓР·РёС‚СЊ(РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё);
			
			//РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚.РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё;
			РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё = Р”РѕРєСѓРјРµРЅС‚С‹РЎРµСЂРІРµСЂ.РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРёРљР»РёРµРЅС‚Р°(РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚, РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р РµР·РµСЂРІРЎ); //, РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р’2Р’);
			
			РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = Р”РѕРєСѓРјРµРЅС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё(РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°, 0
				, РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.РЎС‡РµС‚Р°, Р—Р°СЏРІРєР°РЎС‡РµС‚Р°Р”РµС‚Р°Р»СЊРЅРѕР”РѕР»РіРё, Р—Р°СЏРІРєР°Р”РѕРїРЈСЃР»СѓРіРё, РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё);
			
			Р•СЃР»Рё РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = 0 РўРѕРіРґР° РџСЂРѕРґРѕР»Р¶РёС‚СЊ; РљРѕРЅРµС†Р•СЃР»Рё;
					
			РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ.Р”РѕР±Р°РІРёС‚СЊ();
			
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚ = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚;
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р—Р°СЏРІРєР° = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°;
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р° = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°;
			
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р”Р°С‚Р° = РЎС‚СЂРѕРєР°РЈСЃР»СѓРіРё.Р”Р°С‚Р°РЈСЃР»СѓРіРё;
			
			РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
			
			Р•СЃР»Рё РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё >= РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ РўРѕРіРґР°  
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР—Р°С‡РµС‚Сѓ = РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
				
				РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё - РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
			РРЅР°С‡Рµ
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР—Р°С‡РµС‚Сѓ = РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
				
				РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = 0;
				
				РџСЂРµСЂРІР°С‚СЊ;
			РљРѕРЅРµС†Р•СЃР»Рё;
		РљРѕРЅРµС†Р¦РёРєР»Р°;
		
	РРЅР°С‡Рµ		
		
		Р”Р»СЏ РљР°Р¶РґРѕРіРѕ РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ РР· РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.РџСЂРѕР¶РёРІР°РЅРёРµ Р¦РёРєР»
			РќРѕРІР°СЏРЎС‚СЂРѕРєР° = РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ.Р”РѕР±Р°РІРёС‚СЊ();
			
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚ = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р“СЂСѓРїРїРѕРІРѕР№РЎС‡РµС‚;
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р—Р°СЏРІРєР° = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°;

			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р° = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р”РѕРєСѓРјРµРЅС‚РџР»Р°С‚РµР¶Р°;
			
			РќРѕРІР°СЏРЎС‚СЂРѕРєР°.Р”Р°С‚Р° = РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ;
			
			РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°("Р”Р°С‚Р°Р”РѕР»Рі", РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ);
			Р—Р°СЏРІРєР°РЎС‡РµС‚Р°Р”РµС‚Р°Р»СЊРЅРѕР”РѕР»РіРё = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.РЎС‡РµС‚Р°Р”РµС‚Р°Р»СЊРЅРѕР”РѕР»РіРё.Р’С‹РіСЂСѓР·РёС‚СЊ(РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё);
		
			РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё = РќРѕРІС‹Р№ РЎС‚СЂСѓРєС‚СѓСЂР°("Р”Р°С‚Р°РЈСЃР»СѓРіРё", РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.Р”РµРЅСЊРџСЂРѕР¶РёРІР°РЅРёСЏ);
			Р—Р°СЏРІРєР°Р”РѕРїРЈСЃР»СѓРіРё = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р”РѕРїРЈСЃР»СѓРіРё.Р’С‹РіСЂСѓР·РёС‚СЊ(РћС‚Р±РѕСЂРЎС‚СЂРѕРєРё);
		
			//РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё = РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚.РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё;
			РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё = Р”РѕРєСѓРјРµРЅС‚С‹РЎРµСЂРІРµСЂ.РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРёРљР»РёРµРЅС‚Р°(РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р‘СЂРѕРЅРёСЂСѓРµС‚, РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р РµР·РµСЂРІРЎ); //, РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.Р’2Р’);
			
			РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = Р”РѕРєСѓРјРµРЅС‚С‹РЎРµСЂРІРµСЂ.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё(РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°, РЎС‚СЂРѕРєР°РџСЂРѕР¶РёРІР°РЅРёРµ.РЎСѓРјРјР°Р‘РµР·РЎРєРёРґРєРё
				, РЎС‚СЂРѕРєР°РљРѕРјРёСЃСЃРёСЏ.Р—Р°СЏРІРєР°.РЎС‡РµС‚Р°, Р—Р°СЏРІРєР°РЎС‡РµС‚Р°Р”РµС‚Р°Р»СЊРЅРѕР”РѕР»РіРё, Р—Р°СЏРІРєР°Р”РѕРїРЈСЃР»СѓРіРё, РџСЂРѕС†РµРЅС‚РљРѕРјРёСЃСЃРёРё);
			
			РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
			
			Р•СЃР»Рё РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё >= РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ РўРѕРіРґР°  
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР—Р°С‡РµС‚Сѓ = РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
				
				РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё - РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ;
			РРЅР°С‡Рµ
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°Р Р°СЃРїСЂРµРґРµР»РµРЅРѕ = РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
				РќРѕРІР°СЏРЎС‚СЂРѕРєР°.РЎСѓРјРјР°РљРѕРјРёСЃСЃРёРёРљР—Р°С‡РµС‚Сѓ = РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё;
				
				РћСЃС‚Р°С‚РѕРєРЎСѓРјРјР°РљРѕРјРёСЃСЃРёРё = 0;
				
				РџСЂРµСЂРІР°С‚СЊ;
			РљРѕРЅРµС†Р•СЃР»Рё;
		РљРѕРЅРµС†Р¦РёРєР»Р°;	
	РљРѕРЅРµС†Р•СЃР»Рё;
РљРѕРЅРµС†Р¦РёРєР»Р°;

Р’РѕР·РІСЂР°С‚ РўР—_РљРѕРјРёСЃСЃРёСЏР Р°СЃРїСЂРµРґРµР»РµРЅРёРµ;	
РљРѕРЅРµС†Р¤СѓРЅРєС†РёРё

////

// +++++++++++++++++++++++++++++++++++++++++++++++++++



