// + Кнопка 23
&НаКлиенте
Процедура Кнопка23Нажатие___(Элемент)
	//Документы.ПоступлениеТоваров.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеТоваров(Команда)
ОткрытьФорму("Документ.ПоступлениеТоваров.ФормаСписка",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка 23

// + Кнопка 29
&НаКлиенте
Процедура Кнопка24Нажатие__(Элемент) // Все верно 
	//Отчеты.ОтчетПоОстаткамТМЦ.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОстаткамТМЦ(Команда)
ОткрытьФорму("Отчет.ОтчетПоОстаткамТМЦ.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка 29

// + Кнопка 30  
&НаКлиенте
Процедура Кнопка25Нажатие__(Элемент) // Все верно 
	//Отчеты.ОтчетПоПродажам.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПродажам(Команда)
ОткрытьФорму("Отчет.ОтчетПоПродажам.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка 30 


// + Кнопка 31  
&НаКлиенте
Процедура Кнопка27Нажатие___(Элемент)  // Все верно
	//Документы.Инвентарицация.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Инвентаризация(Команда)
ОткрытьФорму("Документ.Инвентарицация.ФормаСписка",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

// + Кнопка32
&НаКлиенте
Процедура НеОплаты___(Элемент)
	//Отчеты.НеОплаты.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура НеОплаты(Команда)
ОткрытьФорму("Отчет.НеОплаты.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

//// Бар

// + Кнопка23
&НаКлиенте
Процедура ПоступлениеБар__(Элемент)
	//Документы.ПоступлениеТоваровБара.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеТоваровБара(Команда)
ОткрытьФорму("Документ.ПоступлениеТоваровБара.ФормаСписка",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры
// - Кнопка23


// + Кнопка24
&НаКлиенте
Процедура ОстаткиБар___(Элемент)
//отчеты.ОтчетПоОстаткамТМЦБар.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоОстаткамТМЦБар(Команда)
ОткрытьФорму("Отчет.ОтчетПоОстаткамТМЦБар.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
// - Кнопка24

// + Кнопка25
&НаКлиенте
Процедура ПродажиБар___(Элемент)
	//отчеты.ОтчетПоПродажамБара.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПродажамБара(Команда)
ОткрытьФорму("Отчет.ОтчетПоПродажамБара.Форма",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
// - Кнопка25

// + Кнопка27
&НаКлиенте
Процедура ИнвБар(Элемент)
	//Документы.ИнвентарицацияБара.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияБара(Команда)
ОткрытьФорму("Документ.ИнвентарицацияБара.ФормаСписка",,ЭтаФорма
	, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
// + Кнопка27


///// Не используются  //////

//Процедура Кассовые(Элемент)
//	документы.КассовыйДокумент.ПолучитьФормуСписка().Открыть();
//КонецПроцедуры

//Процедура Банковские(Элемент)
//	документы.ВыпискаБанка.ПолучитьФормуСписка().Открыть();
//КонецПроцедуры

//Процедура Отчет(Элемент)
//	Отчеты.ЕжемесячныеФинансы.ПолучитьФорму().Открыть();
//КонецПроцедуры

//Процедура Кнопка15Нажатие(Элемент)
//	Документы.ГашениеДолгов.ПолучитьФормуСписка().Открыть();
//КонецПроцедуры

//Процедура ОтчетПоПоказателям(Элемент)
//	Отчеты.ОтчетПоПоказателям.ПолучитьФорму().Открыть();
//КонецПроцедуры

//Процедура СатПоНомерам(Элемент)
//	Отчеты.СтатистикаПоНомерам.ПолучитьФорму().Открыть();
//КонецПроцедуры

//Процедура Надпись18Нажатие(Элемент)
//	// Вставить содержимое обработчика.
//КонецПроцедуры

//Процедура ПроданыеН(Элемент)
//	Отчеты.ПроданыеНомера.ПолучитьФорму().Открыть();
//КонецПроцедуры

//Процедура ЗакрД(Элемент)
//	ДЗ=Документы.ЗакрытиеДней.СоздатьДокумент();
//	ДЗ.ПолучитьФорму().Открыть();
//КонецПроцедуры

//Процедура Аудит(Элемент)
//	Документы.ЕжедневныйАудит.ПолучитьФормуСписка().Открыть();
//КонецПроцедуры

//Процедура Датчики(Элемент)
//	Отчеты.ОтчетПоДатчикам.ПолучитьФорму().Открыть();
//КонецПроцедуры

//Процедура Настройки(Элемент)
//	Константы.ПолучитьФорму().Открыть();
//КонецПроцедуры

//Процедура Кнопка26Нажатие(Элемент)
//	Справочники.Товары.ПолучитьФормуСписка().Открыть();
//КонецПроцедуры




