
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ТекстДляСМС", ТекстДляСМС); 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекстДляСМСБронирование(Команда)
МесенджерВключен = МесенджерСервер.МесенджерВключен();

Если МесенджерВключен Тогда
	ТекстДляСМС = ЭтаФорма.ВладелецФормы.ЗаполнитьТекстДляWhatsAppБронирование();	
Иначе
	ТекстДляСМС = ЭтаФорма.ВладелецФормы.ЗаполнитьТекстДляСМСБронирование();	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекстДляСМСОтменаБронирования(Команда)
ТекстДляСМС = ЭтаФорма.ВладелецФормы.ЗаполнитьТекстДляСМСОтменаБронирования();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаКоманда(Команда)
ОповеститьОВыборе("");	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
ОповеститьОВыборе(ТекстДляСМС);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПодтвержденияЗаполнитьТекст(Команда)
ТекстДляСМС = ЗаполнитьТекстЗапросПодтверждения();
КонецПроцедуры


&НаКлиенте
Функция ЗаполнитьТекстЗапросПодтверждения() Экспорт
//КатегорияНомераНаименование = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.КатегорияНомера, "Наименование");

//ТекстДляСМС = "Отмена бронирования:" + КатегорияНомераНаименование + ", " + Строка(Объект.КолВоЧеловек) + " мест с " +
//            Формат(Объект.РезервС, "ДФ=dd.MM")+ " по " +
//            Формат(Объект.РезервПо, "ДФ=dd.MM")+ " ";

ТекстДляСМС = "Дорогой гость!
|Хотели бы подтвердить Ваш приезд.
|Подскажите,  бронирование актуально? 
|Во сколько планируете заселение?
|
|Будем рады ответить на интересующие Вас  вопросы. До скорой встречи!" 
+ Символы.ПС;

Если НастройкиСервер.ЭтоДомСоветов() Тогда
	ТекстДляСМС = ТекстДляСМС + "Администратор отеля 'Дом советов'";
ИначеЕсли НастройкиСервер.ЭтоЛайв() Тогда
	ТекстДляСМС = ТекстДляСМС + "Администратор сity-отеля Live ";
ИначеЕсли НастройкиСервер.ЭтоРеноме() Тогда
	ТекстДляСМС = ТекстДляСМС + "Администратор отеля Renomme ";
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда
	ТекстДляСМС = ТекстДляСМС + "Администратор отеля 'Street Art' ";
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда
	ТекстДляСМС = ТекстДляСМС + "Администратор отель Чехов ";
Иначе
	ТекстДляСМС = ТекстДляСМС + "Администратор отеля ";
КонецЕсли;

Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
ОрганизацияТекстДляСМС = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Организация, "ТекстДляСМС"); 
ТекстДляСМС = ТекстДляСМС + Строка(ОрганизацияТекстДляСМС);
			
Возврат ТекстДляСМС;
КонецФункции






