
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//ОбменСГорничными = Константы.ОбменСГорничными.Получить();
//Элементы.ФормаРасход.Видимость = НЕ ОбменСГорничными;
КонецПроцедуры

//
&НаКлиенте
Процедура СоздатьДокументРасход(Команда)
Если ПроверкаДатыРасчета() Тогда Возврат; КонецЕсли;

СоздатьДокументРасходНаСервере(ДатаРасчета);
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументРасходНаСервере(ДатаРасчета)
ДатаС = НачалоМесяца(ДатаРасчета);
ДатаПо = КонецМесяца(ДатаРасчета);
	
ОбменГорничныеСервер.ЗагрузитьОбслуживаниеНомеров(ДатаС, ДатаПо, "");
	
ДатаСебестоимость = КонецМесяца(ДатаРасчета); 	
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеОбслуживаниеНомераМинибар.Ссылка КАК Ссылка,
                      |	ГорничныеОбслуживаниеНомераМинибар.НоменклатураМинибара КАК НоменклатураМинибара,
                      |	ГорничныеОбслуживаниеНомераМинибар.НоменклатураМинибараКодВыгрузка КАК НоменклатураМинибараКодВыгрузка,
                      |	ГорничныеОбслуживаниеНомераМинибар.НоменклатураМинибараНаименованиеВыгрузка КАК НоменклатураМинибараНаименованиеВыгрузка,
                      |	ГорничныеОбслуживаниеНомераМинибар.Количество КАК Количество,
                      |	ГорничныеОбслуживаниеНомераМинибар.Цена КАК Цена,
                      |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.ДатаОбслуживания КАК ДатаОбслуживания
                      |ИЗ
                      |	Документ.ГорничныеОбслуживаниеНомера.Минибар КАК ГорничныеОбслуживаниеНомераМинибар
                      |ГДЕ
                      |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И КОНЕЦПЕРИОДА(ГорничныеОбслуживаниеНомераМинибар.Ссылка.ДатаОбслуживания, МЕСЯЦ) = &ДатаСебестоимость
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.ДатаОбслуживания,
                      |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.НомерОбслуживания_пп,
                      |	НоменклатураМинибара,
                      |	НоменклатураМинибараНаименованиеВыгрузка");	

Запрос.УстановитьПараметр("ДатаСебестоимость", ДатаСебестоимость);

ТЗ_строки = Запрос.Выполнить().Выгрузить();

Если  ТЗ_строки.Количество() = 0 Тогда
	Сообщить("Расхода минибара за период нет");
	
	Возврат;
КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарРасход.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.МинибарРасход КАК МинибарРасход
                      |ГДЕ
                      |	МинибарРасход.ПометкаУдаления = ЛОЖЬ
                      |	И МинибарРасход.Программно = ИСТИНА
                      |	И МинибарРасход.ДатаДокументаРасхода = &ДатаДокумента");

Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(ДатаСебестоимость));

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	ДокументРасходОбъект = Выборка.Ссылка.ПолучитьОбъект();
	ДокументРасходОбъект.Расход.Очистить();
	
	ДокументРасходОбъект.Комментарий = "Обновлен программно " + ТекущаяДата();
Иначе
	ДокументРасходОбъект = Документы.МинибарРасход.СоздатьДокумент();
	ДокументРасходОбъект.Дата = ТекущаяДата();
	ДокументРасходОбъект.ДатаДокументаРасхода = ДатаСебестоимость;
	ДокументРасходОбъект.Программно = Истина;
	
	ДокументРасходОбъект.Комментарий = "Создан программно " + ТекущаяДата();
КонецЕсли;

Для Каждого Строка Из ТЗ_Строки Цикл
	НоваяСтрока = ДокументРасходОбъект.Расход.Добавить();
	
	НоваяСтрока.ДатаРасхода = Строка.ДатаОбслуживания;
	НоваяСтрока.Номенклатура = Строка.НоменклатураМинибара;
	НоваяСтрока.Количество = Строка.Количество;
	НоваяСтрока.Цена = Строка.Цена;
	
	НоваяСтрока.ДокументИсточник = Строка.Ссылка;
	НоваяСтрока.НомерОтель = Строка.Ссылка.НомерВРезерв;
КонецЦикла;

ДокументРасходОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
//

&НаКлиенте
Функция ПроверкаДатыРасчета()
Если НЕ ЗначениеЗаполнено(ДатаРасчета) Тогда
	ПоказатьПредупреждение(,"Заполните Дату расчета ...");
	
	Возврат Истина;
КонецЕсли;	

Возврат Ложь;
КонецФункции

//
&НаКлиенте
Процедура ОткрытьДокументРасход(Команда)
ДокументРасход = ПолучитьДокументРасход();	
Если ДокументРасход = Неопределено Тогда 
	ПоказатьПредупреждение(, "Нет итогового документа расход");
	
	Возврат;
КонецЕсли;

ПараметрыФормы = Новый Структура("Ключ", ДокументРасход); 	
	
ОткрытьФорму("Документ.МинибарРасход.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументРасход()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарРасход.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.МинибарРасход КАК МинибарРасход
                      |ГДЕ
                      |	МинибарРасход.ПометкаУдаления = ЛОЖЬ
                      |	И МинибарРасход.Списание = ЛОЖЬ
                      |	И МинибарРасход.Программно = ИСТИНА
                      |	И МинибарРасход.ДатаДокументаРасхода = &ДатаДокумента");

ДатаДокумента = НачалоДня(КонецМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	Возврат Неопределено;
Иначе
	Возврат ТЗ[0].Ссылка;
КонецЕсли;
КонецФункции
//

//
&НаКлиенте
Процедура ОтчетМесяц(Команда)
Если ПроверкаДатыРасчета() Тогда Возврат; КонецЕсли;

ОтчетМесяцНаСервере();

Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ОтчетКоличество;
КонецПроцедуры

&НаСервере
Процедура ОтчетМесяцНаСервере()
ТабДок = Новый ТабличныйДокумент;

ОтчетОбъект = РеквизитФормыВЗначение("Объект");
МакетИмя = "МакетМинибарОтчет";
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

// + Шапка
Область = Макет.ПолучитьОбласть("Шапка|Лево");

Область.Параметры.ШапкаОстатки = "Остатки на " + Формат(ДатаОстатки, "ДФ=dd.MM.yy");

ТабДок.Вывести(Область);

ДатаСебестоимость = КонецМесяца(ДатаРасчета);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |МинибарПриход.ДатаДокументаПрихода КАК ДатаДокументаПрихода
                      |ИЗ
                      |	Документ.МинибарПриход КАК МинибарПриход
                      |ГДЕ
                      |	МинибарПриход.ПометкаУдаления = ЛОЖЬ
                      |	И КОНЕЦПЕРИОДА(МинибарПриход.ДатаДокументаПрихода, МЕСЯЦ) = &ДатаДокумента
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	МинибарПриход.ДатаДокументаПрихода
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаДокументаПрихода");

Запрос.УстановитьПараметр("ДатаДокумента", ДатаСебестоимость); 

ТЗ_ПриходШапка = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ_ПриходШапка Цикл
	Область = Макет.ПолучитьОбласть("Шапка|Приход");
	
	Область.Параметры.ДатаПрихода = "Приход" + Символы.ПС + Формат(Строка.ДатаДокументаПрихода, "ДФ=dd.MM.yy");
	
	ТабДок.Присоединить(Область);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарРасходРасход.ДатаРасхода КАК ДатаРасхода,
                      |	МинибарРасходРасход.ТипСписания КАК ТипСписания
                      |ИЗ
                      |	Документ.МинибарРасход.Расход КАК МинибарРасходРасход
                      |ГДЕ
                      |	МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И МинибарРасходРасход.Ссылка.Списание = ИСТИНА
                      |	И КОНЕЦПЕРИОДА(МинибарРасходРасход.Ссылка.ДатаДокументаРасхода, МЕСЯЦ) = &ДатаДокумента
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	МинибарРасходРасход.ДатаРасхода,
                      |	МинибарРасходРасход.ТипСписания
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаРасхода,
                      |	МинибарРасходРасход.ТипСписания.Номер_пп,
                      |	МинибарРасходРасход.ТипСписания.Наименование");

Запрос.УстановитьПараметр("ДатаДокумента", ДатаСебестоимость); 

ТЗ_СписаниеШапка = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ_СписаниеШапка Цикл
	Область = Макет.ПолучитьОбласть("Шапка|Списание");
	
	Область.Параметры.ДатаСписания = "Списание" + Символы.ПС + Формат(Строка.ДатаРасхода, "ДФ=dd.MM.yy") 
		+ Символы.ПС + ?(ЗначениеЗаполнено(Строка.ТипСписания), Строка.ТипСписания, "-");
	
	ТабДок.Присоединить(Область);
КонецЦикла;

ДатаКонецМесяца = ДатаСебестоимость;

Дата_П = НачалоМесяца(ДатаСебестоимость);
Пока Дата_П < ДатаКонецМесяца Цикл
	Область = Макет.ПолучитьОбласть("Шапка|Расход");
	
	Область.Параметры.ДатаРасхода = Формат(Дата_П, "ДФ=dd.MM");
	
	ТабДок.Присоединить(Область);
	
	Дата_П = Дата_П + 24 * 60 * 60;
КонецЦикла;

//Область = Макет.ПолучитьОбласть("Шапка|Право");
//ТабДок.Присоединить(Область);

// - Шапка

//// + Строки

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	НоменклатураМиниБараСправочник.Ссылка КАК Номенклатура,
                      |	МинибарСебестоимостьСрезПоследних.НоменклатураМинибара КАК НоменклатураМинибара,
                      |	ЕСТЬNULL(МинибарСебестоимостьСрезПоследних.Количество, 0) КАК НачалоМесяцаКоличество,
                      |	ЕСТЬNULL(МинибарСебестоимостьСрезПоследних.Сумма, 0) КАК НачалоМесяцаСумма
                      |ИЗ
                      |	Справочник.НоменклатураМиниБара КАК НоменклатураМиниБараСправочник
                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинибарСебестоимость.СрезПоследних(&Период, ) КАК МинибарСебестоимостьСрезПоследних
                      |		ПО НоменклатураМиниБараСправочник.Ссылка = МинибарСебестоимостьСрезПоследних.НоменклатураМинибара
                      |ГДЕ
                      |	НоменклатураМиниБараСправочник.ПометкаУдаления = ЛОЖЬ
                      |	И НоменклатураМиниБараСправочник.НеИспользуется = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НоменклатураМиниБараСправочник.Номер_пп_Отчет,
                      |	НоменклатураМиниБараСправочник.Наименование");

Запрос.УстановитьПараметр("Период", ДатаСебестоимость); 

ТЗ_Номенклатура = Запрос.Выполнить().Выгрузить();
//

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	НАЧАЛОПЕРИОДА(МинибарПриходПриход.Ссылка.ДатаДокументаПрихода, ДЕНЬ) КАК ДатаДокументаПрихода,
                      |	МинибарПриходПриход.Номенклатура КАК Номенклатура,
                      |	СУММА(МинибарПриходПриход.Количество) КАК Количество,
                      |	СУММА(МинибарПриходПриход.Количество * МинибарПриходПриход.Цена) КАК Сумма
                      |ИЗ
                      |	Документ.МинибарПриход.Приход КАК МинибарПриходПриход
                      |ГДЕ
                      |	МинибарПриходПриход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И МинибарПриходПриход.Ссылка.ДатаДокументаПрихода >= &ДН
                      |	И МинибарПриходПриход.Ссылка.ДатаДокументаПрихода <= &ДК
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	НАЧАЛОПЕРИОДА(МинибарПриходПриход.Ссылка.ДатаДокументаПрихода, ДЕНЬ),
                      |	МинибарПриходПриход.Номенклатура
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	МинибарПриходПриход.Номенклатура.Номер_пп_Отчет,
                      |	МинибарПриходПриход.Номенклатура.Наименование,
                      |	ДатаДокументаПрихода");

Запрос.УстановитьПараметр("ДН", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДК", КонецМесяца(ДатаРасчета));

ТЗ_Приход = Запрос.Выполнить().Выгрузить();


Запрос.УстановитьПараметр("ДН", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДК", НачалоДня(ДатаОстатки));

ТЗ_ПриходНаДату = Запрос.Выполнить().Выгрузить();
//


Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарРасходРасход.ДатаРасхода КАК ДатаРасхода,
                      |	МинибарРасходРасход.Номенклатура КАК Номенклатура,
                      |	СУММА(МинибарРасходРасход.Количество * МинибарРасходРасход.Цена) КАК Сумма,
                      |	СУММА(МинибарРасходРасход.Количество) КАК Количество
                      |ИЗ
                      |	Документ.МинибарРасход.Расход КАК МинибарРасходРасход
                      |ГДЕ
                      |	МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И МинибарРасходРасход.Ссылка.Списание = ЛОЖЬ
                      |	И МинибарРасходРасход.ДатаРасхода >= &ДН
                      |	И МинибарРасходРасход.ДатаРасхода <= &ДК
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	МинибарРасходРасход.Номенклатура,
                      |	МинибарРасходРасход.ДатаРасхода
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	МинибарРасходРасход.Номенклатура.Номер_пп_Отчет,
                      |	МинибарРасходРасход.Номенклатура.Наименование,
                      |	ДатаРасхода");

Запрос.УстановитьПараметр("ДН", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДК", КонецМесяца(ДатаРасчета));

ТЗ_Расход = Запрос.Выполнить().Выгрузить();

Запрос.УстановитьПараметр("ДН", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДК", НачалоДня(ДатаОстатки));

ТЗ_РасходНаДату = Запрос.Выполнить().Выгрузить();
//

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарРасходРасход.Номенклатура КАК Номенклатура,
                      |	СУММА(МинибарРасходРасход.Количество * МинибарРасходРасход.Цена) КАК Сумма,
                      |	СУММА(МинибарРасходРасход.Количество) КАК Количество
                      |ИЗ
                      |	Документ.МинибарРасход.Расход КАК МинибарРасходРасход
                      |ГДЕ
                      |	МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И МинибарРасходРасход.Ссылка.Списание = ИСТИНА
                      |	И МинибарРасходРасход.ДатаРасхода >= &ДН
                      |	И МинибарРасходРасход.ДатаРасхода <= &ДК
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	МинибарРасходРасход.Номенклатура
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	МинибарРасходРасход.Номенклатура.Номер_пп_Отчет,
                      |	МинибарРасходРасход.Номенклатура.Наименование");

Запрос.УстановитьПараметр("ДН", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДК", КонецМесяца(ДатаРасчета));

ТЗ_СписаниеИтого = Запрос.Выполнить().Выгрузить();

Запрос.УстановитьПараметр("ДН", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДК", НачалоДня(ДатаОстатки));
ТЗ_СписаниеИтогоНаДату = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарРасходРасход.ДатаРасхода КАК ДатаРасхода,
                      |	МинибарРасходРасход.Номенклатура КАК Номенклатура,
                      |	СУММА(МинибарРасходРасход.Количество * МинибарРасходРасход.Цена) КАК Сумма,
                      |	СУММА(МинибарРасходРасход.Количество) КАК Количество,
                      |	МинибарРасходРасход.ТипСписания КАК ТипСписания
                      |ИЗ
                      |	Документ.МинибарРасход.Расход КАК МинибарРасходРасход
                      |ГДЕ
                      |	МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И МинибарРасходРасход.Ссылка.Списание = ИСТИНА
                      |	И КОНЕЦПЕРИОДА(МинибарРасходРасход.ДатаРасхода, МЕСЯЦ) = &ДатаДокумента
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	МинибарРасходРасход.Номенклатура,
                      |	МинибарРасходРасход.ДатаРасхода,
                      |	МинибарРасходРасход.ТипСписания
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	МинибарРасходРасход.Номенклатура.Номер_пп_Отчет,
                      |	МинибарРасходРасход.Номенклатура.Наименование,
                      |	ДатаРасхода,
                      |	МинибарРасходРасход.ТипСписания.Номер_пп,
                      |	МинибарРасходРасход.ТипСписания.Наименование");

Запрос.УстановитьПараметр("ДатаДокумента", ДатаСебестоимость);

ТЗ_Списание = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоНомеров
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд
                      |ГДЕ
                      |	НомернойФонд.ПометкаУдаления = ЛОЖЬ");

ТЗ_Номеров = Запрос.Выполнить().Выгрузить();

Для Каждого СтрокаНоменклатура Из ТЗ_Номенклатура Цикл
// + Лево	
	Область = Макет.ПолучитьОбласть("Строка|Лево");
	
	Область.Параметры.Номенклатура = СтрокаНоменклатура.Номенклатура;
	
	Строка_Номеров = ТЗ_Номеров[0];
	ВНомерах = Строка_Номеров.КоличествоНомеров * 1; 
	Область.Параметры.ВНомерах = ВНомерах;
	
	СкладНачалоМесяца = СтрокаНоменклатура.НачалоМесяцаКоличество - ВНомерах;
	Область.Параметры.СкладНачалоМесяца = СкладНачалоМесяца;
	
	Если СкладНачалоМесяца < 0 Тогда
		СкладНачало_НомерКолонки = 2;
		Область.Область(1, СкладНачало_НомерКолонки, 1, СкладНачало_НомерКолонки).ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;	
		
	ОтборСтроки = Новый Структура("Номенклатура", СтрокаНоменклатура.Номенклатура);
	ТЗ_П = ТЗ_Приход.Скопировать(ОтборСтроки, "Количество");
	ПриходМесяц = ТЗ_П.Итог("Количество");
	Область.Параметры.ПриходМесяц = ПриходМесяц;
	
	ОтборСтроки = Новый Структура("Номенклатура", СтрокаНоменклатура.Номенклатура);
	ТЗ_П = ТЗ_Расход.Скопировать(ОтборСтроки, "Количество");
	РасходМесяц = ТЗ_П.Итог("Количество");
	
	ОтборСтроки = Новый Структура("Номенклатура", СтрокаНоменклатура.Номенклатура);
	ТЗ_П = ТЗ_СписаниеИтого.Скопировать(ОтборСтроки, "Количество");
	СписаниеМесяц = ТЗ_П.Итог("Количество");
	
	Область.Параметры.РасходМесяц = РасходМесяц;
	Область.Параметры.СписаниеМесяц = СписаниеМесяц;
	
	КонецМесяца = СкладНачалоМесяца + ВНомерах + ПриходМесяц - РасходМесяц - СписаниеМесяц; 
	Область.Параметры.КонецМесяца = КонецМесяца;
	
	Если КонецМесяца < 0 Тогда
		КонецМесяца_НомерКолонки = 5;
		Область.Область(1, КонецМесяца_НомерКолонки, 1, КонецМесяца_НомерКолонки).ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;

	//
	Если ЗначениеЗаполнено(ДатаОстатки) Тогда
		ОтборСтроки = Новый Структура("Номенклатура", СтрокаНоменклатура.Номенклатура);
		ТЗ_П = ТЗ_ПриходНаДату.Скопировать(ОтборСтроки, "Количество");
		ПриходМесяцНаДату = ТЗ_П.Итог("Количество");
		Область.Параметры.ПриходМесяц = ПриходМесяц;
		
		ОтборСтроки = Новый Структура("Номенклатура", СтрокаНоменклатура.Номенклатура);
		ТЗ_П = ТЗ_РасходНаДату.Скопировать(ОтборСтроки, "Количество");
		РасходМесяцНаДату = ТЗ_П.Итог("Количество");
		
		ОтборСтроки = Новый Структура("Номенклатура", СтрокаНоменклатура.Номенклатура);
		ТЗ_П = ТЗ_СписаниеИтогоНаДату.Скопировать(ОтборСтроки, "Количество");
		СписаниеМесяцНаДату = ТЗ_П.Итог("Количество");

		ОстаткиНаДату = СкладНачалоМесяца + ПриходМесяцНаДату - РасходМесяцНаДату - СписаниеМесяцНаДату; 
		Область.Параметры.ОстаткиНаДату = ОстаткиНаДату;
	КонецЕсли;

	ТабДок.Вывести(Область);
//	- Лево

// + Приход	
	Для Каждого Строка_ПриходШапка Из ТЗ_ПриходШапка Цикл
		
		Область_Приход = Макет.ПолучитьОбласть("Строка|Приход");
		
		ОтборСтроки = Новый Структура("Номенклатура, ДатаДокументаПрихода", СтрокаНоменклатура.Номенклатура, Строка_ПриходШапка.ДатаДокументаПрихода);
		НайденныеСтроки = ТЗ_Приход.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			
			Область_Приход.Параметры.Приход = НайденнаяСтрока.Количество;
		КонецЕсли;
		
		ТабДок.Присоединить(Область_Приход);
	КонецЦикла;
// - Приход

// + Списание 
	Для Каждого Строка_СписаниеШапка Из ТЗ_СписаниеШапка Цикл
		
		Область_Приход = Макет.ПолучитьОбласть("Строка|Списание");
		
		ОтборСтроки = Новый Структура("Номенклатура, ДатаРасхода, ТипСписания"
			, СтрокаНоменклатура.Номенклатура, Строка_СписаниеШапка.ДатаРасхода, Строка_СписаниеШапка.ТипСписания);
		НайденныеСтроки = ТЗ_Списание.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			
			Область_Приход.Параметры.Списание = НайденнаяСтрока.Количество;
		КонецЕсли;
		
		ТабДок.Присоединить(Область_Приход);
	КонецЦикла;
// - Списание

// + Расход
	Дата_П = НачалоМесяца(ДатаСебестоимость);
	Пока Дата_П < ДатаКонецМесяца Цикл
		
		Область_Расход = Макет.ПолучитьОбласть("Строка|Расход");
		
		ОтборСтроки = Новый Структура("Номенклатура, ДатаРасхода", СтрокаНоменклатура.Номенклатура, Дата_П);
		НайденныеСтроки = ТЗ_Расход.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			
			Область_Расход.Параметры.Расход = НайденнаяСтрока.Количество;
		КонецЕсли;
		
		ТабДок.Присоединить(Область_Расход);
		
		Дата_П = Дата_П + 24 * 60 * 60;
	КонецЦикла;
// - Расход	

КонецЦикла;
// - Строки

ПолеОтчетаКоличество.Очистить();
ПолеОтчетаКоличество.Вывести(ТабДок);
КонецПроцедуры
//

//
&НаКлиенте
Процедура Прибыль(Команда)
Если ПроверкаДатыРасчета() Тогда Возврат; КонецЕсли;
	
ПрибыльНаСервере();

Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.Прибыль;
КонецПроцедуры

&НаСервере
Процедура ПрибыльНаСервере()
ТабДок = Новый ТабличныйДокумент;

ОтчетОбъект = РеквизитФормыВЗначение("Объект");
МакетИмя = "МакетМинибарПрибыль";
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

ДатаСебестоимость = КонецМесяца(ДатаРасчета);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	НоменклатураМиниБараСправочник.Ссылка КАК Номенклатура,
                      |	ЕСТЬNULL(МинибарСебестоимостьСрезПоследних.Количество, 0) КАК НачалоКоличество,
                      |	ЕСТЬNULL(МинибарСебестоимостьСрезПоследних.Сумма, 0) КАК НачалоСумма,
                      |	ЕСТЬNULL(Приход.Количество, 0) КАК ПриходКоличество,
                      |	ЕСТЬNULL(Приход.Сумма, 0) КАК ПриходСумма,
                      |	ЕСТЬNULL(Расход.Количество, 0) КАК РасходКоличество,
                      |	ЕСТЬNULL(Расход.Сумма, 0) КАК РасходСумма,
                      |	ЕСТЬNULL(Списание.Количество, 0) КАК СписаниеКоличество,
                      |	ЕСТЬNULL(Списание.Сумма, 0) КАК СписаниеСумма
                      |ИЗ
                      |	Справочник.НоменклатураМиниБара КАК НоменклатураМиниБараСправочник
                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинибарСебестоимость.СрезПоследних(&Период, ) КАК МинибарСебестоимостьСрезПоследних
                      |		ПО НоменклатураМиниБараСправочник.Ссылка = МинибарСебестоимостьСрезПоследних.НоменклатураМинибара
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			МинибарПриходПриход.Номенклатура КАК Номенклатура,
                      |			СУММА(МинибарПриходПриход.Количество) КАК Количество,
                      |			СУММА(МинибарПриходПриход.Количество * МинибарПриходПриход.Цена) КАК Сумма
                      |		ИЗ
                      |			Документ.МинибарПриход.Приход КАК МинибарПриходПриход
                      |		ГДЕ
                      |			МинибарПриходПриход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |			И КОНЕЦПЕРИОДА(МинибарПриходПриход.Ссылка.ДатаДокументаПрихода, МЕСЯЦ) = &Период
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			МинибарПриходПриход.Номенклатура) КАК Приход
                      |		ПО НоменклатураМиниБараСправочник.Ссылка = Приход.Номенклатура
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			МинибарРасходРасход.Номенклатура КАК Номенклатура,
                      |			СУММА(МинибарРасходРасход.Количество) КАК Количество,
                      |			СУММА(МинибарРасходРасход.Количество * МинибарРасходРасход.Цена) КАК Сумма
                      |		ИЗ
                      |			Документ.МинибарРасход.Расход КАК МинибарРасходРасход
                      |		ГДЕ
                      |			МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |			И МинибарРасходРасход.Ссылка.Списание = ЛОЖЬ
                      |			И КОНЕЦПЕРИОДА(МинибарРасходРасход.ДатаРасхода, МЕСЯЦ) = &Период
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			МинибарРасходРасход.Номенклатура) КАК Расход
                      |		ПО НоменклатураМиниБараСправочник.Ссылка = Расход.Номенклатура
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			МинибарРасходРасход.Номенклатура КАК Номенклатура,
                      |			СУММА(МинибарРасходРасход.Количество) КАК Количество,
                      |			СУММА(МинибарРасходРасход.Количество * МинибарРасходРасход.Цена) КАК Сумма
                      |		ИЗ
                      |			Документ.МинибарРасход.Расход КАК МинибарРасходРасход
                      |		ГДЕ
                      |			МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |			И МинибарРасходРасход.Ссылка.Списание = ИСТИНА
                      |			И КОНЕЦПЕРИОДА(МинибарРасходРасход.ДатаРасхода, МЕСЯЦ) = &Период
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			МинибарРасходРасход.Номенклатура,
                      |			МинибарРасходРасход.Ссылка.Списание) КАК Списание
                      |		ПО (НоменклатураМиниБараСправочник.Ссылка = Списание.Номенклатура)
                      |ГДЕ
                      |	НоменклатураМиниБараСправочник.ПометкаУдаления = ЛОЖЬ
                      |	И НоменклатураМиниБараСправочник.НеИспользуется = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НоменклатураМиниБараСправочник.Номер_пп_Отчет,
                      |	НоменклатураМиниБараСправочник.Наименование");

Запрос.УстановитьПараметр("Период", ДатаСебестоимость); 

ТЗ_Номенклатура = Запрос.Выполнить().Выгрузить();

Область = Макет.ПолучитьОбласть("Шапка");

ТабДок.Вывести(Область);

Итоги = Новый Структура;
Итоги.Вставить("Прибыль", 0);
Для Каждого Строка_Номенклатура Из ТЗ_Номенклатура Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.Номенклатура = Строка_Номенклатура.Номенклатура;
	Область.Параметры.НачалоКоличество = Строка_Номенклатура.НачалоКоличество;
	Область.Параметры.НачалоСумма = Строка_Номенклатура.НачалоСумма;
	Область.Параметры.РасходКоличество = Строка_Номенклатура.РасходКоличество;
	Область.Параметры.РасходСумма = Строка_Номенклатура.РасходСумма;
	Область.Параметры.ПриходКоличество = Строка_Номенклатура.ПриходКоличество;
	Область.Параметры.ПриходСумма = Строка_Номенклатура.ПриходСумма;
	
	Если Строка_Номенклатура.НачалоКоличество + Строка_Номенклатура.ПриходКоличество > 0 Тогда
		ЦенаСписания = (Строка_Номенклатура.НачалоСумма + Строка_Номенклатура.ПриходСумма)
			/ (Строка_Номенклатура.НачалоКоличество + Строка_Номенклатура.ПриходКоличество);
		СебестоимостьРасход = Окр(ЦенаСписания * Строка_Номенклатура.РасходКоличество, 2);
		СебестоимостьСписание = Окр(ЦенаСписания * Строка_Номенклатура.СписаниеКоличество, 2);	
	Иначе		
		ЦенаСписания = 0;
		СебестоимостьРасход = 0;
		СебестоимостьСписание = 0;
	КонецЕсли;	
	
	Область.Параметры.СписаниеКоличество = Строка_Номенклатура.СписаниеКоличество;
	//Область.Параметры.СписаниеСумма = Строка_Номенклатура.СписаниеКоличество * ЦенаСписания;
	Область.Параметры.СписаниеСумма = СебестоимостьСписание;
		
	Выручка = Строка_Номенклатура.РасходСумма;
	Прибыль = Выручка - СебестоимостьРасход - СебестоимостьСписание;
	Прибыль = Окр(Прибыль);
	
	Область.Параметры.Прибыль = Прибыль;
	
	ТабДок.Вывести(Область);
	
	Итоги.Прибыль = Итоги.Прибыль + Прибыль;	
КонецЦикла;

Область = Макет.ПолучитьОбласть("Итоги");
Область.Параметры.Прибыль = Итоги.Прибыль;
ТабДок.Вывести(Область);

ПолеОтчетаПрибыль.Очистить();
ПолеОтчетаПрибыль.Вывести(ТабДок);
КонецПроцедуры

&НаСервере
Процедура ПрибыльНаСервере_1()
ТабДок = Новый ТабличныйДокумент;

ОтчетОбъект = РеквизитФормыВЗначение("Объект");
МакетИмя = "МакетМинибарПрибыль";
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

ДатаСебестоимость = КонецМесяца(ДатаРасчета);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	НоменклатураМиниБараСправочник.Ссылка КАК Номенклатура,
                      |	ЕСТЬNULL(МинибарСебестоимостьСрезПоследних.Количество, 0) КАК НачалоКоличество,
                      |	ЕСТЬNULL(МинибарСебестоимостьСрезПоследних.Сумма, 0) КАК НачалоСумма,
                      |	ЕСТЬNULL(Приход.Количество, 0) КАК ПриходКоличество,
                      |	ЕСТЬNULL(Приход.Сумма, 0) КАК ПриходСумма,
                      |	ЕСТЬNULL(Расход.Количество, 0) КАК РасходКоличество,
                      |	ЕСТЬNULL(Расход.Сумма, 0) КАК РасходСумма,
                      |	ЕСТЬNULL(Списание.Количество, 0) КАК СписаниеКоличество,
                      |	ЕСТЬNULL(Списание.Сумма, 0) КАК СписаниеСумма
                      |ИЗ
                      |	Справочник.НоменклатураМиниБара КАК НоменклатураМиниБараСправочник
                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинибарСебестоимость.СрезПоследних(&Период, ) КАК МинибарСебестоимостьСрезПоследних
                      |		ПО НоменклатураМиниБараСправочник.Ссылка = МинибарСебестоимостьСрезПоследних.НоменклатураМинибара
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			МинибарПриходПриход.Номенклатура КАК Номенклатура,
                      |			СУММА(МинибарПриходПриход.Количество) КАК Количество,
                      |			СУММА(МинибарПриходПриход.Количество * МинибарПриходПриход.Цена) КАК Сумма
                      |		ИЗ
                      |			Документ.МинибарПриход.Приход КАК МинибарПриходПриход
                      |		ГДЕ
                      |			МинибарПриходПриход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |			И КОНЕЦПЕРИОДА(МинибарПриходПриход.Ссылка.ДатаДокументаПрихода, МЕСЯЦ) = &Период
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			МинибарПриходПриход.Номенклатура) КАК Приход
                      |		ПО НоменклатураМиниБараСправочник.Ссылка = Приход.Номенклатура
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			МинибарРасходРасход.Номенклатура КАК Номенклатура,
                      |			СУММА(МинибарРасходРасход.Количество) КАК Количество,
                      |			СУММА(МинибарРасходРасход.Количество * МинибарРасходРасход.Цена) КАК Сумма
                      |		ИЗ
                      |			Документ.МинибарРасход.Расход КАК МинибарРасходРасход
                      |		ГДЕ
                      |			МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |			И МинибарРасходРасход.Ссылка.Списание = ЛОЖЬ
                      |			И КОНЕЦПЕРИОДА(МинибарРасходРасход.ДатаРасхода, МЕСЯЦ) = &Период
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			МинибарРасходРасход.Номенклатура) КАК Расход
                      |		ПО НоменклатураМиниБараСправочник.Ссылка = Расход.Номенклатура
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			МинибарРасходРасход.Номенклатура КАК Номенклатура,
                      |			СУММА(МинибарРасходРасход.Количество) КАК Количество,
                      |			СУММА(МинибарРасходРасход.Количество * МинибарРасходРасход.Цена) КАК Сумма
                      |		ИЗ
                      |			Документ.МинибарРасход.Расход КАК МинибарРасходРасход
                      |		ГДЕ
                      |			МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |			И МинибарРасходРасход.Ссылка.Списание = ИСТИНА
                      |			И КОНЕЦПЕРИОДА(МинибарРасходРасход.ДатаРасхода, МЕСЯЦ) = &Период
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			МинибарРасходРасход.Номенклатура,
                      |			МинибарРасходРасход.Ссылка.Списание) КАК Списание
                      |		ПО (НоменклатураМиниБараСправочник.Ссылка = Списание.Номенклатура)
                      |ГДЕ
                      |	НоменклатураМиниБараСправочник.ПометкаУдаления = ЛОЖЬ
                      |	И НоменклатураМиниБараСправочник.НеИспользуется = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НоменклатураМиниБараСправочник.Номер_пп_Отчет,
                      |	НоменклатураМиниБараСправочник.Наименование");

Запрос.УстановитьПараметр("Период", ДатаСебестоимость); 

ТЗ_Номенклатура = Запрос.Выполнить().Выгрузить();

Область = Макет.ПолучитьОбласть("Шапка");

ТабДок.Вывести(Область);

Итоги = Новый Структура;
Итоги.Вставить("Прибыль", 0);
Для Каждого Строка_Номенклатура Из ТЗ_Номенклатура Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.Номенклатура = Строка_Номенклатура.Номенклатура;
	Область.Параметры.НачалоКоличество = Строка_Номенклатура.НачалоКоличество;
	Область.Параметры.НачалоСумма = Строка_Номенклатура.НачалоСумма;
	Область.Параметры.РасходКоличество = Строка_Номенклатура.РасходКоличество;
	Область.Параметры.РасходСумма = Строка_Номенклатура.РасходСумма;
	Область.Параметры.ПриходКоличество = Строка_Номенклатура.ПриходКоличество;
	Область.Параметры.ПриходСумма = Строка_Номенклатура.ПриходСумма;
	
	Если Строка_Номенклатура.НачалоКоличество + Строка_Номенклатура.ПриходКоличество > 0 Тогда
		ЦенаСписания = (Строка_Номенклатура.НачалоСумма + Строка_Номенклатура.ПриходСумма)
			/ (Строка_Номенклатура.НачалоКоличество + Строка_Номенклатура.ПриходКоличество);
		РасходСуммаРасхода = Окр(ЦенаСписания * Строка_Номенклатура.РасходКоличество, 2);
		СписаниеСуммаРасхода = Окр(ЦенаСписания * Строка_Номенклатура.СписаниеКоличество, 2);	
	Иначе		
		ЦенаСписания = 0;
		РасходСуммаРасхода = 0;
		СписаниеСуммаРасхода = 0;
	КонецЕсли;	
	
	Область.Параметры.СписаниеКоличество = Строка_Номенклатура.СписаниеКоличество;
	Область.Параметры.СписаниеСумма = Строка_Номенклатура.СписаниеКоличество * ЦенаСписания;
		
	Прибыль = Строка_Номенклатура.РасходСумма - РасходСуммаРасхода - СписаниеСуммаРасхода;
	Прибыль = Окр(Прибыль);
	
	Область.Параметры.Прибыль = Прибыль;
	
	ТабДок.Вывести(Область);
	
	Итоги.Прибыль = Итоги.Прибыль + Прибыль;	
КонецЦикла;

Область = Макет.ПолучитьОбласть("Итоги");
Область.Параметры.Прибыль = Итоги.Прибыль;
ТабДок.Вывести(Область);

ПолеОтчетаПрибыль.Очистить();
ПолеОтчетаПрибыль.Вывести(ТабДок);
КонецПроцедуры

//
&НаКлиенте
Асинх Процедура ОбновитьСебестоимостьМиниБара(Команда)
Если ПроверкаДатыРасчета() Тогда Возврат; КонецЕсли;
	
ДатаСебестоимость = КонецМесяца(ДатаРасчета);	

БудущиеДаты = БудущиеДаты();	
БудущиеДатыКоличество = БудущиеДаты.Количество();

ТекстВопроса = "ВНИМАНИЕ: Будут обновлены остатки по дату: "; 
Если БудущиеДатыКоличество = 0  Тогда
	ТекстДата =  Формат(НачалоМесяца(ДатаСебестоимость + 1), "ДФ=dd.MM.yy");
Иначе 		
	ТекстДата =  Формат(НачалоМесяца(БудущиеДаты[БудущиеДатыКоличество - 1] + 1), "ДФ=dd.MM.yy");
КонецЕсли;
ТекстВопроса = ТекстВопроса + ТекстДата + "
		|
		|ПОДТВЕРДИТЕ ...";
		
Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);

Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ДатыОбновления = ДатыОбновления();
Для Каждого Дата_П Из ДатыОбновления Цикл
	ОбновитьСебестоимостьМиниБараНаСервере(Дата_П)		
КонецЦикла;

ПоказатьПредупреждение(, "Остатки по дату: " + ТекстДата + " успешно обновлены");
КонецПроцедуры

&НаСервере
Функция ДатыОбновления()
ДатыОбновления= Новый Массив;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарСебестоимость.Период КАК Период
                      |ИЗ
                      |	РегистрСведений.МинибарСебестоимость КАК МинибарСебестоимость
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	МинибарСебестоимость.Период
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Период");

ТЗ = Запрос.Выполнить().Выгрузить();	
ДатаРасхождения = '00010101'; 
Если ТЗ.Количество() > 0 Тогда 
	Дата_П = ТЗ[0].Период;
	Для Каждого Строка Из ТЗ Цикл
		Если Строка.Период = Дата_П Тогда Продолжить; КонецЕсли;
		
		СледующаяДата = ДобавитьМесяц(Дата_П, 1);
		Если Строка.Период = СледующаяДата Тогда 
			Дата_П = Строка.Период;
			
			Продолжить; 
		КонецЕсли;

		ДатаРасхождения = Дата_П; 
		Прервать;
	КонецЦикла;
Конецесли;

ДатаРасчета_П = НачалоМесяца(ДатаРасчета);
Если ЗначениеЗаполнено(ДатаРасхождения) Тогда
	Пока Дата_П < ДатаРасчета_П Цикл
		ДатыОбновления.Добавить(Дата_П);
		Дата_П = ДобавитьМесяц(Дата_П, 1);
	КонецЦикла;
КонецЕсли;

ДатыОбновления.Добавить(ДатаРасчета_П);

БудущиеДаты = БудущиеДаты();
Для Каждого Дата_П Из БудущиеДаты Цикл
	ДатыОбновления.Добавить(Дата_П);
КонецЦикла;

Возврат ДатыОбновления;
КонецФункции

&НаСервере
Функция БудущиеДаты()
Дата_П = КонецМесяца(ДатаРасчета); 	
Дата_П = КонецМесяца(Дата_П + 1); 	
ДатаСебестоимость = Дата_П;	

Запрос = Новый Запрос(
"ВЫБРАТЬ
|	КОНЕЦПЕРИОДА(МинибарПриходПриход.Ссылка.ДатаДокументаПрихода, МЕСЯЦ) КАК Период,
|	СУММА(МинибарПриходПриход.Количество) КАК Количество
|ИЗ
|	Документ.МинибарПриход.Приход КАК МинибарПриходПриход
|ГДЕ
|	МинибарПриходПриход.Ссылка.ПометкаУдаления = ЛОЖЬ
|	И КОНЕЦПЕРИОДА(МинибарПриходПриход.Ссылка.ДатаДокументаПрихода, МЕСЯЦ) >= &Период
|
|СГРУППИРОВАТЬ ПО
|	КОНЕЦПЕРИОДА(МинибарПриходПриход.Ссылка.ДатаДокументаПрихода, МЕСЯЦ)
|
|УПОРЯДОЧИТЬ ПО
|	Период");

Запрос.УстановитьПараметр("Период", ДатаСебестоимость);
ТЗ_Приходы = Запрос.Выполнить().Выгрузить();


Запрос = Новый Запрос(
"ВЫБРАТЬ
|	КОНЕЦПЕРИОДА(МинибарРасходРасход.Ссылка.ДатаДокументаРасхода, МЕСЯЦ) КАК Период,
|	СУММА(МинибарРасходРасход.Количество) КАК Количество
|ИЗ
|	Документ.МинибарРасход.Расход КАК МинибарРасходРасход
|ГДЕ
|	МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
|	И КОНЕЦПЕРИОДА(МинибарРасходРасход.Ссылка.ДатаДокументаРасхода, МЕСЯЦ) >= &Период
|
|СГРУППИРОВАТЬ ПО
|	КОНЕЦПЕРИОДА(МинибарРасходРасход.Ссылка.ДатаДокументаРасхода, МЕСЯЦ)
|
|УПОРЯДОЧИТЬ ПО
|	Период");

Запрос.УстановитьПараметр("Период", ДатаСебестоимость);
ТЗ_Расходы = Запрос.Выполнить().Выгрузить();

КонецТекущегоМесяца = КонецМесяца(ТекущаяДата());
Дата_П = ДатаСебестоимость;
Массив = Новый Массив;
Пока Дата_П <= КонецТекущегоМесяца Цикл
	ДобавитьДату = Ложь;

	ОтборСтроки = Новый Структура("Период", Дата_П);
	
	//НайденныеСтроки = ТЗ_Остатки.НайтиСтроки(ОтборСтроки);
	//Если НайденныеСтроки.Количество() > 0 Тогда
	//	ДобавитьДату = Истина;
	//КонецЕсли;
	
	НайденныеСтроки = ТЗ_Приходы.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ДобавитьДату = Истина;
	КонецЕсли;
	
	НайденныеСтроки = ТЗ_Расходы.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ДобавитьДату = Истина;
	КонецЕсли;
	
	Если ДобавитьДату Тогда
		Массив.Добавить(Дата_П);
	КонецЕсли;
	
	Дата_П = КонецМесяца(Дата_П + 1);
КонецЦикла;

Возврат Массив; 
КонецФункции

&НаСервере
Процедура ОбновитьСебестоимостьМиниБараНаСервере(ДатаРасчета_П)
ДатаСебестоимость = КонецМесяца(ДатаРасчета_П);	
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарСебестоимостьСрезПоследних.Период КАК Период,
                      |	МинибарСебестоимостьСрезПоследних.НоменклатураМинибара КАК Номенклатура,
                      |	МинибарСебестоимостьСрезПоследних.Количество КАК Количество,
                      |	МинибарСебестоимостьСрезПоследних.Сумма КАК Сумма
                      |ИЗ
                      |	РегистрСведений.МинибарСебестоимость.СрезПоследних(&Период, ) КАК МинибарСебестоимостьСрезПоследних"); 	

Запрос.УстановитьПараметр("Период", ДатаСебестоимость);

ТЗ_Остатки = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарПриходПриход.Номенклатура КАК Номенклатура,
                      |	СУММА(МинибарПриходПриход.Количество) КАК Количество,
                      |	СУММА(МинибарПриходПриход.Цена * МинибарПриходПриход.Количество) КАК Сумма
                      |ИЗ
                      |	Документ.МинибарПриход.Приход КАК МинибарПриходПриход
                      |ГДЕ
                      |	МинибарПриходПриход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И КОНЕЦПЕРИОДА(МинибарПриходПриход.Ссылка.ДатаДокументаПрихода, МЕСЯЦ) = &ДатаДокументаПрихода
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	МинибарПриходПриход.Номенклатура");

Запрос.УстановитьПараметр("ДатаДокументаПрихода", ДатаСебестоимость);

ТЗ_Приход = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МинибарРасходРасход.Номенклатура КАК Номенклатура,
                      |	СУММА(МинибарРасходРасход.Количество) КАК Количество,
                      |	СУММА(МинибарРасходРасход.Цена * МинибарРасходРасход.Количество) КАК Сумма
                      |ИЗ
                      |	Документ.МинибарРасход.Расход КАК МинибарРасходРасход
                      |ГДЕ
                      |	МинибарРасходРасход.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И КОНЕЦПЕРИОДА(МинибарРасходРасход.Ссылка.ДатаДокументаРасхода, МЕСЯЦ) = &ДатаДокументаРасхода
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	МинибарРасходРасход.Номенклатура");

Запрос.УстановитьПараметр("ДатаДокументаРасхода", ДатаСебестоимость);

ТЗ_Расход = Запрос.Выполнить().Выгрузить();

Выборка_Номенклатура = Справочники.НоменклатураМиниБара.Выбрать();
Пока Выборка_Номенклатура.Следующий() Цикл
	Номенклатура = Выборка_Номенклатура.Ссылка;
	
	ОтборСтроки = Новый Структура("Номенклатура", Номенклатура);
	
	НайденныеСтроки = ТЗ_Остатки.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		КоличествоНачало = 0; 
		СуммаНачало = 0; 
	Иначе
		НайденнаяСтрока = НайденныеСтроки[0];
		КоличествоНачало = НайденнаяСтрока.Количество; 
		СуммаНачало = НайденнаяСтрока.Сумма; 
	КонецЕсли;
	
	НайденныеСтроки = ТЗ_Приход.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		КоличествоПриход = 0; 
		СуммаПриход = 0; 
	Иначе
		НайденнаяСтрока = НайденныеСтроки[0];
		КоличествоПриход = НайденнаяСтрока.Количество; 
		СуммаПриход = НайденнаяСтрока.Сумма; 
	КонецЕсли;
	
	НайденныеСтроки = ТЗ_Расход.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		КоличествоРасход = 0; 
		СуммаРасход = 0; 
	Иначе
		НайденнаяСтрока = НайденныеСтроки[0];
		КоличествоРасход = НайденнаяСтрока.Количество; 
		СуммаРасход = НайденнаяСтрока.Сумма; 
	КонецЕсли;

	Если КоличествоНачало <> 0 ИЛИ КоличествоПриход <> 0 ИЛИ КоличествоРасход <> 0 Тогда
	
		Если КоличествоНачало + КоличествоПриход <> 0 Тогда
			ЦенаСписания = (СуммаНачало + СуммаПриход) / (КоличествоНачало + КоличествоПриход);
		Иначе
			Если КоличествоНачало <> 0 Тогда
				ЦенаСписания = СуммаНачало / КоличествоНачало; 
			Иначе
				ЦенаСписания = 0;
			КонецЕсли;
		КонецЕсли;
		
		СуммаСписания = КоличествоРасход * ЦенаСписания;
		СуммаКонец = СуммаНачало + СуммаПриход - СуммаСписания;
		
		КоличествоКонец = КоличествоНачало + КоличествоПриход - КоличествоРасход;
		
		НоваяЗапись = РегистрыСведений.МинибарСебестоимость.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ДатаСебестоимость + 1;
		НоваяЗапись.НоменклатураМинибара = Номенклатура;
		НоваяЗапись.Количество = КоличествоКонец;
		НоваяЗапись.Сумма = СуммаКонец;
		
		НоваяЗапись.Записать(Истина);
	КонецЕсли;	
КонецЦикла;

КонецПроцедуры
//

&НаКлиенте
Процедура Расход(Команда)
ОткрытьФорму("Документ.МинибарРасход.Форма.ФормаСписка", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура Приход(Команда)
ОткрытьФорму("Документ.МинибарПриход.ФормаСписка", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасчетаПриИзменении(Элемент)	
Если ЗначениеЗаполнено(ДатаРасчета) Тогда
	Элементы.ДатаРасчетаДекорация.Заголовок = Формат(ДатаРасчета, "ДФ=MMMM.yy");		
Иначе
	Элементы.ДатаРасчетаДекорация.Заголовок = "";
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТЕСТ(Команда)
//ПрошлыеДанные();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОстаткиПриИзменении(Элемент)
Если НачалоМесяца(ДатаРасчета) <> НачалоМесяца(ДатаОстатки) Тогда
	ПоказатьПредупреждение(,"Месяц Даты остатки <> Месяц расчета");
	
	ДатаОстатки = ДатаОстатки_OldValue;
	
	Возврат;
КонецЕсли;

ДатаОстатки_OldValue = ДатаОстатки ;
КонецПроцедуры


//


