//
&НаКлиенте
Процедура ПриОткрытии___()
	//
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Гость поздно выселен из программы");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Тарификация за пол суток как с 6 утра");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Оплата согласно брони");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Аннуляционный сбор");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Комплементарный заезд-выезд");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Ошибка выставления тарифа");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Дополнительное место");
	//
	//Если ЭтоНовый() тогда
	//	Автор=ТекПол;
	//	ЗаполнитьТаб();
	//конецесли;
	//Если  ПроданныеНомера.Количество()=0 тогда
	//	ЗаполнитьТаб();
	//	Записать(РежимЗаписиДокумента.Запись);
	//иначе
	//	
	//	если ТекПол.Админ тогда
	//		ЭлементыФормы.Проверка.Доступность=Истина;
	//	иначе
	//		ЭлементыФормы.Проверка.Доступность=Ложь;
	//	конецесли;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПроданныеНомераКомментарий.СписокВыбора.Добавить("Гость поздно выселен из программы");
	Элементы.ПроданныеНомераКомментарий.СписокВыбора.Добавить("Тарификация за пол суток как с 6 утра");
	Элементы.ПроданныеНомераКомментарий.СписокВыбора.Добавить("Оплата согласно брони");
	Элементы.ПроданныеНомераКомментарий.СписокВыбора.Добавить("Аннуляционный сбор");
	Элементы.ПроданныеНомераКомментарий.СписокВыбора.Добавить("Комплементарный заезд-выезд");
	Элементы.ПроданныеНомераКомментарий.СписокВыбора.Добавить("Ошибка выставления тарифа");
	Элементы.ПроданныеНомераКомментарий.СписокВыбора.Добавить("Дополнительное место");
	
	
	ТекПол = ПараметрыСеанса["ТекущийПользователь"];
	//Если ЭтоНовый() тогда
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		//ТекПол = ОбщиеСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
		Автор=ТекПол;
		
		// + ПСН
		Объект.Дата = ТекущаяДата();
		// - ПСН
		
		ЗаполнитьТаб();
	конецесли;
	   
	Если  Объект.ПроданныеНомера.Количество()=0 тогда
		ЗаполнитьТаб();
		//Записать(РежимЗаписиДокумента.Запись);
		//ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
		ЭтотОбъект.Записать();
	иначе
		
		если ТекПол.Админ тогда
			Элементы.Проверка.Доступность=Истина;
		иначе
			Элементы.Проверка.Доступность=Ложь;
		конецесли;
	КонецЕсли;
КонецПроцедуры

&НаСервере                                
Функция ЗаполнитьТаб__()
	//ПроданныеНомера.Очистить();
	//Незаезды.Очистить();
	//Аннуляции.Очистить();
	//ЗапросПроживающих=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗанятостьНомеров.Регистратор,
	//|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	//|	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф,
	//|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	//|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд,
	//|	ЗанятостьНомеров.Регистратор.Бронирует  КАК Бронирует
	//|ИЗ
	//|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//|ГДЕ
	//|	(ЗанятостьНомеров.Регистратор.Статус = &Статус
	//|			ИЛИ ЗанятостьНомеров.Регистратор.Статус = &Статус2)
	//|	И (ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//|			ИЛИ ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН2 И &ДК2)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗанятостьНомеров.Номер.Наименование");
	//ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);								   
	//ЗапросПроживающих.УстановитьПараметр("Статус2",Перечисления.СтатусБрони.Выехал);	
	//ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(Дата)+11*60*60);								   
	//ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(Дата));	
	//ЗапросПроживающих.УстановитьПараметр("ДН2",НачалоДня(Дата)+11*60*60);//КонецДня(Дата));								   
	//ЗапросПроживающих.УстановитьПараметр("ДК2",КонецДня(Дата)+9*60*60);	
	//ЗапросПроживающих.УстановитьПараметр("ДН3",НачалоДня(Дата));								   
	//ЗапросПроживающих.УстановитьПараметр("ДК3",НачалоДня(Дата)+8*60*60);	
	//////|	И (НЕ(ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН3 И &ДК3))
	//ТЗ=ЗапросПроживающих.Выполнить().Выгрузить();
	//Для каждого Стр Из ТЗ Цикл
	//	Если Стр.Заезд>Дата(2000,1,1) и Стр.Заезд>КонецДня(Дата)+9*60*60 тогда
	//		Продолжить;
	//	конецесли;
	//	
	//	//Если Стр.Заезд>Дата(2000,1,1) и Стр.Заезд>КонецДня(Дата)+8*86400 тогда
	//	//	Продолжить;
	//	//конецесли;
	//	
	//	Если Стр.Выезд>Дата(2000,1,1) и Стр.Выезд<НачалоДня(Дата) тогда
	//		Продолжить;
	//	конецесли;
	//	
	//	Если Стр.Тариф.Код="000000400" тогда // романик
	//		Если Стр.Заезд>Дата(2000,1,1) и Стр.Выезд>Дата(2000,1,1) тогда
	//			Если НачалоДня(Стр.Заезд)<>НачалоДня(Стр.Выезд) тогда
	//				если Стр.Заезд<НачалоДня(Дата) тогда //вчерашний романтик
	//					Продолжить;	
	//				конецесли;
	//				
	//			конецесли;				
	//		конецесли;
	//	конецесли;
	//	
	//	
	//	Нов=ПроданныеНомера.Добавить();
	//	Нов.Бронь=Стр.Регистратор;
	//	Нов.Клиент=Стр.Клиент;
	//	Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
	//	Нов.Заезд=Стр.Заезд;
	//	Нов.ЗаездКоррекция=Стр.Заезд;
	//	Нов.Выезд=Стр.Выезд;
	//	Нов.ВыездКоррекция=Стр.Выезд;
	//	Нов.Тариф=ТарифНаДату(Нов.Бронь,НАчалоДня(Дата));
	//	Нов.ТарифКоррекция=Нов.Тариф;
	//	//Политов
	//	Нов.Бронирует=Стр.Бронирует;  
	//	///Политов
	//	Для каждого СтрУ из Нов.Бронь.ДопУслуги цикл
	//		Если СтрУ.Услуга.Наименование="Ужин" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Дата) тогда 	
	//			//Нов.СуммаПолупансион=Нов.СуммаПолупансион+СтрУ.Цена*СтрУ.КолВо;
	//		иначеесли  СтрУ.Услуга.Родитель.Код="000000796" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Дата) тогда
	//			Нов.СуммаДопМесто=Нов.СуммаДопМесто+СтрУ.Цена*СтрУ.КолВо;
	//		иначеесли  СтрУ.Услуга.Родитель.Код="000000284" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Дата) тогда
	//			Нов.СуммаКоррекция=Нов.СуммаКоррекция+СтрУ.Цена*СтрУ.КолВо;
	//		конецесли;
	//		
	//	КонецЦикла;
	//	
	//	Нов.СуммаЗаПроживание=РасчитатьСтоимостьФакт(Нов)+Нов.СуммаДопМесто;
	//	Нов.СуммаЗаПроживаниеПлан=РасчитатьСтоимостьПлан(Нов);//+Нов.СуммаДопМесто;
	//	
	//	
	//КонецЦикла; 
	//Нов=ПроданныеНомера.Добавить();
	//
	//// Незаезды
	//
	//ЗапросНезаездов=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗанятостьНомеров.Регистратор,
	//|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	//|	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф,
	//|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	//|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд
	//|ИЗ
	//|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//|ГДЕ
	//|	ЗанятостьНомеров.Регистратор.Статус = &Статус
	//|	
	//|	И (ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//|)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗанятостьНомеров.Номер.Наименование");
	//
	//ЗапросНезаездов.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);								   
	//ЗапросНезаездов.УстановитьПараметр("ДН",НачалоДня(Дата));								   
	//ЗапросНезаездов.УстановитьПараметр("ДК",КонецДня(Дата));	
	//ЗапросНезаездов.УстановитьПараметр("ДН2",КонецДня(Дата));								   
	//ЗапросНезаездов.УстановитьПараметр("ДК2",КонецДня(Дата)+8*60*60);	
	//ЗапросНезаездов.УстановитьПараметр("ДН3",НачалоДня(Дата));								   
	//ЗапросНезаездов.УстановитьПараметр("ДК3",НачалоДня(Дата)+8*60*60);	
	//ТЗ=ЗапросНезаездов.Выполнить().Выгрузить();
	//
	//Для каждого Стр Из ТЗ Цикл
	//	
	//	
	//	Нов=Незаезды.Добавить();
	//	Нов.Бронь=Стр.Регистратор;
	//	Нов.Клиент=Стр.Клиент;
	//	Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
	//	
	//	
	//КонецЦикла; 
	//
	//
	//ЗапросАннул=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗанятостьНомеров.Регистратор,
	//|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	//|	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф,
	//|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	//|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд
	//|ИЗ
	//|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//|ГДЕ
	//|	ЗанятостьНомеров.Регистратор.Статус = &Статус
	//|	И ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗанятостьНомеров.Номер.Наименование");
	//ЗапросАннул=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗаявкаНаБронирование.Ссылка КАК Регистратор,
	//|	ЗаявкаНаБронирование.Клиент,
	//|	ЗаявкаНаБронирование.Тариф
	//|ИЗ
	//|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//|ГДЕ
	//|	ЗаявкаНаБронирование.Ссылка.ДатаАннуляции МЕЖДУ &ДН И &ДК
	//|	И ЗаявкаНаБронирование.Статус = &Статус");
	//
	//ЗапросАннул.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);								   
	//ЗапросАннул.УстановитьПараметр("ДН",НачалоДня(Дата));								   
	//ЗапросАннул.УстановитьПараметр("ДК",КонецДня(Дата+86400));	
	//ТЗ=ЗапросАннул.Выполнить().Выгрузить();
	//
	//Для каждого Стр Из ТЗ Цикл
	//	
	//	
	//	Нов=Аннуляции.Добавить();
	//	Нов.Бронь=Стр.Регистратор;
	//	Нов.Клиент=Стр.Клиент;
	//	Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
	//	
	//	
	//КонецЦикла; 
	//
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаб()
	Объект.ПроданныеНомера.Очистить();
	Объект.Незаезды.Очистить();
	Объект.Аннуляции.Очистить();
	
	//ЗапросПроживающих=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗанятостьНомеров.Регистратор,
	//|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	//|	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф,
	//|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	//|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд,
	//|	ЗанятостьНомеров.Регистратор.Бронирует  КАК Бронирует
	//|ИЗ
	//|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//|ГДЕ
	//|	(ЗанятостьНомеров.Регистратор.Статус = &Статус
	//|			ИЛИ ЗанятостьНомеров.Регистратор.Статус = &Статус2)
	//|	И (ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//|			ИЛИ ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН2 И &ДК2)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗанятостьНомеров.Номер.Наименование");
	
	ЗапросПроживающих=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
       |	ЗанятостьНомеров.Регистратор КАК Регистратор,
       |	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
       |	ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется КАК Тариф_НеИспользуется,
       |	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
       |	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд,
       |	ЗанятостьНомеров.Регистратор.Бронирует КАК Бронирует,
       |	ЗанятостьНомеров.Номер.Наименование КАК НомерНаименование
       |ИЗ
       |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
       |ГДЕ
       |	(ЗанятостьНомеров.Регистратор.Статус = &Статус
       |			ИЛИ ЗанятостьНомеров.Регистратор.Статус = &Статус2)
       |	И (ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
       |			ИЛИ ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН2 И &ДК2)
       |
       |УПОРЯДОЧИТЬ ПО
       |	НомерНаименование");

	ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);								   
	ЗапросПроживающих.УстановитьПараметр("Статус2",Перечисления.СтатусБрони.Выехал);	
	ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(Объект.Дата)+11*60*60);								   
	ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(Объект.Дата));	
	ЗапросПроживающих.УстановитьПараметр("ДН2",НачалоДня(Объект.Дата)+11*60*60);//КонецДня(Дата));								   
	ЗапросПроживающих.УстановитьПараметр("ДК2",КонецДня(Объект.Дата)+9*60*60);	
	
	ЗапросПроживающих.УстановитьПараметр("ДН3",НачалоДня(Объект.Дата));								   
	ЗапросПроживающих.УстановитьПараметр("ДК3",НачалоДня(Объект.Дата)+8*60*60);	
	////|	И (НЕ(ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН3 И &ДК3))
	ТЗ=ЗапросПроживающих.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		Если Стр.Заезд>Дата(2000,1,1) и Стр.Заезд>КонецДня(Объект.Дата)+9*60*60 тогда
			Продолжить;
		конецесли;
		
		////Если Стр.Заезд>Дата(2000,1,1) и Стр.Заезд>КонецДня(Дата)+8*86400 тогда
		////	Продолжить;
		////конецесли;
		
		Если Стр.Выезд>Дата(2000,1,1) и Стр.Выезд<НачалоДня(Объект.Дата) тогда
			Продолжить;
		конецесли;
		
		Если Стр.Тариф.Код="000000400" тогда // романик
			Если Стр.Заезд>Дата(2000,1,1) и Стр.Выезд>Дата(2000,1,1) тогда
				Если НачалоДня(Стр.Заезд)<>НачалоДня(Стр.Выезд) тогда
					если Стр.Заезд<НачалоДня(Объект.Дата) тогда //вчерашний романтик
						Продолжить;	
					конецесли;
					
				конецесли;				
			конецесли;
		конецесли;
		
		
		Нов=Объект.ПроданныеНомера.Добавить();
		Нов.Бронь=Стр.Регистратор;
		Нов.Клиент=Стр.Клиент;
		Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
		Нов.Заезд=Стр.Заезд;
		Нов.ЗаездКоррекция=Стр.Заезд;
		Нов.Выезд=Стр.Выезд;
		Нов.ВыездКоррекция=Стр.Выезд;
		Нов.Тариф_НеИспользуется=ТарифНаДату(Нов.Бронь,НАчалоДня(Объект.Дата));
		Нов.ТарифКоррекция=Нов.Тариф_НеИспользуется;
		//Политов
		Нов.Бронирует=Стр.Бронирует;  
		///Политов
		Для каждого СтрУ из Нов.Бронь.ДопУслуги цикл
			Если СтрУ.Услуга.Наименование="Ужин" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Объект.Дата) тогда 	
				////Нов.СуммаПолупансион=Нов.СуммаПолупансион+СтрУ.Цена*СтрУ.КолВо;
			иначеесли  СтрУ.Услуга.Родитель.Код="000000796" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Объект.Дата) тогда
				Нов.СуммаДопМесто=Нов.СуммаДопМесто+СтрУ.Цена*СтрУ.КолВо;
			иначеесли  СтрУ.Услуга.Родитель.Код="000000284" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Объект.Дата) тогда
				Нов.СуммаКоррекция=Нов.СуммаКоррекция+СтрУ.Цена*СтрУ.КолВо;
			конецесли;
			
		КонецЦикла;
		
		ОснРеквизит = Объект;
		Нов.СуммаЗаПроживание=РасчитатьСтоимостьФакт(ОснРеквизит, Нов)+Нов.СуммаДопМесто;
		Нов.СуммаЗаПроживаниеПлан=РасчитатьСтоимостьПлан(Нов);//+Нов.СуммаДопМесто;
		
		
	КонецЦикла; 
	Нов=Объект.ПроданныеНомера.Добавить();
	
	// Незаезды
	
	//ЗапросНезаездов=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗанятостьНомеров.Регистратор,
	//|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	//|	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф,
	//|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	//|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд
	//|ИЗ
	//|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//|ГДЕ
	//|	ЗанятостьНомеров.Регистратор.Статус = &Статус
	//|	
	//|	И (ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//|)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗанятостьНомеров.Номер.Наименование");
	
	ЗапросНезаездов=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                             |	ЗанятостьНомеров.Регистратор КАК Регистратор,
	                             |	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	                             |	ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется КАК Тариф_НеИспользуется,
	                             |	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	                             |	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд,
	                             |	ЗанятостьНомеров.Номер.Наименование КАК НомерНаименование
	                             |ИЗ
	                             |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                             |ГДЕ
	                             |	ЗанятостьНомеров.Регистратор.Статус = &Статус
	                             |	И ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                             |
	                             |УПОРЯДОЧИТЬ ПО
	                             |	НомерНаименование");
	
	
	ЗапросНезаездов.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);								   
	ЗапросНезаездов.УстановитьПараметр("ДН",НачалоДня(Объект.Дата));								   
	ЗапросНезаездов.УстановитьПараметр("ДК",КонецДня(Объект.Дата));	
	ЗапросНезаездов.УстановитьПараметр("ДН2",КонецДня(Объект.Дата));								   
	ЗапросНезаездов.УстановитьПараметр("ДК2",КонецДня(Объект.Дата)+8*60*60);	
	ЗапросНезаездов.УстановитьПараметр("ДН3",НачалоДня(Объект.Дата));								   
	ЗапросНезаездов.УстановитьПараметр("ДК3",НачалоДня(Объект.Дата)+8*60*60);	
	ТЗ=ЗапросНезаездов.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		
		
		Нов=Объект.Незаезды.Добавить();
		Нов.Бронь=Стр.Регистратор;
		Нов.Клиент=Стр.Клиент;
		Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
		
		
	КонецЦикла; 
	
	
	ЗапросАннул=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗанятостьНомеров.Регистратор,
	|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	|	ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется КАК Тариф_НеИспользуется,
	|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд
	|ИЗ
	|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	|ГДЕ
	|	ЗанятостьНомеров.Регистратор.Статус = &Статус
	|	И ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗанятостьНомеров.Номер.Наименование");
	ЗапросАннул=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаБронирование.Ссылка КАК Регистратор,
	|	ЗаявкаНаБронирование.Клиент,
	|	ЗаявкаНаБронирование.Тариф_НеИспользуется
	|ИЗ
	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	|ГДЕ
	|	ЗаявкаНаБронирование.Ссылка.ДатаАннуляции МЕЖДУ &ДН И &ДК
	|	И ЗаявкаНаБронирование.Статус = &Статус");
	
	ЗапросАннул.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);								   
	ЗапросАннул.УстановитьПараметр("ДН",НачалоДня(Объект.Дата));								   
	ЗапросАннул.УстановитьПараметр("ДК",КонецДня(Объект.Дата+86400));	
	ТЗ=ЗапросАннул.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		
		
		Нов=Объект.Аннуляции.Добавить();
		Нов.Бронь=Стр.Регистратор;
		Нов.Клиент=Стр.Клиент;
		Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
		
		
	КонецЦикла; 
	
	
КонецФункции

&НаСервере
Функция ТарифНаДату(Бронь,ДТ)
	Поиск=Бронь.Исключения.Найти(ДТ,"ДеньПроживания");
	Если Поиск=Неопределено тогда
		Возврат Бронь.Тариф_НеИспользуется;
	иначе
		Возврат Поиск.Тариф_НеИспользуется;
	конецесли;
	
КонецФункции
//

&НаСервере
Функция РасчитатьСтоимостьПлан(СтрокаТЗ)
	
	Стоимость=?(СтрокаТЗ.Бронь.НовыйРассчет,ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(Объект.Дата)),СтрокаТЗ.Тариф_НеИспользуется.Цена*?(СтрокаТЗ.Бронь.Оплачивает.Категория.Пустая(),1,1-СтрокаТЗ.Бронь.Оплачивает.Категория.Скидка/100));
	
	Коэф=1;
	Если СтрокаТЗ.Тариф_НеИспользуется.Код="000000001" или Найти(СтрокаТЗ.Тариф_НеИспользуется.Наименование,"Бон Шанс")>0 тогда
		
		Если (СтрокаТЗ.Заезд-НачалоДня(СтрокаТЗ.Заезд))<6*60*60  и НачалоДня(СтрокаТЗ.Заезд)=НачалоДня(Объект.Дата) тогда // прошлые сутки
			Коэф=0;
			Возврат 0;			
		иначе
			ВремяВНомере=СтрокаТЗ.Выезд-СтрокаТЗ.Заезд;
			СуммаСверх=?(ВремяВНомере>(3600*4-1),(Цел(ВремяВНомере/3600)-3)*200,0);
			Возврат (Стоимость)+СуммаСверх;
		конецесли;
	конецесли;
	Если (СтрокаТЗ.Выезд-СтрокаТЗ.Заезд)<86400 и (СтрокаТЗ.Выезд-СтрокаТЗ.Заезд)>0 и НАчалоДня(СтрокаТЗ.Выезд)=НачалоДня(Объект.Дата) и НАчалоДня(СтрокаТЗ.Заезд)=НачалоДня(Объект.Дата) тогда // нет суток
		Если НАчалоДня(СтрокаТЗ.Заезд)=НачалоДня(Объект.Дата) тогда // сегодня ночью заехал
			Если (СтрокаТЗ.Заезд-НачалоДня(СтрокаТЗ.Заезд))<6*60*60 тогда // прошлые сутки
				Коэф=0;
				Возврат 0;			
			конецесли;
		конецесли;
		Возврат (Стоимость);
	конецесли;
	//Если (СтрокаТЗ.Выезд-СтрокаТЗ.Заезд)<86400 и (СтрокаТЗ.Выезд-СтрокаТЗ.Заезд)>0 и НАчалоДня(СтрокаТЗ.Выезд)=НачалоДня(Дата) тогда // нет суток
	//	Возврат 0;	
	//конецесли;
	//СтрокаТЗ=ПроданныеНомера.Добавить();
	Сумма=(Стоимость);
	РезервС=?(СтрокаТЗ.Заезд<Дата(2000,1,1),СтрокаТЗ.Бронь.РезервС,СтрокаТЗ.Заезд);	
	РезервПО=?(СтрокаТЗ.Выезд<Дата(2000,1,1),СтрокаТЗ.Бронь.РезервПо,СтрокаТЗ.Выезд);	
	
	
	//Если НАчалоДня(РезервС)=НачалоДня(Дата) тогда //сегодня заехал.
	Если НАчалоДня(СтрокаТЗ.Заезд)=НачалоДня(Объект.Дата+86400) тогда //"Завтра" заехал.
		//Если НАчалоДня(РезервС)=НачалоДня(СтрокаТЗ.Заезд) тогда
		//Если Час(СтрокаТЗ.Заезд)<6 тогда // двойной тариф (+прошлые сутки)
		//	Сумма=Сумма;
		//иначеесли Час(СтрокаТЗ.Заезд)>=6 и Час(СтрокаТЗ.Заезд)<=8 тогда // 1,5 тариф (+половина прошлые сутки)
		//	Сумма=Сумма*0.5;	
		//конецесли;
			Если СтрокаТЗ.Бронь.НовыйРассчет и Сумма=0 Тогда 
				Сумма=ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(Объект.Дата+86400));
			КонецЕсли;
		Если (СтрокаТЗ.Заезд-НачалоДня(СтрокаТЗ.Заезд))<6*60*60 тогда // двойной тариф (+прошлые сутки)
			Сумма=Сумма*1;
			Коэф=Коэф*1;
		иначеесли (СтрокаТЗ.Заезд-НачалоДня(СтрокаТЗ.Заезд))>=6*60*60-40 и (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<=9*60*60 тогда // 1,5 тариф (+половина прошлые сутки)
			Сумма=Сумма*0.5;	
			Коэф=Коэф*0.5;
		конецесли;		
		//конецесли;
	конецесли;
	Если Найти(СтрокаТЗ.Тариф_НеИспользуется.Наименование,"Свадебный")>0 тогда // можно до 6 выезжать
		Если НАчалоДня(РезервПо)=НачалоДня(Объект.Дата) тогда //сегодня выехал.
			Если (Час(СтрокаТЗ.Выезд)-12)<=6 тогда // можно до 6 выезжать
				Сумма=0;
			иначеесли (Час(СтрокаТЗ.Выезд)-12)>0 тогда
				Сумма=Сумма;	
				СтрокаТЗ.Коэф=1;
			иначе
				Сумма=0;
			конецесли;
		конецесли;
	иначе
		
		Если НАчалоДня(РезервПо)=НачалоДня(Объект.Дата) тогда //сегодня выехал.
			Если СтрокаТЗ.Бронь.НовыйРассчет и Сумма=0 Тогда 
				Сумма=ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(Объект.Дата-86400));
			КонецЕсли;
			Если (Час(СтрокаТЗ.Выезд)-12)<5 и (Час(СтрокаТЗ.Выезд)-12)>2 тогда // почасовая прибавка
				Сумма=Сумма*((Час(СтрокаТЗ.Выезд)+?(Минута(СтрокаТЗ.Выезд)>30,1,0)-12)/24);
				Коэф=((Час(СтрокаТЗ.Выезд)+?(Минута(СтрокаТЗ.Выезд)>30,1,0)-12)/24);
			иначеесли (Час(СтрокаТЗ.Выезд)-12)<=12 и (Час(СтрокаТЗ.Выезд)-12)>2 тогда // 1,5 тариф (+половина след. сутки)
				Сумма=Сумма*0.5;
				Коэф=Коэф*0.5;
			иначеесли (Час(СтрокаТЗ.Выезд)-12)>2 тогда
				Сумма=Сумма;	
				Коэф=СтрокаТЗ.Коэф*1;
			иначе
				Сумма=0;
			конецесли;
		конецесли;
	конецесли;
	СтрокаТЗ.Скидка=(?(СтрокаТЗ.Тариф_НеИспользуется.БазовыйТариф.Пустая(),0,СтрокаТЗ.Тариф_НеИспользуется.БазовыйТариф.Цена-Стоимость)+(Стоимость))*Коэф;
	Если Сумма=0 тогда
		СтрокаТЗ.Скидка=0;
	конецесли;
	
	Возврат Сумма;
	
КонецФункции

&НаСервереБезКонтекста
Функция РасчитатьСтоимостьФакт(ОснРеквизит, СтрокаТЗ)
	ОбъектЗначение = ДанныеФормыВЗначение(ОснРеквизит, Тип("ДокументОбъект.ЕжедневныйАудит"));
	
	Стоимость=?(СтрокаТЗ.Бронь.НовыйРассчет,ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(ОбъектЗначение.Дата)),СтрокаТЗ.Тариф_НеИспользуется.Цена*?(СтрокаТЗ.Бронь.Оплачивает.Категория.Пустая(),1,1-СтрокаТЗ.Бронь.Оплачивает.Категория.Скидка/100));
	СтоимостьФакт=?(СтрокаТЗ.Бронь.НовыйРассчет,ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(ОбъектЗначение.Дата)),СтрокаТЗ.ТарифКоррекция.Цена*?(СтрокаТЗ.Бронь.Оплачивает.Категория.Пустая(),1,1-СтрокаТЗ.Бронь.Оплачивает.Категория.Скидка/100));
	
	СтрокаТЗ.Коэф=1;
	Если СтрокаТЗ.ТарифКоррекция.Код="000000001" или Найти(СтрокаТЗ.ТарифКоррекция.Наименование,"Бон Шанс")>0 тогда
		Если (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<6*60*60  и НачалоДня(СтрокаТЗ.ЗаездКоррекция)=НачалоДня(ОбъектЗначение.Дата)  тогда // прошлые сутки
			СтрокаТЗ.Коэф=0;
			Возврат 0;			
		иначе			
			ВремяВНомере=СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция;
			СуммаСверх=?(ВремяВНомере>(3600*4-1),(Цел(ВремяВНомере/3600)-3)*200,0);
			Возврат (Стоимость)+СуммаСверх+СтрокаТЗ.СуммаКоррекция;
		КонецЕсли;
		
		
	конецесли;
	
	
	Если (СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция)<86400 и (СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция)>0 и НАчалоДня(СтрокаТЗ.ВыездКоррекция)=НачалоДня(ОбъектЗначение.Дата) и НАчалоДня(СтрокаТЗ.ЗаездКоррекция)=НачалоДня(ОбъектЗначение.Дата) тогда // нет суток
		Если НАчалоДня(СтрокаТЗ.ЗаездКоррекция)=НачалоДня(ОбъектЗначение.Дата) тогда // сегодня ночью заехал
			Если (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<6*60*60 тогда // прошлые сутки
				СтрокаТЗ.Коэф=0;
				Возврат 0;			
			конецесли;
		конецесли;
		//	
		СтрокаТЗ.Коэф=1;
		Возврат (СтоимостьФакт)+СтрокаТЗ.СуммаКоррекция;	
	конецесли;
	
	//
	//Если (СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция)<86400 и (СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция)>0 и НАчалоДня(СтрокаТЗ.ВыездКоррекция)=НачалоДня(Дата) тогда // нет суток
	//	СтрокаТЗ.Коэф=0;
	//	Возврат 0;	
	//конецесли;
	
	РезервС=?(СтрокаТЗ.ЗаездКоррекция<Дата(2000,1,1),СтрокаТЗ.Бронь.РезервС,СтрокаТЗ.ЗаездКоррекция);	
	РезервПО=?(СтрокаТЗ.ВыездКоррекция<Дата(2000,1,1),СтрокаТЗ.Бронь.РезервПо,СтрокаТЗ.ВыездКоррекция);	
	
	Сумма=(СтоимостьФакт);
	Если НАчалоДня(СтрокаТЗ.ЗаездКоррекция)=НачалоДня(ОбъектЗначение.Дата+86400) тогда //"Завтра" заехал.
		Если СтрокаТЗ.Бронь.НовыйРассчет и Сумма=0 Тогда 
				Сумма=ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(ОбъектЗначение.Дата+86400));
			КонецЕсли;
		//Если НАчалоДня(РезервС)=НачалоДня(СтрокаТЗ.ЗаездКоррекция) тогда
		Если (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<6*60*60 тогда // двойной тариф (+прошлые сутки)
			Сумма=Сумма*1;
			СтрокаТЗ.Коэф=СтрокаТЗ.Коэф*1;
		иначеесли (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))>=6*60*60-40 и (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<=9*60*60 тогда // 1,5 тариф (+половина прошлые сутки)
			Сумма=Сумма*0.5;	
			СтрокаТЗ.Коэф=СтрокаТЗ.Коэф*0.5;
		конецесли;			
		//Конецесли;
	конецесли;
	Если Найти(СтрокаТЗ.ТарифКоррекция.Наименование,"Свадебный")>0 тогда // можно до 6 выезжать
		Если НАчалоДня(РезервПо)=НачалоДня(ОбъектЗначение.Дата) тогда //сегодня выехал.
			Если (Час(СтрокаТЗ.ВыездКоррекция)-12)<=6 тогда // можно до 6 выезжать
				Сумма=0;
			иначеесли (Час(СтрокаТЗ.ВыездКоррекция)-12)>0 тогда
				Сумма=Сумма;	
				СтрокаТЗ.Коэф=1;
			иначе
				Сумма=0;
			конецесли;
		конецесли;
	иначе
		Если НАчалоДня(РезервПо)=НачалоДня(ОбъектЗначение.Дата) тогда //сегодня выехал.
			Если СтрокаТЗ.Бронь.НовыйРассчет и Сумма=0 Тогда 
				Сумма=ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(ОбъектЗначение.Дата-86400));
			КонецЕсли;
			
			
			
			Если (Час(СтрокаТЗ.ВыездКоррекция)-12)<5 и (Час(СтрокаТЗ.ВыездКоррекция)-12)>2 тогда // почасовая прибавка
				Сумма=Сумма*((Час(СтрокаТЗ.ВыездКоррекция)+?(Минута(СтрокаТЗ.ВыездКоррекция)>30,1,0)-12)/24);
				СтрокаТЗ.Коэф=(Час(СтрокаТЗ.ВыездКоррекция)+?(Минута(СтрокаТЗ.ВыездКоррекция)>30,1,0)-12)/24;
				
			иначеесли (Час(СтрокаТЗ.ВыездКоррекция)-12)<=12 и (Час(СтрокаТЗ.ВыездКоррекция)-12)>2 тогда // 1,5 тариф (+половина след. сутки)
				Сумма=Сумма*0.5;
				СтрокаТЗ.Коэф=0.5;
			иначеесли (Час(СтрокаТЗ.ВыездКоррекция)-12)>2 тогда
				Сумма=Сумма;	
				СтрокаТЗ.Коэф=1;
			иначе
				Сумма=0;
			конецесли;
		конецесли;
	конецесли;
	
	СтрокаТЗ.СкидкаКоррекция=(?(СтрокаТЗ.ТарифКоррекция.БазовыйТариф.Пустая(),0,СтрокаТЗ.ТарифКоррекция.БазовыйТариф.Цена-СтоимостьФакт) + (СтоимостьФакт))*СтрокаТЗ.Коэф;
	Если Сумма=0 тогда
		СтрокаТЗ.СкидкаКоррекция=0;
	конецесли;
	Возврат Сумма+СтрокаТЗ.СуммаКоррекция;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьНовыйРасчет(Бронь,ДатаЦены)
	ПоискЦены=Бронь.Исключения.Найти(ДатаЦены,"ДеньПроживания");
	Если ПоискЦены=Неопределено Тогда 
		Возврат 0;
	Иначе 
		Возврат ПоискЦены.Сумма;
	КонецЕсли;
	
КонецФункции

////////////
&НаКлиенте
Процедура ПроданныеНомераПриОкончанииРедактирования__(Элемент, НоваяСтрока, ОтменаРедактирования)
	//ЭлементыФормы.ПроданныеНомера.ТекущаяСтрока.СуммаЗаПроживание=РасчитатьСтоимостьФакт(ЭлементыФормы.ПроданныеНомера.ТекущаяСтрока)+ЭлементыФормы.ПроданныеНомера.ТекущаяСтрока.СуммаДопМесто;
	////РасчитатьСтоимостьПлан(ЭлементыФормы.ПроданныеНомера.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПроданныеНомераПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ОснРеквизит = Объект;
ИД = Элементы.ПроданныеНомера.ТекущиеДанные.ПолучитьИдентификатор();

СтоимостьФакт = ПроданныеНомераПриОкончанииРедактированияНаСервере(ОснРеквизит, ИД);

Элементы.ПроданныеНомера.ТекущиеДанные.СуммаЗаПроживание = СтоимостьФакт 
	+ Элементы.ПроданныеНомера.ТекущиеДанные.СуммаДопМесто;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроданныеНомераПриОкончанииРедактированияНаСервере(ОснРеквизит, ИД)
ТекущиеДанные = ОснРеквизит.ПроданныеНомера[ИД];	
СтоимостьФакт=РасчитатьСтоимостьФакт(ОснРеквизит, ТекущиеДанные);

Возврат СтоимостьФакт;
КонецФункции

&НаКлиенте
Процедура ПроданныеНомераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроданныеНомераПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры






