
Процедура ОтправитьЗакрытиеФинансовогоПериода(МассивПолучатели, ДатаС, ДатаПо) Экспорт
ИмяФайла = ПисьмаСервер.ФайлЗакрытиеФинансовогоПериода(ДатаС, ДатаПо);
Если ИмяФайла = Неопределено Тогда Возврат; КонецЕсли;
	
Тема = "Отчет Закрытие финансового периода с " + Формат(ДатаС,"ДФ=dd.MM.yyyy")  + " по " + Формат(ДатаПо,"ДФ=dd.MM.yyyy");
ТекстСообщение = "Во вложении " + Тема;

МассивФайлов = Новый Массив;
МассивФайлов.Добавить(ИмяФайла);

ФайлыКУдалению = Новый Массив;

СлужебныеКлиент.ОтправитьEmail(Тема, МассивФайлов, МассивПолучатели, ТекстСообщение
	, ФайлыКУдалению, Новый УникальныйИдентификатор);	
КонецПроцедуры

Процедура ОтправитьЕжедневныйОтчетФактСводный(МассивПолучатели, ДатаС, ДатаПо) Экспорт
ИмяФайла = ПисьмаСервер.ФайлЕжедневныйОтчетФактСводный(ДатаС, ДатаПо);
Если ИмяФайла = Неопределено Тогда Возврат; КонецЕсли;
	
Тема = "Ежедневный отчет Факт сводный с " + Формат(ДатаС,"ДФ=dd.MM.yyyy")  + " по " + Формат(ДатаПо,"ДФ=dd.MM.yyyy");
ТекстСообщение = "Во вложении " + Тема;

МассивФайлов = Новый Массив;
МассивФайлов.Добавить(ИмяФайла);

ФайлыКУдалению = Новый Массив;

СлужебныеКлиент.ОтправитьEmail(Тема, МассивФайлов, МассивПолучатели, ТекстСообщение
	, ФайлыКУдалению, Новый УникальныйИдентификатор);	
КонецПроцедуры
