
Функция ПолучитьДанныеОрганизацииДляФУ() Экспорт 
Ответ = Справочники.Организации.ПолучитьДанныеОрганизацииДляФУ();
Возврат Ответ;
КонецФункции

Функция Кассир(ЭтоКоворкинг) Экспорт
Если НастройкиСервер.ЭтоРеноме() 
ИЛИ НастройкиСервер.ЭтоЧехов() Тогда 		
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если ЗначениеЗаполнено(ТекущийПользователь.Кассир) Тогда
		Кассир = ТекущийПользователь.Кассир;
	Иначе
		Кассир = ТекущийПользователь.Наименование;
	КонецЕсли;
Иначе
	ДанныеОрганизацииДляФУ = ПолучитьДанныеОрганизацииДляФУ();
	Если ЭтоКоворкинг Тогда
		Кассир = ДанныеОрганизацииДляФУ.КоворкингКассир;
	Иначе
		Кассир = ДанныеОрганизацииДляФУ.Кассир;
	КонецЕсли;
КонецЕсли;
	
Возврат Кассир;
КонецФункции


Процедура ЗаписатьОшибкуКММ(ТекстОшибки) Экспорт 
МенеджерЗаписи = РегистрыСведений.ОшибкиККМ.СоздатьМенеджерЗаписи();

МенеджерЗаписи.ДатаВремя = ТекущаяДата();
МенеджерЗаписи.ТекстОшибки = ТекстОшибки;

МенеджерЗаписи.Записать(Истина);
КонецПроцедуры	


//
Функция ЭтоСерверККМ() Экспорт
ЭтоСерверККМ = Константы.СерверККМ.Получить();

Возврат ЭтоСерверККМ;
КонецФункции

Процедура ЗапомнитьДанныеОбработатьДанныеОперации(ПараметрыПодключенияСервер, Команда, РезультатВыполнения, ДанныеОперации) Экспорт
ЭтоСерверККМ = Константы.СерверККМ.Получить();

Если НЕ ЭтоСерверККМ Тогда Возврат;	КонецЕсли;

Если Команда = "CloseShift" ИЛИ Команда = "OpenShift" Тогда

	ДанныеОбработатьДанныеОперации =  Новый Структура("ДанныеОбработатьДанныеОперации");
	ДанныеОбработатьДанныеОперации.Вставить("ПараметрыПодключенияСервер", ПараметрыПодключенияСервер); 
	ДанныеОбработатьДанныеОперации.Вставить("Команда", Команда); 
	ДанныеОбработатьДанныеОперации.Вставить("РезультатВыполнения", РезультатВыполнения); 
	ДанныеОбработатьДанныеОперации.Вставить("ДанныеОперации", ДанныеОперации); 

	ПараметрыСеанса.ДанныеОбработатьДанныеОперации = ПоместитьВоВременноеХранилище(ДанныеОбработатьДанныеОперации, Новый УникальныйИдентификатор());
Иначе
	ПараметрыСеанса.ДанныеОбработатьДанныеОперации = "";
КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеОбработатьДанныеОперации() Экспорт
Если ПараметрыСеанса.ДанныеОбработатьДанныеОперации = "" Тогда
	Возврат Неопределено;
Иначе	
	ДанныеОбработатьДанныеОперации = ПолучитьИзВременногоХранилища(ПараметрыСеанса.ДанныеОбработатьДанныеОперации);

	Возврат ДанныеОбработатьДанныеОперации; 
КонецЕсли;	
КонецФункции


Функция ПолучитьВсеУстройства(ИдентификаторОбъекта, ТекущееРабочееМесто) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ПодключаемоеОборудование.Ссылка КАК Ссылка,
                      |	ПодключаемоеОборудование.Наименование КАК Наименование
                      |ИЗ
                      |	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
                      |ГДЕ
                      |	ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ
                      |	И ПодключаемоеОборудование.УстройствоИспользуется = ИСТИНА
                      |	И ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(перечисление.ТипыПодключаемогоОборудования.ККТ)
                      |	И ПодключаемоеОборудование.ДрайверОборудования.ИдентификаторОбъекта ПОДОБНО &ИдентификаторОбъекта
                      |	И ПодключаемоеОборудование.РабочееМесто <> &РабочееМесто
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ПодключаемоеОборудование.ТипОборудования,
                      |	ПодключаемоеОборудование.Ссылка,
                      |	ПодключаемоеОборудование.Наименование");

	  //"RBSoftPrintServiceKKT3004"
//ИдентификаторОбъекта = "EmulatorKKT1Cffd12";
Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);

//ТекущееРабочееМесто = Неопределено;
Запрос.УстановитьПараметр("РабочееМесто", ТекущееРабочееМесто);

ТЗ = Запрос.Выполнить().Выгрузить();
МассивОборудование = Новый Массив;
Для Каждого Строка Из ТЗ Цикл
	СтруктураДанные = Новый Структура("ОборудованиеСсылка, ОборудованиеНаименование", Строка.Ссылка, Строка.Наименование);
	МассивОборудование.Добавить(СтруктураДанные);	
КонецЦикла;

Возврат МассивОборудование;
КонецФункции





