
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаОтчетаС = ТекущаяДата();
ДатаОтчетаПо = ТекущаяДата();

СписокВыбора = ТипОплатыСписокВыбора();
ТипОплатыСписокВыбора = Элементы.ТипОплатыОтбор.СписокВыбора;
Для каждого Строка Из СписокВыбора Цикл
	ТипОплатыСписокВыбора.Добавить(Строка.Значение, Строка.Представление);
КонецЦикла;

СписокЗначенийДатаС = Элементы.ТипДатаС.СписокВыбора;
СписокЗначенийДатаС.Добавить("ВсеЗаПериод", "Все за период");
СписокЗначенийДатаС.Добавить("ДатаЗаезда", "Дата Заезда");
СписокЗначенийДатаС.Добавить("ДатаВыезда", "Дата Выезда");
ТипДатаС = СписокЗначенийДатаС[0].Значение;

СписокЗначенийДатаПо = Элементы.ТипДатаПо.СписокВыбора;
СписокЗначенийДатаПо.Добавить("ВсеЗаПериод", "Все за период");
СписокЗначенийДатаПо.Добавить("ДатаЗаезда", "Дата Заезда");
СписокЗначенийДатаПо.Добавить("ДатаВыезда", "Дата Выезда");
ТипДатаПо = СписокЗначенийДатаПо[0].Значение;

НеПоказыватьЗакрытыеНераспределенныеОплаты = Истина;
КонецПроцедуры

&НаСервере
Функция ТипОплатыСписокВыбора() 
СписокВыбора = ОтчетыСервер.ТипОплатыСписокВыбора();
Возврат СписокВыбора;
КонецФункции

&НаКлиенте
Процедура ТипДатаСПриИзменении(Элемент)
Если ТипДатаС = "ВсеЗаПериод" Тогда ТипДатаПо = "ВсеЗаПериод"; КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТипДатаПоПриИзменении(Элемент)
Если ТипДатаПо = "ВсеЗаПериод" Тогда ТипДатаС = "ВсеЗаПериод"; КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетаСПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(ДатаОтчетаС) Тогда 
	ПоказатьПредупреждение(,"Заполните дату отчета С");
	
	Возврат;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ДатаОтчетаПо) Тогда ДатаОтчетаПо = ДатаОтчетаС; КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
ОтчетОбъект = РеквизитФормыВЗначение("Объект");

МакетИмя = "ФинансовыйРезультат";
//Макет = Обработки.ФинансовыйРезультат_Новый.ПолучитьМакет(МакетИмя);
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);
	
ИмяОбработки = ОтчетОбъект.Метаданные().Имя;

Если ЗначениеЗаполнено(ДатаОплатыОтбор) ИЛИ ЗначениеЗаполнено(ТипОплатыОтбор) Тогда
	ПолеОтчетаОтборОплат.Очистить();
	ПолеОтчетаОтборОплат = Обработки[ИмяОбработки].СформироватьОтчетОплатыНаСервере(Макет, ДатаОплатыОтбор, ТипОплатыОтбор, Истина);

	Этаформа.ТекущийЭлемент = Этаформа.Элементы.ПолеОтчетаОтборОплат;
Иначе
	//ТабДок = Обработки[ИмяОбработки].СформироватьОтчетНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо, БронируетОтбор, Истина);	
	ТабДок = Обработки[ИмяОбработки].СформироватьОтчетНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо, ТипДатаС, ТипДатаПо
		, БронируетОтбор, НеПоказыватьЗакрытыеНераспределенныеОплаты, Истина);	
	//ТабДок = Новый ТабличныйДокумент;
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	Для Индекс = 1 По КоличествоСтрок Цикл
		ОбластьТекст = ТабДок.Область(Индекс, 1, Индекс, 1).Текст; 	
		Если ОбластьТекст = "" Тогда
			ОбластьКУдалению = ТабДок.Область(Индекс, , Индекс, ); 	

			ТабДок.УдалитьОбласть(ОбластьКУдалению, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
	КонецЦикла;
	
	ПолеОтчетаФорма.Очистить();
	ПолеОтчетаФорма = ТабДок;
	
	Этаформа.ТекущийЭлемент = Этаформа.Элементы.ПолеОтчетаФорма;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРаспределениеОплат(Команда)
	СформироватьРаспределениеОплатНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьРаспределениеОплатНаСервере()
ОтчетОбъект = РеквизитФормыВЗначение("Объект");

МакетИмя = "РаспределениеОплат";
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

ИмяОбработки = ОтчетОбъект.Метаданные().Имя;

ПолеОтчетаРаспределениеОплат = Обработки[ИмяОбработки].СформироватьОтчетРаспределениеОплатНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо, Истина);

Этаформа.ТекущийЭлемент = Этаформа.Элементы.ПолеОтчетаРаспределениеОплат; 
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
ТестНаСервере();	
КонецПроцедуры


&НаСервере
Процедура ТестНаСервере()
ОтчетОбъект = РеквизитФормыВЗначение("Объект");
ИмяОбработки = ОтчетОбъект.Метаданные().Имя;

ТабДок = Обработки[ИмяОбработки].ТЗ(ДатаОтчетаС, ДатаОтчетаПо);
//СформироватьОтчетНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо, БронируетОтбор, Истина);	
КонецПроцедуры




