
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КонкурентыОтели.Ссылка КАК Отель
                      |ИЗ
                      |	Справочник.КонкурентыОтели КАК КонкурентыОтели
                      |ГДЕ
                      |	КонкурентыОтели.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КонкурентыОтели.Номер_пп,
                      |	КонкурентыОтели.Наименование");

ТЗ = Запрос.Выполнить().Выгрузить();

НоваяСтрока = КонкурентыОтели.Добавить();
	
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = КонкурентыОтели.Добавить();
	НоваяСтрока.Отель = Строка.Отель;
КонецЦикла;
	
ДатаЗадания = НачалоДня(ТекущаяДата());

Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Объект.ДатаЗадания = ДатаЗадания;
	
	//ДатаС = '20240901';
	//ДатаПо = ДатаС + 30 * 24 * 60 * 60;
	ДатаС = НачалоДня(ТекущаяДата() + 24 * 60 * 60);
	ДатаПо = ДатаС + 30 * 24 * 60 * 60;
	
	СоздатьЗаданиеНаСервере(ДатаС, ДатаПо);
	
Иначе
	
	ДатаС = НачалоДня(Объект.ДатаЗадания) + 24 * 60 * 60;
	ДатаПо = ДатаС + 30 * 24 * 60 * 60;

	Для Каждого Строка Из Объект.ДанныеДата Цикл
		НоваяСтрока = ТЗЗадание.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из Объект.ДанныеОтели Цикл
		НоваяСтрока = ТЗЗаданиеОтели.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;

КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если ТЗЗадание.Количество() = 0 Тогда
	ПоказатьПредупреждение(, "Нет данных для создания Задания");
	
	Отказ = Истина;	
КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданиеНаСервере(ДатаС, ДатаПо)
ЗагрузитьТЗАналитика(ДатаС, ДатаПо);
ЗагрузитьТЗЗаданияПредыдущие(ДатаС, ДатаПо);

ТЗЗадание.Очистить();

ТЗГраницы = ТЗГраницы(); 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КатегорииНомеров.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                      |ГДЕ
                      |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ
                      |	И КатегорииНомеров.Базовый = ИСТИНА");

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	 КатегорияНомеровБазовый = Выборка.Ссылка;
Иначе
	КатегорияНомеровБазовый = Неопределено;
КонецЕсли;

Для Каждого Строка Из ТЗАналитика Цикл
	
	Если Строка.Дата = '20240815' Тогда
		ш= 1;
	КонецЕсли;
	
	ГраницаТекущий = ГраницаЗначение(Строка.ИтогЗанято, ТЗГраницы);
	Если ГраницаТекущий = 0 Тогда
		Перейти ~ПРОДОЛЖИТЬ;
	КонецЕсли;	
	
	ОтборСтроки = Новый Структура("Дата", Строка.Дата); 
	НайденныеСтроки = ТЗЗаданиеПредыдущие.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
	     СтрокаТЗЗаданиеПредыдущие = НайденныеСтроки[0];
		 
		ГраницаДатаЗаданияПредыдущий = ГраницаЗначение(СтрокаТЗЗаданиеПредыдущие.ЗанятоПроцент, ТЗГраницы);
		Если ГраницаДатаЗаданияПредыдущий = ГраницаТекущий Тогда 
			Перейти ~ПРОДОЛЖИТЬ;
		КонецЕсли;
	КонецЕсли;
	
	НоваяСтрока = ТЗЗадание.Добавить();
	НоваяСтрока.Дата = Строка.Дата;
	НоваяСтрока.ЗанятоПроцент = Строка.ИтогЗанято;
	НоваяСтрока.СреднийADR = Строка.СреднийADR;
	НоваяСтрока.ГлубинаБронирования = Строка.ГлубинаБронирования;
	
	Если ЗначениеЗаполнено(КатегорияНомеровБазовый) Тогда 
		РезультатЦенаДня = КалендарьЦен.ПолучитьТекущаяЦенаДня(Строка.Дата, КатегорияНомеровБазовый, Ложь);
		НашаЦена = РезультатЦенаДня.ТекущаяЦенаДняОдноместный;
	Иначе	
		НашаЦена = 0;
	КонецЕсли;
	НоваяСтрока.НашаЦена = НашаЦена;
	
	Для Каждого СтрокаОтель Из КонкурентыОтели Цикл
		НоваяСтрока = ТЗЗаданиеОтели.Добавить();
		
		НоваяСтрока.Дата = Строка.Дата;
		НоваяСтрока.Отель = СтрокаОтель.Отель;
		
	КонецЦикла;	
	
~ПРОДОЛЖИТЬ:	
КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТЗАналитика(ДатаС, ДатаПо)
ТЗ = Новый ТаблицаЗначений;                      
м= Новый Массив;
м.Добавить(Тип("Дата"));
ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("День", Новый ОписаниеТипов(м,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
//Переберем все даты за период 
ТекДат = НачалоДня(ДатаС);
Пока ТекДат <= НачалоДня(ДатаПо) Цикл 
	//Добавим текущую дату в таблицу периодов
	НовСтр = ТЗ.Добавить();
	НовСтр.День = ТекДат;
	
	ТекДат = ТекДат + 86400; //Добавим 1 День
КонецЦикла;
	
////Запрос = Новый Запрос("ВЫБРАТЬ
////                      |	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗанятостьНомеров.ПериодРезерва, ЧАС, -13), ДЕНЬ) КАК ЗанятыйДень,
////                      |	ЗанятостьНомеров.Номер КАК Номер,
////                      |	ЗанятостьНомеров.Регистратор КАК Регистратор
////                      |ПОМЕСТИТЬ ВТ_Бронь_Регистратор
////                      |ИЗ
////                      |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
////                      |ГДЕ
////                      |	ЗанятостьНомеров.ПериодРезерва >= &ПериодНачало
////                      |	И ЗанятостьНомеров.ПериодРезерва <= &ПериодКонец
////                      |	И ЧАС(ЗанятостьНомеров.ПериодРезерва) <> ЧАС(ДАТАВРЕМЯ(1, 1, 1, 12, 0, 0))
////                      |	И ЗанятостьНомеров.Номер <> &Номер
////                      |	И ЗанятостьНомеров.Регистратор.ТипБронирования <> &ТипБронирования
////                      |
////                      |СГРУППИРОВАТЬ ПО
////                      |	ЗанятостьНомеров.Номер,
////                      |	ЗанятостьНомеров.Регистратор,
////                      |	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗанятостьНомеров.ПериодРезерва, ЧАС, -13), ДЕНЬ)
////                      |;
////                      |
////                      |////////////////////////////////////////////////////////////////////////////////
////                      |ВЫБРАТЬ
////                      |	Заявки.ЗанятыйДень КАК ЗанятыйДень,
////                      |	Заявки.Номер КАК Номер,
////                      |	Заявки.Регистратор КАК Регистратор,
////                      |	ЕСТЬNULL(Проживание.Сумма, 0) КАК Сумма
////                      |ПОМЕСТИТЬ ВТ_Бронь
////                      |ИЗ
////                      |	ВТ_Бронь_Регистратор КАК Заявки
////                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
////                      |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
////                      |			СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма,
////                      |			ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания
////                      |		ИЗ
////                      |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
////                      |		
////                      |		СГРУППИРОВАТЬ ПО
////                      |			ЗаявкаНаБронированиеПроживание.Ссылка,
////                      |			ЗаявкаНаБронированиеПроживание.ДеньПроживания) КАК Проживание
////                      |		ПО Заявки.Регистратор = Проживание.Ссылка
////                      |			И Заявки.ЗанятыйДень = Проживание.ДеньПроживания
////                      |;
////                      |
////                      |////////////////////////////////////////////////////////////////////////////////
////                      |ВЫБРАТЬ
////                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК ОбщееКоличество,
////                      |	НомернойФонд.КатегорияНомера КАК КатегорияНомера
////                      |ПОМЕСТИТЬ ВТ_КоличествоНомеров
////                      |ИЗ
////                      |	Справочник.НомернойФонд КАК НомернойФонд
////                      |ГДЕ
////                      |	НЕ НомернойФонд.ПометкаУдаления
////                      |	И НомернойФонд.Ссылка <> &Номер
////                      |
////                      |СГРУППИРОВАТЬ ПО
////                      |	НомернойФонд.КатегорияНомера
////                      |;
////                      |
////                      |////////////////////////////////////////////////////////////////////////////////
////                      |ВЫБРАТЬ
////                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоЗанятых,
////                      |	ВТ_Бронь.ЗанятыйДень КАК ЗанятыйДень,
////                      |	НомернойФонд.КатегорияНомера КАК КатегорияНомера,
////					  //|	СРЕДНЕЕ(ВЫБОР
////					  //|			КОГДА ВТ_Бронь.Регистратор.РезервС = ВТ_Бронь.ЗанятыйДень
////					  //|				ТОГДА РАЗНОСТЬДАТ(ВТ_Бронь.Регистратор.Дата, ВТ_Бронь.Регистратор.РезервС, ДЕНЬ)
////					  //|			ИНАЧЕ 0
////					  //|		КОНЕЦ) КАК ГлубинаБрони,
////                    |	Сумма(ВЫБОР
////                      |			КОГДА ВТ_Бронь.Регистратор.РезервС = ВТ_Бронь.ЗанятыйДень
////                      |				ТОГДА РАЗНОСТЬДАТ(ВТ_Бронь.Регистратор.Дата, ВТ_Бронь.Регистратор.РезервС, ДЕНЬ)
////                      |			ИНАЧЕ 0
////                      |		КОНЕЦ) КАК СуммаГлубинаБрони,
////                    |	
////                      |	Сумма(ВЫБОР		КОГДА ВТ_Бронь.Регистратор.РезервС = ВТ_Бронь.ЗанятыйДень
////                      |				ТОГДА 1
////                      |			ИНАЧЕ 0
////                      |		КОНЕЦ) КАК КоличествоГлубинаБрони,
////                    |	СУММА(ВТ_Бронь.Сумма) КАК Сумма
////                      |ПОМЕСТИТЬ ВТ_Номера
////                      |ИЗ
////                      |	Справочник.НомернойФонд КАК НомернойФонд
////                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Бронь КАК ВТ_Бронь
////                      |		ПО (ВТ_Бронь.Номер = НомернойФонд.Ссылка)
////                      |ГДЕ
////                      |	НЕ НомернойФонд.ПометкаУдаления
////                      |	И НомернойФонд.Ссылка <> &Номер
////                      |
////                      |СГРУППИРОВАТЬ ПО
////                      |	ВТ_Бронь.ЗанятыйДень,
////                      |	НомернойФонд.КатегорияНомера
////                      |;
////                      |
////                      |////////////////////////////////////////////////////////////////////////////////
////                      |ВЫБРАТЬ
////                      |	ТабДата.День КАК День
////                      |ПОМЕСТИТЬ ВТ_Дни
////                      |ИЗ
////                      |	&ТабДата КАК ТабДата
////                      |;
////                      |
////                      |////////////////////////////////////////////////////////////////////////////////
////                      |ВЫБРАТЬ
////                      |	ВТ_Дни.День КАК День,
////                      |	МАКСИМУМ(ВТ_КоличествоНомеров.ОбщееКоличество) КАК ОбщееКоличество,
////                      |	ВТ_КоличествоНомеров.КатегорияНомера КАК КатегорияНомера
////                      |ПОМЕСТИТЬ ВТ_ДниС
////                      |ИЗ
////                      |	ВТ_Дни КАК ВТ_Дни,
////                      |	ВТ_КоличествоНомеров КАК ВТ_КоличествоНомеров
////                      |
////                      |СГРУППИРОВАТЬ ПО
////                      |	ВТ_КоличествоНомеров.КатегорияНомера,
////                      |	ВТ_Дни.День
////                      |;
////                      |
////                      |////////////////////////////////////////////////////////////////////////////////
////                      |ВЫБРАТЬ
////                      |	ЕСТЬNULL(ВТ_Номера.КоличествоЗанятых, 0) КАК ЗанятыеНомера,
////                      |	ВТ_ДниС.День КАК ПериодДень,
////                      |	ВТ_ДниС.ОбщееКоличество КАК ОбщееКоличество,
////                      |	ВТ_ДниС.КатегорияНомера КАК КатегорияНомера,
////                      |	ВТ_ДниС.КатегорияНомера.Наименование КАК Наименование,
////                      |	ВТ_ДниС.ОбщееКоличество - ЕСТЬNULL(ВТ_Номера.КоличествоЗанятых, 0) КАК СвободныеНомера,
////					  |	ЕстьNULL(ВТ_Номера.СуммаГлубинаБрони, 0) КАК СуммаГлубинаБрони,
////					  |	ЕстьNULL(ВТ_Номера.КоличествоГлубинаБрони, 0) КАК КоличествоГлубинаБрони,
////					  //| Выбор Когда ВТ_Номера.КоличествоГлубинаБрони = 0 Тогда 0 Иначе
////					  //|ВТ_Номера.СуммаГлубинаБрони / ВТ_Номера.КоличествоГлубинаБрони Конец Как ГлубинаБрони,
////                      |	ВТ_Номера.Сумма КАК СуммаADR
////					  //|,
////					  //|	ВЫБОР
////					  //|		КОГДА ЕСТЬNULL(ВТ_Номера.КоличествоЗанятых, 0) = 0
////					  //|			ТОГДА 0
////					  //|		ИНАЧЕ ВТ_Номера.Сумма / ВТ_Номера.КоличествоЗанятых
////					  //|	КОНЕЦ КАК ADR
////                      |ИЗ
////                      |	ВТ_ДниС КАК ВТ_ДниС
////                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номера КАК ВТ_Номера
////                      |		ПО ВТ_ДниС.День = ВТ_Номера.ЗанятыйДень
////                      |			И ВТ_ДниС.КатегорияНомера = ВТ_Номера.КатегорияНомера
////                      |
////                      |УПОРЯДОЧИТЬ ПО
////                      |	ПериодДень,
////                      |	ВТ_Номера.КатегорияНомера.Номер_пп,
////                      |	ВТ_Номера.КатегорияНомера.Наименование
////                      |ИТОГИ
////                      |	СУММА(ЗанятыеНомера),
////                      |	СУММА(ОбщееКоличество),
////                      |	СУММА(КоличествоГлубинаБрони),
////					                        |	СУММА(СуммаГлубинаБрони),
////                      |	Сумма(СуммаADR)
////					  //|,
////					  //|	СРЕДНЕЕ(ADR)
////                      |ПО
////                      |	ПериодДень");

////					  //|	СРЕДНЕЕ(РАЗНОСТЬДАТ(ВТ_Бронь.Регистратор.Дата, ВТ_Бронь.Регистратор.РезервС, ДЕНЬ)) КАК ГлубинаБрони

ТЗАналитикаЗапросТекст = КалендарьЦен.ТЗАналитикаЗапросТекст();
Запрос = Новый Запрос(ТЗАналитикаЗапросТекст);

Запрос.УстановитьПараметр("ТабДата", ТЗ);
Запрос.УстановитьПараметр("ПериодНачало",ДатаС);
Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ДатаПо));
Запрос.УстановитьПараметр("Номер", Справочники.НомернойФонд.НайтиПоНаименованию("Переговорная", Истина));
Запрос.УстановитьПараметр("ТипБронирования",Справочники.ТипБронирования.Ремонт);

Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	
ТЗАналитика.Очистить();
Пока Выборка.Следующий() Цикл
	//ВыборкаДва = Выборка.Выбрать();
	
	Если Выборка.ПериодДень = '20240604' Тогда
		  ш= 1;
	КонецЕсли;
		
	НоваяТЗАналитика = ТЗАналитика.Добавить();
	НоваяТЗАналитика.Дата = Выборка.ПериодДень;
	НоваяТЗАналитика.ДатаМесяц = НачалоМесяца(Выборка.ПериодДень);
	
	НоваяТЗАналитика.ДеньНедели = ДеньНедели(Выборка.ПериодДень);
	
	НоваяТЗАналитика.ОбщееКоличество = Выборка.ОбщееКоличество;
	
	ИтогЗанятo = Окр(100 * Выборка.ЗанятыеНомера / Выборка.ОбщееКоличество, 1);
	НоваяТЗАналитика.ИтогЗанято = ИтогЗанятo;
	
	Если Выборка.ЗанятыеНомера > 0 Тогда
		НоваяТЗАналитика.СреднийADR = Окр(Выборка.СуммаADR / Выборка.ЗанятыеНомера);
	КонецЕсли;
	
	Если Выборка.КоличествоГлубинаБрони > 0 Тогда 
		НоваяТЗАналитика.ГлубинаБронирования = Окр(Выборка.СуммаГлубинаБрони / Выборка.КоличествоГлубинаБрони, 1);
	КонецЕсли;
КонецЦикла;


КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТЗЗаданияПредыдущие(ДатаС, ДатаПо)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентовАналитика.ДатаЗадания КАК ДатаЗадания,
                      |	ЦеныКонкурентовАналитика.Дата КАК Дата,
                      |	ЦеныКонкурентовАналитика.Цена КАК Цена,
                      |	ЦеныКонкурентовАналитика.СреднийADR КАК СреднийADR,
                      |	ЦеныКонкурентовАналитика.ЗанятоПроцент КАК ЗанятоПроцент,
                      |	ЦеныКонкурентовАналитика.НашаЦена КАК НашаЦена
                      |ИЗ
                      |	РегистрСведений.ЦеныКонкурентовАналитика КАК ЦеныКонкурентовАналитика
                      |ГДЕ
                      |	ЦеныКонкурентовАналитика.Дата МЕЖДУ &ДатаС И &ДатаПо
                      |	И ЦеныКонкурентовАналитика.ДатаЗадания < &ДатаЗадания
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Дата,
                      |	ДатаЗадания УБЫВ");	

 
Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ДатаЗадания_П = ДатаС - 1 * 24 * 60 *60; 
Запрос.УстановитьПараметр("ДатаЗадания", ДатаЗадания_П);

ТЗ = Запрос.Выполнить().Выгрузить();
	
ТЗЗаданиеПредыдущие.Очистить();
ДатаЗаданияПредыдущий = '00010101';
ДатаПредыдущий = '00010101';
Для Каждого Строка Из ТЗ Цикл
	
	Если Строка.Дата = ДатаПредыдущий Тогда 
		Если Строка.ДатаЗадания < ДатаЗаданияПредыдущий Тогда 
		     Перейти ~ПРОДОЛЖИТЬ;
		КонецЕсли;
	КонецЕсли;
	
	НоваяТЗЗаданиеПредыдущие = ТЗЗаданиеПредыдущие.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяТЗЗаданиеПредыдущие, Строка);
	
~ПРОДОЛЖИТЬ:	
	ДатаПредыдущий = Строка.Дата;
	ДатаЗаданияПредыдущий = Строка.ДатаЗадания;
КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТЗГраницы() 
ТЗГраницы = НОвый ТаблицаЗначений;
ТЗГраницы.Колонки.Добавить("ПроцентЗагрузки");
НоваяСтрока = ТЗГраницы.Добавить();
НоваяСтрока.ПроцентЗагрузки = 30;
НоваяСтрока = ТЗГраницы.Добавить();
НоваяСтрока.ПроцентЗагрузки = 45;
НоваяСтрока = ТЗГраницы.Добавить();
НоваяСтрока.ПроцентЗагрузки = 60;
НоваяСтрока = ТЗГраницы.Добавить();
НоваяСтрока.ПроцентЗагрузки = 75;
НоваяСтрока = ТЗГраницы.Добавить();
НоваяСтрока.ПроцентЗагрузки = 90;

Возврат ТЗГраницы
КонецФункции

&НаСервере
Функция ГраницаЗначение(ПроцентЗагрузки, ТЗГраницы) 
Если ПроцентЗагрузки < ТЗГраницы[0].ПроцентЗагрузки Тогда 
	Возврат 0;
ИначеЕсли ПроцентЗагрузки < ТЗГраницы[1].ПроцентЗагрузки Тогда 
	Возврат ТЗГраницы[0].ПроцентЗагрузки;
ИначеЕсли ПроцентЗагрузки < ТЗГраницы[2].ПроцентЗагрузки Тогда 
	Возврат ТЗГраницы[1].ПроцентЗагрузки;
ИначеЕсли ПроцентЗагрузки < ТЗГраницы[3].ПроцентЗагрузки Тогда 
	Возврат ТЗГраницы[2].ПроцентЗагрузки;
ИначеЕсли ПроцентЗагрузки < ТЗГраницы[4].ПроцентЗагрузки Тогда 
	Возврат ТЗГраницы[3].ПроцентЗагрузки;
Иначе
	Возврат ТЗГраницы[4].ПроцентЗагрузки;
КонецЕсли;;
КонецФункции

//

&НаКлиенте
Процедура ОбновитьЗадание(Команда)
ОбновитьЗаданиеНаСервере(ДатаС, ДатаПо);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаданиеНаСервере(ДатаС, ДатаПо)
ЗагрузитьТЗАналитика(ДатаС, ДатаПо);
ЗагрузитьТЗЗаданияПредыдущие(ДатаС, ДатаПо);

ТЗЗадание.Очистить();

ТЗГраницы = ТЗГраницы(); 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КатегорииНомеров.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                      |ГДЕ
                      |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ
                      |	И КатегорииНомеров.Базовый = ИСТИНА");

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	 КатегорияНомеровБазовый = Выборка.Ссылка;
Иначе
	КатегорияНомеровБазовый = Неопределено;
КонецЕсли;

Для Каждого Строка Из ТЗАналитика Цикл
	
	Если Строка.Дата = '20240815' Тогда
		ш= 1;
	КонецЕсли;
	
	ГраницаТекущий = ГраницаЗначение(Строка.ИтогЗанято, ТЗГраницы);
	Если ГраницаТекущий = 0 Тогда
		Перейти ~ПРОДОЛЖИТЬ;
	КонецЕсли;	
	
	ОтборСтроки = Новый Структура("Дата", Строка.Дата); 
	НайденныеСтроки = ТЗЗаданиеПредыдущие.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
	     СтрокаТЗЗаданиеПредыдущие = НайденныеСтроки[0];
		 
		ГраницаДатаЗаданияПредыдущий = ГраницаЗначение(СтрокаТЗЗаданиеПредыдущие.ЗанятоПроцент, ТЗГраницы);
		Если ГраницаДатаЗаданияПредыдущий = ГраницаТекущий Тогда 
			Перейти ~ПРОДОЛЖИТЬ;
		КонецЕсли;
	КонецЕсли;
	
	НоваяСтрока = ТЗЗадание.Добавить();
	НоваяСтрока.Дата = Строка.Дата;
	НоваяСтрока.ЗанятоПроцент = Строка.ИтогЗанято;
	НоваяСтрока.СреднийADR = Строка.СреднийADR;
	НоваяСтрока.ГлубинаБронирования = Строка.ГлубинаБронирования;
	
	Если ЗначениеЗаполнено(КатегорияНомеровБазовый) Тогда 
		РезультатЦенаДня = КалендарьЦен.ПолучитьТекущаяЦенаДня(Строка.Дата, КатегорияНомеровБазовый, Ложь);
		НашаЦена = РезультатЦенаДня.ТекущаяЦенаДняОдноместный;
	Иначе	
		НашаЦена = 0;
	КонецЕсли;
	НоваяСтрока.НашаЦена = НашаЦена;
	
	//Для Каждого СтрокаОтель Из КонкурентыОтели Цикл
	//	НоваяСтрока = ТЗЗаданиеОтели.Добавить();
	//	
	//	НоваяСтрока.Дата = Строка.Дата;
	//	НоваяСтрока.Отель = СтрокаОтель.Отель;
	//	
	//КонецЦикла;	
	
~ПРОДОЛЖИТЬ:	
КонецЦикла;

КонецПроцедуры


//
&НаКлиенте
Процедура ТЗЗаданиеПриАктивизацииСтроки(Элемент)
ТД = Элемент.ТекущиеДанные;
Если ТД = Неопределено Тогда
	Дата_П = Неопределено;
Иначе	
	Дата_П = ТД.Дата;
КонецЕсли;
	
ОтборСтрок = Новый ФиксированнаяСтруктура("Дата", Дата_П);	
	
Элементы.ТЗЗаданиеОтели.ОтборСтрок = ОтборСтрок;	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
ДанныеДата = Объект.ДанныеДата;
ДанныеДата.Очистить();
Для Каждого Строка Из ТЗЗадание Цикл
	НоваяСтрока = ДанныеДата.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

ДанныеОтели = Объект.ДанныеОтели;
ДанныеОтели.Очистить();
Для Каждого Строка Из ТЗЗаданиеОтели Цикл
	НоваяСтрока = ДанныеОтели.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ТЗЗаданиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если Поле.Имя = "ТЗЗаданиеДата" Тогда	
	ТД = ТЗЗадание.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Дата = ТД.Дата;
	
	ТабДок = КалендарьЦен.ПолучитьТабДокРасшифровкаКонкурентыЦенаАналитика(Дата, КонкурентыОтели);
		
	ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Цены конкурентов");
		
	ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТЗЗаданиеОтелиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ТЗЗаданиеОтелиПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры




