
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Список.Параметры.УстановитьЗначениеПараметра("РезервПо_C", '00010101'); 
Список.Параметры.УстановитьЗначениеПараметра("РезервПо_По", '00010101'); 
Список.Параметры.УстановитьЗначениеПараметра("К1", 100); 
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьТурНалог(Команда)
Список.Параметры.УстановитьЗначениеПараметра("РезервПо_C", НачалоМесяца(ДатаРасчета)); 
Список.Параметры.УстановитьЗначениеПараметра("РезервПо_По", ДатаРасчета);  

Если ДатаРасчета < '20260101' Тогда К1 = 101; Иначе К1 = 102; КонецЕсли;
Список.Параметры.УстановитьЗначениеПараметра("К1", К1); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасчетаПриИзменении(Элемент)
ДатаРасчета = КонецМесяца(ДатаРасчета);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура("Ключ", ТД.Заявка);
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура Тест(Команда)
ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере() 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронирование.Ссылка КАК Заявка,
	                      |	ЗаявкаНаБронирование.Клиент КАК Клиент,
	                      |	ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
	                      |	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
	                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
	                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
	                      |	ЗаявкаНаБронирование.Статус КАК Статус,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаПроживания КАК ЧИСЛО(10, 0)) КАК СуммаПроживания,
	                      |	Проживания.КоличествоПроживаний КАК КоличествоПроживаний,
	                      |	Проживания.СуммаДеньРасчет КАК СуммаДеньРасчет,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаТурНалога_OLD КАК ЧИСЛО(10, 0)) КАК СуммаТурНалога_OLD,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаТурНалога КАК ЧИСЛО(10, 0)) КАК СуммаТурНалога,
	                      |	Проживания.Сумма_100 КАК Сумма_100,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаРасчет КАК ЧИСЛО(10, 0)) КАК СуммаРасчет
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	                      |			СУММА(1) КАК КоличествоПроживаний,
	                      |			СУММА(100) КАК Сумма_100,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |						ТОГДА 0
	                      |					ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 0))
	                      |				КОНЕЦ) КАК СуммаПроживания,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |						ТОГДА 0
	                      |					ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 0))
	                      |				КОНЕЦ) / СУММА(1) / &К1 КАК СуммаДеньРасчет,
	                      |			ВЫБОР
	                      |				КОГДА СУММА(ВЫБОР
	                      |							КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |								ТОГДА 0
	                      |							ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 0))
	                      |						КОНЕЦ) / СУММА(1) / &К1 > 100
	                      |					ТОГДА СУММА(ВЫБОР
	                      |								КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |									ТОГДА 0
	                      |								ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 0))
	                      |							КОНЕЦ) / &К1
	                      |				ИНАЧЕ СУММА(100)
	                      |			КОНЕЦ КАК СуммаТурНалога,
	                      |			СУММА(ВЫРАЗИТЬ(ВЫБОР
	                      |						КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫБОР
	                      |								КОГДА ЗаявкаНаБронированиеПроживание.Сумма / &К1 > 100
	                      |									ТОГДА ЗаявкаНаБронированиеПроживание.Сумма / &К1
	                      |								ИНАЧЕ 100
	                      |							КОНЕЦ
	                      |					КОНЕЦ КАК ЧИСЛО(10, 0))) КАК СуммаТурНалога_OLD,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |						ТОГДА 0
	                      |					ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма КАК ЧИСЛО(10, 0))
	                      |				КОНЕЦ) / &К1 КАК СуммаРасчет
	                      |		ИЗ
	                      |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК Проживания
	                      |		ПО ЗаявкаНаБронирование.Ссылка = Проживания.Ссылка
	                      |ГДЕ
	                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
	                      |	И ЗаявкаНаБронирование.РезервПо >= &РезервПо_C
	                      |	И ЗаявкаНаБронирование.РезервПо <= &РезервПо_По
	                      |	И ЗаявкаНаБронирование.Клиент.Наименование = &Наименование");
         
Запрос.УстановитьПараметр("РезервПо_C", НачалоМесяца(ДатаРасчета)); 
Запрос.УстановитьПараметр("РезервПо_По", ДатаРасчета);  
Запрос.УстановитьПараметр("Наименование", "Пахомова Наталья");  

Если ДатаРасчета < '20260101' Тогда К1 = 101; Иначе К1 = 102; КонецЕсли;
Запрос.УстановитьПараметр("К1", К1); 

ТЗ = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры


&НаСервере
Процедура ТестНаСервере_1() 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронирование.Ссылка КАК Заявка,
	                      |	ЗаявкаНаБронирование.Клиент КАК Клиент,
	                      |	ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
	                      |	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
	                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
	                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
	                      |	ЗаявкаНаБронирование.Статус КАК Статус,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаПроживания КАК ЧИСЛО(10, 0)) КАК СуммаПроживания,
	                      |	Проживания.КоличествоПроживаний КАК КоличествоПроживаний,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаТурНалога КАК ЧИСЛО(10, 0)) КАК СуммаТурНалога,
	                      |	Проживания.Сумма_100 КАК Сумма_100,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаРасчет КАК ЧИСЛО(10, 0)) КАК СуммаРасчет
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	                      |			СУММА(1) КАК КоличествоПроживаний,
	                      |			СУММА(100) КАК Сумма_100,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |						ТОГДА 0
	                      |					ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество КАК ЧИСЛО(10, 0))
	                      |				КОНЕЦ) КАК СуммаПроживания,
	                      |			СУММА(ВЫРАЗИТЬ(ВЫБОР
	                      |						КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫБОР
	                      |								КОГДА (ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество) / &К1 > 100
	                      |									ТОГДА (ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество) / &К1
	                      |								ИНАЧЕ 100
	                      |							КОНЕЦ
	                      |					КОНЕЦ КАК ЧИСЛО(10, 0))) КАК СуммаТурНалога,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |						ТОГДА 0
	                      |					ИНАЧЕ ВЫРАЗИТЬ((ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество) / &К1 КАК ЧИСЛО(10, 0))
	                      |				КОНЕЦ) КАК СуммаРасчет
	                      |		ИЗ
	                      |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК Проживания
	                      |		ПО ЗаявкаНаБронирование.Ссылка = Проживания.Ссылка
	                      |ГДЕ
	                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
	                      |	И ЗаявкаНаБронирование.РезервПо >= &РезервПо_C
	                      |	И ЗаявкаНаБронирование.РезервПо <= &РезервПо_По
	                      |	И ЗаявкаНаБронирование.Клиент.Наименование = &Наименование");

Запрос.УстановитьПараметр("РезервПо_C", НачалоМесяца(ДатаРасчета)); 
Запрос.УстановитьПараметр("РезервПо_По", ДатаРасчета);  
Запрос.УстановитьПараметр("Наименование", "Демидов Кирилл Валентинович");  

Если ДатаРасчета < '20260101' Тогда К1 = 101; Иначе К1 = 102; КонецЕсли;
Запрос.УстановитьПараметр("К1", К1); 

ТЗ = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере_2() 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронирование.Ссылка КАК Заявка,
	                      |	ЗаявкаНаБронирование.Клиент КАК Клиент,
	                      |	ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
	                      |	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
	                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
	                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
	                      |	ЗаявкаНаБронирование.Статус КАК Статус,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаПроживания КАК ЧИСЛО(10, 0)) КАК СуммаПроживания,
	                      |	Проживания.КоличествоПроживаний КАК КоличествоПроживаний,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаТурНалога_1 КАК ЧИСЛО(10, 0)) КАК СуммаТурНалога_1,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаТурНалога КАК ЧИСЛО(10, 0)) КАК СуммаТурНалога,
	                      |	Проживания.Сумма_100 КАК Сумма_100,
	                      |	ВЫРАЗИТЬ(Проживания.СуммаРасчет КАК ЧИСЛО(10, 0)) КАК СуммаРасчет
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	                      |			СУММА(1) КАК КоличествоПроживаний,
	                      |			СУММА(100) КАК Сумма_100,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |						ТОГДА 0
	                      |					ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество КАК ЧИСЛО(10, 0))
	                      |				КОНЕЦ) КАК СуммаПроживания,
	                      |			ВЫБОР
	                      |				КОГДА СУММА(ВЫБОР
	                      |							КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |								ТОГДА 0
	                      |							ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество КАК ЧИСЛО(10, 0))
	                      |						КОНЕЦ) / СУММА(1) > СУММА(100)
	                      |					ТОГДА СУММА(ВЫБОР
	                      |								КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |									ТОГДА 0
	                      |								ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество КАК ЧИСЛО(10, 0))
	                      |							КОНЕЦ) / СУММА(1) / &К1
	                      |				ИНАЧЕ СУММА(100)
	                      |			КОНЕЦ КАК СуммаТурНалога_1,
	                      |			СУММА(ВЫРАЗИТЬ(ВЫБОР
	                      |						КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫБОР
	                      |								КОГДА ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество / &К1 > 100
	                      |									ТОГДА ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество / &К1
	                      |								ИНАЧЕ 100
	                      |							КОНЕЦ
	                      |					КОНЕЦ КАК ЧИСЛО(10, 0))) КАК СуммаТурНалога,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронированиеПроживание.Количество = 0
	                      |						ТОГДА 0
	                      |					ИНАЧЕ ВЫРАЗИТЬ(ЗаявкаНаБронированиеПроживание.Сумма / ЗаявкаНаБронированиеПроживание.Количество / &К1 КАК ЧИСЛО(10, 0))
	                      |				КОНЕЦ) КАК СуммаРасчет
	                      |		ИЗ
	                      |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК Проживания
	                      |		ПО ЗаявкаНаБронирование.Ссылка = Проживания.Ссылка
	                      |ГДЕ
	                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
	                      |	И ЗаявкаНаБронирование.РезервПо >= &РезервПо_C
	                      |	И ЗаявкаНаБронирование.РезервПо <= &РезервПо_По
	                      |	И ЗаявкаНаБронирование.Клиент.Наименование = &Наименование");
         
Запрос.УстановитьПараметр("РезервПо_C", НачалоМесяца(ДатаРасчета)); 
Запрос.УстановитьПараметр("РезервПо_По", ДатаРасчета);  
Запрос.УстановитьПараметр("Наименование", "Демидов Кирилл Валентинович");  

Если ДатаРасчета < '20260101' Тогда К1 = 101; Иначе К1 = 102; КонецЕсли;
Запрос.УстановитьПараметр("К1", К1); 

ТЗ = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

