

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере()
ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
//ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);

//// Записать соответствие пространств имен для сокращения размера файла сообщения
//ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
//ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
//ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");

//Сообщение = Новый СообщениеПользователю;
//Сообщение.Текст = " Номер сообщения: " + ЗаписьСообщения.НомерСообщения;
//Сообщение.Сообщить();
	Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЧЕХОВ");	

//ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел, ЗаписьСообщения.НомерСообщения);

Пока ВыборкаИзменений.Следующий() Цикл
	Данные = ВыборкаИзменений.Получить();
КонецЦикла;
	
	
КонецПроцедуры
