
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = Истина;	
	
Список.ТекстЗапроса = ГрупповойСчетСервер.ЗапросТекстОтборЗаявокКомиссияСчет();
	
Параметры.Свойство("КонтрагентОтбор", КонтрагентОтбор); 

//Если НЕ Параметры.Свойство("Неоплачено", Неоплачено) Тогда Неоплачено = Истина; КонецЕсли; 

Параметры.Свойство("ДатаСОтбор", РезервСОтбор); 
Параметры.Свойство("ДатаПоОтбор", РезервПоОтбор);

УстановитьОтборПараметры();

//УсловноеОформлениеЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//УстановитьОтборНеоплачено();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПараметры()
РезервПоОтбор_П = ?(ЗначениеЗаполнено(РезервПоОтбор), РезервПоОтбор, '30010101'); 

Список.Параметры.УстановитьЗначениеПараметра("КонтрагентОтбор", КонтрагентОтбор);
Список.Параметры.УстановитьЗначениеПараметра("РезервС", РезервСОтбор);
Список.Параметры.УстановитьЗначениеПараметра("РезервПо", РезервПоОтбор_П);

Список.Параметры.УстановитьЗначениеПараметра("Все", Все);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНеоплачено()
ИмяПоля = "СуммаОплаты"; Значение_П = 0; РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
Если Неоплачено Тогда	
	ВидСравнения_П = ВидСравненияКомпоновкиДанных.Равно;
Иначе
	ВидСравнения_П = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
КонецЕсли;	
УстановитьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля, Значение_П, ВидСравнения_П, РежимОтображения);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля, Значение, ВидСравнения, РежимОтображения)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				 Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если СуществующийЭлементОтбора = Неопределено Тогда
			НовыйЭлементОтбора = ПользовательскийОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
	
		НовыйЭлементОтбора.ВидСравнения = ВидСравнения;
		НовыйЭлементОтбора.Использование = Истина;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		НовыйЭлементОтбора.РежимОтображения = РежимОтображения;
		НовыйЭлементОтбора.ПравоеЗначение = Значение;
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеЗагрузить()
УсловноеОформление.Элементы.Очистить();

ЭлементыТабНаФормеИмя = Элементы.Список.Имя;

ПутьКПолюОтбора = "Список.СуммаОплаты";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Больше;
ПравоеЗначение = 0;
Web_Цвета = WebЦвета.БледноЛиловый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	,ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета );
КонецПроцедуры
//

&НаКлиенте
Процедура НеоплаченоПриИзменении(Элемент)
УстановитьОтборНеоплачено();
КонецПроцедуры

&НаКлиенте
Процедура РезервСОтборПриИзменении(Элемент)
УстановитьОтборПараметры();
КонецПроцедуры

&НаКлиенте
Процедура РезервПоОтборПриИзменении(Элемент)
УстановитьОтборПараметры();
КонецПроцедуры

//
&НаКлиенте
Процедура ОплачиваетОтборПриИзменении(Элемент)
ОплачиваетОтборПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОплачиваетОтборПриИзмененииНаСервере()
Список.Параметры.УстановитьЗначениеПараметра("Оплачивает", КонтрагентОтбор);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВсеПриИзменении(Элемент)
УстановитьОтборПараметры();
КонецПроцедуры
//


&НаКлиенте
Процедура Выбрать(Команда)
ТД = Элементы.Список.ТекущиеДанные; 	
Если ТД = Неопределено Тогда Возврат; КонецЕсли; 
Если ПроверкаВыбораСообщение(ТД) Тогда Возврат; КонецЕсли; 

ВыборОповестить();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ТД = Элементы.Список.ТекущиеДанные; 	
Если ТД = Неопределено Тогда Возврат; КонецЕсли; 
Если ПроверкаВыбораСообщение(ТД) Тогда Возврат; КонецЕсли;

ВыборОповестить();
КонецПроцедуры

&НаКлиенте
Функция ПроверкаВыбораСообщение(ТД)
Если ЗначениеЗаполнено(ТД.ГрупповойСчет) Тогда
	Текст = "Заявка находится в Групповом счете: " + ТД.ГрупповойСчет
		+ " и не может быть выбрана";
	ПоказатьПредупреждение(, Текст);
	
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ВыборОповестить()
ТекущиеДанные = Элементы.Список.ТекущиеДанные;
Результат = Новый Структура("ЗаявкаСсылка", ТекущиеДанные.Ссылка);
ОповеститьОВыборе(Результат);

Элементы.Список.Обновить();
КонецПроцедуры





