
Процедура ОтправитьВPayKeeperДолг(ОбъектДанные, СчетГУИД, УникальныйИдентификатор
	, Форма, ОповещениеОЗавершении) Экспорт  

ПараметрыФормы = Новый Структура("ОбъектСсылка, СчетГУИД", ОбъектДанные.Ссылка, СчетГУИД);

ДопПараметры = Новый Структура("ОбъектДанные, СчетГУИД, УникальныйИдентификатор, ОповещениеОЗавершении"
	, ОбъектДанные, СчетГУИД, УникальныйИдентификатор, ОповещениеОЗавершении);
Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ОтправкаPayKeeperФорма", ЭтотОбъект, ДопПараметры);

ОткрытьФорму("ОбщаяФорма.ОтправкаPayKeeperФорма", ПараметрыФормы, Форма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Процедура ЗавершениеФормы_ОтправкаPayKeeperФорма(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
Если Результат.ЕстьОтправка Тогда
	Если НЕ Результат.ПовторнаяОтправка Тогда Возврат; КонецЕсли;
КонецЕсли;	

СчетГУИД = ДополнительныеПараметры.СчетГУИД;
ОбъектДанные = ДополнительныеПараметры.ОбъектДанные;
УникальныйИдентификатор = ДополнительныеПараметры.УникальныйИдентификатор;	

Ответ = PayKeeperСервер.ОтправитьВPayKeeperДолг(ОбъектДанные, СчетГУИД, УникальныйИдентификатор
	, Результат.EmailОтправить, Результат.ТелефонОтправить, Результат.ЭкранОтправить);

Если Ответ.Ошибка Тогда
	Если Ответ.КодОшибки > 0 Тогда
		ПоказатьПредупреждение(, Ответ.ОписаниеОшибки);
	ИначеЕсли Ответ.КодОшибки = -1 Тогда
		Сообщить(Ответ.ОписаниеОшибки);
	ИначеЕсли Ответ.КодОшибки = -2 Тогда
		ТекстПредупреждения = "Ошибка отправки сообщения о платеже в WhatsApp
			|
			|БУДЕТ ОТПРАВЛЕНО СМС СООБЩЕНИЯ О ПЛАТЕЖЕ ...";
		ПоказатьПредупреждение(, ТекстПредупреждения);
		
		Сообщить(Ответ.ОписаниеОшибки);
	КонецЕсли;
	
	Возврат;
КонецЕсли;

ОповещениеОЗавершении = ДополнительныеПараметры.ОповещениеОЗавершении;
//ДополнительныеПараметры.Удалить("ОповещениеЗавершениеЧек");

ДопПараметры = ОповещениеОЗавершении.ДополнительныеПараметры;
ДопПараметры.Вставить("Результат", Ответ);

ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
КонецПроцедуры


