

&НаКлиенте
Процедура Заменить(Команда)
	Если НЕ ЗначениеЗаполнено(СтарыйНомер) Тогда Возврат; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НовыйНомер) Тогда Возврат; КонецЕсли;
	
	ЗаменитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаменитьНаСервере()
Заявки = Документы.ЗаявкаНаБронирование.Выбрать();

Пока Заявки.Следующий() Цикл
	Если Заявки.НомерВРезерв <> СтарыйНомер Тогда Продолжить; КонецЕсли;
	
	ЗаявкаОбъект = Заявки.Ссылка.ПолучитьОбъект();
	ЗаявкаОбъект.НомерВРезерв = НовыйНомер;
	
	Попытка
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());		
	КонецПопытки;
		
КонецЦикла;
	
КонецПроцедуры



