
&НаКлиенте
Процедура ДатаРасчетаПриИзменении(Элемент)
	ДатаРасчета = КонецМесяца(ДатаРасчета);
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьТурНалог(Команда)
	РасчитатьТурНалогНаСервере();
КонецПроцедуры

//
&НаСервере
Процедура РасчитатьТурНалогНаСервере()
ЗаполнитьТурНалогЗаявки();

СуммаПроживаниеИтого = ТурНалогДетально.Итог("СуммаПроживание");
СуммаОплатыИтого = ТурНалогДетально.Итог("СуммаОплаты");
СуммаТурНалогИтого = ТурНалогДетально.Итог("СуммаТурНалог");

//ЗаполнитьТурналогИстория();

//СуммаТурНалогИзмененияИтого = ТурНалогДетальноИзменения.Итог("СуммаТурНалог");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТурНалогЗаявки()

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	""Начисление"" КАК ТипОперации,
                      |	ЗаявкаНаБронирование.Ссылка КАК ДокументДолг,
                      |	ЗаявкаНаБронирование.Номер КАК НомерДокумента,
                      |	ЗаявкаНаБронирование.Дата КАК ДатаДокумента,
                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
                      |	ЗаявкаНаБронирование.Статус КАК Статус,
                      |	ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
                      |	ЗаявкаНаБронирование.Оплачивает.Турагентство КАК ОплачиваетТурагентство,
                      |	ЗаявкаНаБронирование.Бронирует.Турагентство КАК БронируетТурагентство,
                      |	СчетаЗаявка.ДатаСМинимум КАК ДатаС,
                      |	СчетаЗаявка.ДатаПоМаксимум КАК ДатаПо,
                      |	ОплатыЗаявка.СуммаОплаты КАК СуммаОплаты,
                      |	ОплатыЗаявка.ДатаОплатыМаксимум КАК ДатаОплатыМаксимум,
                      |	ПроживаниеЗаявка.ПроживаниеСуммаДолг КАК ПроживаниеСуммаДолг,
                      |	ПроживаниеЗаявка.ПроживаниеСумма КАК ПроживаниеСумма,
                      |	ПроживаниеЗаявка.ПроживаниеСуммаБезСкидки КАК ПроживаниеСуммаБезСкидки,
                      |	УслугиЗаявка.УслугиСумма КАК УслугиСумма,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство
                      |			ТОГДА СчетаЗаявка.ДатаСМинимум
                      |		ИНАЧЕ ОплатыЗаявка.ДатаОплатыМаксимум
                      |	КОНЕЦ КАК ДатаОплаты,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство
                      |			ТОГДА ""Оплата Турагентством""
                      |		КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство
                      |			ТОГДА ""Оплата НЕ Турагентством""
                      |		КОГДА ЗаявкаНаБронирование.Оплачивает.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ""Оплата Юр. лицом""
                      |		КОГДА ЗаявкаНаБронирование.Оплачивает.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                      |			ТОГДА ""Оплата Физ. лицом""
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ОплатыЗаявка.ДатаОплатыМаксимум < ЗаявкаНаБронирование.РезервС
                      |			ТОГДА ИСТИНА
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК Предоплата,
                      |	ВЫБОР
                      |		КОГДА РАЗНОСТЬДАТ(СчетаЗаявка.ДатаСМинимум, СчетаЗаявка.ДатаПоМаксимум, ДЕНЬ) <= 0
                      |			ТОГДА 1
                      |		ИНАЧЕ РАЗНОСТЬДАТ(СчетаЗаявка.ДатаСМинимум, СчетаЗаявка.ДатаПоМаксимум, ДЕНЬ)
                      |	КОНЕЦ КАК КоличествоДней,
                      |	ЕСТЬNULL(ВЫБОР
                      |			КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство
                      |				ТОГДА ПроживаниеЗаявка.ПроживаниеСуммаБезСкидки
                      |			ИНАЧЕ ПроживаниеЗаявка.ПроживаниеСумма
                      |		КОНЕЦ, 0) + ЕСТЬNULL(УслугиЗаявка.УслугиСумма, 0) КАК СуммаПроживание,
                      |	ВЫРАЗИТЬ((ЕСТЬNULL(ВЫБОР
                      |				КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство
                      |					ТОГДА ПроживаниеЗаявка.ПроживаниеСуммаБезСкидки
                      |				ИНАЧЕ ПроживаниеЗаявка.ПроживаниеСумма
                      |			КОНЕЦ, 0) + ЕСТЬNULL(УслугиЗаявка.УслугиСумма, 0)) * &К1 / &К2 КАК ЧИСЛО) КАК Сумма_1,
                      |	(ВЫРАЗИТЬ(100 КАК ЧИСЛО)) * ВЫБОР
                      |		КОГДА РАЗНОСТЬДАТ(СчетаЗаявка.ДатаСМинимум, СчетаЗаявка.ДатаПоМаксимум, ДЕНЬ) <= 0
                      |			ТОГДА 1
                      |		ИНАЧЕ РАЗНОСТЬДАТ(СчетаЗаявка.ДатаСМинимум, СчетаЗаявка.ДатаПоМаксимум, ДЕНЬ)
                      |	КОНЕЦ КАК Сумма_100,
                      |	ВЫРАЗИТЬ(ВЫБОР
                      |			КОГДА (ЕСТЬNULL(ВЫБОР
                      |						КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство
                      |							ТОГДА ПроживаниеЗаявка.ПроживаниеСуммаБезСкидки
                      |						ИНАЧЕ ПроживаниеЗаявка.ПроживаниеСумма
                      |					КОНЕЦ, 0) + ЕСТЬNULL(УслугиЗаявка.УслугиСумма, 0)) * &К1 / &К2 > 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(СчетаЗаявка.ДатаСМинимум, СчетаЗаявка.ДатаПоМаксимум, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(СчетаЗаявка.ДатаСМинимум, СчетаЗаявка.ДатаПоМаксимум, ДЕНЬ)
                      |				КОНЕЦ
                      |				ТОГДА (ЕСТЬNULL(ВЫБОР
                      |							КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство
                      |								ТОГДА ПроживаниеЗаявка.ПроживаниеСуммаБезСкидки
                      |							ИНАЧЕ ПроживаниеЗаявка.ПроживаниеСумма
                      |						КОНЕЦ, 0) + ЕСТЬNULL(УслугиЗаявка.УслугиСумма, 0)) * &К1 / &К2
                      |			ИНАЧЕ 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(СчетаЗаявка.ДатаСМинимум, СчетаЗаявка.ДатаПоМаксимум, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(СчетаЗаявка.ДатаСМинимум, СчетаЗаявка.ДатаПоМаксимум, ДЕНЬ)
                      |				КОНЕЦ
                      |		КОНЕЦ КАК ЧИСЛО) КАК СуммаТурНалог,
                      |	ГрупповыеСчета_ДокументДолг.ДокументДолг КАК ГруппповыеСчетаДокументДолг
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
                      |			МИНИМУМ(ЗаявкаНаБронированиеСчета.ДатаС) КАК ДатаСМинимум,
                      |			МАКСИМУМ(ЗаявкаНаБронированиеСчета.ДатаПо) КАК ДатаПоМаксимум
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчета.Ссылка) КАК СчетаЗаявка
                      |		ПО ЗаявкаНаБронирование.Ссылка = СчетаЗаявка.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты,
                      |			МАКСИМУМ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты) КАК ДатаОплатыМаксимум
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД
                      |				ИЗ
                      |					Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ГДЕ
                      |					(ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
                      |							ИЛИ ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
                      |								И ЗаявкаНаБронированиеСчетаДетальноДолги.ПрограммныйКодУслуги = ЗНАЧЕНИЕ(Перечисление.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ))
                      |				
                      |				СГРУППИРОВАТЬ ПО
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДетальноДолгиЗаявка
                      |				ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = СчетаДетальноДолгиЗаявка.Ссылка
                      |					И ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД = СчетаДетальноДолгиЗаявка.СчетГУИД
                      |		ГДЕ
                      |			ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) <> ТИП(Документ.ПрочиеОплаты)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка) КАК ОплатыЗаявка
                      |		ПО ЗаявкаНаБронирование.Ссылка = ОплатыЗаявка.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг, 0)) КАК ПроживаниеСуммаДолг,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеПроживание.Сумма, 0)) КАК ПроживаниеСумма,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеПроживание.СуммаБезСкидки, 0)) КАК ПроживаниеСуммаБезСкидки
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК ПроживаниеЗаявка
                      |		ПО ЗаявкаНаБронирование.Ссылка = ПроживаниеЗаявка.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено, 0)) КАК СуммаОплачено,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество, 0)) КАК УслугиСумма
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДопУслуги КАК ДопУслуги
                      |					ПО ЗаявкаНаБронированиеДопУслуги.Услуга = ДопУслуги.Ссылка
                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
                      |			И ДопУслуги.ПрограммныйКод = ЗНАЧЕНИЕ(Перечисление.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК УслугиЗаявка
                      |		ПО ЗаявкаНаБронирование.Ссылка = УслугиЗаявка.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.ДокументДолг КАК ДокументДолг
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |					ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервС) КАК КоличествоРазличныхДокументДолгРезервС,
                      |					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервПо) КАК КоличествоРазличныхДокументДолгРезервПо,
                      |					КОЛИЧЕСТВО(ГрупповыеСчетаДокументыДолги.СчетГУИД) КАК КоличествоДокументДолг
                      |				ИЗ
                      |					Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |				
                      |				СГРУППИРОВАТЬ ПО
                      |					ГрупповыеСчетаДокументыДолги.Ссылка) КАК ГрупповыеСчета_Различные
                      |				ПО ГрупповыеСчетаДокументыДолги.Ссылка = ГрупповыеСчета_Различные.Ссылка
                      |		ГДЕ
                      |			ВЫБОР
                      |					КОГДА ГрупповыеСчета_Различные.КоличествоРазличныхДокументДолгРезервС = 1
                      |								И ГрупповыеСчета_Различные.КоличествоРазличныхДокументДолгРезервПо = 1
                      |							ИЛИ ГрупповыеСчета_Различные.КоличествоДокументДолг = 1
                      |						ТОГДА ИСТИНА
                      |					ИНАЧЕ ЛОЖЬ
                      |				КОНЕЦ) КАК ГрупповыеСчета_ДокументДолг
                      |		ПО ЗаявкаНаБронирование.Ссылка = ГрупповыеСчета_ДокументДолг.ДокументДолг
                      |ГДЕ
                      |	ИСТИНА
                      |	И ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
                      |	И ЗаявкаНаБронирование.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
                      |	И ОплатыЗаявка.СуммаОплаты >= ЕСТЬNULL(ПроживаниеЗаявка.ПроживаниеСуммаДолг, 0) + ЕСТЬNULL(УслугиЗаявка.УслугиСумма, 0)
                      |	И ВЫБОР
                      |			КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство 
					  //|				ТОГДА СчетаЗаявка.ДатаСМинимум
					  |				ТОГДА СчетаЗаявка.ДатаПоМаксимум
                      |			ИНАЧЕ ОплатыЗаявка.ДатаОплатыМаксимум
                      |		КОНЕЦ >= &ДатаОплатыС
                      |	И ВЫБОР
                      |			КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство
                      |				ТОГДА СчетаЗаявка.ДатаПоМаксимум
                      |			ИНАЧЕ ОплатыЗаявка.ДатаОплатыМаксимум
                      |		КОНЕЦ <= &ДатаОплатыПо
                      |	И ГрупповыеСчета_ДокументДолг.ДокументДолг ЕСТЬ NULL
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	СчетаЗаявка.ДатаСМинимум,
                      |	СчетаЗаявка.ДатаПоМаксимум,
                      |	ЗаявкаНаБронирование.Ссылка");


					  //|			КОГДА ЗаявкаНаБронирование.Оплачивает.Турагентство 
					  //// + Аудит
					  ////|				ТОГДА СчетаЗаявка.ДатаСМинимум
					  //|				ТОГДА СчетаЗаявка.ДатаПоМаксимум
					  //// - Аудит
					  //|			ИНАЧЕ ОплатыЗаявка.ДатаОплатыМаксимум
					  //|		КОНЕЦ >= &ДатаОплатыС
					  
Запрос.УстановитьПараметр("ДатаОплатыС", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДатаОплатыПо", КонецМесяца(ДатаРасчета));
               
Если Год(ДатаРасчета) < 2026 Тогда
	К1 = 1;
Иначе
	К1 = 2;
КонецЕсли;
К2 = 100 + К1;

Запрос.УстановитьПараметр("К1", К1);
Запрос.УстановитьПараметр("К2", К2);

ТЗ = Запрос.Выполнить().Выгрузить();

ТурНалогЗаявки.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТурНалогЗаявки.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	Строка.Сумма_1 = Окр(Строка.Сумма_1);
	Строка.Сумма_100 = Окр(Строка.Сумма_100);
	Строка.СуммаТурНалог = Окр(Строка.СуммаТурНалог);
КонецЦикла;

//////////

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	""Начисление"" КАК ТипОперации,
                      |	ГрупповыеСчета.Ссылка КАК ДокументДолг,
                      |	ГрупповыеСчета.ТипГрупповогоСчета КАК Статус,
                      |	ГрупповыеСчета.Номер КАК НомерДокумента,
                      |	ГрупповыеСчета.Дата КАК ДатаДокумента,
                      |	Счета.МинимумДатаС КАК ДатаС,
                      |	Счета.МаксимумДатаПо КАК ДатаПо,
                      |	ГрупповыеСчета.Контрагент КАК Оплачивает,
                      |	ГрупповыеСчета.Контрагент.Турагентство КАК ОплачиваетТурагентство,
                      |	ГрупповыеСчета.Контрагент.Турагентство КАК БронируетТурагентство,
                      |	Оплаты.СуммаОплаты КАК СуммаОплаты,
                      |	Оплаты.ДатаОплатыМаксимум КАК ДатаОплаты,
                      |	ДокументыДолгиПроживание.СуммаДолг КАК СуммаДолг,
                      |	ВЫБОР
                      |		КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |			ТОГДА ""Оплата Турагентством""
                      |		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ""Оплата Юр. лицом""
                      |		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                      |			ТОГДА ""Оплата Физ. лицом""
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ИСТИНА КАК ЭтоГрупповойСчет,
                      |	ВЫБОР
                      |		КОГДА Оплаты.ДатаОплатыМаксимум < ГрупповыеСчета.ДатаС
                      |			ТОГДА ИСТИНА
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК Предоплата,
                      |	ВЫБОР
                      |		КОГДА РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ) <= 0
                      |			ТОГДА 1
                      |		ИНАЧЕ РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ)
                      |	КОНЕЦ КАК КоличествоДней,
                      |	ВЫБОР
                      |		КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |			ТОГДА ДокументыДолгиПроживание.СуммаБезСкидкиПроживание
                      |		ИНАЧЕ ДокументыДолгиПроживание.СуммаПроживание
                      |	КОНЕЦ + ДокументыДолгиПроживание.СуммаУслуги КАК СуммаПроживание,
                      |	ВЫРАЗИТЬ((ВЫБОР
                      |			КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |				ТОГДА ДокументыДолгиПроживание.СуммаБезСкидкиПроживание
                      |			ИНАЧЕ ДокументыДолгиПроживание.СуммаПроживание
                      |		КОНЕЦ + ДокументыДолгиПроживание.СуммаУслуги) * &К1 / &К2 КАК ЧИСЛО) КАК Сумма_1,
                      |	ВЫРАЗИТЬ(100 * ВЫБОР
                      |			КОГДА РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ) <= 0
                      |				ТОГДА 1
                      |			ИНАЧЕ РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ)
                      |		КОНЕЦ КАК ЧИСЛО) КАК Сумма_100,
                      |	ВЫРАЗИТЬ(ВЫБОР
                      |			КОГДА (ВЫБОР
                      |					КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |						ТОГДА ДокументыДолгиПроживание.СуммаБезСкидкиПроживание
                      |					ИНАЧЕ ДокументыДолгиПроживание.СуммаПроживание
                      |				КОНЕЦ + ДокументыДолгиПроживание.СуммаУслуги) * &К1 / &К2 > 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ)
                      |				КОНЕЦ
                      |				ТОГДА (ВЫБОР
                      |						КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |							ТОГДА ДокументыДолгиПроживание.СуммаБезСкидкиПроживание
                      |						ИНАЧЕ ДокументыДолгиПроживание.СуммаПроживание
                      |					КОНЕЦ + ДокументыДолгиПроживание.СуммаУслуги) * &К1 / &К2
                      |			ИНАЧЕ 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ)
                      |				КОНЕЦ
                      |		КОНЕЦ КАК ЧИСЛО) КАК СуммаТурНалог
                      |ИЗ
                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |			КОЛИЧЕСТВО(ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервС) КАК КоличествоДокументДолг,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервС) КАК КоличествоРазличныхДокументДолгРезервС,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервПо) КАК КоличествоРазличныхДокументДолгРезервПо
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыДолги.Ссылка) КАК ДокументыДолгиКоличествоРазличных
                      |		ПО ГрупповыеСчета.Ссылка = ДокументыДолгиКоличествоРазличных.Ссылка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаРаспределениеОплат.Ссылка КАК Ссылка,
                      |			СУММА(ГрупповыеСчетаРаспределениеОплат.СуммаОплаты) КАК СуммаОплаты,
                      |			МАКСИМУМ(ГрупповыеСчетаРаспределениеОплат.ДокументОплаты.ДатаОплаты) КАК ДатаОплатыМаксимум
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.РаспределениеОплат КАК ГрупповыеСчетаРаспределениеОплат
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаРаспределениеОплат.Ссылка) КАК Оплаты
                      |		ПО ГрупповыеСчета.Ссылка = Оплаты.Ссылка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |			МИНИМУМ(ГрупповыеСчетаДокументыДолгиПроживание.ДатаДолг) КАК МинимумДатаДолг,
                      |			МАКСИМУМ(ГрупповыеСчетаДокументыДолгиПроживание.ДатаДолг) КАК МаксимумДатаДолг,
                      |			СУММА(ГрупповыеСчетаДокументыДолгиПроживание.СуммаДолг) КАК СуммаДолг,
                      |			СУММА(ГрупповыеСчетаДокументыДолгиПроживание.СуммаПроживание) КАК СуммаПроживание,
                      |			СУММА(ГрупповыеСчетаДокументыДолгиПроживание.СуммаБезСкидкиПроживание) КАК СуммаБезСкидкиПроживание,
                      |			СУММА(ГрупповыеСчетаДокументыДолгиПроживание.СуммаУслуги) КАК СуммаУслуги
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.ДатаДолг КАК ДатаДолг,
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг КАК СуммаДолг,
                      |					ЗаявкаНаБронированиеПроживание.Сумма КАК СуммаПроживание,
                      |					ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидкиПроживание,
                      |					ВЫБОР
                      |						КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга
                      |								И ЗаявкаНаБронированиеСчетаДетальноДолги.ПрограммныйКодУслуги = ЗНАЧЕНИЕ(Перечисление.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ)
                      |							ТОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг
                      |						ИНАЧЕ 0
                      |					КОНЕЦ КАК СуммаУслуги
                      |				ИЗ
                      |					Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |						ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |							И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД) КАК ГрупповыеСчетаДокументыДолгиПроживание
                      |				ПО ГрупповыеСчетаДокументыДолги.ДокументДолг = ГрупповыеСчетаДокументыДолгиПроживание.Ссылка
                      |					И ГрупповыеСчетаДокументыДолги.СчетГУИД = ГрупповыеСчетаДокументыДолгиПроживание.СчетГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыДолги.Ссылка) КАК ДокументыДолгиПроживание
                      |		ПО ГрупповыеСчета.Ссылка = ДокументыДолгиПроживание.Ссылка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |			МИНИМУМ(ЗаявкаНаБронированиеСчета.ДатаС) КАК МинимумДатаС,
                      |			МАКСИМУМ(ЗаявкаНаБронированиеСчета.ДатаПо) КАК МаксимумДатаПо
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |				ПО ГрупповыеСчетаДокументыДолги.ДокументДолг.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
                      |					И ГрупповыеСчетаДокументыДолги.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыДолги.Ссылка) КАК Счета
                      |		ПО ГрупповыеСчета.Ссылка = Счета.Ссылка
                      |ГДЕ
                      |	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА ДокументыДолгиКоличествоРазличных.КоличествоРазличныхДокументДолгРезервС = 1
                      |					И ДокументыДолгиКоличествоРазличных.КоличествоРазличныхДокументДолгРезервПо = 1
                      |					И ДокументыДолгиКоличествоРазличных.КоличествоДокументДолг <> 1
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЛОЖЬ
                      |		КОНЕЦ
                      |	И Оплаты.ДатаОплатыМаксимум >= &ДатаОплатыС
                      |	И Оплаты.ДатаОплатыМаксимум <= &ДатаОплатыПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаОплаты,
                      |	ГрупповыеСчета.Ссылка");

Запрос.УстановитьПараметр("ДатаОплатыС", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДатаОплатыПо", КонецМесяца(ДатаРасчета));

Запрос.УстановитьПараметр("К1", К1);
Запрос.УстановитьПараметр("К2", К2);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТурНалогЗаявки.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	Строка.Сумма_1 = Окр(Строка.Сумма_1);
	Строка.Сумма_100 = Окр(Строка.Сумма_100);
	Строка.СуммаТурНалог = Окр(Строка.СуммаТурНалог);
КонецЦикла;

КонецПроцедуры
//


///////////
&НаСервере
Процедура РасчитатьТурНалогНаСервере_1()
ЗаполнитьТурНалогДетально();

СуммаПроживаниеИтого = ТурНалогДетально.Итог("СуммаПроживание");
СуммаОплатыИтого = ТурНалогДетально.Итог("СуммаОплаты");
СуммаТурНалогИтого = ТурНалогДетально.Итог("СуммаТурНалог");

//ЗаполнитьТурналогИстория();

СуммаТурНалогИзмененияИтого = ТурНалогДетальноИзменения.Итог("СуммаТурНалог");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТурНалогДетально()

//ЗапросТекст = ЗапросТекстТурНалогДетально();
//ЗапросТекст = ЗапросТекст + "
//                      |
//                      |УПОРЯДОЧИТЬ ПО
//                      |	ДатаСчетаПо,
//                      |	ДатаОплаты,
//                      |	НомерСчета,
//                      |	ДатаДолг,
//                      |	ДокументДолг";


//Запрос = Новый Запрос(ЗапросТекст);

//Запрос.УстановитьПараметр("ДатаОплатыС", НачалоМесяца(ДатаРасчета));
//Запрос.УстановитьПараметр("ДатаОплатыПо", КонецМесяца(ДатаРасчета));

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	""Начисление"" КАК ТипОперации,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК ДокументДолг,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК НомерДокумента,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ДатаДокумента,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                      |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                      |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаСчетаС,
                      |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаСчетаПо,
                      |	ЗаявкаНаБронированиеСчета.Контрагент КАК Оплачивает,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.Турагентство КАК КонтрагентТурагентство,
                      |	ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
                      |	СчетДолгиПроживание.СуммаДолгСчет КАК СуммаДолгСчетПроживание,
                      |	СчетДолгиДопУслуги.СуммаДолгСчет КАК СуммаДолгСчетДопУслуги,
                      |	ЕСТЬNULL(СчетДолгиПроживание.СуммаДолгСчет, 0) + ЕСТЬNULL(СчетДолгиДопУслуги.СуммаДолгСчет, 0) КАК СуммаДолгСчет,
                      |	ОплатыПроживание.СуммаОплатыСчет КАК СуммаОплатыСчетПроживание,
                      |	ОплатыДопУслуги.СуммаОплатыСчет КАК СуммаОплатыСчетДопУслуги,
                      |	ЕСТЬNULL(ОплатыПроживание.СуммаОплатыСчет, 0) + ЕСТЬNULL(ОплатыДопУслуги.СуммаОплатыСчет, 0) КАК СуммаОплатыСчет,
                      |	ОплатыДопУслуги.ДатаОплатыМаксимум КАК ДатаОплатыМаксимумДопУслуги,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |			ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ЕСТЬNULL(ОплатыПроживание.ДатаОплатыМаксимум, ДАТАВРЕМЯ(1, 1, 1)) > ЕСТЬNULL(ОплатыДопУслуги.ДатаОплатыМаксимум, ДАТАВРЕМЯ(1, 1, 1))
                      |					ТОГДА ОплатыПроживание.ДатаОплатыМаксимум
                      |				ИНАЧЕ ОплатыДопУслуги.ДатаОплатыМаксимум
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ДатаОплатыСчет,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство
                      |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |			ТОГДА ""Счет турагентству (оплата Турагентством)""
                      |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство
                      |				И ЗаявкаНаБронированиеСчета.Контрагент <> ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |			ТОГДА ""Счет через Турагентство (оплата НЕ Турагентством)""
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ""Счет Юр. лицу""
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                      |			ТОГДА ""Счет Физ. лицу""
                      |	КОНЕЦ КАК ТипСчета,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
                      |			ТОГДА ЛОЖЬ
                      |		ИНАЧЕ ИСТИНА
                      |	КОНЕЦ КАК ВходитВГрупповойСчет,
                      |	ВЫБОР
                      |		КОГДА ВЫБОР
                      |				КОГДА ЕСТЬNULL(ОплатыПроживание.ДатаОплатыМаксимум, ДАТАВРЕМЯ(1, 1, 1)) > ЕСТЬNULL(ОплатыДопУслуги.ДатаОплатыМаксимум, ДАТАВРЕМЯ(1, 1, 1))
                      |					ТОГДА ОплатыПроживание.ДатаОплатыМаксимум
                      |				ИНАЧЕ ОплатыДопУслуги.ДатаОплатыМаксимум
                      |			КОНЕЦ < ЗаявкаНаБронированиеСчета.ДатаС
                      |			ТОГДА ИСТИНА
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК Предоплата,
                      |	ВЫБОР
                      |		КОГДА РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) <= 0
                      |			ТОГДА 1
                      |		ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ)
                      |	КОНЕЦ КАК КоличествоДней,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |			ТОГДА ДолгиПроживание.ПроживаниеСуммаБезСкидки
                      |		ИНАЧЕ ДолгиПроживание.ПроживаниеСумма
                      |	КОНЕЦ КАК ПроживаниеСуммаПроживание,
                      |	ЕСТЬNULL(ВЫБОР
                      |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |					И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |				ТОГДА ДолгиПроживание.ПроживаниеСуммаБезСкидки
                      |			ИНАЧЕ ДолгиПроживание.ПроживаниеСумма
                      |		КОНЕЦ, 0) + ЕСТЬNULL(ДолгиДопУслуги.ДопУслугиСумма, 0) КАК СуммаПроживание,
                      |	ВЫРАЗИТЬ(ВЫБОР
                      |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |					И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |				ТОГДА ДолгиПроживание.ПроживаниеСуммаБезСкидки
                      |			ИНАЧЕ ДолгиПроживание.ПроживаниеСумма
                      |		КОНЕЦ / 101 КАК ЧИСЛО) КАК ПроживаниеСумма_1,
                      |	ВЫРАЗИТЬ((ЕСТЬNULL(ВЫБОР
                      |				КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |						И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |					ТОГДА ДолгиПроживание.ПроживаниеСуммаБезСкидки
                      |				ИНАЧЕ ДолгиПроживание.ПроживаниеСумма
                      |			КОНЕЦ, 0) + ЕСТЬNULL(ДолгиДопУслуги.ДопУслугиСумма, 0)) / 101 КАК ЧИСЛО) КАК Сумма_1,
                      |	(ВЫРАЗИТЬ(100 КАК ЧИСЛО)) * ВЫБОР
                      |		КОГДА РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) <= 0
                      |			ТОГДА 1
                      |		ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ)
                      |	КОНЕЦ КАК Сумма_100,
                      |	ВЫРАЗИТЬ(ВЫБОР
                      |			КОГДА (ЕСТЬNULL(ВЫБОР
                      |						КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |								И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |							ТОГДА ДолгиПроживание.ПроживаниеСуммаБезСкидки
                      |						ИНАЧЕ ДолгиПроживание.ПроживаниеСумма
                      |					КОНЕЦ, 0) + ЕСТЬNULL(ДолгиДопУслуги.ДопУслугиСумма, 0)) / 101 > 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ)
                      |				КОНЕЦ
                      |				ТОГДА (ЕСТЬNULL(ВЫБОР
                      |							КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |									И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |								ТОГДА ДолгиПроживание.ПроживаниеСуммаБезСкидки
                      |							ИНАЧЕ ДолгиПроживание.ПроживаниеСумма
                      |						КОНЕЦ, 0) + ЕСТЬNULL(ДолгиДопУслуги.ДопУслугиСумма, 0)) / 101
                      |			ИНАЧЕ 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ)
                      |				КОНЕЦ
                      |		КОНЕЦ КАК ЧИСЛО) КАК СуммаТурНалог,
                      |	ВЫРАЗИТЬ(ВЫБОР
                      |			КОГДА ВЫБОР
                      |					КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |							И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |						ТОГДА ДолгиПроживание.ПроживаниеСуммаБезСкидки
                      |					ИНАЧЕ ДолгиПроживание.ПроживаниеСумма
                      |				КОНЕЦ / 101 > 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ)
                      |				КОНЕЦ
                      |				ТОГДА ВЫБОР
                      |						КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |								И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |							ТОГДА ДолгиПроживание.ПроживаниеСуммаБезСкидки
                      |						ИНАЧЕ ДолгиПроживание.ПроживаниеСумма
                      |					КОНЕЦ / 101
                      |			ИНАЧЕ 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(ЗаявкаНаБронированиеСчета.ДатаС, ЗаявкаНаБронированиеСчета.ДатаПо, ДЕНЬ)
                      |				КОНЕЦ
                      |		КОНЕЦ КАК ЧИСЛО) КАК ПроживаниеСуммаТурНалог
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты, 0)) КАК СуммаОплатыСчет,
                      |			МАКСИМУМ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты) КАК ДатаОплатыМаксимум
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |				ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |					И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК ОплатыПроживание
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ОплатыПроживание.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ОплатыПроживание.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты, 0)) КАК СуммаОплатыСчет,
                      |			МАКСИМУМ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты) КАК ДатаОплатыМаксимум
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДопУслуги КАК ДопУслуги
                      |					ПО ЗаявкаНаБронированиеДопУслуги.Услуга = ДопУслуги.Ссылка
                      |				ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                      |					И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                      |		ГДЕ
                      |			ДопУслуги.ПрограммныйКод = ЗНАЧЕНИЕ(Перечисление.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК ОплатыДопУслуги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ОплатыДопУслуги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ОплатыДопУслуги.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг, 0)) КАК СуммаДолгСчет,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеПроживание.Сумма, 0)) КАК ПроживаниеСуммаСчет,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеПроживание.СуммаБезСкидки, 0)) КАК ПроживаниеСуммаБезСкидкиСчет
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетДолгиПроживание
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетДолгиПроживание.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетДолгиПроживание.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг, 0)) КАК СуммаДолгСчет
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДопУслуги КАК ДопУслуги
                      |					ПО ЗаявкаНаБронированиеДопУслуги.Услуга = ДопУслуги.Ссылка
                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
                      |			И ДопУслуги.ПрограммныйКод = ЗНАЧЕНИЕ(Перечисление.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетДолгиДопУслуги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетДолгиДопУслуги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетДолгиДопУслуги.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено, 0)) КАК СуммаОплачено,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеПроживание.Сумма, 0)) КАК ПроживаниеСумма,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеПроживание.СуммаБезСкидки, 0)) КАК ПроживаниеСуммаБезСкидки
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ДолгиПроживание
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ДолгиПроживание.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиПроживание.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено, 0)) КАК СуммаОплачено,
                      |			СУММА(ЕСТЬNULL(ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество, 0)) КАК ДопУслугиСумма
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДопУслуги КАК ДопУслуги
                      |					ПО ЗаявкаНаБронированиеДопУслуги.Услуга = ДопУслуги.Ссылка
                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
                      |			И ДопУслуги.ПрограммныйКод = ЗНАЧЕНИЕ(Перечисление.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ДолгиДопУслуги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ДолгиДопУслуги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиДопУслуги.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервС) КАК КоличествоРазличныхДокументДолгРезервС,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервПо) КАК КоличествоРазличныхДокументДолгРезервПо,
                      |			КОЛИЧЕСТВО(ГрупповыеСчетаДокументыДолги.СчетГУИД) КАК КоличествоДокументДолг
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыДолги.Ссылка) КАК ГрупповойСчетЗаявки
                      |		ПО ЗаявкаНаБронированиеСчета.ГрупповойСчет = ГрупповойСчетЗаявки.Ссылка
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
                      |	И ОплатыПроживание.СуммаОплатыСчет >= СчетДолгиПроживание.СуммаДолгСчет
                      |	И (ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
                      |			ИЛИ ЗаявкаНаБронированиеСчета.ГрупповойСчет <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
                      |				И ВЫБОР
                      |					КОГДА НЕ(ГрупповойСчетЗаявки.КоличествоРазличныхДокументДолгРезервС = 1
                      |									И ГрупповойСчетЗаявки.КоличествоРазличныхДокументДолгРезервПо = 1)
                      |							ИЛИ ГрупповойСчетЗаявки.КоличествоДокументДолг = 1
                      |						ТОГДА ИСТИНА
                      |					ИНАЧЕ ЛОЖЬ
                      |				КОНЕЦ)
                      |	И ВЫБОР
                      |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |				ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
                      |			ИНАЧЕ ОплатыПроживание.ДатаОплатыМаксимум
                      |		КОНЕЦ >= &ДатаОплатыС
                      |	И ВЫБОР
                      |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |				ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
                      |			ИНАЧЕ ОплатыПроживание.ДатаОплатыМаксимум
                      |		КОНЕЦ <= &ДатаОплатыПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаСчетаС,
                      |	ДатаСчетаПо,
                      |	НомерСчета,
                      |	ДокументДолг");

Запрос.УстановитьПараметр("ДатаОплатыС", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДатаОплатыПо", КонецМесяца(ДатаРасчета));

ТЗ = Запрос.Выполнить().Выгрузить();

ТурНалогДетально.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТурНалогДетально.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	Строка.Сумма_1 = Окр(Строка.Сумма_1);
	Строка.Сумма_100 = Окр(Строка.Сумма_100);
	Строка.СуммаТурНалог = Окр(Строка.СуммаТурНалог);
КонецЦикла;

//////////

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	""Начисление"" КАК ТипОперации,
                      |	ГрупповыеСчета.Ссылка КАК ГрупповойСчет,
                      |	ГрупповыеСчета.ТипГрупповогоСчета КАК Статус,
                      |	ГрупповыеСчета.Номер КАК НомерДокумента,
                      |	ГрупповыеСчета.Дата КАК ДатаДокумента,
                      |	ГрупповыеСчета.НомерСчета КАК НомерСчета,
                      |	ГрупповыеСчета.ДатаСчета КАК ДатаСчета,
                      |	Счета.МинимумДатаС КАК ДатаСчетаС,
                      |	Счета.МаксимумДатаПо КАК ДатаСчетаПо,
                      |	ГрупповыеСчета.Контрагент КАК Оплачивает,
                      |	ГрупповыеСчета.Контрагент.Турагентство КАК КонтрагентТурагентство,
                      |	Оплаты.СуммаОплаты КАК СуммаОплатыСчет,
                      |	Оплаты.ДатаОплатыМаксимум КАК ДатаОплатыСчет,
                      |	ДокументыДолгиПроживание.СуммаДолг КАК СуммаДолгСчет,
                      |	ВЫБОР
                      |		КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |			ТОГДА ""Групповой Счет турагентству (оплата Турагентством)""
                      |		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ""Групповой Счет Юр. лицу""
                      |		КОГДА ГрупповыеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                      |			ТОГДА ""Групповой Счет Физ. лицу""
                      |	КОНЕЦ КАК ТипСчета,
                      |	ИСТИНА КАК ЭтоГрупповойСчет,
                      |	ВЫБОР
                      |		КОГДА Оплаты.ДатаОплатыМаксимум < ГрупповыеСчета.ДатаС
                      |			ТОГДА ИСТИНА
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК Предоплата,
                      |	ВЫБОР
                      |		КОГДА РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ) <= 0
                      |			ТОГДА 1
                      |		ИНАЧЕ РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ)
                      |	КОНЕЦ КАК КоличествоДней,
                      |	ВЫБОР
                      |		КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |			ТОГДА ДокументыДолгиПроживание.СуммаБезСкидкиПроживание
                      |		ИНАЧЕ ДокументыДолгиПроживание.СуммаПроживание
                      |	КОНЕЦ КАК СуммаПроживание,
                      |	ВЫРАЗИТЬ(ВЫБОР
                      |			КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |				ТОГДА ДокументыДолгиПроживание.СуммаБезСкидкиПроживание
                      |			ИНАЧЕ ДокументыДолгиПроживание.СуммаПроживание
                      |		КОНЕЦ / 101 КАК ЧИСЛО) КАК Сумма_1,
                      |	ВЫРАЗИТЬ(100 * ВЫБОР
                      |			КОГДА РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ) <= 0
                      |				ТОГДА 1
                      |			ИНАЧЕ РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ)
                      |		КОНЕЦ КАК ЧИСЛО) КАК Сумма_100,
                      |	ВЫРАЗИТЬ(ВЫБОР
                      |			КОГДА ВЫБОР
                      |					КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |						ТОГДА ДокументыДолгиПроживание.СуммаБезСкидкиПроживание
                      |					ИНАЧЕ ДокументыДолгиПроживание.СуммаПроживание
                      |				КОНЕЦ / 101 > 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ)
                      |				КОНЕЦ
                      |				ТОГДА ВЫБОР
                      |						КОГДА ГрупповыеСчета.Контрагент.Турагентство
                      |							ТОГДА ДокументыДолгиПроживание.СуммаБезСкидкиПроживание
                      |						ИНАЧЕ ДокументыДолгиПроживание.СуммаПроживание
                      |					КОНЕЦ / 101
                      |			ИНАЧЕ 100 * ВЫБОР
                      |					КОГДА РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ) <= 0
                      |						ТОГДА 1
                      |					ИНАЧЕ РАЗНОСТЬДАТ(Счета.МинимумДатаС, Счета.МаксимумДатаПо, ДЕНЬ)
                      |				КОНЕЦ
                      |		КОНЕЦ КАК ЧИСЛО) КАК СуммаТурНалог
                      |ИЗ
                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |			КОЛИЧЕСТВО(ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервС) КАК КоличествоДокументДолг,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервС) КАК КоличествоРазличныхДокументДолгРезервС,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчетаДокументыДолги.ДокументДолг.РезервПо) КАК КоличествоРазличныхДокументДолгРезервПо
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыДолги.Ссылка) КАК ДокументыДолгиКоличествоРазличных
                      |		ПО ГрупповыеСчета.Ссылка = ДокументыДолгиКоличествоРазличных.Ссылка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаРаспределениеОплат.Ссылка КАК Ссылка,
                      |			СУММА(ГрупповыеСчетаРаспределениеОплат.СуммаОплаты) КАК СуммаОплаты,
                      |			МАКСИМУМ(ГрупповыеСчетаРаспределениеОплат.ДокументОплаты.ДатаОплаты) КАК ДатаОплатыМаксимум
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.РаспределениеОплат КАК ГрупповыеСчетаРаспределениеОплат
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаРаспределениеОплат.Ссылка) КАК Оплаты
                      |		ПО ГрупповыеСчета.Ссылка = Оплаты.Ссылка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |			МИНИМУМ(ГрупповыеСчетаДокументыДолгиПроживание.ДатаДолг) КАК МинимумДатаДолг,
                      |			МАКСИМУМ(ГрупповыеСчетаДокументыДолгиПроживание.ДатаДолг) КАК МаксимумДатаДолг,
                      |			СУММА(ГрупповыеСчетаДокументыДолгиПроживание.СуммаДолг) КАК СуммаДолг,
                      |			СУММА(ГрупповыеСчетаДокументыДолгиПроживание.Сумма) КАК СуммаПроживание,
                      |			СУММА(ГрупповыеСчетаДокументыДолгиПроживание.СуммаБезСкидки) КАК СуммаБезСкидкиПроживание
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.ДатаДолг КАК ДатаДолг,
                      |					ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг КАК СуммаДолг,
                      |					ЗаявкаНаБронированиеПроживание.Сумма КАК Сумма,
                      |					ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидки
                      |				ИЗ
                      |					Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |						ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |							И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД) КАК ГрупповыеСчетаДокументыДолгиПроживание
                      |				ПО ГрупповыеСчетаДокументыДолги.ДокументДолг = ГрупповыеСчетаДокументыДолгиПроживание.Ссылка
                      |					И ГрупповыеСчетаДокументыДолги.СчетГУИД = ГрупповыеСчетаДокументыДолгиПроживание.СчетГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыДолги.Ссылка) КАК ДокументыДолгиПроживание
                      |		ПО ГрупповыеСчета.Ссылка = ДокументыДолгиПроживание.Ссылка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчетаДокументыДолги.Ссылка КАК Ссылка,
                      |			МИНИМУМ(ЗаявкаНаБронированиеСчета.ДатаС) КАК МинимумДатаС,
                      |			МАКСИМУМ(ЗаявкаНаБронированиеСчета.ДатаПо) КАК МаксимумДатаПо
                      |		ИЗ
                      |			Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |				ПО ГрупповыеСчетаДокументыДолги.ДокументДолг.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
                      |					И ГрупповыеСчетаДокументыДолги.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчетаДокументыДолги.Ссылка) КАК Счета
                      |		ПО ГрупповыеСчета.Ссылка = Счета.Ссылка
                      |ГДЕ
                      |	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА ДокументыДолгиКоличествоРазличных.КоличествоРазличныхДокументДолгРезервС = 1
                      |					И ДокументыДолгиКоличествоРазличных.КоличествоРазличныхДокументДолгРезервПо = 1
                      |					И ДокументыДолгиКоличествоРазличных.КоличествоДокументДолг <> 1
                      |				ТОГДА ИСТИНА
                      |			ИНАЧЕ ЛОЖЬ
                      |		КОНЕЦ
                      |	И Оплаты.ДатаОплатыМаксимум >= &ДатаОплатыС
                      |	И Оплаты.ДатаОплатыМаксимум <= &ДатаОплатыПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаОплатыСчет,
                      |	ГрупповыеСчета.Ссылка");


Запрос.УстановитьПараметр("ДатаОплатыС", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДатаОплатыПо", КонецМесяца(ДатаРасчета));

ТЗ = Запрос.Выполнить().Выгрузить();

//ТурНалогДетально.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТурНалогДетально.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	Строка.Сумма_1 = Окр(Строка.Сумма_1);
	Строка.Сумма_100 = Окр(Строка.Сумма_100);
	Строка.СуммаТурНалог = Окр(Строка.СуммаТурНалог);
КонецЦикла;

КонецПроцедуры
//

&НаСервере
Процедура ЗаполнитьТурНалогДетально_ОбычныеЗаявки()

//ЗапросТекст = ЗапросТекстТурНалогДетально();
//ЗапросТекст = ЗапросТекст + "
//                      |
//                      |УПОРЯДОЧИТЬ ПО
//                      |	ДатаСчетаПо,
//                      |	ДатаОплаты,
//                      |	НомерСчета,
//                      |	ДатаДолг,
//                      |	ДокументДолг";


//Запрос = Новый Запрос(ЗапросТекст);

//Запрос.УстановитьПараметр("ДатаОплатыС", НачалоМесяца(ДатаРасчета));
//Запрос.УстановитьПараметр("ДатаОплатыПо", КонецМесяца(ДатаРасчета));


//ЗапросТекст = "ВЫБРАТЬ
//              |	""Начисление"" КАК ТипОперации,
//              |	ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
//              |	ЗаявкаНаБронированиеСчета.Ссылка КАК ДокументДолг,
//              |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
//              |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
//              |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
//              |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаСчетаС,
//              |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаСчетаПо,
//              |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК НомерДокумента,
//              |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ДатаДокумента,
//              |	ЗаявкаНаБронированиеСчета.Контрагент.Турагентство КАК КонтрагентТурагентство,
//              |	ВЫБОР
//              |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство
//              |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
//              |			ТОГДА ""Счет турагентству (оплата Турагентством)""
//              |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство
//              |				И ЗаявкаНаБронированиеСчета.Контрагент <> ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
//              |			ТОГДА ""Счет через Турагентство (оплата НЕ Турагентством)""
//              |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
//              |			ТОГДА ""Счет Юр. лицу""
//              |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
//              |			ТОГДА ""Счет Физ. лицу""
//              |	КОНЕЦ КАК ТипСчета,
//              |	ВЫБОР
//              |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
//              |			ТОГДА ИСТИНА
//              |		ИНАЧЕ ЛОЖЬ
//              |	КОНЕЦ КАК Предоплата,
//              |	ДолгиОплаты.ДатаДолг КАК ДатаДолг,
//              |	ВЫБОР
//              |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
//              |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
//              |			ТОГДА ДолгиОплаты.ПроживаниеСуммаБезСкидки
//              |		ИНАЧЕ ДолгиОплаты.ПроживаниеСумма
//              |	КОНЕЦ КАК СуммаПроживание,
//              |	ВЫРАЗИТЬ(ВЫБОР
//              |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
//              |					И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
//              |				ТОГДА ДолгиОплаты.ПроживаниеСуммаБезСкидки
//              |			ИНАЧЕ ДолгиОплаты.ПроживаниеСумма
//              |		КОНЕЦ / 101 КАК ЧИСЛО) КАК Сумма_1,
//              |	ВЫРАЗИТЬ(100 КАК ЧИСЛО) КАК Сумма_100,
//              |	ВЫРАЗИТЬ(ВЫБОР
//              |			КОГДА ВЫБОР
//              |					КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
//              |							И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
//              |						ТОГДА ДолгиОплаты.ПроживаниеСуммаБезСкидки
//              |					ИНАЧЕ ДолгиОплаты.ПроживаниеСумма
//              |				КОНЕЦ / 101 > 100
//              |				ТОГДА ВЫБОР
//              |						КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
//              |								И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
//              |							ТОГДА ДолгиОплаты.ПроживаниеСуммаБезСкидки
//              |						ИНАЧЕ ДолгиОплаты.ПроживаниеСумма
//              |					КОНЕЦ / 101
//              |			ИНАЧЕ 100
//              |		КОНЕЦ КАК ЧИСЛО) КАК СуммаТурНалог,
//              |	ВЫБОР
//              |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
//              |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
//              |			ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
//              |		ИНАЧЕ ДолгиОплаты.ДатаОплатыМаксимум
//              |	КОНЕЦ КАК ДатаОплаты,
//              |	ДолгиОплаты.ДатаОплатыМаксимум КАК ДатаОплатыМаксимум,
//              |	ДолгиОплаты.СуммаОплачено КАК СуммаОплачено
//              |ИЗ
//              |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
//              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//              |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
//              |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
//              |			ЗаявкаНаБронированиеПроживание.Сумма КАК ПроживаниеСумма,
//              |			ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК ПроживаниеСуммаБезСкидки,
//              |			ОплатыДолги.ДатаОплатыМаксимум КАК ДатаОплатыМаксимум,
//              |			ОплатыДолги.СуммаОплачено КАК СуммаОплачено,
//              |			ЗаявкаНаБронированиеСчетаДетальноДолги.ДатаДолг КАК ДатаДолг
//              |		ИЗ
//              |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
//              |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
//              |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
//              |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
//              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
//              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
//              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
//              |					МАКСИМУМ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты) КАК ДатаОплатыМаксимум,
//              |					СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплачено
//              |				ИЗ
//              |					Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
//              |				
//              |				СГРУППИРОВАТЬ ПО
//              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
//              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД,
//              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК ОплатыДолги
//              |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ОплатыДолги.Ссылка
//              |					И ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД = ОплатыДолги.СчетГУИД
//              |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ОплатыДолги.ДолгиГУИД
//              |		ГДЕ
//              |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ) КАК ДолгиОплаты
//              |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ДолгиОплаты.Ссылка
//              |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиОплаты.СчетГУИД
//              |ГДЕ
//              |	ВЫБОР
//              |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
//              |					И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
//              |				ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
//              |			ИНАЧЕ ДолгиОплаты.ДатаОплатыМаксимум
//              |		КОНЕЦ >= &ДатаОплатыС
//              |	И ВЫБОР
//              |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
//              |					И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
//              |				ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
//              |			ИНАЧЕ ДолгиОплаты.ДатаОплатыМаксимум
//              |		КОНЕЦ <= &ДатаОплатыПо
//              |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
//              |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
//              |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
//              |	И ЗаявкаНаБронированиеСчета.Ссылка.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)";

					  
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	""Начисление"" КАК ТипОперации,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК ДокументДолг,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                      |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                      |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаСчетаС,
                      |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаСчетаПо,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК НомерДокумента,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ДатаДокумента,
                      |	ЗаявкаНаБронированиеСчета.Контрагент.Турагентство КАК КонтрагентТурагентство,
                      |	ДолгиПроживаниеПоДням.ДатаДолг КАК ДатаДолг,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство
                      |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |			ТОГДА ""Счет турагентству (оплата Турагентством)""
                      |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство
                      |				И ЗаявкаНаБронированиеСчета.Контрагент <> ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |			ТОГДА ""Счет через Турагентство (оплата НЕ Турагентством)""
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ""Счет Юр. лицу""
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
                      |			ТОГДА ""Счет Физ. лицу""
                      |	КОНЕЦ КАК ТипСчета,
                      |	ВЫБОР
                      |		КОГДА ОплатыПроживание.ДатаОплатыМаксимум < СчетДолгиПроживание.ДатаДолгМинимум
                      |			ТОГДА ИСТИНА
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК Предоплата,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |			ТОГДА ДолгиПроживаниеПоДням.ПроживаниеСуммаБезСкидки
                      |		ИНАЧЕ ДолгиПроживаниеПоДням.ПроживаниеСумма
                      |	КОНЕЦ КАК СуммаПроживание,
                      |	ВЫРАЗИТЬ(ВЫБОР
                      |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |					И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |				ТОГДА ДолгиПроживаниеПоДням.ПроживаниеСуммаБезСкидки
                      |			ИНАЧЕ ДолгиПроживаниеПоДням.ПроживаниеСумма
                      |		КОНЕЦ / 101 КАК ЧИСЛО) КАК Сумма_1,
                      |	ВЫРАЗИТЬ(100 КАК ЧИСЛО) КАК Сумма_100,
                      |	ВЫРАЗИТЬ(ВЫБОР
                      |			КОГДА ВЫБОР
                      |					КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |							И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |						ТОГДА ДолгиПроживаниеПоДням.ПроживаниеСуммаБезСкидки
                      |					ИНАЧЕ ДолгиПроживаниеПоДням.ПроживаниеСумма
                      |				КОНЕЦ / 101 > 100
                      |				ТОГДА ВЫБОР
                      |						КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |								И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |							ТОГДА ДолгиПроживаниеПоДням.ПроживаниеСуммаБезСкидки
                      |						ИНАЧЕ ДолгиПроживаниеПоДням.ПроживаниеСумма
                      |					КОНЕЦ / 101
                      |			ИНАЧЕ 100
                      |		КОНЕЦ КАК ЧИСЛО) КАК СуммаТурНалог,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
                      |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
                      |			ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
                      |		ИНАЧЕ ОплатыПроживание.ДатаОплатыМаксимум
                      |	КОНЕЦ КАК ДатаОплаты
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплатыСчет,
                      |			МАКСИМУМ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты) КАК ДатаОплатыМаксимум
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |				ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |					И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК ОплатыПроживание
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ОплатыПроживание.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ОплатыПроживание.СчетГУИД
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			МИНИМУМ(ЗаявкаНаБронированиеСчетаДетальноДолги.ДатаДолг) КАК ДатаДолгМинимум,
                      |			МИНИМУМ(ЗаявкаНаБронированиеСчетаДетальноДолги.ДатаДолг) КАК ДатаДолгМаксимум,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолгСчет
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетДолгиПроживание
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетДолгиПроживание.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетДолгиПроживание.СчетГУИД
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.ДатаДолг КАК ДатаДолг,
                      |			ЗаявкаНаБронированиеПроживание.Сумма КАК ПроживаниеСумма,
                      |			ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК ПроживаниеСуммаБезСкидки
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ) КАК ДолгиПроживаниеПоДням
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ДолгиПроживаниеПоДням.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиПроживаниеПоДням.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
                      |	И ОплатыПроживание.СуммаОплатыСчет >= СчетДолгиПроживание.СуммаДолгСчет
                      |	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
                      |	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ЛОЖЬ
                      |	И ОплатыПроживание.ДатаОплатыМаксимум >= &ДатаОплатыС
                      |	И ОплатыПроживание.ДатаОплатыМаксимум <= &ДатаОплатыПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаСчетаПо,
                      |	ДатаОплаты,
                      |	НомерСчета,
                      |	ДатаДолг,
                      |	ДокументДолг");


Запрос.УстановитьПараметр("ДатаОплатыС", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДатаОплатыПо", КонецМесяца(ДатаРасчета));

ТЗ = Запрос.Выполнить().Выгрузить();

ТурНалогДетально.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТурНалогДетально.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	Строка.Сумма_1 = Окр(Строка.Сумма_1);
	Строка.Сумма_100 = Окр(Строка.Сумма_100);
	Строка.СуммаТурНалог = Окр(Строка.СуммаТурНалог);
КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗапросТекстТурНалогДетально()
ЗапросТекст = "ВЫБРАТЬ
              |	""Начисление"" КАК ТипОперации,
              |	ЗаявкаНаБронированиеСчета.Ссылка.Статус КАК Статус,
              |	ЗаявкаНаБронированиеСчета.Ссылка КАК ДокументДолг,
              |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
              |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
              |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
              |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаСчетаС,
              |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаСчетаПо,
              |	ЗаявкаНаБронированиеСчета.Ссылка.Номер КАК НомерДокумента,
              |	ЗаявкаНаБронированиеСчета.Ссылка.Дата КАК ДатаДокумента,
              |	ЗаявкаНаБронированиеСчета.Контрагент.Турагентство КАК КонтрагентТурагентство,
              |	ВЫБОР
              |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство
              |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
              |			ТОГДА ""Счет турагентству (оплата Турагентством)""
              |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Бронирует.Турагентство
              |				И ЗаявкаНаБронированиеСчета.Контрагент <> ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
              |			ТОГДА ""Счет через Турагентство (оплата НЕ Турагентством)""
              |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
              |			ТОГДА ""Счет Юр. лицу""
              |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ФизЛицо)
              |			ТОГДА ""Счет Физ. лицу""
              |	КОНЕЦ КАК ТипСчета,
              |	ВЫБОР
              |		КОГДА ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
              |			ТОГДА ИСТИНА
              |		ИНАЧЕ ЛОЖЬ
              |	КОНЕЦ КАК Предоплата,
              |	ДолгиОплаты.ДатаДолг КАК ДатаДолг,
              |	ВЫБОР
              |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
              |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
              |			ТОГДА ДолгиОплаты.ПроживаниеСуммаБезСкидки
              |		ИНАЧЕ ДолгиОплаты.ПроживаниеСумма
              |	КОНЕЦ КАК СуммаПроживание,
              |	ВЫРАЗИТЬ(ВЫБОР
              |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
              |					И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
              |				ТОГДА ДолгиОплаты.ПроживаниеСуммаБезСкидки
              |			ИНАЧЕ ДолгиОплаты.ПроживаниеСумма
              |		КОНЕЦ / 101 КАК ЧИСЛО) КАК Сумма_1,
              |	ВЫРАЗИТЬ(100 КАК ЧИСЛО) КАК Сумма_100,
              |	ВЫРАЗИТЬ(ВЫБОР
              |			КОГДА ВЫБОР
              |					КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
              |							И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
              |						ТОГДА ДолгиОплаты.ПроживаниеСуммаБезСкидки
              |					ИНАЧЕ ДолгиОплаты.ПроживаниеСумма
              |				КОНЕЦ / 101 > 100
              |				ТОГДА ВЫБОР
              |						КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
              |								И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
              |							ТОГДА ДолгиОплаты.ПроживаниеСуммаБезСкидки
              |						ИНАЧЕ ДолгиОплаты.ПроживаниеСумма
              |					КОНЕЦ / 101
              |			ИНАЧЕ 100
              |		КОНЕЦ КАК ЧИСЛО) КАК СуммаТурНалог,
              |	ВЫБОР
              |		КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
              |				И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
              |			ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
              |		ИНАЧЕ ДолгиОплаты.ДатаОплатыМаксимум
              |	КОНЕЦ КАК ДатаОплаты,
              |	ДолгиОплаты.ДатаОплатыМаксимум КАК ДатаОплатыМаксимум,
              |	ДолгиОплаты.СуммаОплачено КАК СуммаОплачено
              |ИЗ
              |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
              |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
              |			ЗаявкаНаБронированиеПроживание.Сумма КАК ПроживаниеСумма,
              |			ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК ПроживаниеСуммаБезСкидки,
              |			ОплатыДолги.ДатаОплатыМаксимум КАК ДатаОплатыМаксимум,
              |			ОплатыДолги.СуммаОплачено КАК СуммаОплачено,
              |			ЗаявкаНаБронированиеСчетаДетальноДолги.ДатаДолг КАК ДатаДолг
              |		ИЗ
              |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
              |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
              |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
              |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
              |					МАКСИМУМ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты) КАК ДатаОплатыМаксимум,
              |					СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплачено
              |				ИЗ
              |					Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
              |				
              |				СГРУППИРОВАТЬ ПО
              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД,
              |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК ОплатыДолги
              |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ОплатыДолги.Ссылка
              |					И ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД = ОплатыДолги.СчетГУИД
              |					И ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД = ОплатыДолги.ДолгиГУИД
              |		ГДЕ
              |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ) КАК ДолгиОплаты
              |		ПО ЗаявкаНаБронированиеСчета.Ссылка = ДолгиОплаты.Ссылка
              |			И ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиОплаты.СчетГУИД
              |ГДЕ
              |	ВЫБОР
              |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
              |					И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
              |				ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
              |			ИНАЧЕ ДолгиОплаты.ДатаОплатыМаксимум
              |		КОНЕЦ >= &ДатаОплатыС
              |	И ВЫБОР
              |			КОГДА ЗаявкаНаБронированиеСчета.Контрагент.Турагентство
              |					И ЗаявкаНаБронированиеСчета.Контрагент = ЗаявкаНаБронированиеСчета.Ссылка.Бронирует
              |				ТОГДА ЗаявкаНаБронированиеСчета.ДатаС
              |			ИНАЧЕ ДолгиОплаты.ДатаОплатыМаксимум
              |		КОНЕЦ <= &ДатаОплатыПо
              |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
              |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
              |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
              |	И ЗаявкаНаБронированиеСчета.Ссылка.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)";

Возврат ЗапросТекст;
КонецФункции

&НаСервере
Функция СтатусНеТурналог(Статус)
СтатусНеТурналог = Статус = Перечисления.СтатусБрони.Неустойка
				ИЛИ Статус = Перечисления.СтатусБрони.ОтказОтБронирования
				ИЛИ Статус <> Перечисления.СтатусБрони.Неустойка;
				
Возврат СтатусНеТурналог;	
КонецФункции

&НаСервере
Функция СменаСтатуса(Статус1, Статус2)
Статус_П1 = ?(СтатусНеТурналог(Статус1), 1, 0);
Статус_П2 = ?(СтатусНеТурналог(Статус2), 1, 0);

СменаСтатуса = (Статус_П1 <> Статус_П2); 
Возврат СменаСтатуса;	
КонецФункции

&НаСервере
Процедура ЗаполнитьТурналогИстория()
//ТЗ = ТурНалогДетально.Выгрузить(, "ДатаРасчета, ДокументДолг, СчетГУИД, ТипОперации, Статус" 
//	+ ", НомерСчета, ДатаСчета, ДатаСчетаС, ДатаСчетаПо, КонтрагентТурагентство, СуммаТурНалог");
//ТЗ.Свернуть("ДатаРасчета, ДокументДолг, СчетГУИД, ТипОперации, Статус" 
//	+ ", НомерСчета, ДатаСчета, ДатаСчетаС, ДатаСчетаПо, КонтрагентТурагентство", "СуммаТурНалог");

ТЗ = ТурНалогДетально.Выгрузить(, "ДокументДолг, СчетГУИД, ТипОперации, Статус, СуммаТурНалог"); 
ТЗ.Свернуть("ДокументДолг, СчетГУИД, ТипОперации, Статус", "СуммаТурНалог");

ДатаРасчета_П = КонецМесяца(ДатаРасчета);

НаборЗаписей = РегистрыСведений.ТурналогИстория.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.ДатаРасчета.Установить(ДатаРасчета_П);
НаборЗаписей.Прочитать();
НаборЗаписей.Очистить();
НаборЗаписей.Записать();

НаборЗаписей = РегистрыСведений.ТурналогИстория.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.ДатаРасчета.Установить(ДатаРасчета_П);
	
Для Каждого Строка Из ТЗ Цикл
	//Если СтатусНеТурналог(Строка.ДокументДолг.Статус) 
	//Тогда Продолжить; КонецЕсли;
	
	Если Лев(Строка.ТипОперации, 6) = "Сторно" Тогда 
		Продолжить; 
	КонецЕсли;
	                                 //123456
	Если Строка.ДокументДолг.Статус = Перечисления.СтатусБрони.Бронь Тогда
		Если Строка.ДокументДолг.РезервПо <= ДатаРасчета_П 
		Тогда Продолжить; КонецЕсли;
	КонецЕсли;

	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.ДатаРасчета = ДатаРасчета_П;
	
	НоваяЗапись.ТипОперации = Строка.ТипОперации;

	НоваяЗапись.ДокументДолг = Строка.ДокументДолг;
	
	НоваяЗапись.СчетГУИД = Строка.СчетГУИД;
	
	НоваяЗапись.СуммаТурналог = Строка.СуммаТурналог;
	
	НоваяЗапись.Статус = Строка.Статус;
	
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	НайденныеСчета = Строка.ДокументДолг.Счета.НайтиСтроки(ОтборСтроки);	
	Счет = НайденныеСчета[0];
	
	НоваяЗапись.НомерСчета = Счет.НомерСчета;
	НоваяЗапись.ДатаСчета  = Счет.ДатаСчета;
	НоваяЗапись.ДатаСчетаС = Счет.ДатаС;
	НоваяЗапись.ДатаСчетаПо = Счет.ДатаПо;
	
	НоваяЗапись.КонтрагентТурагентство = Счет.Контрагент.Турагентство;
КонецЦикла;	

НаборЗаписей.Записать();
КонецПроцедуры

&НаСервере
Функция ТЗ_ТурНалогИзменения(ДатаРасчета)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВЫРАЗИТЬ(КОНЕЦПЕРИОДА(&ДатаРасчета, МЕСЯЦ) КАК ДАТА) КАК ДатаРасчета,
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК ДокументДолг,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	СчетаДолгиИтого.СуммаТурНалог КАК СуммаТурНалог,
                      |	СчетаДолгиИтого.СуммаДолг КАК СуммаДолгИтого,
                      |	СчетаОплатыИтого.СуммаОплаты КАК СуммаОплатыИтого
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
                      |			СУММА(ВЫРАЗИТЬ(ВЫБОР
                      |						КОГДА ВЫБОР
                      |								КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Количество = 0
                      |									ТОГДА 0
                      |								ИНАЧЕ ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг / ЗаявкаНаБронированиеСчетаДетальноДолги.Количество
                      |							КОНЕЦ / 101 > 100
                      |							ТОГДА ВЫБОР
                      |									КОГДА ЗаявкаНаБронированиеСчетаДетальноДолги.Количество = 0
                      |										ТОГДА 0
                      |									ИНАЧЕ ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг / ЗаявкаНаБронированиеСчетаДетальноДолги.Количество
                      |								КОНЕЦ / 101
                      |						ИНАЧЕ 100
                      |					КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаТурНалог
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДолгиИтого
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДолгиИтого.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДолгиИтого.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты,
                      |			МАКСИМУМ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты) КАК ДатаОплаты
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК СчетаОплатыИтого
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаОплатыИтого.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаОплатыИтого.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.ДатаИзменения >= &ДатаИзмененияС
					  |	И ЗаявкаНаБронированиеСчета.Ссылка.ДатаИзменения <= &ДатаИзмененияПо
					  |	И ЗаявкаНаБронированиеСчета.Ссылка.ДатаСоздания <= &ДатаСоздания
					  |	И ЗаявкаНаБронированиеСчета.Ссылка.РезервПо >= &ДатаНачала
					  |");


Запрос.УстановитьПараметр("ДатаНачала", '20250101');
Запрос.УстановитьПараметр("ДатаИзмененияС", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДатаИзмененияПо", КонецМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДатаСоздания", НачалоМесяца(ДатаРасчета));
Запрос.УстановитьПараметр("ДатаРасчета", КонецМесяца(ДатаРасчета));

ТЗ = Запрос.Выполнить().Выгрузить();

Возврат ТЗ;
КонецФункции

&НаКлиенте
Процедура ТурНалогДетальноВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = ТурНалогДетально.НайтиПоИдентификатору(ВыбраннаяСтрока);	
	
ПараметрыФормы = Новый Структура("ТолькоПросмотр", Истина);

Если Поле.Имя = "ТурНалогДетальноГрупповойСчет" Тогда
	Если ЗначениеЗаполнено(ТД.ГрупповойСчет) Тогда
		ПараметрыФормы.Вставить("Ключ", ТД.ГрупповойСчет);	

		ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;			
Иначе
	Если ЗначениеЗаполнено(ТД.ДокументДолг) Тогда
		ПараметрыФормы.Вставить("Ключ", ТД.ДокументДолг);	

		ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе	
		Если ЗначениеЗаполнено(ТД.ГрупповойСчет) Тогда
			ПараметрыФормы.Вставить("Ключ", ТД.ГрупповойСчет);	

			ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
				,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;			
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТурНалогДетальноИзмененияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = ТурНалогДетальноИзменения.НайтиПоИдентификатору(ВыбраннаяСтрока);	
	
ПараметрыФормы = Новый Структура("ТолькоПросмотр", Истина);

ПараметрыФормы.Вставить("Ключ", ТД.ДокументДолг);	
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТурНалогЗаявкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = ТурНалогЗаявки.НайтиПоИдентификатору(ВыбраннаяСтрока);	
	
Если НЕ ЗначениеЗаполнено(ТД.ДокументДолг) Тогда Возврат; КонецЕсли;

ПараметрыФормы = Новый Структура("ТолькоПросмотр", Истина);
		
Если ТипЗнч(ТД.ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	ПараметрыФормы.Вставить("Ключ", ТД.ДокументДолг);	

	ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
Иначе
	ПараметрыФормы.Вставить("Ключ", ТД.ДокументДолг);	

	ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецЕсли;
КонецПроцедуры
