
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("КонтрагентыОтбор", КонтрагентыОтбор);
ВсеЗаписи = Истина;
Если ЗначениеЗаполнено(КонтрагентыОтбор) Тогда
	Если КонтрагентыОтбор.Количество() > 0 Тогда
		ВсеЗаписи = Ложь;
	КонецЕсли;	
КонецЕсли;
УстановитьСписокПараметры();
		
ЗапрещенныеПоля = Новый Массив;
ЗапрещенныеПоля.Добавить("ПолнаяПапка");
	
Список.УстановитьОграниченияИспользованияВГруппировке(ЗапрещенныеПоля);
Список.УстановитьОграниченияИспользованияВОтборе(ЗапрещенныеПоля);
Список.УстановитьОграниченияИспользованияВПорядке(ЗапрещенныеПоля);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
МассивСтрок = Строки.ПолучитьКлючи();
Для Каждого КлючСтроки Из МассивСтрок Цикл
	СтрокаДинСписка = Строки[КлючСтроки];   
	
	ТекущийРодитель = "";
	ОбщийФункционалСервер.ПолнаяПапкаРодитель(СтрокаДинСписка.Данные.Ссылка, ТекущийРодитель);
	ПолнаяПапкаРодитель = ТекущийРодитель;
	СтрокаДинСписка.Данные["ПолнаяПапка"] = ПолнаяПапкаРодитель;
	
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокПараметры()
Элементы.Список.Отображение =  ?(ВсеЗаписи, ОтображениеТаблицы.ИерархическийСписок, ОтображениеТаблицы.Список);	
	
Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаписи", ВсеЗаписи); 
Список.Параметры.УстановитьЗначениеПараметра("КонтрагентыОтбор", КонтрагентыОтбор); 
КонецПроцедуры

&НаКлиенте
Процедура ВсеЗаписиПриИзменении(Элемент)
УстановитьСписокПараметры();
КонецПроцедуры
