
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("Авто", Отчет.Авто);

Отчет.ДатаС = ТекущаяДата();
Отчет.ДатаПо = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если Отчет.Авто тогда
	Отчет.ДатаС=НачалоДня(ТекущаяДата()-86400);
	Отчет.ДатаПо=НачалоДня(ТекущаяДата());
	
	ВыполнитьКоманда(Неопределено);
	
	//ЭлементыФормы.ПолеОтчета.Записать("C:\1c_base\rep\Gorn.xls",ТипФайлаТабличногоДокумента.XLS97);
	
	ИмяФайла = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
	ИмяФайла = ИмяФайла + "rep\Gorn.xls"; 
	
	//ПолеОтчета.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS97);
	ДопПараметры = Новый Структура("ИмяФайла", ИмяФайла);
	Оповещение = Новый ОписаниеОповещения("ЗавершитьЗаписьФайла", ЭтаФорма, ДопПараметры);
	ПолеОтчета.НачатьЗапись(Оповещение, ИмяФайла,ТипФайлаТабличногоДокумента.XLS97);
	
	//ОтправитьМылом("Отчет горничных за "+ Формат(ТекущаяДата()-86400, "ДФ=dd.MM.yy")
	//	,"C:\1c_base\rep\Gorn.xls", "", "guz@agent5.ru");
конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаписьФайла(Результат, ДополнительныеПараметры) Экспорт
ИмяФайла = ДополнительныеПараметры.ИмяФайла; 
	
//ОтправитьМылом("Отчет горничных за "+ Формат(ТекущаяДата()-86400, "ДФ=dd.MM.yy")
//	,ИмяФайла, "", "guz@agent5.ru");
//ОбщийМодульСлужебныеСервер.ОтправитьМылом_ОбщийОтчетПоГорничным("Отчет горничных за "+ Формат(ТекущаяДата()-86400, "ДФ=dd.MM.yy")
//	,ИмяФайла, "", "guz@agent5.ru");

Получатели = Новый СписокЗначений;
Получатели.Добавить("postnikov_sn@invina.ru");
//Получатели.Добавить("Kantorov_EE@invina.ru");
//Получатели.Добавить("arestova_ov@invina.ru");
//Получатели.Добавить("isaeva_js@invina.ru");

Файлы = Новый СписокЗначений;
Файлы.Добавить("ИмяФайла");

СлужебныеСервер.ОтправитьМейлом("Отчет горничных за "+ Формат(ТекущаяДата()-86400, "ДФ=dd.MM.yy")
	,Файлы, Получатели);
КонецПроцедуры	
//

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
ДанныеЗагружены = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
ДанныеЗагружены = Ложь;
КонецПроцедуры

//
&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
// + OLD	
//ОбщийМодульСервер.ЗагрузкаАрхива();
//ОбщийМодульСервер.ЗагрузкаТек();

//ОбщееСервер.ЗагрузкаОсмотра();
// - OLD	

Если НЕ ДанныеЗагружены Тогда
	ОбменГорничныеСервер.ЗагрузитьОбслуживаниеНомеров(Отчет.ДатаС, Отчет.ДатаПо, "");	

	ОбменГорничныеСервер.ЗагрузитьОбслуживаниеПомещений(Отчет.ДатаС, Отчет.ДатаПо);	
	
	ДанныеЗагружены = Истина;
КонецЕсли;

СформироватьТекущий();
КонецПроцедуры
//

Процедура УстановитьСписокВыбораТехническаяНеисправность()
СписокВыбора = Элементы.ТехническаяНеисправность.СписокВыбора;
СписокВыбора.Очистить();
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеОбслуживаниеНомераТехническиеНеисправности.ТехническаяНеисправность КАК ТехническаяНеисправность
                      |ИЗ
                      |	Документ.ГорничныеОбслуживаниеНомера.ТехническиеНеисправности КАК ГорничныеОбслуживаниеНомераТехническиеНеисправности
                      |ГДЕ
                      |	ГорничныеОбслуживаниеНомераТехническиеНеисправности.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеОбслуживаниеНомераТехническиеНеисправности.Ссылка.ВремяУборки МЕЖДУ &ВремяУборкиНачало И &ВремяУборкиОкончание
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ГорничныеОбслуживаниеНомераТехническиеНеисправности.ТехническаяНеисправность
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ТехническаяНеисправность");

Запрос.УстановитьПараметр("ВремяУборкиНачало", Отчет.ДатаС);
Запрос.УстановитьПараметр("ВремяУборкиОкончание", КонецДня(Отчет.ДатаПо));

Выборка = Запрос.Выполнить().Выбрать();

Пока Выборка.Следующий() Цикл
	 СписокВыбора.Добавить(Выборка.ТехническаяНеисправность);
КонецЦикла;
КонецПроцедуры

////
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	СформироватьТекущий();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекущий()
	Имя=Элементы.Страницы.ТекущаяСтраница.Имя;
	Выполнить("Сформировать"+Имя+"()");
	
	ПолеОтчета.ФиксацияСверху = 1;
КонецПроцедуры

&НаСервере
Процедура СформироватьОбщийСтраница()

ЗапросТекст = "ВЫБРАТЬ
              |	УборкиНомеров.Комната КАК Ном,
              |	УборкиНомеров.ВремяУброки КАК Дата,
              |	УборкиНомеров.Горничная КАК Горничная,
              |	УборкиНомеров.ТипУборки КАК тип,
              |	УборкиНомеров.ТипКомплектации КАК ТипКомплектации,
              |	УборкиНомеров.Температура КАК темп,
              |	УборкиНомеров.КолВоГостей КАК КолВо,
              |	УборкиНомеров.Неисправности КАК Тех,
              |	УборкиНомеров.Ущерб КАК Ущерб,
              |	УборкиНомеров.Минибар КАК Минибар,
              |	УборкиНомеров.Оборудование КАК Оборудование,
              |	УборкиНомеров.Тариф_НеИспользуется КАК Тариф_НеИспользуется,
              |	УборкиНомеров.Курит КАК Курит,
              |	УборкиНомеров.Комментарий КАК Комментарий,
              |	УборкиНомеров.КомментарийАдминистрации КАК КомментарийАдминистрации,
              |	УборкиНомеров.РаздельныеКровати КАК РаздельныеКровати,
              |	УборкиНомеров.РаздельныеКроватиОбработка КАК РаздельныеКроватиОбработка,
              |	УборкиНомеров.Регистратор КАК Регистратор,
              |	УборкиНомеров.Регистратор.МанипуляцияКровати КАК МанипуляцияКровати,
              |	УборкиНомеров.Регистратор.МанипуляцияДопМесто_1 КАК МанипуляцияДопМесто_1,
              |	УборкиНомеров.Регистратор.МанипуляцияДопМесто_2 КАК МанипуляцияДопМесто_2,
              |	УборкиНомеров.Регистратор.ТипУборкиПризнак КАК ТипУборкиПризнак,
              |	УборкиНомеров.Регистратор.ДопМесто_1_ТипДопМеста КАК РегистраторДопМесто_1_ТипДопМеста,
              |	УборкиНомеров.Регистратор.ДопМесто_2_ТипДопМеста КАК РегистраторДопМесто_2_ТипДопМеста,
              |	УборкиНомеров.Регистратор.ДатаОбслуживания КАК РегистраторДатаОбслуживания,
              |	УборкиНомеров.Регистратор.НомерОбслуживания_пп КАК РегистраторНомерОбслуживания_пп,
              |	УборкиНомеров.Комната.Наименование КАК КомнатаНаименование
              |ИЗ
              |	РегистрСведений.УборкиНомеров КАК УборкиНомеров
              |ГДЕ
              |	УборкиНомеров.ВремяУброки МЕЖДУ &ДН И &Дк";

ЗапросТекстОкончание = "
              |УПОРЯДОЧИТЬ ПО
              |	РегистраторДатаОбслуживания,
              |	КомнатаНаименование,
              |	РегистраторНомерОбслуживания_пп";
	
Запрос = Новый Запрос;
Если Отчет.Номер.Пустая() и Отчет.Этаж=0 тогда
	
	Запрос.Текст = ЗапросТекст + ЗапросТекстОкончание;
	
иначеесли не  Отчет.Номер.Пустая() тогда
	
	Запрос.Текст = ЗапросТекст + "
		                    |	И УборкиНомеров.Комната = &Комната"
			+ ЗапросТекстОкончание;
			
	Запрос.УстановитьПараметр("Комната",Отчет.Номер);
	
иначе
	Запрос.Текст = ЗапросТекст + "
	                    |	И УборкиНомеров.Комната.Этаж = &Этаж"
		+ ЗапросТекстОкончание;
	
	Запрос.УстановитьПараметр("Этаж",Отчет.Этаж);
конецесли;

Запрос.УстановитьПараметр("ДН",Отчет.ДатаС);
Запрос.УстановитьПараметр("Дк",КонецДня(Отчет.ДатаПо));

ТЗ=Запрос.Выполнить().Выгрузить();
ТЗ.Колонки.Добавить("МДМ");
Для Каждого Строка Из ТЗ Цикл 
	МДМ = 0;
	Если Строка.МанипуляцияДопМесто_1 Тогда МДМ = МДМ + 1; КонецЕсли;
	Если Строка.МанипуляцияДопМесто_2 Тогда МДМ = МДМ + 1; КонецЕсли;
	
	Строка.МДМ = МДМ;
КонецЦикла;
   
ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
Макет = ОтчетОбъект.ПолучитьМакет("МакетОбщий");  

ПолеОтчета.Очистить();
ПолеОтчета.ФиксацияСверху = 1;

Шапка=Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(Шапка);

//ПоискТарифа = Новый Запрос("ВЫБРАТЬ
//	|	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф
//	|ИЗ
//	|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
//	|ГДЕ
//	|	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
//	|	И ЗанятостьНомеров.Номер = &Номер");

ПоискДатчиков= Новый Запрос("ВЫБРАТЬ
	|	ПоказанияДатчиков.Показатель
	|ИЗ
	|	РегистрСведений.ПоказанияДатчиков КАК ПоказанияДатчиков
	|ГДЕ
	|	ПоказанияДатчиков.Время МЕЖДУ &ВремяС И &ВремяПо
	|	И ПоказанияДатчиков.Датчик.НомерКомнаты = &НомерКомнаты");	

ПоискЗамечаний = новый Запрос("ВЫБРАТЬ
	|	ЗамечанияПоНомерам.Замечание,
	|	ЗамечанияПоНомерам.ВремяПроверки,
	|	ЗамечанияПоНомерам.Комментарий,
	|	ЗамечанияПоНомерам.Супервайзер
	|ИЗ
	|	РегистрСведений.ЗамечанияПоНомерам КАК ЗамечанияПоНомерам
	|ГДЕ
	|	ЗамечанияПоНомерам.Комната = &Комната
	|	И ЗамечанияПоНомерам.ВремяПроверки МЕЖДУ &ДН И &ДК
	|	И ЗамечанияПоНомерам.Супервайзер = ЛОЖЬ");

ПоискЗамечанийАудитора = новый Запрос("ВЫБРАТЬ
	|	ЗамечанияПоНомерам.Замечание,
	|	ЗамечанияПоНомерам.ВремяПроверки,
	|	ЗамечанияПоНомерам.Комментарий,
	|	ЗамечанияПоНомерам.Супервайзер
	|ИЗ
	|	РегистрСведений.ЗамечанияПоНомерам КАК ЗамечанияПоНомерам
	|ГДЕ
	|	ЗамечанияПоНомерам.Комната = &Комната
	|	И ЗамечанияПоНомерам.ВремяПроверки МЕЖДУ &ДН И &ДК
	|	И ЗамечанияПоНомерам.Супервайзер = ИСТИНА");

Для каждого Стр Из ТЗ Цикл
	ПоискЗамечаний.УстановитьПараметр("Комната",Стр.Ном);
	ПоискЗамечаний.УстановитьПараметр("ДН",НачалоДня(Стр.Дата));
	ПоискЗамечаний.УстановитьПараметр("ДК",КонецДня(Стр.Дата)); 
	ТЗЗ=ПоискЗамечаний.Выполнить().Выгрузить();
	
	ПоискЗамечанийАудитора.УстановитьПараметр("Комната",Стр.Ном);
	ПоискЗамечанийАудитора.УстановитьПараметр("ДН",НачалоДня(Стр.Дата));
	ПоискЗамечанийАудитора.УстановитьПараметр("ДК",КонецДня(Стр.Дата));
	ТЗЗА=ПоискЗамечанийАудитора.Выполнить().Выгрузить();
	
	Проверялось=?(ТЗЗ.Количество()+ТЗЗА.Количество()=0,Ложь,Истина);
	
	Обл=Макет.ПолучитьОбласть("Строка"+?(Проверялось,"1",""));
	
	//ПоискТарифа.УстановитьПараметр("Номер",Стр.Ном);
	//ПоискТарифа.УстановитьПараметр("ДН",Стр.Дата-3600);
	//ПоискТарифа.УстановитьПараметр("ДК",Стр.Дата+3600);
	//ТЗТариф=ПоискТарифа.Выполнить().Выгрузить();
	//Если ТЗТариф.Количество()>0 тогда
	//	Обл.Параметры.Тариф=ТЗТариф[0].Тариф;
	//конецесли;
	
	ПоискДатчиков.УстановитьПараметр("НомерКомнаты",Стр.Ном);
	ПоискДатчиков.УстановитьПараметр("ВремяС",Стр.Дата-3600);
	ПоискДатчиков.УстановитьПараметр("ВремяПо",Стр.Дата+3600);
	ТЗД=ПоискДатчиков.Выполнить().Выгрузить();
	Если ТЗД.Количество()>0 тогда
		Обл.Параметры.ТемпД=ТЗД[0].Показатель;
	конецесли;
	
	Обл.Параметры.Замечания="";
	Обл.Параметры.ЗамечанияА="";
	Обл.Параметры.КомментарийАдминистрации = "";
	Обл.Параметры.КомментарийПроверяющего = "";
	
	Для каждого СтрЗ Из ТЗЗ Цикл
		Обл.Параметры.ВремяПроверки=?(Проверялось,СтрЗ.ВремяПроверки,"-");
		Обл.Параметры.Замечания=Обл.Параметры.Замечания + СтрЗ.Замечание.Наименование+" ";
		Обл.Параметры.КомментарийАдминистрации = Обл.Параметры.КомментарийАдминистрации + ?(СтрЗ.Супервайзер,"",СтрЗ.Комментарий);
		Стр.КомментарийАдминистрации = Стр.КомментарийАдминистрации+ ?(СтрЗ.Супервайзер,"",СтрЗ.Комментарий);
		Обл.Параметры.КомментарийПроверяющего = Обл.Параметры.КомментарийПроверяющего + ?(СтрЗ.Супервайзер,СтрЗ.Комментарий,"");
	КонецЦикла; 
	
	Для каждого СтрЗ Из ТЗЗА Цикл
		Обл.Параметры.ВремяПроверкиА=?(Проверялось,СтрЗ.ВремяПроверки,"-");
		Обл.Параметры.ЗамечанияА=Обл.Параметры.ЗамечанияА + СтрЗ.Замечание.Наименование+" ";
		Обл.Параметры.КомментарийАдминистрации = Обл.Параметры.КомментарийАдминистрации + ?(СтрЗ.Супервайзер,"",СтрЗ.Комментарий);
		Стр.КомментарийАдминистрации = Стр.КомментарийАдминистрации+ ?(СтрЗ.Супервайзер,"",СтрЗ.Комментарий);
		Обл.Параметры.КомментарийПроверяющего = Обл.Параметры.КомментарийПроверяющего + ?(СтрЗ.Супервайзер,СтрЗ.Комментарий,"");
	КонецЦикла; 
	               
	Обл.Параметры.Заполнить(Стр);
	Обл.Параметры.НомерОбслуживания_ПП = Стр.РегистраторНомерОбслуживания_ПП;
	
	Если ЗначениеЗаполнено(Стр.ТипУборкиПризнак) Тогда
		Обл.Параметры.тип = Стр.ТипУборкиПризнак;
	КонецЕсли;
	
	Если Стр.РаздельныеКровати Тогда
		Обл.Параметры.РаздельныеКровати = "РК";
	Иначе
		Обл.Параметры.РаздельныеКровати = "";
	КонецЕсли;
	
	Если Стр.МанипуляцияКровати Тогда
		Обл.Параметры.МанипуляцияКровати = "МК";
	Иначе
		Обл.Параметры.МанипуляцияКровати = "";
	КонецЕсли;
	
	Если Стр.МДМ > 0 Тогда
		Обл.Параметры.МДМ = Стр.МДМ;
	КонецЕсли;
	
	Если Стр.РегистраторДопМесто_1_ТипДопМеста = 2 ИЛИ Стр.РегистраторДопМесто_2_ТипДопМеста = 2 Тогда
		Обл.Параметры.Манеж = "Манеж";
	Иначе
		Обл.Параметры.Манеж = "";
	КонецЕсли;
	
	Обл.Параметры.ДопМесто_1 = ДопМестоНаименование(Стр.РегистраторДопМесто_1_ТипДопМеста);
	Обл.Параметры.ДопМесто_2 = ДопМестоНаименование(Стр.РегистраторДопМесто_2_ТипДопМеста);
	
	//Обл.Параметры.МанипуляцияДопМесто = МанипуляцияДопМестоКоличество(Стр.Регистратор);
	
	Обл.Параметры.Минибар = МинибарСтрока(Стр.Регистратор);
	
	Обл.Параметры.РасшифровкаМинибар = "РасшифровкаМинибар";
	Обл.Параметры.РасшифровкаДокумент = Стр.Регистратор;
	Обл.Параметры.РасшифровкаЗаявка = Стр.Регистратор.ЗаявкаНаБронирование;
	
	Обл.Параметры.РасшифровкаНеисправности = "РасшифровкаНеисправности";
	
	ПолеОтчета.Вывести(Обл);
КонецЦикла;

Минибар_Нет = Константы.Минибар_Нет.Получить();
Если Минибар_Нет Тогда
	ПолеОтчета.Область(, 13, 13).Видимость = Ложь;	
КонецЕсли;

ПолеОтчета.ФиксацияСверху = 1;
КонецПроцедуры

&НаСервере
Функция ДопМестоНаименование(ТипДопМеста)
Если ТипДопМеста = 1 Тогда
	Возврат "Доп. кровать";
ИначеЕсли ТипДопМеста = 2 Тогда
	Возврат "Манеж";
Иначе
	Возврат "";
КонецЕсли;	
КонецФункции

&НаСервере
Функция МанипуляцияДопМестоКоличество(Регистратор)
МДМ_Количество = 0;	
Если Регистратор.МанипуляцияДопМесто_1 Тогда 	
	МДМ_Количество = МДМ_Количество + 1; 	
КонецЕсли;	
Если Регистратор.МанипуляцияДопМесто_2 Тогда 	
	МДМ_Количество = МДМ_Количество + 1; 	
КонецЕсли;	

Возврат МДМ_Количество;
КонецФункции


&НаСервере
Функция МинибарСтрока(Регистратор)
МинибраСтрока = "";
Для Каждого Строка Из Регистратор.Минибар Цикл
	Если ЗначениеЗаполнено(Строка.НоменклатураМинибара) Тогда
		МинибраСтрока = МинибраСтрока + Строка.НоменклатураМинибара;
	Иначе
		МинибраСтрока = МинибраСтрока + "* " + Строка.НоменклатураМинибараНаименованиеВыгрузка;
	КонецЕсли;
	
	МинибраСтрока = МинибраСтрока + ": " + Строка.Количество + " * " + Строка.Цена + " = " + Строка.Количество * Строка.Цена;	
	
	МинибраСтрока = МинибраСтрока + Символы.ПС;
КонецЦикла;

Если МинибраСтрока <> "" Тогда МинибраСтрока = Лев(МинибраСтрока, СтрДлина(МинибраСтрока) - 1); КонецЕсли;
	
Возврат МинибраСтрока;	
КонецФункции

&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
Если Расшифровка = "РасшифровкаМинибар" Тогда
	СтандартнаяОбработка = Ложь;
	
	НомерСтроки = Элемент.ТекущаяОбласть.Верх;
	Регистратор = ПолеОтчета.Область(НомерСтроки, 1, НомерСтроки, 1).Расшифровка;
	
	ПараметрыФормы = Новый Структура("Ключ", Регистратор);
	ОткрытьФорму("Отчет.ОбщийОтчетПоГорничным.Форма.МинибарРасшифровка", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
ИначеЕсли Расшифровка = "РасшифровкаНеисправности" Тогда
	СтандартнаяОбработка = Ложь;
	
	НомерСтроки = Элемент.ТекущаяОбласть.Верх;
	Регистратор = ПолеОтчета.Область(НомерСтроки, 1, НомерСтроки, 1).Расшифровка;
	
	ПараметрыФормы = Новый Структура("Ключ", Регистратор);
	ОткрытьФорму("Отчет.ОбщийОтчетПоГорничным.Форма.ТехническиеНеисправностиРасшифровка", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки_1(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
Если Расшифровка = "РасшифровкаМинибар" Тогда
	СтандартнаяОбработка = Ложь;
	
	НомерСтроки = Элемент.ТекущаяОбласть.Верх;
	Регистратор = ПолеОтчета.Область(НомерСтроки, 1, НомерСтроки, 1).Расшифровка;
	
	ПараметрыФормы = Новый Структура("Ключ", Регистратор);
	ОткрытьФорму("Отчет.ОбщийОтчетПоГорничным.Форма.МинибарРасшифровка", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Возврат;	
КонецЕсли;
КонецПроцедуры
//

&НаСервере
Процедура СформироватьТемператураСтраница()
Запрос=Новый Запрос("ВЫБРАТЬ
|	УборкиНомеров.Комната КАК Ном,
|	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) КАК Дата,
|	УборкиНомеров.Горничная КАК Горничная,
|	УборкиНомеров.ТипУборки КАК тип,
|	УборкиНомеров.Температура КАК темп,
|	УборкиНомеров.КолВоГостей как КолВо,
|	УборкиНомеров.Неисправности КАК Тех,
|	УборкиНомеров.Ущерб, 
|	УборкиНомеров.Оборудование,
|	УборкиНомеров.Минибар
|ИЗ
|	РегистрСведений.УборкиНомеров КАК УборкиНомеров
|ГДЕ
|	УборкиНомеров.ВремяУброки МЕЖДУ &ДН И &Дк
|
|УПОРЯДОЧИТЬ ПО
|	ВремяУброки,
|	Комната");

Запрос.УстановитьПараметр("ДН",Отчет.ДатаС);
Запрос.УстановитьПараметр("Дк",КонецДня(Отчет.ДатаПо));
ТЗ=Запрос.Выполнить().Выгрузить();

//Макет=ПолучитьМакет("МакетТемп");
//Макет = Отчеты.ОбщийОтчетПоГорничным.ПолучитьМакет("МакетТемп");
ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
Макет = ОтчетОбъект.ПолучитьМакет("МакетТемп");

Шапка=Макет.ПолучитьОбласть("Шапка");

ПолеОтчета.Очистить();
ПолеОтчета.Вывести(Шапка);

Для каждого Стр Из ТЗ Цикл
	Если ТипЗнч(Стр.Темп) = Тип("Число") Тогда
		Температура = Стр.Темп;
	ИначеЕсли ТипЗнч(Стр.Темп) = Тип("Строка") Тогда
		Попытка 
			Температура = Число(Стр.Темп);
		Исключение
			Продолжить;
		КонецПопытки;
	Иначе
		Продолжить;
	КонецЕсли;
		
	Если Температура < 22 или Температура > 24 тогда
		Обл=Макет.ПолучитьОбласть("Строка1");
	иначе
		Обл=Макет.ПолучитьОбласть("Строка");
		
	конецесли;
	
	Обл.Параметры.Заполнить(Стр);
	
	ПолеОтчета.Вывести(Обл);
КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура СформироватьНеисправностиСтраница()
УстановитьСписокВыбораТехническаяНеисправность();
	
Запрос = Новый Запрос;

ЗапросТекст = "ВЫБРАТЬ
              |	УборкиНомеров.Комната КАК Ном,
              |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) КАК Дата,
              |	УборкиНомеров.Горничная КАК Горничная,
              |	УборкиНомеров.ТипУборки КАК тип,
              |	УборкиНомеров.Температура КАК темп,
              |	УборкиНомеров.КолВоГостей КАК КолВо,
              |	УборкиНомеров.Неисправности КАК Тех,
              |	УборкиНомеров.Ущерб КАК Ущерб,
              |	УборкиНомеров.Оборудование КАК Оборудование,
              |	УборкиНомеров.Минибар КАК Минибар,
              |	УборкиНомеров.Регистратор КАК Регистратор
              |ИЗ
              |	РегистрСведений.УборкиНомеров КАК УборкиНомеров
              |ГДЕ
              |	УборкиНомеров.ВремяУброки МЕЖДУ &ДН И &Дк
              |	И УборкиНомеров.Неисправности <> &Неисправности";

ЗапросТекстОкончание = "
                    |УПОРЯДОЧИТЬ ПО
                    |	УборкиНомеров.ВремяУброки,
                    |	Ном";
	
Если Отчет.Номер.Пустая() и (НЕ ЗначениеЗаполнено(Отчет.Этаж)) тогда
	
	//Запрос.Текст = ЗапросТекст + ЗапросТекстОкончание;
	
ИначеЕсли не  Отчет.Номер.Пустая() тогда
	
	Запрос.Текст = ЗапросТекст + "
		                    |	И УборкиНомеров.Комната = &Комната";
			
	Запрос.УстановитьПараметр("Комната",Отчет.Номер);
	
Иначе
	Запрос.Текст = ЗапросТекст + "
	                    |	И УборкиНомеров.Комната.Этаж = &Этаж";
	
	Запрос.УстановитьПараметр("Этаж",Отчет.Этаж);
КонецЕсли;

Если ЗначениеЗаполнено(ТехническаяНеисправность) Тогда 
	ЗапросТекст = ЗапросТекст + " И УборкиНомеров.Неисправности ПОДОБНО &НеисправностьОтбор";
	
	Запрос.УстановитьПараметр("НеисправностьОтбор", "%" + ТехническаяНеисправность + "%");
КонецЕсли;

Запрос.Текст = ЗапросТекст + ЗапросТекстОкончание;

Запрос.УстановитьПараметр("ДН",Отчет.ДатаС);
Запрос.УстановитьПараметр("Дк",КонецДня(Отчет.ДатаПо));
Запрос.УстановитьПараметр("Неисправности","");
ТЗ=Запрос.Выполнить().Выгрузить();

//Макет=ПолучитьМакет("МакетНеисправность");
//Макет = Отчеты.ОбщийОтчетПоГорничным.ПолучитьМакет("МакетНеисправность");
ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
Макет = ОтчетОбъект.ПолучитьМакет("МакетНеисправность");

Шапка=Макет.ПолучитьОбласть("Шапка");

ПолеОтчета.Очистить();

ПолеОтчета.Вывести(Шапка);

Для каждого Стр Из ТЗ Цикл
	Обл=Макет.ПолучитьОбласть("Строка");
	
	Обл.Параметры.Заполнить(Стр);
	
	Обл.Параметры.РасшифровкаДокумент = Стр.Регистратор;
	Обл.Параметры.РасшифровкаНеисправности = "РасшифровкаНеисправности";
	
	ПолеОтчета.Вывести(Обл);
КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура СформироватьУщербСтраница()
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	УборкиНомеров.Комната КАК Ном,
	|	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) КАК Дата,
	|	УборкиНомеров.Горничная КАК Горничная,
	|	УборкиНомеров.ТипУборки КАК тип,
	|	УборкиНомеров.Температура КАК темп,
	|	УборкиНомеров.КолВоГостей КАК КолВо,
	|	УборкиНомеров.Неисправности КАК Тех,
	|	УборкиНомеров.Ущерб,
	|	УборкиНомеров.Оборудование,
	|	УборкиНомеров.Минибар
	|ИЗ
	|	РегистрСведений.УборкиНомеров КАК УборкиНомеров
	|ГДЕ
	|	УборкиНомеров.ВремяУброки МЕЖДУ &ДН И &Дк
	|	И УборкиНомеров.Ущерб <> &Неисправности
	|
	|УПОРЯДОЧИТЬ ПО
	|	УборкиНомеров.ВремяУброки,
	|	Ном");
	
	Запрос.УстановитьПараметр("ДН",Отчет.ДатаС);
	Запрос.УстановитьПараметр("Дк",КонецДня(Отчет.ДатаПо));
	Запрос.УстановитьПараметр("Неисправности","");
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	//Макет=ПолучитьМакет("МакетУщерб");
	//Макет = Отчеты.ОбщийОтчетПоГорничным.ПолучитьМакет("МакетУщерб");
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("МакетУщерб");
	
	Шапка=Макет.ПолучитьОбласть("Шапка");
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();	
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Шапка);
	ПолеОтчета.Вывести(Шапка);
	
	Для каждого Стр Из ТЗ Цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		
		Обл.Параметры.Заполнить(Стр);
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СформироватьГорничныеСтраница()
//	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Горничные.Ссылка КАК Горничная
                      |ИЗ
                      |	Справочник.Горничные КАК Горничные
                      |ГДЕ
                      |	Горничные.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Горничные.Сортировка,
                      |	Горничные.Наименование");

ТЗ_Горничные = Запрос.Выполнить().Выгрузить();
//	

//	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеПомещения.Ссылка КАК Помещение
					  |ИЗ
                      |	Справочник.ГорничныеПомещения КАК ГорничныеПомещения
                      |ГДЕ
                      |	ГорничныеПомещения.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ГорничныеПомещения.Сортировка,
                      |	ГорничныеПомещения.Наименование");

ТЗ_Помещения = Запрос.Выполнить().Выгрузить();
//	


Запрос=Новый Запрос;
Запрос.Текст = ГорничныеЗарплата.ЗапросГорничныеДанные();

Запрос.УстановитьПараметр("ДН",Отчет.ДатаС);
Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДатаПо));

ТЗ_НомераУборки = Запрос.Выполнить().Выгрузить();

Запрос=Новый Запрос;
Запрос.Текст = ГорничныеЗарплата.ЗапросГорничныеПомещенияДанные();

Запрос.УстановитьПараметр("ДН",Отчет.ДатаС);
Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДатаПо));

ТЗ_ГорничныеПомещения = Запрос.Выполнить().Выгрузить();

//Макет = Отчеты.ОбщийОтчетПоГорничным.ПолучитьМакет("МакетГорничные");
ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
Макет = ОтчетОбъект.ПолучитьМакет("МакетГорничные");

ПолеОтчета.Очистить();

ШапкаЛево = Макет.ПолучитьОбласть("Шапка|Лево");
ПолеОтчета.Вывести(ШапкаЛево);
Для Каждого Строка Из ТЗ_Помещения Цикл
	ОбластьПомещение = Макет.ПолучитьОбласть("Шапка|Помещение");
	ОбластьПомещение.Параметры.Помещение = Строка.Помещение;
	
	ПолеОтчета.Присоединить(ОбластьПомещение);
КонецЦикла;
ШапкаПраво = Макет.ПолучитьОбласть("Шапка|Право");
ПолеОтчета.Присоединить(ШапкаПраво);

Для Каждого СтрокаГорничные Из ТЗ_Горничные Цикл
	ОтборСтроки = Новый Структура("Горничная", СтрокаГорничные.Горничная);
	СтрокиНомераУборки = ТЗ_НомераУборки.НайтиСтроки(ОтборСтроки);
	СтрокиГорничныеПомещения = ТЗ_ГорничныеПомещения.НайтиСтроки(ОтборСтроки);
	
	Если СтрокиНомераУборки.Количество() = 0 
	И СтрокиГорничныеПомещения.Количество() = 0 
	Тогда Продолжить; КонецЕсли;
	
	Обл=Макет.ПолучитьОбласть("Строка|Лево");
	Обл.Параметры.Горничная = СтрокаГорничные.Горничная;
	
	Если СтрокиНомераУборки.Количество() = 0 Тогда
	 	ПолеОтчета.Вывести(Обл);
	Иначе
		СтрокаНомераУборки = СтрокиНомераУборки[0];
		Обл.Параметры.Заполнить(СтрокаНомераУборки);
		
		ПолеОтчета.Вывести(Обл);
	КонецЕсли;
	
	Для Каждого СтрокаПомещения Из ТЗ_Помещения Цикл
		ОбластьПомещение = Макет.ПолучитьОбласть("Строка|Помещение");
		
		ОтборСтроки = Новый Структура("Горничная, Помещение", СтрокаГорничные.Горничная, СтрокаПомещения.Помещение);
		СтрокиГорничныеПомещения = ТЗ_ГорничныеПомещения.НайтиСтроки(ОтборСтроки);
		Если СтрокиГорничныеПомещения.Количество() > 0 Тогда 
			ОбластьПомещение.Параметры.ПомещениеКоличество = СтрокиГорничныеПомещения[0].Количество;
		КонецЕсли;
		
		ПолеОтчета.Присоединить(ОбластьПомещение);
	КонецЦикла;
	
	СтрокаПраво = Макет.ПолучитьОбласть("Строка|Право");
	ПолеОтчета.Присоединить(СтрокаПраво);
КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура СформироватьЗабытыеВещиСтраница()
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЗаявкаНаБронированиеЗабытыеВещи.Ссылка.РезервС КАК ДТ,
	|	ЗаявкаНаБронированиеЗабытыеВещи.ЗабытаяВещь КАК ЗабытыеВещи,
	|	ЗаявкаНаБронированиеЗабытыеВещи.Ссылка.Клиент.Наименование КАК ФИО,
	|	ЗаявкаНаБронированиеЗабытыеВещи.Ссылка.НомерВРезерв КАК Комната
	|ИЗ
	|	Документ.ЗаявкаНаБронирование.ЗабытыеВещи КАК ЗаявкаНаБронированиеЗабытыеВещи
	|ГДЕ
	|	ЗаявкаНаБронированиеЗабытыеВещи.Ссылка.РезервС >= &ВремяУброки
	|	И ЗаявкаНаБронированиеЗабытыеВещи.Отдана = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УборкиНомеров.ВремяУброки,
	|	УборкиНомеров.ЗабытыеВещи,
	|	УборкиНомеров.Гость.Наименование,
	|	УборкиНомеров.Комната
	|ИЗ
	|	РегистрСведений.УборкиНомеров КАК УборкиНомеров
	|ГДЕ
	|	УборкиНомеров.ВремяУброки >= &ВремяУброки
	|	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)
	|	И УборкиНомеров.ЗабытыеВещи <> """"");
	
	ЗапросФИО=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗанятостьНомеров.Клиент
	|ИЗ
	|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	|ГДЕ
	|	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &Дк
	|	И ЗанятостьНомеров.Номер = &Номер");
	
	Запрос.УстановитьПараметр("ВремяУброки", НачалоДня(ДобавитьМесяц(ТекущаяДата(),-6)));
	Запрос.УстановитьПараметр("КомментарийАдминистрации","%<Забытые вещи>%");
	
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	//Макет=ПолучитьМакет("МакетЗабытые");
	//Макет = Отчеты.ОбщийОтчетПоГорничным.ПолучитьМакет("МакетЗабытые");
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("МакетЗабытые");
	
	Шапка=Макет.ПолучитьОбласть("Шапка");
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Шапка);
	ПолеОтчета.Вывести(Шапка);
	
	Для каждого Стр Из ТЗ Цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		
		ЗапросФИО.УстановитьПараметр("ДН",НачалоДня(Стр.ДТ));
		ЗапросФИО.УстановитьПараметр("Дк",КонецДня(Стр.ДТ));
		ЗапросФИО.УстановитьПараметр("Номер",Стр.Комната);
		ТЗФИО=ЗапросФИО.Выполнить().Выгрузить();
		Стр.ФИО="";
		Для каждого СтрФ Из ТЗФИО Цикл
		
			Стр.ФИО = Стр.ФИО + СтрФ.Клиент.Наименование + ", ";	
		
		КонецЦикла; 
		
		Обл.Параметры.Заполнить(Стр);
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);
	КонецЦикла; 
	
КонецПроцедуры

////













