
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ЭтоКоворкинг", ЭтоКоворкинг);
Если ЭтоКоворкинг Тогда 
	ЭтаФорма.Заголовок = "КОВОРКИНГ";
КонецЕсли;	
	
Параметры.Свойство("КонтрагентыОтбор", КонтрагентыОтбор);
Если КонтрагентыОтбор.Количество() = 0 Тогда
	Элементы.КонтрагентДолг.ТолькоПросмотр = Ложь;
ИначеЕсли КонтрагентыОтбор.Количество() = 1 Тогда
	Элементы.КонтрагентДолг.ТолькоПросмотр = Истина;
	КонтрагентДолг = КонтрагентыОтбор[0].Значение;
Иначе
	//Отказ = Истина; Возврат;
	Элементы.КонтрагентДолг.Видимость = Ложь;
КонецЕсли;	

Параметры.Свойство("ДокументДолг", ДокументДолг);
Если ЗначениеЗаполнено(ДокументДолг) Тогда
	Элементы.ДокументДолг.ТолькоПросмотр = Истина;
КонецЕсли;

Параметры.Свойство("ДокументОплаты", ДокументОплаты);
Если ЗначениеЗаполнено(ДокументОплаты) Тогда
	Элементы.КонтрагентДолг.ТолькоПросмотр = Истина;
	Элементы.ДокументДолг.ТолькоПросмотр = Истина;
	Элементы.ДокументОплаты.ТолькоПросмотр = Истина;
КонецЕсли;

Элементы.ВозвратПолныйЧастичный.СписокВыбора.Добавить("Полный");
Элементы.ВозвратПолныйЧастичный.СписокВыбора.Добавить("Частичный");
ВозвратПолныйЧастичный = "";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если ЗначениеЗаполнено(ДокументОплаты) Тогда
	ЗаполнениеДанныхФормы(ДокументОплаты);	
КонецЕсли;
КонецПроцедуры
//

&НаКлиенте
Процедура Отмена(Команда)
Закрыть();
КонецПроцедуры

//
&НаКлиенте
Процедура КонтрагентДолгПриИзменении(Элемент)
КонтрагентДолгПриИзмененииДействие();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентДолгПриИзмененииДействие()
ПозицииЧекаККМ.Очистить();

КонтрагентыОтбор.Очистить();
Если ЗначениеЗаполнено(КонтрагентДолг) Тогда 
	КонтрагентыОтбор.Добавить(КонтрагентДолг);
КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентДолгНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ПараметрыФормы = Новый Структура();

ОткрытьФорму("ОбщаяФорма.ЧекВозвратВыборКлиента", , Элементы.КонтрагентДолг
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентДолгОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

КонтрагентДолг = ВыбранноеЗначение;

КонтрагентДолгПриИзмененииДействие();
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДокументДолгПриИзменении(Элемент)
ДокументДолгПриИзмененииДействие();
КонецПроцедуры

&НаКлиенте
Процедура ДокументДолгПриИзмененииДействие()
ПозицииЧекаККМ.Очистить();

ДокументОплаты = Неопределено;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументДолгНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ПараметрыФормы = Новый Структура();
ПараметрыФормы = Новый Структура("КонтрагентыОтбор", КонтрагентыОтбор);

ОткрытьФорму("ОбщаяФорма.ЧекВозвратВыборДокументДолг", ПараметрыФормы, Элементы.ДокументДолг
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДокументДолгОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ДокументДолг = ВыбранноеЗначение.ДокументДолг;

ДокументДолгПриИзмененииДействие();
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДокументОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ВыбратьДокументОплаты(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокументОплаты(Команда)
ПозицииЧекаККМ.Очистить();
		
ПараметрыФормы = Новый Структура(); 

ПараметрыФормы.Вставить("КонтрагентыОтбор", КонтрагентыОтбор); 
ПараметрыФормы.Вставить("ДокументДолг", ДокументДолг); 

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_КассовыйДокументФормаВыбораВозврат", ЭтаФорма);
ОткрытьФорму("ОбщаяФорма.ЧекВозвратВыборДокументОплаты", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_КассовыйДокументФормаВыбораВозврат(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда	Возврат; КонецЕсли;

ДокументОплаты = Результат.ДокументОплаты;

ЗаполнениеДанныхФормы(ДокументОплаты);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеДанныхФормы(ДокументОплаты) Экспорт
ЗаполнениеДанныхФормыСервер(ДокументОплаты);

Если СуммаОстатокКарта > 0  тогда
	
	Если СуммаОстатокНаличные > 0 Тогда 
		Текст = "ВНИМАНИЕ! Была смешанная оплата. Остаток по карте на сумму: " + СуммаОстатокКарта + " руб." 
	   		+ " Остаток наличными: " + СуммаОстатокНаличные + " руб.";
	Иначе
		Текст = "ВНИМАНИЕ! Была оплата по кредитной карте. Остаток по карте на сумму: " + СуммаОстатокКарта + " руб.";
	КонецЕсли;
	
	ПоказатьПредупреждение(, Текст);
	Сообщить(Текст);
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеДанныхФормыСервер(ДокументОплаты) Экспорт
ЗапросТекст = ОплатыОбщееСервер.ЗапросТекстВозврат();	
Запрос = Новый Запрос(ЗапросТекст);
Запрос.УстановитьПараметр("КонтрагентыОтбор", КонтрагентыОтбор);
Запрос.УстановитьПараметр("ДокументДолг", ДокументДолг);
Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
//Запрос.УстановитьПараметр("Все", Истина);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Возврат; КонецЕСли;

Результат = ТЗ[0];
//ДокументОплаты = Результат.ДокументОплаты;

СуммаДокументаОплаты = Результат.СуммаДокументаОплаты;
СуммаДокументаОплатыКарта = Результат.СуммаКарта;
СуммаДокументаОплатыНаличные = Результат.СуммаНаличные;

СуммаПредыдущихВозвратов = Результат.СуммаВозврат;
СуммаПредыдущихВозвратовКарта = Результат.СуммаВозвратКарта;
СуммаПредыдущихВозвратовНаличные = Результат.СуммаВозвратНаличные;

СуммаОстаток = Результат.ОстатокДокументаОплаты;
СуммаОстатокКарта = Результат.ОстатокКарта;
СуммаОстатокНаличные = Результат.ОстатокНаличные;

//СуммаОстатокОплаты = Результат.СуммаОстатокОплаты;
СуммаОплачено = Результат.СуммаОплачено;

КонецПроцедуры
//

////
&НаСервереБезКонтекста
Функция КлиентНаименование_НеИспользуется(ДокументДолг) 
Если ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	КлиентНаименование = ДокументДолг.Клиент.Наименование;	
Иначе 
	КлиентНаименование = ДокументДолг.Контрагент.Наименование;	
КонецЕсли;		
Возврат КлиентНаименование	
КонецФункции 
//

//
&НаКлиенте
Процедура ВозвратПолныйЧастичныйПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(ДокументОплаты)  
Тогда ВозвратПолныйЧастичный = ""; Возврат; КонецЕсли;	
	
Если ВозвратПолныйЧастичный = "Полный" Тогда	
	СуммаВозврата = СуммаОстаток; 	
	СуммаВозвратаКарта = СуммаОстатокКарта; 	
	СуммаВозвратаНаличные = СуммаОстатокНаличные; 
	
	Элементы.СуммаВозврата.ТолькоПросмотр = Истина; 	
	Элементы.СуммаВозвратаКарта.ТолькоПросмотр = Истина; 	
	Элементы.СуммаВозвратаНаличные.ТолькоПросмотр = Истина; 
Иначе
	СуммаВозврата = 0; 	
	СуммаВозвратаКарта = 0; 	
	СуммаВозвратаНаличные = 0; 
	
	Элементы.СуммаВозврата.ТолькоПросмотр = Ложь; 	
	Элементы.СуммаВозвратаКарта.ТолькоПросмотр = (СуммаОстатокКарта <= 0); 	
	Элементы.СуммаВозвратаНаличные.ТолькоПросмотр = (СуммаОстатокНаличные <=0);	
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СуммаВозвратаПриИзменении(Элемент)
Если СуммаВозврата > СуммаОстаток Тогда
	Показатьпредупреждение(,"Сумма возврата > суммы остатка по карте");
	
	СуммаВозврата = 0;
	СуммаВозвратаКарта = 0;
	СуммаВозвратаНаличные = 0;
	Возврат;	
КонецЕсли;

Если ЗначениеЗаполнено(ДокументДолг) Тогда
	Если СуммаВозврата > СуммаОплачено Тогда
		Показатьпредупреждение(,"Сумма возврата > суммы оплачено");
		
		СуммаВозвратаКарта = 0;
		Возврат;	
	КонецЕсли;
КонецЕсли;

Если СуммаОстатокКарта = 0 Тогда СуммаВозвратаНаличные = СуммаВозврата; КонецЕсли; 
Если СуммаОстатокНаличные = 0 Тогда СуммаВозвратаКарта = СуммаВозврата; КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура СуммаВозвратаКартаПриИзменении(Элемент)
Если СуммаОстатокКарта < СуммаВозвратаКарта Тогда
	Показатьпредупреждение(,"Сумма возврата по карте > остатка по карте");
	
	СуммаВозвратаКарта = 0;
	Возврат;	
КонецЕсли;
	
СуммаВозвратаНаличные = СуммаВозврата - СуммаВозвратаКарта; 
КонецПроцедуры

&НаКлиенте
Процедура СуммаВозвратаНаличныеПриИзменении(Элемент)
Если СуммаОстатокНаличные < СуммаВозвратаНаличные Тогда
	Показатьпредупреждение(,"Сумма возврата наличными > остатка наличными");
	
	СуммаВозвратаНаличные = 0;
	Возврат;	
КонецЕсли;	
СуммаВозвратаКарта = СуммаВозврата - СуммаВозвратаНаличные; 	
КонецПроцедуры
//

//// + Кассовый Чек
&НаКлиенте
Процедура КассовыйЧек(Команда)
Если ПроверкаДанных() Тогда Возврат; КонецЕсли;

Вопрос_БудетОтбитВозвратНаСумму();
КонецПроцедуры

&НаКлиенте
Функция ПроверкаДанных()
Если ВозвратПолныйЧастичный <> "Полный" И ВозвратПолныйЧастичный <> "Частичный"	Тогда
	ПоказатьПредупреждение(, "Выберите возврат полный / частичный ...");  
			
	Возврат Истина;	
КонецЕсли;	
	
ТекстПредупреждения_П = "";
	
Если СуммаВозврата <= 0 Тогда
	ТекстПредупреждения_П = "Сумма возврата меньше либо равна 0";
КонецЕсли;

Если СуммаВозвратаКарта + СуммаВозвратаНаличные <> СуммаВозврата Тогда
	ТекстПредупреждения_П = ТекстПредупреждения_П + "Сумма возврата <> Сумма возврата по карте + Сумма возврата наличные";
КонецЕсли;

Если ТекстПредупреждения_П <> "" Тогда
	ПоказатьПредупреждение(, ТекстПредупреждения_П);
	
	Возврат Истина;     
КонецЕсли;

Возврат Ложь;     
КонецФункции

&НаКлиенте
Процедура Вопрос_БудетОтбитВозвратНаСумму() 
Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_БудетОтбитВозвратНаСумму", ЭтаФорма);
Текст = "Будет отбит возврат на сумму " + Строка(СуммаВозврата)
		+ Символы.ПС + "Карта; " + СуммаВозвратаКарта + ", наличные: " + СуммаВозвратаНаличные 
		+ Символы.ПС + Символы.ПС + "ПРОДОЛЖИТЬ ?";
ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ОКОтмена);  
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_БудетОтбитВозвратНаСумму(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.ОК Тогда
	
	Если СуммаВозвратаКарта > 0 ИЛИ СуммаВозвратаНаличные > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ДокОсн", ДокументОплаты);
		
		ВыполнитьОперацию_ФУ(ДопПараметры);	
	иначе
		ПоказатьПредупреждение(, "Сумма возврата = 0." + Символы.ПС + Символы.ПС + "ЧЕК ОТМЕНЁН");
		
		Возврат;
	конецесли;
	
иначе
	Возврат;
конецесли;
Конецпроцедуры


&НаКлиенте
Процедура ВыполнитьОперацию_ФУ(ДопПараметры)
	ПоддерживаемыеТипыВО = Новый Массив();
	//ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
	//ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	
	ДопПараметры.Вставить("ЭтоКоворкинг", ЭтоКоворкинг); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюВыбораУстройства_ФУ", ЭтотОбъект, ДопПараметры); 
	МенеджерОборудованияКлиент.ВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
		НСтр("ru='Выберите фискальное устройство'"), 
		НСтр("ru='Фискальное устройство не подключено.'"), 
		НСтр("ru='Фискальное устройство не выбрано.'"));
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюВыбораУстройства_ФУ(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
Если НЕ РезультатВыбора.Результат Тогда
	ТекстПредупреждения = ТекстПредупреждения + "Ошибка выбора ККМ."; 
	ТекстСообщения = ТекстСообщения + "Ошибка выбора ККМ: " + РезультатВыбора.ОписаниеОшибки; 
	
	ОшибкаОперации = Истина;
	
	ЗавершитьОтбитиеВозвратЧека(Неопределено);
	
	Возврат;
КонецЕсли;   

ДополнительныеПараметры.Вставить("РезультатВыбора", РезультатВыбора); 

Если СуммаВозвратаНаличные > 0 Тогда
	ЭтоТекущаяСменаДокументОплаты = ЭтоТекущаяСменаДокументОплаты(РезультатВыбора.ИдентификаторУстройства);
	Если ЭтоТекущаяСменаДокументОплаты = -100 Тогда
		ТекстПредупреждения = ТекстПредупреждения + "При пробитии чек произошла ошибка. Кассовая смена не открыта или истекла. *"; 
		ТекстСообщения = ТекстСообщения + "При пробитии чек произошла ошибка. Кассовая смена не открыта или истекла. *" + РезультатВыбора.ОписаниеОшибки; 
		
		ОшибкаОперации = Истина;
		
		ЗавершитьОтбитиеВозвратЧека(Неопределено);
		
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЭтоТекущаяСменаДокументОплаты Тогда
		 ИнкассацияНаФискальномУстройстве(ДополнительныеПараметры);

		 Возврат;
	КонецЕсли;	
КонецЕсли;	

ВыполнитьОперациюВыводЧека_ФУ(ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Функция ЭтоТекущаяСменаДокументОплаты(ИдентификаторУстройства)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КассоваяСмена.Ссылка КАК Ссылка,
	                      |	КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ
	                      |ИЗ
	                      |	Документ.КассоваяСмена КАК КассоваяСмена
	                      |ГДЕ
	                      |	КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	                      |	И КассоваяСмена.ФискальноеУстройство = &ФискальноеУстройство
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КассоваяСмена.НачалоКассовойСмены УБЫВ");
	
	Запрос.УстановитьПараметр("ФискальноеУстройство", ИдентификаторУстройства);  
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 0 Тогда Возврат -100; КонецЕсли;
	
	ПоследняяКассоваяСмена = ТЗ[0]; 
	
	Если НЕ КассовыеСменыВызовСервера.СменаАктивна(ПоследняяКассоваяСмена.Ссылка) 
	Тогда Возврат -100; КонецЕсли;
	
	НомерПоследнейОткрытойСмены = ПоследняяКассоваяСмена.НомерСменыККТ;
	
	ЭтоТекущаяСменаДокументОплаты = (ДокументОплаты.НомерСменыККМ = НомерПоследнейОткрытойСмены);
	
	Возврат ЭтоТекущаяСменаДокументОплаты;
КонецФункции

&НаКлиенте
Процедура ИнкассацияНаФискальномУстройстве(ДополнительныеПараметры)
    
    ЭтаФорма.Доступность = Ложь; // При необходимости можно заблокировать интерфейс пользователя.
    
    ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыИнкассации();
    ПараметрыОперации.ТипИнкассации = 1; //  Тип операции (0 - Выемка / 1 - Внесение)
    ПараметрыОперации.Сумма = СуммаВозвратаНаличные; // Сумма внесения/выемки
    
 	РезультатВыбора = ДополнительныеПараметры.РезультатВыбора;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ИнкассацияНаФискальномУстройствеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
    ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьИнкассациюНаФискальномУстройстве(
        ОповещениеПриЗавершении, УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ПараметрыОперации);
    
КонецПроцедуры

&НаКлиенте
Процедура ИнкассацияНаФискальномУстройствеЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
    
    ЭтаФорма.Доступность = Истина; // При необходимости разблокируем интерфейс пользователя.
    
    Если НЕ РезультатВыполнения.Результат Тогда
		//ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:""%ОписаниеОшибки%"".'");
		//ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		//Сообщить(ТекстСообщения);
		
		ТекстПредупреждения = ТекстПредупреждения + "Ошибка инкасации ККМ."; 
		ТекстСообщения = ТекстСообщения + "Ошибка инкасации ККМ: " + РезультатВыполнения.ОписаниеОшибки; 
		
		ОшибкаОперации = Истина;
		
		ЗавершитьОтбитиеВозвратЧека(Неопределено);
		
		Возврат;
	КонецЕсли;
		
	ВыполнитьОперациюВыводЧека_ФУ(ДополнительныеПараметры);	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюВыводЧека_ФУ(ДополнительныеПараметры) Экспорт        
	
	ЭтаФорма.Доступность = Ложь;
	
	ЗаполнитьПозицииЧека();
	
	СуммаБезналЧекККМ = СуммаВозвратаКарта;
	СуммаНалЧекККМ = СуммаВозвратаНаличные;
	
	ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");
	СуммаПредыдущихОплат = 0;
	
	ЭтоАванс = Ложь;
	
	РезультатВыбора = ДополнительныеПараметры.РезультатВыбора;
	
	ОбщиеПараметры = ФУ_Клиент.ПолучитьШаблонЧека(
		ТипРасчета, СуммаБезналЧекККМ, СуммаНалЧекККМ, СуммаПредыдущихОплат, ЭтоАванс, ПозицииЧекаККМ
		, ЭтоКоворкинг);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПечатьЧекаЗавершение_ФУ", ЭтотОбъект, ДополнительныеПараметры);
    ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(
    	ОповещениеПриЗавершении, УникальныйИдентификатор, РезультатВыбора.ИдентификаторУстройства, ОбщиеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПозицииЧека() Экспорт
ПозицииЧекаККМ.Очистить();

СуммаДляПечати=СуммаВозврата;

НовЗапч = ПозицииЧекаККМ.Добавить();

НовЗапч.Наименование="Возврат оплаты";
	
НовЗапч.Количество=1;

Если ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	КолВоДней = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(ДокументДолг, "КолВоДней");
Иначе
	КолВоДней = 0;
КонецЕсли;	
НовЗапч.Цена=?(КолВоДней=0, 0, Окр(СуммаДляПечати, 2));

НовЗапч.Скидка=0;
НовЗапч.Сумма=СуммаДляПечати;

НовЗапч.СтавкаНДС = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекаЗавершение_ФУ(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
ЭтаФорма.Доступность = Истина; // При необходимости разблокируем интерфейс пользователя.

Если НЕ РезультатВыполнения.Результат Тогда
	ТекстПредупреждения = ТекстПредупреждения + "При пробитии кассового чека произошла ошибка";
	
	Если СтрНайти(РезультатВыполнения.ОписаниеОшибки, "смена") > 0 Тогда
		ТекстПредупреждения = ТекстПредупреждения + ": "
		 	+ Символы.ПС + РезультатВыполнения.ОписаниеОшибки;
	Иначе		
		ТекстПредупреждения = ТекстПредупреждения + ". ";
	КонецЕсли;
	
	ТекстСообщения = ТекстСообщения + "При пробитии кассового чека произошла ошибка: " + РезультатВыполнения.ОписаниеОшибки;
	
	ОшибкаОперации = Истина;
	
	ФУ_Сервер.ЗаписатьОшибкуКММ(ТекстСообщения);
Иначе
	//Получить номер чека и номер смены.
	//НомерСменыККМ = РезультатВыполнения.ВыходныеПараметры[0];
	//НомерЧекаККМ  = РезультатВыполнения.ВыходныеПараметры[1];
    НомерСменыККМ = РезультатВыполнения.НомерСменыККТ;
    НомерЧекаККМ  = РезультатВыполнения.НомерЧекаККТ;

	ДополнительныеПараметры.Вставить("НомерСменыККМ", НомерСменыККМ);
	ДополнительныеПараметры.Вставить("НомерЧекаККМ", НомерЧекаККМ);
	
	ТекстПредупреждения = ТекстПредупреждения + "Пробитие кассового чека выполнено успешно.";
	ТекстСообщения = ТекстСообщения + "Пробитие кассового чека выполнено успешно.";

	ОшибкаОперации = Ложь;	
КонецЕсли;

ЗавершитьОтбитиеВозвратЧека(ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Функция КассовыйДокументСоздатьДокументВозврат(СуммаНалЧекККМ, СуммаБезналЧекККМ, ДополнительныеПараметры)
ДокКасс=Документы.КассовыйДокумент.СоздатьДокумент();
ДокКасс.Дата=ТекущаяДата();
ДокКасс.ДатаОплаты=ТекущаяДата();

ДокКасс.Возврат = Истина;

Оплачивает = ДополнительныеПараметры.ДокОсн.ОтКого;
ДокКасс.ОтКого = Оплачивает;

ВозвратДокумент = ДополнительныеПараметры.ДокОсн; 
ДокКасс.ВозвратДокумент = ВозвратДокумент;

ДокКасс.Приход=Ложь;

//ДокКасс.КредитнаяКарта=КредитнаяКарта;
//
//ДокКасс.Сумма = СуммаНалЧекККМ + СуммаБезналЧекККМ;
//Если КредитнаяКарта Тогда 
//	ДокКасс.СуммаКарта = ДокКасс.Сумма;			
//Иначе
//	ДокКасс.СуммаНаличные = ДокКасс.Сумма;			
//КонецЕсли;	

ДокКасс.КредитнаяКарта = (СуммаБезналЧекККМ > 0);
ДокКасс.Наличные = (СуммаНалЧекККМ > 0);

ДокКасс.Сумма = СуммаНалЧекККМ + СуммаБезналЧекККМ;
ДокКасс.СуммаКарта = СуммаБезналЧекККМ;			
ДокКасс.СуммаНаличные = СуммаНалЧекККМ;			

ДокКасс.НомерСменыККМ 	= ДополнительныеПараметры.НомерСменыККМ;
ДокКасс.НомерЧекаККМ 	= ДополнительныеПараметры.НомерЧекаККМ;

ДокКасс.ГУИД_ЭТ 	= ДополнительныеПараметры.ГУИД_ЭТ;

ДокКасс.ДокументДолг=ДокументДолг;
//ДокКасс.ВидОперации=Справочники.ВидыОпераций.Проживание;
ДокКасс.ВидОперации=Справочники.ВидыОпераций.Возврат;

ДокКасс.Примечание="Возврат по чеку";

ДокКасс.Записать(РежимЗаписиДокумента.Проведение);
Возврат ДокКасс.Ссылка; 
КонецФункции

&НаКлиенте
Процедура ЗавершитьОтбитиеВозвратЧека(ДополнительныеПараметры)
Если НЕ ОшибкаОперации Тогда 
	Если ЗначениеЗаполнено(ГУИД_ЭТ) Тогда
		ЭТСервер.ЗаписатьВЭТКассовыйЧекКММ(ГУИД_ЭТ);
	КонецЕсли;
	
	СуммаБезналЧекККМ = СуммаВозвратаКарта;
	СуммаНалЧекККМ = СуммаВозвратаНаличные;
	
	ДополнительныеПараметры.Вставить("ГУИД_ЭТ", ГУИД_ЭТ);
	
	ДокументВозврат = КассовыйДокументСоздатьДокументВозврат(СуммаНалЧекККМ, СуммаБезналЧекККМ, ДополнительныеПараметры);  
	
	Если ЗначениеЗаполнено(ДокументДолг) Тогда
		Если ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
			ЗаявкаСервер.УменьшитьОплатыЗаявкаСуммаВозврата(ДокументОплаты, ДокументДолг, СуммаВозврата, ДокументВозврат);
		ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
			ГрупповойСчетСервер.УменьшитьОплатыГрупповойСчетСуммаВозврата(ДокументОплаты, ДокументДолг);
		ИначеЕсли ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.КоворкингСчета") Тогда
			КоворкингСервер.УменьшитьОплатыКоворкингСчетаСуммаВозврата(ДокументОплаты, ДокументДолг, СуммаВозврата);
		КонецЕсли;	
	КонецЕсли;	
КонецЕсли;	

ДопПараметры = Новый Структура;
ДопПараметры.Вставить("ОшибкаОперации", ОшибкаОперации);
ДопПараметры.Вставить("ОшибкаЭТ", ОшибкаЭТ);

ДопПараметры.Вставить("ТекстПредупреждения", ТекстПредупреждения);
ДопПараметры.Вставить("ТекстСообщения", ТекстСообщения);

Закрыть(ДопПараметры);
КонецПроцедуры	
//// - Кассовый Чек

//// + ЭТ Отмена Возврат 
&НаКлиенте
Процедура ОтменаПлатежаПоКарте(Команда)
Если СуммаВозвратаКарта = 0 тогда Возврат; КонецЕсли;
Если ПроверкаДанных() Тогда Возврат; КонецЕсли;

ТипТранзакции = "AuthorizeVoid";
Если ЗначениеЗаполнено(ДокументДолг) Тогда
	ПредупреждениеЕстьТакиеПлатежи(ТипТранзакции);
	
	Возврат;
КонецЕсли;

ВозвратОтменаОплатаКартаВыполнить(ТипТранзакции);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратПлатежаПоКарте(Команда)
Если СуммаВозвратаКарта = 0 тогда Возврат; КонецЕсли;
Если ПроверкаДанных() Тогда Возврат; КонецЕсли;

ТипТранзакции = "AuthorizeRefund";
Если ЗначениеЗаполнено(ДокументДолг) Тогда
	ПредупреждениеЕстьТакиеПлатежи(ТипТранзакции);
	
	Возврат;
КонецЕсли;

ВозвратОтменаОплатаКартаВыполнить(ТипТранзакции);
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеЕстьТакиеПлатежи(ТипТранзакции)
Ответ = ПолучитьПараметрыЧекаВозвратЗапрос(ДокументДолг, СуммаВозвратаКарта); 	

ЕстьТакиеПлатежи = Ложь;
Если ТипЗнч(Ответ) = Тип("Структура") Тогда
	ЕстьТакиеПлатежи = Истина;
Иначе
	ЕстьТакиеПлатежи = (Ответ = "+"); 
КонецЕсли;

Если ЕстьТакиеПлатежи Тогда
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТипТранзакции", ТипТранзакции);
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_ЕстьПлатежиПоЗаявке", ЭтаФорма, ДопПараметры);
	
	ПоказатьВопрос(Оповещение, "ВНИМАНИЕ: Есть возвраты по заявке на сумму: " + СуммаВозвратаКарта + "
		|
		|ПРОДОЛЖИТЬ ?"
		, РежимДиалогаВопрос.ОКОтмена);
	Возврат;
КонецЕсли;

ВозвратОтменаОплатаКартаВыполнить(ТипТранзакции);
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыЧекаВозвратЗапрос(ДокументДолг, СуммаОперации) 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ОперацииЭТ.СсылочныйНомер КАК СсылочныйНомер,
                      |	ОперацииЭТ.СуммаОперации КАК СуммаОперации,
                      |	ЕСТЬNULL(Возвраты.СуммаВозврата, 0) КАК СуммаВозврата
                      |ИЗ
                      |	РегистрСведений.ОперацииЭТ КАК ОперацииЭТ
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ОперацииЭТ.СсылочныйНомерВозврат КАК СсылочныйНомерВозврат,
                      |			СУММА(ОперацииЭТ.СуммаОперации) КАК СуммаВозврата
                      |		ИЗ
                      |			РегистрСведений.ОперацииЭТ КАК ОперацииЭТ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ОперацииЭТ.СсылочныйНомерВозврат) КАК Возвраты
                      |		ПО ОперацииЭТ.СсылочныйНомер = Возвраты.СсылочныйНомерВозврат
                      |ГДЕ
                      |	(ОперацииЭТ.ТипТранзакции = ""AuthorizeRefund""
                      |			ИЛИ ОперацииЭТ.ТипТранзакции = ""AuthorizeVoid"")
                      |	И ОперацииЭТ.ДокументДолг = &ДокументДолг
                      |	И ОперацииЭТ.СуммаОперации = &СуммаОперации");

Запрос.УстановитьПараметр("ДокументДолг", ДокументДолг);
Запрос.УстановитьПараметр("СуммаОперации", СуммаОперации);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	Возврат "-";
ИначеЕсли ТЗ.Количество() > 1 Тогда
	Возврат "+";
Иначе
	СсылочныйНомер = ТЗ[0].СсылочныйНомер;
	Остаток = ТЗ[0].СуммаОперации - ТЗ[0].СуммаВозврата; 
	Результат = Новый Структура("СсылочныйНомер, Остаток", СсылочныйНомер, Остаток); 
	
	Возврат Результат; 
КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗавершениеВопроса_ЕстьПлатежиПоЗаявке(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ТипТранзакции = ДополнительныеПараметры.ТипТранзакции;
ВозвратОтменаОплатаКартаВыполнить(ТипТранзакции);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратОтменаОплатаКартаВыполнить(ТипТранзакции)
ГУИД_ЭТ_Оплата = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ДокументОплаты, "ГУИД_ЭТ");
Если ЗначениеЗаполнено(ГУИД_ЭТ_Оплата) Тогда	
	//Результат = ПолучитьПараметрыЧекаПоСсылочныйНомер(ГУИД_ЭТ_Оплата);
	Результат = ПолучитьПараметрыЭквайринговойОплаты(ГУИД_ЭТ_Оплата, 0);

ИначеЕсли ЗначениеЗаполнено(ДокументДолг) Тогда	
	//Результат = ПолучитьПараметрыЧекаЗапрос(ДокументДолг, СуммаДокументаОплатыКарта);
	Результат = ПолучитьПараметрыЭквайринговойОплаты(ДокументДолг, СуммаДокументаОплатыКарта);
КонецЕсли;

Если ТипЗнч(Результат) = Тип("Структура") Тогда 
	Если ПроверитьОстатокЭквайринговойОплатыПредупреждение(Результат.Остаток) Тогда
		
		Возврат;
	Иначе
		ПоказатьВопросБудетПроизведенаОтменаВозвратОплаты(ТипТранзакции, Результат.СсылочныйНомер, Результат.НомерЧекаЭТ);		
		
		Возврат;
	КонецЕсли;	
КонецЕсли;	

ДопПараметры = Новый Структура;
ДопПараметры.Вставить("ТипТранзакции", ТипТранзакции);

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ЕстьДокументДолг", Истина); 
ПараметрыФормы.Вставить("ДокументДолг", ДокументДолг); 
ПараметрыФормы.Вставить("СуммаОперации", СуммаДокументаОплатыКарта); 

Если ТипТранзакции = "AuthorizeRefund" Тогда
	ТолькоБезКассовогоЧека = Ложь;
Иначе
	ТолькоБезКассовогоЧека = Истина;
КонецЕсли;
ПараметрыФормы.Вставить("ТолькоБезКассовогоЧека", ТолькоБезКассовогоЧека); 

Оповещение = Новый ОписаниеОповещения("Завершение_ФормаВыбораЭТ", ЭтаФорма, ДопПараметры);
ОткрытьФорму("РегистрСведений.ОперацииЭТ.Форма.ФормаВыбораЭТ", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыЭквайринговойОплаты(ЗначениеОтбора, СуммаОперации) 
Запрос = Новый Запрос;
ТекстЗапроса ="ВЫБРАТЬ
              |	ОперацииЭТ.СсылочныйНомер КАК СсылочныйНомер,
              |	ОперацииЭТ.НомерЧекаЭТ КАК НомерЧекаЭТ,
              |	ОперацииЭТ.СуммаОперации КАК СуммаОперации,
              |	ЕСТЬNULL(Возвраты.СуммаВозврата, 0) КАК СуммаВозврата
              |ИЗ
              |	РегистрСведений.ОперацииЭТ КАК ОперацииЭТ
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ОперацииЭТ.СсылочныйНомерВозврат КАК СсылочныйНомерВозврат,
              |			СУММА(ОперацииЭТ.СуммаОперации) КАК СуммаВозврата
              |		ИЗ
              |			РегистрСведений.ОперацииЭТ КАК ОперацииЭТ
              |		ГДЕ
              |			ЕСТЬNULL(ОперацииЭТ.СсылочныйНомерВозврат, """") <> """"
              |		
              |		СГРУППИРОВАТЬ ПО
              |			ОперацииЭТ.СсылочныйНомерВозврат) КАК Возвраты
              |		ПО ОперацииЭТ.СсылочныйНомер = Возвраты.СсылочныйНомерВозврат
              |ГДЕ
              |	ОперацииЭТ.ТипТранзакции = ""AuthorizeSales""";

Если ТипЗнч(ЗначениеОтбора) = Тип("УникальныйИдентификатор") Тогда
	ТекстЗапроса = ТекстЗапроса + "
					| И ОперацииЭТ.ГУИД = &ГУИД";
	Запрос.УстановитьПараметр("ГУИД", ЗначениеОтбора);
Иначе
	ТекстЗапроса = ТекстЗапроса + "
                      |	И ОперацииЭТ.ДокументДолг = &ДокументДолг
                      |	И ОперацииЭТ.СуммаОперации = &СуммаОперации";
	Запрос.УстановитьПараметр("ДокументДолг", ЗначениеОтбора);
	Запрос.УстановитьПараметр("СуммаОперации", СуммаОперации);
КонецЕсли;
	
Запрос.Текст = ТекстЗапроса; 	

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	Возврат "-";
ИначеЕсли ТЗ.Количество() > 1 Тогда
	Возврат "+";
Иначе
	СсылочныйНомер = ТЗ[0].СсылочныйНомер;
	НомерЧекаЭТ = ТЗ[0].НомерЧекаЭТ;
	Остаток = ТЗ[0].СуммаОперации - ТЗ[0].СуммаВозврата; 
	Результат = Новый Структура("СсылочныйНомер, НомерЧекаЭТ, Остаток", СсылочныйНомер, НомерЧекаЭТ, Остаток); 
	
	Возврат Результат; 
КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПроверитьОстатокЭквайринговойОплатыПредупреждение(ОстатокОплаты)
Если ОстатокОплаты < СуммаВозвратаКарта Тогда
	ТекстПредупреждения = "Остаток эквайринговой оплаты: " + ОстатокОплаты + " МЕНЬШЕ суммы отмены: " + СуммаВозвратаКарта + "
		|
		|ОТМЕНА/ВОЗВРАТ ОПЛАТЫ ЧЕРЕЗ ЭКВАЙРИНГОВЫЙ ТЕРМИНАЛ ОТМЕНЯЕТСЯ ...";
	ПоказатьПредупреждение(, ТекстПредупреждения);   
	
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции
	
&НаКлиенте
Процедура ПоказатьВопросБудетПроизведенаОтменаВозвратОплаты(ТипТранзакции, СсылочныйНомер, НомерЧекаЭТ)
ДопПараметры = Новый Структура;
ДопПараметры.Вставить("ТипТранзакции", ТипТранзакции );
ДопПараметры.Вставить("СсылочныйНомер", СсылочныйНомер);
ДопПараметры.Вставить("НомерЧекаЭТ", НомерЧекаЭТ);

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_БудетПроизведенаОтменаВозвратОплаты", ЭтаФорма, ДопПараметры);

Если ТипТранзакции = "AuthorizeVoid" Тогда
	Текст = "произведена ОТМЕНА оплаты"
ИначеЕсли ТипТранзакции = "AuthorizeRefund" Тогда
	Текст = "произведен ВОЗВРАТ оплаты"
Иначе 
	Возврат;
КонецЕсли;
ТекстВопроса = "Будет " + Текст + " через эквайринговый терминал на сумму: " + СуммаВозвратаКарта + "
	|
	|ПРОДОЛЖИТЬ ?";

ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

&НаКлиенте
Процедура Завершение_ФормаВыбораЭТ(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;	

Ответ = ПолучитьПараметрыЭквайринговойОплатыПоКлючуЗаписи(Результат);
Если ПроверитьОстатокЭквайринговойОплатыПредупреждение(Ответ.Остаток) Тогда Возврат; КонецЕсли;

ТипТранзакции = ДополнительныеПараметры.ТипТранзакции;
ПоказатьВопросБудетПроизведенаОтменаВозвратОплаты(ТипТранзакции, Ответ.СсылочныйНомер, Ответ.НомерЧекаЭТ)
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыЭквайринговойОплатыПоКлючуЗаписи(КлючЗаписи) 
Запись = регистрыСведений.ОперацииЭТ.СоздатьМенеджерЗаписи();
ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);     
Запись.Прочитать(); 

НомерКарты = Запись.НомерКарты; 

СсылочныйНомер = Запись.СсылочныйНомер; 
НомерЧекаЭТ = Запись.НомерЧекаЭТ; 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	СУММА(ОперацииЭТ.СуммаОперации) КАК СуммаОперации
                      |ИЗ
                      |	РегистрСведений.ОперацииЭТ КАК ОперацииЭТ
                      |ГДЕ
                      |	ОперацииЭТ.НомерКарты = &НомерКарты
                      |	И ОперацииЭТ.СсылочныйНомерВозврат = &СсылочныйНомерВозврат
                      |	И ОперацииЭТ.ТипТранзакции В(&ТипТранзакции)");

Запрос.УстановитьПараметр("НомерКарты", НомерКарты);
Запрос.УстановитьПараметр("СсылочныйНомерВозврат", СсылочныйНомер);
ТипТранзакции_СЗ = Новый СписокЗначений;
ТипТранзакции_СЗ.Добавить("AuthorizeVoid");
ТипТранзакции_СЗ.Добавить("AuthorizeRefund");
Запрос.УстановитьПараметр("ТипТранзакции", ТипТранзакции_СЗ);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	СуммаВозврата = 0;
Иначе
	СуммаВозврата = ТЗ[0].СуммаОперации
КонецЕсли;

СуммаОперации = Запись.СуммаОперации;
Остаток = СуммаОперации - СуммаВозврата; 

Результат = Новый Структура("СсылочныйНомер, НомерЧекаЭТ, Остаток", СсылочныйНомер, НомерЧекаЭТ, Остаток); 
Возврат Результат; 
КонецФункции

&НаКлиенте
Процедура ЗавершениеВопроса_БудетПроизведенаОтменаВозвратОплаты(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ТипТранзакции = ДополнительныеПараметры.ТипТранзакции;
СсылочныйНомер = ДополнительныеПараметры.СсылочныйНомер;
НомерЧекаЭТ = ДополнительныеПараметры.НомерЧекаЭТ;

ВозвратОтменаОплатаКартаДействие(СсылочныйНомер, НомерЧекаЭТ, СуммаВозвратаКарта, ТипТранзакции);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИВыполнитьОтменаВозвратОплатаКарта(Результат, СуммаДокументаОплатыКарта, СуммаВозвратаКарта, ТипТранзакции) 
//Если Результат.Остаток < СуммаВозвратаКарта Тогда
//	ТекстПредупреждения = "Остаток оплаты: " + Результат.Остаток + " МЕНЬШЕ суммы отмены: " + СуммаВозвратаКарта + "
//		|
//		|ОТМЕНА/ВОЗВРАТ ОПЛАТЫ ЧЕРЕЗ ЭКВАЙРИНГОВЫЙ ТЕРМИНАЛ ОТМЕНЯЕТСЯ ...";
//	ПоказатьПредупреждение(, ТекстПредупреждения);   
//	
//	Возврат;
//Иначе
//	ОтменаВозвратОплатаКартаДействие(Результат.СсылочныйНомер, СуммаВозвратаКарта, ТипТранзакции);
//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратОтменаОплатаКартаДействие(СсылочныйНомер, НомерЧекаЭТ, СуммаОперации, ТипТранзакции) 
ФормаУникальныйИдентификатор = ЭтаФорма.УникальныйИдентификатор;

ЭтаФорма.Доступность = Ложь;

ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
//ПараметрыОперации.ТипТранзакции  = Параметры.ТипТранзакции;
//ПараметрыОперации.СуммаОперации  = Результат.Сумма;
ПараметрыОперации.ТипТранзакции  = ТипТранзакции;
ПараметрыОперации.СуммаОперации  = СуммаОперации;   

//ПараметрыОперации.НомерЧека      = ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, "");
//ПараметрыОперации.НомерЧекаЭТ    = ?(Результат.Свойство("НомерЧекаЭТ"), Результат.НомерЧекаЭТ, "");

//ПараметрыОперации.СсылочныйНомер = Результат.СсылочныйНомер;
ПараметрыОперации.СсылочныйНомер = СсылочныйНомер;

ДанныеОперации = Новый Структура();
ДанныеОперации.Вставить("ТипТранзакции", ТипТранзакции);
//ДанныеОперации.Вставить("ДанныеКарты", ?(Результат.Свойство("ДанныеКарты")  , Результат.ДанныеКарты, ""));
//ДанныеОперации.Вставить("ТипКарты", ?(Результат.Свойство("ТипКарты")  , Результат.ТипКарты, 0));
//ДанныеОперации.Вставить("НомерЧека", ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, ""));

ДанныеОперации.Вставить("СсылочныйНомерВозврат", СсылочныйНомер);
//Если НЕ ЗначениеЗаполнено(СсылочныйНомер) Тогда
//	ДанныеОперации.Вставить("НомерЧека", НомерЧекаЭТ);
//КонецЕсли;

ДанныеОперации.Вставить("ДокументДолг", ДокументДолг);

//ДанныеОперации.Вставить("ФормаУникальныйИдентификатор",  Параметры.ФормаУникальныйИдентификатор);
ДанныеОперации.Вставить("ФормаУникальныйИдентификатор",  ФормаУникальныйИдентификатор);
ДанныеОперации.Вставить("ЭтоКоворкинг",  ЭтоКоворкинг);

//Оповещение = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект, ДанныеОперации);
//ИмяОповещенияОЗавершении = Параметры.ИмяОповещенияОЗавершении;
Оповещение = Новый ОписаниеОповещения("ВозвратОтменаОплатаКарта_Завершение", ЭтотОбъект, ДанныеОперации);
ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение
	, ФормаУникальныйИдентификатор, Неопределено, ПараметрыОперации);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратОтменаОплатаКарта_Завершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
//ФормаУникальныйИдентификатор = Параметры.ФормаУникальныйИдентификатор;

ЭтаФорма.Доступность = Истина;

Если РезультатВыполнения.Результат Тогда
	ТекстСообщения = "Эквайринговая операция выполнена успешно." + Символы.ПС;
	ТекстПредупреждения = ТекстСообщения  + Символы.ПС;
	
	ТипТранзакции = ДополнительныеПараметры.ТипТранзакции; 
	
	ГУИД_ЭТ = Неопределено;
	Если ТипТранзакции = "AuthorizeSales" 
	ИЛИ  ТипТранзакции = "AuthorizeRefund" 
	ИЛИ  ТипТранзакции = "AuthorizeVoid" 
	Тогда
		ГУИД_ЭТ = ЭТСервер.ЗаписатьОперацию(РезультатВыполнения, ДополнительныеПараметры);
	КонецЕсли;
	
	//Если ТипТранзакции = "AuthorizeSales" 
	//ИЛИ  ТипТранзакции = "AuthorizeRefund" 
	//ИЛИ  ТипТранзакции = "AuthorizeVoid" 
	//Тогда
	//	ФорматированнаяСтрока = Новый ФорматированнаяСтрока("НЕ ЗАБУДЬТЕ ОФОРМИТЬ КАССОВЫЙ ЧЕК !!!"
	//		, Новый Шрифт(, 12, Истина), WebЦвета.Красный);
	//	ПоказатьПредупреждение(, ФорматированнаяСтрока); 
	//КонецЕсли;
Иначе
	ТекстСообщения = "Ошибка выполнения эквайринговой операции: " + РезультатВыполнения.ОписаниеОшибки;
	ТекстПредупреждения = "Ошибка выполнения эквайринговой операции.";
	
	ОшибкаЭТ = Истина;
	ОшибкаОперации = Истина;
	
	ЗавершитьОтбитиеВозвратЧека(ДополнительныеПараметры);
	
	Возврат;	
КонецЕсли;

ДопПараметры = Новый Структура;
ДопПараметры.Вставить("ДокОсн", ДокументОплаты);
ВыполнитьОперацию_ФУ(ДопПараметры);	
КонецПроцедуры
//// - ЭТ Отмена Возврат 








//// +++++++++++++++++++++++++++++








