
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр(); 
//УсловноеОформлениеЗагрузить();
КонецПроцедуры

//
&НаСервере
Процедура УсловноеОформлениеЗагрузить()
ЭлементыТабНаФормеИмя = Элементы.ТаблицаОтбора.Имя;

ПутьКПолюОтбора = "Таблица.Отметка";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;

УсловноеОформление.Элементы.Очистить();

ПравоеЗначение = Истина;
Web_Цвета = WebЦвета.БледноЗолотистый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление, ЭлементыТабНаФормеИмя, ПутьКПолюОтбора
	, Вид_Сравнения, ПравоеЗначение, Web_Цвета );
КонецПроцедуры
//

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
//Отказ = Истина;	
Если Копирование Тогда Отказ = Истина; КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
Если Элемент.ТекущиеДанные = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли;	

ГрупповойСчет = Элемент.ТекущаяСтрока;   

Если ГрупповойСчетСервер.ЕстьОплатыГрупповогоСчета(ГрупповойСчет) Тогда   
	ПоказатьПредупреждение(, "Есть оплаты группового счета.
	| 
	|УДАЛЕНИЕ НЕ РАЗРЕШЕНО ..."); 
	
	Отказ = Истина;
	Возврат;
КонецЕсли;

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдалениеДокументДолги", ЭтаФорма);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ...", РежимДиалогаВопрос.ОКОтмена);
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдалениеДокументДолги(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

УдалитьДокументыДолгиНаСервере();
КонецПроцедуры	

// Реальное Удаление заявок в модуле объекта
&НаСервере
Процедура УдалитьДокументыДолгиНаСервере()
НачатьТранзакцию();

ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
ТекущийОбъект = ТекущаяСтрока.ПолучитьОбъект();
ТекущийОбъект.Удалить();

ЗафиксироватьТранзакцию();

Элементы.Список.Обновить();
КонецПроцедуры
//

// + Печать
&НаКлиенте
Процедура ПечатьСчета(Команда)
ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

Счет = Элементы.Список.ТекущаяСтрока;
	
ТабличныйДокумент = ПечатьСчетаНаСервере(Счет);	
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

ПечатьКлиент.ОткрытьФормуПечатьСчетаИПодтверждения(ЭтаФорма, Счет, ТекущиеДанные.Контрагент
	, ТабличныйДокумент, Истина);
КонецПроцедуры

&НаСервере
Функция ПечатьСчетаНаСервере(Счет)
ТабличныйДокумент = ПечатьСервер.ПечатьГрупповогоСчета(Счет);		
Возврат ТабличныйДокумент; 
КонецФункции

&НаКлиенте
Процедура ПечатьАкта(Команда)
ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

Счет = Элементы.Список.ТекущаяСтрока;
	
ТабличныйДокумент = ПечатьАктаНаСервере(Счет);	
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

ТабличныйДокумент.Показать("Групповой Акт");
КонецПроцедуры

&НаСервере
Функция ПечатьАктаНаСервере(Счет)
ДокументыДолгиТаблица = Счет.ДокументыДолги.Выгрузить();	
ДокументыДолгиТаблица.Сортировать("ДокументДолг");

//ТабличныйДокумент = ПечатьСервер.ПечатьГрупповогоАкта(Счет.ДокументыДолги, Счет.Контрагент, Счет.СвернутьВСчете);	
ТабличныйДокумент = ПечатьСервер.ПечатьГрупповогоАкта(ДокументыДолгиТаблица, Счет.Контрагент, Счет.СвернутьВСчете);	
Возврат ТабличныйДокумент; 
КонецФункции

&НаКлиенте
Процедура Подтверждение(Команда)
ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

Счет = Элементы.Список.ТекущаяСтрока;
	
ТабличныйДокумент = Неопределено;
Контрагент = ТекущиеДанные.Контрагент;      
ПечатьКлиент.ОткрытьФормуПечатьСчетаИПодтверждения(ЭтаФорма, Счет, Контрагент
	, ТабличныйДокумент, Истина);
КонецПроцедуры
// - Печать



// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++
