  
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр();
ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр; 	
	
КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;	

Для Каждого Элемент Из Элементы.Зарплата.ПодчиненныеЭлементы Цикл
	Если Элемент = Элементы.ЗарплатаНомерСтроки Тогда Продолжить; КонецЕсли;
	Если Элемент = Элементы.ЗарплатаГорничная Тогда Продолжить; КонецЕсли;
	
	Элемент.Ширина = 7;	
КонецЦикла;
Элементы.ЗарплатаНомерСтроки.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
Элементы.ЗарплатаГорничная.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
//Элементы.ЗарплатаЗарплатаИтого.ФиксацияВТаблице = ФиксацияВТаблице.Право;

Для Каждого Элемент Из Элементы.Сдельно.ПодчиненныеЭлементы Цикл
	Если Элемент = Элементы.СдельноНомерСтроки Тогда 
		Элемент.Ширина = 2;	
		Продолжить; 
	КонецЕсли;
	Если Элемент = Элементы.СдельноГорничная Тогда Продолжить; КонецЕсли;
	Если Элемент = Элементы.СдельноДата Тогда 
		Элемент.Ширина = 9;	
		Продолжить; 
	КонецЕсли;
	Если Элемент = Элементы.СдельноИтого Тогда 
		Элемент.Ширина = 7;	
		Продолжить; 
	КонецЕсли;
	
	Если Элемент.Вид = ВидГруппыФормы.ГруппаКолонок Тогда 
		Для Каждого ЭлементГруппы Из Элемент.ПодчиненныеЭлементы Цикл
			ЭлементГруппы.Ширина = 7;
	    КонецЦикла;
	Иначе
		Если Элемент.Вид <> ВидПоляФормы.ПолеФлажка Тогда 
			Элемент.Ширина = 7;	
	    КонецЕсли;
    КонецЕсли;
КонецЦикла;
Элементы.СдельноНомерСтроки.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
Элементы.СдельноГорничная.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
Элементы.СдельноДата.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
Элементы.СдельноИтого.ФиксацияВТаблице = ФиксацияВТаблице.Право;
Элементы.СдельноВыплатыСумма.ФиксацияВТаблице = ФиксацияВТаблице.Право;
Элементы.СдельноВыплатыДата.ФиксацияВТаблице = ФиксацияВТаблице.Право;

ЗаполнитьСправочныеДанные();
 
ЕстьОбменСГорничными = Константы.ОбменСГорничными.Получить();

//Если НастройкиСервер.ЭтоРеноме() 
//ИЛИ НастройкиСервер.ЭтоЧехов() 	
//ИЛИ НастройкиСервер.ЭтоЛайв()
//Тогда
//Если ЕстьОбменСГорничными Тогда
	УсловноеОформлениеУстановить();
//Конецесли;

ОбновитьДанныеГорничных = Истина;
Если НЕ ЕстьОбменСГорничными Тогда
	Элементы.ОбновитьДанныеГорничных.Видимость = Ложь;
	ОбновитьДанныеГорничных = Ложь;
Конецесли;

ДобавитьРеквизитыПомещения();
ЗаполнитьПомещенияЦенаНаФорме();

////
Если НастройкиСервер.ЭтоДомСоветов() Тогда
	//Элементы.ЗарплатаНадбавкаЗаСтаж_Э.Видимость = Ложь;
	//Элементы.ЗарплатаНадбавкаЗаСтандарты_Э.Видимость = Ложь;
	
	//Элементы.ЗарплатаПремия.Видимость = Ложь;
	Элементы.ЗарплатаБольничный.Видимость = Ложь;
	
	//Элементы.ЗарплатаДопРаботы.Видимость = Ложь;
	//Элементы.ЗарплатаСдельно.Видимость = Ложь;
	
	//Элементы.ЗарплатаСуммаПрачечная_Э.Видимость = Ложь;
	
	//Элементы.МК_Цена.Видимость = Ложь;
	//Элементы.ЗарплатаМК_Количество_Э.Видимость = Ложь;
	//Элементы.ЗарплатаМК_Сумма.Видимость = Ложь;
	
	//Элементы.ЗарплатаСуммаПомещения.Видимость = Ложь;
	
	//Элементы.ЗарплатаИтого.Видимость = Ложь;
	
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда
	Элементы.ЗарплатаНадбавкаЗаСтаж_Э.Видимость = Ложь;
	Элементы.ЗарплатаНадбавкаЗаСтандарты_Э.Видимость = Ложь;
	
	//Элементы.ЗарплатаПремия.Видимость = Ложь;
	Элементы.ЗарплатаБольничный.Видимость = Ложь;
	
	//Элементы.ЗарплатаДопРаботы.Видимость = Ложь;
	//Элементы.ЗарплатаСдельно.Видимость = Ложь;

	//Элементы.ЗарплатаСуммаПрачечная_Э.Видимость = Ложь;
	
	Элементы.МК_Цена.Видимость = Ложь;
	Элементы.ЗарплатаМК_Количество_Э.Видимость = Ложь;
	Элементы.ЗарплатаМК_Сумма.Видимость = Ложь;
	
	Элементы.МДМ_Цена.Видимость = Ложь;
	Элементы.ЗарплатаМДМ_Количество_Э.Видимость = Ложь;
	Элементы.ЗарплатаМДМ_Сумма.Видимость = Ложь;
	
	//Элементы.ЗарплатаСуммаПомещения.Видимость = Ложь;
	
	//Элементы.ЗарплатаИтого.Видимость = Ложь;
	
КонецЕсли;	

//
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	ГорничныеПомещения.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.ГорничныеПомещения КАК ГорничныеПомещения
                      |ГДЕ
                      |	ГорничныеПомещения.ПометкаУдаления = ЛОЖЬ");

Результат = Запрос.Выполнить();
Помещения_Есть = НЕ Результат.Пустой(); 

Элементы.ЗарплатаСуммаПомещения.Видимость = Помещения_Есть;
Элементы.ГруппаПомещенияЦены.Видимость = Помещения_Есть;
Элементы.ПомещенияУборки.Видимость = Помещения_Есть;
Элементы.ФормаОчиститьПомещения.Видимость = Помещения_Есть; 
//
////

СдельноГорничная_СписокВыбора = Элементы.СдельноГорничная.СписокВыбора;
Для Каждого Строка Из ГорничныеСправочник Цикл
	НоваяСтрока = СдельноГорничная_СписокВыбора.Добавить(Строка.Горничная);	
КонецЦикла;

ПриЧтенииНаСервере(Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСправочныеДанные()
Если Объект.Г_Цена = 0 И Объект.Т_Цена = 0 И Объект.ТС_Цена = 0 И Объект.ТС_Цена = 0 
	И Объект.РК_Цена = 0 И Объект.МК_Цена = 0 И Объект.МДМ_Цена = 0  
	И Объект.ПомещенияЦены.Количество() = 0 	
Тогда
	ЗаполнитьЦеныУборки(); 
КонецЕсли;
ЗаполнитьЦеныУборкиСдельно();
//
ПомещенияЦена.Очистить();
Для Каждого Строка Из Объект.ПомещенияЦены Цикл
	НоваяСтрока = ПомещенияЦена.Добавить();	
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;
//

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеПомещения.Ссылка КАК Помещение
                      |ИЗ
                      |	Справочник.ГорничныеПомещения КАК ГорничныеПомещения
                      |ГДЕ
                      |	ГорничныеПомещения.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ГорничныеПомещения.Сортировка,
                      |	ГорничныеПомещения.Наименование");
	
ТЗ = Запрос.Выполнить().Выгрузить();

ПомещенияСправочник.Очистить();
Номер = 1;
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ПомещенияСправочник.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.Номер = Номер;
	Номер = Номер + 1;
	
	ОтборСтроки = Новый Структура("Помещение", Строка.Помещение);
	НайденныеСтроки = ПомещенияЦена.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		НоваяСтрока.Цена = НайденныеСтроки[0].Цена;
	КонецЕсли;
КонецЦикла;
//

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Горничные.Ссылка КАК Горничная,
                      |	Горничные.Оклад КАК Оклад,
                      |	Горничные.ДатаПриема КАК ДатаПриема,
                      |	Горничные.НадбавкаЗаСтандарты КАК НадбавкаЗаСтандарты,
                      |	0 КАК НадбавкаЗаСтаж
                      |ИЗ
                      |	Справочник.Горничные КАК Горничные
                      |ГДЕ
                      |	Горничные.ПометкаУдаления = ЛОЖЬ
                      |	И Горничные.НеРаботает = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Горничные.Сортировка,
                      |	Горничные.Наименование");
	
ТЗ = Запрос.Выполнить().Выгрузить();
ГорничныеСправочник.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ГорничныеСправочник.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока.НадбавкаЗаСтаж = СуммаНадбавкаЗаСтажЗаполнение(Строка.ДатаПриема);
КонецЦикла;
//

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеНадбавкаЗаСтаж.ДатаНазначения КАК ДатаНазначения,
                      |	ГорничныеНадбавкаЗаСтаж.РазницаВДняхС КАК РазницаВДняхС,
                      |	ГорничныеНадбавкаЗаСтаж.РазницаВДняхПо КАК РазницаВДняхПо,
                      |	ГорничныеНадбавкаЗаСтаж.Сумма КАК Сумма
                      |ИЗ
                      |	РегистрСведений.ГорничныеНадбавкаЗаСтаж КАК ГорничныеНадбавкаЗаСтаж
                      |ГДЕ
                      |	ГорничныеНадбавкаЗаСтаж.ДатаНазначения <= &ДатаНазначения
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаНазначения УБЫВ,
                      |	РазницаВДняхС");

ДатаУчета = Объект.ДК;
Запрос.УстановитьПараметр("ДатаНазначения", ДатаУчета);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() > 0 Тогда 
	ГорничныеНадбавкаЗаСтаж.Очистить();
	ДатаНазначения = ТЗ[0].ДатаНазначения;
	Для Каждого Строка Из ТЗ Цикл
		Если Строка.ДатаНазначения <> ДатаНазначения Тогда Прервать; КонецЕсли;
		
		НоваяСтрока = ГорничныеНадбавкаЗаСтаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	КонецЦикла;
КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныУборки()
//
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	ГорничныеСтоимостьУборок.ДатаНазначенияЦены КАК ДатаНазначенияЦены,
                      |	ГорничныеСтоимостьУборок.Г_Цена КАК Г_Цена,
                      |	ГорничныеСтоимостьУборок.Т_Цена КАК Т_Цена,
                      |	ГорничныеСтоимостьУборок.ТС_Цена КАК ТС_Цена,
                      |	ГорничныеСтоимостьУборок.РК_Цена КАК РК_Цена,
                      |	ГорничныеСтоимостьУборок.МК_Цена КАК МК_Цена,
                      |	ГорничныеСтоимостьУборок.МДМ_Цена КАК МДМ_Цена,
                      |	ГорничныеСтоимостьУборок.ЦеныПомещения.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		Помещение КАК Помещение,
                      |		Цена КАК Цена
                      |	) КАК ЦеныПомещения
                      |ИЗ
                      |	Справочник.ГорничныеСтоимостьУборок КАК ГорничныеСтоимостьУборок
                      |ГДЕ
                      |	ГорничныеСтоимостьУборок.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеСтоимостьУборок.ДатаНазначенияЦены <= &ДатаНазначенияЦены
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаНазначенияЦены УБЫВ");

Запрос.УстановитьПараметр("ДатаНазначенияЦены", Объект.ДН);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Возврат; КонецЕсли;

Строка = ТЗ[0];
Объект.Г_Цена = Строка.Г_Цена;
Объект.Т_Цена = Строка.Т_Цена;
Объект.ТС_Цена = Строка.ТС_Цена;
Объект.РК_Цена = Строка.РК_Цена;
Объект.МК_Цена = Строка.МК_Цена;
Объект.МДМ_Цена = Строка.МДМ_Цена;

ТЗ_ЦеныПомещения = Строка.ЦеныПомещения;
ПомещенияЦена.Очистить();
Объект.ПомещенияЦены.Очистить();

Для Каждого Строка Из ТЗ_ЦеныПомещения Цикл
	НоваяСтрока = Объект.ПомещенияЦены.Добавить();	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	НоваяСтрока = ПомещенияЦена.Добавить();	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

ЗаполнитьПомещенияЦенаНаФорме();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныУборкиСдельно()
//
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	ГорничныеСтоимостьУборок.ДатаНазначенияЦены КАК ДатаНазначенияЦены,
                      |	ГорничныеСтоимостьУборок.Г_ЦенаСдельно КАК Г_ЦенаСдельно,
                      |	ГорничныеСтоимостьУборок.Т_ЦенаСдельно КАК Т_ЦенаСдельно,
                      |	ГорничныеСтоимостьУборок.ТС_ЦенаСдельно КАК ТС_ЦенаСдельно,
                      |	ГорничныеСтоимостьУборок.МК_ЦенаСдельно КАК МК_ЦенаСдельно,
                      |	ГорничныеСтоимостьУборок.МДМ_ЦенаСдельно КАК МДМ_ЦенаСдельно,
                      |	ГорничныеСтоимостьУборок.ВыходСдельно КАК ВыходСдельно,
                      |	ГорничныеСтоимостьУборок.ПоЧасамСдельно КАК ПоЧасамСдельно
                      |ИЗ
                      |	Справочник.ГорничныеСтоимостьУборок КАК ГорничныеСтоимостьУборок
                      |ГДЕ
                      |	ГорничныеСтоимостьУборок.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеСтоимостьУборок.ДатаНазначенияЦены <= &ДатаНазначенияЦены
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаНазначенияЦены УБЫВ");

Запрос.УстановитьПараметр("ДатаНазначенияЦены", Объект.ДН);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Возврат; КонецЕсли;

Строка = ТЗ[0];

СдельноГ_Цена = Строка.Г_ЦенаСдельно;
СдельноТ_Цена = Строка.Т_ЦенаСдельно;
СдельноТС_Цена = Строка.ТС_ЦенаСдельно;
СдельноМК_Цена = Строка.МК_ЦенаСдельно;
СдельноМДМ_Цена = Строка.МДМ_ЦенаСдельно;
СдельноВыход = Строка.ВыходСдельно;
СдельноПоЧасам_Цена = Строка.ПоЧасамСдельно
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеУстановить() 
УО = ЭтаФорма.УсловноеОформление; 
УО.Элементы.Очистить(); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаОклад_Э", "Объект.Зарплата.Оклад_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаОтпуск_Э", "Объект.Зарплата.Отпуск_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаНадбавкаЗаСтаж_Э", "Объект.Зарплата.НадбавкаЗаСтаж_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаНадбавкаЗаСтандарты_Э", "Объект.Зарплата.НадбавкаЗаСтандарты_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСуммаПрачечная_Э", "Объект.Зарплата.СуммаПрачечная_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаКоличествоСмен_Э", "Объект.Зарплата.КоличествоСмен_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаКоличествоЧасов_Э", "Объект.Зарплата.КоличествоЧасов_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСдельно_нал_Э", "Объект.Зарплата.Сдельно_нал_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатСдельно_Э", "Объект.Зарплата.Сдельно_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

//
ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаГ_Количество_Э", "Объект.Зарплата.Г_Количество_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаТ_Количество_Э", "Объект.Зарплата.Т_Количество_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаТС_Количество_Э", "Объект.Зарплата.ТС_Количество_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаРК_Количество_Э", "Объект.Зарплата.РК_Количество_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаМК_Количество_Э", "Объект.Зарплата.МК_Количество_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 
	
ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаМДМ_Количество_Э", "Объект.Зарплата.МДМ_Количество_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеПолеДобавить(ЭлементУО, ИмяПоля, ИмяЛевогоЗначения, ПравоеЗначение, ВидСравнения) 
    
Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить(); 
Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
Оформляемоеполе.Использование = ИСТИНА;  

ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементУсловия.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных(ИмяЛевогоЗначения);
ЭлементУсловия.ПравоеЗначение = ПравоеЗначение;
ЭлементУсловия.ВидСравнения    = ВидСравнения;   
ЭлементУсловия.Использование   = Истина;    
        
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыПомещения()
// + Доп. реквизиты
ДобавляемыеРеквизиты	= Новый Массив;

ОписаниеЧисло_10_2 = Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10, 2)); 
ОписаниеЧисло_10_0 = Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10, 0)); 
Для Каждого Строка Из ПомещенияСправочник Цикл
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Количество_" + Строка(Строка.Номер), ОписаниеЧисло_10_0, "ПомещенияУборки"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Количество_" + Строка(Строка.Номер) + "_Р", ОписаниеЧисло_10_0, "ПомещенияУборки"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Количество_" + Строка(Строка.Номер) + "_Э", ОписаниеЧисло_10_0, "ПомещенияУборки"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Цена_" + Строка(Строка.Номер), ОписаниеЧисло_10_0, "ПомещенияУборки"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Сумма_" + Строка(Строка.Номер), ОписаниеЧисло_10_0, "ПомещенияУборки"));
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПомещениеЦена_" + Строка(Строка.Номер), ОписаниеЧисло_10_0));
КонецЦикла;	

// Добавим новые реквизиты в форму
ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

УО = ЭтаФорма.УсловноеОформление;
Для Каждого Строка Из ПомещенияСправочник Цикл
	Имя = "Количество_" + Строка(Строка.Номер); 
	НовыйЭлемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), Элементы.ПомещенияУборки);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ПомещенияУборки." + Имя;
	//НовыйЭлемент.Ширина = 10;
	НовыйЭлемент.Заголовок = "" + Строка.Помещение + Символы.ПС + "Кол-во И";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Видимость = Ложь;
	
	Имя = "Количество_" + Строка(Строка.Номер) + "_Р"; 
	НовыйЭлемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), Элементы.ПомещенияУборки);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ПомещенияУборки." + Имя;
	//НовыйЭлемент.Ширина = 10;
	НовыйЭлемент.Заголовок = "" + Строка.Помещение + Символы.ПС + "Кол-во К";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Видимость = Ложь;
	
	Имя = "Количество_" + Строка(Строка.Номер) + "_Э"; 
	НовыйЭлемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), Элементы.ПомещенияУборки);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ПомещенияУборки." + Имя;
	//НовыйЭлемент.Ширина = 10;
	НовыйЭлемент.Заголовок = "" + Строка.Помещение + Символы.ПС + "Кол-во";
	НовыйЭлемент.ТолькоПросмотр = Ложь;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПомещенияУборкиЭлемент_ПриИзменении");
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.УстановитьДействие("Очистка", "ПомещенияУборкиЭлемент_Очистка");
	
	Имя = "Сумма_" + Строка(Строка.Номер); 
	НовыйЭлемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), Элементы.ПомещенияУборки);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ПомещенияУборки." + Имя;
	//НовыйЭлемент.Ширина = 10;
	НовыйЭлемент.Заголовок =  "" + Строка.Помещение + Символы.ПС + "Сумма ";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	//
	Имя = "ПомещениеЦена_" + Строка(Строка.Номер); 
	НовыйЭлемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), Элементы.ГруппаПомещенияЦены);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = Имя;
	НовыйЭлемент.Ширина = 4;
	НовыйЭлемент.Заголовок =  "" + Строка.Помещение;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	// + Перенесено в ЗаполнитьПомещенияЦенаНаФорме(
	//ОтборСтроки = Новый Структура("Помещение", Строка.Помещение);
	//НайденныеСтроки = ПомещенияЦена.НайтиСтроки(ОтборСтроки);
	//Если НайденныеСтроки.Количество() > 0 Тогда
	//	 ЭтаФорма[Имя] = НайденныеСтроки[0].Цена;
	//КонецЕсли;
	// - Перенесено в ЗаполнитьПомещенияЦенаНаФорме(
	
	//Если НастройкиСервер.ЭтоРеноме() 
	//ИЛИ НастройкиСервер.ЭтоЧехов() 	
	//ИЛИ НастройкиСервер.ЭтоЛайв()
	//Тогда
	Если ЕстьОбменСГорничными Тогда	
		ЭлементУО = УО.Элементы.Добавить(); 
		ИмяПоля = "Количество_" + Строка(Строка.Номер) + "_Э";
		ИмяРеквизита = "ПомещенияУборки.Количество_" + Строка(Строка.Номер) + "_Р"; 

		УсловноеОформлениеПолеДобавить(ЭлементУО, ИмяПоля, ИмяРеквизита, 0, ВидСравненияКомпоновкиДанных.НеРавно);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 
	КонецЕсли;
КонецЦикла;
// - Доп. реквизиты
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПомещенияЦенаНаФорме()
Для Каждого Строка Из ПомещенияСправочник Цикл
	Имя = "ПомещениеЦена_" + Строка(Строка.Номер); 
	
	ОтборСтроки = Новый Структура("Помещение", Строка.Помещение);
	НайденныеСтроки = ПомещенияЦена.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		 ЭтаФорма[Имя] = НайденныеСтроки[0].Цена;
	КонецЕсли;
КонецЦикла;
КонецПроцедуры

//

&НаКлиенте
Процедура МесяцРасчетаПриИзменении(Элемент)
Объект.МесяцРасчета = НачалоМесяца(Объект.МесяцРасчета);	
КонецПроцедуры

//
&НаКлиенте
Асинх Процедура РасчитатьЗарплату(Команда)
//Результат = Ждать ВопросАсинх("Рсчет зарплаты обнулит все изменения внесенные вручную ! 			
//					|
//					|ПОДТВЕРДИТЕ РАСЧЕТ ЗАРПЛАТЫ ..."
//	, РежимДиалогаВопрос.ОКОтмена); 
//	
//Если Результат = КодВозвратаДиалога.ОК Тогда
	РасчитатьЗарплатуДействие();
//КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьЗарплатуДействие()
ЗаполнитьСправочныеДанные();
	
//Если НастройкиСервер.ЭтоРеноме()
//ИЛИ НастройкиСервер.ЭтоЧехов() 
//ИЛИ НастройкиСервер.ЭтоЛайв()
//Тогда
Если ЕстьОбменСГорничными И ОбновитьДанныеГорничных Тогда 
	ДН = Объект.ДН;
	ДК = КонецДня(Объект.ДК);  
	ОбменГорничныеСервер.ЗагрузитьОбслуживаниеНомеров(ДН, ДК, "");	
	ОбменГорничныеСервер.ЗагрузитьОбслуживаниеПомещений(ДН, ДК);		
	ОбменГорничныеСервер.ЗагрузитьСмены(ДН, ДК);		
КонецЕсли;

РасчитатьЗарплатуНаСервере();

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаСервере
Процедура РасчитатьЗарплатуНаСервере()
ДН = Объект.ДН; 
ДК = КонецДня(Объект.ДК);

ЗаполнитьЦеныУборки();

//
Запрос = Новый Запрос;
Запрос.Текст = ГорничныеЗарплата.ЗапросГорничныеДанные();

Запрос.УстановитьПараметр("ДН", ДН);
Запрос.УстановитьПараметр("ДК", ДК);

ТЗ_Уборки = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеПрачечнаяПрачечная.Горничная КАК Горничная,
                      |	СУММА(ГорничныеПрачечнаяПрачечная.СуммаПрачечная) КАК СуммаПрачечная
                      |ИЗ
                      |	Документ.ГорничныеПрачечная.Прачечная КАК ГорничныеПрачечнаяПрачечная
                      |ГДЕ
                      |	ГорничныеПрачечнаяПрачечная.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеПрачечнаяПрачечная.ДатаУслуги МЕЖДУ &ДН И &ДК
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ГорничныеПрачечнаяПрачечная.Горничная");   

Запрос.УстановитьПараметр("ДН", ДН);
Запрос.УстановитьПараметр("ДК", ДК);
ТЗ_Прачечная = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	ГорничныеСмены.Горничная КАК Горничная,
               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГорничныеСмены.ДатаСмены) КАК КоличествоСмен
               |ИЗ
               |	Документ.ГорничныеСмены КАК ГорничныеСмены
               |ГДЕ
               |	ГорничныеСмены.ПометкаУдаления = ЛОЖЬ
               |	И ГорничныеСмены.ДатаСмены МЕЖДУ &ДН И &ДК
               |
               |СГРУППИРОВАТЬ ПО
               |	ГорничныеСмены.Горничная
               |
               |УПОРЯДОЧИТЬ ПО
               |	ГорничныеСмены.Горничная";

Запрос.УстановитьПараметр("ДН", ДН);
Запрос.УстановитьПараметр("ДК", ДК);
ТЗ_Смены = Запрос.Выполнить().Выгрузить();
//

//
ТЗ_Зарплата = Объект.Зарплата.Выгрузить(); 

Объект.Зарплата.Очистить();
Для Каждого Строка Из ГорничныеСправочник Цикл
	НоваяСтрока = Объект.Зарплата.Добавить(); 
	НоваяСтрока.Горничная = Строка.Горничная; 
КонецЦикла;

Для Каждого Строка Из Объект.Зарплата Цикл
	
	ОтборСтроки = Новый Структура("Горничная", Строка.Горничная);
	
	НайденныеСтроки = ТЗ_Смены.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденнаяСтрока = НайденныеСтроки[0];
		Строка.КоличествоСмен = НайденнаяСтрока.КоличествоСмен;
	КонецЕсли;
	
	НайденныеСтроки = ГорничныеСправочник.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденнаяСтрока = НайденныеСтроки[0];

		Строка.Оклад = СуммаОклад(НайденнаяСтрока.Горничная);
		Строка.Отпуск = СуммаОтпуск(НайденнаяСтрока.Горничная);
		
		Если НастройкиСервер.ЭтоЛайв()
		ИЛИ НастройкиСервер.ЭтоЧехов()
		ИЛИ НастройкиСервер.ЭтоРеноме()
		ИЛИ НастройкиСервер.ЭтоДомСоветов()
		Тогда	
			//НадбавкаЗаСтаж = СуммаНадбавкаЗаСтаж(НайденнаяСтрока.ДатаПриема);
			НадбавкаЗаСтаж = СуммаНадбавкаЗаСтаж(НайденнаяСтрока);
			Строка.НадбавкаЗаСтаж = НадбавкаЗаСтаж;
		КонецЕсли;	
			
		Если НастройкиСервер.ЭтоЛайв()
		ИЛИ НастройкиСервер.ЭтоЧехов()
		ИЛИ НастройкиСервер.ЭтоРеноме()
		ИЛИ НастройкиСервер.ЭтоДомСоветов()
		Тогда	
			//Строка.НадбавкаЗаСтандарты = НайденнаяСтрока.НадбавкаЗаСтандарты;
			Строка.НадбавкаЗаСтандарты = СуммаНадбавкаЗаСтандарты(Строка.Горничная);		КонецЕсли;	
	КонецЕсли;	
	
	НайденныеСтроки = ТЗ_Прачечная.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденнаяСтрока = НайденныеСтроки[0];
		Строка.СуммаПрачечная = НайденнаяСтрока.СуммаПрачечная;
	КонецЕсли;	
	
	Если Строка.Горничная.УчетУборок Тогда
		НайденныеСтроки = ТЗ_Уборки.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			Строка.Г_Количество = НайденнаяСтрока.Г;
			Строка.Г_Сумма = Объект.Г_Цена * НайденнаяСтрока.Г;
			Строка.Т_Количество = НайденнаяСтрока.Т;
			Строка.Т_Сумма = Объект.Т_Цена * НайденнаяСтрока.Т;
			Строка.ТС_Количество = НайденнаяСтрока.ТС;
			Строка.ТС_Сумма = Объект.ТС_Цена * НайденнаяСтрока.ТС;
			Строка.РК_Количество = НайденнаяСтрока.РК;
			Строка.РК_Сумма = Объект.РК_Цена * НайденнаяСтрока.РК;
			
			Строка.МК_Количество = НайденнаяСтрока.МК;
			Строка.МК_Сумма = Объект.МК_Цена * НайденнаяСтрока.МК;
			
			Строка.МДМ_Количество = НайденнаяСтрока.МДМ;
			Строка.МДМ_Сумма = Объект.МДМ_Цена * НайденнаяСтрока.МДМ;
		КонецЕсли;	
	КонецЕсли;	
		
	ОтборСтроки = Новый Структура("Горничная", Строка.Горничная);
	НайденныеСтроки = ТЗ_Зарплата.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаТЗ_Зарплата = НайденныеСтроки[0];
		Если СтрокаТЗ_Зарплата.Оклад_Есть Тогда Строка.Оклад_Есть = Истина; Строка.Оклад_Р = СтрокаТЗ_Зарплата.Оклад_Р; КонецЕсли;		
		Если СтрокаТЗ_Зарплата.Отпуск_Есть Тогда Строка.Отпуск_Есть = Истина; Строка.Отпуск_Р = СтрокаТЗ_Зарплата.Отпуск_Р; КонецЕсли;		
		Если СтрокаТЗ_Зарплата.НадбавкаЗаСтаж_Есть Тогда Строка.НадбавкаЗаСтаж_Есть = Истина; Строка.НадбавкаЗаСтаж_Р = СтрокаТЗ_Зарплата.НадбавкаЗаСтаж_Р; КонецЕсли;		
		Если СтрокаТЗ_Зарплата.НадбавкаЗаСтандарты_Есть Тогда Строка.НадбавкаЗаСтандарты_Есть = Истина; Строка.НадбавкаЗаСтандарты_Р = СтрокаТЗ_Зарплата.НадбавкаЗаСтандарты_Р; КонецЕсли;		
		Если СтрокаТЗ_Зарплата.СуммаПрачечная_Есть Тогда Строка.СуммаПрачечная_Есть = Истина; Строка.СуммаПрачечная_Р = СтрокаТЗ_Зарплата.СуммаПрачечная_Р; КонецЕсли;		
		Если СтрокаТЗ_Зарплата.КоличествоСмен_Есть Тогда Строка.КоличествоСмен_Есть = Истина; Строка.КоличествоСмен_Р = СтрокаТЗ_Зарплата.КоличествоСмен_Р; КонецЕсли;		
		
		//Строка.Г_Количество_Р = СтрокаТЗ_Зарплата.Г_Количество_Р;		
		//Строка.Т_Количество_Р = СтрокаТЗ_Зарплата.Т_Количество_Р;		
		//Строка.ТС_Количество_Р = СтрокаТЗ_Зарплата.ТС_Количество_Р;		
		//Строка.РК_Количество_Р = СтрокаТЗ_Зарплата.РК_Количество_Р;		
		//Строка.МК_Количество_Р = СтрокаТЗ_Зарплата.МК_Количество_Р;	
		//Строка.МДМ_Количество_Р = СтрокаТЗ_Зарплата.МДМ_Количество_Р;	
		
		Если СтрокаТЗ_Зарплата.Г_Количество_Р <> 0 Тогда
			Г_КоличествоРазница = Строка.Г_Количество - СтрокаТЗ_Зарплата.Г_Количество; 
			Строка.Г_Количество_Р = СтрокаТЗ_Зарплата.Г_Количество_Р - Г_КоличествоРазница;		
		КонецЕсли;	
			
		Если СтрокаТЗ_Зарплата.Т_Количество_Р <> 0 Тогда
			Т_КоличествоРазница = Строка.Т_Количество - СтрокаТЗ_Зарплата.Т_Количество; 
			Строка.Т_Количество_Р = СтрокаТЗ_Зарплата.Т_Количество_Р - Т_КоличествоРазница;		
		КонецЕсли;	
		
		Если СтрокаТЗ_Зарплата.ТС_Количество_Р <> 0 Тогда
			ТС_КоличествоРазница = Строка.ТС_Количество - СтрокаТЗ_Зарплата.ТС_Количество; 
			Строка.ТС_Количество_Р = СтрокаТЗ_Зарплата.ТС_Количество_Р - ТС_КоличествоРазница;		
		КонецЕсли;	
		
		Если СтрокаТЗ_Зарплата.РК_Количество_Р <> 0 Тогда
			РК_КоличествоРазница = Строка.РК_Количество - СтрокаТЗ_Зарплата.РК_Количество; 
			Строка.РК_Количество_Р = СтрокаТЗ_Зарплата.РК_Количество_Р - РК_КоличествоРазница;
		КонецЕсли;	
		
		Если СтрокаТЗ_Зарплата.МК_Количество_Р <> 0 Тогда
			МК_КоличествоРазница = Строка.МК_Количество - СтрокаТЗ_Зарплата.МК_Количество; 
			Строка.МК_Количество_Р = СтрокаТЗ_Зарплата.МК_Количество_Р - МК_КоличествоРазница;	
		КонецЕсли;	
		
		Если СтрокаТЗ_Зарплата.МДМ_Количество_Р <> 0 Тогда
			МДМ_КоличествоРазница = Строка.МДМ_Количество - СтрокаТЗ_Зарплата.МДМ_Количество; 
			Строка.МДМ_Количество_Р = СтрокаТЗ_Зарплата.МДМ_Количество_Р - МДМ_КоличествоРазница;	
		КонецЕсли;	
		
		Строка.Больничный = СтрокаТЗ_Зарплата.Больничный;	
		Строка.Премия = СтрокаТЗ_Зарплата.Премия;	
		
		Строка.ДопРаботы = СтрокаТЗ_Зарплата.ДопРаботы;	
		
		//Строка.Сдельно = СтрокаТЗ_Зарплата.Сдельно;	
		//Если СтрокаТЗ_Зарплата.Сдельно_Есть Тогда 
		//	Строка.Сдельно_Есть = Истина; Строка.Сдельно_Р = СтрокаТЗ_Зарплата.Сдельно_Р; 
		//КонецЕсли;		
		
		Сдельно = 0;
		Для Каждого СтрокаСдельно Из Объект.Сдельно Цикл
			Если СтрокаСдельно.Горничная <> Строка.Горничная Тогда Продолжить; КонецЕсли;
			Если НЕ (СтрокаСдельно.Дата >= Объект.ДН И СтрокаСдельно.Дата <= Объект.ДК) Тогда Продолжить; КонецЕсли;

			СдельноИтого = СдельноИтого(СтрокаСдельно);
			Сдельно = Сдельно + СдельноИтого;
		КонецЦикла;
		Строка.Сдельно = Сдельно;

		Если СтрокаТЗ_Зарплата.Сдельно_Есть Тогда 
			Строка.Сдельно_Есть = Истина; Строка.Сдельно_Р = СтрокаТЗ_Зарплата.Сдельно_Р; 
		КонецЕсли;
		
		Строка.КорректировкаДопНачислено = СтрокаТЗ_Зарплата.КорректировкаДопНачислено;	
		
		Строка.Аванс_кк = СтрокаТЗ_Зарплата.Аванс_кк;	
		Строка.Аванс_нал = СтрокаТЗ_Зарплата.Аванс_нал;	
		Строка.Зарплата_кк = СтрокаТЗ_Зарплата.Зарплата_кк;	
		Строка.Отпуск_кк = СтрокаТЗ_Зарплата.Отпуск_кк;	
		Строка.Отпуск_нал = СтрокаТЗ_Зарплата.Отпуск_нал;	
		
		Строка.Сдельно_нал = СтрокаТЗ_Зарплата.Сдельно_нал;	
		Если СтрокаТЗ_Зарплата.Сдельно_нал_Есть Тогда 
			Строка.Сдельно_нал_Есть = Истина; Строка.Сдельно_нал_Р = СтрокаТЗ_Зарплата.Сдельно_нал_Р; 
		КонецЕсли;	
		
		Строка.ИныеВыплаты_нал = СтрокаТЗ_Зарплата.ИныеВыплаты_нал;	
		
		Строка.КоличествоЧасов = КоличествоЧасовНаСервере(СтрокаТЗ_Зарплата, СтрокаТЗ_Зарплата.КоличествоСмен_Э);	
		Если СтрокаТЗ_Зарплата.КоличествоЧасов_Есть Тогда 
			Строка.КоличествоЧасов_Есть = Истина; Строка.КоличествоЧасов_Р = СтрокаТЗ_Зарплата.КоличествоЧасов_Р; 
		КонецЕсли;	
		
	КонецЕсли;		
КонецЦикла;
//

//
ТЗ_ЗарплатаПомещения = Объект.ЗарплатаПомещения.Выгрузить();
Объект.ЗарплатаПомещения.Очистить();

Запрос = Новый Запрос;
Запрос.Текст = ГорничныеЗарплата.ЗапросГорничныеПомещенияДанные();

Запрос.УстановитьПараметр("ДН", ДН);
Запрос.УстановитьПараметр("ДК", ДК);
ТЗ_ПомещенияУборки = Запрос.Выполнить().Выгрузить();
Если НЕ ЕстьОбменСГорничными Тогда
	ТЗ_ПомещенияУборки.Очистить();
КонецЕсли;
	
Для Каждого СтрокаГорничные Из ГорничныеСправочник Цикл
	Если НЕ СтрокаГорничные.Горничная.УчетУборок Тогда Продолжить; КонецЕсли;

	Для Каждого СтрокаПомещения Из ПомещенияСправочник Цикл
		НоваяСтрока = Объект.ЗарплатаПомещения.Добавить();
		НоваяСтрока.Горничная = СтрокаГорничные.Горничная;
		НоваяСтрока.Помещение = СтрокаПомещения.Помещение;
		
		ОтборСтрок = Новый Структура("Горничная, Помещение", СтрокаГорничные.Горничная, СтрокаПомещения.Помещение);
		НайденныеСтроки = ТЗ_ПомещенияУборки.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			НоваяСтрока.Количество = НайденныеСтроки[0].Количество;
		КонецЕсли;
		
		ОтборСтрок = Новый Структура("Горничная, Помещение", СтрокаГорничные.Горничная, СтрокаПомещения.Помещение);
		НайденныеСтроки = ТЗ_ЗарплатаПомещения.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			Если НайденнаяСтрока.Количество_Р <> 0 Тогда
				Разница = НоваяСтрока.Количество - НайденнаяСтрока.Количество;
				НоваяСтрока.Количество_Р = НайденныеСтроки[0].Количество_Р - Разница;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецЦикла;
//
КонецПроцедуры

&НаСервере
Функция КоличествоЧасовНаСервере(Строка, КоличествоСмен)
ДлинаСмены = Строка.Горничная.ДлинаСмены;	
Если ДлинаСмены = 0 Тогда Возврат 0; КонецЕсли;	
	
КоличествоЧасов = КоличествоСмен * ДлинаСмены;
Возврат КоличествоЧасов; 
КонецФункции

&НаКлиенте
Функция КоличествоЧасовНаКлиенте(Строка, КоличествоСмен)
ДлинаСмены = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Строка.Горничная, "ДлинаСмены");	
Если ДлинаСмены = 0 Тогда Возврат 0; КонецЕсли;	
	
// + Аудит
//КоличествоЧасов = КоличествоСмен * 8;
КоличествоЧасов = КоличествоСмен * ДлинаСмены;
// - Аудит
Возврат КоличествоЧасов; 
КонецФункции

&НаСервере
Функция СуммаНадбавкаЗаСтажЗаполнение(ДатаПриема)
//0,5года -500
//1 год -1000
//2 года-2000
//3года -3000
//5 лет -3500 


Если НЕ ЗначениеЗаполнено(ДатаПриема) Тогда Возврат 0; КонецЕсли;

Если ГорничныеНадбавкаЗаСтаж.Количество() = 0 Тогда Возврат 0; КонецЕсли;

ДатаУчета = Объект.ДН;
РазницаВДнях = (НачалоДня(ДатаУчета) - НачалоДня(ДатаПриема)) / (60 * 60 * 24);

СуммаНадбавкаЗаСтаж = 0;
Для Каждого Строка Из ГорничныеНадбавкаЗаСтаж Цикл
	Если РазницаВДнях >= Строка.РазницаВДняхС И РазницаВДнях < Строка.РазницаВДняхПо Тогда
		 СуммаНадбавкаЗаСтаж = Строка.Сумма;
		 
		 Прервать;
	КонецЕсли;
КонецЦикла;

Возврат СуммаНадбавкаЗаСтаж;
КонецФункции

&НаСервере
Функция СуммаНадбавкаЗаСтаж(ГорничнаяСправочник) 
//КоличествоДней = КоличествоРасчетныхДней(ГорничнаяСправочник.Горничная); 
КоличествоДней = ((НачалоДня(Объект.ДК) - НачалоДня(Объект.ДН)) / (60 * 60 * 24)) + 1;
	
КоличествоДнейМесяц = День(КонецМесяца(Объект.МесяцРасчета));

СуммаНадбавкаЗаСтаж = Окр(ГорничнаяСправочник.НадбавкаЗаСтаж * КоличествоДней / КоличествоДнейМесяц);

Возврат СуммаНадбавкаЗаСтаж;
КонецФункции

&НаСервере
Функция СуммаНадбавкаЗаСтандарты(Горничная) 
//КоличествоДней = КоличествоРасчетныхДней(Горничная); 
КоличествоДней = ((НачалоДня(Объект.ДК) - НачалоДня(Объект.ДН)) / (60 * 60 * 24)) + 1;
	
КоличествоДнейМесяц = День(КонецМесяца(Объект.МесяцРасчета));

СуммаНадбавкаЗаСтандарты = Окр(Горничная.НадбавкаЗаСтандарты * КоличествоДней / КоличествоДнейМесяц);

Возврат СуммаНадбавкаЗаСтандарты;
КонецФункции


&НаСервере
Функция СуммаОтпуск(Горничная) 
Если Горничная.ВсегоДнейОтпуска = 0 Тогда Возврат 0; КонецЕсли;
	
ДнейОтпуска = 0;
Отпуска = Горничная.Отпуска;
Для Каждого Строка Из Отпуска Цикл
	Если Строка.ДатаНачалаОтпуска >= Объект.ДН И Строка.ДатаНачалаОтпуска <= Объект.ДК Тогда  
		РазницаВДнях = ((НачалоДня(Строка.ДатаОкончанияОтпуска) - НачалоДня(Строка.ДатаНачалаОтпуска)) / (60 * 60 * 24)) + 1;
		ДнейОтпуска = ДнейОтпуска + РазницаВДнях;
	КонецЕсли;
КонецЦикла;
Если ДнейОтпуска = 0 Тогда Возврат 0; КонецЕсли;

СуммаОтпуск = Окр( ДнейОтпуска * Горничная.Отпуск / Горничная.ВсегоДнейОтпуска);

Возврат СуммаОтпуск;
КонецФункции

&НаСервере
Функция СуммаОклад(Горничная) 
//Если Горничная.Наименование = "Сонникова Людмила" Тогда
//	ш= 1;
//КонецЕсли;
ОкладКоличествоДней = КоличествоРасчетныхДней(Горничная); 
	
КоличествоДнейМесяц = День(КонецМесяца(Объект.МесяцРасчета));
СуммаОклад = Окр(Горничная.Оклад * ОкладКоличествоДней / КоличествоДнейМесяц);

Возврат СуммаОклад;
КонецФункции

&НаСервере
Функция КоличествоРасчетныхДней(Горничная) 
//Если Горничная.Наименование = "Сонникова Людмила" Тогда
//	ш= 1;
//КонецЕсли;

РазницаВДняхОбщая = ((НачалоДня(Объект.ДК) - НачалоДня(Объект.ДН)) / (60 * 60 * 24)) + 1;

Если Горничная.ВсегоДнейОтпуска = 0 Тогда Возврат РазницаВДняхОбщая; КонецЕсли;
	
ДнейОтпуска = 0;
Отпуска = Горничная.Отпуска;
Для Каждого Строка Из Отпуска Цикл
	РазницаВДнях = 0;
	
	Если Строка.ДатаНачалаОтпуска >= Объект.ДН И Строка.ДатаОкончанияОтпуска <= Объект.ДК Тогда  
		РазницаВДнях = ((НачалоДня(Строка.ДатаОкончанияОтпуска) - НачалоДня(Строка.ДатаНачалаОтпуска)) / (60 * 60 * 24)) + 1;
		
	ИначеЕсли Строка.ДатаНачалаОтпуска < Объект.ДН И Строка.ДатаОкончанияОтпуска > Объект.ДК Тогда
		РазницаВДнях = ((НачалоДня(Объект.ДК) - НачалоДня(Объект.ДН)) / (60 * 60 * 24)) + 1;
		
	ИначеЕсли Строка.ДатаНачалаОтпуска >= Объект.ДН И Строка.ДатаНачалаОтпуска <= Объект.ДК 
	И Строка.ДатаОкончанияОтпуска > Объект.ДК Тогда  
		РазницаВДнях = ((НачалоДня(Объект.ДК) - НачалоДня(Строка.ДатаНачалаОтпуска)) / (60 * 60 * 24)) + 1;
		
	ИначеЕсли Строка.ДатаНачалаОтпуска < Объект.ДН 	И Строка.ДатаОкончанияОтпуска >= Объект.ДН   
	И Строка.ДатаОкончанияОтпуска <= Объект.ДК Тогда
		РазницаВДнях = ((НачалоДня(Строка.ДатаОкончанияОтпуска) - НачалоДня(Объект.ДН)) / (60 * 60 * 24)) + 1;
		
	КонецЕсли;
	
	ДнейОтпуска = ДнейОтпуска + РазницаВДнях;
КонецЦикла;

ДнейОклад = РазницаВДняхОбщая - ДнейОтпуска; 

Возврат ДнейОклад;
КонецФункции
//

//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
ОбновитьЗарплатаПомещения();

ОбновитьЗарплатаСтроки();

ОбновитьСдельноСтроки();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
ОбновитьЗарплатаПомещения();

ОбновитьЗарплатаСтроки();

ОбновитьСдельноСтроки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗарплатаСтроки() 
Для Каждого Строка Из Объект.Зарплата Цикл
	ОбновитьСтрокаСуммы(Строка);
	
	ОбновитьСуммаУборки(Строка);
	ОбновитьСуммаПомещения(Строка);

	ОбновитьЗарплатаИтого(Строка);
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСдельноСтроки() 
Для Каждого Строка Из Объект.Сдельно Цикл
	ОбновитьСдельноСтрока(Строка);
КонецЦикла;
КонецПроцедуры
//

//
&НаСервере
Процедура ОбновитьСтрокаСуммы(ТД)

Если ТД.Оклад_Есть Тогда 
	ТД.Оклад_Э = ТД.Оклад_Р;
Иначе
	ТД.Оклад_Э = ТД.Оклад;
КонецЕсли;

Если ТД.Отпуск_Есть Тогда 
	ТД.Отпуск_Э = ТД.Отпуск_Р;
Иначе
	ТД.Отпуск_Э = ТД.Отпуск;
КонецЕсли;

Если ТД.НадбавкаЗаСтаж_Есть Тогда 
	ТД.НадбавкаЗаСтаж_Э = ТД.НадбавкаЗаСтаж_Р;
Иначе
	ТД.НадбавкаЗаСтаж_Э = ТД.НадбавкаЗаСтаж;
КонецЕсли;

Если ТД.НадбавкаЗаСтандарты_Есть Тогда 
	ТД.НадбавкаЗаСтандарты_Э = ТД.НадбавкаЗаСтандарты_Р;
Иначе
	ТД.НадбавкаЗаСтандарты_Э = ТД.НадбавкаЗаСтандарты;
КонецЕсли;

Если ТД.СуммаПрачечная_Есть Тогда 
	ТД.СуммаПрачечная_Э = ТД.СуммаПрачечная_Р;
Иначе
	ТД.СуммаПрачечная_Э = ТД.СуммаПрачечная;
КонецЕсли;

Если ТД.КоличествоСмен_Есть Тогда 
	ТД.КоличествоСмен_Э = ТД.КоличествоСмен_Р;
Иначе
	ТД.КоличествоСмен_Э = ТД.КоличествоСмен;
КонецЕсли;

Если ТД.Сдельно_Есть Тогда 
	ТД.Сдельно_Э = ТД.Сдельно_Р;
Иначе
	ТД.Сдельно_Э = ТД.Сдельно;
КонецЕсли;

Если ТД.Сдельно_нал_Есть Тогда 
	ТД.Сдельно_нал_Э = ТД.Сдельно_нал_Р;
Иначе
	ТД.Сдельно_нал_Э = ТД.Сдельно_нал;
КонецЕсли;

Если ТД.КоличествоЧасов_Есть Тогда 
	ТД.КоличествоЧасов_Э = ТД.КоличествоЧасов_Р;
Иначе
	ТД.КоличествоЧасов_Э = ТД.КоличествоЧасов;
КонецЕсли;

ТД.Г_Количество_Э = ТД.Г_Количество + ТД.Г_Количество_Р;
ТД.Г_Сумма = ТД.Г_Количество_Э * Объект.Г_Цена;

ТД.Т_Количество_Э = ТД.Т_Количество + ТД.Т_Количество_Р;
ТД.Т_Сумма = ТД.Т_Количество_Э * Объект.Т_Цена;

ТД.ТС_Количество_Э = ТД.ТС_Количество + ТД.ТС_Количество_Р;
ТД.ТС_Сумма = ТД.ТС_Количество_Э * Объект.ТС_Цена; 

ТД.РК_Количество_Э = ТД.РК_Количество + ТД.РК_Количество_Р;
ТД.РК_Сумма = ТД.РК_Количество_Э * Объект.РК_Цена; 

ТД.МК_Количество_Э = ТД.МК_Количество + ТД.МК_Количество_Р;
ТД.МК_Сумма = ТД.МК_Количество_Э * Объект.МК_Цена; 

ТД.МДМ_Количество_Э = ТД.МДМ_Количество + ТД.МДМ_Количество_Р;
ТД.МДМ_Сумма = ТД.МДМ_Количество_Э * Объект.МДМ_Цена; 
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммаУборки(ТД)
ТД.СуммаУборки = СуммаУборки(ТД);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗарплатаПомещения()
ПомещенияУборки.Очистить();

Для Каждого Строка Из ГорничныеСправочник Цикл
	НоваяСтрока = ПомещенияУборки.Добавить();
	НоваяСтрока.Горничная = Строка.Горничная;
КонецЦикла;

Для Каждого Строка Из ПомещенияУборки Цикл
	ОтборСтроки = Новый Структура("Горничная", Строка.Горничная);
	СтрокиЗарплатаПомещения = Объект.ЗарплатаПомещения.НайтиСтроки(ОтборСтроки);
	
	СуммаИтого = 0;
	Для Каждого СтрокаЗарплатаПомещения Из СтрокиЗарплатаПомещения Цикл
		Количество = СтрокаЗарплатаПомещения.Количество;
		Количество_Р = СтрокаЗарплатаПомещения.Количество_Р;
		Количество_Э = Количество + Количество_Р;
		
		ОтборСтроки = Новый Структура("Помещение", СтрокаЗарплатаПомещения.Помещение);
		НайденныеСтроки = ПомещенияСправочник.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли; 
	
		СтрокаПомещенияСправочник = НайденныеСтроки[0];
		Номер = СтрокаПомещенияСправочник.Номер;
		
		Имя = "Количество_" + Строка(Номер);
		Строка[Имя] = Количество;                     
		Имя = "Количество_" + Строка(Номер) + "_Р";
		Строка[Имя] = Количество_Р;
		Имя = "Количество_" + Строка(Номер) + "_Э";
		Строка[Имя] = Количество_Э;
		
		Имя = "ПомещениеЦена_" + Строка(Номер);
		Цена =  ЭтаФорма[Имя];
		
		Имя = "Сумма_" + Строка(Номер);
		Строка[Имя] = Количество_Э * Цена;
		
		СуммаИтого = СуммаИтого + Строка[Имя];
	КонецЦикла;
	Строка.СуммаИтого = СуммаИтого;
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммаПомещения(ТД)
ТД.СуммаПомещения = СуммаПомещения(ТД);
КонецПроцедуры

&НаСервере
Функция СуммаУборки(ТД)
СуммаУборки = ТД.Г_Сумма + ТД.Т_Сумма + ТД.ТС_Сумма + ТД.РК_Сумма + ТД.МК_Сумма + ТД.МДМ_Сумма; 	

Возврат СуммаУборки;
КонецФункции

&НаСервере
Функция СуммаПомещения(ТД)
СуммаПомещения = 0;	
	
ОтборСтроки = Новый Структура("Горничная", ТД.Горничная);
НайденныеСтроки = ПомещенияУборки.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда
	СуммаПомещения = НайденныеСтроки[0].СуммаИтого;
КонецЕсли;

Возврат СуммаПомещения;
КонецФункции

&НаСервере
Процедура ОбновитьЗарплатаИтого(ТД)
ЗарплатаИтого = ТД.Оклад_Э + ТД.Отпуск_Э + ТД.НадбавкаЗаСтаж_Э + ТД.НадбавкаЗаСтандарты_Э 
	+ ТД.Больничный + ТД.Премия 
	+ ТД.Г_Сумма + ТД.Т_Сумма + ТД.ТС_Сумма + ТД.РК_Сумма + ТД.МК_Сумма + ТД.МДМ_Сумма
	+ ТД.ДопРаботы 
	+ ТД.Сдельно_Э
	+ ТД.КорректировкаДопНачислено
	;
	
ЗарплатаИтого = ЗарплатаИтого + ТД.СуммаПомещения;

ТД.Итого = ЗарплатаИтого;

ТД.ЗарплатаИтого = ЗарплатаИтого + ТД.СуммаПрачечная_Э;

Выдано = ТД.Аванс_кк + ТД.Аванс_нал +  ТД.Зарплата_кк 
	+  ТД.Отпуск_кк +  ТД.Отпуск_нал
	+  ТД.Сдельно_нал_Э +  ТД.ИныеВыплаты_нал; 
	
ТД.ОстатокКВыдаче = ТД.ЗарплатаИтого - Выдано;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗарплатаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ТС = Элемент.ТекущаяСтрока;	
ЗарплатаПриОкончанииРедактированияНаСервере(ТС);
КонецПроцедуры

&НаСервере
Процедура ЗарплатаПриОкончанииРедактированияНаСервере(ТС)
ТД = Объект.Зарплата.НайтиПоИдентификатору(ТС);

ОбновитьСтрокаСуммы(ТД);

ОбновитьСуммаУборки(ТД);

ОбновитьЗарплатаИтого(ТД);
КонецПроцедуры
//



//
&НаКлиенте
Процедура ЗарплатаЭлемент_ПриИзменении(Элемент, ЭтоЗамена, ЭтоКоличество)
ТС = Элемент.Родитель.ТекущаяСтрока;		
ТД = Объект.Зарплата.НайтиПоИдентификатору(ТС);
//Зарплата
//123456789
ИмяЭлемента = Сред(Элемент.Имя, 9);
Индекс = СтрНайти(ИмяЭлемента, "_Э");
ИмяРеквизита = Сред(ИмяЭлемента, 1, Индекс - 1);  

Если ЭтоЗамена Тогда
	ТД[ИмяРеквизита + "_Р"] = ТД[ИмяРеквизита + "_Э"];
	ТД[ИмяРеквизита + "_Есть"] = Истина;
Иначе
	ТД[ИмяРеквизита + "_Р"] = ТД[ИмяРеквизита + "_Э"] - ТД[ИмяРеквизита];
КонецЕсли;

Если ЭтоКоличество Тогда
	Индекс = СтрНайти(ИмяЭлемента, "_");
	ИмяПоля = Сред(ИмяЭлемента, 1, Индекс);
	ИмяСумма = ИмяПоля + "Сумма";  
	ИмяЦена = ИмяПоля + "Цена";  
	
	//ТД[ИмяСумма] = ТД[ИмяРеквизита + "_Э"] * ЭтаФорма[ИмяЦена];
	ТД[ИмяСумма] = ТД[ИмяРеквизита + "_Э"] * Объект[ИмяЦена];
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаОклад_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Истина, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаОтпуск_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Истина, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаНадбавкаЗаСтаж_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Истина, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаНадбавкаЗаСтандарты_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Истина, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаГ_Количество_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаТ_Количество_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаТС_Количество_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаРК_Количество_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаМК_Количество_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаМДМ_Количество_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСуммаПрачечная_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаКоличествоСмен_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Истина, Ложь);

ТС = Элемент.Родитель.ТекущаяСтрока;		
ТД = Объект.Зарплата.НайтиПоИдентификатору(ТС);
ТД.КоличествоЧасов = КоличествоЧасовНаКлиенте(ТД, ТД.КоличествоСмен_Э); 

КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСдельно_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСдельно_нал_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаКоличествоЧасов_ЭПриИзменении(Элемент)
ЗарплатаЭлемент_ПриИзменении(Элемент, Истина, Ложь);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗарплатаЭлементОчистка(Элемент, ЭтоЗамена, ЭтоКоличество)
ТС = Элемент.Родитель.ТекущаяСтрока;		
ТД = Объект.Зарплата.НайтиПоИдентификатору(ТС);

//Зарплата
//123456789
ИмяЭлемента = Сред(Элемент.Имя, 9);
Индекс = СтрНайти(ИмяЭлемента, "_Э");
ИмяРеквизита = Сред(ИмяЭлемента, 1, Индекс - 1);  

Если ЭтоЗамена Тогда
	Имя = ИмяРеквизита + "_Р";
	ТД[Имя] = 0;
	Имя = ИмяРеквизита + "_Есть";
	ТД[Имя] = Ложь;
Иначе
	Имя = ИмяРеквизита + "_Р";
	ТД[Имя] = 0;
КонецЕсли;	
Имя = ИмяРеквизита + "_Э";
ТД[Имя] = ТД[ИмяРеквизита];

Если ЭтоКоличество Тогда
	Индекс = СтрНайти(ИмяЭлемента, "_");
	ИмяПоля = Сред(ИмяЭлемента, 1, Индекс);
	ИмяСумма = ИмяПоля + "Сумма";  
	ИмяЦена = ИмяПоля + "Цена";  
	
	//ТД[ИмяСумма] = ТД[ИмяРеквизита + "_Э"] * ЭтаФорма[ИмяЦена];
	ТД[ИмяСумма] = ТД[ИмяРеквизита + "_Э"] * Объект[ИмяЦена];
КонецЕсли;

Элементы.Зарплата.ЗакончитьРедактированиеСтроки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаОклад_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаОтпуск_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаНадбавкаЗаСтаж_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаНадбавкаЗаСтандарты_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаГ_Количество_ЭОчистка(Элемент, СтандартнаяОбработка)
//СтандартнаяОбработка = Ложь;	
ЗарплатаЭлементОчистка(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаТ_Количество_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаТС_Количество_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаРК_Количество_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаМК_Количество_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаМДМ_Количество_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСуммаПрачечная_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаКоличествоСмен_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСдельно_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСдельно_нал_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаКоличествоЧасов_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаЭлементОчистка(Элемент, Истина, Ложь);
КонецПроцедуры

//


////

//
&НаКлиенте
Процедура ПомещенияУборкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ТД = Элемент.ТекущиеДанные;

СуммаИтого = 0;
Для Каждого Строка Из ПомещенияСправочник Цикл	
	Имя = "Количество_" + Строка(Строка.Номер);
	Количество = ТД[Имя];
	Имя = "Количество_" + Строка(Строка.Номер) + "_Р";
	Количество_Р = ТД[Имя];
	Имя = "Количество_" + Строка(Строка.Номер) + "_Э";
	Количество_Э = ТД[Имя];
	
	Имя = "ПомещениеЦена_" + Строка(Строка.Номер);
	Цена = ЭтаФорма[Имя];
	
	ОтборСтроки = Новый Структура("Горничная, Помещение", ТД.Горничная, Строка.Помещение);
	НайденныеСтроки = Объект.ЗарплатаПомещения.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаЗарплатаПомещения = Объект.ЗарплатаПомещения.Добавить();
		СтрокаЗарплатаПомещения.Горничная = ТД.Горничная;
		СтрокаЗарплатаПомещения.Помещение = Строка.Помещение;
	Иначе	
		СтрокаЗарплатаПомещения = НайденныеСтроки[0];
	КонецЕсли;
	СтрокаЗарплатаПомещения.Количество = Количество;			
	СтрокаЗарплатаПомещения.Количество_Р = Количество_Р;			
	
	СуммаИтого = СуммаИтого + Количество_Э * Цена;
КонецЦикла;
	
ТД.СуммаИтого = СуммаИтого;	

ОбновитьСтрокаЗарплата(ТД.Горничная, СуммаИтого);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокаЗарплата(Горничная, СуммаИтого)
ОтборСтроки = Новый Структура("Горничная", Горничная);	
НайденныеСтроки = Объект.Зарплата.НайтиСтроки(ОтборСтроки);	

Строка = НайденныеСтроки[0];
Строка.СуммаПомещения = СуммаИтого;

ОбновитьЗарплатаИтого(Строка);
КонецПроцедуры	
	
&НаКлиенте
Процедура ПомещенияУборкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияУборкиПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ПомещенияУборкиЭлемент_ПриИзменении(Элемент)
ТС = Элемент.Родитель.ТекущаяСтрока;		
ТД = ПомещенияУборки.НайтиПоИдентификатору(ТС);

ИмяЭлемента = Элемент.Имя;
Индекс = СтрНайти(ИмяЭлемента, "_Э", НаправлениеПоиска.СКонца);
ИмяРеквизита = Сред(ИмяЭлемента, 1, Индекс - 1);

ТД[ИмяРеквизита + "_Р"] = ТД[ИмяРеквизита + "_Э"] - ТД[ИмяРеквизита];

Индекс = СтрНайти(ИмяРеквизита, "_");
НомерРеквизита = Сред(ИмяРеквизита, Индекс);

ИмяСумма = "Сумма" + НомерРеквизита;

ИмяЦена = "ПомещениеЦена" + НомерРеквизита; 
Цена =  ЭтаФорма[ИмяЦена];

ТД[ИмяСумма] = ТД[ИмяРеквизита + "_Э"] * Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияУборкиЭлемент_Очистка(Элемент)
ТС = Элемент.Родитель.ТекущаяСтрока;		
ТД = ПомещенияУборки.НайтиПоИдентификатору(ТС);

ИмяЭлемента = Элемент.Имя;
Индекс = СтрНайти(ИмяЭлемента, "_Э", НаправлениеПоиска.СКонца);
ИмяРеквизита = Сред(ИмяЭлемента, 1, Индекс - 1);
	
Имя = ИмяРеквизита + "_Р";
ТД[Имя] = 0;

Имя = ИмяРеквизита + "_Э";
ТД[Имя] = ТД[ИмяРеквизита];

Индекс = СтрНайти(ИмяРеквизита, "_");
НомерРеквизита = Сред(ИмяРеквизита, Индекс);

ИмяСумма = "Сумма" + НомерРеквизита;

ИмяЦена = "ПомещениеЦена" + НомерРеквизита; 
Цена =  ЭтаФорма[ИмяЦена];

ТД[ИмяСумма] = ТД[ИмяРеквизита + "_Э"] * Цена;

Элементы.ПомещенияУборки.ЗакончитьРедактированиеСтроки(Ложь);
КонецПроцедуры
//

//

//
&НаКлиенте
Процедура СдельноГорничнаяОтборПриИзменении(Элемент)
УстановитьСдельноОтбор();
КонецПроцедуры

&НаКлиенте
Процедура СдельноДатаОтборПриИзменении(Элемент)
УстановитьСдельноОтбор();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСдельноОтбор()
ОтборСтрок = Новый Структура;
Если ЗначениеЗаполнено(СдельноГорничнаяОтбор) Тогда
	ОтборСтрок.Вставить("Горничная", СдельноГорничнаяОтбор);
КонецЕсли;

Если ЗначениеЗаполнено(СдельноДатаОтбор) Тогда
	ОтборСтрок.Вставить("Дата", СдельноДатаОтбор);
КонецЕсли;

Если ОтборСтрок.Количество() = 0 Тогда
	Элементы.Сдельно.ОтборСтрок = Неопределено;
Иначе
	Элементы.Сдельно.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
КонецЕсли;	
КонецПроцедуры
//

&НаКлиенте
Процедура СдельноВыходПриИзменении(Элемент)
ТД = Элемент.Родитель.ТекущиеДанные;
	
	
Если ТД.Выход Тогда
	ТД.СуммаВыход = СдельноВыход;
Иначе
	ТД.СуммаВыход = 0;
КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СдельноПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
ТД = Элемент.ТекущиеДанные;
СдельноГорничная_OldValue = ТД.Горничная;
СдельноДата_OldValue = ТД.Дата;
СдельноИтого_OldValue = ТД.Итого;
СдельноВыплаты_OldValue = ТД.ВыплатыСумма;

//Если ТД.Выход Тогда	
//	ТД.СуммаВыход = СдельноВыход;
//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СдельноПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ТД = Элемент.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ТС = Элемент.ТекущаяСтрока;

Текст = "";
Если НЕ ЗначениеЗаполнено(ТД.Горничная) Тогда
	Текст = ОбщийФункционалКлиентСервер.ДобавитьТекст(Текст, "Горничная должна быть заполнена.", Символы.ПС);
КонецЕсли;	
Если НЕ ЗначениеЗаполнено(ТД.Дата) Тогда
	Текст = ОбщийФункционалКлиентСервер.ДобавитьТекст(Текст, "Дата должна быть заполнена.", Символы.ПС);
КонецЕсли;	

Если Текст <> "" Тогда
	ПоказатьПредупреждение(,Текст);	
КонецЕсли;

ОбновитьСдельноСтрокаИзКлиента(ТС);
			
ГорничнаяСдельноИтогоДействие(ТД);	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСдельноСтрокаИзКлиента(ТС)
ТД = Объект.Сдельно.НайтиПоИдентификатору(ТС);	

ОбновитьСдельноСтрока(ТД);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСдельноСтрока(ТД)
ТД.Выход = ТД.СуммаВыход <> 0;	

ТД.Итого = СдельноИтого(ТД);
КонецПроцедуры			

&НаСервере
Функция СдельноИтого(ТД)
Если НЕ (ЗначениеЗаполнено(ТД.Горничная) И ЗначениеЗаполнено(ТД.Дата)) Тогда
	Возврат 0;
КонецЕсли;

Итого = ТД.Г_Сумма + ТД.Т_Сумма + ТД.ТС_Сумма + ТД.МК_Сумма + ТД.МДМ_Сумма + ТД.СуммаВыход       
			+ ТД.ПоСтавке + ТД.ПоЧасамСумма + ТД.ВечерУтро + ТД.Корректировка;
			
Возврат Итого;			
КонецФункции	

&НаКлиенте		
Процедура ГорничнаяСдельноИтогоДействие(ТД)
Если ЗначениеЗаполнено(ТД.Горничная) Тогда
	ОтборСтроки = Новый Структура("Горничная", ТД.Горничная);	
	НайденныеСтроки = Объект.Сдельно.НайтиСтроки(ОтборСтроки);
	ГорничнаяСдельноИтого = 0;
	ВыплатыИтого = 0;
	Для Каждого Строка Из НайденныеСтроки Цикл
		ГорничнаяСдельноИтого = ГорничнаяСдельноИтого + Строка.Итого; 		
		ВыплатыИтого = ВыплатыИтого + Строка.ВыплатыСумма; 		
	КонецЦикла;

	НайденныеСтрокиЗарплата = Объект.Зарплата.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтрокиЗарплата.Количество() > 0 Тогда 
		НайденнаяСтрокаЗарплата = НайденныеСтрокиЗарплата[0];
		НайденнаяСтрокаЗарплата.Сдельно = ГорничнаяСдельноИтого;
		НайденнаяСтрокаЗарплата.Сдельно_нал = ВыплатыИтого;
	КонецЕсли;
Иначе	
	ОтборСтроки = Новый Структура("Горничная", СдельноГорничная_OldValue);
	НайденныеСтрокиЗарплата = Объект.Зарплата.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтрокиЗарплата.Количество() > 0 Тогда 
		НайденнаяСтрокаЗарплата = НайденныеСтрокиЗарплата[0];
		НайденнаяСтрокаЗарплата.Сдельно = НайденнаяСтрокаЗарплата.Сдельно - СдельноИтого_OldValue;
		НайденнаяСтрокаЗарплата.Сдельно_нал = НайденнаяСтрокаЗарплата.Сдельно_нал - СдельноВыплаты_OldValue;
	КонецЕсли;
КонецЕсли;

Если НайденныеСтрокиЗарплата.Количество() > 0 Тогда 
	Если НЕ НайденнаяСтрокаЗарплата.Сдельно_Есть Тогда
		НайденнаяСтрокаЗарплата.Сдельно_Э = НайденнаяСтрокаЗарплата.Сдельно;
	КонецЕсли;

	Если НЕ НайденнаяСтрокаЗарплата.Сдельно_нал_Есть Тогда
		НайденнаяСтрокаЗарплата.Сдельно_нал_Э = НайденнаяСтрокаЗарплата.Сдельно_нал;
	КонецЕсли;
	
	Идентификатор = НайденнаяСтрокаЗарплата.ПолучитьИдентификатор();
	ОбновитьЗарплатаИтогоИзКлиента(Идентификатор);
КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗарплатаИтогоИзКлиента(Идентификатор)
ТД = Объект.Зарплата.НайтиПоИдентификатору(Идентификатор);	
ОбновитьЗарплатаИтого(ТД);
КонецПроцедуры	

&НаКлиенте
Процедура СдельноПередУдалением(Элемент, Отказ)
ТД = Элемент.ТекущиеДанные;

ОтборСтроки = Новый Структура("Горничная", ТД.Горничная);	
НайденныеСтроки = Объект.Зарплата.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда 
	НайденнаяСтрока = НайденныеСтроки[0];
	
	Если НЕ НайденнаяСтрока.Сдельно_Есть Тогда
		НайденнаяСтрока.Сдельно = НайденнаяСтрока.Сдельно - ТД.Итого;
		НайденнаяСтрока.Сдельно_Э = НайденнаяСтрока.Сдельно;
	КонецЕсли;
	
	Если НЕ НайденнаяСтрока.Сдельно_нал_Есть Тогда
		НайденнаяСтрока.Сдельно_нал = НайденнаяСтрока.Сдельно_нал - ТД.ВыплатыСумма;
		НайденнаяСтрока.Сдельно_нал_Э = НайденнаяСтрока.Сдельно_нал;
	КонецЕсли;
	
	Идентификатор = НайденнаяСтрока.ПолучитьИдентификатор();
	ОбновитьЗарплатаИтогоИзКлиента(Идентификатор);
КонецЕсли;
КонецПроцедуры
//

&НаКлиенте
Процедура СдельноДатаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

//
&НаКлиенте
Процедура СдельноГ_КоличествоПриИзменении(Элемент)
ТД = Элемент.Родитель.Родитель.ТекущиеДанные;
ТД.Г_Сумма = ТД.Г_Количество * СдельноГ_Цена;
КонецПроцедуры

&НаКлиенте
Процедура СдельноТ_КоличествоПриИзменении(Элемент)
ТД = Элемент.Родитель.Родитель.ТекущиеДанные;
ТД.Т_Сумма = ТД.Т_Количество * СдельноТ_Цена;
КонецПроцедуры

&НаКлиенте
Процедура СдельноТС_КоличествоПриИзменении(Элемент)
ТД = Элемент.Родитель.Родитель.ТекущиеДанные;
ТД.ТС_Сумма = ТД.ТС_Количество * СдельноТС_Цена;
КонецПроцедуры

&НаКлиенте
Процедура СдельноМК_КоличествоПриИзменении(Элемент)
ТД = Элемент.Родитель.Родитель.ТекущиеДанные;
ТД.МК_Сумма = ТД.МК_Количество * СдельноМК_Цена;
КонецПроцедуры

&НаКлиенте
Процедура СдельноМДМ_КоличествоПриИзменении(Элемент)
ТД = Элемент.Родитель.Родитель.ТекущиеДанные;
ТД.МДМ_Сумма = ТД.МДМ_Количество * СдельноМДМ_Цена;
КонецПроцедуры
//

&НаКлиенте
Процедура СдельноПоЧасамКоличествоПриИзменении(Элемент)
ТД = Элемент.Родитель.ТекущиеДанные;
ТД.ПоЧасамСумма = ТД.ПоЧасамКоличество * СдельноПоЧасам_Цена;
КонецПроцедуры


//
&НаКлиенте
Процедура ОчиститьОсновныеДанные(Команда)
ОчиститьОсновныеДанныеДействие();

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОсновныеДанныеДействие()
Для Каждого Строка Из Объект.Зарплата Цикл	
	Строка.Оклад_Р = 0; Строка.Оклад_Есть = Ложь;
	Строка.Отпуск_Р = 0; Строка.Отпуск_Есть = Ложь; 
	Строка.НадбавкаЗаСтаж_Р = 0; Строка.НадбавкаЗаСтаж_Есть = Ложь; 
	Строка.НадбавкаЗаСтандарты_Р = 0; Строка.НадбавкаЗаСтандарты_Есть = Ложь; 
	Строка.СуммаПрачечная_Р = 0; Строка.СуммаПрачечная_Есть = Ложь; 
КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУборки(Команда)
ОчиститьУборкиДействие();

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУборкиДействие()
Для Каждого Строка Из Объект.Зарплата Цикл	
	Строка.Г_Количество_Р = 0; 
	Строка.Т_Количество_Р = 0; 
	Строка.ТС_Количество_Р = 0;
	Строка.РК_Количество_Р = 0;
	Строка.МК_Количество_Р = 0;
	Строка.МДМ_Количество_Р = 0;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПомещения(Команда)
ОчиститьПомещенияДействие();

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПомещенияДействие()
Для Каждого Строка Из ПомещенияУборки Цикл	
	Для Каждого СтрокаПомещения Из ПомещенияСправочник Цикл	
		Имя = "Количество_" + СтрокаПомещения.Номер + "_Р";
		Строка[Имя]	= 0;	
	КонецЦикла;	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчитститьВсеДанные(Команда)
ОчиститьОсновныеДанныеДействие();	
ОчиститьУборкиДействие();
ОчиститьПомещенияДействие();

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры
//

////
&НаКлиенте
Процедура ОтчетЗарплата(Команда)
ТабДок = ОтчетЗарплатаНаСервере();

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Зарплаты горничных"); 
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ,Истина);
КонецПроцедуры

&НаСервере
Функция ОтчетЗарплатаНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Документы.ГорничныеЗарплата.ПолучитьМакет("Макет");	

Область = Макет.ПолучитьОбласть("Заголовок");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка|Лево");
Если НастройкиСервер.ЭтоСтритАрт() Тогда
	Область.Параметры.Оклад = "Оклад \ коворкинг";
Иначе
	Область.Параметры.Оклад = "Оклад";
КонецЕсли;

ТабДок.Вывести(Область);

//Для Каждого Строка Из ПомещенияСправочник Цикл
//	ОбластьПомещение = Макет.ПолучитьОбласть("Шапка|Помещение");
//	ОбластьПомещение.Параметры.ПомещениеКоличество = "Кол-во " + Строка.Помещение;
//	ОбластьПомещение.Параметры.ПомещениеСумма = "Сумма " + Строка.Помещение;
//	
//	ТабДок.Присоединить(ОбластьПомещение);
//КонецЦикла;

Зарплата = Объект.Зарплата;
Для Каждого Строка Из Зарплата Цикл
	Область = Макет.ПолучитьОбласть("Строка|Лево");
	
	Область.Параметры.Горничная = Строка.Горничная;
	Область.Параметры.Оклад = Строка.Оклад_Э;
	Область.Параметры.НадбавкаЗаСтаж = Строка.НадбавкаЗаСтаж_Э;
	Область.Параметры.НадбавкаЗаСтандарты = Строка.НадбавкаЗаСтандарты_Э;
	
	Область.Параметры.Отпуск = Строка.Отпуск_Э;
	Область.Параметры.Больничный = Строка.Больничный;
	Область.Параметры.Премия = Строка.Премия;
	
	Область.Параметры.ДопРаботы = Строка.ДопРаботы;
	Область.Параметры.Сдельно = Строка.Сдельно;
	
	Область.Параметры.КорректировкаДопНачислено = Строка.КорректировкаДопНачислено;      
	
	Область.Параметры.СуммаПрачечная = Строка.СуммаПрачечная_Э;
	
	Область.Параметры.СуммаУборки = Строка.СуммаУборки;
	Область.Параметры.СуммаПомещения = Строка.СуммаПомещения;
	
	Область.Параметры.Итого = Строка.Итого;      
	Область.Параметры.ЗарплатаИтого = Строка.ЗарплатаИтого;      
	
	Область.Параметры.Аванс_кк = Строка.Аванс_кк;      
	Область.Параметры.Аванс_нал = Строка.Аванс_нал;      
	Область.Параметры.Зарплата_кк = Строка.Зарплата_кк;      
	Область.Параметры.Отпуск_кк = Строка.Отпуск_кк;      
	Область.Параметры.Отпуск_нал = Строка.Отпуск_нал;      
	Область.Параметры.Сдельно_нал = Строка.Сдельно_нал_Э;      
	Область.Параметры.ИныеВыплаты_нал = Строка.ИныеВыплаты_нал;      
	
	Выдано =  Строка.Аванс_кк + Строка.Аванс_нал + Строка.Зарплата_кк 
		+ Строка.Отпуск_кк + Строка.Отпуск_нал 
		+ Строка.Сдельно_нал_Э + Строка.ИныеВыплаты_нал; 
	ОстатокКВыдаче = Строка.ЗарплатаИтого - Выдано;     
	Область.Параметры.ОстатокКВыдаче = ОстатокКВыдаче;   
	
	Область.Параметры.СуммаМинимум = Строка.СуммаМинимум;      
	Область.Параметры.КоличествоСмен = Строка.КоличествоСмен_Э;      
	Область.Параметры.КоличествоЧасов = Строка.КоличествоЧасов_Э;      
	
	ТабДок.Вывести(Область);
	
	////
	//Для Каждого СтрокаПомещение Из ПомещенияСправочник Цикл
	//	ОбластьПомещение = Макет.ПолучитьОбласть("Строка|Помещение");
	//	
	//	ОтборСтроки = Новый Структура("Горничная, Помещение", Строка.Горничная, СтрокаПомещение.Помещение);
	//	НайденныеСтроки = Объект.ЗарплатаПомещения.НайтиСтроки(ОтборСтроки);
	//	Если НайденныеСтроки.Количество() > 0 Тогда
	//		НайденнаяСтрока = НайденныеСтроки[0];
	//	
	//		ОбластьПомещение.Параметры.Помещение_Количество = НайденнаяСтрока.Количество;
	//		ОбластьПомещение.Параметры.Помещение_Сумма = НайденнаяСтрока.Цена * НайденнаяСтрока.Количество;
	//	КонецЕсли;
	//	
	//	ТабДок.Присоединить(ОбластьПомещение);
	//КонецЦикла;	
	////
КонецЦикла;

Область = Макет.ПолучитьОбласть("Итоги|Лево");

//Оклад = Строка.Оклад_Э;
Оклад = Зарплата.Итог("Оклад_Э");
//НадбавкаЗаСтаж = Строка.НадбавкаЗаСтаж_Э;
НадбавкаЗаСтаж = Зарплата.Итог("НадбавкаЗаСтаж_Э");
//НадбавкаЗаСтандарты = Строка.НадбавкаЗаСтандарты_Э;
НадбавкаЗаСтандарты = Зарплата.Итог("НадбавкаЗаСтандарты_Э");

//Отпуск = Строка.Отпуск_Э;
Отпуск = Зарплата.Итог("Отпуск_Э");
//Больничный = Строка.Больничный;
Больничный = Зарплата.Итог("Больничный");
//Премия = Строка.Премия;
Премия = Зарплата.Итог("Премия");

//ДопРаботы = Строка.ДопРаботы;
ДопРаботы = Зарплата.Итог("ДопРаботы");
//Сдельно = Строка.Сдельно;
Сдельно = Зарплата.Итог("Сдельно");

//КорректировкаДопНачислено = Строка.КорректировкаДопНачислено;      
КорректировкаДопНачислено = Зарплата.Итог("КорректировкаДопНачислено");

//СуммаПрачечная = Строка.СуммаПрачечная_Э;
СуммаПрачечная = Зарплата.Итог("СуммаПрачечная_Э");

//СуммаУборки = Строка.СуммаУборки;
СуммаУборки = Зарплата.Итог("СуммаУборки");
//СуммаПомещения = Строка.СуммаПомещения;
СуммаПомещения = Зарплата.Итог("СуммаПомещения");

//Итого = Строка.Итого;      
Итого = Зарплата.Итог("Итого");
//ЗарплатаИтого = Строка.ЗарплатаИтого;      
ЗарплатаИтого = Зарплата.Итог("ЗарплатаИтого");

//Аванс_кк = Строка.Аванс_кк;      
Аванс_кк = Зарплата.Итог("Аванс_кк");
//Аванс_нал = Строка.Аванс_нал;      
Аванс_нал = Зарплата.Итог("Аванс_нал");
//Зарплата_кк = Строка.Зарплата_кк;      
Зарплата_кк = Зарплата.Итог("Зарплата_кк");
//Отпуск_кк = Строка.Отпуск_кк;      
Отпуск_кк = Зарплата.Итог("Отпуск_кк");
//Отпуск_нал = Строка.Отпуск_нал;      
Отпуск_нал = Зарплата.Итог("Отпуск_нал");
//Сдельно_нал = Строка.Сдельно_нал_Э;      
Сдельно_нал = Зарплата.Итог("Сдельно_нал_Э");
//ИныеВыплаты_нал = Строка.ИныеВыплаты_нал;      
ИныеВыплаты_нал = Зарплата.Итог("ИныеВыплаты_нал");

Выдано =  Аванс_кк + Аванс_нал + Зарплата_кк 
	+ Отпуск_кк + Отпуск_нал 
	+ Сдельно_нал + ИныеВыплаты_нал; 
	
ОстатокКВыдаче = ЗарплатаИтого - Выдано;     

СуммаМинимум = Зарплата.Итог("СуммаМинимум");
КоличествоСмен = Зарплата.Итог("КоличествоСмен_Э");
КоличествоЧасов = Зарплата.Итог("КоличествоЧасов_Э");

Область.Параметры.Оклад = Оклад;
Область.Параметры.НадбавкаЗаСтаж = НадбавкаЗаСтаж;
Область.Параметры.НадбавкаЗаСтандарты = НадбавкаЗаСтандарты;

Область.Параметры.Отпуск = Отпуск;
Область.Параметры.Больничный = Больничный;
Область.Параметры.Премия = Премия;

Область.Параметры.ДопРаботы = ДопРаботы;
Область.Параметры.Сдельно = Сдельно;

Область.Параметры.КорректировкаДопНачислено = КорректировкаДопНачислено;      

Область.Параметры.СуммаПрачечная = СуммаПрачечная;

Область.Параметры.СуммаУборки = СуммаУборки;
Область.Параметры.СуммаПомещения = СуммаПомещения;

Область.Параметры.Итого = Итого;      
Область.Параметры.ЗарплатаИтого = ЗарплатаИтого;      

Область.Параметры.Аванс_кк = Аванс_кк;      
Область.Параметры.Аванс_нал = Аванс_нал;      
Область.Параметры.Зарплата_кк = Зарплата_кк;      
Область.Параметры.Отпуск_кк = Отпуск_кк;      
Область.Параметры.Отпуск_нал = Отпуск_нал;      
Область.Параметры.Сдельно_нал = Сдельно_нал;      
Область.Параметры.ИныеВыплаты_нал = ИныеВыплаты_нал;      

Область.Параметры.ОстатокКВыдаче = ОстатокКВыдаче;      

Область.Параметры.СуммаМинимум = СуммаМинимум;  
Область.Параметры.КоличествоСмен = КоличествоСмен;  
Область.Параметры.КоличествоЧасов = КоличествоЧасов;  

ТабДок.Вывести(Область);

ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

Возврат ТабДок;
КонецФункции
//

// 
&НаКлиенте
Процедура ОтчетЗарплатаОбщий(Команда)
ТабДок = ОтчетЗарплатаОбщийНаСервере();

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Зарплаты горничных с "
							+ Формат(Объект.ДН, "ДФ=dd.MM.yy") + " по " + Формат(Объект.ДК, "ДФ=dd.MM.yy"));
							
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ,Истина);	
КонецПроцедуры

&НаСервере
Функция ОтчетЗарплатаОбщийНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = ПолучитьОбщийМакет("МакетЗарплатаОбщий");	

//Область = Макет.ПолучитьОбласть("Заголовок");
//ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
Если НастройкиСервер.ЭтоСтритАрт() Тогда
	Область.Параметры.Оклад = "Оклад \ коворкинг";
Иначе
	Область.Параметры.Оклад = "Оклад";
КонецЕсли;

ТабДок.Вывести(Область);

Зарплата = Объект.Зарплата;
Для Каждого Строка Из Зарплата Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.Сотрудник = Строка.Горничная;
	Область.Параметры.ТипДолжности = Строка.Горничная.Должность.ТипДолжности;
	Область.Параметры.Должность = Строка.Горничная.Должность;
	
	Область.Параметры.КоличествоСмен = Строка.КоличествоСмен_Э;
	КоличествоЧасовОтчет = Строка.КоличествоЧасов;
	Область.Параметры.КоличествоЧасовОтчет = КоличествоЧасовОтчет;
	
	Область.Параметры.Оклад = Строка.Оклад_Э;
	Область.Параметры.НадбавкаЗаСтаж = Строка.НадбавкаЗаСтаж_Э;
	Область.Параметры.НадбавкаЗаСтандарты = Строка.НадбавкаЗаСтандарты_Э;
	
	Область.Параметры.Отпуск = Строка.Отпуск_Э;
	Область.Параметры.Больничный = Строка.Больничный;
	Область.Параметры.Премия = Строка.Премия;
	
	Область.Параметры.ДопРаботы = Строка.ДопРаботы;
	Область.Параметры.Сдельно = Строка.Сдельно;
	
	Область.Параметры.КорректировкаДопНачислено = Строка.КорректировкаДопНачислено;      
	
	Область.Параметры.СуммаПрачечная = Строка.СуммаПрачечная_Э;
	
	Область.Параметры.СуммаУборки = Строка.СуммаУборки;
	Область.Параметры.СуммаПомещения = Строка.СуммаПомещения;
	
	Область.Параметры.Итого = Строка.Итого;      
	Область.Параметры.ЗарплатаИтого = Строка.ЗарплатаИтого;      
	
	Область.Параметры.Аванс_кк = Строка.Аванс_кк;      
	Область.Параметры.Аванс_нал = Строка.Аванс_нал;      
	Область.Параметры.Зарплата_кк = Строка.Зарплата_кк;      
	Область.Параметры.Отпуск_кк = Строка.Отпуск_кк;      
	Область.Параметры.Отпуск_нал = Строка.Отпуск_нал;      
	Область.Параметры.Сдельно_нал = Строка.Сдельно_нал_Э;      
	Область.Параметры.ИныеВыплаты_нал = Строка.ИныеВыплаты_нал;      
	
	Выдано =  Строка.Аванс_кк + Строка.Аванс_нал + Строка.Зарплата_кк 
		+ Строка.Отпуск_кк + Строка.Отпуск_нал 
		+ Строка.Сдельно_нал_Э + Строка.ИныеВыплаты_нал; 
	ОстатокКВыдаче = Строка.ЗарплатаИтого - Выдано;     
	Область.Параметры.ОстатокКВыдаче = ОстатокКВыдаче;      
	
	Область.Параметры.СуммаМинимум = Строка.СуммаМинимум;      
	
	ТабДок.Вывести(Область);
КонецЦикла;

ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

Возврат ТабДок;
КонецФункции

////

//
&НаКлиенте
Процедура КвитокПечать(Команда)
ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 	
	
ТД = Элементы.Зарплата.ТекущиеДанные;	
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ТС = Элементы.Зарплата.ТекущаяСтрока;	

ТабДок = КвитокПечатьНаСервере(ТС);

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Квиток " + ТД.Горничная); 
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ,Истина);
КонецПроцедуры

&НаСервере
Функция КвитокПечатьНаСервере(ТС)
ТабДок = Новый ТабличныйДокумент;
	
ТД = Объект.Зарплата.НайтиПоИдентификатору(ТС);

Макет = Документы.ГорничныеЗарплата.ПолучитьМакет("МакетКвиток");

Область = Макет.ПолучитьОбласть("Шапка");
Область.Параметры.Горничная = ТД.Горничная;

ТабДок.Вывести(Область);
Область.Параметры.Горничная = ТД.Горничная;

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Количество смен";
Область.Параметры.Количество  = ТД.КоличествоСмен_Э;
//Область.Параметры.Сумма  = ТД.
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Генеральные";
Область.Параметры.Количество  = ТД.Г_Количество_Э;
Область.Параметры.Сумма  = ТД.Г_Сумма;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Текущие";
Область.Параметры.Количество  = ТД.Т_Количество_Э;
Область.Параметры.Сумма  = ТД.Т_Сумма;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Текущие со сменой";
Область.Параметры.Количество  = ТД.ТС_Количество_Э;
Область.Параметры.Сумма  = ТД.ТС_Сумма;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "МК";
Область.Параметры.Количество  = ТД.МК_Количество_Э;
Область.Параметры.Сумма  = ТД.МК_Сумма;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "МДМ";
Область.Параметры.Количество  = ТД.МДМ_Количество_Э;
Область.Параметры.Сумма  = ТД.МДМ_Сумма;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Оклад";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Оклад_Э;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Отпуск";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Отпуск_Э;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Стаж";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.НадбавкаЗаСтаж_Э;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Стандарты";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.НадбавкаЗаСтандарты_Э;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Больничный";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Больничный;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Премия";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Премия;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Доп. работы";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.ДопРаботы;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
ТабДок.Вывести(Область);

ОтборСтроки = Новый Структура("Горничная", ТД.Горничная); 
НайденныеСтроки = Объект.ЗарплатаПомещения.НайтиСтроки(ОтборСтроки);

Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.Наименование = НайденнаяСтрока.Помещение;
	
	Количество_П = НайденнаяСтрока.Количество + НайденнаяСтрока.Количество_Р;
	Область.Параметры.Количество  = Количество_П;
	
	ОтборСтрокиПомещенияЦена = Новый Структура("Помещение", НайденнаяСтрока.Помещение); 
	НайденныеСтрокиПомещенияЦена = ПомещенияЦена.НайтиСтроки(ОтборСтрокиПомещенияЦена);
	Если НайденныеСтрокиПомещенияЦена.Количество() > 0 Тогда
		Сумма = Количество_П * НайденныеСтрокиПомещенияЦена[0].Цена; 
		Область.Параметры.Сумма  = Сумма;
	КонецЕсли;
	ТабДок.Вывести(Область);
КонецЦикла;

Область = Макет.ПолучитьОбласть("Строка");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Сдельно";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Сдельно;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Прачечная";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.СуммаПрачечная_Э;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Корректировка доп. начисл.";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.КорректировкаДопНачислено;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "СУММА ИТОГО";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.ЗарплатаИтого;
Область.Область(1,1,1,3).Шрифт = Новый Шрифт(, 12, Истина);
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Аванс кк";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Аванс_кк;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Аванс нал";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Аванс_нал;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Зарплата кк";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Зарплата_кк;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Отпуск кк";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Отпуск_кк;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Отпуск нал";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Отпуск_нал;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Сдельно нал";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.Сдельно_нал;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Иные выплаты нал";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.ИныеВыплаты_нал;
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "ОСТАТОК К ВЫДАЧЕ";
//Область.Параметры.Количество  = ТД.;
Область.Параметры.Сумма  = ТД.ОстатокКВыдаче;
Область.Область(1,1,1,3).Шрифт = Новый Шрифт(, 12, Истина);
ТабДок.Вывести(Область);

Возврат ТабДок;
КонецФункции
//





//////// ++++++++++++++++++++ /////////////////
&НаКлиенте
Процедура ПримечаниеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


















//







//

