
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр МинибарОстатки Приход
	Движения.МинибарОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаПриход Из Приход Цикл
		Движение = Движения.МинибарОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДокументаПрихода;
		Движение.НоменклатураМинибара = ТекСтрокаПриход.Номенклатура;
		Движение.Количество = ТекСтрокаПриход.Количество;
		Движение.ЦенаПриход = ТекСтрокаПриход.Цена;
		Движение.СуммаПриход = ТекСтрокаПриход.Цена * ТекСтрокаПриход.Количество;
	КонецЦикла;

	// регистр МинибарПартии Приход
	Движения.МинибарПартии.Записывать = Истина;
	Для Каждого ТекСтрокаПриход Из Приход Цикл
		Движение = Движения.МинибарПартии.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДокументаПрихода;          
		Движение.ДокументПрихода = Ссылка;
		Движение.НоменклатураМинибара = ТекСтрокаПриход.Номенклатура;
		Движение.Количество = ТекСтрокаПриход.Количество;
		Движение.ЦенаПриход = ТекСтрокаПриход.Цена;
	КонецЦикла;
	
КонецПроцедуры

