
//
Процедура ОтправитьEmail(Тема, Файлы, Получатели, ТекстСообщения = "", ФайлыКУдалению, УникальныйИдентификаторФормы) Экспорт
Если Получатели.Количество() = 0 Тогда
	Сообщить("Не заполнено поле: Получатели",СтатусСообщения.ОченьВажное);
	Возврат;
КонецЕсли;	
	
ДопПараметры = Новый Структура;
ДопПараметры.Вставить("Тема", Тема);
ДопПараметры.Вставить("Получатели", Получатели);
ДопПараметры.Вставить("ТекстСообщения", ТекстСообщения);

ДопПараметры.Вставить("ФайлыКУдалению", ФайлыКУдалению);

ЗавершениеОбратныйВызов = Новый ОписаниеОповещения("ЗавершениеЗагрузкиФайловEmail", ЭтотОбъект, ДопПараметры);
//ПрогрессОбратныйВызов = Новый ОписаниеОповещения("ПрогрессОбратныйВызов", ЭтотОбъект);
//ПередНачалоОбратныйВызов = Новый ОписаниеОповещения("ПередНачалоОбратныйВызов", ЭтотОбъект);

ФайлыДляОтправки = Новый Массив;
Для Каждого Файл Из Файлы Цикл
	ПередаваемыйФайл = Новый ОписаниеПередаваемогоФайла(Файл,);
	ФайлыДляОтправки.Добавить(ПередаваемыйФайл);
КонецЦикла;	

НачатьПомещениеФайловНаСервер(ЗавершениеОбратныйВызов, , , ФайлыДляОтправки, УникальныйИдентификаторФормы);
КонецПроцедуры	

Процедура ЗавершениеЗагрузкиФайловEmail(МассивОписанийФайлов, ДополнительныеПараметры) Экспорт
Тема = ДополнительныеПараметры.Тема;
Получатели = ДополнительныеПараметры.Получатели;
ТекстСообщения = ДополнительныеПараметры.ТекстСообщения; 
ФайлыКУдалению = ДополнительныеПараметры.ФайлыКУдалению;

ФайлыАдреса = Новый Массив;
Для Каждого Элемент Из МассивОписанийФайлов Цикл
	ЭлементФайлыАдреса = Новый Структура("Адрес, ИмяФайла", Элемент.Адрес, Элемент.СсылкаНаФайл.Имя);
	ФайлыАдреса.Добавить(ЭлементФайлыАдреса); 	
КонецЦикла;	
	
СлужебныеСервер.ОтправитьEmail_ИзКлиента(Тема, ФайлыАдреса, Получатели, ТекстСообщения);	

Если ФайлыКУдалению.Количество() > 0 Тогда
	Попытка
		Для Каждого Элемент Из ФайлыКУдалению Цикл
			УдалитьФайлы(Элемент);
		КонецЦикла;	
	Исключение
		Сообщить("Возникли проблемы с удалением временных файлов почты на клиенте: " + ОписаниеОшибки());
	КонецПопытки;
КонецЕсли;		
КонецПроцедуры	
//

// ++++++++++++++++++++++++

