
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Список.ТекстЗапроса = ОплатыОбщееСервер.ЗапросТекстВозврат();	
	
Параметры.Свойство("КонтрагентыОтбор",КонтрагентыОтбор);
Параметры.Свойство("ДокументДолг",ДокументДолг);
Параметры.Свойство("ДокументОплаты",ДокументОплаты);

//Если ЗначениеЗаполнено(ДокументДолг) Тогда Все = Истина; КонецЕсли;

Список.Параметры.УстановитьЗначениеПараметра("КонтрагентыОтбор", КонтрагентыОтбор);
Список.Параметры.УстановитьЗначениеПараметра("ДокументДолг", ДокументДолг);
Список.Параметры.УстановитьЗначениеПараметра("ДокументОплаты", ДокументОплаты);
//Список.Параметры.УстановитьЗначениеПараметра("Все", Все);

Если КонтрагентыОтбор.Количество() = 0 Тогда Возврат; КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
Если ТекущаяСтрока = Неопределено Тогда Закрыть(); КонецЕсли; 

ТекущиеДанные = Элементы.Список.ДанныеСтроки(ТекущаяСтрока);
ВыбратьДействие(ТекущаяСтрока, ТекущиеДанные);
КонецПроцедуры
 
&НаКлиенте
Процедура ВыбратьДействие(ТекущаяСтрока, ТекущиеДанные)
Результат = Новый Структура;
Результат.Вставить("ДокументОплаты", ТекущаяСтрока);

//ТекущиеДанные = Элементы.Список.ДанныеСтроки(ТекущаяСтрока);

//Результат.Вставить("СуммаДокумента", ТекущиеДанные.Сумма);
//Результат.Вставить("СуммаДокументаКарта", ТекущиеДанные.СуммаКарта);
//Результат.Вставить("СуммаДокументаНаличные", ТекущиеДанные.СуммаНаличные);

//Результат.Вставить("СуммаВозврат", ТекущиеДанные.СуммаВозврат);
//Результат.Вставить("СуммаВозвратКарта", ТекущиеДанные.СуммаВозвратКарта);
//Результат.Вставить("СуммаВозвратНаличные", ТекущиеДанные.СуммаВозвратНаличные);

//Результат.Вставить("СуммаОстаток", ТекущиеДанные.ОстатокОплаты);
//Результат.Вставить("СуммаОстатокКарта", ТекущиеДанные.ОстатокКарта);
//Результат.Вставить("СуммаОстатокНаличные", ТекущиеДанные.ОстатокНаличные);

//Результат.Вставить("СуммаОплачено", ТекущиеДанные.СуммаОплачено);
//Результат.Вставить("СуммаОстатокОплаты", ТекущиеДанные.СуммаОстатокОплаты);

//Результат.Вставить("КредитнаяКарта", ТекущиеДанные.КредитнаяКарта);

Закрыть(Результат); 
КонецПроцедуры                 

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

Выбрать(Неопределено);
КонецПроцедуры

// ++++++
&НаКлиенте
Процедура ВсеПриИзменении(Элемент)
//Список.Параметры.УстановитьЗначениеПараметра("КонтрагентыОтбор", КонтрагентыОтбор);
//Список.Параметры.УстановитьЗначениеПараметра("ДокументДолг", ДокументДолг);
//Список.Параметры.УстановитьЗначениеПараметра("Все", Все);
КонецПроцедуры



