
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Администратор = Параметры.Администратор;	
ДН = Параметры.ДН;
ДК = Параметры.ДК;

ЗарплатаСмены = Параметры.ЗарплатаСмены;
Для Каждого Строка Из ЗарплатаСмены Цикл
	Дата_П = ДН;
	Пока Дата_П <= ДК Цикл
		НоваяСтрока = АдминистраторыТабель.Добавить();
		НоваяСтрока.Администратор = Строка.Администратор;
		
		Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
		Дата_И = СтрЗаменить(Дата_С, ".", "");

		Имя = "Дата_" + Дата_И;
		НоваяСтрока.Дата = Строка[Имя];
		
		//Имя = "Часы_" + Дата_И;
		//НоваяСтрока.Часы = Строка[Имя];
		
		Имя = "НомерСмены_" + Дата_И;
		НоваяСтрока.НомерСмены = Строка[Имя];
	
		Имя = "ДлинаСмены_" + Дата_И;
		НоваяСтрока.ДлинаСмены = Строка[Имя];
		
		Имя = "ПереработкаЧасы_" + Дата_И;
		НоваяСтрока.ПереработкаЧасы = Строка[Имя];
		
		Дата_П = Дата_П + 24 * 60 * 60;	
	КонецЦикла;
КонецЦикла;

Проживающие = Параметры.Проживающие;
	
Для Каждого Строка Из АдминистраторыТабель Цикл
	
	Если Строка.Администратор <> Администратор Тогда Продолжить; КонецЕсли;
	НоваяСтрока = АдминистраторыТабельАдминистратор.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

Если АдминистраторыТабельАдминистратор.Количество() = 0 Тогда Возврат; КонецЕсли;

Менеджер = Документы.АдминистраторыЗарплата;
АдминистраторыСуммаЗаПроживающих = Параметры.АдминистраторыСуммаЗаПроживающих;
ИтогоСуммаЗаПроживающих = 0; 
Для Каждого СтрокаТабель Из АдминистраторыТабельАдминистратор Цикл
	ДатаСмены = СтрокаТабель.Дата;
	КоличествоНомеров = Менеджер.КоличествоНомеровЗаСмену(Проживающие, ДатаСмены) ;
	
	АдминистраторыВСмену = Менеджер.АдминистраторыВСмену(ЗарплатаСмены, ДатаСмены);
	КоличествоАдминистроровВСмену = АдминистраторыВСмену.Количество();
		
	Если КоличествоАдминистроровВСмену = 0 Тогда Продолжить; КонецЕсли;
	
	СтрокаТабель.КоличествоНомеров = КоличествоНомеров;
	СтрокаТабель.КоличествоАдминистроровВСмену = КоличествоАдминистроровВСмену;
	
	СуммаЗаПроживающихЗаСменуПолная = Менеджер.СуммаЗаПроживающихЗаСмену(АдминистраторыСуммаЗаПроживающих, КоличествоНомеров, СтрокаТабель.ДлинаСмены);
	
	//СуммаЗаПроживающихЗаСмену = Окр(СуммаЗаПроживающихЗаСменуПолная / КоличествоАдминистроровВСмену);
	СуммаЗаПроживающихЗаСмену = СуммаЗаПроживающихЗаСменуПолная;
	
	СтрокаТабель.СуммаЗаПроживающихЗаСмену = СуммаЗаПроживающихЗаСмену;
	
	ИтогоСуммаЗаПроживающих = ИтогоСуммаЗаПроживающих + СтрокаТабель.СуммаЗаПроживающихЗаСмену;
КонецЦикла;
КонецПроцедуры

//
&НаКлиенте
Процедура АдминистраторыТабельАдмнистраторПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдминистраторыТабельАдмнистраторПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры
//