
&НаСервереБезКонтекста
Функция ПолучитьДоступностьПоУзлу(Узел)
ДоступностьКнопок = Ложь;
// Определить наличие установленного непредопределенного узла.
Если Узел <> ПланыОбмена.ОбменТест.ПустаяСсылка()
И Узел <> ПланыОбмена.ОбменТест.ЭтотУзел()
И Узел.ПолучитьОбъект() <> Неопределено Тогда
	ДоступностьКнопок = Истина;
КонецЕсли;

Возврат ДоступностьКнопок;
КонецФункции
 
&НаКлиенте
Процедура УзелОбменаПриИзменении(Элемент)
ДоступностьКнопок = ПолучитьДоступностьПоУзлу(УзелОбмена);

// Установить доступность кнопок в зависимости от установленного узла обмена.
Элементы.ФормаЗагрузитьДанные.Доступность = ДоступностьКнопок;
Элементы.ФормаВыгрузитьДанные.Доступность = ДоступностьКнопок;
КонецПроцедуры

//
&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
ВыполнитьВыгрузкуНаСервере(УзелОбмена)
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьВыгрузкуНаСервере(Узел)
Если НЕ ЗначениеЗаполнено(Узел) Тогда Возврат; КонецЕсли;

УзелОбмена = Узел.ПолучитьОбъект();

//ДанныеУзлаОбмена = ОбменВыписка.ПолучитьДанныеУзлаОбмена(УзелОбмена.Код);

УзелОбмена.ЗаписатьСообщениеСИзменениями();
КонецПроцедуры
//

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
Результат = ОбменГостиницы.ВыполнитьЗагрузкуУзла(УзелОбмена);  
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьЗагрузкуНаСервере(Узел)
Если НЕ ЗначениеЗаполнено(Узел) Тогда Возврат; КонецЕсли;
	
	// Получить объект узла обмена.
УзелОбмена = Узел.ПолучитьОбъект();

// Прочитать новое сообщение обмена.
УзелОбмена.ПрочитатьСообщениеПодтверждения();
КонецПроцедуры

//
&НаКлиенте                                  
Процедура ОбменДанными(Команда)
ОбменГостиницы.ВыполнитьОбменДанными();	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбменДаннымиНаСервере()     
ТаблицаДанныеКонтроля = ОбменГостиницы.ПолучитьТаблицаДанныеКонтроля();	
Для Каждого Строка Из ТаблицаДанныеКонтроля Цикл
	Узел = ПланыОбмена.ВГ_ВыпискаГостиницы.НайтиПоКоду(Строка.КодУзлаОбмена);
	Если НЕ ЗначениеЗаполнено(Узел) Тогда Продолжить; КонецЕсли;
	
	УзелОбмена = Узел.ПолучитьОбъект();

	УзелОбмена.ПрочитатьСообщениеПодтверждения();
	
	УзелОбмена.ЗаписатьСообщениеСИзменениями();	
КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбменДаннымиНаСервере_1(Узел)     
// Получить объект узла обмена.
УзелОбмена = Узел.ПолучитьОбъект();

// Прочитать новое сообщение обмена.
УзелОбмена.ПрочитатьСообщениеПодтверждения();

// Прочитать новое сообщение обмена.
УзелОбмена.ЗаписатьСообщениеСИзменениями();
КонецПроцедуры

// ++++++++++++++++++++++++++++++++++++++++++++++++++

