
Процедура ЗагрузкаВыписки() Экспорт
Путь = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
ИмяФайлЛог = Путь + "ЛогЗагрузки_Бухгалтерия.txt";	
ИмяФайлОшибка = Путь + "ОшибкаЗагрузки_Бухгалтерия.txt";

Файл = Новый ЗаписьТекста(ИмяФайлЛог,,, Истина);
Файл.ЗаписатьСтроку("===============================");
Файл.ЗаписатьСтроку("Начало загрузки Бухгалтерия:" + ТекущаяДата());

ФайлОшибка = Новый ЗаписьТекста(ИмяФайлОшибка,,, Истина);

ЕстьОшибки = Ложь;
Попытка
	Результат = ОбменВыписка.ВыполнитьОбменДанными();
Исключение
	Файл.ЗаписатьСтроку("Ошибка ОбменВыписка.ВыполнитьОбменДанными(): " + ОписаниеОшибки() + ". " + ТекущаяДата());
	Файл.Закрыть();

	ФайлОшибка.ЗаписатьСтроку("Ошибка ОбменВыписка.ВыполнитьОбменДанными(): " + ОписаниеОшибки() + ". " + ТекущаяДата());
	ФайлОшибка.Закрыть();
	ЕстьОшибки = Истина;
	
	Возврат;  
КонецПопытки;
	
Если Результат.РезультатЧтения <> Неопределено Тогда 
	Если Результат.РезультатЧтения.Ошибка Тогда 
		Файл.ЗаписатьСтроку("Ошибка загрузки файла Бухгалтерия: " + Результат.РезультатЧтения.ОписаниеОшибки + ". " + ТекущаяДата());
		
		ФайлОшибка.ЗаписатьСтроку("Ошибка загрузки файла Бухгалтерия: " + Результат.РезультатЧтения.ОписаниеОшибки + ". " + ТекущаяДата());
		ЕстьОшибки = Истина;
	КонецЕсли;	
КонецЕсли;

Если Результат.РезультатЗаписи <> Неопределено Тогда 
	Если Результат.РезультатЗаписи.Ошибка Тогда 
		Файл.ЗаписатьСтроку("Ошибка записи файла Бухгалтерия: " + Результат.РезультатЗаписи.ОписаниеОшибки + ". " + ТекущаяДата());
		
		ФайлОшибка.ЗаписатьСтроку("Ошибка записи файла Бухгалтерия: " + Результат.РезультатЗаписи.ОписаниеОшибки + ". " + ТекущаяДата());
		ЕстьОшибки = Истина;
	КонецЕсли;	
КонецЕсли;

Если Результат.РезультатЧтения <> Неопределено Тогда 
	ТекстСообщения = "РЕЗУЛЬТАТ ОБМЕНА: Добавлено - " + Результат.РезультатЧтения.Добавлено 
		+ " Заменено - " + Результат.РезультатЧтения.Заменено + " Удалено - " + Результат.РезультатЧтения.Удалено + ". "; 
		
	Файл.ЗаписатьСтроку( ТекстСообщения + ТекущаяДата());
КонецЕсли; 

Файл.ЗаписатьСтроку("Окончание загрузки Бухгалтерия:" + ТекущаяДата());
Файл.Закрыть();
                                                                          
ФайлОшибка.Закрыть();
	
Если ЕстьОшибки Тогда
	Тема = "Ошибки загрузки Бухгалтерия";
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(ИмяФайлОшибка);
	
	МассивПолучатели = Новый Массив;
	МассивПолучатели.Добавить("postnikov_sn@invina.ru");
	
	ТекстСообщения = "Ошибки загрузки Бухгалтерия";
	
	СлужебныеСервер.ОтправитьEmail(Тема, МассивФайлов, МассивПолучатели, ТекстСообщения);
	
	Сообщить("Есть ошибки");
КонецЕсли;
КонецПроцедуры
