
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр(); 

ЭтоАдминистратор = НастройкиСервер.ЭтоАдминистратор();
Элементы.ПрограммныйКод.Видимость = ЭтоАдминистратор;
КонецПроцедуры

&НаКлиенте
Процедура ДвойныеИНН(Команда)
ПараметрыФормы = Новый Структура();	
ПараметрыФормы.Вставить("СформироватьОтчет", Истина);

ОткрытьФорму("Обработка.КлиентыДвойныеИНН.Форма.Форма", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьКонтрагентов(Команда)
ПараметрыФормы = Новый Структура();	

ОткрытьФорму("Обработка.КлиентыОбъединиение.Форма.ФормаОбъединениеКонтрагентов", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры


&НаКлиенте
Процедура ПлохиеТелефоны(Команда)
ОткрытьФорму("Справочник.Клиенты.Форма.ПлохиеТелефоны", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

