
Процедура ВыгрузкаФинРезультатов(ДатаС, ДатаПо, Тест = Ложь) Экспорт
ИмяТекущаяОрганизация = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();	
	
ИмяФайлЛога = "C:\_Base1C\ЛогВыгрузки\" + "Выгрузка_" + ИмяТекущаяОрганизация + "_";
ИмяФайлОшибка = "C:\_Base1C\ЛогВыгрузки\" + "Выгрузка_" + ИмяТекущаяОрганизация + "_Ошибка_";
Если Тест Тогда
	ИмяФайлЛога = ИмяФайлЛога + "Тест_";
	ИмяФайлОшибка = ИмяФайлОшибка + "Тест_";
КонецЕсли;

ИмяФайлЛога = ИмяФайлЛога + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + ".txt"; 	
ИмяФайлОшибка = ИмяФайлОшибка + ".txt"; 	
	
ЕстьОшибки = Ложь;
Попытка	
	ЕстьОшибки = ВыгрузкаФинРезультатСервер.ВыгрузитьФинРезультат(ДатаС, ДатаПо, ИмяФайлЛога, ИмяФайлОшибка, Тест);		
	
	ЕстьОшибки_П = ВыгрузкаФинРезультатСервер.ВыгрузитьФинРезультатКоворкинг(ДатаС, ДатаПо, ИмяФайлЛога, ИмяФайлОшибка, Тест);
	ЕстьОшибки = ЕстьОшибки ИЛИ ЕстьОшибки_П; 
	
	ЕстьОшибки_П = ВыгрузкаФинРезультат_Расширенный.ВыгрузитьФинРезультат(ДатаС, ДатаПо, ИмяФайлЛога, ИмяФайлОшибка, Тест);
	ЕстьОшибки = ЕстьОшибки ИЛИ ЕстьОшибки_П; 
	
	ЕстьОшибки_П = ВыгрузкаФинРезультат_Расширенный.ВыгрузитьФинРезультатКоворкинг(ДатаС, ДатаПо, ИмяФайлЛога, ИмяФайлОшибка, Тест);
	ЕстьОшибки = ЕстьОшибки ИЛИ ЕстьОшибки_П; 
Исключение	
	Сообщить("Ошибка выгрузки ФР: " + ОписаниеОшибки());
	
	ЕстьОшибки = Истина;
	
	Файл = Новый ЗаписьТекста(ИмяФайлЛога,,, Истина);
	Файл.ЗаписатьСтроку("Ошибка выгрузки ФР: " + ТекущаяДата() + " ОписаниеОшибки: " + ОписаниеОшибки());
	Файл.Закрыть();
	
	Файл = Новый ЗаписьТекста(ИмяФайлОшибка,,, Истина);
	Файл.ЗаписатьСтроку("Ошибка выгрузки ФР: " + ТекущаяДата() + " ОписаниеОшибки: " + ОписаниеОшибки());
	Файл.Закрыть();
КонецПопытки;

Если ЕстьОшибки Тогда
	Тема = "Ошибки выгрузки ФР";
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(ИмяФайлОшибка);
	
	МассивПолучатели = Новый Массив;
	МассивПолучатели.Добавить("postnikov_sn@invina.ru");
	
	ТекстСообщения = "Ошибки выгрузки ФР";
	
	СлужебныеСервер.ОтправитьEmail(Тема, МассивФайлов, МассивПолучатели, ТекстСообщения);
	
	Сообщить("Есть ошибки");
КонецЕсли;
КонецПроцедуры


Процедура ЗаписьФайлОшибка_НеИспользуется(ИмяФайлОшибка) 
	Файл = Новый ЗаписьТекста(ИмяФайлОшибка,,, Истина);

	Файл.ЗаписатьСтроку("Ошибка выгрузки ФР: " + ОписаниеОшибки());
		
	Файл.Закрыть();
КонецПроцедуры
