&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
УникальныйИдентификаторПустой = ОбщийФункционалСервер.УникальныйИдентификаторПустой();	
Для Каждого Строка Из НаборЗаписей Цикл
	Если Строка.ЗаявкаГУИД = УникальныйИдентификаторПустой Тогда
		Строка.Заявка = Документы.ЗаявкаНаБронирование.ПустаяСсылка();
	Иначе
		ЗаявкаСсылка = Документы.ЗаявкаНаБронирование.ПолучитьСсылку(Строка.ЗаявкаГУИД);
		
	ЗаявкаОбъект = ЗаявкаСсылка.ПолучитьОбъект();
		Если ЗаявкаОбъект = Неопределено Тогда 
			Строка.Заявка = Документы.ЗаявкаНаБронирование.ПустаяСсылка();
		Иначе	
			Строка.Заявка = ЗаявкаСсылка; 
		КонецЕсли;
	КонецЕсли;
КонецЦикла;
КонецПроцедуры

//
&НаКлиенте
Процедура НаборЗаписейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
Элемент.ТекущиеДанные.Клиент = НаборЗаписей.Отбор.Клиент.Значение;	
ТД = Элемент.ТекущиеДанные;

Если НЕ ЗначениеЗаполнено(ТД.ДатаРегистрации) Тогда  
	ТД.ДатаРегистрации = ТекущаяДата();
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
Индекс = 0; 	
Для Каждого Запись Из ТекущийОбъект Цикл 
	ПустойГУИД = ОбщийФункционалСервер.УникальныйИдентификаторПустой();
	Если Запись.ЗаявкаГУИД = ПустойГУИД Тогда
		Индекс = Индекс + 1; 	
		Запись.ДопПожеланияИндекс = Индекс;
	КонецЕсли;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередНачаломИзменения(Элемент, Отказ)
ТД = Элемент.ТекущиеДанные;

Если НЕ ЗначениеЗаполнено(ТД.ДатаРегистрации) Тогда  
	ТД.ДатаРегистрации = ТекущаяДата();
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидИнформацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФорма_ВидыИнформации", ЭтаФорма);	
ОткрытьФорму("Справочник.ВидыИнформации.ФормаВыбора", , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФорма_ВидыИнформации(Результат, ДополнительныеПараметры)  Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
ТД = Элементы.НаборЗаписей.ТекущиеДанные;
Наименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Результат, "Наименование");
ТД.ВидИнформации = Наименование;
КонецПроцедуры
//








