
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Ложь);

Если НЕ ЭтаФорма.ТолькоПросмотр Тогда
	Если Параметры.Свойство("ТолькоПросмотр") Тогда	
		ТолькоПросмотр_П = ?(Параметры.ТолькоПросмотр = Неопределено, Ложь, Параметры.ТолькоПросмотр);
	Иначе
		ТолькоПросмотр_П = Ложь;
	КонецЕсли;

	Если НЕ ТолькоПросмотр_П Тогда
		ТекущийПользовательКодРавноАдминистратор = НастройкиСервер.ТекущийПользовательКодРавноАдминистратор();
		Доступность_П = ТекущийПользовательКодРавноАдминистратор; 
		Элементы.ОрганизацияИмя.Доступность = Доступность_П; 
		Элементы.ОрганизацияИмяДляСМС.Доступность = Доступность_П; 
	КонецЕсли;
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЛоготипНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
// Отказываемся от стандартной обработки процедуры
СтандартнаяОбработка = Ложь;

// Создаем диалог выбора файла и указываем для чего он будет использоваться
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
// Задаем фильтр доступных расширений файлов для выбора
//Диалог.Фильтр = НСтр(«ru=’Книга Excel 97 (*.xls)|*.xls|Книга Excel 2007 (*.xlsx)|*.xlsx'»);
Диалог.Фильтр = НСтр("Картинки (*.png)|*.png");
// Задаем текст заголовка окна выбора
Диалог.Заголовок = НСтр("Выберите файл картинки");
// Создаем объект ОписаниеОповещения, который будет передан в метод Показать
ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
// Открываем окно выбора файла
Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;

Объект.Логотип = ВыбранныеФайлы[0];
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ПодключаемоеОборудование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
                      |ГДЕ
                      |	ПодключаемоеОборудование.Наименование ПОДОБНО ""%Коворкинг%""
                      |	И ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ");	

ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	Если ТекущийОбъект.КоворкингОрганизацияЕсть Тогда
		Сообщить("ВНИМАНИЕ !!! Не найдено оборудование Коворкинг в справочнике 'Подключаемое оборудование'"
					, СтатусСообщения.ОченьВажное);
	КонецЕсли;
	
	Возврат;
Иначе 
	Для Каждого Строка Из ТЗ Цикл
		ОборудованиеОбъект = Строка.Ссылка.ПолучитьОбъект(); 
		
		ОборудованиеОбъект.УстройствоИспользуется = ТекущийОбъект.КоворкингОрганизацияЕсть;
		
		ОборудованиеОбъект.Записать();
	КонецЦикла;
КонецЕсли;	
КонецПроцедуры



