
&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
	//ТабДок=Новый ТабличныйДокумент;
	//Макет=ПолучитьМакет("Макет");
	//Обл=Макет.ПолучитьОбласть("ШапкаВопросы");
	//ТекстЗапроса="ВЫБРАТЬ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АнкетаВопросы.Ссылка) КАК Ссылка,
	//|	АнкетаВопросы.Вопрос,
	//|	СУММА(ВЫБОР
	//|			КОГДА АнкетаВопросы.Отлично
	//|				ТОГДА 10
	//|			ИНАЧЕ ВЫБОР
	//|					КОГДА АнкетаВопросы.Хорошо
	//|						ТОГДА 7.5
	//|					ИНАЧЕ ВЫБОР
	//|							КОГДА АнкетаВопросы.Удовлетворительно
	//|								ТОГДА 5
	//|							ИНАЧЕ ВЫБОР
	//|									КОГДА АнкетаВопросы.Плохо
	//|										ТОГДА 2.5
	//|									ИНАЧЕ 10
	//|								КОНЕЦ
	//|						КОНЕЦ
	//|				КОНЕЦ
	//|		КОНЕЦ) КАК Рейтинг
	//|ИЗ
	//|	Документ.Анкета.Вопросы КАК АнкетаВопросы
	//|ГДЕ
	//|	АнкетаВопросы.Ссылка.Дата МЕЖДУ &Дн И &ДК";
	//Если НЕ ФильтрПоНомеру.Пустая() тогда
	//	ТекстЗапроса=ТекстЗапроса+"
	//	|	И АнкетаВопросы.Ссылка.Бронь.НомерВРезерв = &НомерВРезерв";
	//конецесли;
	//
	//Если НЕ ФильтрПоГостю.Пустая() тогда
	//	ТекстЗапроса=ТекстЗапроса+"
	//	|	И АнкетаВопросы.Ссылка.Клиент = &Клиент";
	//конецесли;
	//
	//ТекстЗапроса=ТекстЗапроса+"
	//|СГРУППИРОВАТЬ ПО
	//|	АнкетаВопросы.Вопрос";
	//
	//Запрос=новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("ДН",НачалоДня(ДатаНачалаПериода));					
	//Запрос.УстановитьПараметр("ДК",КонецДня(ДатаОкончанияПериода));
	//Если НЕ ФильтрПоНомеру.Пустая() тогда
	//	Запрос.УстановитьПараметр("НомерВРезерв",ФильтрПоНомеру);					
	//конецесли;
	//
	//Если НЕ ФильтрПоГостю.Пустая() тогда
	//	Запрос.УстановитьПараметр("Клиент",ФильтрПоГостю);					
	//конецесли;
	//
	//
	//ТЗ=Запрос.Выполнить().Выгрузить();
	//Если ТЗ.Количество()<>0 тогда
	//	Обл.Параметры.анкет=ТЗ[0].Ссылка;	
	//	ТабДок.Вывести(Обл);
	//	Обл=макет.ПолучитьОбласть("СтрокаВопрос");
	//	КолВ=0;
	//	Рейт=0;
	//	Для каждого Стр Из ТЗ Цикл
	//		
	//		Обл.Параметры.Вопрос=Стр.Вопрос;
	//		Обл.Параметры.Рейтинг=?(Стр.Ссылка=0,0,Окр(Стр.Рейтинг/Стр.Ссылка,1));
	//		ТабДок.Вывести(Обл);
	//		Рейт=Рейт+Стр.Рейтинг/Стр.Ссылка;
	//		КолВ=КолВ+1;
	//	КонецЦикла; 
	//	Обл=макет.ПолучитьОбласть("СтрокаИтог");
	//	РейтингОтеля=?(КолВ=0,0,ТЗ.Итог("Рейтинг")/КолВ);
	//	Обл.Параметры.Рейтинг=?(ТЗ[0].Ссылка=0,0,?(КолВ=0,0,Окр(Рейт/КолВ,1)));//Окр(РейтингОтеля/ТЗ[0].Ссылка,1));
	//	ТабДок.Вывести(Обл);
	//	
	//	Обл=макет.ПолучитьОбласть("Шапка");
	//	ТабДок.Вывести(Обл);
	//	ТекстЗапроса="ВЫБРАТЬ
	//	|	АнкетаЦелиВизита.Цель,
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АнкетаЦелиВизита.Ссылка) КАК Ссылка,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА АнкетаЦелиВизита.Подходит
	//	|				ТОГДА 1
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК КолВо
	//	|ИЗ
	//	|	Документ.Анкета.ЦелиВизита КАК АнкетаЦелиВизита
	//	|ГДЕ
	//	|	АнкетаЦелиВизита.Ссылка.Дата МЕЖДУ &Дн И &ДК";
	//	
	//	Если НЕ ФильтрПоНомеру.Пустая() тогда
	//		ТекстЗапроса=ТекстЗапроса+"
	//		|	И АнкетаЦелиВизита.Ссылка.Бронь.НомерВРезерв = &НомерВРезерв";
	//	конецесли;
	//	
	//	Если НЕ ФильтрПоГостю.Пустая() тогда
	//		ТекстЗапроса=ТекстЗапроса+"
	//		|	И АнкетаЦелиВизита.Ссылка.Клиент = &Клиент";
	//	конецесли;
	//	
	//	ТекстЗапроса=ТекстЗапроса+"
	//	|СГРУППИРОВАТЬ ПО
	//	|	АнкетаЦелиВизита.Цель";
	//	
	//	
	//	
	//	Запрос=Новый Запрос(ТекстЗапроса);
	//	
	//	Запрос.УстановитьПараметр("ДН",НачалоДня(ДатаНачалаПериода));					
	//	Запрос.УстановитьПараметр("ДК",КонецДня(ДатаОкончанияПериода));
	//	Если НЕ ФильтрПоНомеру.Пустая() тогда
	//		Запрос.УстановитьПараметр("НомерВРезерв",ФильтрПоНомеру);					
	//	конецесли;
	//	
	//	Если НЕ ФильтрПоГостю.Пустая() тогда
	//		Запрос.УстановитьПараметр("Клиент",ФильтрПоГостю);					
	//	конецесли;
	//	
	//	ТЗ=Запрос.Выполнить().Выгрузить();
	//	
	//	ТекстЗапроса="ВЫБРАТЬ
	//	             |	СУММА(ВЫБОР
	//	             |			КОГДА Анкета.ДругаяЦель <> """"
	//	             |				ТОГДА 1
	//	             |			ИНАЧЕ 0
	//	             |		КОНЕЦ) КАК ДругиеЦели
	//	             |ИЗ
	//	             |	Документ.Анкета КАК Анкета
	//	             |ГДЕ
	//	             |	Анкета.Дата МЕЖДУ &Дн И &ДК";
	//	
	//	Если НЕ ФильтрПоНомеру.Пустая() тогда
	//		ТекстЗапроса=ТекстЗапроса+"
	//		|	И Анкета.Бронь.НомерВРезерв = &НомерВРезерв";
	//	конецесли;
	//	
	//	Если НЕ ФильтрПоГостю.Пустая() тогда
	//		ТекстЗапроса=ТекстЗапроса+"
	//		|	И Анкета.Клиент = &Клиент";
	//	конецесли;
	//	
	//
	//	
	//	ЗапросДругих=Новый Запрос(ТекстЗапроса);
	//		ЗапросДругих.УстановитьПараметр("ДН",НачалоДня(ДатаНачалаПериода));					
	//	ЗапросДругих.УстановитьПараметр("ДК",КонецДня(ДатаОкончанияПериода));
	//	Если НЕ ФильтрПоНомеру.Пустая() тогда
	//		ЗапросДругих.УстановитьПараметр("НомерВРезерв",ФильтрПоНомеру);					
	//	конецесли;
	//	
	//	Если НЕ ФильтрПоГостю.Пустая() тогда
	//		ЗапросДругих.УстановитьПараметр("Клиент",ФильтрПоГостю);					
	//	конецесли;

	//	ТЗД=ЗапросДругих.Выполнить().Выгрузить();
	//	КолвоД=?(ТЗД.Количество()=0,0,ТЗД[0].ДругиеЦели);
	//	
	//	Если ТЗ.Количество()<>0 тогда
	//		Обл=макет.ПолучитьОбласть("СтрокаЦель");
	//		Проц=100;
	//		Для каждого Стр Из ТЗ Цикл
	//			
	//			Обл.Параметры.Цель=Стр.Цель;
	//			П=Окр(Стр.Колво/Стр.Ссылка*100);
	//			Проц=Проц-П;
	//			Обл.Параметры.Процент=?(Стр.Ссылка=0,"0%",Строка(П)+"%");
	//			ТабДок.Вывести(Обл);
	//			
	//		КонецЦикла; 
	//		
	//		
	//		Обл.Параметры.Цель="Другая цель";
	//		Обл.Параметры.Процент=Строка(КолвоД)+"%";
	//		ТабДок.Вывести(Обл);
	//		
	//		Проц=Проц-КолвоД;
	//		Если Проц<0 тогда 
	//			Проц=0;
	//			
	//			КонецЕсли;
	//		Обл.Параметры.Цель="Не указанна";
	//		Обл.Параметры.Процент=Строка(Проц)+"%";
	//		ТабДок.Вывести(Обл);
	//	конецесли;
	//	
	//	
	//	// характеристики
	//	
	//	Обл=макет.ПолучитьОбласть("ШапкаХар");
	//	ТабДок.Вывести(Обл);
	//	ТекстЗапроса="ВЫБРАТЬ
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АнкетаХарактеристикиОтеля.Ссылка) КАК Ссылка,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА АнкетаХарактеристикиОтеля.Подходит
	//	|				ТОГДА 1
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК КолВо,
	//	|	АнкетаХарактеристикиОтеля.Характеристика
	//	|ИЗ
	//	|	Документ.Анкета.ХарактеристикиОтеля КАК АнкетаХарактеристикиОтеля
	//	|ГДЕ
	//	|	АнкетаХарактеристикиОтеля.Ссылка.Дата МЕЖДУ &Дн И &ДК";
	//	
	//	Если НЕ ФильтрПоНомеру.Пустая() тогда
	//		ТекстЗапроса=ТекстЗапроса+"
	//		|	И АнкетаХарактеристикиОтеля.Ссылка.Бронь.НомерВРезерв = &НомерВРезерв";
	//	конецесли;
	//	
	//	Если НЕ ФильтрПоГостю.Пустая() тогда
	//		ТекстЗапроса=ТекстЗапроса+"
	//		|	И АнкетаХарактеристикиОтеля.Ссылка.Клиент = &Клиент";
	//	конецесли;
	//	
	//	ТекстЗапроса=ТекстЗапроса+"
	//	|СГРУППИРОВАТЬ ПО
	//	|	АнкетаХарактеристикиОтеля.Характеристика";
	//	
	//	
	//	Запрос=Новый Запрос(ТекстЗапроса);
	//	
	//	Запрос.УстановитьПараметр("ДН",НачалоДня(ДатаНачалаПериода));					
	//	Запрос.УстановитьПараметр("ДК",КонецДня(ДатаОкончанияПериода));
	//	
	//	Если НЕ ФильтрПоНомеру.Пустая() тогда
	//		Запрос.УстановитьПараметр("НомерВРезерв",ФильтрПоНомеру);					
	//	конецесли;
	//	
	//	Если НЕ ФильтрПоГостю.Пустая() тогда
	//		Запрос.УстановитьПараметр("Клиент",ФильтрПоГостю);					
	//	конецесли;
	//	
	//	
	//	ТЗ=Запрос.Выполнить().Выгрузить();
	//	Если ТЗ.Количество()<>0 тогда
	//		Обл=макет.ПолучитьОбласть("СтрокаХар");
	//		Проц=100;
	//		Для каждого Стр Из ТЗ Цикл
	//			
	//			Обл.Параметры.Характеристика=Стр.Характеристика;
	//			П=Окр(Стр.Колво/Стр.Ссылка*100);
	//			Проц=Проц-П;
	//			Обл.Параметры.Процент=?(Стр.Ссылка=0,"0%",Строка(П)+"%");
	//			ТабДок.Вывести(Обл);
	//			
	//		КонецЦикла; 
	//	конецесли;
	//	ТекстЗапроса="ВЫБРАТЬ
	//	             |	Анкета.Понравилось,
	//	             |	Анкета.НеПонравилось,
	//	             |	Анкета.Бронь.НомерВРезерв КАК Ном,
	//	             |	Анкета.Бронь.РезервС КАК РезервС,
	//	             |	Анкета.Бронь.РезервПо КАК РезервПо
	//	             |ИЗ
	//	             |	Документ.Анкета КАК Анкета
	//	             |ГДЕ
	//	             |	Анкета.Дата МЕЖДУ &Дн И &ДК
	//	             |	И (Анкета.Понравилось <> &Пусто
	//	             |			ИЛИ Анкета.НеПонравилось <> &Пусто)";
	//	
	//	Если НЕ ФильтрПоНомеру.Пустая() тогда
	//		ТекстЗапроса=ТекстЗапроса+"
	//		|	И Анкета.Бронь.НомерВРезерв = &НомерВРезерв";
	//	конецесли;
	//	
	//	Если НЕ ФильтрПоГостю.Пустая() тогда
	//		ТекстЗапроса=ТекстЗапроса+"
	//		|	И Анкета.Клиент = &Клиент";
	//	конецесли;
	//	
	//	ТекстЗапроса=ТекстЗапроса+"
	//|УПОРЯДОЧИТЬ ПО
	//	|	Анкета.Дата";
	//	

	//	ЗапросПН=Новый Запрос(ТекстЗапроса);
	//	ЗапросПН.УстановитьПараметр("ДН",НачалоДня(ДатаНачалаПериода));					
	//	ЗапросПН.УстановитьПараметр("ДК",КонецДня(ДатаОкончанияПериода));
	//	ЗапросПН.УстановитьПараметр("Пусто","");
	//	Если НЕ ФильтрПоНомеру.Пустая() тогда
	//		ЗапросПН.УстановитьПараметр("НомерВРезерв",ФильтрПоНомеру);					
	//	конецесли;
	//	
	//	Если НЕ ФильтрПоГостю.Пустая() тогда
	//		ЗапросПН.УстановитьПараметр("Клиент",ФильтрПоГостю);					
	//	конецесли;
	//	

	//	ТЗ=ЗапросПН.Выполнить().Выгрузить();
	//	Если ТЗ.Количество()<>0 тогда
	//		Обл=макет.ПолучитьОбласть("ШапкаПН");
	//		ТабДок.Вывести(Обл);
	//		Для каждого Стр Из ТЗ Цикл
	//			
	//			Обл=макет.ПолучитьОбласть("СтрокаПН");
	//			Обл.Параметры.Заполнить(Стр);
	//			ТабДок.Вывести(Обл);
	//		КонецЦикла; 
	//	конецесли;
	//	
	//	
	//	ТабДок.Показать();
	//конецесли;
	//
	//
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
ТабДок = СформироватьКомандаНаСервере();

ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция СформироватьКомандаНаСервере()
	ТабДок=Новый ТабличныйДокумент;
	
	//Макет=ПолучитьМакет("Макет");
	Макет = Отчеты.СтатистикаПоАнкетам.ПолучитьМакет("Макет");    
	
	Обл=Макет.ПолучитьОбласть("ШапкаВопросы");
	ТекстЗапроса="ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АнкетаВопросы.Ссылка) КАК Ссылка,
	|	АнкетаВопросы.Вопрос,
	|	СУММА(ВЫБОР
	|			КОГДА АнкетаВопросы.Отлично
	|				ТОГДА 10
	|			ИНАЧЕ ВЫБОР
	|					КОГДА АнкетаВопросы.Хорошо
	|						ТОГДА 7.5
	|					ИНАЧЕ ВЫБОР
	|							КОГДА АнкетаВопросы.Удовлетворительно
	|								ТОГДА 5
	|							ИНАЧЕ ВЫБОР
	|									КОГДА АнкетаВопросы.Плохо
	|										ТОГДА 2.5
	|									ИНАЧЕ 10
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК Рейтинг
	|ИЗ
	|	Документ.Анкета.Вопросы КАК АнкетаВопросы
	|ГДЕ
	|	АнкетаВопросы.Ссылка.Дата МЕЖДУ &Дн И &ДК";
	Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	И АнкетаВопросы.Ссылка.Бронь.НомерВРезерв = &НомерВРезерв";
	конецесли;
	
	Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	И АнкетаВопросы.Ссылка.Клиент = &Клиент";
	конецесли;
	
	ТекстЗапроса=ТекстЗапроса+"
	|СГРУППИРОВАТЬ ПО
	|	АнкетаВопросы.Вопрос";
	
	Запрос=новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДатаНачалаПериода));					
	Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДатаОкончанияПериода));
	Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
		Запрос.УстановитьПараметр("НомерВРезерв",Отчет.ФильтрПоНомеру);					
	конецесли;
	
	Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
		Запрос.УстановитьПараметр("Клиент",Отчет.ФильтрПоГостю);					
	конецесли;
	
	
	ТЗ=Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество()<>0 тогда
		Обл.Параметры.анкет=ТЗ[0].Ссылка;	
		ТабДок.Вывести(Обл);
		Обл=макет.ПолучитьОбласть("СтрокаВопрос");
		КолВ=0;
		Рейт=0;
		Для каждого Стр Из ТЗ Цикл
			
			Обл.Параметры.Вопрос=Стр.Вопрос;
			Обл.Параметры.Рейтинг=?(Стр.Ссылка=0,0,Окр(Стр.Рейтинг/Стр.Ссылка,1));
			ТабДок.Вывести(Обл);
			Рейт=Рейт+Стр.Рейтинг/Стр.Ссылка;
			КолВ=КолВ+1;
		КонецЦикла; 
		Обл=макет.ПолучитьОбласть("СтрокаИтог");
		РейтингОтеля=?(КолВ=0,0,ТЗ.Итог("Рейтинг")/КолВ);
		Обл.Параметры.Рейтинг=?(ТЗ[0].Ссылка=0,0,?(КолВ=0,0,Окр(Рейт/КолВ,1)));//Окр(РейтингОтеля/ТЗ[0].Ссылка,1));
		ТабДок.Вывести(Обл);
		
		Обл=макет.ПолучитьОбласть("Шапка");
		ТабДок.Вывести(Обл);
		ТекстЗапроса="ВЫБРАТЬ
		|	АнкетаЦелиВизита.Цель,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АнкетаЦелиВизита.Ссылка) КАК Ссылка,
		|	СУММА(ВЫБОР
		|			КОГДА АнкетаЦелиВизита.Подходит
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КолВо
		|ИЗ
		|	Документ.Анкета.ЦелиВизита КАК АнкетаЦелиВизита
		|ГДЕ
		|	АнкетаЦелиВизита.Ссылка.Дата МЕЖДУ &Дн И &ДК";
		
		Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
			ТекстЗапроса=ТекстЗапроса+"
			|	И АнкетаЦелиВизита.Ссылка.Бронь.НомерВРезерв = &НомерВРезерв";
		конецесли;
		
		Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
			ТекстЗапроса=ТекстЗапроса+"
			|	И АнкетаЦелиВизита.Ссылка.Клиент = &Клиент";
		конецесли;
		
		ТекстЗапроса=ТекстЗапроса+"
		|СГРУППИРОВАТЬ ПО
		|	АнкетаЦелиВизита.Цель";
		
		
		
		Запрос=Новый Запрос(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДатаНачалаПериода));					
		Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДатаОкончанияПериода));
		Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
			Запрос.УстановитьПараметр("НомерВРезерв",Отчет.ФильтрПоНомеру);					
		конецесли;
		
		Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
			Запрос.УстановитьПараметр("Клиент",Отчет.ФильтрПоГостю);					
		конецесли;
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		ТекстЗапроса="ВЫБРАТЬ
		             |	СУММА(ВЫБОР
		             |			КОГДА Анкета.ДругаяЦель <> """"
		             |				ТОГДА 1
		             |			ИНАЧЕ 0
		             |		КОНЕЦ) КАК ДругиеЦели
		             |ИЗ
		             |	Документ.Анкета КАК Анкета
		             |ГДЕ
		             |	Анкета.Дата МЕЖДУ &Дн И &ДК";
		
		Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
			ТекстЗапроса=ТекстЗапроса+"
			|	И Анкета.Бронь.НомерВРезерв = &НомерВРезерв";
		конецесли;
		
		Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
			ТекстЗапроса=ТекстЗапроса+"
			|	И Анкета.Клиент = &Клиент";
		конецесли;
		
	
		
		ЗапросДругих=Новый Запрос(ТекстЗапроса);
			ЗапросДругих.УстановитьПараметр("ДН",НачалоДня(Отчет.ДатаНачалаПериода));					
		ЗапросДругих.УстановитьПараметр("ДК",КонецДня(Отчет.ДатаОкончанияПериода));
		Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
			ЗапросДругих.УстановитьПараметр("НомерВРезерв",Отчет.ФильтрПоНомеру);					
		конецесли;
		
		Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
			ЗапросДругих.УстановитьПараметр("Клиент",Отчет.ФильтрПоГостю);					
		конецесли;

		ТЗД=ЗапросДругих.Выполнить().Выгрузить();
		КолвоД=?(ТЗД.Количество()=0,0,ТЗД[0].ДругиеЦели);
		
		Если ТЗ.Количество()<>0 тогда
			Обл=макет.ПолучитьОбласть("СтрокаЦель");
			Проц=100;
			Для каждого Стр Из ТЗ Цикл
				
				Обл.Параметры.Цель=Стр.Цель;
				П=Окр(Стр.Колво/Стр.Ссылка*100);
				Проц=Проц-П;
				Обл.Параметры.Процент=?(Стр.Ссылка=0,"0%",Строка(П)+"%");
				ТабДок.Вывести(Обл);
				
			КонецЦикла; 
			
			
			Обл.Параметры.Цель="Другая цель";
			Обл.Параметры.Процент=Строка(КолвоД)+"%";
			ТабДок.Вывести(Обл);
			
			Проц=Проц-КолвоД;
			Если Проц<0 тогда 
				Проц=0;
				
				КонецЕсли;
			Обл.Параметры.Цель="Не указанна";
			Обл.Параметры.Процент=Строка(Проц)+"%";
			ТабДок.Вывести(Обл);
		конецесли;
		
		
		// характеристики
		
		Обл=макет.ПолучитьОбласть("ШапкаХар");
		ТабДок.Вывести(Обл);
		ТекстЗапроса="ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АнкетаХарактеристикиОтеля.Ссылка) КАК Ссылка,
		|	СУММА(ВЫБОР
		|			КОГДА АнкетаХарактеристикиОтеля.Подходит
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КолВо,
		|	АнкетаХарактеристикиОтеля.Характеристика
		|ИЗ
		|	Документ.Анкета.ХарактеристикиОтеля КАК АнкетаХарактеристикиОтеля
		|ГДЕ
		|	АнкетаХарактеристикиОтеля.Ссылка.Дата МЕЖДУ &Дн И &ДК";
		
		Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
			ТекстЗапроса=ТекстЗапроса+"
			|	И АнкетаХарактеристикиОтеля.Ссылка.Бронь.НомерВРезерв = &НомерВРезерв";
		конецесли;
		
		Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
			ТекстЗапроса=ТекстЗапроса+"
			|	И АнкетаХарактеристикиОтеля.Ссылка.Клиент = &Клиент";
		конецесли;
		
		ТекстЗапроса=ТекстЗапроса+"
		|СГРУППИРОВАТЬ ПО
		|	АнкетаХарактеристикиОтеля.Характеристика";
		
		
		Запрос=Новый Запрос(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДатаНачалаПериода));					
		Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДатаОкончанияПериода));
		
		Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
			Запрос.УстановитьПараметр("НомерВРезерв",Отчет.ФильтрПоНомеру);					
		конецесли;
		
		Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
			Запрос.УстановитьПараметр("Клиент",Отчет.ФильтрПоГостю);					
		конецесли;
		
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество()<>0 тогда
			Обл=макет.ПолучитьОбласть("СтрокаХар");
			Проц=100;
			Для каждого Стр Из ТЗ Цикл
				
				Обл.Параметры.Характеристика=Стр.Характеристика;
				П=Окр(Стр.Колво/Стр.Ссылка*100);
				Проц=Проц-П;
				Обл.Параметры.Процент=?(Стр.Ссылка=0,"0%",Строка(П)+"%");
				ТабДок.Вывести(Обл);
				
			КонецЦикла; 
		конецесли;
		ТекстЗапроса="ВЫБРАТЬ
		             |	Анкета.Понравилось,
		             |	Анкета.НеПонравилось,
		             |	Анкета.Бронь.НомерВРезерв КАК Ном,
		             |	Анкета.Бронь.РезервС КАК РезервС,
		             |	Анкета.Бронь.РезервПо КАК РезервПо
		             |ИЗ
		             |	Документ.Анкета КАК Анкета
		             |ГДЕ
		             |	Анкета.Дата МЕЖДУ &Дн И &ДК
		             |	И (Анкета.Понравилось <> &Пусто
		             |			ИЛИ Анкета.НеПонравилось <> &Пусто)";
		
		Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
			ТекстЗапроса=ТекстЗапроса+"
			|	И Анкета.Бронь.НомерВРезерв = &НомерВРезерв";
		конецесли;
		
		Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
			ТекстЗапроса=ТекстЗапроса+"
			|	И Анкета.Клиент = &Клиент";
		конецесли;
		
		ТекстЗапроса=ТекстЗапроса+"
	|УПОРЯДОЧИТЬ ПО
		|	Анкета.Дата";
		

		ЗапросПН=Новый Запрос(ТекстЗапроса);
		ЗапросПН.УстановитьПараметр("ДН",НачалоДня(Отчет.ДатаНачалаПериода));					
		ЗапросПН.УстановитьПараметр("ДК",КонецДня(Отчет.ДатаОкончанияПериода));
		ЗапросПН.УстановитьПараметр("Пусто","");
		Если НЕ Отчет.ФильтрПоНомеру.Пустая() тогда
			ЗапросПН.УстановитьПараметр("НомерВРезерв",Отчет.ФильтрПоНомеру);					
		конецесли;
		
		Если НЕ Отчет.ФильтрПоГостю.Пустая() тогда
			ЗапросПН.УстановитьПараметр("Клиент",Отчет.ФильтрПоГостю);					
		конецесли;
		

		ТЗ=ЗапросПН.Выполнить().Выгрузить();
		Если ТЗ.Количество()<>0 тогда
			Обл=макет.ПолучитьОбласть("ШапкаПН");
			ТабДок.Вывести(Обл);
			Для каждого Стр Из ТЗ Цикл
				
				Обл=макет.ПолучитьОбласть("СтрокаПН");
				Обл.Параметры.Заполнить(Стр);
				ТабДок.Вывести(Обл);
			КонецЦикла; 
		конецесли;
		
		Возврат ТабДок;		
		//ТабДок.Показать();
	конецесли;
КонецФункции


