
//
&НаКлиенте
Процедура СоздатьПодтвержедение(Команда)
ПараметрыФормы = Новый Структура();

ПараметрыФормы.Вставить("ДокументДолгСсылка", ЗаявкаСсылка()); 	
//ПараметрыФормы.Вставить("ДокументДолгСсылка", ГрупповойСчетСсылка());

ПараметрыФормы.Вставить("ИмяФайла", "Подтверждение"); 	

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормыСозданиеПодтверждения", ЭтаФорма);	
Форма = ОткрытьФорму("ОбщаяФорма.СозданиеПодтвержденияExcel", ПараметрыФормы , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
Форма.Запустить();	
КонецПроцедуры

&НаСервере
Функция ЗаявкаСсылка()
ЗаявкаСсылка = Документы.ЗаявкаНаБронирование.НайтиПоНомеру("000000004"); 

Возврат ЗаявкаСсылка; 
КонецФункции

&НаСервере
Функция ГрупповойСчетСсылка()
ГрупповойСчетСсылка = Документы.ГрупповыеСчета.НайтиПоНомеру("000000001"); 

Возврат ГрупповойСчетСсылка; 
КонецФункции

&НаКлиенте
Процедура ЗавершениеФормыСозданиеПодтверждения(Результат, ДополнительныеПараметры) Экспорт
Сообщить(Результат);	
	
КонецПроцедуры
//	

&НаКлиенте
Процедура ПечатьИОтправкаПодтверждения(Команда)
ТабличныйДокумент = Новый ТабличныйДокумент; 
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТабличныйДокумент", ТабличныйДокумент);

ЗаявкаСсылка = ЗаявкаСсылка();
ПараметрыФормы.Вставить("ДокументДолгСсылка", ЗаявкаСсылка);

ПараметрыФормы.Вставить("ВыводСчета", Истина);
ПараметрыФормы.Вставить("ВыводПодтверждения", Истина);

Контрагент = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ЗаявкаСсылка, "Клиент");
ПараметрыФормы.Вставить("Контрагент", Контрагент);

ОткрытьФорму("ОбщаяФорма.ПечатьИОтправкаНаПочтуСчетаИПодтверждения", ПараметрыФормы , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
//йй = ПолучитьИнформациюЭкрановКлиента();	
	
ТестНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеПроживание.Ссылка КАК Заявка,
                      |	СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма,
                      |	СУММА(ЗаявкаНаБронированиеПроживание.СуммаБезСкидки) КАК СуммаБезСкидки,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.Клиент КАК Клиент,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.РезервС КАК РезервС,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.РезервПо КАК РезервПо,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.Оплачивает КАК Оплачивает
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |ГДЕ
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеПроживание.Ссылка.РезервС >= &НачалоРезервС
                      |	И ЗаявкаНаБронированиеПроживание.Ссылка.РезервС <= &ОкончаниеРезервС
                      |	И ЗаявкаНаБронированиеПроживание.Ссылка.Бронирует = &Бронирует
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЗаявкаНаБронированиеПроживание.Ссылка,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.Клиент,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.РезервС,
                      |	ЗаявкаНаБронированиеПроживание.Ссылка.Оплачивает
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	РезервС,
                      |	Клиент");

Запрос.УстановитьПараметр("НачалоРезервС", НачалоДня(Дата('20220301')));
Запрос.УстановитьПараметр("ОкончаниеРезервС", НачалоДня(Дата('20220331')));

Бронирует = Справочники.Клиенты.НайтиПоНаименованию("ООО ""Бронирование");
Запрос.УстановитьПараметр("Бронирует", Бронирует);


Таблица = Запрос.Выполнить().Выгрузить();

//

	Реквизиты = Новый Массив;
	Реквизиты.Добавить(Новый РеквизитФормы("ТаблицаНаФорме", Новый ОписаниеТипов("ТаблицаЗначений")));
	Для Каждого Ст ИЗ Таблица.Колонки Цикл
		Реквизиты.Добавить(Новый РеквизитФормы(Ст.Имя, Ст.ТипЗначения, "ТаблицаНаФорме"));
	КонецЦикла;

	// добавим реквизиты на форму
	ИзменитьРеквизиты(Реквизиты);

	// добавим элементы формы
	Таб = Элементы.Добавить("ТаблицаНаФорме", Тип("ТаблицаФормы"));
	Таб.ПутьКДанным = "ТаблицаНаФорме";

	//// запретим менять положение строк и сами строки, отключим командную панель
	//Таб.ИзменятьСоставСтрок = Ложь;
	//Таб.ИзменятьПорядокСтрок = Ложь;
	//Таб.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;

	Для Каждого Ст ИЗ Таблица.Колонки Цикл
		Рек = Элементы.Добавить("Колонка" + Ст.Имя, Тип("ПолеФормы"), Таб);
		Рек.Вид = ВидПоляФормы.ПолеНадписи;
		Рек.ПутьКДанным = "ТаблицаНаФорме" + "." + Ст.Имя;
		Рек.Заголовок = Ст.Имя;
	КонецЦикла;

	// заполним таблицу
	ЗначениеВРеквизитФормы(Таблица, "ТаблицаНаФорме");


КонецПроцедуры



//////// ++++++++++++++++++++++++++++++++++++++

&НаСервере
Функция ОтчетПодтверждениеНаСервере()
ТД = Новый ТабличныйДокумент;	

Макет = ПолучитьОбщийМакет("ПодтверждениеБронирования");
Область = Макет.ПолучитьОбласть("Логотип");
ТД.Вывести(Область);

Область1 = Макет.ПолучитьОбласть("Заголовок");
ТД.Вывести(Область1);

Область2 = Макет.ПолучитьОбласть("Подножие");
ТД.Вывести(Область2);

Возврат ТД;
КонецФункции

//
&НаКлиенте
Процедура ОтчетПодтверждение(Команда)
	ТабДок = ОтчетПодтверждениеНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыбора(Команда)
ОткрытьФорму("Справочник.ДопУслуги.Форма.ФормаВыбора", , Элементы.Реквизит1 
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Подтверждение(Команда)
//Табдок = ПечатьПодтверждения();
//Табдок = ПотверждениеБрониПечатьКлиент.ПечатьПодтверждения();

//Табдок.Показать();
КонецПроцедуры

&НаКлиенте
Функция ПечатьПодтверждения() Экспорт
МойДокументВДвоичныхДанных = ПолучитьМакетНовоеПодтверждениеВДвоичныхДанных();

ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xls");
МойДокументВДвоичныхДанных.Записать(ИмяВременногоФайла);

Excel = Новый COMОбъект("Excel.Application");	   
Книга = Excel.WorkBooks.Open(ИмяВременногоФайла);

Лист = Книга.WorkSheets(1);
Для Индекс = 0 По 10 Цикл
	Лист.Rows("3").Select();
	Лист.Rows("3").Copy();

	ИндексСтрока = Строка(3 + Индекс);
	Лист.Rows(ИндексСтрока).Insert();
КонецЦикла;

Попытка
	Excel.Application.DisplayAlerts = False; 
	Книга.SaveAs("C:\Users\postnikov_sn\Desktop\Книга2.xls");
	Книга.Close();
	Excel.Quit();	
Исключение
	Книга.Close();
	Excel.Quit();
КонецПопытки;

КонецФункции	

&НаСервере
Функция ПолучитьМакетНовоеПодтверждениеВДвоичныхДанных() Экспорт
	
//Макет = ПолучитьОбщийМакет("МакетExcel");
//ИмяВрем = ПолучитьИмяВременногоФайла(".xls");

//Макет.Записать(ИмяВрем);

//МойДокументВДвоичныхДанных = Новый ДвоичныеДанные(ИмяВрем);

//Возврат МойДокументВДвоичныхДанных;
	
КонецФункции	
//

&НаКлиенте
Процедура ЗагрузитьОплаты(Команда)
БезналРаспределениеСервер.Тест();	
КонецПроцедуры

//

&НаКлиенте
Процедура ЭТ(Команда)
ОткрытьФорму("ОбщаяФорма.УправлениеЭТ");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаФинРезультат(Команда)
Начало = ТекущаяДата();	

	ДатаПо = КонецДня(ТекущаяДата() + 365 * 24 * 60 *60);
	ДатаС = НачалоДня(ТекущаяДата() - 90 * 24 * 60 *60);

ТД = ВыгрузкаФинРезультатСервер.СформироватьФинРезультат(ДатаС, ДатаПо);
//ТД = ВыгрузкаФинРезультатСервер.ВыгрузитьФинРезультатНаСервере(НачалоДня('20230601'), НачалоДня(ТекущаяДата()), Истина);
//ТД = ВыгрузкаФинРезультатСервер.ВыгрузитьФинРезультатКоворкингНаСервере(НачалоДня('20230601'), НачалоДня(ТекущаяДата()), Истина);
Конец = ТекущаяДата();	
Сообщить("Начало: " + Начало + " Конец: " + Конец); 

//Если ТД <> Неопределено Тогда 
//	ТД.Показать();
//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаФинРезультат_расширенный(Команда)
Начало = '20230101';
Конец = '20231231';

//ТД = ВыгрузкаФинРезультат_Расширенный.ВыгрузитьФинРезультат(НачалоДня('20230601'), НачалоДня(ТекущаяДата()), Истина);
ТД = ВыгрузкаФинРезультат_Расширенный.ВыгрузитьФинРезультатКоворкинг(Начало, Конец, Истина);
Конец = ТекущаяДата();	
Сообщить("Начало: " + Начало + " Конец: " + Конец); 

//Если ТД <> Неопределено Тогда 
//	ТД.Показать();
//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВыборЭТ(Команда)
ОткрытьФорму("РегистрСведений.ОперацииЭТ.Форма.ФормаВыбораЭТ");	
КонецПроцедуры
//

&НаКлиенте
Процедура ФормаСпискаКлиенты(Команда)
ОткрытьФорму("Обработка.ТЕСТ.Форма.ФормаСпискаКлиенты");
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьФайла(Команда)
	ЗаписатьФайл();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФайл()
Путь = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
Путь = Путь + "ЛогВыгрузки_ФинРезультат.txt";	
	
Текст = Новый ЗаписьТекста(Путь,,, Истина);
Текст.ЗаписатьСтроку("Добро пожаловать!");
    Текст.ЗаписатьСтроку("Посторонним вход воспрещен.");
    Текст.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаФинРезультатВыгрузка(Команда)
	//ДатаПо = КонецДня(ТекущаяДата() + 365 * 24 * 60 *60);
	//ДатаС = НачалоДня(ТекущаяДата() - 90 * 24 * 60 *60);
	
	ДатаПо = ТекущаяДата();
	ДатаС = '20230601';
	ВыгрузкаФинРезультатСервер.ВыгрузитьФинРезультат(ДатаС, ДатаПо, Истина);

	ВыгрузкаФинРезультатСервер.ВыгрузитьФинРезультатКоворкинг(ДатаС, ДатаПо, Истина);
	
	ВыгрузкаФинРезультат_Расширенный.ВыгрузитьФинРезультат(ДатаС, ДатаПо, Истина);

	ЗавершитьРаботуСистемы(Ложь);

КонецПроцедуры


&НаКлиенте
Процедура ПроверкаWhatsApp(Команда)
ПроверкаWhatsAppНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаWhatsAppНаСервере()
//Результат = WhatsAppСервер.ОтправитьWhatsAppТекст("+79826236241", "Привет из Теста");	

//Если Результат.Ошибка Тогда
//	Сообщить("ошибка: " + Результат.Описание);
//Иначе
//	Сообщить("Нет ошибок");
//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаВыписки(Команда)
ЗагрузкаВыпискиГостиница.ЗагрузкаВыписки();
КонецПроцедуры

//
&НаКлиенте
Процедура ВыгрузкаФинРезультатов(Команда)
	ВыгрузкаФинРезультатовНаСервере();
//	ПрекратитьРаботуСистемы();
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаФинРезультатовНаСервере()
//ДатаС = '20230101';
//ДатаПо = '20231231';
ДатаС = '20240320';
ДатаПо = '20240331';
ВыгрузкаФинРезультатов.ВыгрузкаФинРезультатов(ДатаС, ДатаПо, Истина); 

КонецПроцедуры

&НаКлиенте
Процедура Диаграмма(Команда)
ПостроитьГрафикНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПостроитьГрафикНаСервере()
	
	//Серия = Диаграмма_1.Серии.Добавить("АБВГД");	
	Серия = Диаграмма_1.Серии.Добавить("АБ");	
	//СимволСерия =  КодСимвола(Серия, 1); 
	
	Для Значение = 1 По 10 Цикл
		
		Точка = Диаграмма_1.УстановитьТочку(Значение);
		Диаграмма_1.УстановитьЗначение(Точка, Серия, Значение);
		
		//СимволСерия = СимволСерия + 1;
		//ИмяСерия = "А" + Символ(СимволСерия);
		//Серия = Диаграмма_1.Серии.Добавить(ИмяСерия);	
	
	КонецЦикла;
	
	//Область = ТД.Область(2, 3, 4, 5);
	МакетОбработки = Обработки.Тест.ПолучитьМакет("Макет");
	
	ОбластьМакета = МакетОбработки.ПолучитьОбласть("Диа");
	//ПутьККартинке = "G:Логотип.png";
	//Картинка = Новый Картинка(ПутьККартинке);
	
	//Картинка = Новый Картинка();

	//ОбластьМакета.Рисунки.D1.Картинка = Картинка;
	
	Диа= ОбластьМакета.Рисунки.D1;
	
	Диаграм = Диа.Объект;
	
	Серия = Диаграм.Серии.Добавить("АБ");	
	//СимволСерия =  КодСимвола(Серия, 1);
	Цвет = Новый Цвет(255, 0, 0);
	Серия.Цвет = Цвет;
	Для Значение = 1 По 10 Цикл
		
		Точка = Диаграм.УстановитьТочку("А" + Строка(Значение) + "    ");
		//Точка.Текст = "То";
		Диаграм.УстановитьЗначение(Точка, Серия, Значение);
		
		//СимволСерия = СимволСерия + 1;
		//ИмяСерия = "А" + Символ(СимволСерия);
		//Серия = Диаграмма_1.Серии.Добавить(ИмяСерия);	
	
	КонецЦикла;

	
	ТД.Вывести(ОбластьМакета);  
	
//	
	
	ОбластьМакета = МакетОбработки.ПолучитьОбласть("Круг");

	Круг= ОбластьМакета.Рисунки.D1;
	Диаграм = Круг.Объект;
	
		
ТЗДиаграммы = Новый ТаблицаЗначений;
  ТЗДиаграммы.Колонки.Добавить("Измерение1");
  ТЗДиаграммы.Колонки.Добавить("Измерение2");
  ТЗДиаграммы.Колонки.Добавить("Точка");
  ТЗДиаграммы.Колонки.Добавить("Ресурс1");
  ТЗДиаграммы.Колонки.Добавить("Ресурс2");

  НовСтр = ТЗДиаграммы.Добавить();
  НовСтр.Измерение1="Склад1";
  НовСтр.Измерение2="Склад2";
  НовСтр.Точка="01/01/01";
  НовСтр.Ресурс1=10;
  НовСтр.Ресурс2=15;
 
  НовСтр = ТЗДиаграммы.Добавить();
  НовСтр.Измерение1="Склад1";
  НовСтр.Измерение2="Склад2";
  НовСтр.Точка="01/02/01";
  НовСтр.Ресурс1=5;
  НовСтр.Ресурс2=9;

 
   // Заполнить диаграмму
  Для Каждого ТекСтр из ТЗДиаграммы цикл
       // Получить серию, точку и значение для них
       ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение1);
       ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
       Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс1, ,) ;
     
	   ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
	   //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
	   Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
	   
	  //ТекущаяСерия = Диаграм.УстановитьСерию(ТекСтр.Измерение2);
	  //ТекущаяТочка = Диаграм.УстановитьТочку(ТекСтр.Точка);
	  // Диаграм.УстановитьЗначение(ТекущаяТочка, ТекущаяСерия, ТекСтр.Ресурс2, ,) ;
   КонецЦикла;
   
  //// Раскрасить серии своими цветами
  //Для Каждого Серия из Диаграмма.Серии Цикл
  //   Если Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
  //      Серия.Цвет = WEBЦвета.Желтый;
  //   ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
  //      Серия.Цвет = WEBЦвета.Зеленый;
  //   ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Невыход Тогда
  //      Серия.Цвет = WEBЦвета.Красный;
  //   КонецЕсли;
  //КонецЦикла;
   
   // Разрешить обновление диаграммы
   Диаграм.Обновление = Истина;
 
  ТД.Вывести(ОбластьМакета);
  ТД.Защита = Ложь;
  ТД.ТолькоПросмотр = Истина;		
		
КонецПроцедуры 


&НаКлиенте
Процедура Заявки_КривыеРаспределения(Команда)
	Заявки_КривыеРаспределенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура Заявки_КривыеРаспределенияНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |ГДЕ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Ссылка");

ТЗ = Запрос.Выполнить().Выгрузить();

Заявка = Неопределено;
Для Каждого Строка Из ТЗ Цикл
	Если ЗначениеЗаполнено(Строка.ДокументОплаты) Тогда Продолжить; КонецЕсли;
	Если  Строка.Ссылка = Заявка Тогда Продолжить; КонецЕсли;
	Сообщить(Строка.Ссылка);
	Заявка = Строка.Ссылка;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Картинка(Команда)
КартинкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура КартинкаНаСервере()
//ДвоичныеДанные    = Новый ДвоичныеДанные("C:\_Base1C\ЛАЙВ - Тест - ПСН\ОбразцыДокументов\Подтвержение_Лайв.JPG");
//ХранилищеКартинки = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));

//Данные = Новый Структура("ХранилищеКартинки", ХранилищеКартинки);

ИмяФайла =  "C:\_Base1C\ЛАЙВ - Тест - ПСН\ОбразцыДокументов\Подтвержение_Лайв.JPG";
ОбменКартинкаСервер.ВыгрузитьКартинку(ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчета(Команда)
ПолеОтчетаНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПолеОтчетаНаСервере()
	МакетОбработки = Обработки.Тест.ПолучитьМакет("Макет1");
	
	Область = МакетОбработки.ПолучитьОбласть("Строка");
	
	Область.Область("R1C2").Значение = "йцйцй";
	//ПолеТабДок.Область("R3C3").Значение = СпрНоменклатура.Услуга; 
	
	ПолеОтчета.Вывести(Область);
		Область.Область("R1C2").Значение = "123";

	ПолеОтчета.Вывести(Область);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

//
&НаКлиенте
Процедура ПолучитьHTTP(Команда)
Результат = HTTP_Модуль.ПолучитьЗаселения(ДатаС, ДатаПо, "СерверЛайвHTTP");	

Если Результат.Ошибка Тогда Возврат; КонецЕсли;

Если Результат = Неопределено Тогда 
	Сообщить("Ошибка подготовки данных в сервисе HTTP Лайв");
	Возврат; 
КонецЕсли;

Данные = Результат.Данные; 
Для Каждого Строка Из Данные Цикл
	
КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьHTTP_1(Команда)
// Создаем HTTPСоединение, указываем сервер
Результат = ПолучитьАдреса();
Соединение = Новый HTTPСоединение(Результат.СерверДляЗапроса);
//ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
//// Запросим имя файла, который будет сохранен. По умолчанию расширение png
//СтрФильтр = НСтр(«ru = ‘Файл'») + «(*.»+»png»+»)|*.»+ «png»;
//ДиалогОткрытияФайла.Фильтр = СтрФильтр;
//ДиалогОткрытияФайла.Заголовок = «Укажите имя файла»;
//ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
//Если ДиалогОткрытияФайла.Выбрать() Тогда
// Выполнить GET запрос:
//HTTPОтвет = Соединение.Получить(Результат.ТекстДляЗапроса);
//Строка = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
HTTPОтвет = Соединение.Получить(Результат.ТекстДляЗапроса, "C:\_Base1C\1.txt");
Сообщить("Удачно выполнен GET запрос!");

чтение = Новый ЧтениеJSON;
чтение.ОткрытьФайл("C:\_Base1C\1.txt");
    
ВСоответствие = Ложь;
рез = ПрочитатьJSON(чтение, ВСоответствие);
    
чтение.Закрыть();

//Иначе                          
//Сообщить(«Не выбран файл!»);
//КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдреса()
//СерверДляЗапроса = «programmist1s.ru»;
//ТекстДляЗапроса = «/wp-content/themes/govpress-new/images/GOODWILL.png»;

СерверДляЗапроса = "127.0.0.1";
//ТекстДляЗапроса = "/HTTP_Service/hs/products/get_product?param1=123";
ТекстДляЗапроса = "/HTTP_Service/hs/products/get_product/date_from/12.30.2024/date_to/www";

 
Результат = Новый Структура("СерверДляЗапроса, ТекстДляЗапроса", СерверДляЗапроса, ТекстДляЗапроса); 
Возврат Результат; 
КонецФункции	



&НаКлиенте
Процедура ВыгрузитьЗаселения(Команда)
	ВыгрузитьЗаселенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЗаселенияНаСервере()
ДатаС_П = Формат(ДатаС, "ДФ=dd.MM.yyyy"); 	
ДатаПо_П = Формат(ДатаПо, "ДФ=dd.MM.yyyy"); 	
	
	
ТЗ = ОбменHTTP.ВыгрузитьЗаселения(ДатаС_П, ДатаПо_П);	
КонецПроцедуры

//
&НаКлиенте
Процедура ТестНомераТелефона(Команда)
Ответ = СлужебныеКлиентСервер.ПроверкаНомераТелефона(НомерТелефона); 
Сообщить("Ошибка: " + Ответ.КодОшибки + ", Телефон: " + Ответ.ТелефонНомер);  
КонецПроцедуры

//
&НаКлиенте
Процедура КлиентНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_КлиентНаименованиеНачалоВыбора", ЭтаФорма);

ОткрытьФорму("Справочник.Клиенты.Форма.ФормаВыбора", , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_КлиентНаименованиеНачалоВыбора(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

Клиент = Результат;
КлиентНаименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Результат, "НаименованиеЮрЛица");
КонецПроцедуры

&НаКлиенте
Процедура КлиентНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ПараметрыФормы = Новый Структура("Ключ", Клиент);

ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//
&НаКлиенте
Процедура ЗагрузкаБухгалтерия(Команда)
	ЗагрузкаБухгалтерияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаБухгалтерияНаСервере()
ЗагрузкаВыпискиГостиница.ЗагрузкаВыписки();
КонецПроцедуры


&НаКлиенте
Процедура РассылкаWhatsApp(Команда)
	РассылкаWhatsAppНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассылкаWhatsAppНаСервере()
	ДатаРассылки = НачалоДня(ТекущаяДата());
	РассылкаWhatsApp.РассылкаWhatsApp(ДатаРассылки);
КонецПроцедуры

//
&НаКлиенте
Процедура ОтправкаЗакрытиеФинасовогоПериода(Команда)
МассивПолучатели = Новый Массив;
МассивПолучатели.Добавить("postnikov_sn@invina.ru");
	
ПисьмаКлиент.ОтправитьЗакрытиеФинансовогоПериода(МассивПолучатели, '20240201', '20240229');
КонецПроцедуры

&НаКлиенте
Процедура БН_Коворкинг(Команда)
ПараметрыФормы = Новый Структура("КоворкингФорма", -1);	
ОткрытьФорму("ОбщаяФорма.БезналРаспределение_ТЕСТ", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура БН_Отели(Команда)
ПараметрыФормы = Новый Структура("КоворкингФорма", 1);	
ОткрытьФорму("ОбщаяФорма.БезналРаспределение_ТЕСТ", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура БНВсе(Команда)
ПараметрыФормы = Новый Структура("КоворкингФорма", 0);	
ОткрытьФорму("ОбщаяФорма.БезналРаспределение_ТЕСТ", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСменуКоворкинг(Команда)
ДопПараметры = Новый Структура;

Ответ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
Кассир = Ответ.Кассир;

ДопПараметры.Вставить("Кассир",Кассир);
ДопПараметры.Вставить("КассирИНН","");
ДопПараметры.Вставить("ЭтоКоворкинг",Истина);

ОповещениеЗавершение = Новый ОписаниеОповещения("Завершение_ОткрытиеСменыКоманда", ЭтаФорма);

ФУ_Клиент.ОткрытьСмену(ЭтаФорма, ОповещениеЗавершение, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура Завершение_ОткрытиеСменыКоманда(Результат, ДополнительныеПараметры) Экспорт
Сообщить(Результат.ТекстСообщения);
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьСменуКоворкинг(Команда)
	ОчиститьСообщения();

	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросЗакрытиеСменыКоворкинг", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Подтвердите закрытие смены КОВОРКИНГ ...", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросЗакрытиеСменыКоворкинг(Результат, ДопПараметры) Экспорт
Если Результат <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
ДопПараметры = Новый Структура;

Ответ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
Кассир = Ответ.Кассир;

ДопПараметры.Вставить("Кассир",Кассир);
ДопПараметры.Вставить("КассирИНН","");
ДопПараметры.Вставить("ЭтоКоворкинг",Истина);

ОповещениеЗавершение = Новый ОписаниеОповещения("Завершение_ЗакрытиеСменыКоманда", ЭтаФорма);

ФУ_Клиент.ЗакрытьСмену(ЭтаФорма, ОповещениеЗавершение, ДопПараметры); 
КонецПроцедуры

&НаКлиенте
Процедура Завершение_ЗакрытиеСменыКоманда(Результат, ДополнительныеПараметры) Экспорт
Сообщить(Результат.ТекстСообщения);
КонецПроцедуры
//

&НаКлиенте
Процедура БезГашенияКоворкинг(Команда)
ДопПараметры = Новый Структура;

Ответ = ФУ_Сервер.ПолучитьДанныеОрганизацииДляФУ();
Кассир = Ответ.Кассир;

ДопПараметры.Вставить("Кассир",Кассир);
ДопПараметры.Вставить("КассирИНН","");
ДопПараметры.Вставить("ЭтоКоворкинг",Истина);

ОповещениеЗавершение = Новый ОписаниеОповещения("Завершение_ОтчетБезГашенияКоманда", ЭтаФорма);

ФУ_Клиент.ОтчетБезГашения(ЭтаФорма, ОповещениеЗавершение, ДопПараметры); 
КонецПроцедуры

&НаКлиенте
Процедура Завершение_ОтчетБезГашенияКоманда(Результат, ДополнительныеПараметры) Экспорт
Сообщить(Результат.ТекстСообщения);
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьЗаявкиJSON(Команда)
ОбменБухгалтерияНДС.ЗаписатьФайлСообщение(ДатаС, ДатаПо);
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьОтчетДляПевзенра(Команда)
ОткрытьФорму("РегистрСведений.ЕжедневныйОтчетФакт.Форма.ФормаНабораЗаписей");	
КонецПроцедуры



//
&НаКлиенте
Процедура ТестГруппировкаОтчет(Команда)
ТабДок = ТестГруппировкаОтчетНаСервере(); 	
ТабДок.Показать("Пример использования метода НачатьГруппуСтрок");
КонецПроцедуры

&НаСервере
Функция ТестГруппировкаОтчетНаСервере()
	
ТабДок = Новый ТабличныйДокумент;
Секция = ТабДок.ПолучитьОбласть("R1");
//Секция.Область("R1C1").Текст = "Численность сотрудников";
//ТабДок.Вывести(Секция);
//ТабДок.НачатьГруппуСтрок("По всем подразделениям", Истина);

Всего = 0;
Для Н=1 По 3 Цикл   
    Значение = Н; Итог = 0;  
	//Секция.Область("R1C1").Текст = "Отдел "+Н;
	//Секция.Область("R1C2").Текст = "";
	//ТабДок.Вывести(Секция);
	//ТабДок.НачатьГруппуСтрок("Отдел"+Н, Истина);
	
	//Секция.Область("R1C1").Текст = "Группа";
	//Секция.Область("R1C2").Текст = "Численность";
	//Секция.Область("R1C2").ГоризонтальноеПоложение = 
	//    ГоризонтальноеПоложение.Авто;
	//ТабДок.Вывести(Секция);
	
	//ТабДок.НачатьГруппуСтрок("Группа "+Н, Истина);
    Для К=1 По 4 Цикл
        Секция.Область("R1C1").Текст = "А"+Н+К;
        Секция.Область("R1C2").Текст = Значение;
        ТабДок.Вывести(Секция);
        Итог = Итог + Значение;
        Значение = Значение + 10;
		
		Если К=1 Тогда 
			ТабДок.НачатьГруппуСтрок("Группа "+Н, Истина);
		КонецЕсли;
	КонецЦикла;
	
	//Секция.Область("R1C1").Текст = "Итого"+Н;
	//Секция.Область("R1C2").Текст = Итог;
	//ТабДок.Вывести(Секция);
	//Секция.Область("R1C1:R1C2").Текст = "";
	//ТабДок.Вывести(Секция);
	//Всего = Всего + Итог;
	
	ТабДок.ЗакончитьГруппуСтрок(); // окончить группу "Группа"

	//ТабДок.ЗакончитьГруппуСтрок(); // окончить группу "Отдел"
	//ТабДок.НачатьГруппуСтрок("Группа ", Истина);

	Секция.Область("R1C1").Текст = "Итого"+Н;
	Секция.Область("R1C2").Текст = Итог;
	ТабДок.Вывести(Секция);
	
	//ТабДок.ЗакончитьГруппуСтрок(); // окончить группу "Группа"
	
	//Секция.Область("R1C1:R1C2").Текст = "";
	//ТабДок.Вывести(Секция);
	Всего = Всего + Итог;
КонецЦикла;
//ТабДок.ЗакончитьГруппуСтрок(); // окончить группу "По всем отделам"

//Секция.Область("R1C1").Текст = "Всего:";
//Секция.Область("R1C2").Текст = Всего;
//ТабДок.Вывести(Секция);

ТабДок.ИтогиСнизу = Ложь;
ТабДок.ОтображатьСетку = Ложь;
ТабДок.Защита = Ложь;
ТабДок.ТолькоПросмотр = Истина;

Возврат ТабДок;
	
КонецФункции


//
&НаКлиенте
Процедура ОбновитьСкидкаКлиентаБоншанс(Команда)
	ОбновитьСкидкаКлиентаБоншансНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСкидкаКлиентаБоншансНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.БонШанс = ИСТИНА
                      |	И ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.СкидкаКлиента <> 0");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	ЗаявкаОбъект.СкидкаКлиента = 0;
	ЗаявкаОбъект.УровеньСкидкиКлиента = 0;
	
	Попытка
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка проведения " + ЗаявкаОбъект.Ссылка + " - " +ОписаниеОшибки());
	КонецПопытки;		
КонецЦикла;
КонецПроцедуры
//


//
&НаКлиенте
Процедура УстановитьУровеньСкидки(Команда)
	УстановитьУровеньСкидкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьУровеньСкидкиНаСервере()
ЗапросЗаявки = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.СкидкаКлиента <> 0");
ТЗЗаявки = ЗапросЗаявки.Выполнить().Выгрузить();	

ЗапросСкидки = Новый Запрос("ВЫБРАТЬ
                      |	СкидкиКлиента.КоличествоНочей КАК КоличествоНочей,
                      |	СкидкиКлиента.Скидка КАК Скидка,
                      |	СкидкиКлиента.Уровень КАК Уровень
                      |ИЗ
                      |	РегистрСведений.СкидкиКлиента КАК СкидкиКлиента
                      |ГДЕ
                      |	СкидкиКлиента.Скидка = &Скидка
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоличествоНочей");

СкидкаКлиента = 0;
Для Каждого Строка Из ТЗЗаявки Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	ЗапросСкидки.УстановитьПараметр("Скидка", Строка.Ссылка.СкидкаКлиента); 
	
	ТЗСкидки = ЗапросСкидки.Выполнить().Выгрузить();
	Если ТЗСкидки.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	ЗаявкаОбъект.УровеньСкидкиКлиента = ТЗСкидки[0].Уровень;
	
	Попытка
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка проведения " + ЗаявкаОбъект.Ссылка + " - " +ОписаниеОшибки());
	КонецПопытки;	
КонецЦикла;
КонецПроцедуры
//
