
&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//Макет=ПолучитьМакет("Макет");
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//                    |	ЗаявкаНаБронирование.Ссылка
	//                    |ИЗ
	//                    |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                    |ГДЕ
	//                    |	ЗаявкаНаБронирование.Ссылка В
	//                    |			(ВЫБРАТЬ
	//                    |				ЗанятостьНомеров.Регистратор
	//                    |			ИЗ
	//                    |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//                    |			ГДЕ
	//                    |				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//                    |				И ЗанятостьНомеров.Зарезервирован = ИСТИНА)
	//                    |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	//                    |
	//                    |УПОРЯДОЧИТЬ ПО
	//                    |	ЗаявкаНаБронирование.РезервС");
	//					
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//                    |	ЗанятостьНомеров.Регистратор,
	//                    |	НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) КАК ДТ,
	//                    |	ЗанятостьНомеров.Регистратор.НомерВРезерв КАК НОМ
	//                    |ИЗ
	//                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//                    |ГДЕ
	//                    |	ЗанятостьНомеров.Регистратор.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	//                    |	И ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА
	//                    |
	//                    |СГРУППИРОВАТЬ ПО
	//                    |	НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ),
	//                    |	ЗанятостьНомеров.Регистратор
	//                    |
	//                    |УПОРЯДОЧИТЬ ПО
	//                    |	ЗанятостьНомеров.Регистратор.РезервС");
	//					
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//                    |	ПроданныеНомера.ДатаПродажи КАК ДТ,
	//                    |	ПроданныеНомера.НомерВРезерв КАК НОМ,
	//                    |	ПроданныеНомера.СуммаЗаПроживаниеПлан,
	//                    |	ПроданныеНомера.СуммаЗаПроживание,
	//                    |	ПроданныеНомера.Бронь КАК Регистратор,
	//                    |	ПроданныеНомера.Комментарий,
	//                    |	ПроданныеНомера.Клиент
	//                    |ИЗ
	//                    |	РегистрСведений.ПроданныеНомера КАК ПроданныеНомера
	//                    |ГДЕ
	//                    |	ПроданныеНомера.ДатаПродажи МЕЖДУ &ДН И &ДК");
	//					
	//Запрос.УстановитьПараметр("ДН",НачалоДня(ДН));						
	//Запрос.УстановитьПараметр("ДК",КонецДня(ДК));
	//ЗапросОплаты=Новый Запрос("ВЫБРАТЬ
	//                          |	Деньги.Сумма,
	//                          |	Деньги.Период,
	//                          |	Деньги.Регистратор
	//                          |ИЗ
	//                          |	РегистрНакопления.Деньги КАК Деньги
	//                          |ГДЕ
	//                          |	Деньги.Оплата = &Оплата");	
	//Запрос2=Новый Запрос("ВЫБРАТЬ
	//                     |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПроданныеНомера.ДатаПродажи) КАК ДТ
	//                     |ИЗ
	//                     |	РегистрСведений.ПроданныеНомера КАК ПроданныеНомера
	//                     |ГДЕ
	//                     |	ПроданныеНомера.Бронь = &Регистратор");

	//ТЗ=Запрос.Выполнить().Выгрузить();
	//сч=1;
	//ДНД=НачалоДня(ДН);
	//Пока ДНД<ДК цикл
	//	СпрН=Справочники.НомернойФонд.Выбрать();
	//	
	//	Пока СпрН.Следующий() цикл
	//		Обл=Макет.ПолучитьОбласть("Строка");
	//		
	//		Отбор=Новый Структура("НОМ,ДТ",СпрН.Ссылка,ДНД);
	//		ПоискЗанятости=ТЗ.НайтиСтроки(Отбор);
	//		Если ПоискЗанятости.Количество()>0 тогда
	//			Стр=ПоискЗанятости[0];
	//			Запрос2.УстановитьПараметр("Регистратор",Стр.Регистратор);
	//			ТЗ2=Запрос2.Выполнить().Выгрузить();
	//			КолВоДней=?(ТЗ2.Количество()=0,0,ТЗ2[0].ДТ);
	//			Сумма=Стр.СуммаЗаПроживаниеПлан;//?(Стр.Регистратор.Тариф.БазовыйТариф.Пустая(),Стр.Регистратор.Тариф.Цена,Стр.Регистратор.Тариф.БазовыйТариф.Цена);
	//			//Сумма=Сумма*Стр.Регистратор.КолВо/КолВоДней;
	//			Обл.Параметры.Отель=Формат(Сумма, "ЧДЦ=2; ЧГ=");
	//			Обл.Параметры.чел=Стр.Регистратор.КолВоЧеловек;
	//			Обл.Параметры.ФО=Стр.Регистратор.ВидОплаты;
	//			Скидка=Стр.СуммаЗаПроживаниеПлан-Стр.СуммаЗаПроживание;//?(Стр.Регистратор.Оплачивает.Категория.Пустая(),0,(Стр.Регистратор.Оплачивает.Категория.Скидка/100)*Сумма);
	//			//Скидка=Скидка+?(Стр.Регистратор.Тариф.БазовыйТариф.Пустая(),0,Стр.Регистратор.Тариф.БазовыйТариф.Цена-Стр.Регистратор.Тариф.Цена);
	//			//Скидка=Скидка*Стр.Регистратор.КолВо/КолВоДней;
	//			Обл.Параметры.Скидка=Формат(Скидка, "ЧДЦ=2; ЧГ=");
	//			Обл.Параметры.Итого=Формат(Сумма-Скидка, "ЧДЦ=2; ЧГ=");
	//			ЗапросОплаты.УстановитьПараметр("Оплата",Стр.Регистратор);
	//			ТЗОпл=ЗапросОплаты.Выполнить().Выгрузить();
	//			Если ТЗОпл.Количество()>0 тогда
	//				Если ТЗОпл[0].Регистратор.КредитнаяКарта тогда
	//					Обл.Параметры.ФО="К/к";	
	//					Сумма=Сумма-Сумма*0.019;
	//					Обл.Параметры.Отель=Формат(Сумма, "ЧДЦ=2; ЧГ=");
	//					Скидка=Скидка-Скидка*0.019;
	//					Обл.Параметры.Скидка=Формат(Скидка, "ЧДЦ=2; ЧГ=");
	//					Обл.Параметры.Итого=Формат(Сумма-Скидка, "ЧДЦ=2; ЧГ=");
	//                    Оплата=?(ТЗ2.Количество()=0,0,?(ТЗ2[0].ДТ=0,0,ТЗОпл[0].сумма/ТЗ2[0].ДТ));
	//					Обл.Параметры.Оплачено=Формат((Оплата-Оплата*0.019),"ЧДЦ=2; ЧГ=");
	//			    Обл.Параметры.ДТОпл=Формат(ТЗОпл[0].Период, "ДФ=dd.MM.yy");
	//				Обл.Параметры.Долг=Формат(Сумма-Скидка-Оплата, "ЧДЦ=2; ЧГ=");

	//				иначе
	//				
	//				Оплата=?(ТЗ2.Количество()=0,0,?(ТЗ2[0].ДТ=0,0,ТЗОпл[0].сумма/ТЗ2[0].ДТ));
	//				Обл.Параметры.Оплачено=Формат( Оплата,"ЧДЦ=2; ЧГ=");
	//			    Обл.Параметры.ДТОпл=Формат(ТЗОпл[0].Период, "ДФ=dd.MM.yy");
	//				Обл.Параметры.Долг=Формат(Сумма-Скидка-Оплата, "ЧДЦ=2; ЧГ=");
	//				конецесли;

	//			Конецесли;
	//		 Конецесли;
	//		//Обл.Параметры.Год=Год(ДНД);
	//		Обл.Параметры.Неделя=НеделяГода(ДНД);
	//		Обл.Параметры.ДН=ДеньНедели(ДНД);
	//		//Обл.Параметры.УЭ=?(ДеньНедели(ДНД)>5,"Да","Нет");
	//		Обл.Параметры.Ном=СпрН.Ссылка;
	//		Обл.Параметры.станд=СпрН.Ссылка;
	//		Обл.Параметры.ДТ=Формат(ДНД, "ДФ=dd.MM.yy");
	//		Обл.Параметры.Мес=Месяц(ДНД);
	//		ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//		
	//		
	//	КонецЦикла; 
	//	ДНД=ДНД+86400;
	//конеццикла;
	//
	//
	//
	////Для каждого Стр Из ТЗ Цикл
	////	Обл=Макет.ПолучитьОбласть("Строка");
	////	//Неделя	ДН	УЭ	Ном	станд	Отель	чел	ДТ	Мес	ФО	Скидка	Итого
	////	Обл.Параметры.Год=Год(Стр.ДТ);
	////	Обл.Параметры.Неделя=НеделяГода(Стр.ДТ);
	////	Обл.Параметры.ДН=ДеньНедели(Стр.ДТ);
	////	Обл.Параметры.УЭ=?(ДеньНедели(Стр.ДТ)>5,"Да","Нет");
	////	Обл.Параметры.Ном=Стр.Регистратор.НомерВРезерв;
	////	Обл.Параметры.станд=Стр.Регистратор.КатегорияНомера;
	////	Сумма=?(Стр.Регистратор.Тариф.БазовыйТариф.Пустая(),Стр.Регистратор.Тариф.Цена,Стр.Регистратор.Тариф.БазовыйТариф.Цена);
	////	Обл.Параметры.Отель=Формат(Сумма, "ЧРГ=");
	////	Обл.Параметры.чел=Стр.Регистратор.КолВоЧеловек;
	////	Обл.Параметры.ДТ=Формат(Стр.ДТ, "ДФ=dd.MM.yy");
	////	Обл.Параметры.Мес=Месяц(Стр.ДТ);
	////	Обл.Параметры.ФО=Стр.Регистратор.ВидОплаты;
	////	Скидка=?(Стр.Регистратор.Оплачивает.Категория.Пустая(),0,(Стр.Регистратор.Оплачивает.Категория.Скидка/100)*Сумма);
	////	Скидка=Скидка+?(Стр.Регистратор.Тариф.БазовыйТариф.Пустая(),0,Стр.Регистратор.Тариф.БазовыйТариф.Цена-Стр.Регистратор.Тариф.Цена);
	////	Обл.Параметры.Скидка=Скидка;
	////	Обл.Параметры.Итого=Сумма-Скидка;
	////	ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	////КонецЦикла; 
	//
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	//Макет=ПолучитьМакет("Макет");
	Макет=Отчеты.ПроданыеНомера.ПолучитьМакет("Макет");
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗаявкаНаБронирование.Ссылка
	                    |ИЗ
	                    |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                    |ГДЕ
	                    |	ЗаявкаНаБронирование.Ссылка В
	                    |			(ВЫБРАТЬ
	                    |				ЗанятостьНомеров.Регистратор
	                    |			ИЗ
	                    |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |			ГДЕ
	                    |				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                    |				И ЗанятостьНомеров.Зарезервирован = ИСТИНА)
	                    |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ЗаявкаНаБронирование.РезервС");
						
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗанятостьНомеров.Регистратор,
	                    |	НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) КАК ДТ,
	                    |	ЗанятостьНомеров.Регистратор.НомерВРезерв КАК НОМ
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.Регистратор.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	                    |	И ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ),
	                    |	ЗанятостьНомеров.Регистратор
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ЗанятостьНомеров.Регистратор.РезервС");
						
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ПроданныеНомера.ДатаПродажи КАК ДТ,
	                    |	ПроданныеНомера.НомерВРезерв КАК НОМ,
	                    |	ПроданныеНомера.СуммаЗаПроживаниеПлан,
	                    |	ПроданныеНомера.СуммаЗаПроживание,
	                    |	ПроданныеНомера.Бронь КАК Регистратор,
	                    |	ПроданныеНомера.Комментарий,
	                    |	ПроданныеНомера.Клиент
	                    |ИЗ
	                    |	РегистрСведений.ПроданныеНомера КАК ПроданныеНомера
	                    |ГДЕ
	                    |	ПроданныеНомера.ДатаПродажи МЕЖДУ &ДН И &ДК");
						
	Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));						
	Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	ЗапросОплаты=Новый Запрос("ВЫБРАТЬ
	                          |	Деньги.Сумма,
	                          |	Деньги.Период,
	                          |	Деньги.Регистратор
	                          |ИЗ
	                          |	РегистрНакопления.Деньги КАК Деньги
	                          |ГДЕ
	                          |	Деньги.Оплата = &Оплата");	
	Запрос2=Новый Запрос("ВЫБРАТЬ
	                     |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПроданныеНомера.ДатаПродажи) КАК ДТ
	                     |ИЗ
	                     |	РегистрСведений.ПроданныеНомера КАК ПроданныеНомера
	                     |ГДЕ
	                     |	ПроданныеНомера.Бронь = &Регистратор");

	ТЗ=Запрос.Выполнить().Выгрузить();
	сч=1;
	ДНД=НачалоДня(Отчет.ДН);    
	Пока ДНД < Отчет.ДК цикл
		СпрН=Справочники.НомернойФонд.Выбрать();
		
		Пока СпрН.Следующий() цикл
			Обл=Макет.ПолучитьОбласть("Строка");
			
			Отбор=Новый Структура("НОМ,ДТ",СпрН.Ссылка,ДНД);
			ПоискЗанятости=ТЗ.НайтиСтроки(Отбор);
			Если ПоискЗанятости.Количество()>0 тогда
				Стр=ПоискЗанятости[0];
				Запрос2.УстановитьПараметр("Регистратор",Стр.Регистратор);
				ТЗ2=Запрос2.Выполнить().Выгрузить();
				КолВоДней=?(ТЗ2.Количество()=0,0,ТЗ2[0].ДТ);
				Сумма=Стр.СуммаЗаПроживаниеПлан;//?(Стр.Регистратор.Тариф.БазовыйТариф.Пустая(),Стр.Регистратор.Тариф.Цена,Стр.Регистратор.Тариф.БазовыйТариф.Цена);
				////Сумма=Сумма*Стр.Регистратор.КолВо/КолВоДней;
				Обл.Параметры.Отель=Формат(Сумма, "ЧДЦ=2; ЧГ=");
				Обл.Параметры.чел=Стр.Регистратор.КолВоЧеловек;
				Обл.Параметры.ФО=Стр.Регистратор.ВидОплаты;
				Скидка=Стр.СуммаЗаПроживаниеПлан-Стр.СуммаЗаПроживание;//?(Стр.Регистратор.Оплачивает.Категория.Пустая(),0,(Стр.Регистратор.Оплачивает.Категория.Скидка/100)*Сумма);
				////Скидка=Скидка+?(Стр.Регистратор.Тариф.БазовыйТариф.Пустая(),0,Стр.Регистратор.Тариф.БазовыйТариф.Цена-Стр.Регистратор.Тариф.Цена);
				////Скидка=Скидка*Стр.Регистратор.КолВо/КолВоДней;
				Обл.Параметры.Скидка=Формат(Скидка, "ЧДЦ=2; ЧГ=");
				Обл.Параметры.Итого=Формат(Сумма-Скидка, "ЧДЦ=2; ЧГ=");
				ЗапросОплаты.УстановитьПараметр("Оплата",Стр.Регистратор);
				ТЗОпл=ЗапросОплаты.Выполнить().Выгрузить();
				Если ТЗОпл.Количество()>0 тогда
					Если ТЗОпл[0].Регистратор.КредитнаяКарта тогда
						Обл.Параметры.ФО="К/к";	
						Сумма=Сумма-Сумма*0.019;
						Обл.Параметры.Отель=Формат(Сумма, "ЧДЦ=2; ЧГ=");
						Скидка=Скидка-Скидка*0.019;
						Обл.Параметры.Скидка=Формат(Скидка, "ЧДЦ=2; ЧГ=");
						Обл.Параметры.Итого=Формат(Сумма-Скидка, "ЧДЦ=2; ЧГ=");
                        Оплата=?(ТЗ2.Количество()=0,0,?(ТЗ2[0].ДТ=0,0,ТЗОпл[0].сумма/ТЗ2[0].ДТ));
						Обл.Параметры.Оплачено=Формат((Оплата-Оплата*0.019),"ЧДЦ=2; ЧГ=");
				    Обл.Параметры.ДТОпл=Формат(ТЗОпл[0].Период, "ДФ=dd.MM.yy");
					Обл.Параметры.Долг=Формат(Сумма-Скидка-Оплата, "ЧДЦ=2; ЧГ=");

					иначе
					
					Оплата=?(ТЗ2.Количество()=0,0,?(ТЗ2[0].ДТ=0,0,ТЗОпл[0].сумма/ТЗ2[0].ДТ));
					Обл.Параметры.Оплачено=Формат( Оплата,"ЧДЦ=2; ЧГ=");
				    Обл.Параметры.ДТОпл=Формат(ТЗОпл[0].Период, "ДФ=dd.MM.yy");
					Обл.Параметры.Долг=Формат(Сумма-Скидка-Оплата, "ЧДЦ=2; ЧГ=");
					конецесли;

				Конецесли;
			 Конецесли;
			////Обл.Параметры.Год=Год(ДНД);
			Обл.Параметры.Неделя=НеделяГода(ДНД);
			Обл.Параметры.ДН=ДеньНедели(ДНД);
			////Обл.Параметры.УЭ=?(ДеньНедели(ДНД)>5,"Да","Нет");
			Обл.Параметры.Ном=СпрН.Ссылка;
			Обл.Параметры.станд=СпрН.Ссылка;
			Обл.Параметры.ДТ=Формат(ДНД, "ДФ=dd.MM.yy");
			Обл.Параметры.Мес=Месяц(ДНД);
			
			//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
			ПолеОтчета.Вывести(Обл);
			
			
		КонецЦикла; 
		ДНД=ДНД+86400;
	конеццикла;
	
	
	
	////Для каждого Стр Из ТЗ Цикл
	////	Обл=Макет.ПолучитьОбласть("Строка");
	////	//Неделя	ДН	УЭ	Ном	станд	Отель	чел	ДТ	Мес	ФО	Скидка	Итого
	////	Обл.Параметры.Год=Год(Стр.ДТ);
	////	Обл.Параметры.Неделя=НеделяГода(Стр.ДТ);
	////	Обл.Параметры.ДН=ДеньНедели(Стр.ДТ);
	////	Обл.Параметры.УЭ=?(ДеньНедели(Стр.ДТ)>5,"Да","Нет");
	////	Обл.Параметры.Ном=Стр.Регистратор.НомерВРезерв;
	////	Обл.Параметры.станд=Стр.Регистратор.КатегорияНомера;
	////	Сумма=?(Стр.Регистратор.Тариф.БазовыйТариф.Пустая(),Стр.Регистратор.Тариф.Цена,Стр.Регистратор.Тариф.БазовыйТариф.Цена);
	////	Обл.Параметры.Отель=Формат(Сумма, "ЧРГ=");
	////	Обл.Параметры.чел=Стр.Регистратор.КолВоЧеловек;
	////	Обл.Параметры.ДТ=Формат(Стр.ДТ, "ДФ=dd.MM.yy");
	////	Обл.Параметры.Мес=Месяц(Стр.ДТ);
	////	Обл.Параметры.ФО=Стр.Регистратор.ВидОплаты;
	////	Скидка=?(Стр.Регистратор.Оплачивает.Категория.Пустая(),0,(Стр.Регистратор.Оплачивает.Категория.Скидка/100)*Сумма);
	////	Скидка=Скидка+?(Стр.Регистратор.Тариф.БазовыйТариф.Пустая(),0,Стр.Регистратор.Тариф.БазовыйТариф.Цена-Стр.Регистратор.Тариф.Цена);
	////	Обл.Параметры.Скидка=Скидка;
	////	Обл.Параметры.Итого=Сумма-Скидка;
	////	ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	////КонецЦикла; 
    
КонецПроцедуры

