
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаРассылки = ТекущаяДата();

Список.Параметры.УстановитьЗначениеПараметра("ДатаРассылки", '00010101');
КонецПроцедуры

&НаКлиенте
Процедура РазослатьWhatsApp_Сайт(Команда)
Если ЕстьРассылка() Тогда
	ПоказатьПредупреждение(,"Была рассылка на дату: " + Формат(ДатаРассылки,  "ДФ=dd.MM.yyyy"));
	
	Возврат;
КонецЕсли;

РассылкаWhatsApp.РассылкаWhatsApp_Сайт(ДатаРассылки);
КонецПроцедуры

&НаСервере
Функция ЕстьРассылка() 
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	РассылкаWhatsApp.ДатаРассылки КАК ДатаРассылки
                      |ИЗ
                      |	РегистрСведений.РассылкаWhatsApp КАК РассылкаWhatsApp
                      |ГДЕ
                      |	РассылкаWhatsApp.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипРассылкиWhatsApp.Сайт)
                      |	И РассылкаWhatsApp.ДатаРассылки = &ДатаРассылки");

Запрос.УстановитьПараметр("ДатаРассылки", ДатаРассылки);
Результат = Запрос.Выполнить();
Возврат НЕ Результат.Пустой();
КонецФункции


&НаКлиенте
Процедура Рассылки_сайт(Команда)
Список.Параметры.УстановитьЗначениеПараметра("ДатаРассылки", ДатаРассылки);

Элементы.Список.Обновить();
КонецПроцедуры



