// +
Функция МесенджерВключен() Экспорт
СообщенияЧерезGREЕN_WhatsApp = Константы.СообщенияЧерезGREЕN_WhatsApp.Получить();	
СообщенияЧерезGREЕN_MAX = Константы.СообщенияЧерезGREЕN_MAX.Получить();	
СообщенияЧерезGREЕN_Telegram = Константы.СообщенияЧерезGREЕN_Telegram.Получить();	

ЭтоМесенджер = СообщенияЧерезGREЕN_WhatsApp ИЛИ СообщенияЧерезGREЕN_MAX ИЛИ СообщенияЧерезGREЕN_Telegram;

Возврат ЭтоМесенджер;
КонецФункции


Функция ОтправитьДанные_Месенджер(ТипОтправки, Знач НомерТелефона, Текст, ИмяФайла, Ссылка)  Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");

СообщенияЧерезGREЕN_WhatsApp = Константы.СообщенияЧерезGREЕN_WhatsApp.Получить();	
СообщенияЧерезGREЕN_MAX = Константы.СообщенияЧерезGREЕN_MAX.Получить();	
СообщенияЧерезGREЕN_Telegram = Константы.СообщенияЧерезGREЕN_Telegram.Получить();

Если НЕ (СообщенияЧерезGREЕN_WhatsApp ИЛИ СообщенияЧерезGREЕN_MAX ИЛИ СообщенияЧерезGREЕN_Telegram) Тогда
	Результат.Ошибка = Истина;
	Результат.Описание = "Сообщения через месенджер выключены"; 

	Возврат Результат;
КонецЕсли;   
	
Телефон_П = GREEN_WhatsApp.ТелефонGREEN(НомерТелефона);
Если Телефон_П = 0 Тогда
	Результат.Ошибка = Истина;
	Результат.Описание = "Некорректный номер телефона для месенджера";

	Возврат Результат;	
КонецЕсли;

Если СообщенияЧерезGREЕN_WhatsApp Тогда  
	Если ТипОтправки = "ОтправитьТекст" Тогда
	 	Ответ = WhatsAppСервер.ОтправитьТекстGreenWhatsApp(Телефон_П, Текст);    
	ИначеЕсли ТипОтправки = "ОтправитьФайлИТекст" Тогда
		Ответ = WhatsAppСервер.ОтправитьФайлИТекстGreenWhatsApp(Телефон_П, ИмяФайла, Текст);			
	ИначеЕсли ТипОтправки = "ОтправитьСсылка" Тогда
		Ответ = WhatsAppСервер.ОтправитьСсылкуGreenWhatsApp(Телефон_П, Ссылка);		
	Иначе
		Результат.Ошибка = Истина;
		Результат.Описание = "Некорректеый тип отправки ОтправитьДанные_Месенджер";    

		Возврат Результат;
	КонецЕсли;			

	Если Ответ.Ошибка Тогда
		Если Ответ.КодОшибки = 100 Тогда // Нет WhatsApp на телефоне
			Перейти ~СЛЕДУЮЩИЙ_1;	
		ИначеЕсли Ответ.Описание = "Параметры GREEN_WhatsApp неопределены" Тогда
            Сообщить(Ответ.Описание);
			Перейти ~СЛЕДУЮЩИЙ_1;	

		Иначе			
			Результат.Ошибка = Истина;
			Результат.Описание = Ответ.Описание;    
			
			Возврат Результат;
		КонецЕсли;
  	КонецЕсли;                                                                      
КонецЕсли;	

~СЛЕДУЮЩИЙ_1:
Если СообщенияЧерезGREЕN_MAX Тогда
	Если ТипОтправки = "ОтправитьТекст" Тогда
	 	Ответ = MAXСервер.ОтправитьТекстGreenMAX(Телефон_П, Текст);    
	ИначеЕсли ТипОтправки = "ОтправитьФайлИТекст" Тогда
		Ответ = MAXСервер.ОтправитьФайлИТекстGreenMAX(Телефон_П, ИмяФайла, Текст);			
	ИначеЕсли ТипОтправки = "ОтправитьСсылка" Тогда
		Ответ = MAXСервер.ОтправитьТекстGreenMAX(Телефон_П, Ссылка);		
	Иначе
		Результат.Ошибка = Истина;
		Результат.Описание = "Некорректеый тип отправки ОтправитьДанные_Месенджер";    

		Возврат Результат;
	КонецЕсли;
	
	Если Ответ.Ошибка Тогда
		Если Ответ.КодОшибки = 100 Тогда // Нет MAX на телефоне
			Перейти ~СЛЕДУЮЩИЙ_2;	
		ИначеЕсли Ответ.Описание = "Параметры GREEN_MAX неопределены" Тогда
            Сообщить(Ответ.Описание);
			Перейти ~СЛЕДУЮЩИЙ_2;		
		Иначе			
			Результат.Ошибка = Истина;
			Результат.Описание = Ответ.Описание;    
			
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;      
КонецЕсли;

~СЛЕДУЮЩИЙ_2:
Если СообщенияЧерезGREЕN_Telegram Тогда
 	Если ТипОтправки = "ОтправитьТекст" Тогда
	 	Ответ = TelegramСервер.ОтправитьТекстGreenTelegram(Телефон_П, Текст);    
	ИначеЕсли ТипОтправки = "ОтправитьФайлИТекст" Тогда
		Ответ = TelegramСервер.ОтправитьФайлИТекстGreenTelegram(Телефон_П, ИмяФайла, Текст);			
	ИначеЕсли ТипОтправки = "ОтправитьСсылка" Тогда
		Ответ = TelegramСервер.ОтправитьТекстGreenTelegram(Телефон_П, Ссылка);		
	Иначе
		Результат.Ошибка = Истина;
		Результат.Описание = "Некорректеый тип отправки ОтправитьДанные_Месенджер";    

		Возврат Результат;
	КонецЕсли;
	
	Если Ответ.Ошибка Тогда
		Если Ответ.КодОшибки = 100 Тогда // Нет WhatsApp на телефоне
			Перейти ~СЛЕДУЮЩИЙ_3;	
		ИначеЕсли Ответ.Описание = "Параметры GREEN_Telegram неопределены" Тогда
            Сообщить(Ответ.Описание);
			Перейти ~СЛЕДУЮЩИЙ_3;
		Иначе			
			Результат.Ошибка = Истина;
			Результат.Описание = Ответ.Описание;    
			
			Возврат Результат;
		КонецЕсли;
	КонецЕсли; 
КонецЕсли; 

~СЛЕДУЮЩИЙ_3:
Возврат Результат;	
КонецФункции
//



//
Функция ОтправитьТекст_Месенджер(Знач НомерТелефона, Текст)  Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");

СообщенияЧерезGREЕN_WhatsApp = Константы.СообщенияЧерезGREЕN_WhatsApp.Получить();	
СообщенияЧерезGREЕN_MAX = Константы.СообщенияЧерезGREЕN_MAX.Получить();	
СообщенияЧерезGREЕN_Telegram = Константы.СообщенияЧерезGREЕN_Telegram.Получить();

Если НЕ (СообщенияЧерезGREЕN_WhatsApp ИЛИ СообщенияЧерезGREЕN_MAX ИЛИ СообщенияЧерезGREЕN_Telegram) Тогда
	Результат.Ошибка = Истина;
	Результат.Описание = "Сообщения через месенджер выключены"; 

	Возврат Результат;
КонецЕсли;   
	
Телефон_П = GREEN_WhatsApp.ТелефонGREEN(НомерТелефона);
Если Телефон_П = 0 Тогда
	Результат.Ошибка = Истина;
	Результат.Описание = "Некорректный номер телефона для месенджера";

	Возврат Результат;	
КонецЕсли;

Если СообщенияЧерезGREЕN_WhatsApp Тогда
 	Ответ = WhatsAppСервер.ОтправитьТекстGreenWhatsApp(Телефон_П, Текст);        
	
	Если Ответ.Ошибка Тогда
		Если Ответ.КодОшибки = 100 Тогда // Нет WhatsApp на телефоне
			Перейти ~СЛЕДУЮЩИЙ_1;	
		ИначеЕсли Ответ.Описание = "Параметры GREEN_WhatsApp неопределены" Тогда
            Сообщить(Ответ.Описание);
			Перейти ~СЛЕДУЮЩИЙ_1;	

		Иначе			
			Результат.Ошибка = Истина;
			Результат.Описание = Ответ.Описание;    
			
			Возврат Результат;
		КонецЕсли;
  	КонецЕсли;                                                                      
КонецЕсли;	

~СЛЕДУЮЩИЙ_1:
Если СообщенияЧерезGREЕN_MAX Тогда
	Ответ = MAXСервер.ОтправитьТекстGreenMAX(Телефон_П, Текст);        
	
	Если Ответ.Ошибка Тогда
		Если Ответ.КодОшибки = 100 Тогда // Нет MAX на телефоне
			Перейти ~СЛЕДУЮЩИЙ_2;	
		ИначеЕсли Ответ.Описание = "Параметры GREEN_MAX неопределены" Тогда
            Сообщить(Ответ.Описание);
			Перейти ~СЛЕДУЮЩИЙ_2;		
		Иначе			
			Результат.Ошибка = Истина;
			Результат.Описание = Ответ.Описание;    
			
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;      
КонецЕсли;

~СЛЕДУЮЩИЙ_2:
Если СообщенияЧерезGREЕN_Telegram Тогда
 	Ответ = MAXСервер.ОтправитьТекстGreenMAX(Телефон_П, Текст);        
	
	Если Ответ.Ошибка Тогда
		Если Ответ.КодОшибки = 100 Тогда // Нет WhatsApp на телефоне
			Перейти ~СЛЕДУЮЩИЙ_3;	
		ИначеЕсли Ответ.Описание = "Параметры GREEN_Telegram неопределены" Тогда
            Сообщить(Ответ.Описание);
			Перейти ~СЛЕДУЮЩИЙ_3;
		Иначе			
			Результат.Ошибка = Истина;
			Результат.Описание = Ответ.Описание;    
			
			Возврат Результат;
		КонецЕсли;
	КонецЕсли; 
	
	
	Результат = TelegramСервер.ОтправитьТекстGreenTelegram(НомерТелефона, Текст);
КонецЕсли; 

~СЛЕДУЮЩИЙ_3:
Возврат Результат;	
КонецФункции

Функция ОтправитьФайлИТекст_Месенджер(Знач НомерТелефона, Данные, Текст = "")  Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");

СообщенияЧерезGREЕN_WhatsApp = Константы.СообщенияЧерезGREЕN_WhatsApp.Получить();	

Если СообщенияЧерезGREЕN_WhatsApp Тогда
	 Результат = WhatsAppСервер.ОтправитьФайлИТекстGreenWhatsApp(НомерТелефона, Данные, Текст)
Иначе	
	Результат.Ошибка = Истина;
	Результат.Описание = "Не установлена константа СообщенияЧерезGREЕN_WhatsApp";
КонецЕсли;

Возврат Результат;
КонецФункции

Функция ОтправитьСсылка_Месенджер(Знач НомерТелефона, Ссылка)  Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");

СообщенияЧерезGREЕN_WhatsApp = Константы.СообщенияЧерезGREЕN_WhatsApp.Получить();	

Если СообщенияЧерезGREЕN_WhatsApp Тогда
	Результат = WhatsAppСервер.ОтправитьСсылкуGreenWhatsApp(НомерТелефона, Ссылка);
Иначе	
	Результат.Ошибка = Истина;
	Результат.Описание = "Не установлена константа СообщенияЧерезGREЕN_WhatsApp";
КонецЕсли;
	
Возврат Результат;
КонецФункции

// -

//// + Green
Функция ОтправитьWhatsAppТекстGreen(Знач Телефон, Текст)
//Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");
//	
//Телефон_П = GREEN_WhatsApp.ТелефонGREEN(Телефон);
//Если Телефон_П = 0 Тогда
//	Результат.Ошибка = Истина;
//	Результат.Описание = "Некорректный номер телефона для Whats App";

//	Возврат Результат;	
//КонецЕсли;

//Результат = ПроверитьWhatsAppGreen(Телефон);
//Если Результат.Ошибка Тогда Возврат Результат; КонецЕсли;	

//Попытка 
//	GREEN_WhatsApp.ОтправитьТекст(Телефон_П, Текст);
//Исключение
//	Результат.Ошибка = Истина;
//	Результат.Описание = ОписаниеОшибки();
//КонецПопытки;

//Возврат Результат;
КонецФункции

Функция ОтправитьWhatsAppФайлИТекстGreen(Знач Телефон, Картинка, Текст = "")  
//Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");
//	
//Телефон_П = GREEN_WhatsApp.ТелефонGREEN(Телефон);	
//Если Телефон_П = 0 Тогда
//	Результат.Ошибка = Истина;
//	Результат.Описание = "Некорректный номер телефона для Whats App";

//	Возврат Результат;	
//КонецЕсли;

//Результат = ПроверитьWhatsAppGreen(Телефон);
//Если Результат.Ошибка Тогда Возврат Результат; КонецЕсли;	

//Попытка 
//	GREEN_WhatsApp.ОтправитьВидеоАудиоИзображениеДокумент(Телефон_П, Картинка, Текст);
//Исключение
//	Результат.Ошибка = Истина;
//	Результат.Описание = ОписаниеОшибки();
//КонецПопытки;

//Возврат Результат;	
КонецФункции

Функция ОтправитьWhatsAppСсылкуGreen(Знач Телефон, Ссылка)  
//Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");

//Телефон_П = GREEN_WhatsApp.ТелефонGREEN(Телефон); 	
//Если Телефон_П = 0 Тогда
//	Результат.Ошибка = Истина;
//	Результат.Описание = "Некорректный номер телефона для Whats App";

//	Возврат Результат;	
//КонецЕсли;

//Результат = ПроверитьWhatsAppGreen(Телефон);
//Если Результат.Ошибка Тогда Возврат Результат; КонецЕсли;	

//Попытка 
//	GREEN_WhatsApp.ОтправитьСсылку(Телефон_П, Ссылка);
//Исключение
//	Результат.Ошибка = Истина;
//	Результат.Описание = ОписаниеОшибки();
//КонецПопытки;

//Возврат Результат;	
КонецФункции

Функция ПроверитьWhatsAppGreen(Знач Телефон) Экспорт 
//Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");
//	
//Телефон_П = GREEN_WhatsApp.ТелефонGREEN(Телефон);
//Если Телефон_П = 0 Тогда
//	Результат.Ошибка = Истина;
//	Результат.Описание = "Некорректный номер телефона для Whats App";

//	Возврат Результат;	
//КонецЕсли;

//Попытка 
//	Ответ = GREEN_WhatsApp.ПроверитьНаличиеWhatsAppДействие(Телефон_П);
//	
//	Если НЕ Ответ Тогда
//		Результат.Ошибка = Истина;
//		Результат.Описание = "На телефоне не установлен WhatsApp";
//	КонецЕсли;
//Исключение
//	Результат.Ошибка = Истина;
//	Результат.Описание = ОписаниеОшибки();
//КонецПопытки;

//Возврат Результат;
КонецФункции
//// - Green
