
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр();
ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр; 

Если НастройкиСервер.ЭтоРеноме() Тогда
	Элементы.АдминистраторКодДомСоветов.Видимость = Ложь;
	Элементы.АдминистраторКодСтритАрт.Видимость = Ложь;
	
	//Элементы.СтавкаЗавтракиДомСоветов.Видимость = Ложь;
	//Элементы.СтавкаЗавтракиЧехов.Видимость = Ложь;
	//Элементы.СтавкаЗавтракиЛайв.Видимость = Ложь;
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда
	Элементы.АдминистраторКодЛайв.Видимость = Ложь;
	
	//Элементы.СтавкаЗавтракиЛайв.Видимость = Ложь;
ИначеЕсли НастройкиСервер.ЭтоЛайв() Тогда
	Элементы.АдминистраторКодДомСоветов.Видимость = Ложь;
	Элементы.АдминистраторКодСтритАрт.Видимость = Ложь;
	Элементы.АдминистраторКодЛайв.Видимость = Ложь;

	//Элементы.СтавкаЗавтракиДомСоветов.Видимость = Ложь;
	//Элементы.СтавкаЗавтракиЧехов.Видимость = Ложь;
Иначе
	Элементы.АдминистраторКодДомСоветов.Видимость = Ложь;
	Элементы.АдминистраторКодСтритАрт.Видимость = Ложь;
	Элементы.АдминистраторКодЛайв.Видимость = Ложь;
	
	//Элементы.СтавкаЗавтракиДомСоветов.Видимость = Ложь;
	//Элементы.СтавкаЗавтракиЧехов.Видимость = Ложь;
	//Элементы.СтавкаЗавтракиЛайв.Видимость = Ложь;
КонецЕсли;

Элементы.НачисленияСтавкаЗавтракиДомСоветов.Видимость = Ложь;
Элементы.НачисленияСтавкаЗавтракиЧехов.Видимость = Ложь;
Элементы.НачисленияСтавкаЗавтракиЛайв.Видимость = Ложь;

КонецПроцедуры
	
&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
Наименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Пользователь, "Наименование"); 
Объект.Наименование = Наименование;
КонецПроцедуры



