
&НаКлиенте
Процедура ДатаЗакрытияПриИзменении(Элемент)
Если КонецМесяца(ДатаЗакрытия) > НачалоМесяца(ТекущаяДата()) Тогда
	ПоказатьПредупреждение(, "Месяц закрытия >= Текущая дата");	
	
	ДатаЗакрытия = Неопределено;
КонецЕсли;
	
Если ЗначениеЗаполнено(ДатаЗакрытия) Тогда
	Элементы.МесяцЗакрытияДекорация.Заголовок = Формат(ДатаЗакрытия, "ДФ=MMMM.yy");		
Иначе
	Элементы.МесяцЗакрытияДекорация.Заголовок = "";
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗаявки(Команда)
Если НЕ ЗначениеЗаполнено(ДатаЗакрытия) Тогда Возврат; КонецЕсли;

ЗакрытьЗаявкиНаСервере();

//ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаСтраницы;
Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНезакрытыеЗаявки;

Текст = "Закрыто заявок: " + Строка(КоличествоЗаявок);
ПоказатьПредупреждение(,Текст);
Сообщить(Текст);
КонецПроцедуры

&НаСервере
Процедура ЗакрытьЗаявкиНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.Закрыто = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.Статус В(&Статусы)
                      |	И (ЗаявкаНаБронирование.РезервПо <= &РезервПо
                      |				И ЗаявкаНаБронирование.РезервС >= &РезервС
                      |			ИЛИ ЗаявкаНаБронирование.РезервС < &РезервС
                      |				И ЗаявкаНаБронирование.РезервПо > &РезервС
                      |				И ЗаявкаНаБронирование.РезервПо <= &РезервПо)");

Статусы = Новый Массив;
Статусы.Добавить(Перечисления.СтатусБрони.Выехал);
Запрос.УстановитьПараметр("Статусы", Статусы);

РезервС = НачалоМесяца(ДатаЗакрытия);
Запрос.УстановитьПараметр("РезервС", РезервС);
РезервПо = КонецМесяца(ДатаЗакрытия);
Запрос.УстановитьПараметр("РезервПо", РезервПо);

ТЗ = Запрос.Выполнить().Выгрузить();

НезакрытыеЗаявки.Очистить();
КоличествоЗаявок = 0;
Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	//ЕстьГрупповойСчет = Ложь;
	//Для Каждого СтрокаСчет Из ЗаявкаОбъект.Счета Цикл
	//	Если ЗначениеЗаполнено(СтрокаСчет.ГрупповойСчет) Тогда 
	//		ЕстьГрупповойСчет = Истина; 
	//		
	//		Прервать; 
	//	КонецЕсли;
	//КонецЦикла;
	//Если ЕстьГрупповойСчет Тогда 
	//	Продолжить; 
	//КонецЕсли; 
		
	Результат = ЗакрытиеСервер.ЗаявкаКЗакрытию(ЗаявкаОбъект, Ложь);
	
	Если НЕ Результат.ЗаявкаКЗакрытию Тогда 
		НоваяСтрока = НезакрытыеЗаявки.Добавить();
		НоваяСтрока.Заявка = Строка.Ссылка; 
		НоваяСтрока.Примечание = Результат.ОшибкаОписание;
		
		Продолжить; 
	КонецЕсли; 
	
	ЗаявкаОбъект.Закрыто = Истина;
	ЗаявкаОбъект.ДатаЗакрытия = ТекущаяДата();
	Попытка
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КоличествоЗаявок = КоличествоЗаявок + 1;
	Исключение
		НоваяСтрока = НезакрытыеЗаявки.Добавить();
		НоваяСтрока.Заявка = Строка.Ссылка; 
		НоваяСтрока.Примечание = "Ошибка записи Заявки.";
		
		Сообщить("Ошибка записи Заявки: " + ЗаявкаОбъект.Ссылка);
	КонецПопытки;
КонецЦикла;
КонецПроцедуры
//

&НаСервере
Функция ЗаявкаКЗакрытию_ПеренесеноВЗакрытиеСервере(ЗаявкаОбъект)
СуммаПроживание = ЗаявкаОбъект.Проживание.Итог("Сумма"); 

СуммаДопУслуги = 0;
Для Каждого СтрокаДопУслуги Из ЗаявкаОбъект.ДопУслуги Цикл
	Если НЕ СтрокаДопУслуги.ВСчет Тогда Продолжить; КонецЕсли;
	
	СуммаДопУслуги = СуммаДопУслуги + СтрокаДопУслуги.Цена * СтрокаДопУслуги.Количество;
КонецЦикла;

ИтогоДолг = СуммаПроживание + СуммаДопУслуги;

ИтогоОплаты = ЗаявкаОбъект.СчетаДетальноОплаты.Итог("СуммаРаспределено"); 

ЗаявкаКЗакрытию = (ИтогоОплаты = ИтогоДолг);
Возврат ЗаявкаКЗакрытию;	
КонецФункции

&НаКлиенте
Процедура НезакрытыеЗаявкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = НезакрытыеЗаявки.НайтиПоИдентификатору(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура("Ключ", ТД.Заявка); 

ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма); 

КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьГрупповыеСчета(Команда)
Если НЕ ЗначениеЗаполнено(ДатаЗакрытия) Тогда Возврат; КонецЕсли;

ЗакрытьГрупповыеСчетаНаСервере();

//ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаСтраницы;
Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНезакрытыеГрупповыеСчета;

Текст = "Закрыто групповых счетов: " + Строка(КоличествоГрупповыхСчетов);
ПоказатьПредупреждение(,Текст);
Сообщить(Текст);
КонецПроцедуры

&НаСервере
Процедура ЗакрытьГрупповыеСчетаНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГрупповыеСчета.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |ГДЕ
                      |	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
                      |	И ГрупповыеСчета.Закрыто = ЛОЖЬ
                      |	И ГрупповыеСчета.ДатаСчета >= &ДатаНачала
                      |	И ГрупповыеСчета.ДатаСчета <= &ДатаОкончания");

ДатаНачала = НачалоМесяца(ДатаЗакрытия);
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала); 
ДатаОкончания = КонецМесяца(ДатаЗакрытия);
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания); 

ТЗ = Запрос.Выполнить().Выгрузить();
НезакрытыеГрупповыеСчета.Очистить();
КоличествоГрупповыхСчетов = 0;

Для Каждого Строка Из ТЗ Цикл
	ГрупповойСчетОбъект = Строка.Ссылка.ПолучитьОбъект();
		
	ГрупповойСчетКЗакрытию = ГрупповойСчетКЗакрытию(ГрупповойСчетОбъект);
	Если НЕ ГрупповойСчетКЗакрытию.ГрупповойСчетКЗакрытию Тогда 
		НоваяСтрока = НезакрытыеГрупповыеСчета.Добавить();
		НоваяСтрока.ГрупповойСчет = Строка.Ссылка; 
		
		Примечание = "";
		Если ГрупповойСчетКЗакрытию.ДолгКОплате Тогда 
			Примечание = Примечание + "Долг к оплате <> 0.";
		КонецЕсли;
			
		Если ГрупповойСчетКЗакрытию.КомиссияПлатежиКОплате Тогда 
			Примечание = ОбщийФункционалКлиентСервер.ДобавитьТекст(Примечание, "Комиссия платежи к оплате к оплате <> 0.", " ");
		КонецЕсли;
		
		НоваяСтрока.Примечание = Примечание;   
		
		Продолжить; 
	КонецЕсли;
	
	ГрупповойСчетОбъект.Закрыто = Истина;
	Попытка
		ГрупповойСчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		КоличествоГрупповыхСчетов = КоличествоГрупповыхСчетов + 1;
	Исключение
		 Сообщить("Ошибка записи Группового Счета: " + ГрупповойСчетОбъект.Ссылка);
	КонецПопытки;
КонецЦикла;
КонецПроцедуры


&НаСервере
Функция ГрупповойСчетКЗакрытию(ГрупповойСчетОбъект)
ИтогоДокументыДолгиСуммаДолг = 0;
ИтогоДокументыДолгиСуммаОплачено = 0;
ОбновитьИтогиДокументыДолги(ИтогоДокументыДолгиСуммаДолг, ИтогоДокументыДолгиСуммаОплачено, ГрупповойСчетОбъект);

//ИтогоКомиссияСуммаКомиссииКонтрагент = 0;
//ОбновитьИтогиКомиссияДокументыДолги(ИтогоКомиссияСуммаКомиссииКонтрагент);

ИтогоКомиссияПлатежиОплачено = 0;
ОбновитьИтогиПлатежиКонтрагенту(ИтогоКомиссияПлатежиОплачено, ГрупповойСчетОбъект);
	
СуммаЗачетаОплачено = 0;
Для Каждого Строка Из ГрупповойСчетОбъект.ДокументыОплаты Цикл
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
		Если Строка.ДокументОплаты.ВидОперации = Справочники.ВидыОпераций.Взаимозачет Тогда 
			СуммаЗачетаОплачено = СуммаЗачетаОплачено + Строка.СуммаРаспределено;
		КонецЕсли;
	КонецЕсли;
КонецЦикла;
	
ИтогоДолг = ИтогоДокументыДолгиСуммаДолг;
ИтогоКомиссия = ГрупповойСчетОбъект.СуммаКомиссииКонтрагента;

Если ГрупповойСчетОбъект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ТурагентствоВзаимозачет") Тогда
	НащДолгКонтрагенту = ИтогоКомиссия + ГрупповойСчетОбъект.СуммаОстатокВзаимозачета;
	
	Если НащДолгКонтрагенту <= ИтогоДолг Тогда  
		ИтогоДолгКОплате = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
		ИтогоДолгКЗачету = 0;
		
		ИтогоКомиссияКЗачету = НащДолгКонтрагенту - СуммаЗачетаОплачено;
		ИтогоКомиссияПлатежиКОплате = 0;

		ИтогоКОплате = ИтогоДолгКОплате;	
	Иначе
		ИтогоДолгКОплате = 0;
		ИтогоДолгКЗачету = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
		
		ИтогоКомиссияПлатежиКОплате = НащДолгКонтрагенту - ИтогоКомиссияПлатежиОплачено - ИтогоДолгКЗачету - СуммаЗачетаОплачено;
		ИтогоКомиссияКЗачету = 0;	
		
		ИтогоКОплате = ИтогоКомиссияПлатежиКОплате;	
	КонецЕсли;
	
ИначеЕсли ГрупповойСчетОбъект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ТурагентствоДолги") Тогда
	
	НащДолгКонтрагенту = ИтогоКомиссия + ГрупповойСчетОбъект.СуммаОстатокВзаимозачета;
	
	ИтогоДолгКОплате = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
	ИтогоДолгКЗачету = 0;
	
	ИтогоКомиссияПлатежиКОплате = НащДолгКонтрагенту - СуммаЗачетаОплачено - ИтогоКомиссияПлатежиОплачено;
	ИтогоКомиссияКЗачету = 0;	
	
	//ИтогоКОплате = ИтогоДолгКОплате;	

ИначеЕсли ГрупповойСчетОбъект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ГруппаЗаявок") Тогда
	
	НащДолгКонтрагенту = ИтогоКомиссия + ГрупповойСчетОбъект.СуммаОстатокВзаимозачета;
	
	ИтогоДолгКОплате = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
	ИтогоДолгКЗачету = 0;
	
	ИтогоКомиссияПлатежиКОплате = НащДолгКонтрагенту - СуммаЗачетаОплачено - ИтогоКомиссияПлатежиОплачено;
	ИтогоКомиссияКЗачету = 0;	
	
	ИтогоКОплате = ИтогоДолгКОплате;
	
Иначе
	ИтогоДолгКОплате = 0;
	ИтогоДолгКЗачету = 0;
	
	ИтогоКомиссияПлатежиКОплате = 0;
	ИтогоКомиссияКЗачету = 0;	
	
	ИтогоКОплате = 0;
	
КонецЕсли;

Результат = Новый Структура("ГрупповойСчетКЗакрытию, ДолгКОплате, КомиссияПлатежиКОплате");   
Результат.ДолгКОплате = (ИтогоДолгКОплате <> 0);
Результат.КомиссияПлатежиКОплате = (ИтогоКомиссияПлатежиКОплате <> 0);
Результат.ГрупповойСчетКЗакрытию = НЕ (Результат.ДолгКОплате ИЛИ Результат.КомиссияПлатежиКОплате); 

Возврат Результат;
КонецФункции

&НаСервере
Процедура ОбновитьИтогиДокументыДолги(ИтогоДокументыДолгиСуммаДолг, ИтогоДокументыДолгиСуммаОплачено, Объект)
ЗакрытиеСервер.ОбновитьИтогиДокументыДолги(ИтогоДокументыДолгиСуммаДолг, ИтогоДокументыДолгиСуммаОплачено, Объект);	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиКомиссияДокументыДолги(ИтогоКомиссияСуммаКомиссииКонтрагент)
ИтогоКомиссияСуммаКомиссииРасчет = 0; ИтогоКомиссияСуммаКомиссииКонтрагент = 0; 

Если Объект.КомиссияДокументыДолги.Количество() = 0 Тогда Возврат; КонецЕсли; 

Для Каждого Строка Из Объект.КомиссияДокументыДолги Цикл
	ДокументДолгОбъект = Строка.ДокументДолг.ПолучитьОбъект();
	СуммаБезСкидки = ДокументДолгОбъект.Проживание.Итог("СуммаБезСкидки");
	
	ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(ДокументДолгОбъект.Бронирует, ДокументДолгОбъект.РезервС); //, ДокументДолгОбъект.В2В);
	СуммаКомиссии = ДокументыСервер.СуммаКомиссии(Строка.ДокументДолг, СуммаБезСкидки
		, ДокументДолгОбъект.Счета, ДокументДолгОбъект.СчетаДетальноДолги,ДокументДолгОбъект.ДопУслуги, ПроцентКомиссии);
		
	ИтогоКомиссияСуммаКомиссииРасчет = ИтогоКомиссияСуммаКомиссииРасчет + Строка.СуммаКомиссииРасчет;
	Если Строка.СуммаКомиссииКонтрагент = 0 Тогда
		ИтогоКомиссияСуммаКомиссииКонтрагент = ИтогоКомиссияСуммаКомиссииКонтрагент + Строка.СуммаКомиссииРасчет;
	Иначе			
		ИтогоКомиссияСуммаКомиссииКонтрагент = ИтогоКомиссияСуммаКомиссииКонтрагент + Строка.СуммаКомиссииКонтрагент;
	КонецЕсли;
КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКолонокДокументыОплаты()
МассивДокументовДолг = Новый Массив;
Для Каждого Строка Из Объект.ДокументыДолги Цикл
	МассивДокументовДолг.Добавить(Строка.ДокументДолг);	
КонецЦикла;

СуммаРаспределеноИтогоОплаты = 0;

ОплатыОбщееСервер.ОбновитьДанныеКолонокДокументыОплаты(СуммаРаспределеноИтогоОплаты
	, Объект.ДокументыОплаты, Объект, МассивДокументовДолг);	
	
Для Каждого Строка Из Объект.ДокументыОплаты Цикл
	ДокументОплаты = Строка.ДокументОплаты;
	Строка.ДатаОплаты = ДокументОплаты.ДатаОплаты;
	
	Строка.ВидОперации= ДокументОплаты.ВидОперации;

	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		Строка.Аванс = ДокументОплаты.Аванс;	
	КонецЕсли;	
КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиПлатежиКонтрагенту(ИтогоКомиссияПлатежиОплачено, ГрупповойСчетОбъект)
ЗакрытиеСервер.ОбновитьИтогиПлатежиКонтрагенту(ИтогоКомиссияПлатежиОплачено, ГрупповойСчетОбъект);	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиПлатежиКонтрагенту_1(ИтогоКомиссияПлатежиОплачено, ГрупповойСчетОбъект)
ИтогоКомиссияПлатежиОплачено = 0;	
Для Каждого Строка Из ГрупповойСчетОбъект.ДокументыПлатежиКонтрагенту Цикл
	ДокументПлатежа = Строка.ДокументПлатежа;
	Строка.СуммаПлатежаДокумент = ДокументПлатежа.Сумма;
	
	ИтогоКомиссияПлатежиОплачено = ИтогоКомиссияПлатежиОплачено + Строка.СуммаПлатежаДокумент;
КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НезакрытыеГрупповыеСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = НезакрытыеГрупповыеСчета.НайтиПоИдентификатору(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура("Ключ", ТД.ГрупповойСчет); 

ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма); 
КонецПроцедуры



