

&НаКлиенте
Процедура ОчиститьДокументы(Команда)
	ОчиститьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьДокументыНаСервере()
Для Каждого МетаДокумент Из Метаданные.Документы Цикл
	ИмяДокумента = МетаДокумент.Имя;
	
	Выборка = Документы[ИмяДокумента].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
	КонецЦикла;

КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСправочники(Команда)
ОчиститьСправочникиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьСправочникиНаСервере()
УдалитьСправочникНаСервере("Горничные");
УдалитьСправочникНаСервере("Клиенты");
УдалитьСправочникНаСервере("НомернойФонд");
	
УдалитьСправочникНаСервере("ГорничныеНомера");
УдалитьСправочникНаСервере("НоменклатураМиниБара");
УдалитьСправочникНаСервере("КоворкингНомера");
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСправочникНаСервере(ИмяСправочника)
	
	Выборка = Справочники[ИмяСправочника].Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если СправочникОбъект = Неопределено Тогда Продолжить; КонецЕсли; 
		Если СправочникОбъект.ЭтоГруппа Тогда Продолжить; КонецЕсли; 
		
		СправочникОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

