&НаКлиенте
Перем MSExcel, ДокументExcel;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ИмяФайла", ИмяФайла);
Параметры.Свойство("ПолноеИмяФайла", ПолноеИмяФайла);
Параметры.Свойство("ДокументДолгСсылка", ДокументДолгСсылка);
Параметры.Свойство("СчетГУИД", СчетГУИД);

//Если НЕ ЗначениеЗаполнено(СчетГУИД) Тогда
//	Отказ = Истина;
//	Возврат;
//КонецЕсли;	

Параметры.Свойство("НаАнглийском", НаАнглийском);

ЗаполнитьДанныеБрони();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБрони()
Если ТипЗнч(ДокументДолгСсылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	ЗаполнитьДанныеБрониЗаявка(ДокументДолгСсылка, СчетГУИД);
ИначеЕсли ТипЗнч(ДокументДолгСсылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда	
	ЗаполнитьДанныеБрониГрупповойСчет(ДокументДолгСсылка, СчетГУИД);
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБрониЗаявка(ДокументДолгСсылка, СчетГУИД)
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
Счета = ДокументДолгСсылка.Счета.НайтиСтроки(ОтборСтроки);
Если Счета.Количество() = 0 Тогда Возврат; КонецЕсли;
Счет = Счета[0];

Результат = ПечатьСервер.ДокументТелоСтроки(ДокументДолгСсылка, Счет, Ложь);	
ТЗСтроки = Результат.ТЗСтроки;

Для Каждого Строка Из ТЗСтроки Цикл
	Нов = ДанныеБрони.Добавить();

	Нов.Бронь = ДокументДолгСсылка;

	Нов.ЭтоУслуга = Строка.ЭтоУслуга;
	Нов.Клиент = Строка.Клиент;
	
	Нов.Категория = Строка.Категория;

	Нов.Наименование = Строка.НаименованиеТовара;
	
	Нов.РезервС = Формат(Строка.ДатаС, "ДФ=dd.MM.yy");
	Нов.РезервПо = Формат(Строка.ДатаПо + 86400, "ДФ=dd.MM.yy");

	Нов.КоличествоГостей = ДокументДолгСсылка.КолВоЧеловек;

	Нов.КолвоНочей = Строка.Количество;
	Нов.Количество = Строка.Количество; 

	Нов.Цена = Строка.Цена;	

	Нов.Сумма = Строка.СуммаСНДС;
КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБрониГрупповойСчет(ГрупповойСчетОбъект, Свернуть)
Счетчик =0; СуммаДляПечатиОбщая = 0; СуммаДляПечатиОбщаяНДС = 0; ЕстьНДС0 = Ложь; ЕстьНДСНе0 = Ложь;
	
ДокументТелоСтроки = ПечатьСервер.ГрупповойСчетТелоСтроки(Счетчик, СуммаДляПечатиОбщая, СуммаДляПечатиОбщаяНДС
	, ЕстьНДС0, ЕстьНДСНе0, ГрупповойСчетОбъект);	

Для Каждого Строка Из ДокументТелоСтроки Цикл
	Нов = ДанныеБрони.Добавить();

	Нов.Бронь = ДокументДолгСсылка;

	Нов.ЭтоУслуга = Строка.ЭтоУслуга;
	Нов.Клиент = Строка.Клиент;
	Нов.Категория = Строка.Категория;

	Нов.Наименование = Строка.НаименованиеТовара;
	
	Нов.РезервС = Формат(Строка.ДатаС, "ДФ=dd.MM.yy");
	Нов.РезервПо = Формат(Строка.ДатаПо, "ДФ=dd.MM.yy");

	Нов.КоличествоГостей = Строка.КолВоЧеловек;

	Нов.КолвоНочей = Строка.Количество;
	Нов.Количество = Строка.Количество; 

	Нов.Цена = Строка.Цена;	

	Нов.Сумма = Строка.СуммаСНДС;
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Запустить() Экспорт
Результат = ФормированиеПодтвержденияEXCEL(НаАнглийском);	

Если Результат.Ошибка Тогда
	Закрыть(Результат);
Иначе
	Закрыть();
КонецЕсли;	
Конецпроцедуры

&НаКлиенте
Функция ФормированиеПодтвержденияEXCEL(НаАнглийском)
Результат = Новый Структура("Ошибка, ТекстОшибки, ОписаниеОшибки", Ложь, "", "");

ФайлНаДиске = Новый Файл(ПолноеИмяФайла);
Если ФайлНаДиске.Существует() Тогда
	Попытка
		УдалитьФайлы(ПолноеИмяФайла);	
	Исключение
		Результат.Ошибка = Истина; 		
		Результат.ТекстОшибки = "Ошибка удаления 'старого' файла подтверждения";
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат Результат; 
	КонецПопытки;		
КонецЕсли;	

Ответ = СкопироватьОбразецПодтверждение(ПолноеИмяФайла, НаАнглийском);
Если Ответ.Ошибка Тогда
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка копирования шаблона подтверждения";
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
	
	Возврат Результат;
КонецЕсли;	
	
Индикатор = 15;
ОбновитьОтображениеДанных();

Попытка 	   
	MSExcel = Новый COMОбъект("Excel.Application");
Исключение
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка создания COMОбъекта Excel.Application";
	Результат.ОписаниеОшибки = ОписаниеОшибки();
	
	Возврат Результат;
КонецПопытки;
	
MSExcel.DisplayAlerts = Истина;

//MSExcel.Visible = Истина;
MSExcel.Visible = Ложь;

//MSExcel.ScreenUpdating = Истина;

Попытка 
	WorkBook = MSExcel.Workbooks.Open(ПолноеИмяФайла); 
Исключение
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка открытия подтверждения";
	Результат.ОписаниеОшибки = ОписаниеОшибки();
	
	MSExcel.Visible = Истина;
	Попытка
		MSExcel.Quit();
		MSExcel = Неопределено;
	Исключение
	КонецПопытки;
	
	Возврат Результат;
КонецПопытки;

//MSExcel.ScreenUpdating = False;

Индикатор = 20;
ОбновитьОтображениеДанных();

Попытка 
	MSExcel.DisplayAlerts = Ложь;
	MSExcel.Visible = Ложь;
	
	ПоискСтрока = MSExcel.Cells.Find("<Строка>");

	Если ПоискСтрока = Неопределено Тогда 
		Результат.Ошибка = Истина;
		Результат.ТекстОшибки = "Не найдено <Строка> в файле образца";
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		Возврат Результат;
	Иначе
		ТекущаяСтрока = ПоискСтрока.Row;
		ТекущаяСтрокаОбразец = ТекущаяСтрока; 
	КонецЕсли;	
	
	Индикатор = 25;
	ОбновитьОтображениеДанных();

	Для Индекс = 1 По ДанныеБрони.Количество() Цикл
		СтрНом = ДанныеБрони[Индекс - 1];
		
		Область = Строка(ТекущаяСтрокаОбразец) + ":" +  Строка(ТекущаяСтрокаОбразец);
		MSExcel.Rows(Область).Select();
		
		//MSExcel.Rows(Область).AutoFit();
		
		//Если Индекс > 1 Тогда
			MSExcel.Selection.Copy();
			Область = Строка(ТекущаяСтрока + 1) + ":" +  Строка(ТекущаяСтрока + 1);
			MSExcel.Rows(Область).Select();
	
			xlShiftDown	= -4121;
			xlFormatFromLeftOrAbove = 0;
			//xlFormatFromLeftOrAbove = 1;
			//MSExcel.Selection.Insert(xlShiftDown, xlFormatFromLeftOrAbove);
			//MSExcel.CutCopyMode = False;
			MSExcel.Selection.Insert(xlShiftDown);

			ТекущаяСтрока = ТекущаяСтрока + 1;
		//КонецЕсли;
		
		ФормированиеСтрокиПодтвержденияExcel(СтрНом);                                   

		Индикатор = 25 + 0.7 * (Индекс * 100 / ДанныеБрони.Количество()) ;
		ОбновитьОтображениеДанных();
	КонецЦикла;
	
	Область = Строка(ТекущаяСтрокаОбразец) + ":" +  Строка(ТекущаяСтрокаОбразец);
	MSExcel.Rows(Область).Delete();

	ИтогоСумма = 0;
	Для Каждого Строка Из ДанныеБрони Цикл
		ИтогоСумма = ИтогоСумма + Строка.Сумма;
	КонецЦикла;
	
	//ТекущаяСтрока = ТекущаяСтрока + 1;
	Область = Строка(ТекущаяСтрока) + ":" +  Строка(ТекущаяСтрока);
	MSExcel.Rows(Область).Select();
	Текст = Строка(ИтогоСумма);
	
	Если НастройкиСервер.ЭтоЛайв() Тогда
		MSExcel.Selection.Cells(1, 9).FormulaR1C1 = Текст;
	ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда
		MSExcel.Selection.Cells(1, 14).FormulaR1C1 = Текст;
	ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда
		MSExcel.Selection.Cells(1, 14).FormulaR1C1 = Текст;
	Иначе
		MSExcel.Selection.Cells(1, 6).FormulaR1C1 = Текст;
	КонецЕсли;
Исключение
	MSExcel.DisplayAlerts = Истина;
	MSExcel.Visible = Истина;
	
	//MSExcel.ScreenUpdating = True;
	
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка заполнения подтверждения";
	Результат.ОписаниеОшибки = ОписаниеОшибки();

	Попытка
		MSExcel.Quit();
		MSExcel = Неопределено;
	Исключение
	КонецПопытки;

	Возврат Результат;
КонецПопытки;

MSExcel.DisplayAlerts = Истина;
Попытка
	WorkBook.Save();
Исключение
	MSExcel.Visible = Истина;
	
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка сохранения подтверждения";
	Результат.ОписаниеОшибки = ОписаниеОшибки();
	Возврат Результат;
КонецПопытки;

Индикатор = 100;
ОбновитьОтображениеДанных();

Попытка
	MSExcel.Quit();
	MSExcel = Неопределено;
Исключение
	MSExcel.Visible = Истина;
	
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка закрытия подтверждения";
	Результат.ОписаниеОшибки = ОписаниеОшибки();
	Возврат Результат;
КонецПопытки;

Возврат Результат;
КонецФункции

&НаКлиенте
Функция ФормированиеСтрокиПодтвержденияExcel(СтрНом) 
Если НастройкиСервер.ЭтоЛайв() Тогда	
	Если СтрНом.ЭтоУслуга Тогда	
		Текст = СтрНом.Наименование;
		MSExcel.Selection.Cells(1, 1).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 1));
		
		//Текст = ПолучитьКатегорияНомера(СтрНом.Бронь);
		Текст = "";
		MSExcel.Selection.Cells(1, 4).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.РезервС);
		MSExcel.Selection.Cells(1, 5).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.Количество);
		MSExcel.Selection.Cells(1, 6).FormulaR1C1 = Текст;
		
		//Текст = Строка(СтрНом.РезервПо);
		Текст = "";
		MSExcel.Selection.Cells(1, 7).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.Цена);
		MSExcel.Selection.Cells(1, 8).FormulaR1C1 = Текст;

		Текст = Строка(СтрНом.Сумма);
		MSExcel.Selection.Cells(1, 9).FormulaR1C1 = Текст;
		
	Иначе	
			
		//Текст = ПолучитьФИО(СтрНом.Бронь);
		Текст = СтрНом.Клиент;
		MSExcel.Selection.Cells(1, 1).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 1));

		Текст = СтрНом.Категория;
		MSExcel.Selection.Cells(1, 4).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 4));
		
		Текст = Строка(СтрНом.РезервС);
		MSExcel.Selection.Cells(1, 5).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.КолвоНочей);
		MSExcel.Selection.Cells(1, 6).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.РезервПо);
		MSExcel.Selection.Cells(1, 7).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.Цена);
		MSExcel.Selection.Cells(1, 8).FormulaR1C1 = Текст;

		Текст = Строка(СтрНом.Сумма);
		MSExcel.Selection.Cells(1, 9).FormulaR1C1 = Текст;
	КонецЕсли;	
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда	
	Если СтрНом.ЭтоУслуга Тогда	
		//Текст = ПолучитьФИО(СтрНом.Бронь);
		Текст = СтрНом.Наименование;
		MSExcel.Selection.Cells(1, 2).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 2));

		//Текст = ПолучитьКатегорияНомера(СтрНом.Бронь);
		Текст = "";
		MSExcel.Selection.Cells(1, 8).FormulaR1C1 = Текст;
		
		//Текст = Строка(СтрНом.КоличествоГостей);
		Текст = "";
		MSExcel.Selection.Cells(1, 9).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.РезервС);
		//MSExcel.Selection.Range("B1").FormulaR1C1 = Текст;
		MSExcel.Selection.Cells(1, 10).FormulaR1C1 = Текст;
		
		//КоличествоНочей = (СтрНом.РезервПо_дата - СтрНом.РезервС_дата) / 24 * 60 * 60;
		//КоличествоНочей = (СтрНом.КолВо);
		//Текст = Строка(КоличествоНочей);
		Текст = СтрНом.Количество;
		MSExcel.Selection.Cells(1, 11).FormulaR1C1 = Текст;
		
		//Текст = Строка(СтрНом.РезервПо);
		Текст = "";
		MSExcel.Selection.Cells(1, 12).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.Цена);
		MSExcel.Selection.Cells(1, 13).FormulaR1C1 = Текст;

		//Текст = Строка(СтрНом.Колво * СтрНом.Цена);
		Текст = Строка(СтрНом.Сумма);
		MSExcel.Selection.Cells(1, 14).FormulaR1C1 = Текст;
	
	Иначе
		//Текст = ПолучитьФИО(СтрНом.Бронь);
		Текст = СтрНом.Клиент;
		//MSExcel.Selection.Range("A1").FormulaR1C1 = Текст;
		MSExcel.Selection.Cells(1, 2).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 2));

		//Текст = ПолучитьКатегорияНомера(СтрНом.Бронь);
		Текст = СтрНом.Категория;
		MSExcel.Selection.Cells(1, 8).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 8));
		
		Текст = Строка(СтрНом.КоличествоГостей);
		MSExcel.Selection.Cells(1, 9).FormulaR1C1 = Текст;
	
		Текст = Строка(СтрНом.РезервС);
		MSExcel.Selection.Cells(1, 10).FormulaR1C1 = Текст;
		
		//КоличествоНочей = (СтрНом.РезервПо_дата - СтрНом.РезервС_дата) / 24 * 60 * 60;
		КоличествоНочей = (СтрНом.КолВоНочей);
		Текст = Строка(КоличествоНочей);
		MSExcel.Selection.Cells(1, 11).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.РезервПо);
		MSExcel.Selection.Cells(1, 12).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.Цена);
		MSExcel.Selection.Cells(1, 13).FormulaR1C1 = Текст;

		//Текст = Строка(СтрНом.Колво * СтрНом.Цена);
		Текст = Строка(СтрНом.Сумма);
		MSExcel.Selection.Cells(1, 14).FormulaR1C1 = Текст;
	КонецЕсли;	
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда
	
	Если СтрНом.ЭтоУслуга Тогда	
	
		//Текст = ПолучитьФИО_Категория(СтрНом.Бронь);
		Текст = СтрНом.Наименование;
		MSExcel.Selection.Cells(1, 1).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 1));

		Текст = Строка(СтрНом.РезервС);
		MSExcel.Selection.Cells(1, 2).FormulaR1C1 = Текст;
		
		//Текст = Строка(СтрНом.Колво);
		Текст = Строка(СтрНом.Количество);
		MSExcel.Selection.Cells(1, 3).FormulaR1C1 = Текст;
		
		//Текст = Строка(СтрНом.РезервПо);
		Текст = "";
		MSExcel.Selection.Cells(1, 4).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.Цена);
		MSExcel.Selection.Cells(1, 5).FormulaR1C1 = Текст;

		Текст = Строка(СтрНом.Сумма);
		MSExcel.Selection.Cells(1, 6).FormulaR1C1 = Текст;
	Иначе
		//Текст = ПолучитьФИО_Категория(СтрНом.Бронь);
		Текст = СтрНом.Клиент;
		MSExcel.Selection.Cells(1, 1).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 1));

		Текст = Строка(СтрНом.РезервС);
		MSExcel.Selection.Cells(1, 2).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.КолвоНочей);
		MSExcel.Selection.Cells(1, 3).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.РезервПо);
		MSExcel.Selection.Cells(1, 4).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.Цена);
		MSExcel.Selection.Cells(1, 5).FormulaR1C1 = Текст;

		Текст = Строка(СтрНом.Сумма);
		MSExcel.Selection.Cells(1, 6).FormulaR1C1 = Текст;		
		
	КонецЕсли;
ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда	
	Если СтрНом.ЭтоУслуга Тогда	
	
		//Текст = ПолучитьФИО(СтрНом.Бронь);
		Текст = СтрНом.Наименование;
		MSExcel.Selection.Cells(1, 2).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 2));

		//Текст = ПолучитьКатегорияНомера(СтрНом.Бронь);
		Текст = "";
		MSExcel.Selection.Cells(1, 8).FormulaR1C1 = Текст;
		
		//Текст = Строка(СтрНом.КоличествоГостей);
		Текст = "";
		MSExcel.Selection.Cells(1, 9).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.РезервС);
		MSExcel.Selection.Cells(1, 10).FormulaR1C1 = Текст;
		
		//КоличествоНочей = (СтрНом.РезервПо_дата - СтрНом.РезервС_дата) / 24 * 60 * 60;
		//КоличествоНочей = (СтрНом.КолВо);
		//Текст = Строка(КоличествоНочей);
		Текст = СтрНом.Количество;
		MSExcel.Selection.Cells(1, 11).FormulaR1C1 = Текст;
		
		//Текст = Строка(СтрНом.РезервПо);
		Текст = "";
		MSExcel.Selection.Cells(1, 12).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.Цена);
		MSExcel.Selection.Cells(1, 13).FormulaR1C1 = Текст;

		//Текст = Строка(СтрНом.Колво * СтрНом.Цена);
		Текст = Строка(СтрНом.Сумма);
		MSExcel.Selection.Cells(1, 14).FormulaR1C1 = Текст;
	Иначе
		//Текст = ПолучитьФИО(СтрНом.Бронь);
		Текст = СтрНом.Клиент;
		//MSExcel.Selection.Range("A1").FormulaR1C1 = Текст;
		MSExcel.Selection.Cells(1, 2).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 2));

		//Текст = ПолучитьКатегорияНомера(СтрНом.Бронь);
		Текст = СтрНом.Категория;
		MSExcel.Selection.Cells(1, 8).FormulaR1C1 = Текст;
		RowColHeightForContent(MSExcel.Selection.Cells(1, 8));
		
		Текст = Строка(СтрНом.КоличествоГостей);
		MSExcel.Selection.Cells(1, 9).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.РезервС);
		MSExcel.Selection.Cells(1, 10).FormulaR1C1 = Текст;
		
		//КоличествоНочей = (СтрНом.РезервПо_дата - СтрНом.РезервС_дата) / 24 * 60 * 60;
		КоличествоНочей = (СтрНом.КолВоНочей);
		Текст = Строка(КоличествоНочей);
		MSExcel.Selection.Cells(1, 11).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.РезервПо);
		MSExcel.Selection.Cells(1, 12).FormulaR1C1 = Текст;
		
		Текст = Строка(СтрНом.Цена);
		MSExcel.Selection.Cells(1, 13).FormulaR1C1 = Текст;

		//Текст = Строка(СтрНом.Колво * СтрНом.Цена);
		Текст = Строка(СтрНом.Сумма);
		MSExcel.Selection.Cells(1, 14).FormulaR1C1 = Текст;		
	КонецЕсли;
		
КонецЕсли;
	
КонецФункции


//'---------------------------------------------------------------------------------------
//' Procedure : RowHeightForContent
//' Author    : The_Prist(Щербаков Дмитрий)
//'             http://www.excel-vba.ru
//' Purpose   : Функция подбирает высоту строки/ширину столбца объединенных ячеек по содержимому
//'---------------------------------------------------------------------------------------
&НаКлиенте
Function RowColHeightForContent(rc, bRowHeight = True)
//'rc -         ячейка, высоту строки или ширину столбца которой необходимо подобрать
//'bRowHeight - True - если необходимо подобрать высоту строки
//'             False - если необходимо подобрать ширину столбца

 //   Dim OldR_Height As Single, OldC_Widht As Single
 //   Dim MergedR_Height As Single, MergedC_Widht As Single
 //   Dim CurrCell As Range
 //   Dim ih As Integer
 //   Dim iw As Integer
 //   Dim NewR_Height As Single, NewC_Widht As Single
 //   Dim ActiveCellHeight As Single
 //
 	If rc.MergeCells Then
	    rc_MergeArea = rc.MergeArea;
		//With rc.MergeArea 'если ячейка объединена
			//'запоминаем кол-во столбцов
            iw = rc_MergeArea.Columns(rc_MergeArea.Columns.Count).Column - rc.Column + 1;
			//'запоминаем кол-во строк.
            ih = rc_MergeArea.Rows(rc_MergeArea.Rows.Count).Row - rc.Row + 1;
			//'Определяем высоту и ширину объединения ячеек
            MergedR_Height = 0;
            Для Каждого CurrCell Из rc_MergeArea.Rows Цикл
                MergedR_Height = CurrCell.RowHeight + MergedR_Height;
			КонецЦикла;
			
            MergedC_Widht = 0;
            Для Каждого CurrCell Из rc_MergeArea.Columns Цикл
                MergedC_Widht = CurrCell.ColumnWidth + MergedC_Widht;
            КонецЦикла;
			
			//'запоминаем высоту и ширину первой ячейки из объединенных
            OldR_Height = rc_MergeArea.Cells(1, 1).RowHeight;
            OldC_Widht = rc_MergeArea.Cells(1, 1).ColumnWidth;
			
			//'отменяем объединение ячеек
            rc_MergeArea.MergeCells = False;
			//'назначаем новую высоту и ширину для первой ячейки
            rc_MergeArea.Cells(1).RowHeight = MergedR_Height;
            rc_MergeArea.Cells(1, 1).EntireColumn.ColumnWidth = MergedC_Widht;
			
			//'если необходимо изменить высоту строк
            If bRowHeight Then
				//'.WrapText = True 'раскомментировать, если необходимо принудительно выставлять перенос текста
				rc_MergeArea.WrapText = True; //'раскомментировать, если необходимо принудительно выставлять перенос текста
				rc_MergeArea.EntireRow.AutoFit();
				
				NewR_Height = rc_MergeArea.Cells(1).RowHeight; //    'запоминаем высоту строки
                rc_MergeArea.MergeCells = True;
                If OldR_Height < (NewR_Height / ih) Then
                    rc_MergeArea.RowHeight = NewR_Height / ih;
                Else
                    rc_MergeArea.RowHeight = OldR_Height ;
                EndIf;
					
				//'возвращаем ширину столбца первой ячейки
			    rc_MergeArea.Cells(1, 1).EntireColumn.ColumnWidth = OldC_Widht
			//Else 'если необходимо изменить ширину столбца
			//    .EntireColumn.AutoFit
			//    NewC_Widht = .Cells(1).EntireColumn.ColumnWidth    'запоминаем ширину столбца
			//    .MergeCells = True
			//    If OldC_Widht < (NewC_Widht / iw) Then
			//        .ColumnWidth = NewC_Widht / iw
			//    Else
			//        .ColumnWidth = OldC_Widht
			//    End If
			//    'возвращаем высоту строки первой ячейки
			//    .Cells(1, 1).RowHeight = OldR_Height
            EndIf;
		//End With
    EndIf;
EndFunction
	
//'---------------------------------------------------------------------------------------
//' Procedure : RowHeightForContent
//' Author    : The_Prist(Щербаков Дмитрий)
//'             http://www.excel-vba.ru
//' Purpose   : Функция подбирает высоту строки/ширину столбца объединенных ячеек по содержимому
//'---------------------------------------------------------------------------------------
//Function RowColHeightForContent(rc As Range, Optional bRowHeight As Boolean = True)
//'rc -         ячейка, высоту строки или ширину столбца которой необходимо подобрать
//'bRowHeight - True - если необходимо подобрать высоту строки
//'             False - если необходимо подобрать ширину столбца
//    Dim OldR_Height As Single, OldC_Widht As Single
//    Dim MergedR_Height As Single, MergedC_Widht As Single
//    Dim CurrCell As Range
//    Dim ih As Integer
//    Dim iw As Integer
//    Dim NewR_Height As Single, NewC_Widht As Single
//    Dim ActiveCellHeight As Single
// 
//    If rc.MergeCells Then
//        With rc.MergeArea 'если ячейка объединена
//            'запоминаем кол-во столбцов
//            iw = .Columns(.Columns.Count).Column - rc.Column + 1
//            'запоминаем кол-во строк.
//            ih = .Rows(.Rows.Count).Row - rc.Row + 1
//            'Определяем высоту и ширину объединения ячеек
//            MergedR_Height = 0
//            For Each CurrCell In .Rows
//                MergedR_Height = CurrCell.RowHeight + MergedR_Height
//            Next
//            MergedC_Widht = 0
//            For Each CurrCell In .Columns
//                MergedC_Widht = CurrCell.ColumnWidth + MergedC_Widht
//            Next
//            'запоминаем высоту и ширину первой ячейки из объединенных
//            OldR_Height = .Cells(1, 1).RowHeight
//            OldC_Widht = .Cells(1, 1).ColumnWidth
//            'отменяем объединение ячеек
//            .MergeCells = False
//            'назначаем новую высоту и ширину для первой ячейки
//            .Cells(1).RowHeight = MergedR_Height
//            .Cells(1, 1).EntireColumn.ColumnWidth = MergedC_Widht
//            'если необходимо изменить высоту строк
//            If bRowHeight Then
//                '.WrapText = True 'раскомментировать, если необходимо принудительно выставлять перенос текста
//                .EntireRow.AutoFit
//                NewR_Height = .Cells(1).RowHeight    'запоминаем высоту строки
//                .MergeCells = True
//                If OldR_Height < (NewR_Height / ih) Then
//                    .RowHeight = NewR_Height / ih
//                Else
//                    .RowHeight = OldR_Height
//                End If
//                'возвращаем ширину столбца первой ячейки
//                .Cells(1, 1).EntireColumn.ColumnWidth = OldC_Widht
//            Else 'если необходимо изменить ширину столбца
//                .EntireColumn.AutoFit
//                NewC_Widht = .Cells(1).EntireColumn.ColumnWidth    'запоминаем ширину столбца
//                .MergeCells = True
//                If OldC_Widht < (NewC_Widht / iw) Then
//                    .ColumnWidth = NewC_Widht / iw
//                Else
//                    .ColumnWidth = OldC_Widht
//                End If
//                'возвращаем высоту строки первой ячейки
//                .Cells(1, 1).RowHeight = OldR_Height
//            End If
//        End With
//    End If
//End Function	
	
&НаСервере
Функция СкопироватьОбразецПодтверждение(ФайлПолучатель, НаАнглийском)
Результат = Новый Структура("Ошибка, ОписаниеОшибки", Ложь, "");
	
ИмяОрганизации = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
КаталогОбразец = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
КаталогОбразец = КаталогОбразец + "ОбразцыДокументов\";

Если НаАнглийском тогда
	ПолноеИмяОбразца = КаталогОбразец + "НовоеПодтверждение_А_" + ИмяОрганизации;	
иначе
	ПолноеИмяОбразца =  КаталогОбразец + "НовоеПодтверждение_" + ИмяОрганизации; 
конецесли;

ПолноеИмяОбразца = ПолноеИмяОбразца + ".xls";

Попытка 
	КопироватьФайл(ПолноеИмяОбразца, ФайлПолучатель);
Исключение
	Результат.Ошибка = Истина;
	Результат.ОписаниеОшибки = ОписаниеОшибки();
КонецПопытки;

Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьМакетПодтверждениеВДвоичныхДанных_НеИспользуется(НаАнглийском)
	ИмяМакета = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
	Если НаАнглийском тогда
		ИмяМакета = "НовоеПодтверждение_А_" + ИмяМакета;	
		//Макет = ПолучитьМакетНаСервере(ИмяМакета);	
			
	иначе
		ИмяМакета = "НовоеПодтверждение_" + ИмяМакета; 
		//Макет = ПолучитьМакетНаСервере(ИмяМакета);		
	конецесли;
	Макет = Документы.ПодтверждениеБронирования.ПолучитьМакет(ИмяМакета);	
	
	//Получим путь во временной директории для сохранения туда файла
	ИмяВрем = ПолучитьИмяВременногоФайла(".doc");

	Макет.Записать(ИмяВрем);
	МойДокументВДвоичныхДанных = Новый ДвоичныеДанные(ИмяВрем);

	Возврат МойДокументВДвоичныхДанных;
КонецФункции

&НаСервере
Функция ПолучитьФИО_Категория(Бронь)
ФИО = Бронь.Клиент.Наименование +"(" + Бронь.КатегорияНомера.Наименование+")";	
Возврат ФИО;
КонецФункции	

&НаСервере
Функция ПолучитьФИО(Бронь)
ФИО = Бронь.Клиент.Наименование;	
Возврат ФИО;
КонецФункции

&НаСервере
Функция ПолучитьКатегорияНомера(Бронь)
КатегорияНомера = Бронь.КатегорияНомера.Наименование;	
Возврат КатегорияНомера;
КонецФункции


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
Если MsExcel = Неопределено Тогда Возврат; КонецЕсли;

Попытка
	MsExcel.Quit(); 
Исключение
	Сообщить(ОписаниеОшибки());
КонецПопытки;

MsExcel = Неопределено;
КонецПроцедуры

// +++++++++++++++++++++++++++++++++++





