
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ТипТранзакции") Тогда
		ТипТранзакции = Параметры.ТипТранзакции;	
	КонецЕсли;

	СписокТиповКарт = Неопределено;

	СуммаВременная = 0;
	Если Параметры.Свойство("Сумма", СуммаВременная)
	   И СуммаВременная > 0 Тогда
		Сумма = СуммаВременная;
	Иначе
		Сумма = 0;
	КонецЕсли;

	//времПределСуммы = 0;
	//Если Параметры.Свойство("ПределСуммы", времПределСуммы)
	//   И времПределСуммы > 0 Тогда
	//	Элементы.Сумма.МаксимальноеЗначение = времПределСуммы;
	//Иначе
	//	Элементы.Сумма.МаксимальноеЗначение = Неопределено;
	//КонецЕсли;
	Элементы.Сумма.МаксимальноеЗначение = Неопределено;
	
	Если Параметры.Свойство("ЗапретРедактированияСуммы") Тогда
		Элементы.Сумма.ТолькоПросмотр = Параметры.ЗапретРедактированияСуммы;
	КонецЕсли;
	
	Если Параметры.Свойство("СписокТиповКарт", СписокТиповКарт)
	   И ТипЗнч(СписокТиповКарт) = Тип("СписокЗначений")
	   И СписокТиповКарт. Количество() > 0 Тогда
		Для Каждого СтрокаСписка Из СписокТиповКарт Цикл
			Элементы.ТипКарты.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
		КонецЦикла;
		Элементы.ТипКарты.Видимость = Истина;
	КонецЕсли;
	
	Элементы.НомерКарты.Видимость            = Ложь;
	Элементы.НомерКарты.ТолькоПросмотр       = Истина;
	Элементы.НомерКарты.РедактированиеТекста = Ложь;

	Если Параметры.Свойство("ПоказыватьНомерКарты", ПоказыватьНомерКарты) Тогда
		Если ПоказыватьНомерКарты Тогда
			Элементы.НомерКарты.Видимость            = Истина;
			//Элементы.НомерКарты.ТолькоПросмотр       = Ложь;
			//Элементы.НомерКарты.РедактированиеТекста = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.Сумма.ТолькоПросмотр Тогда
		Элементы.Сумма.АктивизироватьПоУмолчанию = Ложь;
		Если Элементы.ТипКарты.Видимость И Элементы.ТипКарты.СписокВыбора.Количество() > 1 Тогда
			Элементы.ТипКарты.АктивизироватьПоУмолчанию = Истина;
		ИначеЕсли Элементы.НомерКарты.Видимость Тогда
			Элементы.НомерКарты.АктивизироватьПоУмолчанию = Истина;
		Иначе
			Элементы.ВыполнитьОперацию.АктивизироватьПоУмолчанию = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("УказатьДополнительныеДанные") Тогда
		//УказатьДополнительныеДанные = Истина;
		УказатьДополнительныеДанные = Параметры.УказатьДополнительныеДанные;
	КонецЕсли;
	
	Если Параметры.Свойство("СсылочныйНомер") Тогда
		СсылочныйНомер = Параметры.СсылочныйНомер;
	КонецЕсли;
	
	Если Параметры.Свойство("НомерЧека") Тогда
		НомерЧека = Параметры.НомерЧека;
	КонецЕсли;
	
	Если Параметры.Свойство("НомерЧекаЭТ") Тогда
		НомерЧекаЭТ = Параметры.НомерЧекаЭТ;
	КонецЕсли;
	
	Элементы.ГруппаРучнойВводДанных.Видимость = УказатьДополнительныеДанные;
	Элементы.УказатьДополнительныеДанные.Видимость = Ложь;
	
	Если ТипТранзакции = "AuthorizeSales" Тогда
		ЭтаФорма.Заголовок = "Оплата";
		
	ИначеЕсли ТипТранзакции = "AuthorizeRefund" Тогда
		ЭтаФорма.Заголовок = "Возврат оплаты";
		
	ИначеЕсли ТипТранзакции = "AuthorizeVoid" Тогда
		ЭтаФорма.Заголовок = "Отмена оплаты";
	КонецЕсли;	
	
	Если ТипТранзакции = "AuthorizeVoid"
	ИЛИ ТипТранзакции = "AuthorizeRefund" 
	Тогда 
		Элементы.Чек.Видимость = Истина;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УказатьДополнительныеДанныеПриИзменении(Элемент)

	Элементы.ГруппаРучнойВводДанных.Видимость = УказатьДополнительныеДанные;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
Если ТипТранзакции = "AuthorizeVoid"
ИЛИ ТипТранзакции = "AuthorizeRefund" 
Тогда 
	Если ПредупреждениеСуммаВозврата() Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Сумма;
		Возврат;
	КонецЕсли;	
КонецЕсли;	
	
	Ошибки = "";
	
	ОчиститьСообщения();
	
	Если Сумма = 0 Тогда
		Ошибки = НСтр("ru='Платеж не может быть осуществлен на нулевую сумму.'");
	КонецЕсли;
	
	Если ПоказыватьНомерКарты И Не ЗначениеЗаполнено(НомерКарты) Тогда
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки),"",Символы.ПС) + НСтр("ru='Платеж не может быть осуществлен без номера карты.'");
	КонецЕсли;
	
	Если ПустаяСтрока(Ошибки) Тогда
		Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_БудетВыполненаОплата", ЭтаФорма);
		ВопросТекст = "";
		Если ТипТранзакции = "AuthorizeSales" Тогда
			ВопросТекст = "Будет выполнена оплата на сумму: " + Сумма; 	
		ИначеЕсли ТипТранзакции = "AuthorizeVoid" Тогда
			ВопросТекст = "Будет выполнена отмена оплаты на сумму: " + Сумма; 	
		ИначеЕсли ТипТранзакции = "AuthorizeRefund" Тогда
			ВопросТекст = "Будет выполнена отмена оплаты на сумму: " + Сумма; 	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВопросТекст) Тогда
			ВопросТекст = ВопросТекст + "
				|
				|ПОДТВЕРДИТЕ ...";
			ПоказатьВопрос(Оповещение, ВопросТекст, РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.Отмена);        
			Возврат;
		КонецЕсли;
		
		ЗавершениеВопроса_БудетВыполненаОплата(КодВозвратаДиалога.ОК, Неопределено);
		
		//Если Не УказатьДополнительныеДанные Тогда
		//	СсылочныйНомер = "";
		//	НомерЧека      = "";
		//КонецЕсли;
		//
		//СтруктураВозврата = Новый Структура();
		//СтруктураВозврата.Вставить("Сумма"         , Сумма);
		//СтруктураВозврата.Вставить("ДанныеКарты"   , "");
		//СтруктураВозврата.Вставить("СсылочныйНомер", СсылочныйНомер);
		//СтруктураВозврата.Вставить("ТипКарты"      , ТипКарты);
		//СтруктураВозврата.Вставить("НомерКарты"    , НомерКарты);
		//СтруктураВозврата.Вставить("НомерЧека"     , НомерЧека);
		//СтруктураВозврата.Вставить("НомерЧекаЭТ"   , НомерЧекаЭТ);
		//
		////СтруктураВозврата.Вставить("Форма"   , ЭтаФорма.ВладелецФормы);
		//Закрыть(СтруктураВозврата);
		
	Иначе
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(Ошибки,,"НомерКарты");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_БудетВыполненаОплата(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда 
	Сообщить("Операция отменена");
	Возврат; 
КонецЕсли; 	
	
Если Не УказатьДополнительныеДанные Тогда
	СсылочныйНомер = "";
	НомерЧека      = "";
КонецЕсли;

СтруктураВозврата = Новый Структура();
СтруктураВозврата.Вставить("Сумма"         , Сумма);
СтруктураВозврата.Вставить("ДанныеКарты"   , "");
СтруктураВозврата.Вставить("СсылочныйНомер", СсылочныйНомер);
СтруктураВозврата.Вставить("ТипКарты"      , ТипКарты);
СтруктураВозврата.Вставить("НомерКарты"    , НомерКарты);
СтруктураВозврата.Вставить("НомерЧека"     , НомерЧека);
СтруктураВозврата.Вставить("НомерЧекаЭТ"   , НомерЧекаЭТ);

Закрыть(СтруктураВозврата);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СуммаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)

	Если Элементы.Сумма.МаксимальноеЗначение <> Неопределено
	   И Элементы.Сумма.МаксимальноеЗначение < Число(Текст) Тогда
	   
		СтандартнаяОбработка = Ложь;
		СтруктураЗначения = Новый Структура;
		СтруктураЗначения.Вставить("Предупреждение", НСтр("ru = 'Сумма оплаты по карте превышает необходимую безналичную оплату.
		|Значение будет изменено на максимально возможное.'"));
		СтруктураЗначения.Вставить("Значение", Формат(Элементы.Сумма.МаксимальноеЗначение, "ЧДЦ=2; ЧН=0; ЧГ=0; ЧО=1"));
		
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(СтруктураЗначения);
		ДанныеВыбора = СписокЗначений;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Чек(Команда)
Оповещение = Новый ОписаниеОповещения("Завершение_ФормаВыбора", ЭтаФорма);

ПараметрыФормы = Новый Структура("ТолькоБезКассовогоЧека", Истина);
ОткрытьФорму("РегистрСведений.ОперацииЭТ.Форма.ФормаВыбораЭТ",,ЭтаФорма
	,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры

&НаКлиенте
Процедура Завершение_ФормаВыбора(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;	

УстановитьПараметрыЧека(Результат);

Если ПредупреждениеСуммаВозврата() Тогда
	ЭтаФорма.ТекущийЭлемент = Элементы.Сумма;
КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЧека(КлючЗаписи) 
Запись = регистрыСведений.ОперацииЭТ.СоздатьМенеджерЗаписи();
ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);     
Запись.Прочитать(); 

НомерКарты = Запись.НомерКарты; 

СсылочныйНомер = Запись.СсылочныйНомер; 
НомерЧекаЭТ = Запись.НомерЧекаЭТ; 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	СУММА(ОперацииЭТ.СуммаОперации) КАК СуммаОперации
                      |ИЗ
                      |	РегистрСведений.ОперацииЭТ КАК ОперацииЭТ
                      |ГДЕ
                      |	ОперацииЭТ.НомерКарты = &НомерКарты
                      |	И ОперацииЭТ.СсылочныйНомерВозврат = &СсылочныйНомерВозврат
					  |	И ОперацииЭТ.ТипТранзакции В(&ТипТранзакции)
					  |");

Запрос.УстановитьПараметр("НомерКарты", НомерКарты);
Запрос.УстановитьПараметр("СсылочныйНомерВозврат", СсылочныйНомер);

ТипТранзакции_СЗ = Новый СписокЗначений;
ТипТранзакции_СЗ.Добавить("AuthorizeVoid");
ТипТранзакции_СЗ.Добавить("AuthorizeRefund");
Запрос.УстановитьПараметр("ТипТранзакции", ТипТранзакции_СЗ);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	СуммаВозврата = 0;
Иначе
	СуммаВозврата = ТЗ[0].СуммаОперации
КонецЕсли;

СуммаОперации = Запись.СуммаОперации;
Остаток = СуммаОперации - СуммаВозврата; 

Сумма = Остаток;
КонецПроцедуры

&НаКлиенте
Функция ПредупреждениеСуммаВозврата()
Если Сумма > Остаток Тогда
	ПоказатьПредупреждение(,"Сумма возврата > Суммы остатка по карте"); 		
	Возврат Истина;
КонецЕсли;	
	
Возврат Ложь;
КонецФункции