

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.НомерВРезерв КАК НомерВРезерв,
                      |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.ДатаОбслуживания КАК ДатаОбслуживания,
                      |	ГорничныеОбслуживаниеНомераМинибар.НоменклатураМинибара КАК НоменклатураМинибара,
                      |	ГорничныеОбслуживаниеНомераМинибар.НоменклатураМинибараНаименованиеВыгрузка КАК НоменклатураМинибараНаименованиеВыгрузка,
                      |	ГорничныеОбслуживаниеНомераМинибар.Количество КАК Количество,
                      |	ГорничныеОбслуживаниеНомераМинибар.Цена КАК Цена,
                      |	ГорничныеОбслуживаниеНомераМинибар.Количество * ГорничныеОбслуживаниеНомераМинибар.Цена КАК Сумма,
                      |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ИЗ
                      |	Документ.ГорничныеОбслуживаниеНомера.Минибар КАК ГорничныеОбслуживаниеНомераМинибар
                      |ГДЕ
                      |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.Дата >= &ДатаС
                      |	И ГорничныеОбслуживаниеНомераМинибар.Ссылка.Дата <= &ДатаПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаОбслуживания,
                      |	НоменклатураМинибара,
                      |	НоменклатураМинибараНаименованиеВыгрузка,
                      |	НомерВРезерв,
                      |	ЗаявкаНаБронирование");

Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

ОтчетОбъект = РеквизитФормыВЗначение("Объект");
Макет = ОтчетОбъект.ПолучитьМакет("Макет");

Область = Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(Область);

Для Каждого Строка Из ТЗ Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.Дата = Строка.ДатаОбслуживания;
	
	Если ЗначениеЗаполнено(Строка.НоменклатураМинибара) Тогда
		Область.Параметры.Номенклатура = Строка.НоменклатураМинибара;
	Иначе
		Область.Параметры.Номенклатура = "*" + Строка.НоменклатураМинибараНаименованиеВыгрузка;
	КонецЕсли;
	
	Область.Параметры.Количество = Строка.Количество;
	Область.Параметры.Цена = Строка.Цена;
	Область.Параметры.Сумма = Строка.Цена * Строка.Количество;

	Область.Параметры.Номер = Строка.НомерВРезерв;
	Область.Параметры.Заявка = Строка.ЗаявкаНаБронирование;
	
	ПолеОтчета.Вывести(Область);
КонецЦикла;
КонецПроцедуры
