

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТЗ = Параметры.Заселения;

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЗаселенияПолный.Добавить();	
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

Администратор = Параметры.Администратор;

ЗаполнитьЗаселения();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаселения()
Заселения.Очистить();
Если Все Тогда	
	Заселения_П = ЗаселенияПолный;
Иначе
	ОтборСтроки =Новый Структура("Администратор", Администратор);
	Заселения_П = ЗаселенияПолный.НайтиСтроки(ОтборСтроки);	
КонецЕсли;

Для Каждого Строка Из Заселения_П Цикл
	НоваяСтрока = Заселения.Добавить();	
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВсеПриИзменении(Элемент)
ЗаполнитьЗаселения();
КонецПроцедуры



