
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаРассылки = ТекущаяДата();

Список.Параметры.УстановитьЗначениеПараметра("ДатаРассылки", '00010101');
КонецПроцедуры

&НаКлиенте
Процедура РазослатьWhatsApp_ДеньРождения(Команда)
Если ЕстьРассылка() Тогда
	ПоказатьПредупреждение(,"Была рассылка на дату: " + Формат(ДатаРассылки,  "ДФ=dd.MM.yyyy"));
	
	Возврат;
КонецЕсли;

РассылкаWhatsApp.РассылкаWhatsApp_ДеньРождения(ДатаРассылки);
КонецПроцедуры

&НаСервере
Функция ЕстьРассылка() 
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	РассылкаWhatsApp.ДатаРассылки КАК ДатаРассылки
                      |ИЗ
                      |	РегистрСведений.РассылкаWhatsApp КАК РассылкаWhatsApp
                      |ГДЕ
                      |	РассылкаWhatsApp.ДатаРассылки = &ДатаРассылки
                      |	И РассылкаWhatsApp.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипРассылкиWhatsApp.ДеньРождения)");

Запрос.УстановитьПараметр("ДатаРассылки", ДатаРассылки);

Результат = Запрос.Выполнить();
Возврат НЕ Результат.Пустой();
КонецФункции

&НаКлиенте
Процедура Рассылки_ДеньРождения(Команда)
Список.Параметры.УстановитьЗначениеПараметра("ДатаРассылки", ДатаРассылки);

Элементы.Список.Обновить();
КонецПроцедуры



