
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр();
ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Если КонтрольДатаНазначенияЦены() Тогда
	ПоказатьПредупреждение(, "Есть записи с такой же датой назначения цены
	| 
	|ЗАПИСЬ ОТМЕНЯЕТСЯ ...");
	
	Отказ = Истина; Возврат;
КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция КонтрольДатаНазначенияЦены()
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	ГорничныеСтоимостьУборок.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.ГорничныеСтоимостьУборок КАК ГорничныеСтоимостьУборок
                      |ГДЕ
                      |	ГорничныеСтоимостьУборок.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеСтоимостьУборок.Ссылка <> &Ссылка
                      |	И ГорничныеСтоимостьУборок.ДатаНазначенияЦены = &ДатаНазначенияЦены");

Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
Запрос.УстановитьПараметр("ДатаНазначенияЦены", Объект.ДатаНазначенияЦены);

Результат = Запрос.Выполнить();

Возврат НЕ Результат.Пустой();
КонецФункции

