//
Функция Соединение() Экспорт
КоличествоПопыток = 0;	
~Соединение:
Если КоличествоПопыток > 3 Тогда Возврат Неопределено; КонецЕсли;

Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.СоединениеГорничнныеАдресВХранилище) Тогда
	//Параметры = "File=""C:\_Base1C\hostess"";Usr=""Соединение"";Pwd=""123""";
	Папка_Горничные = Константы.ПАПКА_Горничные.Получить();
	
	//Если НЕ ЗначениеЗаполнено(Папка_Горничные) Тогда
	//	Папка_Горничные = "C:\_Base1C\hostess";
	//КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Папка_Горничные) Тогда
		Сообщить("Не настроена папка Горничные");
		
		Возврат Неопределено;
	КонецЕсли;	
	
	Папка_Горничные = """" + Папка_Горничные + """";
	
	Параметры = "File=" + Папка_Горничные + ";Usr=""Соединение"";Pwd=""123""";
	
	COMConnector= Новый COMОбъект("V83.COMConnector");
	Попытка
		Соединение =  COMConnector.Connect(Параметры);
	Исключение
		Сообщить("Ошибка подключения к БД Горничные. " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	СоединениеСтруктура = Новый Структура("Соединение", Соединение);
	ПараметрыСеанса.СоединениеГорничнныеАдресВХранилище = ПоместитьВоВременноеХранилище(СоединениеСтруктура, Новый УникальныйИдентификатор());
КонецЕсли;

Соединение = ПолучитьИзВременногоХранилища(ПараметрыСеанса.СоединениеГорничнныеАдресВХранилище).Соединение;
Попытка
	Соединение.ОбменГорничныеСервер.ПроверкаСоединения();

	Возврат Соединение;
Исключение
	ПараметрыСеанса.СоединениеГорничнныеАдресВХранилище = "";
	КоличествоПопыток = КоличествоПопыток + 1;
	Перейти ~Соединение;
КонецПопытки;	
КонецФункции

Процедура СоздатьЗаявку(Заявка, Событие) Экспорт
ОбменСГорничными = Константы.ОбменСГорничными.Получить();
Если НЕ ОбменСГорничными Тогда Возврат; КонецЕсли;

//
НомерГорничные = Заявка.НомерВРезерв.НомерГорничные;
Если НЕ ЗначениеЗаполнено(НомерГорничные) Тогда
	ТекстСообщения = "ВНИМАНИЕ ! Не заполнен рекизит 'Номер Горничные' справочника 'Номерной Фонд' для номера: " 
		+ Заявка.НомерВРезерв + ".";
	ТекстСообщения = ТекстСообщения + " ОБРАТИТЕСЬ К АДМИНИСТАТОРУ ПРОГРАММЫ ...";
	
	Сообщить(ТекстСообщения);
	
	Возврат;
КонецЕсли;	

ДанныеЗаявки = Новый Структура;
ГУИДСтрока = XMLСтрока(Заявка);
СсылкаСтрока = Строка(Заявка);

ДанныеЗаявки.Вставить("ГУИДСтрока", ГУИДСтрока);
ДанныеЗаявки.Вставить("СсылкаСтрока", СсылкаСтрока);

ДанныеЗаявки.Вставить("НомерГорничные", НомерГорничные);
ДанныеЗаявки.Вставить("Событие", Событие);

ДанныеЗаявки.Вставить("Номер", Заявка.Номер);
ДанныеЗаявки.Вставить("Дата", Заявка.Дата);

ДанныеЗаявки.Вставить("Статус", XMLстрока(Заявка.Статус));

ДанныеЗаявки.Вставить("РезервС", Заявка.РезервС);
ДанныеЗаявки.Вставить("РезервПо", Заявка.РезервПо);
ДанныеЗаявки.Вставить("ВремяЗаезда", XMLстрока(Заявка.ВремяЗаезда));
ДанныеЗаявки.Вставить("ВремяВыезда", XMLстрока(Заявка.ВремяВыезда));
ДанныеЗаявки.Вставить("РаздельныеКровати", Заявка.РаздельныеКровати);

ДанныеЗаявки.Вставить("КоличествоПроживающих", Заявка.КолВоЧеловек);

ДанныеЗаявки.Вставить("ДопМесто_1_Возраст", Заявка.ДопМесто_1_Возраст);
ДанныеЗаявки.Вставить("ДопМесто_1_ТипДопМеста", Заявка.ДопМесто_1_ТипДопМеста);

ДанныеЗаявки.Вставить("ДопМесто_2_Возраст", Заявка.ДопМесто_2_Возраст);
ДанныеЗаявки.Вставить("ДопМесто_2_ТипДопМеста", Заявка.ДопМесто_2_ТипДопМеста);

ДанныеЗаявки.Вставить("ГорничныеВремяЗаезда", Заявка.ГорничныеВремяЗаезда);
ДанныеЗаявки.Вставить("ГорничныеКоментарий", Заявка.ГорничныеКоментарий);

ДанныеЗаявки.Вставить("ВремяЗаездаТочное", Заявка.ВремяЗаездаТочное);
ДанныеЗаявки.Вставить("ВремяВыездаТочное", Заявка.ВремяВыездаТочное);
//
Соединение = Соединение();
Если Соединение = Неопределено Тогда
	Сообщить("Ошибка подключения к БД Горничные. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	
	Возврат; 
КонецЕсли;

Попытка
	Соединение.ОбменГорничныеСервер.СоздатьЗаявку(ДанныеЗаявки, Событие);
	
	//ОбщийМодульСлужебныеСервер.ВЛог("Создано задание горничной: " + ЗаданиеТекст + " по номеру " + Строка(Число(Номер.Код))+" пользователем "
	//	+ ПараметрыСеанса.ТекущийПользователь, "Задания.log");	
Исключение
	Сообщить("Ошибка создания Заявки в БД Горничные. Номер Заявки: " + ДанныеЗаявки.Номер + ". Описание ошибки: " + ОписаниеОшибки()); 	
			
	//ОбщийМодульСлужебныеСервер.ВЛог("Ошибка создания задания горничной: " + ЗаданиеТекст + " по номеру " + Строка(Число(Номер.Код))+" пользователем "
	//+ ПараметрыСеанса.ТекущийПользователь, "Задания.log");	
КонецПопытки;	
КонецПроцедуры

Процедура ЗагрузитьОбслуживаниеНомеров(ДатаОбслуживания_С, ДатаОбслуживания_По, НомерГорничные) Экспорт
ОбменСГорничными = Константы.ОбменСГорничными.Получить();
Если НЕ ОбменСГорничными Тогда Возврат; КонецЕсли;

Соединение = Соединение();
Если Соединение = Неопределено Тогда 
	Сообщить("Нет связи с БД Горничные. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	
	Возврат;
КонецЕсли;

Попытка
	ТЗДанные = Соединение.ОбменГорничныеСервер.ВыгрузитьОбслуживаниеНомеров(ДатаОбслуживания_С, ДатаОбслуживания_По, НомерГорничные);
Исключение
	Сообщить("Ошибка загрузки Обслуживание номеров.");
	
	Возврат;                                  
КонецПопытки;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеОбслуживаниеНомера.Ссылка КАК Ссылка,
                      |	ГорничныеОбслуживаниеНомера.ДатаОбслуживания КАК ДатаОбслуживания,
                      |	ГорничныеОбслуживаниеНомера.НомерОбслуживания_пп КАК НомерОбслуживания_пп,
                      |	ГорничныеОбслуживаниеНомера.ГорничныеНомер.НомерГорничные КАК НомерГорничные
                      |ИЗ
                      |	Документ.ГорничныеОбслуживаниеНомера КАК ГорничныеОбслуживаниеНомера
                      |ГДЕ
                      |	ГорничныеОбслуживаниеНомера.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеОбслуживаниеНомера.ДатаОбслуживания МЕЖДУ &ДатаОбслуживания_С И &ДатаОбслуживания_По");
Запрос.УстановитьПараметр("ДатаОбслуживания_С", ДатаОбслуживания_С);
Запрос.УстановитьПараметр("ДатаОбслуживания_По", ДатаОбслуживания_По);
ТЗ_ГорничныеОбслуживаниеНомера = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	НомернойФонд.Ссылка КАК Ссылка,
                      |	НомернойФонд.НомерГорничные КАК НомерГорничные
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд");
ТЗ_НомернойФонд = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеНомера.Ссылка КАК Ссылка,
                      |	ГорничныеНомера.НомерГорничные КАК НомерГорничные
                      |ИЗ
                      |	Справочник.ГорничныеНомера КАК ГорничныеНомера");
ТЗ_ГорничныеНомера = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗДанные Цикл
	ОтборСтроки = Новый Структура("ДатаОбслуживания, НомерОбслуживания_пп, НомерГорничные"
		, Строка.ДатаОбслуживания, Строка.НомерОбслуживания_пп, Строка.НомерГорничные);
	ТЗ = ТЗ_ГорничныеОбслуживаниеНомера.НайтиСтроки(ОтборСтроки);
	
	//НомерВРезерв = Справочники.НомернойФонд.НайтиПоРеквизиту("НомерГорничные", Строка.НомерГорничные);
	ОтборСтроки = Новый Структура("НомерГорничные", Строка.НомерГорничные);	
	НайденныеСтроки = ТЗ_НомернойФонд.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		НомерВРезерв = Справочники.НомернойФонд.ПустаяСсылка();
	Иначе
		НомерВРезерв = НайденныеСтроки[0].Ссылка;
	КонецЕсли;
	
	//ГорничныеНомер = Справочники.ГорничныеНомера.НайтиПоРеквизиту("НомерГорничные", Строка.НомерГорничные);
	ОтборСтроки = Новый Структура("НомерГорничные", Строка.НомерГорничные);	
	НайденныеСтроки = ТЗ_ГорничныеНомера.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		ГорничныеНомер = Справочники.ГорничныеНомера.ПустаяСсылка();
	Иначе
		ГорничныеНомер = НайденныеСтроки[0].Ссылка;
	КонецЕсли;

	Если ТЗ.Количество() = 0 Тогда
		ГорничныеОбслуживаниеНомераОбъект = Документы.ГорничныеОбслуживаниеНомера.СоздатьДокумент();
		ГорничныеОбслуживаниеНомераОбъект.Дата = ТекущаяДата();
		ГорничныеОбслуживаниеНомераОбъект.ДатаОбслуживания = Строка.ДатаОбслуживания;
		ГорничныеОбслуживаниеНомераОбъект.НомерОбслуживания_пп = Строка.НомерОбслуживания_пп;

		Если НЕ ЗначениеЗаполнено(НомерВРезерв) Тогда
			Сообщить("Не найден номер в справочнике Номерной фонд. Номер из БД Горничные: " 
				+ ?(ЗначениеЗаполнено(Строка.НомерГорничные), Строка.НомерГорничные, "Пусто") 
				+ ". ДАННЕ НЕ ЗАГРУЖЕНЫ."); 
				
			Продолжить;	
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ГорничныеНомер) Тогда
			Сообщить("Не найден номер в справочнике Горничные номера. Номер из БД Горничные: " 
				+ ?(ЗначениеЗаполнено(Строка.НомерГорничные), Строка.НомерГорничные, "Пусто") 
				+ ". ДАННЕ НЕ ЗАГРУЖЕНЫ."); 
				
			Продолжить;	
		КонецЕсли; 

	Иначе
		ГорничныеОбслуживаниеНомераОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
		
		Если ГорничныеОбслуживаниеНомераОбъект.РучноеИзменение Тогда Продолжить; КонецЕсли;
	КонецЕсли;
	
	Если Строка.ПометкаУдаления Тогда
		Если ЗначениеЗаполнено(ГорничныеОбслуживаниеНомераОбъект.Ссылка) Тогда
			ГорничныеОбслуживаниеНомераОбъект.УстановитьПометкуУдаления(Истина);
		Иначе
			ГорничныеОбслуживаниеНомераОбъект.ПометкаУдаления = Истина;
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(ГорничныеОбслуживаниеНомераОбъект.Ссылка) Тогда
			ГорничныеОбслуживаниеНомераОбъект.УстановитьПометкуУдаления(Ложь);
		Иначе
			ГорничныеОбслуживаниеНомераОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;	
	КонецЕсли;		
	
	ГорничныеОбслуживаниеНомераОбъект.НомерВРезерв = НомерВРезерв;
	ГорничныеОбслуживаниеНомераОбъект.ГорничныеНомер = ГорничныеНомер;
	
	СтрокаGUID = Строка.ЗаявкаНаБронированиеГУИДСтрока;
	Если ЗначениеЗаполнено(СтрокаGUID) Тогда
		НовыйGUID = Новый УникальныйИдентификатор(СтрокаGUID);
		ЗаявкаНаБронирование = Документы.ЗаявкаНаБронирование.ПолучитьСсылку(НовыйGUID);
		ГорничныеОбслуживаниеНомераОбъект.ЗаявкаНаБронирование = ЗаявкаНаБронирование;
	КонецЕсли;	
		
	ГорничныеОбслуживаниеНомераОбъект.ТипУборки = Строка.ТипУборкиНаименование;
	ГорничныеОбслуживаниеНомераОбъект.ТипКомплектации = Строка.ТипКомплектацииНаименование;
	ГорничныеОбслуживаниеНомераОбъект.Температура = Строка.Температура;
	ГорничныеОбслуживаниеНомераОбъект.КоличествоПроживающих = Строка.КоличествоПроживающих;
	ГорничныеОбслуживаниеНомераОбъект.УщербНомеру = Строка.УщербНомеру;
	ГорничныеОбслуживаниеНомераОбъект.ЗабытыеВещи = Строка.ЗабытыеВещи;
	ГорничныеОбслуживаниеНомераОбъект.Комментарий = Строка.Комментарий;
	
	ГорничныеОбслуживаниеНомераОбъект.ТипУборкиПризнак = Строка.ТипУборкиПризнак;
	ГорничныеОбслуживаниеНомераОбъект.ВремяУборки = Строка.ВремяУборки;
	
	ГорничныеОбслуживаниеНомераОбъект.РаздельныеКровати = Строка.РаздельныеКровати;
	ГорничныеОбслуживаниеНомераОбъект.РаздельныеКроватиОбработка = Строка.РаздельныеКроватиОбработка;
	
	ГорничныеОбслуживаниеНомераОбъект.МанипуляцияКровати = Строка.МанипуляцияКровати;
	ГорничныеОбслуживаниеНомераОбъект.МанипуляцияДопМесто_1 = Строка.МанипуляцияДопМесто_1;
	ГорничныеОбслуживаниеНомераОбъект.МанипуляцияДопМесто_2 = Строка.МанипуляцияДопМесто_2;
	
	ГорничныеОбслуживаниеНомераОбъект.ДопМесто_1_ТипДопМеста = Строка.ДопМесто_1_ТипДопМеста;
	ГорничныеОбслуживаниеНомераОбъект.ДопМесто_2_ТипДопМеста = Строка.ДопМесто_2_ТипДопМеста;
	ГорничныеОбслуживаниеНомераОбъект.ДополнительнаяКроватьОбработка = Строка.ДополнительнаяКроватьОбработка;
	ГорничныеОбслуживаниеНомераОбъект.ДетскаяКроватьОбработка = Строка.ДетскаяКроватьОбработка;
	
	ГорничнаяНаименование = Строка.ГорничнаяНаименование;
	Если СокрЛП(ГорничнаяНаименование) = "" Тогда
		Горничная = Неопределено;
	Иначе	
		Горничная = Справочники.Горничные.НайтиПоНаименованию(Строка.ГорничнаяНаименование);
		Если Горничная.Пустая() Тогда
			НовГ=Справочники.Горничные.СоздатьЭлемент();
			НовГ.Наименование=Строка.ГорничнаяНаименование;
			НовГ.Записать();
			Горничная = НовГ.Ссылка;
		КонецЕсли;
	КонецЕсли;
	ГорничныеОбслуживаниеНомераОбъект.Горничная = Горничная;
	
	// + МиниБар
	ГорничныеОбслуживаниеНомераОбъектМинибар = ГорничныеОбслуживаниеНомераОбъект.Минибар;
	ГорничныеОбслуживаниеНомераОбъектМинибар.Очистить();
	
	МинибарДанные = Строка.Минибар;
	Для Каждого СтрокаМиниБар Из МинибарДанные Цикл
		НоваяСтрока = ГорничныеОбслуживаниеНомераОбъектМинибар.Добавить();
		
		НоменклатураМинибараНаименование = СтрокаМиниБар.НоменклатураМинибараНаименование;

		НоменклатураМинибараКод = СтрокаМиниБар.НоменклатураМинибараКод;
		НоменклатураМинибара = Справочники.НоменклатураМиниБара.НайтиПоКоду(НоменклатураМинибараКод, Истина);
		Если ЗначениеЗаполнено(НоменклатураМинибара) Тогда
			НоваяСтрока.НоменклатураМинибара = НоменклатураМинибара;
			
			Цена = НоменклатураМинибара.Цена;
		Иначе
			Сообщить("Не найдена номенклатура бара в справочнике Номенклатура Минибара. Код: " 
				+ НоменклатураМинибараКод + ", Наименование : " + НоменклатураМинибараНаименование); 
			
			Цена = 0;	
		КонецЕсли; 
		
		НоваяСтрока.НоменклатураМинибараКодВыгрузка = НоменклатураМинибараКод; 
		НоваяСтрока.НоменклатураМинибараНаименованиеВыгрузка = НоменклатураМинибараНаименование; 
		НоваяСтрока.Количество = СтрокаМиниБар.Количество; 
		НоваяСтрока.Цена = Цена; 
	КонецЦикла;
	// - МиниБар
	
	ГорничныеОбслуживаниеНомераОбъектТехническиеНеисправности = ГорничныеОбслуживаниеНомераОбъект.ТехническиеНеисправности;
	ГорничныеОбслуживаниеНомераОбъектТехническиеНеисправности.Очистить();
	
	ТехническиеНеисправностиДанные = Строка.ТехническиеНеисправности;
	Для Каждого СтрокаТехническиеНеисправности Из ТехническиеНеисправностиДанные Цикл
		НоваяСтрока = ГорничныеОбслуживаниеНомераОбъектТехническиеНеисправности.Добавить();
		
		НоваяСтрока.ТехническаяНеисправность = СтрокаТехническиеНеисправности.ТехническаяНеисправность;
	КонецЦикла;
	ГорничныеОбслуживаниеНомераОбъект.ТехническиеНеисправностиПримечание = Строка.ТехническиеНеисправностиПримечание;

	// + ДополнительноеОборудование
	ДополнительноеОборудованиеДанные = Строка.ДополнительноеОборудование;
	
	ГорничныеОбслуживаниеНомераОбъектДополнительноеОборудование = ГорничныеОбслуживаниеНомераОбъект.ДополнительноеОборудование;
	ГорничныеОбслуживаниеНомераОбъектДополнительноеОборудование.Очистить();
	Для Каждого СтрокаДополнительноеОборудование Из ДополнительноеОборудованиеДанные Цикл
		НоваяСтрока = ГорничныеОбслуживаниеНомераОбъектДополнительноеОборудование.Добавить();
		
		НоваяСтрока.ДопОборудование = СтрокаДополнительноеОборудование.ДопОборудованиеНаименование;
	КонецЦикла;
	// - ДополнительноеОборудование
	
	Если Строка.ПометкаУдаления Тогда
		ГорничныеОбслуживаниеНомераОбъект.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		ГорничныеОбслуживаниеНомераОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
КонецЦикла;

ЗагрузитьСостояниеНомеров();
КонецПроцедуры

Процедура ЗагрузитьСостояниеНомеров() Экспорт
Соединение = Соединение();
Если Соединение = Неопределено Тогда 
	Сообщить("Нет связи с БД Горничные. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	
	Возврат;
КонецЕсли;

Попытка
	ТЗДанные = Соединение.ОбменГорничныеСервер.ВыгрузитьСостояниеНомеров();
Исключение
	Сообщить("Ошибка загрузки состояние номеров. Описание ошибки: " + ОписаниеОшибки());
	
	Возврат;
КонецПопытки;

Для Каждого Строка Из ТЗДанные Цикл
	ГорничныеНомер = Справочники.ГорничныеНомера.НайтиПоРеквизиту("НомерГорничные", Строка.НомерГорничные);
	Если ЗначениеЗаполнено(ГорничныеНомер) Тогда 
		ГорничныеНомерОбъект = ГорничныеНомер.ПолучитьОбъект();
		
		ГорничныеНомерОбъект.ДатаПредыдущейСменыБелья = Строка.ДатаПредыдущейСменыБелья;
		ГорничныеНомерОбъект.РаздельныеКровати = Строка.РаздельныеКровати;
		
		ГорничныеНомерОбъект.ДопМесто_1_ТипДопМеста = Строка.ДопМесто_1_ТипДопМеста;
		ГорничныеНомерОбъект.ДопМесто_2_ТипДопМеста = Строка.ДопМесто_2_ТипДопМеста;
		
		ГорничныеНомерОбъектТекущееДополнительноеОборудование = ГорничныеНомерОбъект.ТекущееДополнительноеОборудование;
		ГорничныеНомерОбъектТекущееДополнительноеОборудование.Очистить();
		
		ТекущееДополнительноеОборудование = Строка.ТекущееДополнительноеОборудование; 
		Для Каждого СтрокаДополнительноеОборудование Из ТекущееДополнительноеОборудование Цикл
			НоваяСтрока = ГорничныеНомерОбъектТекущееДополнительноеОборудование.Добавить();
			
			НоваяСтрока.ДопОборудование = СтрокаДополнительноеОборудование.ДопОборудованиеНаименование;
		КонецЦикла;
		
		ГорничныеНомерОбъект.Записать();
	КонецЕсли;	
КонецЦикла
КонецПроцедуры

Процедура ЗагрузитьОбслуживаниеПомещений(ДатаОбслуживания_С, ДатаОбслуживания_По) Экспорт
ОбменСГорничными = Константы.ОбменСГорничными.Получить();
Если НЕ ОбменСГорничными Тогда Возврат; КонецЕсли;

Соединение = Соединение();
Если Соединение = Неопределено Тогда 
	Сообщить("Нет связи с БД Горничные. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	
	Возврат;
КонецЕсли;

Попытка
	ТЗДанные = Соединение.ОбменГорничныеСервер.ВыгрузитьОбслуживаниеПомещений(ДатаОбслуживания_С, ДатаОбслуживания_По);
Исключение
	Сообщить("Ошибка загрузки Обслуживание помещений.");
	
	Возврат;
КонецПопытки;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеОбслуживаниеПомещения.Ссылка КАК Ссылка,
                      |	ГорничныеОбслуживаниеПомещения.ДатаОбслуживания КАК ДатаОбслуживания,
                      |	ГорничныеОбслуживаниеПомещения.НомерОбслуживания_пп КАК НомерОбслуживания_пп,
                      |	ГорничныеОбслуживаниеПомещения.Горничная КАК Горничная
                      |ИЗ
                      |	Документ.ГорничныеОбслуживаниеПомещения КАК ГорничныеОбслуживаниеПомещения
                      |ГДЕ
                      |	ГорничныеОбслуживаниеПомещения.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеОбслуживаниеПомещения.ДатаОбслуживания МЕЖДУ &ДатаОбслуживания_С И &ДатаОбслуживания_По");
Запрос.УстановитьПараметр("ДатаОбслуживания_С", ДатаОбслуживания_С);
Запрос.УстановитьПараметр("ДатаОбслуживания_По", ДатаОбслуживания_По);
ТЗ_ГорничныеОбслуживаниеПомещения = Запрос.Выполнить().Выгрузить(); 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Горничные.Ссылка КАК Ссылка,
                      |	Горничные.Наименование КАК Наименование
                      |ИЗ
                      |	Справочник.Горничные КАК Горничные");

ТЗ_Горничные = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗДанные Цикл
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ГорничныеОбслуживаниеПомещения.Ссылка КАК Ссылка
	//                      |ИЗ
	//                      |	Документ.ГорничныеОбслуживаниеПомещения КАК ГорничныеОбслуживаниеПомещения
	//                      |ГДЕ
	//                      |	ГорничныеОбслуживаниеПомещения.ПометкаУдаления = ЛОЖЬ
	//                      |	И ГорничныеОбслуживаниеПомещения.ДатаОбслуживания = &ДатаОбслуживания
	//                      |	И ГорничныеОбслуживаниеПомещения.НомерОбслуживания_пп = &НомерОбслуживания_пп
	//                      |	И ГорничныеОбслуживаниеПомещения.Горничная = &Горничная");
	//
	//Запрос.УстановитьПараметр("ДатаОбслуживания", Строка.ДатаОбслуживания);
	//Запрос.УстановитьПараметр("НомерОбслуживания_пп", Строка.НомерОбслуживания_пп);
	
	ГорничнаяНаименование = Строка.ГорничнаяНаименование;
	Если СокрЛП(ГорничнаяНаименование) = "" Тогда
		Горничная = Неопределено;
	Иначе	
		Горничная = Справочники.Горничные.НайтиПоНаименованию(Строка.ГорничнаяНаименование);
		Если Горничная.Пустая() Тогда
			НовГ=Справочники.Горничные.СоздатьЭлемент();
			НовГ.Наименование=Строка.ГорничнаяНаименование;
			НовГ.Записать();
			Горничная = НовГ.Ссылка;
		КонецЕсли;
	КонецЕсли;
	//Запрос.УстановитьПараметр("Горничная", Горничная);
	//ТЗ = Запрос.Выполнить().Выгрузить();
	
	ОтборСтроки = Новый Структура("ДатаОбслуживания, НомерОбслуживания_пп, Горничная"
		 , Строка.ДатаОбслуживания, Строка.НомерОбслуживания_пп, Горничная);  
	ТЗ = ТЗ_ГорничныеОбслуживаниеПомещения.НайтиСтроки(ОтборСтроки);
	
	//ГорничныеПомещение = Справочники.ГорничныеПомещения.НайтиПоРеквизиту("ПомещениеГорничные", Строка.ПомещениеГорничные);

	Если ТЗ.Количество() = 0 Тогда
		ГорничныеОбслуживаниеПомещенияОбъект = Документы.ГорничныеОбслуживаниеПомещения.СоздатьДокумент();
		//ГорничныеОбслуживаниеПомещенияОбъект.Дата = ТекущаяДата();
		ГорничныеОбслуживаниеПомещенияОбъект.Дата = Строка.Дата;
		ГорничныеОбслуживаниеПомещенияОбъект.ДатаОбслуживания = Строка.ДатаОбслуживания;
		ГорничныеОбслуживаниеПомещенияОбъект.НомерОбслуживания_пп = Строка.НомерОбслуживания_пп;
		
		ГорничныеОбслуживаниеПомещенияОбъект.Горничная = Горничная;

	Иначе
		ГорничныеОбслуживаниеПомещенияОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
		
		Если ГорничныеОбслуживаниеПомещенияОбъект.РучноеИзменение Тогда Продолжить; КонецЕсли;
	КонецЕсли;
	
	Если Строка.ПометкаУдаления Тогда
		Если ЗначениеЗаполнено(ГорничныеОбслуживаниеПомещенияОбъект.Ссылка) Тогда
			ГорничныеОбслуживаниеПомещенияОбъект.УстановитьПометкуУдаления(Истина);
		Иначе
			ГорничныеОбслуживаниеПомещенияОбъект.ПометкаУдаления = Истина;
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(ГорничныеОбслуживаниеПомещенияОбъект.Ссылка) Тогда
			ГорничныеОбслуживаниеПомещенияОбъект.УстановитьПометкуУдаления(Ложь);
		Иначе
			ГорничныеОбслуживаниеПомещенияОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;		
	КонецЕсли;
	
	ПомещенияУборки = Строка.ПомещенияУборки;
	
	ПомещенияУборкиОбъект = ГорничныеОбслуживаниеПомещенияОбъект.ПомещенияУборки;
	ПомещенияУборкиОбъект.Очистить();
	
	Для Каждого СтрокаУборки Из ПомещенияУборки Цикл
		НоваяСтрока = ПомещенияУборкиОбъект.Добавить();
		
		ГорничныеПомещение = Справочники.ГорничныеПомещения.НайтиПоРеквизиту("ПомещениеГорничные", СтрокаУборки.ПомещениеГорничные);
		Если НЕ ЗначениеЗаполнено(ГорничныеПомещение) Тогда
			Сообщить("Не найдено помещение в справочнике Горничные помещения. Номер из БД Горничные: " 
				+ ?(ЗначениеЗаполнено(СтрокаУборки.ПомещениеГорничные), СтрокаУборки.ПомещениеГорничные, "Пусто") 
				+ ". ДАННЫЕ ДОКУМЕНТА НЕ ЗАГРУЖЕНЫ."); 
				
			Продолжить;	
		КонецЕсли; 
		
		НоваяСтрока.ГорничныеПомещение = ГорничныеПомещение;
		
		НоваяСтрока.ВремяУборки = СтрокаУборки.ВремяУборки;
		НоваяСтрока.Обслужено = СтрокаУборки.Обслужено;
		
		//ГорничнаяНаименование = СтрокаУборки.ГорничнаяНаименование;
		//Если СокрЛП(ГорничнаяНаименование) = "" Тогда
		//	Горничная = Неопределено;
		//Иначе	
		//	Горничная = Справочники.Горничные.НайтиПоНаименованию(СтрокаУборки.ГорничнаяНаименование);
		//	Если Горничная.Пустая() Тогда
		//		НовГ=Справочники.Горничные.СоздатьЭлемент();
		//		НовГ.Наименование=СтрокаУборки.ГорничнаяНаименование;
		//		НовГ.Записать();
		//		Горничная = НовГ.Ссылка;
		//	КонецЕсли;
		//КонецЕсли;
		//НоваяСтрока.Горничная = Горничная;
	КонецЦикла;
	
	//ГорничныеОбслуживаниеПомещенияОбъект.ГорничныеПомещение = ГорничныеПомещение;
	//ГорничныеОбслуживаниеПомещенияОбъект.ВремяУборки = Строка.ВремяУборки;
	//ГорничныеОбслуживаниеПомещенияОбъект.Обслужено = Строка.Обслужено;
	//
	//ГорничнаяНаименование = Строка.ГорничнаяНаименование;
	//Если СокрЛП(ГорничнаяНаименование) = "" Тогда
	//	Горничная = Неопределено;
	//Иначе	
	//	Горничная = Справочники.Горничные.НайтиПоНаименованию(Строка.ГорничнаяНаименование);
	//	Если Горничная.Пустая() Тогда
	//		НовГ=Справочники.Горничные.СоздатьЭлемент();
	//		НовГ.Наименование=Строка.ГорничнаяНаименование;
	//		НовГ.Записать();
	//		Горничная = НовГ.Ссылка;
	//	КонецЕсли;
	//КонецЕсли;
	//ГорничныеОбслуживаниеПомещенияОбъект.Горничная = Горничная;
	
	Если Строка.ПометкаУдаления Тогда
		ГорничныеОбслуживаниеПомещенияОбъект.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		ГорничныеОбслуживаниеПомещенияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьСмены(ДатаОбслуживания_С, ДатаОбслуживания_По) Экспорт
ОбменСГорничными = Константы.ОбменСГорничными.Получить();
Если НЕ ОбменСГорничными Тогда Возврат; КонецЕсли;

Соединение = Соединение();
Если Соединение = Неопределено Тогда 
	Сообщить("Нет связи с БД Горничные. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	
	Возврат;
КонецЕсли;

Попытка
	ТЗДанные = Соединение.ОбменГорничныеСервер.ВыгрузитьСмены(ДатаОбслуживания_С, ДатаОбслуживания_По);
Исключение
	Сообщить("Ошибка загрузки смен. " + ОписаниеОшибки());
	
	Возврат;
КонецПопытки;
	
Для Каждого Строка Из ТЗДанные Цикл
	
	ГорничнаяНаименование = Строка.ГорничнаяНаименование;
	Если СокрЛП(ГорничнаяНаименование) = "" Тогда
		Горничная = Неопределено;
	Иначе	
		Горничная = Справочники.Горничные.НайтиПоНаименованию(Строка.ГорничнаяНаименование);
		Если Горничная.Пустая() Тогда
			НовГ=Справочники.Горничные.СоздатьЭлемент();
			НовГ.Наименование=Строка.ГорничнаяНаименование;
			НовГ.Записать();
			Горничная = НовГ.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ГорничныеСмены.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ГорничныеСмены КАК ГорничныеСмены
	                      |ГДЕ
	                      |	ГорничныеСмены.ПометкаУдаления = ЛОЖЬ
	                      |	И ГорничныеСмены.ДатаСмены = &ДатаСмены
	                      |	И ГорничныеСмены.Горничная = &Горничная");
	
	//Запрос.УстановитьПараметр("ГУИД", Строка.ГУИД);
	Запрос.УстановитьПараметр("ДатаСмены", Строка.ДатаСмены);
	Запрос.УстановитьПараметр("Горничная", Горничная);
	
	ТЗ = Запрос.Выполнить().Выгрузить();

	Если ТЗ.Количество() = 0 Тогда
		ГорничныеСменыОбъект = Документы.ГорничныеСмены.СоздатьДокумент();
		ГорничныеСменыОбъект.Дата = ТекущаяДата();
	Иначе
		ГорничныеСменыОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если Строка.ПометкаУдаления Тогда
		Если ЗначениеЗаполнено(ГорничныеСменыОбъект.Ссылка) Тогда
			ГорничныеСменыОбъект.УстановитьПометкуУдаления(Истина);
		Иначе
			ГорничныеСменыОбъект.ПометкаУдаления = Истина;
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(ГорничныеСменыОбъект.Ссылка) Тогда
			ГорничныеСменыОбъект.УстановитьПометкуУдаления(Ложь);
		Иначе
			ГорничныеСменыОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	ГорничныеСменыОбъект.ГУИД = Новый УникальныйИдентификатор(Строка.ГУИДСтрока);
	ГорничныеСменыОбъект.ДатаСмены = Строка.ДатаСмены;
	
	Если ЗначениеЗаполнено(Строка.ВремяОткрытияСмены) Тогда
		ГорничныеСменыОбъект.ВремяОткрытияСмены = Строка.ВремяОткрытияСмены;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.ВремяЗакрытияСмены) Тогда
		ГорничныеСменыОбъект.ВремяЗакрытияСмены = Строка.ВремяЗакрытияСмены;
	КонецЕсли;
	
	//ГорничнаяНаименование = Строка.ГорничнаяНаименование;
	//Если СокрЛП(ГорничнаяНаименование) = "" Тогда
	//	Горничная = Неопределено;
	//Иначе	
	//	Горничная = Справочники.Горничные.НайтиПоНаименованию(Строка.ГорничнаяНаименование);
	//	Если Горничная.Пустая() Тогда
	//		НовГ=Справочники.Горничные.СоздатьЭлемент();
	//		НовГ.Наименование=Строка.ГорничнаяНаименование;
	//		НовГ.Записать();
	//		Горничная = НовГ.Ссылка;
	//	КонецЕсли;
	//КонецЕсли;
	ГорничныеСменыОбъект.Горничная = Горничная;
	
	Если Строка.ПометкаУдаления Тогда
		ГорничныеСменыОбъект.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		ГорничныеСменыОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
КонецЦикла;
КонецПроцедуры
//

//
Функция ОбновитьГорничнаяГорничные(Горничная) Экспорт
ОбменСГорничными = Константы.ОбменСГорничными.Получить();
Если НЕ ОбменСГорничными Тогда Возврат Ложь; КонецЕсли;    

Соединение = Соединение();
Если Соединение = Неопределено Тогда 
	Сообщить("Нет связи с БД Горничные. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	
	Возврат Истина;
КонецЕсли;

ГорничнаяДанные = Новый Структура("Наименование, Сортировка, НеРаботает, ПометкаУдаления, ГорничнаяГУИДСтрока");
ГорничнаяДанные.Наименование = Горничная.Наименование;
ГорничнаяДанные.Сортировка = Горничная.Сортировка;
ГорничнаяДанные.НеРаботает = Горничная.НеРаботает;

ГорничнаяДанные.ГорничнаяГУИДСтрока = Горничная.ГорничнаяГУИДСтрока;
ГорничнаяДанные.ПометкаУдаления = Горничная.ПометкаУдаления;

Попытка
	Соединение.ОбменГорничныеСервер.ОбновитьГорничнаяГорничные(ГорничнаяДанные);
	
	Возврат Ложь;
Исключение
	Сообщить("Ошибка выгрузки Горничная. " + ОписаниеОшибки());
	
	Возврат Истина;
КонецПопытки;
	
КонецФункции

//


//
Процедура ПроверкаСоединения() Экспорт

КонецПроцедуры

Процедура ОбновитьГорничныеОтель(ГорничныеДанные) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Горничные.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.Горничные КАК Горничные
                      |ГДЕ
                      |	Горничные.ГорничнаяГУИДСтрока = &ГорничнаяГУИДСтрока");

Запрос.УстановитьПараметр("ГорничнаяГУИДСтрока", ГорничныеДанные.ГорничнаяГУИДСтрока);
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	ГорничныеОбъект = Справочники.Горничные.СоздатьЭлемент();
	ГорничныеОбъект.УстановитьНовыйКод();
	
	ГорничныеОбъект.ГорничнаяГУИДСтрока = ГорничныеДанные.ГорничнаяГУИДСтрока;
Иначе	
	ГорничныеОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
КонецЕсли;

ГорничныеОбъект.Наименование = ГорничныеДанные.Наименование;
ГорничныеОбъект.НеРаботает = ГорничныеДанные.НеРаботает;
ГорничныеОбъект.Сортировка = ГорничныеДанные.Сортировка;
ГорничныеОбъект.ПометкаУдаления = ГорничныеДанные.ПометкаУдаления;

//ГорничныеОбъект.УчетУборок = Истина;

ГорничныеОбъект.ОбменДанными.Загрузка = Истина;
ГорничныеОбъект.Записать();
КонецПроцедуры

Процедура ОбновитьНоменклатураМиниБараОтель(НоменклатураМиниБараДанные) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	НоменклатураМинибара.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.НоменклатураМинибара КАК НоменклатураМинибара
                      |ГДЕ
                      |	НоменклатураМинибара.Код = &Код");

Запрос.УстановитьПараметр("Код", НоменклатураМиниБараДанные.Код);
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	НоменклатураМиниБараОбъект = Справочники.НоменклатураМиниБара.СоздатьЭлемент();
	НоменклатураМиниБараОбъект.Код = НоменклатураМиниБараДанные.Код;
Иначе	
	НоменклатураМиниБараОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();   
КонецЕсли;
	
НоменклатураМиниБараОбъект.Наименование = НоменклатураМиниБараДанные.Наименование;
НоменклатураМиниБараОбъект.ПометкаУдаления = НоменклатураМиниБараДанные.ПометкаУдаления;
НоменклатураМиниБараОбъект.НеИспользуется = НоменклатураМиниБараДанные.НеИспользуется;
//НоменклатураМиниБараОбъект.Сортировка = НоменклатураМиниБараДанные.Сортировка;

НоменклатураМиниБараОбъект.ОбменДанными.Загрузка = Истина;
НоменклатураМиниБараОбъект.Записать();
КонецПроцедуры

Процедура ОбновитьКомплектацияОтель(КомплектацияДанные) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ТипыКомплектаций.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.ТипыКомплектаций КАК ТипыКомплектаций
                      |ГДЕ
                      |	ТипыКомплектаций.Код = &Код");

Запрос.УстановитьПараметр("Код", КомплектацияДанные.Код);
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	ТипыКомплектацийОбъект = Справочники.ТипыКомплектаций.СоздатьЭлемент();
Иначе	
	ТипыКомплектацийОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
КонецЕсли;
	
ТипыКомплектацийОбъект.Код = КомплектацияДанные.Код;              
ТипыКомплектацийОбъект.Наименование = КомплектацияДанные.Наименование;
ТипыКомплектацийОбъект.ПометкаУдаления = КомплектацияДанные.ПометкаУдаления;
ТипыКомплектацийОбъект.НеИспользуется = КомплектацияДанные.НеИспользуется;
ТипыКомплектацийОбъект.Сортировка = КомплектацияДанные.Сортировка;

ТипыКомплектацийОбъект.ОбменДанными.Загрузка = Истина;
ТипыКомплектацийОбъект.Записать();
КонецПроцедуры

Процедура ОбновитьГорничныеПомещенияОтель(ПомещениеДанные) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеПомещения.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.ГорничныеПомещения КАК ГорничныеПомещения
                      |ГДЕ
                      |	ГорничныеПомещения.ПомещениеГорничные = &ПомещениеГорничные");

Запрос.УстановитьПараметр("ПомещениеГорничные", ПомещениеДанные.ПомещениеГорничные);
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	ГорничныеПомещенияОбъект = Справочники.ГорничныеПомещения.СоздатьЭлемент();
Иначе	
	ГорничныеПомещенияОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
КонецЕсли;

ГорничныеПомещенияОбъект.ПомещениеГорничные = ПомещениеДанные.ПомещениеГорничные;
ГорничныеПомещенияОбъект.Наименование = ПомещениеДанные.Наименование;
ГорничныеПомещенияОбъект.ПометкаУдаления = ПомещениеДанные.ПометкаУдаления;
ГорничныеПомещенияОбъект.Сортировка = ПомещениеДанные.Сортировка;

ГорничныеПомещенияОбъект.ОбменДанными.Загрузка = Истина;
ГорничныеПомещенияОбъект.Записать();
КонецПроцедуры
//

///// ++++++++++++++++++++++++ 
