
Функция СформироватьОтчетНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();
ПолеОтчета = Новый ТабличныйДокумент; 

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингУслуги.Ссылка КАК Папка,
                      |	КоворкингУслуги.НомерПП КАК НомерПП,
                      |	КоворкингУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты
                      |ИЗ
                      |	Справочник.КоворкингУслуги КАК КоворкингУслуги
                      |ГДЕ
                      |	КоворкингУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингУслуги.ЭтоГруппа = ИСТИНА
                      |	И КоворкингУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.КоворкингУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.КоворкингУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;

Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Папка) Тогда		
		Если ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			ЗаголовокОтчета = Строка.ЗаголовокОтчеты;
		Иначе
			ЗаголовокОтчета = Строка.Папка;
		КонецЕсли;
		
		Область.Параметры.ШапкаДопУслуги = ЗаголовокОтчета;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область, 0);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

ПолеОтчета.ФиксацияСверху = 1;

ПолеОтчета.НачатьАвтогруппировкуСтрок();

Итоги = Новый Структура();
Итоги.Вставить("Количество", 0);
//Итоги.Вставить("Цена", 0);
Итоги.Вставить("Сумма", 0);
Итоги.Вставить("СуммаЧистая", 0);
Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаЭквайринга", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);

ИтогиДень = Новый Структура();
ИтогиДень.Вставить("Количество", 0);
//ИтогиДень.Вставить("Цена", 0);
ИтогиДень.Вставить("Сумма", 0);
ИтогиДень.Вставить("СуммаЧистая", 0);
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК НомерКоворкинг,
                      |	КоворкингСчета.Ссылка КАК Счет,
                      |	ВЫБОР
                      |		КОГДА КоворкингСчета.ОплачиваетСчет = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |			ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
                      |		ИНАЧЕ КоворкингСчета.ОплачиваетСчет
                      |	КОНЕЦ КАК Оплачивает,
                      |	КоворкингСчета.Сумма КАК Сумма,
                      |	КоворкингСчета.Цена КАК Цена,
                      |	КоворкингСчета.Сумма КАК СуммаСчета,
                      |	КоворкингСчета.Количество КАК Количество,
                      |	КоворкингСчета.КоличествоЕдиниц КАК КоличествоЕдиниц,
                      |	КоворкингСчета.КоворкингЗаявка.ПериодАренды КАК ПериодАренды,
                      |	КоворкингСчета.ДатаС КАК ДатаС,
                      |	КоворкингСчета.ДатаПо КАК ДатаПо
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоворкингСчета КАК КоворкингСчета
                      |		ПО КоворкингНомера.Ссылка = КоворкингСчета.КоворкингЗаявка.КоворкингНомер
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингСчета.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингСчета.Проведен = ИСТИНА
                      |	И НЕ (КоворкингСчета.ДатаС > &ДатаПо
                      |	ИЛИ КоворкингСчета.ДатаПо < &ДатаC)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоворкингНомера.Наименование");

Запрос.УстановитьПараметр("ДатаC", ДатаОтчетаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаОтчетаПо);
ТЗ_ВсеСчета = Запрос.Выполнить().Выгрузить();

Счета = Новый СписокЗначений;
Для Каждого Строка Из ТЗ_ВсеСчета Цикл
	Счета.Добавить(Строка.Счет);					
КонецЦикла;

Если ТЗ_ВсеСчета.Количество() = 0 Тогда Возврат ПолеОтчета; КонецЕсли; 
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка КАК Счет,
                      |	КоворкингСчетаДопУслугиКоворкинг.НомерСтроки КАК НомерСтроки,
                      |	КоворкингСчетаДопУслугиКоворкинг.ГУИД КАК ГУИД,
                      |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
                      |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК Услуга,
                      |	КоворкингСчетаДопУслугиКоворкинг.Цена КАК Цена,
                      |	КоворкингСчетаДопУслугиКоворкинг.Количество КАК Количество,
                      |	КоворкингСчетаДопУслугиКоворкинг.Сумма КАК Сумма,
                      |	КоворкингСчетаДопУслугиКоворкинг.СуммаОплачено КАК СуммаОплачено,
                      |	КоворкингСчетаДопУслугиКоворкинг.Примечание КАК Примечание
                      |ИЗ
                      |	Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                      |ГДЕ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка В (&Счета)");

Запрос.УстановитьПараметр("Счета", Счета);
ТЗ_ВсеУслуги = Запрос.Выполнить().Выгрузить();
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	РаспределениеОплатКоворкинг.Ссылка КАК Счет,
                      |	РаспределениеОплатКоворкинг.ДокументОплаты КАК ДокументОплаты,
                      |	РаспределениеОплатКоворкинг.ЭтоУслуга КАК ЭтоУслуга,
                      |	РаспределениеОплатКоворкинг.ГУИДДолги КАК ГУИДДолги,
                      |	РаспределениеОплатКоворкинг.СуммаОплаты КАК СуммаОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.Сумма
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументОплатыКасса,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ВЫБОР
                      |					КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Взаимозачет)
                      |						ТОГДА 9
                      |					КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                      |						ТОГДА 10
                      |					КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)
                      |						ТОГДА 11
                      |					КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                      |						ТОГДА 12
                      |					ИНАЧЕ 10
                      |				КОНЕЦ
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |					ТОГДА ВЫБОР
                      |							КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |								ТОГДА 8
                      |							КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |								ТОГДА ВЫБОР
                      |										КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |											ТОГДА 5
                      |										ИНАЧЕ 4
                      |									КОНЕЦ
                      |							ИНАЧЕ 3
                      |						КОНЕЦ
                      |				ИНАЧЕ ВЫБОР
                      |						КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |							ТОГДА 8
                      |						КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные = 0
                      |								И РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта > 0
                      |							ТОГДА 1
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные > 0
                      |										И РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта = 0
                      |									ТОГДА 2
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК ЭтоЭквайринг,
                      |	РаспределениеОплатКоворкинг.ДокументОплаты.Сумма КАК СуммаДокументаОплаты,
                      |	РаспределениеОплатКоворкинг.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
                      |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги
                      |ИЗ
                      |	Документ.КоворкингСчета.РаспределениеОплатКоворкинг КАК РаспределениеОплатКоворкинг
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                      |		ПО РаспределениеОплатКоворкинг.Ссылка = КоворкингСчетаДопУслугиКоворкинг.Ссылка
                      |			И РаспределениеОплатКоворкинг.ГУИДДолги = КоворкингСчетаДопУслугиКоворкинг.ГУИД
                      |ГДЕ
                      |	РаспределениеОплатКоворкинг.Ссылка В(&Счета)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДокументОплатыДатаОплаты,
                      |	ДокументОплаты");


Запрос.УстановитьПараметр("Счета", Счета);
ТЗ_ВсеОплаты = Запрос.Выполнить().Выгрузить();	

ТЗ_ВсеОплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_ВсеОплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_ВсеОплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;

ТЗ_ВсяАренда = Новый ТаблицаЗначений;
ТЗ_ВсяАренда.Колонки.Добавить("Счет");
ТЗ_ВсяАренда.Колонки.Добавить("ДатаАренды");
ТЗ_ВсяАренда.Колонки.Добавить("СуммаАренды");

Для Индекс = 0 По ТЗ_ВсеСчета.Количество() - 1 Цикл
	СтрокаСчет = ТЗ_ВсеСчета[Индекс];
	
	ОстатокСуммаСчета = СтрокаСчет.СуммаСчета;
	
	Если СтрокаСчет.КоличествоЕдиниц = 0 Тогда
		СуммаЗаДень = 0;	
	Иначе
		СуммаЗаДень = Окр(СтрокаСчет.СуммаСчета / СтрокаСчет.КоличествоЕдиниц, 2); 
	КонецЕсли;
	
	Дата_П = СтрокаСчет.ДатаС;
	ДатаПо = СтрокаСчет.ДатаПо;
	Пока Дата_П <= ДатаПо Цикл
		НоваяСтрока = ТЗ_ВсяАренда.Добавить();
		НоваяСтрока.Счет = СтрокаСчет.Счет;
		НоваяСтрока.ДатаАренды = Дата_П;
		
		Если Дата_П = ДатаПо Тогда
			НоваяСтрока.СуммаАренды = ОстатокСуммаСчета;
		Иначе
			НоваяСтрока.СуммаАренды = СуммаЗаДень;
			ОстатокСуммаСчета = ОстатокСуммаСчета - СуммаЗаДень; 				
		КонецЕсли;
		
		Дата_П = Дата_П + 24 * 60 *60;
	КонецЦикла;		
КонецЦикла;

ТЗ_ВсеОплатыАренда = ТЗ_ВсеОплаты.СкопироватьКолонки();
ТЗ_ВсеОплатыАренда.Колонки.Добавить("ДатаАренды");

Для Каждого СтрокаСчет Из ТЗ_ВсеСчета Цикл
	ОтборСтроки = Новый Структура("Счет, ЭтоУслуга", СтрокаСчет.Счет, Ложь);
	ОплатыСчет = ТЗ_ВсеОплаты.НайтиСтроки(ОтборСтроки);

	ОтборСтроки = Новый Структура("Счет", СтрокаСчет.Счет);
	АрендаСчет = ТЗ_ВсяАренда.НайтиСтроки(ОтборСтроки);
	
	ОплатыСчет_П = ТЗ_ВсеОплаты.Скопировать(ОтборСтроки);
	Для Каждого СтрокаАрендаСчет Из АрендаСчет Цикл
		ОстатокСуммаАренды = СтрокаАрендаСчет.СуммаАренды;
		
		Для Каждого СтрокаОплата Из ОплатыСчет_П Цикл
			ОстатокСуммаОплаты = СтрокаОплата.СуммаОплаты;

			// + Аудит
			Если ОстатокСуммаОплаты = 0 Тогда Продолжить; КонецЕсли;
			// - Аудит

			НоваяСтрока = ТЗ_ВсеОплатыАренда.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплата); 
			
			НоваяСтрока.ДатаАренды = СтрокаАрендаСчет.ДатаАренды;
			
			Если ОстатокСуммаОплаты >= ОстатокСуммаАренды Тогда 
				НоваяСтрока.СуммаОплаты = ОстатокСуммаАренды;
				
				ОстатокСуммаОплаты = ОстатокСуммаОплаты - ОстатокСуммаАренды;
				ОстатокСуммаАренды = 0;

				// + Аудит
				СтрокаОплата.СуммаОплаты = ОстатокСуммаОплаты;
				// - Аудит

				Прервать;
			Иначе
				НоваяСтрока.СуммаОплаты = ОстатокСуммаОплаты;
				
				ОстатокСуммаАренды = ОстатокСуммаАренды - ОстатокСуммаОплаты;   
				
				ОстатокСуммаОплаты = 0;

				// + Аудит
				СтрокаОплата.СуммаОплаты = ОстатокСуммаОплаты;
				// - Аудит
				
				//Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецЦикла;

Дата_П = ДатаОтчетаС;
Пока Дата_П <= ДатаОтчетаПо Цикл
	ТЗ_Счета = ТЗ_ВсеСчета.СкопироватьКолонки();
	Для Каждого Строка Из ТЗ_ВсеСчета Цикл
		Если Строка.ДатаС > Дата_П ИЛИ Строка.ДатаПо < Дата_П Тогда Продолжить; КонецЕсли;
		
		НоваяСтрока = ТЗ_Счета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Если ТЗ_Счета.Количество() = 0 Тогда Перейти ~ПРОДОЛЖИТЬ_ДатаОтчетаПо; КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ЗаголовокСтрока");
	Дата = Формат(Дата_П, "ДФ='дд.МММ гг'" );  
	Область.Параметры.Дата = Дата;	
	ПолеОтчета.Вывести(Область, 0);
	
	ИтогиДень.Количество = 0;
	//ИтогиДень.Вставить("Цена", 0);
	ИтогиДень.Сумма =  0;
	ИтогиДень.СуммаЧистая = 0;
	ИтогиДень.СуммаОплаты = 0;
	ИтогиДень.СуммаЭквайринга = 0;
	
	УслугиДеньИтоги = ИтогиДень.УслугиДеньИтоги;
	Для Каждого Строка Из ИтогиДень.УслугиДеньИтоги Цикл
		Строка.СуммаУслуги = 0;	
	КонецЦикла;

	Для Каждого СтрокаСчет Из ТЗ_Счета Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаСчет.Счет) Тогда Продолжить; КонецЕсли;
		
		ОтборСтроки = Новый Структура("Счет, ДатаУслуги", СтрокаСчет.Счет, Дата_П);
		НайденныеСтроки = ТЗ_ВсеУслуги.НайтиСтроки(ОтборСтроки);
		ТЗ_УслугиСчет = ТЗ_ВсеУслуги.СкопироватьКолонки();
		Для Каждого Строка Из НайденныеСтроки Цикл
			НоваяСтрока = ТЗ_УслугиСчет.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
		КонецЦикла;
		
		ОтборСтроки = Новый Структура("Счет", СтрокаСчет.Счет);
		НайденныеСтроки = ТЗ_ВсеОплаты.НайтиСтроки(ОтборСтроки);
		ТЗ_ОплатыСчет = ТЗ_ВсеОплаты.СкопироватьКолонки();
		Для Каждого Строка Из НайденныеСтроки Цикл
			НоваяСтрока = ТЗ_ОплатыСчет.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
		КонецЦикла;
		
		ОтборСтроки = Новый Структура("Счет, ДатаАренды", СтрокаСчет.Счет, Дата_П);
		ТЗ_ОплатыАрендаСчетДата = ТЗ_ВсеОплатыАренда.НайтиСтроки(ОтборСтроки);                  
		
		Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");

		Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
		Область.Параметры.Дата = Дата;		

		Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
		Область.Параметры.Месяц = Месяц;		

		ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
		Область.Параметры.ДеньНедели = ДеньНедели;
			
		НомерНаименование = СтрокаСчет.НомерКоворкинг.Наименование;
		Область.Параметры.Номер = НомерНаименование;
		Область.Параметры.РасшифровкаНомер = СтрокаСчет.Счет;

		//Если СтрокаСчет.СуммаСчета = 0 Тогда Перейти ~УСЛУГИ; КонецЕсли;
		
		Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
		Область.Параметры.РасшифровкаСчет = СтрокаСчет.Счет;
		
		Если КлиентыСервер.ЭтоЮрЛицо(СтрокаСчет.Счет.КоворкингЗаявка.Клиент) Тогда
			//Область.Параметры.Клиент = СтрокаСчет.Счет.КоворкингЗаявка.Клиент;
			Область.Параметры.Клиент = СтрокаСчет.Счет.КоворкингЗаявка.Клиент.НаименованиеЮрЛица;
			Область.Параметры.КлиентИНН = СтрокаСчет.Счет.КоворкингЗаявка.Клиент.ИНН;
		КонецЕсли;	
			
		Область.Параметры.ДатаСчета = СтрокаСчет.Счет.Дата;
		Область.Параметры.НомерСчета = СтрокаСчет.Счет.Номер;
		Область.Параметры.ДатаС = Формат(СтрокаСчет.Счет.ДатаС, "ДФ=dd.MM.yy");
		Область.Параметры.ДатаПо = Формат(СтрокаСчет.Счет.ДатаПо, "ДФ=dd.MM.yy");
		
		Область.Параметры.ПериодАренды = СтрокаСчет.ПериодАренды;
		
		Цена = СтрокаСчет.Цена;
		Если Цена <> 0 Тогда Область.Параметры.Цена = Цена; КонецЕсли;
		
		СуммаСчета = СтрокаСчет.СуммаСчета;
		Если СуммаСчета <> 0 Тогда Область.Параметры.СуммаСчета = СуммаСчета; КонецЕсли;

		Если СтрокаСчет.ПериодАренды = "ЧАС" Тогда 
			Количество = СтрокаСчет.Количество;
		Иначе
			Количество = 1;
		КонецЕсли;      
		Область.Параметры.Количество = Количество;

		Область.Параметры.КоличествоЕдиниц = СтрокаСчет.КоличествоЕдиниц;      

		Если СтрокаСчет.ПериодАренды = "ЧАС" Тогда 
			СуммаЗаДень = СуммаСчета;
		Иначе
			ОтборСтроки = Новый Структура("Счет, ДатаАренды", Строкасчет.Счет, Дата_П);	
			НайденныеСтроки = ТЗ_ВсяАренда.НайтиСтроки(ОтборСтроки);
			
			СуммаЗаДень = НайденныеСтроки[0].СуммаАренды;
		КонецЕсли;      
		Если СуммаЗаДень <> 0 Тогда Область.Параметры.Сумма = СуммаЗаДень; КонецЕсли;
		
		ТЗ_ДокументыОплаты = Новый ТаблицаЗначений;
		ТЗ_ДокументыОплаты.Колонки.Добавить("ДокументОплаты");
		
		СуммаОплаты = 0;
		СуммаЭквайринга = 0;
		
		Для Каждого СтрокаОплаты Из ТЗ_ОплатыАрендаСчетДата Цикл             
			СуммаОплаты = СуммаОплаты + Окр(СтрокаОплаты.СуммаОплаты, 2);		
			СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты) ;					
			
			НоваяСтрокаДокументыОплаты = ТЗ_ДокументыОплаты.Добавить();
			НоваяСтрокаДокументыОплаты.ДокументОплаты = СтрокаОплаты.ДокументОплаты;
		КонецЦикла;

		Для Каждого СтрокаОплаты Из ТЗ_ОплатыСчет Цикл
			Если СтрокаОплаты.ЭтоУслуга Тогда   
				ВСписке = ОбщийФункционалСервер.ВСписке(СтрокаОплаты.ГУИДДолги, "ГУИД", ТЗ_УслугиСчет);
				Если ВСписке Тогда   
					СуммаОплаты = СуммаОплаты + Окр(СтрокаОплаты.СуммаОплаты, 2);	
					СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
					
					НоваяСтрокаДокументыОплаты = ТЗ_ДокументыОплаты.Добавить();
					НоваяСтрокаДокументыОплаты.ДокументОплаты = СтрокаОплаты.ДокументОплаты;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ТЗ_ДокументыОплаты.Свернуть("ДокументОплаты");

		Если СуммаОплаты <> 0 Тогда Область.Параметры.СуммаОплаты = СуммаОплаты; КонецЕсли;
		Если СуммаЭквайринга <> 0 Тогда Область.Параметры.СуммаЭквайринга = СуммаЭквайринга; КонецЕсли;
		
		Если ТЗ_ДокументыОплаты.Количество() = 1 Тогда
			// + ПСН
			//СтрокаДокументыОплаты = ТЗ_ДокументыОплаты[0];
			ОтборСтроки = Новый Структура("ДокументОплаты", ТЗ_ДокументыОплаты[0].ДокументОплаты);
			НайденныеСтроки = ТЗ_ОплатыСчет.НайтиСтроки(ОтборСтроки);
			СтрокаОплаты = НайденныеСтроки[0]; 
			// - ПСН
			
			Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
			Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
			Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
			
			Область.Параметры.Оплатил = ОплатилНаименование(СтрокаОплаты);
		КонецЕсли;
		
//~УСЛУГИ:
		ТЗ_УслугиИтого = ТЗ_УслугиСчет.СкопироватьКолонки();
		ТЗ_УслугиИтого.Колонки.Добавить("УслугаРодитель");
		
		ОтборСтроки = Новый Структура("ДатаУслуги", Дата_П);
		НайденныеСтроки = ТЗ_УслугиСчет.НайтиСтроки(ОтборСтроки);
		//Для Каждого Строка Из ТЗ_Услуги Цикл
		Для Каждого Строка Из НайденныеСтроки Цикл
			НоваяСтрока = ТЗ_УслугиИтого.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
			
			Результат = Справочники.КоворкингУслуги.ПустаяСсылка();
			Ссылка = НоваяСтрока.Услуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
			
			НоваяСтрока.УслугаРодитель = Результат;	
		КонецЦикла;	
		ТЗ_УслугиИтого.Свернуть("ДатаУслуги, УслугаРодитель", "Сумма");
		
		СуммаЧистая = СуммаЗаДень  + ТЗ_УслугиИтого.Итог("Сумма") - СуммаЭквайринга;
		//Область.Параметры.СуммаЧистая = СуммаЧистая;
		Если СуммаЧистая <> 0 Тогда Область.Параметры.СуммаЧистая = СуммаЧистая; КонецЕсли;
		
		ОбластьВывода = ПолеОтчета.Вывести(Область, 1);		
		
		Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
			ЕстьСтрока = Ложь;
			Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
				Если СтрокаУслугиИтого.УслугаРодитель = СтрокаРодительУслуги.Папка Тогда 
					ЕстьСтрока = Истина; 
					Прервать; 
				КонецЕсли;
			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("Строка|КолонкаУслуги");
			Если ЕстьСтрока Тогда
				Если СтрокаУслугиИтого.Сумма <> 0 Тогда
					Область.Параметры.СуммаУслуги = СтрокаУслугиИтого.Сумма;
				КонецЕсли;	
			КонецЕсли;
			
			ОбластьВывода = ПолеОтчета.Присоединить(Область, 1);
		КонецЦикла;
		
		ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
		
		СуммаИтого_П = СуммаЗаДень  + ТЗ_УслугиИтого.Итог("Сумма");
		
		Если СуммаИтого_П <> СуммаОплаты Тогда 
			ШрифтСтроки = Новый Шрифт("Arial", 8, ,Истина);
			ВыведеннаяОбласть.Шрифт = ШрифтСтроки;
			
			ВыведеннаяОбласть.ЦветТекста = Новый Цвет(255, 0, 0);
			//Для Индекс = 0 По КоличествоКолонок - 1 Цикл 
			//	ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).Шрифт 
			//	 //= Новый Шрифт(ОбластьОформления.Шрифт, ОбластьОформления.Шрифт.Размер, ,Истина);
			//	 	= Новый Шрифт("Arial", 8, ,Истина);
			//	ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).ЦветТекста = Новый Цвет(255, 0, 0);
			//КонецЦикла;	
		КонецЕсли;

// ОПЛАТЫ
		Если ТЗ_ДокументыОплаты.Количество() > 1 Тогда
		
			Для Каждого СтрокаОплаты Из ТЗ_ОплатыАрендаСчетДата Цикл
				Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
				
				Область.Параметры.Дата = ".";
				Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
				
				Область.Параметры.ДатаСчета = СтрокаСчет.Счет.Дата;
				Область.Параметры.НомерСчета = СтрокаСчет.Счет.Номер;
				Область.Параметры.ДатаС = Формат(СтрокаСчет.Счет.ДатаС, "ДФ=dd.MM.yy");
				Область.Параметры.ДатаПо = Формат(СтрокаСчет.Счет.ДатаПо, "ДФ=dd.MM.yy");

				Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
				Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
				Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
				
				Область.Параметры.Оплатил = ОплатилНаименование(СтрокаОплаты);
				
				СуммаОплатыСтрокаОплаты  = Окр(СтрокаОплаты.СуммаОплаты, 2);
				Область.Параметры.СуммаОплаты = СуммаОплатыСтрокаОплаты;
				
				Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
				
				ПолеОтчета.Вывести(Область, 1);
			КонецЦикла;

			ОтборСтроки = Новый Структура("ДатаУслуги", Дата_П);
			НайденныеСтроки =  ТЗ_ОплатыСчет.НайтиСтроки(ОтборСтроки);
			//Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
			Для Каждого СтрокаОплаты Из НайденныеСтроки Цикл
				Если НЕ СтрокаОплаты.ЭтоУслуга Тогда Продолжить; КонецЕсли;
				
				Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
				Область.Параметры.Дата = ".";
				
				Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
				
				Область.Параметры.ДатаСчета = СтрокаСчет.Счет.Дата;
				Область.Параметры.НомерСчета = СтрокаСчет.Счет.Номер;
				Область.Параметры.ДатаС = Формат(СтрокаСчет.Счет.ДатаС, "ДФ=dd.MM.yy");
				Область.Параметры.ДатаПо = Формат(СтрокаСчет.Счет.ДатаПо, "ДФ=dd.MM.yy");
				
				Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
				Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
				Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
				
				СуммаОплатыСтрокаОплаты  = Окр(СтрокаОплаты.СуммаОплаты, 2);
				Область.Параметры.СуммаОплаты = СуммаОплатыСтрокаОплаты;
				
				Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
		
				ПолеОтчета.Вывести(Область, 1);
				
				Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
					ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ГУИДДолги);
					НайденныеСтроки = ТЗ_УслугиСчет.НайтиСтроки(ОтборСтроки);
					
					ЕстьСтрока = Ложь;
					Для Каждого Строка Из НайденныеСтроки Цикл
						Результат = Справочники.КоворкингУслуги.ПустаяСсылка();
						Ссылка = Строка.Услуга; 
						ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
						
						//Если Строка.УслугаРодитель = СтрокаРодительУслуги.Родитель Тогда
						Если Результат = СтрокаРодительУслуги.Папка Тогда
							ЕстьСтрока = Истина;
							
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
					Если ЕстьСтрока Тогда
						ОбластьУслуги.Параметры.СуммаУслуги = СуммаОплатыСтрокаОплаты;
					КонецЕсли;
					
					ПолеОтчета.Присоединить(ОбластьУслуги, 1);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		//ИтогиДень.Количество = ИтогиДень.Количество + ;
		//ИтогиДень.Вставить("Цена", 0);
		ИтогиДень.Сумма =  ИтогиДень.Сумма + СуммаЗаДень;
		ИтогиДень.СуммаЧистая = ИтогиДень.СуммаЧистая + СуммаЧистая;
		ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
		ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;
		
		Для Каждого СтрокаУслугиДеньИтого Из ИтогиДень.УслугиДеньИтоги Цикл 
			ЕстьСтрока = Ложь;
			Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
				Если СтрокаУслугиИтого.УслугаРодитель = СтрокаУслугиДеньИтого.УслугаРодитель Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
			КонецЦикла;
			
			Если ЕстьСтрока Тогда 
				Если СтрокаУслугиИтого.Сумма <> 0 Тогда
					СтрокаУслугиДеньИтого.СуммаУслуги = СтрокаУслугиДеньИтого.СуммаУслуги + СтрокаУслугиИтого.Сумма;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;		
		
	КонецЦикла;		
	
	Область = Макет.ПолучитьОбласть("ИтогиДень|КолонкиЛево");
	
	Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
	Область.Параметры.Дата = Дата;		

	Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
	Область.Параметры.Месяц = Месяц;		

	ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
	Область.Параметры.ДеньНедели = ДеньНедели;

	//Область.Параметры.Номер = "Итого: " + ИтогиДень.Количество;
	//Область.Параметры.Цена = ИтогиДень.Цена;
	Область.Параметры.Сумма = ИтогиДень.Сумма;
	Область.Параметры.Количество = ИтогиДень.Количество;
	Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
	Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
	Область.Параметры.СуммаЧистая = ИтогиДень.СуммаЧистая;
	
	ПолеОтчета.Вывести(Область, 0);
	
	Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
		ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
		Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
			ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
		КонецЕсли;	
		ПолеОтчета.Присоединить(ОбластьУслуги, 1);
	КонецЦикла;
	
	Итоги.Сумма =  Итоги.Сумма + ИтогиДень.Сумма;
	Итоги.СуммаЧистая = Итоги.СуммаЧистая + ИтогиДень.СуммаЧистая;
	Итоги.СуммаОплаты = Итоги.СуммаОплаты + ИтогиДень.СуммаОплаты;
	Итоги.СуммаЭквайринга = Итоги.СуммаЭквайринга + ИтогиДень.СуммаЭквайринга;
	
	Для Индекс = 0 По Итоги.УслугиИтоги.Количество() - 1 Цикл
		Итоги.УслугиИтоги[Индекс].СуммаУслуги = Итоги.УслугиИтоги[Индекс].СуммаУслуги 
			+ ИтогиДень.УслугиДеньИтоги[Индекс].СуммаУслуги;		
	КонецЦикла;
	
~ПРОДОЛЖИТЬ_ДатаОтчетаПо:	
	Дата_П = Дата_П + 60*60*24;	
КонецЦикла;	
ПолеОтчета.ЗакончитьАвтогруппировкуСтрок();

Область = Макет.ПолучитьОбласть("Итоги|КолонкиЛево");

//Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
//Область.Параметры.Дата = Дата;		

//Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
//Область.Параметры.Месяц = Месяц;		

//ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
//Область.Параметры.ДеньНедели = ДеньНедели;

Область.Параметры.ИтогиДаты = "Период с " + Формат(ДатаОтчетаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаОтчетаПо, "ДФ=dd.MM.yy");

Область.Параметры.Сумма = Итоги.Сумма;
//Область.Параметры.Количество = Итоги.Количество;
Область.Параметры.СуммаОплаты = Итоги.СуммаОплаты;
Область.Параметры.СуммаЭквайринга = Итоги.СуммаЭквайринга;
Область.Параметры.СуммаЧистая = Итоги.СуммаЧистая;

ПолеОтчета.Вывести(Область, 1);

Для Каждого СтрокаУслугиИтого Из Итоги.УслугиИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("Итоги|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 1);
КонецЦикла;

Если ЭтоОтчет Тогда
	Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
	Колонка_1 = Область.ШиринаТаблицы - 5;
	Колонка_2 = Область.ШиринаТаблицы;
	ПолеОтчета.Область(, Колонка_1, ,Колонка_2).Видимость = Ложь;   
КонецЕсли;
	
Возврат ПолеОтчета;	
КонецФункции

Функция СформироватьОтчетОплатыНаСервере(Макет, ДатаОплатыОтбор, ФормаОплатыОтбор, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();
ПолеОтчета = Новый ТабличныйДокумент;      

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингУслуги.Ссылка КАК Папка,
                      |	КоворкингУслуги.НомерПП КАК НомерПП,
                      |	КоворкингУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты
                      |ИЗ
                      |	Справочник.КоворкингУслуги КАК КоворкингУслуги
                      |ГДЕ
                      |	КоворкингУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингУслуги.ЭтоГруппа = ИСТИНА
                      |	И КоворкингУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.КоворкингУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.КоворкингУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;
Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Папка) Тогда		
		//Область.Параметры.ШапкаДопУслуги = Строка.Папка;
		Если ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			ЗаголовокОтчета = Строка.ЗаголовокОтчеты;
		Иначе
			ЗаголовокОтчета = Строка.Папка;
		КонецЕсли;
		
		Область.Параметры.ШапкаДопУслуги = ЗаголовокОтчета;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область, 0);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

//Область = Макет.ПолучитьОбласть("Шапка|КолонкиПраво");
//ПолеОтчета.Присоединить(Область);

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

//Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
//КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 2;  // - 2 расшифровки

//Область = Макет.ПолучитьОбласть("Строка|КолонкиПраво");
//КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 1 ; // - 1 расшифровки

//КоличествоКолонок = КоличествоКолонок - 2;

ПолеОтчета.ФиксацияСверху = 1;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

//Для ш = 1 По 100 Цикл
//	Область = Макет.ПолучитьОбласть("Строка");	
//	Область.Параметры.Дата = ш;
//	
//	ПолеОтчета.Вывести(Область);
//КонецЦикла;

//
Итоги = Новый Структура();
Итоги.Вставить("Количество", 0);
//Итоги.Вставить("Цена", 0);
Итоги.Вставить("Сумма", 0);
Итоги.Вставить("СуммаЧистая", 0);
Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаЭквайринга", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);

ИтогиДень = Новый Структура();
ИтогиДень.Вставить("Количество", 0);
//ИтогиДень.Вставить("Цена", 0);
ИтогиДень.Вставить("Сумма", 0);
ИтогиДень.Вставить("СуммаЧистая", 0);
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка КАК Счет,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты КАК ДокументОплаты,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ЭтоУслуга КАК ЭтоУслуга,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ГУИДДолги КАК ГУИДДолги,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.СуммаОплаты КАК СуммаОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.Сумма
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументОплатыКасса,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ВЫБОР
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Взаимозачет)
                      |						ТОГДА 9
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                      |						ТОГДА 10
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)
                      |						ТОГДА 11
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                      |						ТОГДА 12
                      |					ИНАЧЕ 10
                      |				КОНЕЦ
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |					ТОГДА ВЫБОР
                      |							КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |								ТОГДА ВЫБОР
                      |										КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |											ТОГДА 5
                      |										ИНАЧЕ 4
                      |									КОНЕЦ
                      |							ИНАЧЕ 3
                      |						КОНЕЦ
                      |				ИНАЧЕ ВЫБОР
                      |						КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные = 0
                      |								И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта > 0
                      |							ТОГДА 1
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные > 0
                      |										И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта = 0
                      |									ТОГДА 2
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК ЭтоЭквайринг,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.Сумма КАК СуммаДокументаОплаты,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
                      |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
                      |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК ДопУслугиУслуга
                      |ИЗ
                      |	Документ.КоворкингСчета.РаспределениеОплатКоворкинг КАК КоворкингСчетаРаспределениеОплатКоворкинг
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                      |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка = КоворкингСчетаДопУслугиКоворкинг.Ссылка
                      |			И КоворкингСчетаРаспределениеОплатКоворкинг.ГУИДДолги = КоворкингСчетаДопУслугиКоворкинг.ГУИД
                      |ГДЕ
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка.Проведен = ИСТИНА
                      |	И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ДатаОплаты = &ДатаОплаты
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка,
                      |	ДатаУслуги,
                      |	ДокументОплатыДатаОплаты,
                      |	ДокументОплаты");

Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплатыОтбор);
ТЗ_ВсеОплаты = Запрос.Выполнить().Выгрузить();	

ТЗ_ВсеОплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_ВсеОплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_ВсеОплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 	
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
	
	Строка.СуммаОплаты = Окр(Строка.СуммаОплаты, 2);
КонецЦикла;

ТЗ_Счета = ТЗ_ВсеОплаты.Скопировать(,"Счет");
ТЗ_Счета.Свернуть("Счет");

СчетаСписок = Новый СписокЗначений;
Для Каждого Строка Из ТЗ_Счета Цикл
	СчетаСписок.Добавить(Строка.Счет);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка КАК Ссылка,
                      |	КоворкингСчетаДопУслугиКоворкинг.НомерСтроки КАК НомерСтроки,
                      |	КоворкингСчетаДопУслугиКоворкинг.ГУИД КАК ГУИД,
                      |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
                      |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК Услуга,
                      |	КоворкингСчетаДопУслугиКоворкинг.Цена КАК Цена,
                      |	КоворкингСчетаДопУслугиКоворкинг.Количество КАК Количество,
                      |	КоворкингСчетаДопУслугиКоворкинг.Сумма КАК Сумма,
                      |	КоворкингСчетаДопУслугиКоворкинг.СуммаОплачено КАК СуммаОплачено,
                      |	КоворкингСчетаДопУслугиКоворкинг.Примечание КАК Примечание
                      |ИЗ
                      |	Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                      |ГДЕ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка В(&Счета)");

Запрос.УстановитьПараметр("Счета", СчетаСписок);  
ТЗ_ВсеУслуги = Запрос.Выполнить().Выгрузить();

ТЗ_ВсяАренда = Новый ТаблицаЗначений;
ТЗ_ВсяАренда.Колонки.Добавить("Счет");
ТЗ_ВсяАренда.Колонки.Добавить("ДатаАренды");
ТЗ_ВсяАренда.Колонки.Добавить("СуммаАренды");

Для Индекс = 0 По ТЗ_Счета.Количество() - 1 Цикл
	СтрокаСчет = ТЗ_Счета[Индекс];
	
	Счет = СтрокаСчет.Счет;
	ОстатокСуммаСчета = Счет.Сумма;
	
	Если Счет.КоличествоЕдиниц = 0 Тогда
		СуммаЗаДень = 0;	
	Иначе
		СуммаЗаДень = Окр(Счет.Сумма / Счет.КоличествоЕдиниц, 2); 
	КонецЕсли;
	
	Дата_П = Счет.ДатаС;
	ДатаПо = Счет.ДатаПо;
	Пока Дата_П <= ДатаПо Цикл
		НоваяСтрока = ТЗ_ВсяАренда.Добавить();
		НоваяСтрока.Счет = Счет;
		НоваяСтрока.ДатаАренды = Дата_П;
		
		Если Дата_П = ДатаПо Тогда
			НоваяСтрока.СуммаАренды = ОстатокСуммаСчета;
		Иначе
			НоваяСтрока.СуммаАренды = СуммаЗаДень;
			ОстатокСуммаСчета = ОстатокСуммаСчета - СуммаЗаДень; 				
		КонецЕсли;
		
		Дата_П = Дата_П + 24 * 60 *60;
	КонецЦикла;		
КонецЦикла;

ТЗ_ВсеОплатыАренда = ТЗ_ВсеОплаты.СкопироватьКолонки();
ТЗ_ВсеОплатыАренда.Колонки.Добавить("ДатаАренды");
ТЗ_ВсеОплатыАренда.Колонки.Добавить("СуммаАренды");

Для Каждого СтрокаСчет Из ТЗ_Счета Цикл
	ОтборСтроки = Новый Структура("Счет, ЭтоУслуга", СтрокаСчет.Счет, Ложь);
	ОплатыСчет = ТЗ_ВсеОплаты.НайтиСтроки(ОтборСтроки);

	ОтборСтроки = Новый Структура("Счет", СтрокаСчет.Счет);
	АрендаСчет = ТЗ_ВсяАренда.НайтиСтроки(ОтборСтроки);
	
	Для Каждого СтрокаОплата Из ОплатыСчет Цикл
		ОстатокСуммаОплаты = СтрокаОплата.СуммаОплаты;
		
		Для Каждого СтрокаАренда Из АрендаСчет Цикл
			НоваяСтрока = ТЗ_ВсеОплатыАренда.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплата); 
			НоваяСтрока.ДатаАренды = СтрокаАренда.ДатаАренды;
			НоваяСтрока.СуммаАренды = СтрокаАренда.СуммаАренды;
			
			Если ОстатокСуммаОплаты > СтрокаАренда.СуммаАренды Тогда 
				НоваяСтрока.СуммаОплаты = СтрокаАренда.СуммаАренды;
				ОстатокСуммаОплаты = ОстатокСуммаОплаты - СтрокаАренда.СуммаАренды;
			Иначе
				НоваяСтрока.СуммаОплаты = ОстатокСуммаОплаты;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецЦикла;

СуммаОплаты = 0;
Для Каждого СтрокаОплаты Из ТЗ_ВсеОплатыАренда Цикл
	Если ФормаОплатыОтбор <> "" Тогда
		Если ФормаОплатыОтбор <> ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты) 
		Тогда Продолжить; КонецЕсли;
	КонецЕсли;	
	
	Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
	
	Область.Параметры.Дата = Формат(СтрокаОплаты.ДатаАренды, "ДФ=dd.MM.yy");
	
	Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
	Область.Параметры.РасшифровкаСчет = СтрокаСчет.Счет;
	
	Область.Параметры.Номер = СтрокаСчет.Счет.КоворкингЗаявка.КоворкингНомер;
	Область.Параметры.РасшифровкаНомер = СтрокаСчет.Счет;
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	СуммаАренды = СтрокаОплаты.СуммаАренды;
	Область.Параметры.Сумма = СуммаАренды;
	
	СуммаОплатыСтрокаОплаты  = Окр(СтрокаОплаты.СуммаОплаты, 2);
	Область.Параметры.СуммаОплаты = СуммаОплатыСтрокаОплаты;
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
	Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;
	
	ПолеОтчета.Вывести(Область, 1);
	
	ИтогиДень.Сумма = ИтогиДень.Сумма + СуммаАренды;
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплатыСтрокаОплаты;
	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
КонецЦикла;

Для Каждого СтрокаОплаты Из ТЗ_ВсеОплаты Цикл
	Если НЕ СтрокаОплаты.ЭтоУслуга Тогда Продолжить; КонецЕсли;
	
	Если ФормаОплатыОтбор <> "" Тогда
		Если ФормаОплатыОтбор <> ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты) 
		Тогда Продолжить; КонецЕсли;
	КонецЕсли;	
	
	Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
	
	ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ГУИДДолги);
	НайденныеСтроки = ТЗ_ВсеУслуги.НайтиСтроки(ОтборСтроки);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		ДатаУслуги = ".";
	Иначе
		ДатаУслуги = НайденныеСтроки[0].ДатаУслуги;
	КонецЕсли;
	Область.Параметры.Дата = Формат(ДатаУслуги, "ДФ=dd.MM.yy");
	
	Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
	Область.Параметры.РасшифровкаСчет = СтрокаСчет.Счет;
	
	Область.Параметры.Номер = СтрокаСчет.Счет.КоворкингЗаявка.КоворкингНомер;
	Область.Параметры.РасшифровкаНомер = СтрокаСчет.Счет;
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	СуммаОплатыСтрокаОплаты  = Окр(СтрокаОплаты.СуммаОплаты, 2);
	Область.Параметры.СуммаОплаты = СуммаОплатыСтрокаОплаты;
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
	Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;

	ПолеОтчета.Вывести(Область, 1);
	
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплатыСтрокаОплаты;
	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
	
	Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
		ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ГУИДДолги);
		НайденныеСтроки = ТЗ_ВсеУслуги.НайтиСтроки(ОтборСтроки);
		
		ЕстьСтрока = Ложь;
		Для Каждого Строка Из НайденныеСтроки Цикл
			Результат = Справочники.КоворкингУслуги.ПустаяСсылка();
			Ссылка = Строка.Услуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
			
			//Если Строка.УслугаРодитель = СтрокаРодительУслуги.Родитель Тогда
			Если Результат = СтрокаРодительУслуги.Папка Тогда
				ЕстьСтрока = Истина;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
		Если ЕстьСтрока Тогда
			ОбластьУслуги.Параметры.СуммаУслуги = СуммаОплатыСтрокаОплаты;
		КонецЕсли;
		
		ПолеОтчета.Присоединить(ОбластьУслуги, 1);
		
		Если ЕстьСтрока Тогда
			ОтборСтроки = Новый Структура("УслугаРодитель", Результат); 
			НайденныеСтроки = ИтогиДень.УслугиДеньИтоги.НайтиСтроки(ОтборСтроки);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.СуммаУслуги = НайденнаяСтрока.СуммаУслуги + СуммаОплатыСтрокаОплаты;
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
КонецЦикла;

Область = Макет.ПолучитьОбласть("ИтогиДень|КолонкиЛево");

//Дата = Формат(ДатаОплатыОтбор, "ДФ='д.МММ гг'" );  
//Область.Параметры.Дата = Дата;		
Область.Параметры.Дата = ".";		

Область.Параметры.Сумма = ИтогиДень.Сумма;
Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;

ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 0);
КонецЦикла;

//Если ЭтоОтчет Тогда
//	Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
//	Колонка_1 = Область.ШиринаТаблицы - 3;
//	Колонка_2 = Область.ШиринаТаблицы;
//	ПолеОтчета.Область(, Колонка_1, ,Колонка_2).Видимость = Ложь;   
//КонецЕсли;

Возврат ПолеОтчета;
КонецФункции

Функция ОплатилНаименование(Строка)
Если Строка.ТипОплаты = 0 Тогда	
	Возврат "Гость смеш.";
ИначеЕсли Строка.ТипОплаты = 1 Тогда	
	Возврат "Гость к/к";
ИначеЕсли Строка.ТипОплаты = 2 Тогда	
	Возврат "Гость нал";
ИначеЕсли Строка.ТипОплаты = 3 Тогда	
	//Возврат "б/н";
	Если Строка.ДокументОплаты.ОтКого.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда
		НаименованиеЮрЛица = Строка.ДокументОплаты.ОтКого.НаименованиеЮрЛица;
		Если ЗначениеЗаполнено(НаименованиеЮрЛица) Тогда
			Наименование = НаименованиеЮрЛица;
		Иначе
			Наименование = Строка.ДокументОплаты.ОтКого.Наименование;			
		КонецЕсли;
	Иначе	
		Наименование = Строка.ДокументОплаты.ОтКого.Наименование;			
	КонецЕсли;
		
	Возврат "" + Наименование + " б/н";
ИначеЕсли Строка.ТипОплаты = 4 Тогда	
	Возврат "Гость п/к";
ИначеЕсли Строка.ТипОплаты = 5 Тогда	
	Возврат "Гость сбп";
ИначеЕсли Строка.ТипОплаты = 9 Тогда
	
	Если Строка.ДокументОплаты.ОтКого.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда
		НаименованиеЮрЛица = Строка.ДокументОплаты.ОтКого.НаименованиеЮрЛица;
		Если ЗначениеЗаполнено(НаименованиеЮрЛица) Тогда
			Наименование = НаименованиеЮрЛица;
		Иначе
			Наименование = Строка.ДокументОплаты.ОтКого.Наименование;			
		КонецЕсли;
	Иначе	
		Наименование = Строка.ДокументОплаты.ОтКого.Наименование;			
	КонецЕсли;

	Возврат "" + Наименование + " в/з";
КонецЕсли;

Возврат "";	
КонецФункции

Функция ОплатилНаименование_1(Строка)
Если Строка.ТипОплаты = 0 Тогда	
	Возврат "Гость смеш.";
ИначеЕсли Строка.ТипОплаты = 1 Тогда	
	Возврат "Гость к/к";
ИначеЕсли Строка.ТипОплаты = 2 Тогда	
	Возврат "Гость нал";
ИначеЕсли Строка.ТипОплаты = 3 Тогда	
	//Возврат "б/н";
	Возврат "" + Строка.ДокументОплаты.ОтКого + " б/н";
ИначеЕсли Строка.ТипОплаты = 4 Тогда	
	Возврат "Гость п/к";
ИначеЕсли Строка.ТипОплаты = 5 Тогда	
	Возврат "Гость сбп";
ИначеЕсли Строка.ТипОплаты = 9 Тогда	
	Возврат "" + Строка.ДокументОплаты.ОтКого + " в/з";
КонецЕсли;

Возврат "";	
КонецФункции
// ++++++++++++++++++++++++++++++

