
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр(); 	
	
РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(ЭтаФорма.КоманднаяПанель,"ФормаУдалить");

Если Параметры.Свойство("ТолькоПочасоваяОплата") Тогда
	ТолькоПочасоваяОплата = Параметры.ТолькоПочасоваяОплата;	
КонецЕсли;
Список.Параметры.УстановитьЗначениеПараметра("ТолькоПочасоваяОплата", ТолькоПочасоваяОплата);

УсловноеОформлениеЗагрузить();	
КонецПроцедуры

//
&НаСервере
Процедура УсловноеОформлениеЗагрузить()
УсловноеОформление.Элементы.Очистить();

ЭлементыТабНаФормеИмя = Элементы.Список.Имя;

ПутьКПолюОтбора = "Список.Проведен";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;

ПравоеЗначение = Ложь;
Web_Цвета = WebЦвета.БледноЛиловый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление, ЭлементыТабНаФормеИмя, ПутьКПолюОтбора
	, Вид_Сравнения, ПравоеЗначение, Web_Цвета);
КонецПроцедуры
//
