
//
Процедура ЗагрузитьКлиентовВЗаявкахНаСервере(ПутьКФайловойБазе, ИмяПользователя, Пароль, РезервС) Экспорт
Перем ЗначениеХодаВыполнения, Сч, Объект, СтруктураВозврата; 
ЗначениеХодаВыполнения = Новый Структура("ПроцентВыполнения, КоличествоСозданныхЭлементов", 0, 0);
	
Соединение = ПолучитьПодключениеКФайловойБД(ПутьКФайловойБазе, ИмяПользователя, Пароль);

Запрос = Соединение.NewObject("Запрос");

Запрос.Текст = "ВЫБРАТЬ
|	Клиенты.Ссылка,
|	Клиенты.Родитель,
|	Клиенты.ЭтоГруппа,
|	Клиенты.Код,
|	Клиенты.Наименование,
|	Клиенты.ТипКлиента,
|	Клиенты.Фамилия,
|	Клиенты.Имя,
|	Клиенты.Отчество,
|	Клиенты.Адрес,
|	Клиенты.ИНН,
|	Клиенты.КПП,
|	Клиенты.ВидДокументаУдостоверяющегоЛичность,
|	Клиенты.Серия,
|	Клиенты.Номер,
|	Клиенты.ДатаВыдачи,
|	Клиенты.КемВыдан,
|	Клиенты.АдресРегистрации,
|	Клиенты.ДатаРегистрации,
|	Клиенты.КатегорияВизы,
|	Клиенты.СрокВизыС,
|	Клиенты.СрокВизыПо,
|	Клиенты.ИностранныйГражданин,
|	Клиенты.Страна,
|	Клиенты.Продление,
|	Клиенты.ЦельПриезда,
|	Клиенты.НомерВизы,
|	Клиенты.Пол,
|	Клиенты.ДатаРождения,
|	Клиенты.МестоРождения,
|	Клиенты.ФИО,
|	Клиенты.ЧС,
|	Клиенты.Категория,
|	Клиенты.ОснованиеКатегории,
|	Клиенты.НаименованиеЮрЛица,
|	Клиенты.Телефон,
|	Клиенты.СфераДеятельности,
|	Клиенты.Город,
|	Клиенты.СтранаРождения,
|	Клиенты.ГородРождения,
|	Клиенты.УлицаПроживания,
|	Клиенты.ДомПроживания,
|	Клиенты.КорпусПроживания,
|	Клиенты.КвартираПроживания,
|	Клиенты.СтранаПроживания,
|	Клиенты.ГородПроживания,
|	Клиенты.СерияВизы,
|	Клиенты.МиграционнаяКартаСерия,
|	Клиенты.МиграционнаяКартаНомер,
|	Клиенты.Турагентство,
|	Клиенты.ПроцентАгент_OLD,
|	Клиенты.КодОргана,
|	Клиенты.РайонРождения,
|	Клиенты.РайонПроживания,
|	Клиенты.НасПунктРождения,
|	Клиенты.Гражданство,
|	Клиенты.НасПунктПроживания,
|	Клиенты.Курит,
|	Клиенты.ДатаВъездаВРФ,
|	Клиенты.ЭлПочта,
|	Клиенты.Менеджер,
|	Клиенты.Тариф_НеИспользуется,
|	Клиенты.СтранаРожденияФМС,
|	Клиенты.ТипДокументаФМС,
|	Клиенты.ЦельПриездаФМС,
|	Клиенты.ЦельВъездаФМС,
|	Клиенты.ПунктыВыдачиФМС,
|	Клиенты.ГражданствоФМС,
|	Клиенты.ДатаДействияДокументаФМС,
|	Клиенты.ВидДокументаНаПребываниеФМС,
|	Клиенты.ТипВизыФМС,
|	Клиенты.КратностьВизыФМС,
|	Клиенты.ИдентификаторВизыФМС,
|	Клиенты.ПунктПересеченияГраницыФМС,
|	Клиенты.ДатаВъездаВРФ_ФМС,
|	Клиенты.СрокПребыванияВ_РФ_ФМС,
|	Клиенты.ФамилияПредставителяФМС,
|	Клиенты.ИмяПредставителяФМС,
|	Клиенты.ОтчествоПредставителяФМС,
|	Клиенты.ТипДокументаПредставителяФМС,
|	Клиенты.СерияДокументаПредставителяФМС,
|	Клиенты.НомерДокументаПредставителяФМС,
|	Клиенты.ДатаВыдачиДокументаПредставителя_ФМС,
|	Клиенты.ВидКлиента,
|	Клиенты.ВозможностьИзмененияТарифа,
|	Клиенты.ЖелательныйЭтаж,
|	Клиенты.Завтрак,
|	Клиенты.ДопПринадлежности,
|	Клиенты.ПредпочтительныйНомер,
|	Клиенты.Балкон,
|	Клиенты.ВидИзОкна,
|	Клиенты.Ванна,
|	Клиенты.Иное,
|	Клиенты.ФамилияЛатиницей,
|	Клиенты.ИмяЛатиницей,
|	Клиенты.КонтактнаяИнформация.(
|		Ссылка,
|		НомерСтроки,
|		ВидКонтактнойИнформации,
|		Информация
|	),
|	Клиенты.ПрочаяИнформация.(
|		Ссылка,
|		НомерСтроки,
|		ВидИнформации,
|		Информация
|	),
|	Клиенты.СканыДокументов.(
|		Ссылка,
|		НомерСтроки,
|		ПутьДоФото,
|		Комментарий
|	)
|ИЗ
|	Справочник.Клиенты КАК Клиенты
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ЗаявкаНаБронирование.Клиент КАК Клиент,
|			ЗаявкаНаБронирование.Бронирует КАК Бронирует,
|			ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
|			ЗаявкаНаБронирование.Клиент2 КАК Клиент2
|		ИЗ
|			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
|		ГДЕ
|			ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
|			И ЗаявкаНаБронирование.РезервС > &РезервС) КАК Заявки
|		ПО (Клиенты.Ссылка = Заявки.Клиент
|				ИЛИ Клиенты.Ссылка = Заявки.Бронирует
|				ИЛИ Клиенты.Ссылка = Заявки.Оплачивает
|				ИЛИ Клиенты.Ссылка = Заявки.Клиент2)
|ГДЕ
|	Клиенты.ПометкаУдаления = ЛОЖЬ
|	И Клиенты.ЭтоГруппа = ЛОЖЬ";

//|	И Клиенты.Наименование = ""Белов Сергей Николаевич""

Запрос.УстановитьПараметр("РезервС", РезервС);
ТЗ_КлиентыСоединение = Запрос.Выполнить().Выгрузить(); 
Если ТЗ_КлиентыСоединение.Количество() = 0 Тогда 
	Сообщить("Нет клиентов");
	Возврат; 
КонецЕсли;

КоличествоЭлементов = ТЗ_КлиентыСоединение.Количество();

Клиенты = Справочники.Клиенты;

СоединениеПустаяСсылка = Соединение.Справочники.Клиенты.ПустаяСсылка(); 

ПустаяСсылка = Справочники.Клиенты.ПустаяСсылка(); 

МассивИменаПолей = Новый Массив;
Для Каждого Строка Из ТЗ_КлиентыСоединение.Колонки Цикл
	МассивИменаПолей.Добавить(Строка.Имя);
КонецЦикла;	

ЗапросКорневойРодитель = Новый Запрос("ВЫБРАТЬ
                                      |	Клиенты.Ссылка КАК Ссылка
                                      |ИЗ
                                      |	Справочник.Клиенты КАК Клиенты
                                      |ГДЕ
                                      |	Клиенты.ПометкаУдаления = ЛОЖЬ
                                      |	И Клиенты.ЭтоГруппа = ИСТИНА
                                      |	И Клиенты.Наименование = ""__АРХИВ""");
ТЗКорневойРодитель = ЗапросКорневойРодитель.Выполнить().Выгрузить();
Если ТЗКорневойРодитель.Количество() = 0 Тогда
	КорневойРодительОбъект = Справочники.Клиенты.СоздатьГруппу();
	КорневойРодительОбъект.Наименование = "__АРХИВ";
	КорневойРодительОбъект.ЗагрузкаГИУДСтрока = "*";
	КорневойРодительОбъект.Записать();
	
	КорневойРодитель = КорневойРодительОбъект.Ссылка; 
Иначе
	КорневойРодитель = ТЗКорневойРодитель[0].Ссылка;
КонецЕсли;

//Колонки = ТЗ.Колонки;
ш = 0;
Для Каждого Строка Из ТЗ_КлиентыСоединение Цикл
	//Ход выполнения
	ш = ш + 1;
	ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов = ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов + 1;
	ЗначениеХодаВыполнения.ПроцентВыполнения = Окр(ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов / КоличествоЭлементов * 100);		
	АсинхронныеВызовы.ОбновитьЗначениеХодаВыполнения(ЗначениеХодаВыполнения);
	Если ш%100 = 0 Тогда
		АсинхронныеВызовы.ДобавитьСообщениеХодаВыполнения("Выполнили " + ЗначениеХодаВыполнения.ПроцентВыполнения + "%");
	КонецЕсли;
	
	//Если Строка.Наименование <> "ПЕРЕНОС" Тогда Продолжить; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Строка.Наименование) Тогда Продолжить; КонецЕсли;
	
	ЗагрузкаГИУДСтрока = Соединение.XMLСтрока(Строка.Ссылка);
	КлиентПоЗагрузкаГИУДСтрока = Клиенты.НайтиПоРеквизиту("ЗагрузкаГИУДСтрока", ЗагрузкаГИУДСтрока);
	Если ЗначениеЗаполнено(КлиентПоЗагрузкаГИУДСтрока) Тогда Продолжить; КонецЕсли;
	
	ЗапросКлиент = Новый Запрос;
	ЗапросКлиент.Текст = "ВЫБРАТЬ
	                     |	Клиенты.Ссылка КАК Ссылка
	                     |ИЗ
	                     |	Справочник.Клиенты КАК Клиенты
	                     |ГДЕ
	                     |	Клиенты.ПометкаУдаления = ЛОЖЬ
	                     |	И Клиенты.ЭтоГруппа = ЛОЖЬ
	                     |	И Клиенты.Наименование = &Наименование
	                     |	И Клиенты.ЗагрузкаГИУДСтрока = """"";
	
	ЗапросКлиент.УстановитьПараметр("Наименование", Строка.Наименование);
	
	ТЗЗапросКлиент = ЗапросКлиент.Выполнить().Выгрузить();
	ТЗЗапросКлиентКоличество = ТЗЗапросКлиент.Количество();
	Если ТЗЗапросКлиентКоличество = 1  Тогда 
		КлиентОбъект = ТЗЗапросКлиент[0].Ссылка.ПолучитьОбъект();
		КлиентОбъект.ЗагрузкаГИУДСтрока = ЗагрузкаГИУДСтрока; 
		КлиентОбъект.Записать();
		
		Продолжить; 
	ИначеЕсли ТЗЗапросКлиентКоличество > 1  Тогда 
		Продолжить; 
	КонецЕсли;
		
	КлиентОбъект = Клиенты.СоздатьЭлемент();
	КлиентОбъект.ЗагрузкаГИУДСтрока = ЗагрузкаГИУДСтрока;
	ЗаполнитьЗначенияКлиент(КлиентОбъект, Строка, МассивИменаПолей, Соединение);
	
	// + Создание группы
	НачальнаяГруппаСоединение = СоединениеПустаяСсылка;
	ГруппаИмяСоединение = "";
	РодительСсылкаСоединение = Строка.Родитель.Ссылка;
	ИмяГруппы(ГруппаИмяСоединение, РодительСсылкаСоединение, НачальнаяГруппаСоединение, СоединениеПустаяСсылка);   
	
	ГруппаИмяПромежуточное = ГруппаИмяСоединение;
	
	//РодительПромежуточное = ПустаяСсылка;
	РодительПромежуточное = КорневойРодитель;
	
	Пока Истина Цикл
		Индекс = СтрНайти(ГруппаИмяПромежуточное, "\");
		Если Индекс = 0 Тогда Прервать; КонецЕсли;
		
		ГруппаНаименование = Лев(ГруппаИмяПромежуточное, Индекс - 1); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
	               |	Клиенты.Ссылка КАК Ссылка,
	               |	Клиенты.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Клиенты КАК Клиенты
	               |ГДЕ
	               |	Клиенты.ЭтоГруппа = ИСТИНА
	               |	И Клиенты.Наименование = &Наименование
	               |	И Клиенты.Родитель = &Родитель";

		Запрос.УстановитьПараметр("Наименование", ГруппаНаименование); 
		Запрос.УстановитьПараметр("Родитель", РодительПромежуточное); 
		
		ТЗГруппы = Запрос.Выполнить().Выгрузить();
		Если ТЗГруппы.Количество() = 0 Тогда
			НоваяГруппа = Справочники.Клиенты.СоздатьГруппу();
			НоваяГруппа.Наименование = ГруппаНаименование;
			НоваяГруппа.Родитель = РодительПромежуточное;
			
			НоваяГруппа.ЗагрузкаГИУДСтрока = Новый УникальныйИдентификатор();
			
			НоваяГруппа.Записать();
			
			РодительПромежуточное = НоваяГруппа.Ссылка;	
		Иначе
			РодительПромежуточное = ТЗГруппы[0].Ссылка;
		КонецЕсли;	
		
		ГруппаИмяПромежуточное = Сред(ГруппаИмяПромежуточное, Индекс + 1);
	КонецЦикла;	
	
	КлиентОбъект.Родитель = РодительПромежуточное; 
	
	КлиентОбъект.КонтактнаяИнформация.Очистить();
	Для Каждого СтрокаКонтактнаяИнформация Из Строка.КонтактнаяИнформация Цикл
		Ссылка = ПереносЗначенияКласификатора("ВидыКонтактнойИнформации", СтрокаКонтактнаяИнформация.ВидКонтактнойИнформации);
		
		НовыйВидКонтактнойИнформации = КлиентОбъект.КонтактнаяИнформация.Добавить();
		НовыйВидКонтактнойИнформации.ВидКонтактнойИнформации = Ссылка; 
		НовыйВидКонтактнойИнформации.Информация = СтрокаКонтактнаяИнформация.Информация; 
	КонецЦикла;	
	
	КлиентОбъект.ПрочаяИнформация.Очистить();
	Для Каждого СтрокаПрочаяИнформация Из Строка.ПрочаяИнформация Цикл
		Ссылка = ПереносЗначенияКласификатора("ВидыИнформации", СтрокаПрочаяИнформация.ВидИнформации);
		
		НовыйВидПрочаяИнформация = КлиентОбъект.ПрочаяИнформация.Добавить();
		НовыйВидПрочаяИнформация.ВидИнформации = Ссылка; 
		НовыйВидПрочаяИнформация.Информация = СтрокаПрочаяИнформация.Информация; 
	КонецЦикла;	
	
// Сканы	
	//ИмяПапкиПриемник = Константы.Папка_C_BASE.Получить();
	//ИмяПапкиПриемник = ИмяПапкиПриемник + "SCAN\"; 

	//Префикс = ЗагрузкаГИУДСтрока;
	//
	//ИмяФайлаПрефикс = ИмяПапкиПриемник + Префикс; 
	//
	//Для Каждого СтрокаСканыДокументов Из Строка.СканыДокументов Цикл
	//	
	//	ПутьДоФото = СтрокаСканыДокументов.ПутьДоФото;
	//	//ПутьДоФото = "C" + Сред(ПутьДоФото, 2, СтрДлина(ПутьДоФото) - 1);
	//	Индекс = СтрНайти(ПутьДоФото, "\", НаправлениеПоиска.СКонца);
	//	Если Индекс = 0 тогда Продолжить; КонецЕсли;
	//	
	//	ИмяФайла = Прав(ПутьДоФото, СтрДлина(ПутьДоФото) - Индекс);
	//	
	//	Если СтрДлина(ИмяФайла) = 0 тогда Продолжить; КонецЕсли;
	//	
	//	ПолноеИмяФайла = ИмяПапкиИсточник + ИмяФайла;
	//	
	//	Файл = Новый Файл(ПолноеИмяФайла);
	//	Если НЕ Файл.Существует() Тогда Продолжить; КонецЕсли;
	//	
	//	ИмяФайлаПриемник = ИмяФайлаПрефикс + "_" + ИмяФайла;
	//	
	//	ОтборСтроки = Новый Структура("ПутьДоФото", ИмяФайлаПриемник);
	//	НайденныеСтроки = КлиентОбъект.СканыДокументов.НайтиСтроки(ОтборСтроки);
	//	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
	//		КлиентОбъект.СканыДокументов.Удалить(НайденнаяСтрока);
	//	КонецЦикла;
	//	
	//	Попытка
	//		КопироватьФайл(ПолноеИмяФайла, ИмяФайлаПриемник);
	//		НетОшибкаКопирования = Истина;
	//	Исключение
	//		Сообщить(ОписаниеОшибки());
	//		НетОшибкаКопирования = Ложь;
	//	КонецПопытки;
	//	
	//	Если НетОшибкаКопирования Тогда
	//		НовыйВидСканыДокументов = КлиентОбъект.СканыДокументов.Добавить();
	//		НовыйВидСканыДокументов.ПутьДоФото = ИмяФайлаПриемник; 
	//		НовыйВидСканыДокументов.Комментарий = СтрокаСканыДокументов.Комментарий; 
	//	КонецЕсли;
	//КонецЦикла;	
//	
	
	Попытка
		КлиентОбъект.Записать();
	Исключение
		//Сообщить(ОписаниеОшибки());		
		АсинхронныеВызовы.ДобавитьСообщениеХодаВыполнения("Ошибка переноса: " + ОписаниеОшибки());
	КонецПопытки;
	
	//Если ш > 1000 Тогда Прервать; КонецЕсли;
КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьКлиентовПоНаименованию(ПутьКФайловойБазе, ИмяПользователя, Пароль, НаименованиеКлиента) Экспорт
Перем ЗначениеХодаВыполнения, Сч, Объект, СтруктураВозврата; 
ЗначениеХодаВыполнения = Новый Структура("ПроцентВыполнения, КоличествоСозданныхЭлементов", 0, 0);
	
Соединение = ПолучитьПодключениеКФайловойБД(ПутьКФайловойБазе, ИмяПользователя, Пароль);

Запрос = Соединение.NewObject("Запрос");

Запрос.Текст = "ВЫБРАТЬ
|	Клиенты.Ссылка,
|	Клиенты.Родитель,
|	Клиенты.ЭтоГруппа,
|	Клиенты.Код,
|	Клиенты.Наименование,
|	Клиенты.ТипКлиента,
|	Клиенты.Фамилия,
|	Клиенты.Имя,
|	Клиенты.Отчество,
|	Клиенты.Адрес,
|	Клиенты.ИНН,
|	Клиенты.КПП,
|	Клиенты.ВидДокументаУдостоверяющегоЛичность,
|	Клиенты.Серия,
|	Клиенты.Номер,
|	Клиенты.ДатаВыдачи,
|	Клиенты.КемВыдан,
|	Клиенты.АдресРегистрации,
|	Клиенты.ДатаРегистрации,
|	Клиенты.КатегорияВизы,
|	Клиенты.СрокВизыС,
|	Клиенты.СрокВизыПо,
|	Клиенты.ИностранныйГражданин,
|	Клиенты.Страна,
|	Клиенты.Продление,
|	Клиенты.ЦельПриезда,
|	Клиенты.НомерВизы,
|	Клиенты.Пол,
|	Клиенты.ДатаРождения,
|	Клиенты.МестоРождения,
|	Клиенты.ФИО,
|	Клиенты.ЧС,
|	Клиенты.Категория,
|	Клиенты.ОснованиеКатегории,
|	Клиенты.НаименованиеЮрЛица,
|	Клиенты.Телефон,
|	Клиенты.СфераДеятельности,
|	Клиенты.Город,
|	Клиенты.СтранаРождения,
|	Клиенты.ГородРождения,
|	Клиенты.УлицаПроживания,
|	Клиенты.ДомПроживания,
|	Клиенты.КорпусПроживания,
|	Клиенты.КвартираПроживания,
|	Клиенты.СтранаПроживания,
|	Клиенты.ГородПроживания,
|	Клиенты.СерияВизы,
|	Клиенты.МиграционнаяКартаСерия,
|	Клиенты.МиграционнаяКартаНомер,
|	Клиенты.Турагентство,
|	Клиенты.ПроцентАгент_OLD,
|	Клиенты.КодОргана,
|	Клиенты.РайонРождения,
|	Клиенты.РайонПроживания,
|	Клиенты.НасПунктРождения,
|	Клиенты.Гражданство,
|	Клиенты.НасПунктПроживания,
|	Клиенты.Курит,
|	Клиенты.ДатаВъездаВРФ,
|	Клиенты.ЭлПочта,
|	Клиенты.Менеджер,
|	Клиенты.Тариф_НеИспользуется,
|	Клиенты.СтранаРожденияФМС,
|	Клиенты.ТипДокументаФМС,
|	Клиенты.ЦельПриездаФМС,
|	Клиенты.ЦельВъездаФМС,
|	Клиенты.ПунктыВыдачиФМС,
|	Клиенты.ГражданствоФМС,
|	Клиенты.ДатаДействияДокументаФМС,
|	Клиенты.ВидДокументаНаПребываниеФМС,
|	Клиенты.ТипВизыФМС,
|	Клиенты.КратностьВизыФМС,
|	Клиенты.ИдентификаторВизыФМС,
|	Клиенты.ПунктПересеченияГраницыФМС,
|	Клиенты.ДатаВъездаВРФ_ФМС,
|	Клиенты.СрокПребыванияВ_РФ_ФМС,
|	Клиенты.ФамилияПредставителяФМС,
|	Клиенты.ИмяПредставителяФМС,
|	Клиенты.ОтчествоПредставителяФМС,
|	Клиенты.ТипДокументаПредставителяФМС,
|	Клиенты.СерияДокументаПредставителяФМС,
|	Клиенты.НомерДокументаПредставителяФМС,
|	Клиенты.ДатаВыдачиДокументаПредставителя_ФМС,
|	Клиенты.ВидКлиента,
|	Клиенты.ВозможностьИзмененияТарифа,
|	Клиенты.ЖелательныйЭтаж,
|	Клиенты.Завтрак,
|	Клиенты.ДопПринадлежности,
|	Клиенты.ПредпочтительныйНомер,
|	Клиенты.Балкон,
|	Клиенты.ВидИзОкна,
|	Клиенты.Ванна,
|	Клиенты.Иное,
|	Клиенты.ФамилияЛатиницей,
|	Клиенты.ИмяЛатиницей,
|	Клиенты.КонтактнаяИнформация.(
|		Ссылка,
|		НомерСтроки,
|		ВидКонтактнойИнформации,
|		Информация
|	),
|	Клиенты.ПрочаяИнформация.(
|		Ссылка,
|		НомерСтроки,
|		ВидИнформации,
|		Информация
|	),
|	Клиенты.СканыДокументов.(
|		Ссылка,
|		НомерСтроки,
|		ПутьДоФото,
|		Комментарий
|	)
|ИЗ
|	Справочник.Клиенты КАК Клиенты
|ГДЕ
| Клиенты.ПометкаУдаления = ЛОЖЬ
|	И Клиенты.ЭтоГруппа = ЛОЖЬ
|	И ВЫБОР КОГДА &НаименованиеКлиента = """" ТОГДА ЛОЖЬ 
| ИНАЧЕ Клиенты.Наименование = &НаименованиеКлиента КОНЕЦ";

//|	И Клиенты.Наименование = ""Белов Сергей Николаевич""

//ЗапросСписокРодителей = Соединение.NewObject("Запрос");
//ЗапросСписокРодителей.Текст = "ВЫБРАТЬ
//                              |	Клиенты.Ссылка КАК Ссылка,
//                              |	Клиенты.Наименование КАК Наименование
//                              |ИЗ
//                              |	Справочник.Клиенты КАК Клиенты
//                              |ГДЕ
//                              |	Клиенты.ПометкаУдаления = ЛОЖЬ
//                              |	И Клиенты.ЭтоГруппа = ИСТИНА
//                              |	И Клиенты.Наименование ПОДОБНО &Наименование";

//ЗапросСписокРодителей.УстановитьПараметр("Наименование", "###%"); 
//ТЗ_ГруппыСоединение = ЗапросСписокРодителей.Выполнить().Выгрузить();

//СписокРодителей = Соединение.NewObject("СписокЗначений");
//Для Каждого Строка из ТЗ_ГруппыСоединение Цикл 
//	СписокРодителей.Добавить(Строка.Ссылка);
//КОнецЦикла;

Запрос.УстановитьПараметр("НаименованиеКлиента", НаименованиеКлиента);
//Запрос.УстановитьПараметр("СписокЗначений", СписокРодителей);
ТЗ_КлиентыСоединение = Запрос.Выполнить().Выгрузить(); 
Если ТЗ_КлиентыСоединение.Количество() = 0 Тогда 
	Сообщить("Нет клиентов");
	Возврат; 
КонецЕсли;

КоличествоЭлементов = ТЗ_КлиентыСоединение.Количество();

Клиенты = Справочники.Клиенты;

СоединениеПустаяСсылка = Соединение.Справочники.Клиенты.ПустаяСсылка(); 

ПустаяСсылка = Справочники.Клиенты.ПустаяСсылка(); 

МассивИменаПолей = Новый Массив;
Для Каждого Строка Из ТЗ_КлиентыСоединение.Колонки Цикл
	МассивИменаПолей.Добавить(Строка.Имя);
КонецЦикла;	

ЗапросКорневойРодитель = Новый Запрос("ВЫБРАТЬ
                                      |	Клиенты.Ссылка КАК Ссылка
                                      |ИЗ
                                      |	Справочник.Клиенты КАК Клиенты
                                      |ГДЕ
                                      |	Клиенты.ПометкаУдаления = ЛОЖЬ
                                      |	И Клиенты.ЭтоГруппа = ИСТИНА
                                      |	И Клиенты.Наименование = ""__АРХИВ""");
ТЗКорневойРодитель = ЗапросКорневойРодитель.Выполнить().Выгрузить();
Если ТЗКорневойРодитель.Количество() = 0 Тогда
	КорневойРодительОбъект = Справочники.Клиенты.СоздатьГруппу();
	КорневойРодительОбъект.Наименование = "__АРХИВ";
	КорневойРодительОбъект.ЗагрузкаГИУДСтрока = "*";
	КорневойРодительОбъект.Записать();
	
	КорневойРодитель = КорневойРодительОбъект.Ссылка; 
Иначе
	КорневойРодитель = ТЗКорневойРодитель[0].Ссылка;
КонецЕсли;

//Колонки = ТЗ.Колонки;
ш = 0;
Для Каждого Строка Из ТЗ_КлиентыСоединение Цикл
	//Ход выполнения
	ш = ш + 1;
	ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов = ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов + 1;
	ЗначениеХодаВыполнения.ПроцентВыполнения = Окр(ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов / КоличествоЭлементов * 100);		
	АсинхронныеВызовы.ОбновитьЗначениеХодаВыполнения(ЗначениеХодаВыполнения);
	Если ш%100 = 0 Тогда
		АсинхронныеВызовы.ДобавитьСообщениеХодаВыполнения("Выполнили " + ЗначениеХодаВыполнения.ПроцентВыполнения + "%");
	КонецЕсли;
	
	//Если Строка.Наименование <> "ПЕРЕНОС" Тогда Продолжить; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Строка.Наименование) Тогда Продолжить; КонецЕсли;
	
	ЗагрузкаГИУДСтрока = Соединение.XMLСтрока(Строка.Ссылка);
	КлиентПоЗагрузкаГИУДСтрока = Клиенты.НайтиПоРеквизиту("ЗагрузкаГИУДСтрока", ЗагрузкаГИУДСтрока);
	
	Если ЗначениеЗаполнено(КлиентПоЗагрузкаГИУДСтрока) Тогда 
		КлиентОбъект = КлиентПоЗагрузкаГИУДСтрока.ПолучитьОбъект();
	Иначе	
		КлиентОбъект = Клиенты.СоздатьЭлемент();
		КлиентОбъект.ЗагрузкаГИУДСтрока = ЗагрузкаГИУДСтрока;
	КонецЕсли;
	
	//ЗапросКлиент = Новый Запрос;
	//ЗапросКлиент.Текст = "ВЫБРАТЬ
	//                     |	Клиенты.Ссылка КАК Ссылка
	//                     |ИЗ
	//                     |	Справочник.Клиенты КАК Клиенты
	//                     |ГДЕ
	//                     |	Клиенты.ПометкаУдаления = ЛОЖЬ
	//                     |	И Клиенты.ЭтоГруппа = ЛОЖЬ
	//                     |	И Клиенты.Наименование = &Наименование
	//                     |	И Клиенты.ЗагрузкаГИУДСтрока = """"";
	//
	//ЗапросКлиент.УстановитьПараметр("Наименование", Строка.Наименование);
	//
	//ТЗЗапросКлиент = ЗапросКлиент.Выполнить().Выгрузить();
	//ТЗЗапросКлиентКоличество = ТЗЗапросКлиент.Количество();
	//Если ТЗЗапросКлиентКоличество = 1  Тогда 
	//	КлиентОбъект = ТЗЗапросКлиент[0].Ссылка.ПолучитьОбъект();
	//	КлиентОбъект.ЗагрузкаГИУДСтрока = ЗагрузкаГИУДСтрока; 
	//	КлиентОбъект.Записать();
	//	
	//	Продолжить; 
	//ИначеЕсли ТЗЗапросКлиентКоличество > 1  Тогда 
	//	Продолжить; 
	//КонецЕсли;
		
	//КлиентОбъект = Клиенты.СоздатьЭлемент();
	//КлиентОбъект.ЗагрузкаГИУДСтрока = ЗагрузкаГИУДСтрока;
	
	ЗаполнитьЗначенияКлиент(КлиентОбъект, Строка, МассивИменаПолей, Соединение);
	
	// + Создание группы
	НачальнаяГруппаСоединение = СоединениеПустаяСсылка;
	ГруппаИмяСоединение = "";
	РодительСсылкаСоединение = Строка.Родитель.Ссылка;
	ИмяГруппы(ГруппаИмяСоединение, РодительСсылкаСоединение, НачальнаяГруппаСоединение, СоединениеПустаяСсылка);   
	
	ГруппаИмяПромежуточное = ГруппаИмяСоединение;
	
	//РодительПромежуточное = ПустаяСсылка;
	РодительПромежуточное = КорневойРодитель;
	
	Пока Истина Цикл
		Индекс = СтрНайти(ГруппаИмяПромежуточное, "\");
		Если Индекс = 0 Тогда Прервать; КонецЕсли;
		
		ГруппаНаименование = Лев(ГруппаИмяПромежуточное, Индекс - 1); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
	               |	Клиенты.Ссылка КАК Ссылка,
	               |	Клиенты.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Клиенты КАК Клиенты
	               |ГДЕ
	               |	Клиенты.ЭтоГруппа = ИСТИНА
	               |	И Клиенты.Наименование = &Наименование
	               |	И Клиенты.Родитель = &Родитель";

		Запрос.УстановитьПараметр("Наименование", ГруппаНаименование); 
		Запрос.УстановитьПараметр("Родитель", РодительПромежуточное); 
		
		ТЗГруппы = Запрос.Выполнить().Выгрузить();
		Если ТЗГруппы.Количество() = 0 Тогда
			НоваяГруппа = Справочники.Клиенты.СоздатьГруппу();
			НоваяГруппа.Наименование = ГруппаНаименование;
			НоваяГруппа.Родитель = РодительПромежуточное;
			
			НоваяГруппа.ЗагрузкаГИУДСтрока = Новый УникальныйИдентификатор();
			
			НоваяГруппа.Записать();
			
			РодительПромежуточное = НоваяГруппа.Ссылка;	
		Иначе
			РодительПромежуточное = ТЗГруппы[0].Ссылка;
		КонецЕсли;	
		
		ГруппаИмяПромежуточное = Сред(ГруппаИмяПромежуточное, Индекс + 1);
	КонецЦикла;	
	
	КлиентОбъект.Родитель = РодительПромежуточное; 
	
	КлиентОбъект.КонтактнаяИнформация.Очистить();
	Для Каждого СтрокаКонтактнаяИнформация Из Строка.КонтактнаяИнформация Цикл
		Ссылка = ПереносЗначенияКласификатора("ВидыКонтактнойИнформации", СтрокаКонтактнаяИнформация.ВидКонтактнойИнформации);
		
		НовыйВидКонтактнойИнформации = КлиентОбъект.КонтактнаяИнформация.Добавить();
		НовыйВидКонтактнойИнформации.ВидКонтактнойИнформации = Ссылка; 
		НовыйВидКонтактнойИнформации.Информация = СтрокаКонтактнаяИнформация.Информация; 
	КонецЦикла;	
	
	КлиентОбъект.ПрочаяИнформация.Очистить();
	Для Каждого СтрокаПрочаяИнформация Из Строка.ПрочаяИнформация Цикл
		Ссылка = ПереносЗначенияКласификатора("ВидыИнформации", СтрокаПрочаяИнформация.ВидИнформации);
		
		НовыйВидПрочаяИнформация = КлиентОбъект.ПрочаяИнформация.Добавить();
		НовыйВидПрочаяИнформация.ВидИнформации = Ссылка; 
		НовыйВидПрочаяИнформация.Информация = СтрокаПрочаяИнформация.Информация; 
	КонецЦикла;	
	
// Сканы	
	//ИмяПапкиПриемник = Константы.Папка_C_BASE.Получить();
	//ИмяПапкиПриемник = ИмяПапкиПриемник + "SCAN\"; 

	//Префикс = ЗагрузкаГИУДСтрока;
	//
	//ИмяФайлаПрефикс = ИмяПапкиПриемник + Префикс; 
	//
	//Для Каждого СтрокаСканыДокументов Из Строка.СканыДокументов Цикл
	//	
	//	ПутьДоФото = СтрокаСканыДокументов.ПутьДоФото;
	//	//ПутьДоФото = "C" + Сред(ПутьДоФото, 2, СтрДлина(ПутьДоФото) - 1);
	//	Индекс = СтрНайти(ПутьДоФото, "\", НаправлениеПоиска.СКонца);
	//	Если Индекс = 0 тогда Продолжить; КонецЕсли;
	//	
	//	ИмяФайла = Прав(ПутьДоФото, СтрДлина(ПутьДоФото) - Индекс);
	//	
	//	Если СтрДлина(ИмяФайла) = 0 тогда Продолжить; КонецЕсли;
	//	
	//	ПолноеИмяФайла = ИмяПапкиИсточник + ИмяФайла;
	//	
	//	Файл = Новый Файл(ПолноеИмяФайла);
	//	Если НЕ Файл.Существует() Тогда Продолжить; КонецЕсли;
	//	
	//	ИмяФайлаПриемник = ИмяФайлаПрефикс + "_" + ИмяФайла;
	//	
	//	ОтборСтроки = Новый Структура("ПутьДоФото", ИмяФайлаПриемник);
	//	НайденныеСтроки = КлиентОбъект.СканыДокументов.НайтиСтроки(ОтборСтроки);
	//	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
	//		КлиентОбъект.СканыДокументов.Удалить(НайденнаяСтрока);
	//	КонецЦикла;
	//	
	//	Попытка
	//		КопироватьФайл(ПолноеИмяФайла, ИмяФайлаПриемник);
	//		НетОшибкаКопирования = Истина;
	//	Исключение
	//		Сообщить(ОписаниеОшибки());
	//		НетОшибкаКопирования = Ложь;
	//	КонецПопытки;
	//	
	//	Если НетОшибкаКопирования Тогда
	//		НовыйВидСканыДокументов = КлиентОбъект.СканыДокументов.Добавить();
	//		НовыйВидСканыДокументов.ПутьДоФото = ИмяФайлаПриемник; 
	//		НовыйВидСканыДокументов.Комментарий = СтрокаСканыДокументов.Комментарий; 
	//	КонецЕсли;
	//КонецЦикла;	
//	
	
	Попытка
		КлиентОбъект.Записать();
	Исключение
		//Сообщить(ОписаниеОшибки());		
		АсинхронныеВызовы.ДобавитьСообщениеХодаВыполнения("Ошибка переноса: " + ОписаниеОшибки());
	КонецПопытки;
	
	//Если ш > 1000 Тогда Прервать; КонецЕсли;
КонецЦикла;
	
КонецПроцедуры


//
Процедура ЗагрузитьКлиентовНаСервере(ПутьКФайловойБазе, ИмяПользователя, Пароль) Экспорт
Перем ЗначениеХодаВыполнения, Сч, Объект, СтруктураВозврата; 
ЗначениеХодаВыполнения = Новый Структура("ПроцентВыполнения, КоличествоСозданныхЭлементов", 0, 0);
	
Соединение = ПолучитьПодключениеКФайловойБД(ПутьКФайловойБазе, ИмяПользователя, Пароль);

Запрос = Соединение.NewObject("Запрос");

Запрос.Текст = "ВЫБРАТЬ
|	Клиенты.Ссылка,
|	Клиенты.Родитель,
|	Клиенты.ЭтоГруппа,
|	Клиенты.Код,
|	Клиенты.Наименование,
|	Клиенты.ТипКлиента,
|	Клиенты.Фамилия,
|	Клиенты.Имя,
|	Клиенты.Отчество,
|	Клиенты.Адрес,
|	Клиенты.ИНН,
|	Клиенты.КПП,
|	Клиенты.ВидДокументаУдостоверяющегоЛичность,
|	Клиенты.Серия,
|	Клиенты.Номер,
|	Клиенты.ДатаВыдачи,
|	Клиенты.КемВыдан,
|	Клиенты.АдресРегистрации,
|	Клиенты.ДатаРегистрации,
|	Клиенты.КатегорияВизы,
|	Клиенты.СрокВизыС,
|	Клиенты.СрокВизыПо,
|	Клиенты.ИностранныйГражданин,
|	Клиенты.Страна,
|	Клиенты.Продление,
|	Клиенты.ЦельПриезда,
|	Клиенты.НомерВизы,
|	Клиенты.Пол,
|	Клиенты.ДатаРождения,
|	Клиенты.МестоРождения,
|	Клиенты.ФИО,
|	Клиенты.ЧС,
|	Клиенты.Категория,
|	Клиенты.ОснованиеКатегории,
|	Клиенты.НаименованиеЮрЛица,
|	Клиенты.Телефон,
|	Клиенты.СфераДеятельности,
|	Клиенты.Город,
|	Клиенты.СтранаРождения,
|	Клиенты.ГородРождения,
|	Клиенты.УлицаПроживания,
|	Клиенты.ДомПроживания,
|	Клиенты.КорпусПроживания,
|	Клиенты.КвартираПроживания,
|	Клиенты.СтранаПроживания,
|	Клиенты.ГородПроживания,
|	Клиенты.СерияВизы,
|	Клиенты.МиграционнаяКартаСерия,
|	Клиенты.МиграционнаяКартаНомер,
|	Клиенты.Турагентство,
|	Клиенты.ПроцентАгент_OLD,
|	Клиенты.КодОргана,
|	Клиенты.РайонРождения,
|	Клиенты.РайонПроживания,
|	Клиенты.НасПунктРождения,
|	Клиенты.Гражданство,
|	Клиенты.НасПунктПроживания,
|	Клиенты.Курит,
|	Клиенты.ДатаВъездаВРФ,
|	Клиенты.ЭлПочта,
|	Клиенты.Менеджер,
|	Клиенты.Тариф_НеИспользуется,
|	Клиенты.СтранаРожденияФМС,
|	Клиенты.ТипДокументаФМС,
|	Клиенты.ЦельПриездаФМС,
|	Клиенты.ЦельВъездаФМС,
|	Клиенты.ПунктыВыдачиФМС,
|	Клиенты.ГражданствоФМС,
|	Клиенты.ДатаДействияДокументаФМС,
|	Клиенты.ВидДокументаНаПребываниеФМС,
|	Клиенты.ТипВизыФМС,
|	Клиенты.КратностьВизыФМС,
|	Клиенты.ИдентификаторВизыФМС,
|	Клиенты.ПунктПересеченияГраницыФМС,
|	Клиенты.ДатаВъездаВРФ_ФМС,
|	Клиенты.СрокПребыванияВ_РФ_ФМС,
|	Клиенты.ФамилияПредставителяФМС,
|	Клиенты.ИмяПредставителяФМС,
|	Клиенты.ОтчествоПредставителяФМС,
|	Клиенты.ТипДокументаПредставителяФМС,
|	Клиенты.СерияДокументаПредставителяФМС,
|	Клиенты.НомерДокументаПредставителяФМС,
|	Клиенты.ДатаВыдачиДокументаПредставителя_ФМС,
|	Клиенты.ВидКлиента,
|	Клиенты.ВозможностьИзмененияТарифа,
|	Клиенты.ЖелательныйЭтаж,
|	Клиенты.Завтрак,
|	Клиенты.ДопПринадлежности,
|	Клиенты.ПредпочтительныйНомер,
|	Клиенты.Балкон,
|	Клиенты.ВидИзОкна,
|	Клиенты.Ванна,
|	Клиенты.Иное,
|	Клиенты.ФамилияЛатиницей,
|	Клиенты.ИмяЛатиницей,
|	Клиенты.КонтактнаяИнформация.(
|		Ссылка,
|		НомерСтроки,
|		ВидКонтактнойИнформации,
|		Информация
|	),
|	Клиенты.ПрочаяИнформация.(
|		Ссылка,
|		НомерСтроки,
|		ВидИнформации,
|		Информация
|	),
|	Клиенты.СканыДокументов.(
|		Ссылка,
|		НомерСтроки,
|		ПутьДоФото,
|		Комментарий
|	)
|ИЗ
|	Справочник.Клиенты КАК Клиенты
|ГДЕ
| Клиенты.ПометкаУдаления = ЛОЖЬ
|	И Клиенты.ЭтоГруппа = ЛОЖЬ
|	И НЕ Клиенты.Ссылка В ИЕРАРХИИ (&СписокЗначений)";

//|	И Клиенты.Наименование = ""Белов Сергей Николаевич""

ЗапросСписокРодителей = Соединение.NewObject("Запрос");
ЗапросСписокРодителей.Текст = "ВЫБРАТЬ
                              |	Клиенты.Ссылка КАК Ссылка,
                              |	Клиенты.Наименование КАК Наименование
                              |ИЗ
                              |	Справочник.Клиенты КАК Клиенты
                              |ГДЕ
                              |	Клиенты.ПометкаУдаления = ЛОЖЬ
                              |	И Клиенты.ЭтоГруппа = ИСТИНА
                              |	И Клиенты.Наименование ПОДОБНО &Наименование";

ЗапросСписокРодителей.УстановитьПараметр("Наименование", "###%"); 
ТЗ_ГруппыСоединение = ЗапросСписокРодителей.Выполнить().Выгрузить();

СписокРодителей = Соединение.NewObject("СписокЗначений");
Для Каждого Строка из ТЗ_ГруппыСоединение Цикл 
	СписокРодителей.Добавить(Строка.Ссылка);
КОнецЦикла;

Запрос.УстановитьПараметр("СписокЗначений", СписокРодителей);
ТЗ_КлиентыСоединение = Запрос.Выполнить().Выгрузить(); 
Если ТЗ_КлиентыСоединение.Количество() = 0 Тогда 
	Сообщить("Нет клиентов");
	Возврат; 
КонецЕсли;

КоличествоЭлементов = ТЗ_КлиентыСоединение.Количество();

Клиенты = Справочники.Клиенты;

СоединениеПустаяСсылка = Соединение.Справочники.Клиенты.ПустаяСсылка(); 

ПустаяСсылка = Справочники.Клиенты.ПустаяСсылка(); 

МассивИменаПолей = Новый Массив;
Для Каждого Строка Из ТЗ_КлиентыСоединение.Колонки Цикл
	МассивИменаПолей.Добавить(Строка.Имя);
КонецЦикла;	

ЗапросКорневойРодитель = Новый Запрос("ВЫБРАТЬ
                                      |	Клиенты.Ссылка КАК Ссылка
                                      |ИЗ
                                      |	Справочник.Клиенты КАК Клиенты
                                      |ГДЕ
                                      |	Клиенты.ПометкаУдаления = ЛОЖЬ
                                      |	И Клиенты.ЭтоГруппа = ИСТИНА
                                      |	И Клиенты.Наименование = ""__АРХИВ""");
ТЗКорневойРодитель = ЗапросКорневойРодитель.Выполнить().Выгрузить();
Если ТЗКорневойРодитель.Количество() = 0 Тогда
	КорневойРодительОбъект = Справочники.Клиенты.СоздатьГруппу();
	КорневойРодительОбъект.Наименование = "__АРХИВ";
	КорневойРодительОбъект.ЗагрузкаГИУДСтрока = "*";
	КорневойРодительОбъект.Записать();
	
	КорневойРодитель = КорневойРодительОбъект.Ссылка; 
Иначе
	КорневойРодитель = ТЗКорневойРодитель[0].Ссылка;
КонецЕсли;

//Колонки = ТЗ.Колонки;
ш = 0;
Для Каждого Строка Из ТЗ_КлиентыСоединение Цикл
	//Ход выполнения
	ш = ш + 1;
	ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов = ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов + 1;
	ЗначениеХодаВыполнения.ПроцентВыполнения = Окр(ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов / КоличествоЭлементов * 100);		
	АсинхронныеВызовы.ОбновитьЗначениеХодаВыполнения(ЗначениеХодаВыполнения);
	Если ш%100 = 0 Тогда
		АсинхронныеВызовы.ДобавитьСообщениеХодаВыполнения("Выполнили " + ЗначениеХодаВыполнения.ПроцентВыполнения + "%");
	КонецЕсли;
	
	//Если Строка.Наименование <> "ПЕРЕНОС" Тогда Продолжить; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Строка.Наименование) Тогда Продолжить; КонецЕсли;
	
	ЗагрузкаГИУДСтрока = Соединение.XMLСтрока(Строка.Ссылка);
	КлиентПоЗагрузкаГИУДСтрока = Клиенты.НайтиПоРеквизиту("ЗагрузкаГИУДСтрока", ЗагрузкаГИУДСтрока);
	Если ЗначениеЗаполнено(КлиентПоЗагрузкаГИУДСтрока) Тогда Продолжить; КонецЕсли;
	
	ЗапросКлиент = Новый Запрос;
	ЗапросКлиент.Текст = "ВЫБРАТЬ
	                     |	Клиенты.Ссылка КАК Ссылка
	                     |ИЗ
	                     |	Справочник.Клиенты КАК Клиенты
	                     |ГДЕ
	                     |	Клиенты.ПометкаУдаления = ЛОЖЬ
	                     |	И Клиенты.ЭтоГруппа = ЛОЖЬ
	                     |	И Клиенты.Наименование = &Наименование
	                     |	И Клиенты.ЗагрузкаГИУДСтрока = """"";
	
	ЗапросКлиент.УстановитьПараметр("Наименование", Строка.Наименование);
	
	ТЗЗапросКлиент = ЗапросКлиент.Выполнить().Выгрузить();
	ТЗЗапросКлиентКоличество = ТЗЗапросКлиент.Количество();
	Если ТЗЗапросКлиентКоличество = 1  Тогда 
		КлиентОбъект = ТЗЗапросКлиент[0].Ссылка.ПолучитьОбъект();
		КлиентОбъект.ЗагрузкаГИУДСтрока = ЗагрузкаГИУДСтрока; 
		КлиентОбъект.Записать();
		
		Продолжить; 
	ИначеЕсли ТЗЗапросКлиентКоличество > 1  Тогда 
		Продолжить; 
	КонецЕсли;
		
	КлиентОбъект = Клиенты.СоздатьЭлемент();
	КлиентОбъект.ЗагрузкаГИУДСтрока = ЗагрузкаГИУДСтрока;
	ЗаполнитьЗначенияКлиент(КлиентОбъект, Строка, МассивИменаПолей, Соединение);
	
	// + Создание группы
	НачальнаяГруппаСоединение = СоединениеПустаяСсылка;
	ГруппаИмяСоединение = "";
	РодительСсылкаСоединение = Строка.Родитель.Ссылка;
	ИмяГруппы(ГруппаИмяСоединение, РодительСсылкаСоединение, НачальнаяГруппаСоединение, СоединениеПустаяСсылка);   
	
	ГруппаИмяПромежуточное = ГруппаИмяСоединение;
	
	//РодительПромежуточное = ПустаяСсылка;
	РодительПромежуточное = КорневойРодитель;
	
	Пока Истина Цикл
		Индекс = СтрНайти(ГруппаИмяПромежуточное, "\");
		Если Индекс = 0 Тогда Прервать; КонецЕсли;
		
		ГруппаНаименование = Лев(ГруппаИмяПромежуточное, Индекс - 1); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
	               |	Клиенты.Ссылка КАК Ссылка,
	               |	Клиенты.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Клиенты КАК Клиенты
	               |ГДЕ
	               |	Клиенты.ЭтоГруппа = ИСТИНА
	               |	И Клиенты.Наименование = &Наименование
	               |	И Клиенты.Родитель = &Родитель";

		Запрос.УстановитьПараметр("Наименование", ГруппаНаименование); 
		Запрос.УстановитьПараметр("Родитель", РодительПромежуточное); 
		
		ТЗГруппы = Запрос.Выполнить().Выгрузить();
		Если ТЗГруппы.Количество() = 0 Тогда
			НоваяГруппа = Справочники.Клиенты.СоздатьГруппу();
			НоваяГруппа.Наименование = ГруппаНаименование;
			НоваяГруппа.Родитель = РодительПромежуточное;
			
			НоваяГруппа.ЗагрузкаГИУДСтрока = Новый УникальныйИдентификатор();
			
			НоваяГруппа.Записать();
			
			РодительПромежуточное = НоваяГруппа.Ссылка;	
		Иначе
			РодительПромежуточное = ТЗГруппы[0].Ссылка;
		КонецЕсли;	
		
		ГруппаИмяПромежуточное = Сред(ГруппаИмяПромежуточное, Индекс + 1);
	КонецЦикла;	
	
	КлиентОбъект.Родитель = РодительПромежуточное; 
	
	КлиентОбъект.КонтактнаяИнформация.Очистить();
	Для Каждого СтрокаКонтактнаяИнформация Из Строка.КонтактнаяИнформация Цикл
		Ссылка = ПереносЗначенияКласификатора("ВидыКонтактнойИнформации", СтрокаКонтактнаяИнформация.ВидКонтактнойИнформации);
		
		НовыйВидКонтактнойИнформации = КлиентОбъект.КонтактнаяИнформация.Добавить();
		НовыйВидКонтактнойИнформации.ВидКонтактнойИнформации = Ссылка; 
		НовыйВидКонтактнойИнформации.Информация = СтрокаКонтактнаяИнформация.Информация; 
	КонецЦикла;	
	
	КлиентОбъект.ПрочаяИнформация.Очистить();
	Для Каждого СтрокаПрочаяИнформация Из Строка.ПрочаяИнформация Цикл
		Ссылка = ПереносЗначенияКласификатора("ВидыИнформации", СтрокаПрочаяИнформация.ВидИнформации);
		
		НовыйВидПрочаяИнформация = КлиентОбъект.ПрочаяИнформация.Добавить();
		НовыйВидПрочаяИнформация.ВидИнформации = Ссылка; 
		НовыйВидПрочаяИнформация.Информация = СтрокаПрочаяИнформация.Информация; 
	КонецЦикла;	
	
// Сканы	
	//ИмяПапкиПриемник = Константы.Папка_C_BASE.Получить();
	//ИмяПапкиПриемник = ИмяПапкиПриемник + "SCAN\"; 

	//Префикс = ЗагрузкаГИУДСтрока;
	//
	//ИмяФайлаПрефикс = ИмяПапкиПриемник + Префикс; 
	//
	//Для Каждого СтрокаСканыДокументов Из Строка.СканыДокументов Цикл
	//	
	//	ПутьДоФото = СтрокаСканыДокументов.ПутьДоФото;
	//	//ПутьДоФото = "C" + Сред(ПутьДоФото, 2, СтрДлина(ПутьДоФото) - 1);
	//	Индекс = СтрНайти(ПутьДоФото, "\", НаправлениеПоиска.СКонца);
	//	Если Индекс = 0 тогда Продолжить; КонецЕсли;
	//	
	//	ИмяФайла = Прав(ПутьДоФото, СтрДлина(ПутьДоФото) - Индекс);
	//	
	//	Если СтрДлина(ИмяФайла) = 0 тогда Продолжить; КонецЕсли;
	//	
	//	ПолноеИмяФайла = ИмяПапкиИсточник + ИмяФайла;
	//	
	//	Файл = Новый Файл(ПолноеИмяФайла);
	//	Если НЕ Файл.Существует() Тогда Продолжить; КонецЕсли;
	//	
	//	ИмяФайлаПриемник = ИмяФайлаПрефикс + "_" + ИмяФайла;
	//	
	//	ОтборСтроки = Новый Структура("ПутьДоФото", ИмяФайлаПриемник);
	//	НайденныеСтроки = КлиентОбъект.СканыДокументов.НайтиСтроки(ОтборСтроки);
	//	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
	//		КлиентОбъект.СканыДокументов.Удалить(НайденнаяСтрока);
	//	КонецЦикла;
	//	
	//	Попытка
	//		КопироватьФайл(ПолноеИмяФайла, ИмяФайлаПриемник);
	//		НетОшибкаКопирования = Истина;
	//	Исключение
	//		Сообщить(ОписаниеОшибки());
	//		НетОшибкаКопирования = Ложь;
	//	КонецПопытки;
	//	
	//	Если НетОшибкаКопирования Тогда
	//		НовыйВидСканыДокументов = КлиентОбъект.СканыДокументов.Добавить();
	//		НовыйВидСканыДокументов.ПутьДоФото = ИмяФайлаПриемник; 
	//		НовыйВидСканыДокументов.Комментарий = СтрокаСканыДокументов.Комментарий; 
	//	КонецЕсли;
	//КонецЦикла;	
//	
	
	Попытка
		КлиентОбъект.Записать();
	Исключение
		//Сообщить(ОписаниеОшибки());		
		АсинхронныеВызовы.ДобавитьСообщениеХодаВыполнения("Ошибка переноса: " + ОписаниеОшибки());
	КонецПопытки;
	
	//Если ш > 1000 Тогда Прервать; КонецЕсли;
КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПодключениеКФайловойБД(ПутьКФайловойБазе, ИмяПользователя, Пароль)
//Параметры = "File=""C:\1CBase"";Usr=""login"";Pwd=""password"";";

ПараметрыСоединения = "File=""" + ПутьКФайловойБазе + """;Usr=""" + ИмяПользователя + """;Pwd=""" + Пароль + """;";

COMConnector= Новый COMОбъект("V83.COMConnector");
Попытка
Возврат COMConnector.Connect(ПараметрыСоединения);
Исключение
Сообщить("Ошибка подключения! " + ОписаниеОшибки() );
Возврат Неопределено;
КонецПопытки;

КонецФункции

Процедура ЗаполнитьЗначенияКлиент(Получатель, Источник, МассивИменаПолей, Соединение)
	
Для Каждого Имя Из МассивИменаПолей Цикл
	Если Имя = "Ссылка" 
	ИЛИ Имя = "Родитель" 
	//ИЛИ Имя = "РодительНаименование" 
	ИЛИ Имя = "ЭтоГруппа" 
	ИЛИ Имя = "Код" 
	
	ИЛИ Имя = "ВидДокументаУдостоверяющегоЛичность" 
	ИЛИ Имя = "АдресРегистрации" 
	
	ИЛИ Имя = "КатегорияВизы" 
	ИЛИ Имя = "СрокВизыС" 
	ИЛИ Имя = "СрокВизыПо" 
	
	ИЛИ Имя = "Страна" 
	
	ИЛИ Имя = "Продление" 
	ИЛИ Имя = "ЦельПриезда" 
	ИЛИ Имя = "НомерВизы" 
	
	ИЛИ Имя = "МестоРождения" 
	
	ИЛИ Имя = "СтранаРождения" 
	ИЛИ Имя = "СтранаПроживания" 
	
	ИЛИ Имя = "СерияВизы" 
	ИЛИ Имя = "МиграционнаяКартаСерия" 
	ИЛИ Имя = "МиграционнаяКартаНомер" 
	
	ИЛИ Имя = "Гражданство" 
	
	ИЛИ Имя = "ДатаВъездаВРФ" 
	ИЛИ Имя = "Менеджер" 
	ИЛИ Имя = "Тариф_НеИспользуется"
	
	ИЛИ Имя = "СтранаРожденияФМС"
	ИЛИ Имя = "ТипДокументаФМС"
	ИЛИ Имя = "ЦельПриездаФМС"
	ИЛИ Имя = "ЦельВъездаФМС"
	ИЛИ Имя = "ПунктыВыдачиФМС"
	ИЛИ Имя = "ГражданствоФМС"
	ИЛИ Имя = "ДатаДействияДокументаФМС"
	ИЛИ Имя = "ВидДокументаНаПребываниеФМС"
	ИЛИ Имя = "ТипВизыФМС"
	ИЛИ Имя = "КратностьВизыФМС"
	ИЛИ Имя = "ИдентификаторВизыФМС"
	ИЛИ Имя = "ПунктПересеченияГраницыФМС"
	ИЛИ Имя = "ДатаВъездаВРФ_ФМС"
	ИЛИ Имя = "СрокПребыванияВ_РФ_ФМС"
	ИЛИ Имя = "ФамилияПредставителяФМС"
	ИЛИ Имя = "ИмяПредставителяФМС"
	ИЛИ Имя = "ОтчествоПредставителяФМС"
	ИЛИ Имя = "ТипДокументаПредставителяФМС"
	ИЛИ Имя = "СерияДокументаПредставителяФМС"
	ИЛИ Имя = "НомерДокументаПредставителяФМС"
	ИЛИ Имя = "ДатаВыдачиДокументаПредставителя_ФМС"
	
	ИЛИ Имя = "ВозможностьИзмененияТарифа"
	
	Тогда Продолжить; КонецЕсли;	
	
	Значение = Источник[Имя];
	Если ТипЗнч(Значение) = Тип("COMОбъект") Тогда
		Если Имя = "ТипКлиента" тогда
			ИмяЗначениеПеречисления = ИмяЗначенияПеречисление(Соединение, Значение);
			
			Если ИмяЗначениеПеречисления <> "" Тогда 
				Попытка
					Получатель[Имя] = Перечисления.ТипыКлиентов[ИмяЗначениеПеречисления];
				Исключение
				КонецПопытки;	
			КонецЕсли;			
		
		ИначеЕсли Имя = "Пол" тогда
			ИмяЗначениеПеречисления = ИмяЗначенияПеречисление(Соединение, Значение);
			
			Если ИмяЗначениеПеречисления <> "" Тогда 
				Попытка
					Получатель[Имя] = Перечисления.Пол[ИмяЗначениеПеречисления];
				Исключение
				КонецПопытки;	
			КонецЕсли;
			
		ИначеЕсли Имя = "Категория" тогда
			Получатель[Имя] = ПереносЗначенияКатегория(Значение);
			
		ИначеЕсли Имя = "ВидКлиента" тогда
			Получатель[Имя] = ПереносЗначенияКласификатора("ВидыКлиентов", Значение);
			
		ИначеЕсли Имя = "Город" тогда
			Получатель[Имя] = ПереносЗначенияКласификатора("Города", Значение);
			
		//ИначеЕсли Имя = "ПредпочтительныйНомер" тогда
		//	Получатель.ПредпочтительныйНомер = Источник[Имя].Наименование;
			
		////ИначеЕсли Имя = "АдресРегистрации_НеИспользуется" тогда
		////	Получатель[Имя] = ПереносЗначенияАдресРегистрации(Значение);
		//	
		//ИначеЕсли Имя = "МестоРождения_НеИспользуется" тогда
		//	Получатель[Имя] = ПереносЗначенияАдресРегистрации(Значение);
		//	
		//ИначеЕсли Имя = "ПребываниеВидДокументаФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ТипДокументаФМС_OLD", Значение);
		//	
		//ИначеЕсли Имя = "ВидДокументаУдостоверяющегоЛичность_НеИспользуется" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ВидыДокументов", Значение);
		//	
		////ИначеЕсли Имя = "ВидКлиента" тогда
		////	Получатель[Имя] = ПереносЗначенияКласификатора("ВидыКлиентов", Значение);
			
		////ИначеЕсли Имя = "Город" тогда
		////	Получатель[Имя] = ПереносЗначенияКласификатора("Города", Значение);
		//	
		//ИначеЕсли Имя = "ГражданствоФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("СтраныФМС", Значение);
			
		////ИначеЕсли Имя = "Категория" тогда
		////	Получатель[Имя] = ПереносЗначенияКатегория(Значение);
		//	
		//ИначеЕсли Имя = "КатегорияВизы" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("КатегорииВизы", Значение);
		//	
		//ИначеЕсли Имя = "КратностьВизыФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("КратностьВизыФМС_OLD", Значение);
		//	
		//ИначеЕсли Имя = "КратностьВизыФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("КратностьВизыФМС_OLD", Значение);
	
		//ИначеЕсли Имя = "Менеджер" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("Пользователи", Значение.Description);
			
		//ИначеЕсли Имя = "Пол" тогда
		//	ИмяЗначениеПеречисления = ИмяЗначенияПеречисление(Соединение, Значение);
		//	
		//	Если ИмяЗначениеПеречисления <> "" Тогда 
		//		Попытка
		//			Получатель[Имя] = Перечисления.Пол[ИмяЗначениеПеречисления];
		//		Исключение
		//		КонецПопытки;	
		//	КонецЕсли;			
			
		//ИначеЕсли Имя = "ПунктПересеченияГраницыФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ПунктПересеченияГраницыФМС_OLD", Значение);
		//	
		//ИначеЕсли Имя = "ПунктыВыдачиФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ПунктыВыдачиФМС_OLD", Значение);
		//	
		//ИначеЕсли Имя = "Страна_НеИспользуется" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("Страны", Значение);
		//	
		//ИначеЕсли Имя = "РождениеСтранаФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("СтраныФМС", Значение);
		//	
		//ИначеЕсли Имя = "ТипВизыФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ТипВизыФМС_OLD", Значение);
		//	
		//ИначеЕсли Имя = "ТипДокументаПредставителяФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ТипДокументаФМС_OLD", Значение);
		//	
		//ИначеЕсли Имя = "ТипДокументаФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ТипДокументаФМС_OLD", Значение);
			
		//ИначеЕсли Имя = "ТипКлиента" тогда
		//	ИмяЗначениеПеречисления = ИмяЗначенияПеречисление(Соединение, Значение);
		//	
		//	Если ИмяЗначениеПеречисления <> "" Тогда 
		//		Попытка
		//			Получатель[Имя] = Перечисления.ТипыКлиентов[ИмяЗначениеПеречисления];
		//		Исключение
		//		КонецПопытки;	
		//	КонецЕсли;	
			
		//ИначеЕсли Имя = "ЦельВъездаФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ЦелиВъездаФМС", Значение);
		//	
		//ИначеЕсли Имя = "ЦельПриезда" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ЦелиПриезда_НеИспользуется", Значение);
		//	
		//ИначеЕсли Имя = "ЦельПоездкиФМС_OLD" тогда
		//	Получатель[Имя] = ПереносЗначенияКласификатора("ЦелиПриездаФМС", Значение);
			
		КонецЕсли;
	Иначе
		Если Имя = "ГородРождения" тогда
			Получатель.РождениеГород = Источник[Имя];
			
		ИначеЕсли Имя = "УлицаПроживания" тогда
			Получатель.ПроживаниеУлица = Источник[Имя];
				
		ИначеЕсли Имя = "ДомПроживания" тогда
			Получатель.ПроживаниеДом = Источник[Имя];
			
		ИначеЕсли Имя = "КорпусПроживания" тогда
			Получатель.ПроживаниеКорпус = Источник[Имя];
			
		ИначеЕсли Имя = "КвартираПроживания" тогда
			Получатель.ПроживаниеКвартира = Источник[Имя];
			
		ИначеЕсли Имя = "ГородПроживания" тогда
			Получатель.ПроживаниеГород = Источник[Имя];
			
		ИначеЕсли Имя = "ПроцентАгент_OLD" тогда
			Получатель[Имя] = Источник[Имя];
			Получатель.ПроцентКомиссии = Источник[Имя]; 
			
		ИначеЕсли Имя = "РайонРождения" тогда
			Получатель.РождениеРайон = Источник[Имя];
			
		ИначеЕсли Имя = "РайонПроживания" тогда
			Получатель.ПроживаниеРайон = Источник[Имя];
			
		ИначеЕсли Имя = "НасПунктРождения" тогда
			Получатель.РождениеНасПункт = Источник[Имя];
			
		ИначеЕсли Имя = "НасПунктПроживания" тогда
			Получатель.ПроживаниеНасПункт = Источник[Имя];
			
		Иначе
			Получатель[Имя] = Источник[Имя];
		КонецЕсли;		
	КонецЕсли;   
КонецЦикла;
КонецПроцедуры	

Функция ПереносЗначенияКласификатора(ИмяСправочника, Значение)
Наименование = Значение.Description;	 
Если СокрЛП(Наименование) = "" Тогда Возврат Неопределено; КонецЕсли;	
	
Справочник = Справочники[ИмяСправочника];	
Ссылка = Справочник.НайтиПоНаименованию(Наименование, Истина); 	
Если ЗначениеЗаполнено(Ссылка) Тогда Возврат Ссылка; КонецЕсли;

НовыйЭлемент = Справочник.СоздатьЭлемент();
НовыйЭлемент.Наименование = Наименование;

//НовыйЭлемент.Записать();
Возврат НовыйЭлемент.Ссылка; 
КонецФункции

Функция ПереносЗначенияКатегория(Значение)
Скидка = Значение.Скидка;
Если Скидка = 0 Тогда Возврат Неопределено; КонецЕсли;	

Справочник = Справочники.КатегорииКлиентов;
Ссылка = Справочник.НайтиПоРеквизиту("Скидка", Скидка);	
Если ЗначениеЗаполнено(Ссылка) Тогда Возврат Ссылка; КонецЕсли;

НовыйЭлемент = Справочник.СоздатьЭлемент();
НовыйЭлемент.Наименование = Значение.Description;
НовыйЭлемент.Скидка = Скидка;

//НовыйЭлемент.Записать();
Возврат НовыйЭлемент.Ссылка; 
КонецФункции

Функция ПереносЗначенияАдресРегистрации(Значение)
Наименование = Значение.Description;	
Если СокрЛП(Наименование) = "" Тогда Возврат Неопределено; КонецЕсли;	

Справочник = Справочники.Адреса;
Ссылка = Справочник.НайтиПоНаименованию(Наименование, Истина);
Если ЗначениеЗаполнено(Ссылка) Тогда Возврат Ссылка; КонецЕсли;

МассивИменаПолей = Новый Массив;
МассивИменаПолей.Добавить("Страна_НеИспользуется");
МассивИменаПолей.Добавить("Город");
МассивИменаПолей.Добавить("Адрес");
МассивИменаПолей.Добавить("Примечание");
МассивИменаПолей.Добавить("Район");
МассивИменаПолей.Добавить("Область");
МассивИменаПолей.Добавить("Дом");
МассивИменаПолей.Добавить("Квартира");
МассивИменаПолей.Добавить("Улица");
МассивИменаПолей.Добавить("ПолныйАдрес");

НовыйЭлемент = Справочник.СоздатьЭлемент();
НовыйЭлемент.Наименование = Значение.Description;
ЗаполнитьЗначенияАдрес(НовыйЭлемент, Значение, МассивИменаПолей);

//НовыйЭлемент.Записать();
Возврат НовыйЭлемент.Ссылка; 
КонецФункции

Процедура ЗаполнитьЗначенияАдрес(Получатель, Источник, МассивИменаПолей)
	
Для Каждого Имя Из МассивИменаПолей Цикл
	//Если Имя = "Ссылка" 
	//ИЛИ Имя = "Родитель" 
	//Тогда Продолжить; КонецЕсли;	
	
	Значение = Источник[Имя];
	Если ТипЗнч(Значение) = Тип("COMОбъект") Тогда
		Если Имя = "Страна_НеИспользуется" тогда
			Получатель[Имя] = ПереносЗначенияКласификатора("Страны", Значение);
			
		ИначеЕсли Имя = "Город" тогда
			Получатель[Имя] = ПереносЗначенияКласификатора("Города", Значение);
			
		ИначеЕсли Имя = "Район" тогда
			Получатель[Имя] = ПереносЗначенияКласификатора("Районы", Значение);
			
		ИначеЕсли Имя = "Область" тогда
			Получатель[Имя] = ПереносЗначенияКласификатора("Области", Значение);
			
		ИначеЕсли Имя = "Улица" тогда
			Получатель[Имя] = ПереносЗначенияКласификатора("Улицы", Значение);
		КонецЕсли;
	Иначе	
		Получатель[Имя] = Источник[Имя];
	КонецЕсли;   
КонецЦикла;
КонецПроцедуры	

Функция ИмяЗначенияПеречисление(Соединение, Значение) Экспорт
Если Значение.Пустая() Тогда Возврат ""; КонецЕсли;
     
//получаем как названо перечисление в конфигураторе
ИмяПеречисления = Значение.Метаданные().Имя;

//теперь получим индекс где хранится то что нам надо
НужныйИндекс = Соединение.Перечисления[ИмяПеречисления].Индекс(Значение);

//и вот счастье. то что нам надо - идентификатор!!! всего-то четыре строчки кода
//ИмяЗначения = Соединение.Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[НужныйИндекс].Имя;     
ЗначенияПеречисления = Соединение.Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления;
Индекс = 0;
Для Каждого ЗначениеПеречисления Из ЗначенияПеречисления Цикл
	Если Индекс = НужныйИндекс Тогда  Возврат ЗначениеПеречисления.Имя;	КонецЕсли;
	Индекс = Индекс + 1;
КонецЦикла;	

Возврат "";     
КонецФункции

Функция СоздатьГруппуКлиентов(РодительСсылка, НачальныйРодитель , СоединениеПустаяСсылка)
ГруппаИмя = "";	
ИмяГруппы(ГруппаИмя, РодительСсылка, НачальныйРодитель, СоединениеПустаяСсылка);

ГруппаИмяПромежуточное = ГруппаИмя;

//ТекущийРодитель = Справочники.Клиенты.ПустаяСсылка();
ТекущийРодитель = НачальныйРодитель;
Пока Истина Цикл
	Индекс = СтрНайти(ГруппаИмяПромежуточное, "\");
	Если Индекс = 0 Тогда Прервать; КонецЕсли;
	
	ГруппаНаименование = Лев(ГруппаИмяПромежуточное, Индекс - 1); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
               |	Клиенты.Ссылка КАК Ссылка,
               |	Клиенты.Наименование КАК Наименование
               |ИЗ
               |	Справочник.Клиенты КАК Клиенты
               |ГДЕ
               |	Клиенты.ЭтоГруппа = ИСТИНА
               |	И Клиенты.Наименование = &Наименование
               |	И Клиенты.Родитель = &Родитель";

	Запрос.УстановитьПараметр("Наименование", ГруппаНаименование); 
	Запрос.УстановитьПараметр("Родитель", ТекущийРодитель); 
	
	ТЗГруппы = Запрос.Выполнить().Выгрузить();
	Если ТЗГруппы.Количество() = 0 Тогда
		НоваяГруппа = Справочники.Клиенты.СоздатьГруппу();
		НоваяГруппа.Наименование = ГруппаНаименование;
		НоваяГруппа.Родитель = ТекущийРодитель;
		НоваяГруппа.Записать();
		
		ТекущийРодитель = НоваяГруппа.Ссылка;	
	Иначе
		ТекущийРодитель = ТЗГруппы[0].Ссылка;
	КонецЕсли;	
	
	ГруппаИмяПромежуточное = Сред(ГруппаИмяПромежуточное, Индекс + 1);
КонецЦикла;	
КонецФункции	

Процедура ИмяГруппы(ГруппаИмя, Группа, НачальнаяГруппа, ПустаяСсылка)
Если Группа = ПустаяСсылка Тогда Возврат; КонецЕсли;
Если Группа = НачальнаяГруппа Тогда Возврат; КонецЕсли;

ГруппаИмя = Группа.Наименование + "\" + ГруппаИмя;

Группа = Группа.Родитель;

ИмяГруппы(ГруппаИмя, Группа, НачальнаяГруппа, ПустаяСсылка);		
КонецПроцедуры
//

//
Процедура ЗагрузитьИсториюКлиентовНаСервере(ПутьКФайловойБазе, ИмяПользователя, Пароль, РезервС, РезервПо) Экспорт
Перем ЗначениеХодаВыполнения, Сч, Объект, СтруктураВозврата; 
ЗначениеХодаВыполнения = Новый Структура("ПроцентВыполнения, КоличествоСозданныхЭлементов", 0, 0);

Соединение = ПолучитьПодключениеКФайловойБД(ПутьКФайловойБазе, ИмяПользователя, Пароль);

Запрос = Соединение.NewObject("Запрос");
Запрос.Текст = "ВЫБРАТЬ
|	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
|	ЗаявкаНаБронирование.Клиент КАК Клиент,
|	ЗаявкаНаБронирование.Дата КАК Дата,
|	ЗаявкаНаБронирование.РезервС КАК РезервС,
|	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
|	ЗаявкаНаБронирование.НомерВРезерв.Наименование КАК НомерВРезервНаименование,
|	ЗаявкаНаБронирование.Статус КАК Статус,
|	ЗаявкаНаБронирование.ДопПожелания.(
|		Ссылка КАК Ссылка,
|		НомерСтроки КАК НомерСтроки,
|		Информация КАК Информация,
|		ВидИнформации КАК ВидИнформации
|	) КАК ДопПожелания
|ИЗ
|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
|ГДЕ
|	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
|	И ЗаявкаНаБронирование.РезервПо < &РезервПо
|	И ЗаявкаНаБронирование.РезервС > &РезервС
|	И ЗаявкаНаБронирование.РезервПо <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";	

//|	И ЗаявкаНаБронирование.Клиент.Наименование = ""Ardeleanu Serban""
	
Запрос.УстановитьПараметр("РезервПо", РезервПо); 
Запрос.УстановитьПараметр("РезервС", РезервС); 

ТЗ = Запрос.Выполнить().Выгрузить();
ш = 0; 
КоличествоЭлементов = ТЗ.Количество(); 
Для Каждого Строка Из ТЗ Цикл
	ш = ш + 1;
	ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов = ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов + 1;
	ЗначениеХодаВыполнения.ПроцентВыполнения = Окр(ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов / КоличествоЭлементов * 100);		
	АсинхронныеВызовы.ОбновитьЗначениеХодаВыполнения(ЗначениеХодаВыполнения);
	Если ш%100 = 0 Тогда
		АсинхронныеВызовы.ДобавитьСообщениеХодаВыполнения("Выполнили " + ЗначениеХодаВыполнения.ПроцентВыполнения + "%");
	КонецЕсли;
	
	ДобавитьИсториюКлиента(Строка, Соединение);	
КонецЦикла;
КонецПроцедуры

Процедура ДобавитьИсториюКлиента(Строка, Соединение)  
КлиентЗагрузкаГИУДСтрока = Соединение.XMLСтрока(Строка.Клиент.Ссылка);
Клиент = Справочники.Клиенты.НайтиПоРеквизиту("ЗагрузкаГИУДСтрока", КлиентЗагрузкаГИУДСтрока);

Если НЕ ЗначениеЗаполнено(Клиент) Тогда Возврат; КонецЕсли;
	
ИсторияКлиента = РегистрыСведений.ИсторияКлиента.СоздатьНаборЗаписей();

ЗаявкаГУИДСтрока = Соединение.XMLСтрока(Строка.Ссылка);
ЗаявкаГУИД = Новый УникальныйИдентификатор(ЗаявкаГУИДСтрока);

//ИсторияКлиента.Отбор.Клиент.Установить(Клиент);
//ИсторияКлиента.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);

ИсторияКлиента.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);
Для Каждого Строка Из ИсторияКлиента Цикл
	ИсторияКлиента.Удалить(Строка);
КонецЦикла;
	
НоваяЗапись = ИсторияКлиента.Добавить();

НоваяЗапись.Клиент = Клиент;
НоваяЗапись.ЗаявкаГУИД = ЗаявкаГУИД;

НоваяЗапись.ДатаЗаявки = Строка.Дата;
НоваяЗапись.РезервС = Строка.РезервС;
НоваяЗапись.РезервПо = Строка.РезервПо;
НоваяЗапись.НомерВРезерв = Строка.НомерВРезервНаименование;

ИмяЗначениеПеречисления = ИмяЗначенияПеречисление(Соединение, Строка.Статус);
Если ИмяЗначениеПеречисления <> "" Тогда 
	Попытка
		НоваяЗапись.Статус  = Перечисления.СтатусБрони[ИмяЗначениеПеречисления];
	Исключение
	КонецПопытки;	
КонецЕсли;	
	
ИсторияКлиента.Записать(Истина);
	
ИсторияКлиентаДопПожелания = РегистрыСведений.ИсторияКлиентаДопПожелания.СоздатьНаборЗаписей();
//ИсторияКлиентаДопПожелания.Отбор.Клиент.Установить(Клиент);
//ИсторияКлиентаДопПожелания.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);

ИсторияКлиентаДопПожелания.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);
Для Каждого Строка Из ИсторияКлиентаДопПожелания Цикл
	ИсторияКлиентаДопПожелания.Удалить(Строка);
КонецЦикла;

Индекс = 1;
Для Каждого СтрокаДопПожелания Из Строка.ДопПожелания Цикл
	НоваяЗапись = ИсторияКлиентаДопПожелания.Добавить();
	
	НоваяЗапись.Клиент = Клиент;
	НоваяЗапись.ЗаявкаГУИД = ЗаявкаГУИД;
	НоваяЗапись.ДопПожеланияИндекс = Индекс;

	НоваяЗапись.РезервС = Строка.РезервС;
	НоваяЗапись.РезервПо = Строка.РезервПо;;
	НоваяЗапись.ДатаРегистрации = Строка.РезервС;
	
	НоваяЗапись.ВидИнформации = СтрокаДопПожелания.ВидИнформации.Наименование;
	НоваяЗапись.Информация = СтрокаДопПожелания.Информация;
	
	Индекс = Индекс + 1;	
КонецЦикла;

ИсторияКлиентаДопПожелания.Записать(Истина);
КонецПроцедуры
//

//
Процедура ЗагрузитьЗаявкиНаСервере(ПутьКФайловойБазе, ИмяПользователя, Пароль, РезервС, ПапкаГости) Экспорт
	Перем ЗначениеХодаВыполнения, Сч, Объект, СтруктураВозврата; 
	ЗначениеХодаВыполнения = Новый Структура("ПроцентВыполнения, КоличествоСозданныхЭлементов", 0, 0);
	
Соединение = ПолучитьПодключениеКФайловойБД(ПутьКФайловойБазе, ИмяПользователя, Пароль);

Запрос = Соединение.NewObject("Запрос");

Запрос.Текст = "ВЫБРАТЬ
|	ЗаявкаНаБронирование.Ссылка,
|	ЗаявкаНаБронирование.Дата,
|	ЗаявкаНаБронирование.Клиент,
|	ЗаявкаНаБронирование.РезервС,
|	ЗаявкаНаБронирование.РезервПо,
|	ЗаявкаНаБронирование.НомерВРезерв,
|	ЗаявкаНаБронирование.ВремяЗаезда,
|	ЗаявкаНаБронирование.ВремяВыезда,
|	ЗаявкаНаБронирование.КатегорияНомера,
|	ЗаявкаНаБронирование.Статус,
|	ЗаявкаНаБронирование.СвернутьВСчете,
|	ЗаявкаНаБронирование.КолВоЧеловек,
|	ЗаявкаНаБронирование.Бронирует,
|	ЗаявкаНаБронирование.Оплачивает,
|	ЗаявкаНаБронирование.ВСчет,
|	ЗаявкаНаБронирование.Клиент2,
|	ЗаявкаНаБронирование.ДатаАннуляции,
|	ЗаявкаНаБронирование.РаздельныеКровати,
|	ЗаявкаНаБронирование.РазделитьСчет,
|	ЗаявкаНаБронирование.ЦветR,
|	ЗаявкаНаБронирование.ЦветG,
|	ЗаявкаНаБронирование.ЦветB,
|	ЗаявкаНаБронирование.Источник,
|	ЗаявкаНаБронирование.БезЗавтрака,
|	ЗаявкаНаБронирование.НовыйРассчет,
|	ЗаявкаНаБронирование.Примечание,
|	ЗаявкаНаБронирование.ДопУслуги.(
|		Ссылка,
|		НомерСтроки,
|		Услуга,
|		Цена,
|		КолВо,
|		Оплачено,
|		ВСчет,
|		ДатаУслуги,
|		ОтГорничной,
|		ВремяУборки
|	),
|	ЗаявкаНаБронирование.ДопПожелания.(
|		Ссылка,
|		НомерСтроки,
|		Информация,
|		ВидИнформации
|	)
|ИЗ
|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
|ГДЕ
|	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
|	И ЗаявкаНаБронирование.РезервС > &РезервС";


Запрос.УстановитьПараметр("РезервС", РезервС);
ТЗ_ЗаявкиСоединение = Запрос.Выполнить().Выгрузить(); 
Если ТЗ_ЗаявкиСоединение.Количество() = 0 Тогда 
	Сообщить("Нет Заявок");
	Возврат; 
КонецЕсли;

КоличествоЭлементов = ТЗ_ЗаявкиСоединение.Количество();

//Клиенты = Справочники.Клиенты;

СоединениеКлиентПустаяСсылка = Соединение.Справочники.Клиенты.ПустаяСсылка(); 

//ПустаяСсылка = Справочники.Клиенты.ПустаяСсылка(); 

МассивИменаПолей = Новый Массив;
Для Каждого Строка Из ТЗ_ЗаявкиСоединение.Колонки Цикл
	МассивИменаПолей.Добавить(Строка.Имя);
КонецЦикла;	

ш = 0;
Для Каждого Строка Из ТЗ_ЗаявкиСоединение Цикл
	//Ход выполнения
	ш = ш + 1;
	ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов = ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов + 1;
	ЗначениеХодаВыполнения.ПроцентВыполнения = Окр(ЗначениеХодаВыполнения.КоличествоСозданныхЭлементов / КоличествоЭлементов * 100);		
	АсинхронныеВызовы.ОбновитьЗначениеХодаВыполнения(ЗначениеХодаВыполнения);
	Если ш%100 = 0 Тогда
		АсинхронныеВызовы.ДобавитьСообщениеХодаВыполнения("Выполнили " + ЗначениеХодаВыполнения.ПроцентВыполнения + "%");
	КонецЕсли;
	
	ЗагрузкаГИУДСтрока = Соединение.XMLСтрока(Строка.Ссылка);
	ЗаявкаЗагрузкаГИУДСтрока = Документы.ЗаявкаНаБронирование.НайтиПоРеквизиту("ЗагрузкаГИУДСтрока", ЗагрузкаГИУДСтрока);
	Если ЗначениеЗаполнено(ЗаявкаЗагрузкаГИУДСтрока) Тогда 
		ЗаявкаОбъект = ЗаявкаЗагрузкаГИУДСтрока.ПолучитьОбъект();
	Иначе
		ЗаявкаОбъект = Документы.ЗаявкаНаБронирование.СоздатьДокумент();
		ЗаявкаОбъект.ЗагрузкаГИУДСтрока = ЗагрузкаГИУДСтрока;
	КонецЕсли;
		
	//КлиентОбъект = Клиенты.СоздатьЭлемент();
	//КлиентОбъект.ЗагрузкаГИУДСтрока = ЗагрузкаГИУДСтрока;
	ЗаполнитьЗначенияЗаявка(ЗаявкаОбъект, Строка, МассивИменаПолей, Соединение, ПапкаГости);
	
	ЗаявкаОбъект.ДопУслуги.Очистить();
	Для Каждого СтрокаДопУслуги Из Строка.ДопУслуги Цикл
		НовыйДопУслуги = ЗаявкаОбъект.ДопУслуги.Добавить();
		
		НовыйДопУслуги.ГУИД = Новый УникальныйИдентификатор;
		
		СсылкаУслуга = ПереносЗначенияКласификатора("ДопУслуги", СтрокаДопУслуги.Услуга);
		НовыйДопУслуги.Услуга = СсылкаУслуга; 
		
		НовыйДопУслуги.Цена = СтрокаДопУслуги.Цена; 
		НовыйДопУслуги.Количество = СтрокаДопУслуги.КолВо; 
		НовыйДопУслуги.ВСчет = СтрокаДопУслуги.ВСчет; 
		НовыйДопУслуги.ДатаУслуги = СтрокаДопУслуги.ДатаУслуги; 
		НовыйДопУслуги.ОтГорничной = СтрокаДопУслуги.ОтГорничной; 
	КонецЦикла;	
	
	ЗаявкаОбъект.ДопПожелания.Очистить();
	Для Каждого СтрокаДопПожелания Из Строка.ДопПожелания Цикл
		НовыйДопПожелания = ЗаявкаОбъект.ДопПожелания.Добавить();
		Ссылка = ПереносЗначенияКласификатора("ВидыИнформации", СтрокаДопПожелания.ВидИнформации);
		
		НовыйДопПожелания.ВидИнформации = Ссылка; 
		НовыйДопПожелания.Информация = СтрокаДопПожелания.Информация; 
	КонецЦикла;	
	
	Попытка
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//Сообщить(ОписаниеОшибки());		
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
		АсинхронныеВызовы.ДобавитьСообщениеХодаВыполнения("Ошибка переноса: " + ЗаявкаОбъект.Номер
			+ " " + ЗаявкаОбъект.Клиент + " " + ОписаниеОшибки());
	КонецПопытки;
	
	//Если ш > 100 Тогда Прервать; КонецЕсли;
КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияЗаявка(Получатель, Источник, МассивИменаПолей, Соединение, ПапкаГости)
	
Для Каждого Имя Из МассивИменаПолей Цикл
	Если Имя = "Ссылка" 
	
	//ИЛИ Имя = "МестоРождения" 
	ИЛИ Имя = "ДопУслуги" 
	ИЛИ Имя = "ДопПожелания" 
	
	Тогда Продолжить; КонецЕсли;	
	
	Значение = Источник[Имя];
	Если ТипЗнч(Значение) = Тип("COMОбъект") Тогда
		
		Если Имя = "Клиент" тогда
			Получатель[Имя] = ЗначениеКлиент(Значение, Соединение, ПапкаГости);
			
		ИначеЕсли Имя = "НомерВРезерв" тогда
			Получатель[Имя] = ЗначениеКласиификатораПоНаименованию("НомернойФонд", Значение);

		
		ИначеЕсли Имя = "ВремяЗаезда" тогда
			ИмяЗначениеПеречисления = ИмяЗначенияПеречисление(Соединение, Значение);
			
			Если ИмяЗначениеПеречисления = "Вр12" Тогда ИмяЗначениеПеречисления = "ВР14"; КонецЕсли;
				
			Если ИмяЗначениеПеречисления <> "" Тогда 
				Попытка
					Получатель[Имя] = Перечисления.ВремяЗаезда[ИмяЗначениеПеречисления];
				Исключение
				КонецПопытки;	
			КонецЕсли;			
			
			Получатель.ГорничныеВремяЗаезда = ЗначениеГорничныеВремяЗаезда(Значение, Соединение)
			
		ИначеЕсли Имя = "ВремяВыезда" тогда
			ИмяЗначениеПеречисления = ИмяЗначенияПеречисление(Соединение, Значение);
			
			Если ИмяЗначениеПеречисления <> "" Тогда 
				Попытка
					Получатель[Имя] = Перечисления.ВремяВыезда[ИмяЗначениеПеречисления];
				Исключение
				КонецПопытки;	
			КонецЕсли;				
			
		ИначеЕсли Имя = "КатегорияНомера" тогда
			Получатель[Имя] = ЗначениеКласиификатораПоНаименованию("КатегорииНомеров", Значение);
			
			
		ИначеЕсли Имя = "Статус" тогда
			ИмяЗначениеПеречисления = ИмяЗначенияПеречисление(Соединение, Значение);
			
			Если ИмяЗначениеПеречисления <> "" Тогда 
				Попытка
					Получатель[Имя] = Перечисления.СтатусБрони[ИмяЗначениеПеречисления];
				Исключение
				КонецПопытки;	
			КонецЕсли;				
			
		ИначеЕсли Имя = "Бронирует" тогда
			Получатель[Имя] = ЗначениеКлиент(Значение, Соединение, ПапкаГости);
			
		ИначеЕсли Имя = "Оплачивает" тогда
			Получатель[Имя] = ЗначениеКлиент(Значение, Соединение, ПапкаГости);
			
		ИначеЕсли Имя = "Клиент2" тогда
			Получатель[Имя] = ЗначениеКлиент(Значение, Соединение, ПапкаГости);
			
		ИначеЕсли Имя = "Источник" тогда
			Получатель[Имя] = ПереносЗначенияКласификатора("ИсточникиБронирования", Значение);
			
		КонецЕсли;
	Иначе
		Если Имя = "" тогда
		Иначе
			Получатель[Имя] = Источник[Имя];
		КонецЕсли;		
	КонецЕсли;   
КонецЦикла;
КонецПроцедуры	

Функция ЗначениеКлиент(Значение, Соединение, ПапкаГости)
ЗагрузкаГИУДСтрока = Соединение.XMLСтрока(Значение.Ссылка);
ЗначениеКлиент = Справочники.Клиенты.НайтиПоРеквизиту("ЗагрузкаГИУДСтрока", ЗагрузкаГИУДСтрока);

Если ЗначениеЗаполнено(ЗначениеКлиент) И ЗначениеКлиент.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо тогда
	КлиентОбъект = ЗначениеКлиент.ПолучитьОбъект();
	КлиентОбъект.Родитель = ПапкаГости;
	КлиентОбъект.Записать();
КонецЕсли;

Возврат ЗначениеКлиент; 
КонецФункции

Функция ЗначениеКласиификатораПоНаименованию(ИмяКлассификатора, Значение)
Наименование = Значение.Description;
ЗначениеКласиификатораПоНаименованию = Справочники[ИмяКлассификатора].НайтиПоНаименованию(Наименование, Истина);
Возврат ЗначениеКласиификатораПоНаименованию; 
КонецФункции

Функция ЗначениеГорничныеВремяЗаезда(ВремяЗаезда, Соединение)
Если ВремяЗаезда = Соединение.Перечисления.ВремяЗаезда.Вр0 Тогда
	Возврат 0;
ИначеЕсли ВремяЗаезда = Соединение.Перечисления.ВремяЗаезда.Вр6 Тогда
	Возврат 6;
ИначеЕсли ВремяЗаезда = Соединение.Перечисления.ВремяЗаезда.Вр12 Тогда
	Возврат 14;
ИначеЕсли ВремяЗаезда = Соединение.Перечисления.ВремяЗаезда.Вр18 Тогда
	Возврат 18;
Иначе	
	Возврат 0;
КонецЕсли;	
КонецФункции
