
//Процедура ведения журнала событий
//ТекстСообщения = ""
//ИмяЛогФайла = "Общий_Журнал.log"
//ВывестиЛинию = Ложь
//Важное = Ложь
Процедура ВЛог(ТекстСообщения="", ИмяЛогФайла = "Общий_Журнал.log", ВывестиЛинию = Ложь, Важное = Ложь) Экспорт
	
	Если СтрДлина(ТекстСообщения) <> 0 И Важное Тогда
		ТекстСообщения = Строка(ТекущаяДата())+ " !!! " + ТекстСообщения + "
		|";
	ИначеЕсли СтрДлина(ТекстСообщения) <> 0 И Не Важное Тогда
		ТекстСообщения = Строка(ТекущаяДата())+ " --- " + ТекстСообщения + "
		|";
	КонецЕсли;
	
	Если ВывестиЛинию Тогда
		ТекстСообщения = ТекстСообщения + "
		|=====================================================================================";
	КонецЕсли;
	
	Попытка
		fso = Новый COMObject("Scripting.FileSystemObject");
//		file = fso.OpenTextFile(ПутьБД + "\" + ИмяЛогФайла, 8, 1);
		ПутьБД  = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
		
		ИмяФайла = ПутьБД + ИмяЛогФайла;

		file = fso.OpenTextFile(ИмяФайла, 8, 1);
		file.WriteLine(ТекстСообщения);		
	Исключение
		Сообщить(Строка(ТекущаяДата()) + ": " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
//

Функция КаталогСканов() Экспорт
КаталогБаза = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
КаталогСканов = КаталогБаза + "SCAN\";

Возврат КаталогСканов;
КонецФункции

Функция КаталогСкановАрхив() Экспорт
КаталогБаза = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
КаталогАрхив = КаталогБаза + "SCAN_АРХИВ\";

Возврат КаталогАрхив;
КонецФункции


//// + Отправка СМС
Функция ОтправитьBytehand(Знач НомерТелефона, Текст)  Экспорт
// + ПСН Отладка
ЭтоТестоваяПрограмма = Константы.ЭтоТестоваяПрограмма.Получить();
Если ЭтоТестоваяПрограмма Тогда Возврат Истина; КонецЕсли;
// - ПСН Отладка

	Ошибка = Истина;
	
	Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();     
	НаименованиеСМС = СокрЛП(Организация.ОрганизацияИмяДляСМС);
	
	Адрес = "http://bytehand.com:3800/send?id=27944"  //НастройкиСервиса.Пользователь 
	+ "&key=0FE91DD358FF29D2"
	+ "&to=" + НомерТелефона 
	+ "&from=" + НаименованиеСМС
	+ "&text=" + ПодготовитьТекст(Текст);
	
	Попытка
		//XMLHTTP=Новый COMОбъект("MSXML2.XMLHTTP");
		//XMLHTTP.Open("get",Адрес,Ложь);
		//XMLHTTP.Send();
        XMLHTTP=Новый COMОбъект("WinHttp.WinHttpRequest.5.1");//MSXML2.XMLHTTP");
        XMLHttp.Option(2,"UTF-8");
        XMLHttp.Option(4, 13056); 
        XMLHTTP.Open("GET",Адрес,Ложь);
        XMLHTTP.Send();
		
		ТекстОтвет = XMLHTTP.ResponseText();	
		//Если Найти(ТекстОтвет, """status"": ""0""") Тогда 
		Если Найти(ТекстОтвет, """status"":0") > 0 Тогда 
			Ошибка = Ложь;
		КонецЕсли;
	Исключение 
		////СообщитьВЛог("Ошибка соединения:");
		////Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	////Если УспешнаяОтправка Тогда 
	////	ПозицияКодаНачало = Найти(ТекстОтвет, "description") + СтрДлина("description")+4;
	////	ПозицияКодаКонец = Найти(ТекстОтвет, "}");
	////	КодСМС = Сред(ТекстОтвет, ПозицияКодаНачало, ПозицияКодаКонец-ПозицияКодаНачало-1);
	////	//ЗаписатьСМСВИсторию(Перечисления.СМС_Сервисы.Bytehand,НомерТелефона,Текст, КодСМС);
	////Иначе 
	////	//	Сообщить("Отправка смс не состоялась. Текст ошибки: " + ТекстОтвет);
	////КонецЕсли;
	////Возврат УспешнаяОтправка;
	
	Возврат Ошибка;
КонецФункции

Функция ПодготовитьТекст(ИмяЭлемента)
	
	// отсюда: http://www.w3.org/International/URLUTF8Encoder.java
	Рез = "";
	Для Сч = 1 По СтрДлина(ИмяЭлемента) Цикл
		ch = Сред(ИмяЭлемента,Сч,1);
		vch = КодСимвола(ch);
		
		Если ("A" <= ch ) И ( ch <= "Z") Тогда		// "A".."Z"
			Рез = Рез + ch;
		ИначеЕсли ("a" <= ch ) И ( ch <= "z") Тогда	// "a".."z"
			Рез = Рез + ch;
		ИначеЕсли ("0" <= ch ) И ( ch <= "9") Тогда	// "0".."9"
			Рез = Рез + ch;
			//ИначеЕсли (ch = " ") ИЛИ ( ch = "+") Тогда			// space
			//	Рез = Рез + "+";
		ИначеЕсли (ch = "-" ) ИЛИ ( ch = "_") 		// unreserved
			ИЛИ (ch = ".") ИЛИ (ch = "!")
			ИЛИ (ch = "~") ИЛИ (ch = "*")
			ИЛИ (ch = "\") ИЛИ (ch = "(")
			ИЛИ (ch = ")") Тогда
			Рез = Рез + ch;
		ИначеЕсли (vch <= 127) Тогда		// other ASCII
			Рез = Рез + hex(vch);
		ИначеЕсли (vch <= 2047) Тогда		// non-ASCII <= 0x7FF
			Рез = Рез + hex(192 + Цел(vch / 64));
			Рез = Рез + hex(128 + (vch % 64));
		Иначе					// 0x7FF < ch <= 0xFFFF
			Рез = Рез + hex(224 + Цел(vch / 4096));
			Рез = Рез + hex(128 + (Цел(vch / 64) % 64));
			Рез = Рез + hex(128 + (vch % 64));
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Рез;
КонецФункции

Функция hex(Знач Значение) 
	Значение=Число(Значение);
	Если Значение<=0 Тогда 
		Результат="0";
	Иначе
		Значение=Цел(Значение);
		Результат="";
		Пока Значение>0 Цикл
			Результат=Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16 + 1,1)+Результат;
			Значение=Цел(Значение/16) ;
		КонецЦикла;
	КонецЕсли;
	Если СтрДлина(Результат) < 2 Тогда
		
		Результат = "0" + Результат;
		
	КонецЕсли; 
	Возврат "%" + Результат;
КонецФункции
//// - Отправка СМС

Функция ConnectБаза_BONUS() Экспорт
//КоличествоПопыток = 0;	
//~Соединение:
//Если КоличествоПопыток > 3 Тогда Возврат Неопределено; КонецЕсли;

Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.СоединениеБОНУСАдресВХранилище) Тогда
	Папка_C_BONUS = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BONUS");	
	
	Если НЕ ЗначениеЗаполнено(Папка_C_BONUS) Тогда
		Папка_C_BONUS = "C:\_Base1C\BONUS";
	КонецЕсли;
	
	Папка_C_BONUS = """" + Папка_C_BONUS + """";
	
	Параметры = "File=" + Папка_C_BONUS + ";Usr=""Admin"";Pwd=""123""";
	
	COMConnector= Новый COMОбъект("V83.COMConnector");
	Попытка
		Соединение =  COMConnector.Connect(Параметры);
	Исключение
		Сообщить("Ошибка подключения к БД БОНУС. " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	СоединениеСтруктура = Новый Структура("Соединение", Соединение);
	ПараметрыСеанса.СоединениеБОНУСАдресВХранилище = ПоместитьВоВременноеХранилище(СоединениеСтруктура, Новый УникальныйИдентификатор());
КонецЕсли;

Соединение = ПолучитьИзВременногоХранилища(ПараметрыСеанса.СоединениеБОНУСАдресВХранилище).Соединение;
Возврат Соединение;

//Попытка
//	Соединение.ОбменГорничные.ПроверкаСоединения();
//	//Запрос = Соединение.NewObject("Запрос");
//	//Запрос.Текст = "ВЫБРАТЬ
//	//                |	Пользователи.Ссылка КАК Ссылка
//	//                |ИЗ
//	//                |	Справочник.Пользователи КАК Пользователи";
//	// Запрос.Выполнить();

//	Возврат Соединение;
//Исключение
//	ПараметрыСеанса.СоединениеГорничнныеАдресВХранилище = "";
//	КоличествоПопыток = КоличествоПопыток + 1;
//	Перейти ~Соединение;
//КонецПопытки;	
КонецФункции


// + ПСН
Процедура ПолнотекстовыйПоискОбновитьИндекс() Экспорт
Если ПолнотекстовыйПоиск.ДатаАктуальности()<ТекущаяДата()-3600 тогда 
	////		ПолнотекстовыйПоиск.ОбновитьИндекс();	
КонецЕсли;
КонецПроцедуры
// - ПСН

//// + Почта

Функция ПолучитьПочтовыйПрофильTECT()
ПользовательПочта = "psn.invina@yandex.ru";

ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
ПочтовыйПрофиль.АдресСервераSMTP = "smtp.yandex.ru";

ПочтовыйПрофиль.ПользовательSMTP = ПользовательПочта;
                                                   
ПочтовыйПрофиль.ПарольSMTP = "psn.invina_1959";
ПочтовыйПрофиль.ИспользоватьSSLSMTP = Истина;
ПочтовыйПрофиль.ПортSMTP = 465;
ПочтовыйПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;

Возврат ПочтовыйПрофиль;
КонецФункции

//
Функция ПолучитьПочтовыйПрофильСтритАрт()
Профиль = Новый ИнтернетПочтовыйПрофиль;

Пользователь = "1@street-art1.ru";
Пароль = "gfxmzavvpvyclnbv"; 

//СерверSMTP = "smtp.live-ekb.ru";
СерверSMTP = "smtp.yandex.ru";

Профиль.АдресСервераSMTP = СерверSMTP;
Профиль.ПользовательSMTP = Пользователь;
Профиль.ПарольSMTP = Пароль;

Профиль.ПортSMTP = 465;

Профиль.ИспользоватьSSLSMTP = Истина;

//Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
//Профиль.АутентификацияSMTP=СпособSMTPАутентификации.ПоУмолчанию;   
Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;   

Возврат Профиль;
КонецФункции

Функция ПолучитьПочтовыйПрофильДомСоветов()
Профиль = Новый ИнтернетПочтовыйПрофиль;

Пользователь = "1@dom-sovetov-ekb.ru";
Пароль = "waytmkdoxnqjzesl"; 

//СерверSMTP = "smtp.live-ekb.ru";
СерверSMTP = "smtp.yandex.ru";

Профиль.АдресСервераSMTP = СерверSMTP;
Профиль.ПользовательSMTP = Пользователь;
Профиль.ПарольSMTP = Пароль;

Профиль.ПортSMTP = 465;

Профиль.ИспользоватьSSLSMTP = Истина;

//Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
//Профиль.АутентификацияSMTP=СпособSMTPАутентификации.ПоУмолчанию;   
Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;   

Возврат Профиль;
КонецФункции

Функция ПолучитьПочтовыйПрофильЛайв()
Профиль = Новый ИнтернетПочтовыйПрофиль;

Пользователь = "1@live-ekb.ru";
Пароль = "a11*22*33*"; 

//СерверSMTP = "smtp.live-ekb.ru";
СерверSMTP = "smtp.yandex.ru";

Профиль.АдресСервераSMTP = СерверSMTP;
Профиль.ПользовательSMTP = Пользователь;
Профиль.ПарольSMTP = Пароль;

Профиль.ПортSMTP = 465;

Профиль.ИспользоватьSSLSMTP = Истина;

//Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
//Профиль.АутентификацияSMTP=СпособSMTPАутентификации.ПоУмолчанию;   
Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;   

Возврат Профиль;
КонецФункции

Функция ПолучитьПочтовыйПрофильЧехов()
Профиль = Новый ИнтернетПочтовыйПрофиль;

Пользователь = "mail@chekhov-hotel.ru";    
Пароль = "ixwojlgvdotsmbez"; 

//СерверSMTP = "smtp.live-ekb.ru";
СерверSMTP = "smtp.yandex.ru";

Профиль.АдресСервераSMTP = СерверSMTP;
Профиль.ПользовательSMTP = Пользователь;
Профиль.ПарольSMTP = Пароль;

Профиль.ПортSMTP = 465;

Профиль.ИспользоватьSSLSMTP = Истина;

//Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
//Профиль.АутентификацияSMTP=СпособSMTPАутентификации.ПоУмолчанию;   
Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;   

Возврат Профиль;
КонецФункции

Функция ПолучитьПочтовыйПрофильРеноме()
Профиль = Новый ИнтернетПочтовыйПрофиль;

Пользователь = "1@renome-hotel.ru";  
Пароль = "wwvzedjyjuquixag"; //  23.09.21
//Пароль = "vpxnyjmuygjtccym"; 

//СерверSMTP = "smtp.live-ekb.ru";
СерверSMTP = "smtp.yandex.ru";

Профиль.АдресСервераSMTP = СерверSMTP;
Профиль.ПользовательSMTP = Пользователь;
Профиль.ПарольSMTP = Пароль;

Профиль.ПортSMTP = 465;

Профиль.ИспользоватьSSLSMTP = Истина;

//Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
//Профиль.АутентификацияSMTP=СпособSMTPАутентификации.ПоУмолчанию;   
Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;   

Возврат Профиль;
КонецФункции

Процедура ОтправитьEmail_ИзКлиента(Тема, МассивФайлов, МассивПолучатели, ТекстСообщения) Экспорт
ЛогФайл = "Рассылка.log";

Если НастройкиСервер.ЭтоЛайв() Тогда 
	//ПочтовыйПрофиль = ПолучитьПочтовыйПрофильTECT();
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильЛайв();
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильЧехов();
ИначеЕсли НастройкиСервер.ЭтоРеноме() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильРеноме();
ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильДомСоветов();
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильСтритАрт();
Иначе	
	 Сообщить("Требуется настройка почтового профиля для отправки сообщений.");
	 Возврат;
КонецЕсли;	

Почта = Новый ИнтернетПочта(); 

Попытка 
	Почта.Подключиться(ПочтовыйПрофиль); 
Исключение 
	//ОбщийМодульСлужебныеСервер.ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки(),ЛогФайл, , Истина); 
	Сообщить("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки() ,СтатусСообщения.ОченьВажное); 
	Возврат; 
КонецПопытки; 

Если ТекстСообщения = "" Тогда
	ТелоСообщения = "
	|
	|-------------------------------------------------------------------------
	|Данное сообщение сгенерировано автоматически.
	|Отвечать на это письмо по адресу отправителя не имеет смысла.
	|-------------------------------------------------------------------------";
Иначе
	ТелоСообщения = ТекстСообщения;
КонецЕсли;	
	
ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение; 

ПочтовоеСообщение.Отправитель = ПочтовыйПрофиль.ПользовательSMTP;

Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
ПочтовоеСообщение.ИмяОтправителя = "Уведомление " + Организация;
	
ПочтовоеСообщение.Тема = Тема;
ПочтовоеСообщение.Тексты.Добавить(ТелоСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);

Если МассивПолучатели.Количество() = 0 тогда
	Сообщить("Не заполнено поле: Получатели", СтатусСообщения.ОченьВажное);
	Возврат;
КонецЕсли;
	
Для Каждого Получатель Из МассивПолучатели Цикл
	ПочтовоеСообщение.Получатели.Добавить(Получатель);    
КонецЦикла;	
ПочтовоеСообщение.Получатели.Добавить(ПочтовыйПрофиль.ПользовательSMTP);    

//ПочтовоеСообщение.Получатели.Добавить("1@renome-hotel.ru");
//ПочтовоеСообщение.Получатели.Добавить("pka@5sreda.ru");

Если ПочтовоеСообщение.Получатели.Количество() = 0 тогда	
	Сообщить("Не заполнено поле: Получатели",СтатусСообщения.ОченьВажное);
	Возврат;
КонецЕсли;

Файлы = Новый Массив;
КаталогВременныхФайлов = КаталогВременныхФайлов(); 
Для Каждого Элемент Из МассивФайлов Цикл
	Адрес = Элемент.Адрес;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	ИмяФайла = Элемент.ИмяФайла;
	ИмяВременногоФайла = КаталогВременныхФайлов + ИмяФайла;
	
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	Файлы.Добавить(ИмяВременногоФайла); 
КонецЦикла;

Если Файлы.Количество() > 0 тогда
	Для каждого Элемент Из Файлы Цикл
		ПочтовоеСообщение.Вложения.Добавить(Элемент);
	КонецЦикла; 
КонецЕсли;

Попытка
	Почта.Послать(ПочтовоеСообщение);
	Почта.Отключиться();
	//ОбщийМодульСлужебныеСервер.ВЛог(ТЕма +" отправлен",ЛогФайл);
Исключение
	//ОбщийМодульСлужебныеСервер.ВЛог(ОписаниеОшибки(),ЛогФайл,,Истина);
	Сообщить(ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
КонецПопытки;
КонецПроцедуры	

Процедура УдалитьВременныеФайлыПочты(Файлы) Экспорт
Попытка
	Для Каждого Строка Из Файлы Цикл   
		УдалитьФайлы(Строка.Значение);
	КонецЦикла;	
Исключение
	Сообщить("Возникли проблемы с удалением временных файлов почты на сервере: " + ОписаниеОшибки());
КонецПопытки;
КонецПроцедуры	
//

Процедура ОтправитьEmail(Тема, МассивФайлов, МассивПолучатели, ТекстСообщения) Экспорт
ЛогФайл = "Рассылка.log";

Если НастройкиСервер.ЭтоЛайв() Тогда 
	//ПочтовыйПрофиль = ПолучитьПочтовыйПрофильTECT();
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильЛайв();
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильЧехов();
ИначеЕсли НастройкиСервер.ЭтоРеноме() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильРеноме();
ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильДомСоветов();
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильСтритАрт();
Иначе	
	 Сообщить("Требуется настройка почтового профиля для отправки сообщений.");
	 Возврат;
КонецЕсли;	

Почта = Новый ИнтернетПочта(); 

Попытка 
	Почта.Подключиться(ПочтовыйПрофиль); 
Исключение 
	//ОбщийМодульСлужебныеСервер.ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки(),ЛогФайл, , Истина); 
	Сообщить("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки() ,СтатусСообщения.ОченьВажное); 
	Возврат; 
КонецПопытки; 

Если ТекстСообщения = "" Тогда
	ТелоСообщения = "
	|
	|-------------------------------------------------------------------------
	|Данное сообщение сгенерировано автоматически.
	|Отвечать на это письмо по адресу отправителя не имеет смысла.
	|-------------------------------------------------------------------------";
Иначе
	ТелоСообщения = ТекстСообщения;
КонецЕсли;	
	
ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение; 

ПочтовоеСообщение.Отправитель = ПочтовыйПрофиль.ПользовательSMTP;

Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
ПочтовоеСообщение.ИмяОтправителя = "Уведомление " + Организация;
	
ПочтовоеСообщение.Тема = Тема;
ПочтовоеСообщение.Тексты.Добавить(ТелоСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);

Если МассивПолучатели.Количество() = 0 тогда
	Сообщить("Не заполнено поле: Получатели", СтатусСообщения.ОченьВажное);
	Возврат;
КонецЕсли;
	
Для Каждого Получатель Из МассивПолучатели Цикл
	ПочтовоеСообщение.Получатели.Добавить(Получатель);    
КонецЦикла;	
ПочтовоеСообщение.Получатели.Добавить(ПочтовыйПрофиль.ПользовательSMTP);    

//ПочтовоеСообщение.Получатели.Добавить("1@renome-hotel.ru");
//ПочтовоеСообщение.Получатели.Добавить("pka@5sreda.ru");

Если ПочтовоеСообщение.Получатели.Количество() = 0 тогда	
	Сообщить("Не заполнено поле: Получатели",СтатусСообщения.ОченьВажное);
	Возврат;
КонецЕсли;

Если МассивФайлов.Количество() > 0 тогда
	Для каждого Элемент Из МассивФайлов Цикл
		ПочтовоеСообщение.Вложения.Добавить(Элемент);
	КонецЦикла; 
КонецЕсли;

Попытка
	Почта.Послать(ПочтовоеСообщение);
	Почта.Отключиться();
	//ОбщийМодульСлужебныеСервер.ВЛог(ТЕма +" отправлен",ЛогФайл);
Исключение
	//ОбщийМодульСлужебныеСервер.ВЛог(ОписаниеОшибки(),ЛогФайл,,Истина);
	Сообщить(ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
КонецПопытки;
КонецПроцедуры	
//// - Почта

//// + Почта Дополнительный вызов 
Процедура ОтправитьМейлом(Тема, Файлы, Получатели, ТекстСообщения = "") Экспорт
ЛогФайл = "Рассылка.log";

Если НастройкиСервер.ЭтоЛайв() Тогда 
	//ПочтовыйПрофиль = ПолучитьПочтовыйПрофильTECT();
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильЛайв();
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильЧехов();
ИначеЕсли НастройкиСервер.ЭтоРеноме() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильРеноме();
ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильДомСоветов();
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда 
	ПочтовыйПрофиль = ПолучитьПочтовыйПрофильСтритАрт();
Иначе	
	 Сообщить("Требуется настройка почтового профиля для отправки сообщений.");
	 Возврат;
КонецЕсли;	

Почта = Новый ИнтернетПочта(); 

Попытка 
	Почта.Подключиться(ПочтовыйПрофиль); 
Исключение 
	//ОбщийМодульСлужебныеСервер.ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки(),ЛогФайл, , Истина); 
	Сообщить("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки() ,СтатусСообщения.ОченьВажное); 
	Возврат; 
КонецПопытки; 

Если ТекстСообщения = "" Тогда
	ТелоСообщения = "
	|
	|-------------------------------------------------------------------------
	|Данное сообщение сгенерировано автоматически.
	|Отвечать на это письмо по адресу отправителя не имеет смысла.
	|-------------------------------------------------------------------------";
Иначе
	ТелоСообщения = ТекстСообщения;
КонецЕсли;	
	
ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение; 

ПочтовоеСообщение.Отправитель = ПочтовыйПрофиль.ПользовательSMTP;

Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
ПочтовоеСообщение.ИмяОтправителя = "Уведомление " + Организация;
	
ПочтовоеСообщение.Тема = Тема;
ПочтовоеСообщение.Тексты.Добавить(ТелоСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);

Если НЕ ЗначениеЗаполнено(Получатели) тогда
	Сообщить("Не заполнено поле: Получатели",СтатусСообщения.ОченьВажное);
	Возврат;
иначе

	Для Каждого Получатель Из Получатели Цикл
		ПочтовоеСообщение.Получатели.Добавить(Получатель.Значение);    // "1@renome-hotel.ru"
	КонецЦикла;	
	
	Если ПочтовоеСообщение.Получатели.Количество() = 0 тогда	
		Сообщить("Не заполнено поле: Получатели",СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
	//ПочтовоеСообщение.Получатели.Добавить("1@renome-hotel.ru");
	
	Если Файлы.Количество() > 0 тогда
		Для каждого Элемент Из Файлы Цикл
			ПочтовоеСообщение.Вложения.Добавить(Элемент.Значение);
		КонецЦикла; 
	КонецЕсли;
	
	Попытка
		Почта.Послать(ПочтовоеСообщение);
		//ОбщийМодульСлужебныеСервер.ВЛог(ТЕма +" отправлен",ЛогФайл);
	Исключение
		//ОбщийМодульСлужебныеСервер.ВЛог(ОписаниеОшибки(),ЛогФайл,,Истина);
		Сообщить(ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
	КонецПопытки;
КонецЕсли;
КонецПроцедуры	
//// + Почта Дополнительный вызов К Удалению


//////////////////////////////////////////////////////////

Процедура ТЕСТ_ПОЧТА_НаСервере() Экспорт
Профиль = Новый ИнтернетПочтовыйПрофиль;
Профиль.АдресСервераSMTP = "smtp.yandex.ru";
Профиль.ПользовательSMTP = "snpostnikov@yandex.ru";
Профиль.ПарольSMTP = ",hfn-yjcjhju";
Профиль.ИспользоватьSSLSMTP = Истина;
Профиль.ПортSMTP = 465;
Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
 
Письмо = Новый ИнтернетПочтовоеСообщение;
Текст = Письмо.Тексты.Добавить("тест!");
Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
Письмо.Тема = "Test";
Письмо.Отправитель = "snpostnikov@yandex.ru";
Письмо.ИмяОтправителя = "snpostnikov";
Письмо.Получатели.Добавить("postnikov_sn@invina.ru");
 
Почта = Новый ИнтернетПочта;
Попытка
Почта.Подключиться(Профиль);
Почта.Послать(Письмо);
Исключение
Сообщить("Не удалось отправить письмо");
Сообщить(ОписаниеОшибки());
КонецПопытки;

КонецПроцедуры

////// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++




