&НаКлиенте
Перем MsWord;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.АвтоЗаголовок = Ложь;
ЭтаФорма.Заголовок = Параметры.Заголовок;	

Параметры.Свойство("ИмяИсходногоФайла", ИмяИсходногоФайла); 
Параметры.Свойство("ИмяФайла", ИмяФайла);

Параметры.Свойство("Почта", Почта);
ЕстьПочта = ЗначениеЗаполнено(Почта);
Элементы.Почта.Видимость = ЕстьПочта;
Элементы.ПочтаТема.Видимость = ЕстьПочта;
Элементы.ПочтаТекстСообщения.Видимость = ЕстьПочта;
Если ЕстьПочта Тогда
	Параметры.Свойство("ПочтаТема", ПочтаТема);
	Параметры.Свойство("ПочтаТекстСообщения", ПочтаТекстСообщения);
КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаПочту(Команда)
Если ВыбратьФайл Тогда	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Расширение = "docx";
	
	Диалог.Фильтр = "(*.doc)|*.doc|*.docx";;

	Диалог.ПолноеИмяФайла = ИмяФайла;

	Если НЕ Диалог.Выбрать() Тогда Возврат; КонецЕсли;
		
	ПолноеИмяФайлаПочта = Диалог.ПолноеИмяФайла;;
Иначе
	ПолноеИмяФайлаПочта = ФормированиеФайлаPFD(); 
КонецЕсли;	

ОтправитьНаПочтуНаСервере(ПолноеИмяФайлаПочта);	
КонецПроцедуры

&НаКлиенте
Функция ФормированиеФайлаPFD()
ИмяФайлаPDF = ПолучитьИмяВременногоФайла("PDF"); 
MSWord = Новый COMОбъект("Word.Application");

ДокументWord = MSWord.Documents.Open(ИмяИсходногоФайла);
wdFormatPDF	= 17; //	Формат PDF.
Документ.SaveAs2(ИмяФайлаPDF, wdFormatPDF);

ффф = Документ.Name;

Возврат ИмяФайлаPDF;
КонецФункции


&НаСервере
Процедура ОтправитьНаПочтуНаСервере(ИмяФайла)
Получатели = Новый СписокЗначений;
Получатели.Добавить(Почта);

Файлы = Новый СписокЗначений;
Файлы.Добавить(ИмяФайла);

СлужебныеСервер.ОтправитьМейлом(ПочтаТема, Файлы, Получатели, ПочтаТекстСообщения);
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
Диалог.Расширение = "PDF";

//Фильтр = НСтр("ru = 'Текст'; en = 'Text'")
//    + "(*.PDF)|*.PDF";
	
Диалог.Фильтр = "(*.PDF)|*.PDF";;

Диалог.ПолноеИмяФайла = ИмяФайла;

Если Диалог.Выбрать() Тогда
	//ТабличныйДокумент.Записать(Диалог.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLS)
КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТЕСТ(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
//MSWord.Application.Visible = Истина;

//MSWord.Activate();
//Документ.ActiveWindow.Caption = "Подтверждение";
//	//Вставить содержимое обработчика
КонецПроцедуры



