
Процедура ПроверкаСоединения() Экспорт
	
КонецПроцедуры

Функция Соединение(СоединениеАдресВХранилище, ПапкаПрограмма, Пользователь = "Соединение", Пароль = "123") Экспорт
КоличествоПопыток = 0;	
~Соединение:
Если КоличествоПопыток > 3 Тогда Возврат Неопределено; КонецЕсли;

Если НЕ ЗначениеЗаполнено(ПараметрыСеанса[СоединениеАдресВХранилище]) Тогда
	//Параметры = "File=""C:\_Base1C\hostess"";Usr=""Соединение"";Pwd=""123""";
	//Папка_Горничные = Константы.ПАПКА_Горничные.Получить();
	//
	////Если НЕ ЗначениеЗаполнено(Папка_Горничные) Тогда
	////	Папка_Горничные = "C:\_Base1C\hostess";
	////КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Папка_Горничные) Тогда
	//	Сообщить("Не настроена папка Горничные");
	//	
	//	Возврат Неопределено;
	//КонецЕсли;	
	
	Папка = """" + ПапкаПрограмма + """";
	
	//Параметры = "File=" + Папка_Горничные + ";Usr=""Соединение"";Pwd=""123""";
	Параметры = "File=" + Папка + ";" + "Usr=""" + Пользователь + """;" + "Pwd=""" + Пароль + """";
	
	COMConnector= Новый COMОбъект("V83.COMConnector");
	Попытка
		Соединение =  COMConnector.Connect(Параметры);
	Исключение
		Сообщить("Ошибка подключения к БД Горничные. " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	СоединениеСтруктура = Новый Структура("Соединение", Соединение);
	ПараметрыСеанса[СоединениеАдресВХранилище] = ПоместитьВоВременноеХранилище(СоединениеСтруктура, Новый УникальныйИдентификатор());
КонецЕсли;

Соединение = ПолучитьИзВременногоХранилища(ПараметрыСеанса[СоединениеАдресВХранилище]).Соединение;
Попытка
	//Соединение.ОбменГорничныеСервер.ПроверкаСоединения();
	//ВыполнитьТекст = ИмяМодуляПроверка + ".ПроверкаСоединения()";
	Соединение.ВнешнееСоединение.ПроверкаСоединения();  

	Возврат Соединение;
Исключение
	ПараметрыСеанса[СоединениеАдресВХранилище]= "";
	КоличествоПопыток = КоличествоПопыток + 1;
	Перейти ~Соединение;
КонецПопытки;	
КонецФункции
