
Функция СформироватьОтчетНаСервере(Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();

ТабДок = Новый ТабличныйДокумент;      

// + Оплаты Дни
ПолеОтчета = СформироватьОплатыДни(Макет,  ДатаОтчетаС,  ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет);
	
ТабДок.Вывести(ПолеОтчета);
// - Оплаты Дни

////
// + Нераспределенные оплаты
ПолеОтчета = СформироватьНераспределенныеОплаты(Макет,  ДатаОтчетаС,  ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет);
	
ТабДок.Вывести(ПолеОтчета);
// - Нераспределенные оплаты
	

// + Оплаты Бронь
ПолеОтчета = СформироватьОплатыБрони(Макет,  ДатаОтчетаС,  ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет);
	
ТабДок.Вывести(ПолеОтчета);
// - Оплаты Бронь

// + Возвраты
ПолеОтчета = СформироватьВозвраты(Макет,  ДатаОтчетаС,  ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет);
	
ТабДок.Вывести(ПолеОтчета);
// - Возвраты

// + Платежи
ПолеОтчета = СформироватьПлатежиКонтрагенту(Макет,  ДатаОтчетаС,  ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет);
	
ТабДок.Вывести(ПолеОтчета);
// - Платежи


// + Оплаты                            
ПолеОтчета = СформироватьОплатыЗаявки(Макет,  ДатаОтчетаС,  ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет);
ТабДок.Вывести(ПолеОтчета);
// - Оплаты 

	
////
 

//Если ЭтоОтчет Тогда
//	Колонка_1 = Область.ШиринаТаблицы - 3;
//	Колонка_2 = Область.ШиринаТаблицы - 1;
//	ПолеОтчета.Область(, Колонка_1, ,Колонка_2).Видимость = Ложь;   
//Иначе	
//	КолонкаЗавтракиЗаявка = Область.ШиринаТаблицы - 4;
//	ПолеОтчета.Область(, КолонкаЗавтракиЗаявка, ,КолонкаЗавтракиЗаявка).Видимость = Ложь;   
//	
//	КолонкаАвторскоеВознаграждениеОплата = Область.ШиринаТаблицы - 9;
//	КолонкаАвторскоеВознаграждениеФормаОплаты = Область.ШиринаТаблицы - 7;
//	ПолеОтчета.Область(, КолонкаАвторскоеВознаграждениеОплата, ,КолонкаАвторскоеВознаграждениеФормаОплаты).Видимость = Ложь;   
//	
//	КолонкаОплатил = Область.ШиринаТаблицы - 12;
//	ПолеОтчета.Область(, КолонкаОплатил, ,КолонкаОплатил).Видимость = Ложь;   
//КонецЕсли;

//Возврат ПолеОтчета;

Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
КолонкаКоличествоСчетов = Область.ШиринаТаблицы;
ТабДок.Область(, КолонкаКоличествоСчетов, ,КолонкаКоличествоСчетов).Видимость = Ложь; 

Если ЭтоОтчет Тогда
	//Колонка_1 = Область.ШиринаТаблицы - 3;
	//Колонка_2 = Область.ШиринаТаблицы - 1;
	//ТабДок.Область(, Колонка_1, ,Колонка_2).Видимость = Ложь;   
Иначе	
	КолонкаЗавтракиЗаявка = Область.ШиринаТаблицы - 4;
	ТабДок.Область(, КолонкаЗавтракиЗаявка, ,КолонкаЗавтракиЗаявка).Видимость = Ложь;   
	
	КолонкаАвторскоеВознаграждениеОплата = Область.ШиринаТаблицы - 9;
	КолонкаАвторскоеВознаграждениеФормаОплаты = Область.ШиринаТаблицы - 7;
	ТабДок.Область(, КолонкаАвторскоеВознаграждениеОплата, ,КолонкаАвторскоеВознаграждениеФормаОплаты).Видимость = Ложь;   
	
	КолонкаОплатил = Область.ШиринаТаблицы - 12;
	ТабДок.Область(, КолонкаОплатил, ,КолонкаОплатил).Видимость = Ложь;   
КонецЕсли;

//
ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;


//ОбластьШапка = ТабДок.Область("R1"); 
ОбластьШапка = ТабДок.Область(0,,0); 
ТабДок.ПовторятьПриПечатиСтроки = ОбластьШапка;

ТабДок.ФиксацияСверху = 1;
Возврат ТабДок;
КонецФункции

Функция СформироватьОплатыДни(Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт

ПолеОтчета = Новый ТабличныйДокумент;      

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

ТЗ_РодительУслуги = ТЗ_УслугиРодитель();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;
Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Папка) Тогда		
		Если ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			ЗаголовокОтчета = Строка.ЗаголовокОтчеты;
		Иначе
			ЗаголовокОтчета = Строка.Папка;
		КонецЕсли;
		
		Область.Параметры.ШапкаДопУслуги = ЗаголовокОтчета;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область, 0);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

//Область = Макет.ПолучитьОбласть("Шапка|КолонкиПраво");
//ПолеОтчета.Присоединить(Область);

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

ПолеОтчета.ФиксацияСверху = 1;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

//
Итоги = Новый Структура();
Итоги.Вставить("КоличествоНочей", 0);
Итоги.Вставить("КоличествоСутокТариф", 0);
Итоги.Вставить("СуммаЦенаПроживание", 0);
Итоги.Вставить("СуммаПроживание", 0);
Итоги.Вставить("СуммаНомера", 0);

Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаОплаты_кк", 0);
Итоги.Вставить("СуммаОплаты_нал", 0);
Итоги.Вставить("СуммаЭквайринга", 0);

Итоги.Вставить("СуммаКомиссииИнформационно", 0);
Итоги.Вставить("СуммаКомиссииКВыплате", 0);
Итоги.Вставить("СуммаКомиссииОплата", 0);

Итоги.Вставить("КоличествоСтатус", 0);
Итоги.Вставить("КоличествоЗавтраки", 0);

Итоги.Вставить("КоличествоЧеловек", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);
//

//
ИтогиДень = Новый Структура();
ИтогиДень.Вставить("КоличествоНочей", 0);
ИтогиДень.Вставить("КоличествоСутокТариф", 0);
ИтогиДень.Вставить("СуммаЦенаПроживание", 0);
ИтогиДень.Вставить("СуммаПроживание", 0);
ИтогиДень.Вставить("СуммаНомера", 0);

ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаОплаты_кк", 0);
ИтогиДень.Вставить("СуммаОплаты_нал", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);

ИтогиДень.Вставить("СуммаКомиссииИнформационно", 0);
ИтогиДень.Вставить("СуммаКомиссииКВыплате", 0);
ИтогиДень.Вставить("СуммаКомиссииОплата", 0);

ИтогиДень.Вставить("КоличествоСтатус", 0);
ИтогиДень.Вставить("КоличествоЗавтраки", 0);

ИтогиДень.Вставить("КоличествоЧеловек", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);
//

Запрос =	Новый Запрос ("ВЫБРАТЬ
        	              |	НомернойФонд.Ссылка КАК НомерВРезерв,
        	              |	ЗаявкаДанные.Ссылка КАК Заявка,
        	              |	ЗаявкаДанные.Дата КАК Дата,
        	              |	ЗаявкаДанные.Бронирует КАК Бронирует,
        	              |	ЗаявкаДанные.Оплачивает КАК Оплачивает,
        	              |	ЗаявкаДанные.Статус КАК Статус,
        	              |	ЗаявкаДанные.КолВоЧеловек КАК КолВоЧеловек,
        	              |	ЗаявкаДанные.КоличествоСчетов КАК КоличествоСчетов,
        	              |	ЗаявкаДанные.Номер КАК ЗаявкаНомер,
        	              |	ЗаявкаДанные.Дата КАК ЗаявкаДата,
        	              |	ЗаявкаДанные.БезЗавтрака КАК БезЗавтрака,
        	              |	ЗаявкаДанные.БонШанс КАК БонШанс,
        	              |	ЗаявкаДанные.Ссылка.РезервС КАК РезервС,
        	              |	ЗаявкаДанные.ДеньПроживанияМинимум КАК ДеньПроживанияМинимум,
        	              |	ЗаявкаДанные.ДеньПроживанияМаксимум КАК ДеньПроживанияМаксимум,
        	              |	ЗаявкаДанные.ДатаУслугиМинимум КАК ДатаУслугиМинимум,
        	              |	ЗаявкаДанные.ДатаУслугиМаксимум КАК ДатаУслугиМаксимум
        	              |ИЗ
        	              |	Справочник.НомернойФонд КАК НомернойФонд
        	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |			ЗаявкаНаБронирование.Ссылка КАК Ссылка,
        	              |			ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
        	              |			ЗаявкаНаБронирование.Бронирует КАК Бронирует,
        	              |			ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
        	              |			ЗаявкаНаБронирование.Статус КАК Статус,
        	              |			ЗаявкаНаБронирование.КолВоЧеловек КАК КолВоЧеловек,
        	              |			СчетаКоличество.КоличествоСчетов КАК КоличествоСчетов,
        	              |			ЗаявкаНаБронирование.Номер КАК Номер,
        	              |			ЗаявкаНаБронирование.Дата КАК Дата,
        	              |			ЗаявкаНаБронирование.БезЗавтрака КАК БезЗавтрака,
        	              |			ЗаявкаНаБронирование.БонШанс КАК БонШанс,
        	              |			ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДеньПроживанияМинимум,
        	              |			ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДеньПроживанияМаксимум,
        	              |			ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМинимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУслугиМинимум,
        	              |			ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМаксимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУслугиМаксимум
        	              |		ИЗ
        	              |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
        	              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |					ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
        	              |					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронированиеСчета.СчетГУИД) КАК КоличествоСчетов
        	              |				ИЗ
        	              |					Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
        	              |				
        	              |				СГРУППИРОВАТЬ ПО
        	              |					ЗаявкаНаБронированиеСчета.Ссылка) КАК СчетаКоличество
        	              |				ПО ЗаявкаНаБронирование.Ссылка = СчетаКоличество.Ссылка
        	              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |					ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
        	              |					МИНИМУМ(ЗаявкаНаБронированиеПроживание.ДеньПроживания) КАК ДеньПроживанияМинимум,
        	              |					МАКСИМУМ(ЗаявкаНаБронированиеПроживание.ДеньПроживания) КАК ДеньПроживанияМаксимум
        	              |				ИЗ
        	              |					Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
        	              |				
        	              |				СГРУППИРОВАТЬ ПО
        	              |					ЗаявкаНаБронированиеПроживание.Ссылка) КАК Проживания
        	              |				ПО ЗаявкаНаБронирование.Ссылка = Проживания.Ссылка
        	              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |					ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
        	              |					МИНИМУМ(ЗаявкаНаБронированиеДопУслуги.ДатаУслуги) КАК ДатаУслугиМинимум,
        	              |					МАКСИМУМ(ЗаявкаНаБронированиеДопУслуги.ДатаУслуги) КАК ДатаУслугиМаксимум
        	              |				ИЗ
        	              |					Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
        	              |				ГДЕ
        	              |					ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
        	              |				
        	              |				СГРУППИРОВАТЬ ПО
        	              |					ЗаявкаНаБронированиеДопУслуги.Ссылка) КАК ТЧДопУслуги
        	              |				ПО ЗаявкаНаБронирование.Ссылка = ТЧДопУслуги.Ссылка
        	              |		ГДЕ
        	              |			ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
        	              |			И ВЫБОР
        	              |					КОГДА &ТипДатаС = ""ВсеЗаПериод""
        	              |							ИЛИ &ТипДатаПо = ""ВсеЗаПериод""
        	              |						ТОГДА ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |									И ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |								ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |									И ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |					ИНАЧЕ ВЫБОР
        	              |								КОГДА &ТипДатаС = ""ДатаВыезда""
        	              |									ТОГДА ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |											ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |								ИНАЧЕ ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |										ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМинимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |							КОНЕЦ
        	              |							И ВЫБОР
        	              |								КОГДА &ТипДатаПо = ""ДатаВыезда""
        	              |									ТОГДА ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |											ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМаксимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |								ИНАЧЕ ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |										ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |							КОНЕЦ
        	              |				КОНЕЦ
        	              |			И ВЫБОР
        	              |					КОГДА Проживания.ДеньПроживанияМаксимум ЕСТЬ NULL
        	              |						ТОГДА ИСТИНА
        	              |					ИНАЧЕ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
        	              |							ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает)
        	              |							ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
        	              |				КОНЕЦ
        	              |			И ВЫБОР
        	              |					КОГДА &БронируетОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
        	              |						ТОГДА ИСТИНА
        	              |					ИНАЧЕ ЗаявкаНаБронирование.Бронирует = &БронируетОтбор
        	              |				КОНЕЦ) КАК ЗаявкаДанные
        	              |		ПО НомернойФонд.Ссылка = ЗаявкаДанные.НомерВРезерв
        	              |ГДЕ
        	              |	НомернойФонд.ПометкаУдаления = ЛОЖЬ
        	              |
        	              |УПОРЯДОЧИТЬ ПО
        	              |	НомернойФонд.Наименование,
        	              |	Заявка");


Запрос.УстановитьПараметр("ДатаОтчетаС", ДатаОтчетаС);
Запрос.УстановитьПараметр("ДатаОтчетаПо", ДатаОтчетаПо);
Запрос.УстановитьПараметр("ТипДатаС", ТипДатаС);
Запрос.УстановитьПараметр("ТипДатаПо", ТипДатаПо);
Запрос.УстановитьПараметр("БронируетОтбор", БронируетОтбор);
ТЗ_Заявки = Запрос.Выполнить().Выгрузить();

Заявки = ТЗ_Заявки.ВыгрузитьКолонку("Заявка");

ТЗ_ПроживаниеЗаявки = ОтчетыСервер.ТЗ_ПроживаниеЗаявки(Заявки);

ТЗ_УслугиЗаявки = ОтчетыСервер.ТЗ_УслугиЗаявки(Заявки);

ТЗ_ОплатыЗаявки = ОтчетыСервер.ТЗ_ОплатыЗаявки(Заявки);

ПлатежиРаспределение = ПлатежиКонтрагентуРаспределение(ДатаОтчетаС, ДатаОтчетаПо);

СписокКонтрагентыИИН_Эквайринг = БезналРаспределениеСервер.СписокИННЭквайринг();
ПолучательПлатежа = Константы.ПолучательПлатежаБезнал.Получить();

//
Время_200 = 0;
Время_100 = 0;
Время_1 = 0;
Время_2 = 0;

Время_11 = 0;
Время_12 = 0;
Время_101 = 0;
Время_102 = 0;
Время_13 = 0;
Время_14 = 0;
Время_15 = 0;
//

Дата_П = ДатаОтчетаС;
Пока Дата_П <= ДатаОтчетаПо Цикл
	Дата_0 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если ТЗ_Заявки.Количество() = 0 Тогда Перейти ~ПРОДОЛЖИТЬ_ДатаОтчетаПо; КонецЕсли;
	
	Дата_1 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Время_1 = Время_1 + Дата_1 - Дата_0;
	
	ИтогиДень.КоличествоСтатус = 0;;
	ИтогиДень.КоличествоНочей = 0;
	ИтогиДень.КоличествоСутокТариф = 0;
	ИтогиДень.СуммаЦенаПроживание = 0;
	ИтогиДень.СуммаПроживание = 0;
	ИтогиДень.СуммаНомера = 0;
	
	ИтогиДень.СуммаОплаты = 0;
	ИтогиДень.СуммаОплаты_кк = 0;
	ИтогиДень.СуммаОплаты_нал = 0;
	ИтогиДень.СуммаЭквайринга = 0;
	
	ИтогиДень.СуммаКомиссииИнформационно = 0;
	ИтогиДень.СуммаКомиссииКВыплате = 0;
	ИтогиДень.СуммаКомиссииОплата = 0;

	ИтогиДень.КоличествоСтатус = 0;;
	ИтогиДень.КоличествоЗавтраки = 0;;
	
	ИтогиДень.КоличествоЧеловек = 0;;
	
	УслугиДеньИтоги = ИтогиДень.УслугиДеньИтоги;
	Для Каждого Строка Из ИтогиДень.УслугиДеньИтоги Цикл
		Строка.СуммаУслуги = 0;	
	КонецЦикла;
	
	НетЗаголовокСтрока = Истина;
	Для Каждого СтрокаЗаявка Из ТЗ_Заявки Цикл
		Дата_01 = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		КоличествоНочей = 0;
		КоличествоСутокТариф = 0;
		СуммаЦенаПроживание = 0;
		СуммаПроживание = 0;
		СуммаНомера = 0;
		
		СуммаОплаты = 0;
		СуммаОплаты_кк = 0;
		СуммаОплаты_нал = 0;
			
		СуммаЭквайринга = 0;
		СуммаКомиссии = 0;
		КоличествоЗавтраки = 0;
		
		СуммаКомиссииИнформационно = 0;
		СуммаКомиссииКВыплате = 0;
		СуммаКомиссииОплата = 0;
		
		КоличествоЧеловек = 0;;
		
		//Если СтрокаЗаявка.Заявка.Номер <> "000015351" Тогда Продолжить; КонецЕсли;
		
		//Если НЕ (СтрокаЗаявка.Заявка.РезервС <= Дата_П И СтрокаЗаявка.Заявка.РезервПо >= Дата_П) Тогда 
		//	Дата_11 = ТекущаяУниверсальнаяДатаВМиллисекундах();
		//	Время_11 = Время_11 + Дата_11 - Дата_01;
		//	
		//	//Перейти ~ПРОДОЛЖИТЬ_Заявки;
		//	Продолжить; 
		//КонецЕсли; 
		
		//Если НЕ (СтрокаЗаявка.ДеньПроживанияМинимум <= Дата_П И СтрокаЗаявка.ДеньПроживанияМаксимум >= Дата_П) Тогда 
		//	Дата_11 = ТекущаяУниверсальнаяДатаВМиллисекундах();
		//	Время_11 = Время_11 + Дата_11 - Дата_01;
		//	
		//	//Перейти ~ПРОДОЛЖИТЬ_Заявки;			
		//	Продолжить; 
		//КонецЕсли; 
		ПроживаниеВне = НЕ (СтрокаЗаявка.ДеньПроживанияМинимум <= Дата_П И СтрокаЗаявка.ДеньПроживанияМаксимум >= Дата_П); 
		УслугиВне =  НЕ (СтрокаЗаявка.ДатаУслугиМинимум <= Дата_П И СтрокаЗаявка.ДатаУслугиМаксимум >= Дата_П); 
		Если ПроживаниеВне И УслугиВне Тогда 
			Дата_11 = ТекущаяУниверсальнаяДатаВМиллисекундах();
			Время_11 = Время_11 + Дата_11 - Дата_01;
			
			Продолжить; 
		КонецЕсли;
		
		//ТЗ_Проживание = ОтчетыСервер.ТЗ_ПроживаниеЗаявкаДеньПроживания_ЧерезЗапрос(СтрокаЗаявка.Заявка, Дата_П);
		ТЗ_Проживание = ОтчетыСервер.ТЗ_ПроживаниеЗаявкаДеньПроживания(ТЗ_ПроживаниеЗаявки, СтрокаЗаявка.Заявка, Дата_П);
		
		//ТЗ_Услуги = ОтчетыСервер.ТЗ_УслугиЗаявкаДеньПроживания_ЧерезЗапрос(СтрокаЗаявка.Заявка, Дата_П);
		ТЗ_Услуги = ОтчетыСервер.ТЗ_УслугиЗаявкаДеньПроживания(ТЗ_УслугиЗаявки, СтрокаЗаявка.Заявка, Дата_П);

//		Если ТЗ_Проживание.Количество() = 0 И ТЗ_Услуги.Количество() = 0 Тогда Продолжить; КонецЕсли;
		Если ТЗ_Проживание.Количество() = 0 И ТЗ_Услуги.Количество() = 0 Тогда 
			Дата_11 = ТекущаяУниверсальнаяДатаВМиллисекундах();
			Время_11 = Время_11 + Дата_11 - Дата_01;
			
			//Перейти ~ПРОДОЛЖИТЬ_Заявки;
			Продолжить; 
		КонецЕсли;
		
		Дата_12 = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Время_12 = Время_12 + Дата_12 - Дата_01;
	
		//ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка_ЧерезЗапрос(СтрокаЗаявка.Заявка);
		ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка(ТЗ_ОплатыЗаявки, СтрокаЗаявка.Заявка);		
		
		Дата_13 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	    Время_13 = Время_13+ Дата_13 - Дата_01;
		
		Если НетЗаголовокСтрока Тогда 		
			Область = Макет.ПолучитьОбласть("ЗаголовокСтрока");
			Дата = Формат(Дата_П, "ДФ='дд.МММ гг'" );  
			Область.Параметры.Дата = Дата;	
			ПолеОтчета.Вывести(Область, 0);
			
			НетЗаголовокСтрока = Ложь;
		КонецЕсли;	
		
		Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");

		Дата_14 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	    Время_14 = Время_14 + Дата_14 - Дата_01;
		
		Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
		Область.Параметры.Дата = Дата;		

		Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
		Область.Параметры.Месяц = Месяц;		

		ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
		Область.Параметры.ДеньНедели = ДеньНедели;
			
		НомерНаименование = СтрокаЗаявка.НомерВРезерв.Наименование;
		Область.Параметры.Номер = НомерНаименование;
		Область.Параметры.РасшифровкаНомер = СтрокаЗаявка.Заявка;

		КатегорияНомера = СтрокаЗаявка.НомерВРезерв.КатегорияНомера;
		Область.Параметры.КатегорияНомера = КатегорияНомера;

		Область.Параметры.КоличествоЧеловек = СтрокаЗаявка.КолВоЧеловек;
		Область.Параметры.Статус = СтрокаЗаявка.Статус;
		
		КоличествоЗавтраки = 0;
		Если (НЕ СтрокаЗаявка.БезЗавтрака) И (НЕ СтрокаЗаявка.БонШанс) Тогда
			КоличествоЗавтраки = СтрокаЗаявка.КолВоЧеловек;
		КонецЕсли;
		Область.Параметры.КоличествоЗавтраки = КоличествоЗавтраки;
		
		Бронирует = СтрокаЗаявка.Бронирует;
		ЭтоЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Бронирует);
		Если ЭтоЮрЛицо Тогда
			//Область.Параметры.Бронирует = Бронирует;
			Область.Параметры.Бронирует = Бронирует.НаименованиеЮрЛица;
			Область.Параметры.РасшифровкаБронирует = Бронирует;
		КонецЕсли;
		
		Область.Параметры.БронируетИНН = Бронирует.ИНН;
		
		Оплачивает = СтрокаЗаявка.Оплачивает;
		ЭтоЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Оплачивает);
		Если ЭтоЮрЛицо Тогда
			Область.Параметры.ОплатилИНН = Оплачивает.ИНН;
		КонецЕсли;
		
		ЗаявкаЗакрыта = СтрокаЗаявка.Заявка.Закрыто;
		Если ЗаявкаЗакрыта Тогда
			Область.Параметры.ДатаЗакрытияЗаявки = Формат(СтрокаЗаявка.Заявка.ДатаЗакрытия, "ДФ=dd.MM.yy");
		КонецЕсли;
		
		ТЗ_ПроживаниеКоличество = ТЗ_Проживание.Количество();
		Если ТЗ_ПроживаниеКоличество = 0 Тогда  		
			СтрокаПроживание = ОбщийФункционалСервер.СтруктураИзТаблицы(ТЗ_Проживание);
			
			СтрокаПроживание.Цена = 0;
			СтрокаПроживание.Количество = 0;
			СтрокаПроживание.СуммаБезСкидки = 0;
			СтрокаПроживание.Сумма = 0;
		Иначе		
			СтрокаПроживание = ТЗ_Проживание[0];
		КонецЕсли;
		
		ЦенаПроживание = СтрокаПроживание.Цена;
		Если ЦенаПроживание <> 0 Тогда Область.Параметры.ЦенаПроживание = ЦенаПроживание; КонецЕсли;
		
		КоличествоСутокТариф = СтрокаПроживание.Количество;
		Область.Параметры.КоличествоСутокТариф = КоличествоСутокТариф;
			
		Дата_15 = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Время_15 = Время_15 + Дата_15 - Дата_01;
		
		ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(СтрокаЗаявка.Бронирует, СтрокаЗаявка.РезервС); //, СтрокаЗаявка.Заявка.В2В);
		
		СуммаКомиссии = ДокументыСервер.СуммаКомиссии(СтрокаЗаявка, СтрокаПроживание.СуммаБезСкидки
			, СтрокаЗаявка.Заявка.Счета, СтрокаЗаявка.Заявка.СчетаДетальноДолги, ТЗ_Услуги, ПроцентКомиссии);
		
		Если СтрокаЗаявка.Бронирует.Турагентство Тогда
			СуммаПроживание = СтрокаПроживание.СуммаБезСкидки;
			
			Если СтрокаЗаявка.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.Взаимозачет Тогда  
				Если СтрокаЗаявка.Бронирует = СтрокаЗаявка.Оплачивает Тогда  
					СуммаКомиссииИнформационно = СуммаКомиссии;
					СуммаКомиссииКВыплате = 0;
				Иначе	
					СуммаКомиссииИнформационно = 0;
					СуммаКомиссииКВыплате = СуммаКомиссии;
				КонецЕсли;	
			ИначеЕсли СтрокаЗаявка.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой Тогда 
				Если СтрокаЗаявка.Бронирует = СтрокаЗаявка.Оплачивает Тогда  
					СуммаКомиссииИнформационно = СуммаКомиссии;
					СуммаКомиссииКВыплате = 0;
				Иначе	
					СуммаКомиссииИнформационно = 0;
					СуммаКомиссииКВыплате = СуммаКомиссии;
				КонецЕсли;					
			ИначеЕсли СтрокаЗаявка.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ПолнаяОплатаТурагентствомСВозвратомКомиссии Тогда 
				СуммаКомиссииИнформационно = 0;
				СуммаКомиссииКВыплате = СуммаКомиссии;
			Иначе	
				СуммаКомиссииИнформационно = 0;
				СуммаКомиссииКВыплате = СуммаКомиссии;
			КонецЕсли;	
			
		Иначе	
			СуммаПроживание = СтрокаПроживание.Сумма;  
			
			СуммаКомиссии = 0;
			СуммаКомиссииИнформационно = 0; 
			СуммаКомиссииКВыплате = 0;
		КонецЕсли;	
		
		Если СуммаПроживание <> 0 Тогда Область.Параметры.СуммаПроживание = СуммаПроживание; КонецЕсли;
		
		Если СуммаКомиссииИнформационно > 0 Тогда Область.Параметры.СуммаКомиссииИнформационно = СуммаКомиссииИнформационно; КонецЕсли;
		Если СуммаКомиссииКВыплате <> 0 Тогда Область.Параметры.СуммаКомиссииКВыплате = СуммаКомиссииКВыплате; КонецЕсли;
		
		Если ПроцентКомиссии <> 0 Тогда Область.Параметры.ПроцентКомиссии = ПроцентКомиссии; КонецЕсли;

		СуммаКомиссииРаспределено = 0;
		КомиссияДатаОплаты = Неопределено;
		КомиссияТипОплаты = Неопределено;

		ОтборСтроки = Новый Структура("Заявка, Дата", СтрокаЗаявка.Заявка, СтрокаПроживание.ДеньПроживания); 
		Массив_Платежи = ПлатежиРаспределение.НайтиСтроки(ОтборСтроки);
		Если Массив_Платежи.Количество() = 1 Тогда 
			СтрокаПлатежа = Массив_Платежи[0];
			
			СуммаКомиссииРаспределено = СтрокаПлатежа.СуммаРаспределено;
			
			КомиссияДатаОплаты = СтрокаПлатежа.ДокументПлатежа.ДатаОплаты;
			КомиссияТипОплаты = ОтчетыСервер.ТипПлатежаНаименование(СтрокаПлатежа.ДокументПлатежа);
			
			РасшифровкаКомиссияДокументПлатежа = СтрокаПлатежа.ДокументПлатежа;
		ИначеЕсли Массив_Платежи.Количество() > 1 Тогда 
			Для Каждого СтрокаПлатежа Из Массив_Платежи Цикл 
				СуммаКомиссииРаспределено = СуммаКомиссииРаспределено + СтрокаПлатежа.СуммаРаспределено;
			КонецЦикла;
		КонецЕсли;
		Если СуммаКомиссииРаспределено <> 0 Тогда Область.Параметры.СуммаКомиссииОплата = СуммаКомиссииРаспределено; КонецЕсли;
		Если ЗначениеЗаполнено(КомиссияДатаОплаты) Тогда 
			Область.Параметры.КомиссияДатаОплаты = Формат(КомиссияДатаОплаты, "ДФ=dd.MM.yy"); 
			
			Область.Параметры.РасшифровкаКомиссияДокументОплаты = РасшифровкаКомиссияДокументПлатежа; 
		КонецЕсли;
		Если ЗначениеЗаполнено(КомиссияТипОплаты) Тогда Область.Параметры.КомиссияТипОплаты = Формат(КомиссияТипОплаты, "ДФ=dd.MM.yy"); КонецЕсли;
		
		СуммаОплаты = 0;
		СуммаЭквайринга = 0;
		СуммаОплаты_кк =  0;
		СуммаОплаты_нал =  0;
		
		Массив_ОплатыЗаявка = Новый Массив;
		Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
			ВСписке = ОбщийФункционалСервер.ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Проживание);
			Если ВСписке Тогда   
				СуммаОплаты = СуммаОплаты + СтрокаОплаты.СуммаОплаты;
				СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты) ;	
				
				Если СтрокаОплаты.СуммаДокументаОплаты <> 0 Тогда
					СуммаОплаты_кк = СуммаОплаты_кк + 
						Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыКарта / СтрокаОплаты.СуммаДокументаОплаты, 2);
					СуммаОплаты_нал = СуммаОплаты_нал + 
						Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыНаличные / СтрокаОплаты.СуммаДокументаОплаты, 2);
				КонецЕсли;
				
				Массив_ОплатыЗаявка.Добавить(СтрокаОплаты); 				
			КонецЕсли;
			
			ВСписке = ОбщийФункционалСервер.ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Услуги);
			Если ВСписке Тогда   
				СуммаОплаты = СуммаОплаты + СтрокаОплаты.СуммаОплаты;	
				СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты) ;					
				
				Если СтрокаОплаты.СуммаДокументаОплаты <> 0 Тогда
					СуммаОплаты_кк = СуммаОплаты_кк + 
							Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыКарта / СтрокаОплаты.СуммаДокументаОплаты, 2);
					СуммаОплаты_нал = СуммаОплаты_нал + 
						Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыНаличные / СтрокаОплаты.СуммаДокументаОплаты, 2);
				КонецЕсли;
				
				Массив_ОплатыЗаявка.Добавить(СтрокаОплаты); 				
			КонецЕсли;
		КонецЦикла;
		
		Если СуммаОплаты <> 0 Тогда Область.Параметры.СуммаОплаты = СуммаОплаты; КонецЕсли;
		Если СуммаОплаты_кк <> 0 Тогда Область.Параметры.СуммаОплаты_кк = СуммаОплаты_кк; КонецЕсли;
		Если СуммаОплаты_нал <> 0 Тогда Область.Параметры.СуммаОплаты_нал = СуммаОплаты_нал; КонецЕсли;
		
		Если СуммаЭквайринга <> 0 Тогда Область.Параметры.СуммаЭквайринга = СуммаЭквайринга; КонецЕсли;
		
		ЕстьОшибка = Ложь;
		Если Массив_ОплатыЗаявка.Количество() = 1 Тогда
			СтрокаОплатыЗаявка = Массив_ОплатыЗаявка[0];
			
			Если ЗначениеЗаполнено(СтрокаОплатыЗаявка.ДокументОплаты) Тогда
				Область.Параметры.ДатаОплаты = Формат(СтрокаОплатыЗаявка.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
				
				Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплатыЗаявка.ТипОплаты);
				Область.Параметры.ГрупповаяОплата = ?(СтрокаОплатыЗаявка.ГрупповаяОплата, "V", "");

				Если ЗначениеЗаполнено(СтрокаОплатыЗаявка.ДатаСменыККМ) Тогда 
					Область.Параметры.ДатаОткрытияСмены = Формат(СтрокаОплатыЗаявка.ДатаСменыККМ, "ДФ=dd.MM.yy");
				КонецЕсли;

				Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплатыЗаявка.ДокументОплаты;
			Иначе
				Область.Параметры.ДатаОплаты = "Ошибка";
				Область.Параметры.РасшифровкаДокументОплаты = "Ошибочный документ оплаты";
				ЕстьОшибка = Истина;
			КонецЕсли;
			
			
			//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаОплатыЗаявка);
			Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплатыЗаявка);
			
			Область.Параметры.ТипДокументаОплаты = СтрокаОплатыЗаявка.ТипДокументаОплаты;
			Область.Параметры.НомерДокументаОплаты = СтрокаОплатыЗаявка.НомерДокументаОплаты;
			//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаОплатыЗаявка.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
			Область.Параметры.ДатаДокументаОплаты = СтрокаОплатыЗаявка.ДатаДокументаОплаты;
			Область.Параметры.СуммаДокументаОплаты = СтрокаОплатыЗаявка.СуммаДокументаОплаты;
			Область.Параметры.СуммаВозвратаДокументаОплаты = СтрокаОплатыЗаявка.СуммаВозвратаДокументаОплаты;
			Область.Параметры.ОстатокДокументаОплаты = СтрокаОплатыЗаявка.ОстатокДокументаОплаты;
			
			Область.Параметры.СуммаДокументаОплаты_кк = СтрокаОплатыЗаявка.СуммаДокументаОплатыКарта;
			Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаОплатыЗаявка.СуммаДокументаОплатыНаличные;
		
			Область.Параметры.СуммаВозвратаДокументаОплаты_кк = СтрокаОплатыЗаявка.СуммаВозвратаДокументаОплатыКарта;
			Область.Параметры.СуммаВозвратаДокументаОплаты_Нал = СтрокаОплатыЗаявка.СуммаВозвратаДокументаОплатаНаличные;
				
		КонецЕсли;
		
		СуммаЭквайрингаПроживание = ОтчетыСервер.СуммаЭквайрингаПроживание(ТЗ_Проживание, ТЗ_Оплаты);
		
		СуммаНомера = СуммаПроживание - СуммаЭквайрингаПроживание - СуммаКомиссии;
		Если СуммаНомера <> 0 Тогда Область.Параметры.СуммаНомера = СуммаНомера; КонецЕсли;
		
		Область.Параметры.ЗаявкаНомер = СтрокаЗаявка.ЗаявкаНомер;
		Область.Параметры.ЗаявкаДата = СтрокаЗаявка.ЗаявкаДата;
		Область.Параметры.КоличествоСчетов = СтрокаЗаявка.КоличествоСчетов;
		
		Область.Параметры.РасшифровкаЗаявка = СтрокаЗаявка.Заявка;
		
		ОбластьВывода = ПолеОтчета.Вывести(Область, 1);	
~УСЛУГИ:
		ТЗ_УслугиИтого = ТЗ_Услуги.Скопировать();
		ТЗ_УслугиИтого.Колонки.Добавить("УслугаРодитель");
		Для Каждого Строка Из ТЗ_УслугиИтого Цикл 
			Результат = Справочники.ДопУслуги.ПустаяСсылка();
			Ссылка = Строка.Услуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
			
			Строка.УслугаРодитель = Результат;	
		КонецЦикла;	
		ТЗ_УслугиИтого.Свернуть("ДатаУслуги, УслугаРодитель", "Сумма");
		
		Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
			ЕстьСтрока = Ложь;
			Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
				Если СтрокаУслугиИтого.УслугаРодитель = СтрокаРодительУслуги.Папка Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
			КонецЦикла;
			
			ОбластьУслуги = Макет.ПолучитьОбласть("Строка|КолонкаУслуги");
			Если ЕстьСтрока Тогда
				Если СтрокаУслугиИтого.Сумма <> 0 Тогда
					ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.Сумма;
				КонецЕсли;	
			КонецЕсли;
			
			ОбластьВывода = ПолеОтчета.Присоединить(ОбластьУслуги, 1);
		КонецЦикла;
		
		ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
		
		//Если Массив_ОплатыЗаявка.Количество() = 1 ИЛИ ЕстьОшибка Тогда
		//	Если Массив_ОплатыЗаявка[0].ОстатокДокументаОплаты > 0 ИЛИ ЕстьОшибка Тогда 
		//		ВыведеннаяОбласть.ЦветФона = Новый Цвет(220, 220, 220);
		//	КонецЕсли;	
		//КонецЕсли;	
		Если Массив_ОплатыЗаявка.Количество() = 1 ИЛИ ЕстьОшибка Тогда
			//Если Массив_ОплатыЗаявка[0].ОстатокДокументаОплаты > 0 Тогда 
			//	ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);
			//КонецЕсли;	
			Если ЕстьОшибка Тогда 
				ВыведеннаяОбласть.ЦветФона = Новый Цвет(220, 220, 220);
			КонецЕсли;	
		КонецЕсли;	
		
		СуммаУслуги_П = ТЗ_Услуги.Итог("Сумма");
		СуммаПроживание_П = СтрокаПроживание.Сумма; 

		Если СуммаПроживание_П + СуммаУслуги_П <> СуммаОплаты Тогда
			//ШрифтСтроки = Новый Шрифт(ВыведеннаяОбласть.Шрифт, , , ,Истина);
			ШрифтСтроки = Новый Шрифт("Arial", 8, Ложь ,Истина);
			
			ВыведеннаяОбласть.Шрифт = ШрифтСтроки;
			
			ЦветТекстаСтроки = Новый Цвет(255, 0, 0);
		Иначе
			Если СуммаКомиссииКВыплате <> СуммаКомиссииРаспределено Тогда  		
				ЦветТекстаСтроки = Новый Цвет(185, 30, 175);
			Иначе
				ЦветТекстаСтроки = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ЦветТекстаСтроки <> Неопределено Тогда
			ВыведеннаяОбласть.ЦветТекста = ЦветТекстаСтроки;
		КонецЕсли;
		
// Платежи
		Если Массив_Платежи.Количество() > 1 Тогда	
			Для Каждого СтрокаПлатежи Из Массив_Платежи Цикл
				ОбластьПлатежи = Макет.ПолучитьОбласть("СтрокаПлатежи|КолонкиЛево");
				
				ОбластьПлатежи.Параметры.Дата = ".";
				
				ОбластьПлатежи.Параметры.ЗаявкаНомер = СтрокаЗаявка.ЗаявкаНомер;
				ОбластьПлатежи.Параметры.ЗаявкаДата = СтрокаЗаявка.ЗаявкаДата;
	
				СуммаКомиссииРаспределено = СтрокаПлатежа.СуммаРаспределено;
				
				КомиссияДатаОплаты = СтрокаПлатежа.ДокументПлатежа.ДатаОплаты;
				КомиссияТипОплаты = ОтчетыСервер.ТипПлатежаНаименование(СтрокаПлатежа.ДокументПлатежа);
				
				РасшифровкаКомиссияДокументПлатежа = СтрокаПлатежа.ДокументПлатежа;
			
				Если СуммаКомиссииРаспределено <> 0 Тогда ОбластьПлатежи.Параметры.СуммаКомиссииОплата = СуммаКомиссииРаспределено; КонецЕсли;
				Если ЗначениеЗаполнено(КомиссияДатаОплаты) Тогда 
					ОбластьПлатежи.Параметры.КомиссияДатаОплаты = Формат(КомиссияДатаОплаты, "ДФ=dd.MM.yy"); 
					
					ОбластьПлатежи.Параметры.РасшифровкаКомиссияДокументОплаты = РасшифровкаКомиссияДокументПлатежа; 
				КонецЕсли;
				Если ЗначениеЗаполнено(КомиссияТипОплаты) Тогда ОбластьПлатежи.Параметры.КомиссияТипОплаты = Формат(КомиссияТипОплаты, "ДФ=dd.MM.yy"); КонецЕсли;
			КонецЦикла;
			
			ПолеОтчета.Вывести(ОбластьПлатежи, 1);
		КонецЕсли;
		
// ОПЛАТЫ
		Если Массив_ОплатыЗаявка.Количество() > 1 Тогда
			Для Каждого СтрокаОплаты Из Массив_ОплатыЗаявка Цикл
				ОбластьОплаты = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
				
				ОбластьОплаты.Параметры.Дата = ".";
				
				ОбластьОплаты.Параметры.ЗаявкаНомер = СтрокаЗаявка.ЗаявкаНомер;
				ОбластьОплаты.Параметры.ЗаявкаДата = СтрокаЗаявка.ЗаявкаДата;
				
				ЕстьОшибка = Ложь;
				Если ЗначениеЗаполнено(СтрокаОплаты.ДокументОплаты) Тогда
					ОбластьОплаты.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
					
					ОбластьОплаты.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
					ОбластьОплаты.Параметры.ГрупповаяОплата = ?(СтрокаОплаты.ГрупповаяОплата, "V", "");
					
					Если ЗначениеЗаполнено(СтрокаОплаты.ДатаСменыККМ) Тогда 
						ОбластьОплаты.Параметры.ДатаОткрытияСмены = Формат(СтрокаОплаты.ДатаСменыККМ, "ДФ=dd.MM.yy");
					КонецЕсли;
					
					ОбластьОплаты.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
				Иначе
					ЕстьОшибка = Истина;
					ОбластьОплаты.Параметры.ДатаОплаты = "Ошибка";
					ОбластьОплаты.Параметры.РасшифровкаДокументОплаты = "Ошибочный документ оплаты";
				КонецЕсли;
				
				ОбластьОплаты.Параметры.СуммаОплаты = СтрокаОплаты.СуммаОплаты;
				
				Если СтрокаОплаты.СуммаДокументаОплаты <> 0 Тогда
					ОбластьОплаты.Параметры.СуммаОплаты_кк = 
						Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыКарта / СтрокаОплаты.СуммаДокументаОплаты, 2);

					ОбластьОплаты.Параметры.СуммаОплаты_нал = 
						Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыНаличные / СтрокаОплаты.СуммаДокументаОплаты, 2);
				КонецЕсли;	
				
				ОбластьОплаты.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
			
				ОбластьОплаты.Параметры.РасшифровкаЗаявка = СтрокаЗаявка.Заявка;
				
				//Область.Параметры.Оплатил = СтрокаОплаты.ДокументОплаты.ОтКого;
				//ОбластьОплаты.Параметры.Оплатил = ОплатилНаименование(СтрокаОплаты);
				ОбластьОплаты.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплаты);
				
				ОбластьОплаты.Параметры.ТипДокументаОплаты = СтрокаОплаты.ТипДокументаОплаты;
				ОбластьОплаты.Параметры.НомерДокументаОплаты = СтрокаОплаты.НомерДокументаОплаты;
				//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаОплаты.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
				ОбластьОплаты.Параметры.ДатаДокументаОплаты = СтрокаОплаты.ДатаДокументаОплаты;
				ОбластьОплаты.Параметры.СуммаДокументаОплаты = СтрокаОплаты.СуммаДокументаОплаты;
				ОбластьОплаты.Параметры.СуммаВозвратаДокументаОплаты = СтрокаОплаты.СуммаВозвратаДокументаОплаты;
				ОбластьОплаты.Параметры.ОстатокДокументаОплаты = СтрокаОплаты.ОстатокДокументаОплаты;
				
				ОбластьОплаты.Параметры.СуммаДокументаОплаты_кк = СтрокаОплаты.СуммаДокументаОплатыКарта;
				ОбластьОплаты.Параметры.СуммаДокументаОплаты_Нал = СтрокаОплаты.СуммаДокументаОплатыНаличные;
				
				ОбластьОплаты.Параметры.СуммаВозвратаДокументаОплаты_кк = СтрокаОплаты.СуммаВозвратаДокументаОплатыКарта;
				ОбластьОплаты.Параметры.СуммаВозвратаДокументаОплаты_Нал = СтрокаОплаты.СуммаВозвратаДокументаОплатаНаличные;
				//Область.Параметры.ПроцентЭквайринга = СтрокаОплаты.ПроцентЭквайринга;
			
				Если СтрокаОплаты.Услуга Тогда
					
					Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
						ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ДолгиГУИД);
						НайденныеСтроки = ТЗ_Услуги.НайтиСтроки(ОтборСтроки);
						
						ЕстьСтрока = Ложь;
						Для Каждого Строка Из НайденныеСтроки Цикл
							Результат = Справочники.ДопУслуги.ПустаяСсылка();
							Ссылка = Строка.Услуга; 
							ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
							
							Если Результат = СтрокаРодительУслуги.Папка Тогда
								ЕстьСтрока = Истина;
								
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ЕстьСтрока Тогда Прервать;  КонецЕсли;
					КонецЦикла;	
					
					Если ЕстьСтрока Тогда  
						ПолеОтчета.Вывести(ОбластьОплаты, 1);
					КонецЕсли;
					
					Если ЕстьСтрока Тогда 
						Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
							ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ДолгиГУИД);
							НайденныеСтроки = ТЗ_Услуги.НайтиСтроки(ОтборСтроки);
							
							ЕстьСтрока = Ложь;
							Для Каждого Строка Из НайденныеСтроки Цикл
								Результат = Справочники.ДопУслуги.ПустаяСсылка();
								Ссылка = Строка.Услуга; 
								ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
								
								Если Результат = СтрокаРодительУслуги.Папка Тогда
									ЕстьСтрока = Истина;
									
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
							ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
							Если ЕстьСтрока Тогда
								ОбластьУслуги.Параметры.СуммаУслуги = СтрокаОплаты.СуммаОплаты;
							КонецЕсли;
							
							ОбластьВывода = ПолеОтчета.Присоединить(ОбластьУслуги, 1);
						КонецЦикла;
					КонецЕсли;
				Иначе
					ВСписке = ОбщийФункционалСервер.ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Проживание); 
					Если ВСписке Тогда 
						ОбластьОплаты.Параметры.СуммаПроживание = СтрокаОплаты.СуммаОплаты;
						ОбластьВывода = ПолеОтчета.Вывести(ОбластьОплаты, 1);
					КонецЕсли;
				КонецЕсли;
				
				ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
				
				//Если СтрокаОплаты.ОстатокДокументаОплаты > 0 ИЛИ ЕстьОшибка Тогда
				//	ВыведеннаяОбласть.ЦветФона = Новый Цвет(235, 235, 235);
				//КонецЕсли;
				Если ЕстьОшибка Тогда
					ВыведеннаяОбласть.ЦветФона = Новый Цвет(220, 220, 220);
				КонецЕсли;
				Если СтрокаОплаты.ОстатокДокументаОплаты > 0 Тогда
					ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
////
		ИтогиДень.КоличествоНочей = ИтогиДень.КоличествоНочей + 1;
		ИтогиДень.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф + КоличествоСутокТариф;
		
		ИтогиДень.СуммаЦенаПроживание = ИтогиДень.СуммаЦенаПроживание + ЦенаПроживание;
		ИтогиДень.СуммаПроживание = ИтогиДень.СуммаПроживание + СуммаПроживание;
		
		ИтогиДень.СуммаНомера = ИтогиДень.СуммаНомера + СуммаНомера;
		
		ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
		ИтогиДень.СуммаОплаты_кк = ИтогиДень.СуммаОплаты_кк + СуммаОплаты_кк;
		ИтогиДень.СуммаОплаты_нал = ИтогиДень.СуммаОплаты_нал + СуммаОплаты_нал;
		
		ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
		
		ИтогиДень.СуммаКомиссииИнформационно = ИтогиДень.СуммаКомиссииИнформационно + СуммаКомиссииИнформационно;
		ИтогиДень.СуммаКомиссииКВыплате = ИтогиДень.СуммаКомиссииКВыплате + СуммаКомиссииКВыплате;
		ИтогиДень.СуммаКомиссииОплата = ИтогиДень.СуммаКомиссииОплата + СуммаКомиссииРаспределено;
		
		Если НЕ (СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
		ИЛИ СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
		Тогда 
			ИтогиДень.КоличествоСтатус = ИтогиДень.КоличествоСтатус + 1;
		КонецЕсли;
		
		Если НЕ (СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
		ИЛИ СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
		Тогда 
			ИтогиДень.КоличествоЗавтраки = ИтогиДень.КоличествоЗавтраки + КоличествоЗавтраки;
		КонецЕсли;
		
		ИтогиДень.КоличествоЧеловек = ИтогиДень.КоличествоЧеловек + СтрокаЗаявка.КолВоЧеловек;
		
		//Если ТЗ_УслугиИтого <> Неопределено Тогда 
			Для Каждого СтрокаУслугиДеньИтого Из ИтогиДень.УслугиДеньИтоги Цикл 
				ЕстьСтрока = Ложь;
				Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
					Если СтрокаУслугиИтого.УслугаРодитель = СтрокаУслугиДеньИтого.УслугаРодитель Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
				КонецЦикла;
				
				Если ЕстьСтрока Тогда 
					Если СтрокаУслугиИтого.Сумма <> 0 Тогда
						СтрокаУслугиДеньИтого.СуммаУслуги = СтрокаУслугиДеньИтого.СуммаУслуги + СтрокаУслугиИтого.Сумма;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;
		//КонецЕсли;
		
~ПРОДОЛЖИТЬ_Заявки:		
		Дата_100 = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Время_100 = Время_100 + Дата_100 - Дата_01;
	КонецЦикла;
	
	Если НетЗаголовокСтрока Тогда Перейти ~ПРОДОЛЖИТЬ_ДатаОтчетаПо; КонецЕсли; 	
		
	ОбластьИтогиДень = Макет.ПолучитьОбласть("ИтогиДень|КолонкиЛево");
	
	Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
	ОбластьИтогиДень.Параметры.Дата = Дата;		

	Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
	ОбластьИтогиДень.Параметры.Месяц = Месяц;		

	ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
	ОбластьИтогиДень.Параметры.ДеньНедели = ДеньНедели;

	ОбластьИтогиДень.Параметры.Номер = "Итого Ночей:";
	ОбластьИтогиДень.Параметры.КатегорияНомера = ИтогиДень.КоличествоНочей;
	ОбластьИтогиДень.Параметры.ЦенаПроживание = ИтогиДень.СуммаЦенаПроживание;
	ОбластьИтогиДень.Параметры.СуммаПроживание = ИтогиДень.СуммаПроживание;
	ОбластьИтогиДень.Параметры.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф;
	
	ОбластьИтогиДень.Параметры.СуммаКомиссииИнформационно = ИтогиДень.СуммаКомиссииИнформационно;
	ОбластьИтогиДень.Параметры.СуммаКомиссииКВыплате = ИтогиДень.СуммаКомиссииКВыплате;
	ОбластьИтогиДень.Параметры.СуммаКомиссииОплата = ИтогиДень.СуммаКомиссииОплата;
	
	ОбластьИтогиДень.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
	ОбластьИтогиДень.Параметры.СуммаОплаты_кк = ИтогиДень.СуммаОплаты_кк;
	ОбластьИтогиДень.Параметры.СуммаОплаты_нал = ИтогиДень.СуммаОплаты_нал;
	
	ОбластьИтогиДень.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
	ОбластьИтогиДень.Параметры.СуммаНомера = ИтогиДень.СуммаНомера;
	
	ОбластьИтогиДень.Параметры.КоличествоСтатус = ИтогиДень.КоличествоСтатус;
	ОбластьИтогиДень.Параметры.КоличествоЗавтраки = ИтогиДень.КоличествоЗавтраки;
	
	ОбластьИтогиДень.Параметры.КоличествоЧеловек = ИтогиДень.КоличествоЧеловек;

	ПолеОтчета.Вывести(ОбластьИтогиДень, 0);
	
	Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
		ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
		Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
			ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
		КонецЕсли;	
		ПолеОтчета.Присоединить(ОбластьУслуги, 0);
	КонецЦикла;

//
	Итоги.КоличествоНочей = Итоги.КоличествоНочей + ИтогиДень.КоличествоНочей;
	Итоги.КоличествоСутокТариф = Итоги.КоличествоСутокТариф + ИтогиДень.КоличествоСутокТариф;
	
	Итоги.СуммаЦенаПроживание = Итоги.СуммаЦенаПроживание + ИтогиДень.СуммаЦенаПроживание;
	Итоги.СуммаПроживание = Итоги.СуммаПроживание + ИтогиДень.СуммаПроживание;
	
	Итоги.СуммаНомера = Итоги.СуммаНомера + ИтогиДень.СуммаНомера;
	
	Итоги.СуммаОплаты = Итоги.СуммаОплаты + ИтогиДень.СуммаОплаты;
	Итоги.СуммаОплаты_кк = Итоги.СуммаОплаты_кк + ИтогиДень.СуммаОплаты_кк;
	Итоги.СуммаОплаты_нал = Итоги.СуммаОплаты_нал + ИтогиДень.СуммаОплаты_нал;
	
	Итоги.СуммаЭквайринга = Итоги.СуммаЭквайринга + ИтогиДень.СуммаЭквайринга;  
	
	Итоги.СуммаКомиссииИнформационно = Итоги.СуммаКомиссииИнформационно + ИтогиДень.СуммаКомиссииИнформационно;
	Итоги.СуммаКомиссииКВыплате = Итоги.СуммаКомиссииКВыплате + ИтогиДень.СуммаКомиссииКВыплате;
	Итоги.СуммаКомиссииОплата = Итоги.СуммаКомиссииОплата + ИтогиДень.СуммаКомиссииОплата;
	
	Итоги.КоличествоСтатус = Итоги.КоличествоСтатус + ИтогиДень.КоличествоСтатус;
	Итоги.КоличествоЗавтраки = Итоги.КоличествоЗавтраки + ИтогиДень.КоличествоЗавтраки;

	Итоги.КоличествоЧеловек = Итоги.КоличествоЧеловек + ИтогиДень.КоличествоЧеловек;
	
	Для Индекс = 0 По Итоги.УслугиИтоги.Количество() - 1 Цикл
		Итоги.УслугиИтоги[Индекс].СуммаУслуги = Итоги.УслугиИтоги[Индекс].СуммаУслуги 
			+ ИтогиДень.УслугиДеньИтоги[Индекс].СуммаУслуги;		
	КонецЦикла;

~ПРОДОЛЖИТЬ_ДатаОтчетаПо:	
	Дата_200 = ТекущаяУниверсальнаяДатаВМиллисекундах();
    Время_200 = Время_200 + Дата_200 - Дата_0;

	Дата_П = Дата_П + 60*60*24;	
КонецЦикла;	
ПолеОтчета.ЗакончитьАвтогруппировкуСтрок();

ТекстВремя = "Время_200: " + Строка(Время_200) 
+ ", Время_100: " + Строка(Время_100)
+ ", Время_1: " + Строка(Время_1)
+ ", Время_2: " + Строка(Время_2)
+ ", Время_11: " + Строка(Время_11)
+ ", Время_12: " + Строка(Время_12) 
+ ", Время_101: " + Строка(Время_101)
+ ", Время_102: " + Строка(Время_102)
+ ", Время_13: " + Строка(Время_13)
+ ", Время_14: " + Строка(Время_14)
+ ", Время_15: " + Строка(Время_15)
;
//Сообщить(ТекстВремя);


Область = Макет.ПолучитьОбласть("Итоги|КолонкиЛево");

Область.Параметры.ИтогиДаты = "Период с " + Формат(ДатаОтчетаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаОтчетаПо, "ДФ=dd.MM.yy");

Область.Параметры.Номер = "Итого Ночей:";
Область.Параметры.КатегорияНомера = Итоги.КоличествоНочей;
Область.Параметры.ЦенаПроживание = Итоги.СуммаЦенаПроживание;
Область.Параметры.СуммаПроживание = Итоги.СуммаПроживание;
Область.Параметры.КоличествоСутокТариф = Итоги.КоличествоСутокТариф;

Область.Параметры.СуммаКомиссииИнформационно = Итоги.СуммаКомиссииИнформационно;
Область.Параметры.СуммаКомиссииКВыплате = Итоги.СуммаКомиссииКВыплате;
Область.Параметры.СуммаКомиссииОплата = Итоги.СуммаКомиссииОплата;

Область.Параметры.СуммаОплаты = Итоги.СуммаОплаты;
Область.Параметры.СуммаОплаты_кк = Итоги.СуммаОплаты_кк;
Область.Параметры.СуммаОплаты_нал = Итоги.СуммаОплаты_нал;

Область.Параметры.СуммаЭквайринга = Итоги.СуммаЭквайринга;
Область.Параметры.СуммаНомера = Итоги.СуммаНомера;

Область.Параметры.КоличествоСтатус = Итоги.КоличествоСтатус;
Область.Параметры.КоличествоЗавтраки = Итоги.КоличествоЗавтраки;

Область.Параметры.КоличествоЧеловек = Итоги.КоличествоЧеловек;

ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из Итоги.УслугиИтоги Цикл
	Область = Макет.ПолучитьОбласть("Итоги|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		Область.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(Область, 0);
КонецЦикла;

//Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
//КолонкаКоличествоСчетов = Область.ШиринаТаблицы;
//ПолеОтчета.Область(, КолонкаКоличествоСчетов, ,КолонкаКоличествоСчетов).Видимость = Ложь;  

Возврат ПолеОтчета;
КонецФункции

//
Функция СформироватьНераспределенныеОплаты(Знач Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт
////
// + Нераспределенные оплаты
//НеПоказыватьЗакрытыеНераспределенныеОплаты = Истина;

ПолеОтчета = Новый ТабличныйДокумент;

Список_ОплатыКоворкингКассовыйДокумент = Список_ОплатыКоворкинг("КД");
Список_ОплатыКоворкингВыпискаБанка = Список_ОплатыКоворкинг("ВБ");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Заявка,
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) КАК СуммаОплаты,
                      |	КассовыйДокумент.Номер КАК НомерДокументаОплаты,
                      |	КассовыйДокумент.Дата КАК ДатаДокументаОплаты,
                      |	КассовыйДокумент.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА КассовыйДокумент.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ КассовыйДокумент.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	NULL КАК КонтрагентИНН,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплатыКасса,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	ЕСТЬNULL(Возвраты.СуммаНаличные, 0) КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	ЕСТЬNULL(Возвраты.СуммаКарта, 0) КАК СуммаВозвратаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ЛОЖЬ КАК ЭтоЭквайринг,
                      |	""КД"" КАК ТипДокументаОплаты,
                      |	ЕСТЬNULL(КассоваяСмена.НачалоКассовойСмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыККМ
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ДолгиОплата_КД
                      |		ПО КассовыйДокумент.Ссылка = ДолгиОплата_КД.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
                      |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |			КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
                      |			МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
                      |				ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
                      |					И (ВЫБОР
                      |						КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
                      |							ТОГДА ИСТИНА
                      |						ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
                      |					КОНЕЦ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.Ссылка,
                      |			КассоваяСмена.НомерСменыККТ) КАК КассоваяСмена
                      |		ПО КассовыйДокумент.Ссылка = КассоваяСмена.ДокументОплаты
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Приход = ИСТИНА
                      |	И КассовыйДокумент.ЭтоПроизвольныйЧек = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА ДолгиОплата_КД.Ссылка ЕСТЬ NULL
                      |				ТОГДА ВЫБОР
                      |						КОГДА &НеПоказыватьЗакрытыеНераспределенныеОплаты
                      |							ТОГДА КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) <> 0
                      |						ИНАЧЕ ИСТИНА
                      |					КОНЕЦ
                      |			ИНАЧЕ КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) <> 0
                      |		КОНЕЦ
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания");
					  
					  //|	И НЕ КассовыйДокумент.Ссылка В (&СписокКоворкинг)");		

					  //|			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)


ДатаНачала = '20230101';

Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ТекущаяДата();
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		

Запрос.УстановитьПараметр("НеПоказыватьЗакрытыеНераспределенныеОплаты", НеПоказыватьЗакрытыеНераспределенныеОплаты);		

//Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингКассовыйДокумент);

ТЗ = Запрос.Выполнить().Выгрузить();	

ТЗ_НераспределенныеОплаты = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_НераспределенныеОплаты.Колонки.Найти("ДокументОплаты");
ТЗ_НераспределенныеОплаты.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_НераспределенныеОплаты.Колонки.Добавить("ДокументОплаты");

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Заявка,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) КАК СуммаОплаты,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	ВыпискаБанка.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВыпискаБанка.ОтКого.ИНН КАК КонтрагентИНН,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	0 КАК СуммаДокументОплатыКасса,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВыпискаБанка.ЭтоЭквайринг КАК ЭтоЭквайринг,
                      |	""ВБ"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ДолгиОплата_ВБ
                      |		ПО ВыпискаБанка.Ссылка = ДолгиОплата_ВБ.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Приход = ИСТИНА
                      |	И ВЫБОР
                      |			КОГДА ДолгиОплата_ВБ.Ссылка ЕСТЬ NULL
                      |				ТОГДА ВЫБОР
                      |						КОГДА &НеПоказыватьЗакрытыеНераспределенныеОплаты
                      |							ТОГДА ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) <> 0
                      |						ИНАЧЕ ИСТИНА
                      |					КОНЕЦ
                      |			ИНАЧЕ ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) <> 0
                      |		КОНЕЦ
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания");

					  //|	И НЕ ВыпискаБанка.Ссылка В (&СписокКоворкинг)");
					  
					  //|			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)

//ДатаНачала = '20230101';

Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ТекущаяДата();
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);			

Запрос.УстановитьПараметр("НеПоказыватьЗакрытыеНераспределенныеОплаты", НеПоказыватьЗакрытыеНераспределенныеОплаты);			

//Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингВыпискаБанка);

ТЗ = Запрос.Выполнить().Выгрузить();
	
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

СписокКонтрагентыИИН_Эквайринг = БезналРаспределениеСервер.СписокИННЭквайринг();
ПолучательПлатежа = Константы.ПолучательПлатежаБезнал.Получить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Заявка,
                      |	БезналЗагрузка.ГУИД КАК ДокументОплаты,
                      |	NULL КАК СчетГУИД,
                      |	NULL КАК Услуга,
                      |	БезналЗагрузка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	NULL КАК ТипОплаты,
                      |	ИСТИНА КАК ЭтоЭквайринг,
                      |	""НО"" КАК ТипДокументаОплаты,
                      |	NULL КАК НомерДокументаОплаты,
                      |	NULL КАК ДатаДокументаОплаты,
                      |	NULL КАК СуммаВозвратаДокументаОплаты,
                      |	БезналЗагрузка.ДатаОплаты КАК ДатаОплаты,
                      |	БезналЗагрузка.КонтрагентИНН КАК КонтрагентИНН,
                      |	БезналЗагрузка.ТекстПлатежа КАК ТекстПлатежа,
                      |	БезналЗагрузка.КонтрагентНаименование КАК КонтрагентНаименование,
                      |	ЕСТЬNULL(ВыпискаБанка.Сумма, 0) КАК СуммаОплаты,
                      |	БезналЗагрузка.Сумма - ЕСТЬNULL(ВыпискаБанка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано КАК ОстатокДокументаОплаты
                      |ИЗ
                      |	РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаОплата.ГУИДЗагрузка КАК ГУИДЗагрузка,
                      |			СУММА(ВыпискаБанкаОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанкаОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаОплата.ГУИДЗагрузка) КАК ВыпискаБанка
                      |		ПО БезналЗагрузка.ГУИД = ВыпискаБанка.ГУИДЗагрузка
                      |ГДЕ
                      |	БезналЗагрузка.Отменено = ЛОЖЬ
                      |	И БезналЗагрузка.Сумма - ЕСТЬNULL(ВыпискаБанка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано <> 0
                      |	И (БезналЗагрузка.ПолучательПлатежа = """"
                      |			ИЛИ БезналЗагрузка.ПолучательПлатежа = &ПолучательПлатежа)
                      |	И БезналЗагрузка.ДатаОплаты >= &ДатаНачала
                      |	И БезналЗагрузка.ДатаОплаты <= &ДатаОкончания
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаОплаты");


//ДатаНачала = '20230101';

Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ТекущаяДата();
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);							  

//                      |	ВЫБОР
//                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
//                      |			ТОГДА ВЫБОР
//                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
//                      |						ТОГДА 5
//                      |					ИНАЧЕ 4
//                      |				КОНЕЦ
//                      |		ИНАЧЕ 3
//                      |	КОНЕЦ КАК ТипОплаты,

Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);		
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	ЗначениеИНН = СписокКонтрагентыИИН_Эквайринг.НайтиПоЗначению(Строка.КонтрагентИНН);
	ЕстьВСписке = (ЗначениеИНН <> Неопределено);
	Если ЕстьВСписке Тогда
		Если СтрНайти(Строка.ТекстПлатежа,"СБП") > 0 Тогда
			НоваяСтрока.ТипОплаты = 5;
		Иначе	
			НоваяСтрока.ТипОплаты = 4;
		КонецЕсли;
		
		НоваяСтрока.ЭтоЭквайринг = Истина;
	Иначе
		НоваяСтрока.ТипОплаты = 3;
		
		НоваяСтрока.ЭтоЭквайринг = Ложь;
	КонецЕсли;
КонецЦикла;

ТЗ_НераспределенныеОплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_НераспределенныеОплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_НераспределенныеОплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга <= &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	//Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);
	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;
// - Нераспределенные оплаты

ТЗ_НераспределенныеОплаты.Сортировать("ДатаОплаты");

// + Нераспределенные оплаты
//Область = Макет.ПолучитьОбласть("ШапкаНераспределенныеОплатыДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ШапкаНераспределенныеОплатыДополнение");
ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаНераспределенныеОплаты Из ТЗ_НераспределенныеОплаты Цикл
	Область = Макет.ПолучитьОбласть("СтрокаНераспределенныеОплатыДополнение|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаНераспределенныеОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаНераспределенныеОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	Если ЗначениеЗаполнено(СтрокаНераспределенныеОплаты.ДатаСменыККМ) Тогда
		Область.Параметры.ДатаОткрытияСмены = Формат(СтрокаНераспределенныеОплаты.ДатаСменыККМ, "ДФ=dd.MM.yy");
	КонецЕсли;
	
	Область.Параметры.СуммаОплаты = СтрокаНераспределенныеОплаты.СуммаОплаты;
	Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаНераспределенныеОплаты);
	
	Если СтрокаНераспределенныеОплаты.СуммаДокументаОплаты <> 0 Тогда
		Область.Параметры.СуммаОплаты_кк = Окр(СтрокаНераспределенныеОплаты.СуммаОплаты 
				* СтрокаНераспределенныеОплаты.СуммаДокументаОплатыКарта / СтрокаНераспределенныеОплаты.СуммаДокументаОплаты, 2);
		Область.Параметры.СуммаОплаты_Нал = Окр(СтрокаНераспределенныеОплаты.СуммаОплаты 
				* СтрокаНераспределенныеОплаты.СуммаДокументаОплатыНаличные / СтрокаНераспределенныеОплаты.СуммаДокументаОплаты, 2);
	КонецЕсли;
			
	Если ТипЗнч(СтрокаНераспределенныеОплаты.ДокументОплаты) = Тип("УникальныйИдентификатор") Тогда
		Область.Параметры.РасшифровкаДокументОплаты = "Нераспределенная выгрузка";
	Иначе	
		Область.Параметры.РасшифровкаДокументОплаты = СтрокаНераспределенныеОплаты.ДокументОплаты;
	КонецЕсли;
				
	Область.Параметры.ТипДокументаОплаты = СтрокаНераспределенныеОплаты.ТипДокументаОплаты;
	Область.Параметры.НомерДокументаОплаты = СтрокаНераспределенныеОплаты.НомерДокументаОплаты;
	//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаНераспределенныеОплаты.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
	Область.Параметры.ДатаДокументаОплаты = СтрокаНераспределенныеОплаты.ДатаДокументаОплаты;
	Область.Параметры.СуммаДокументаОплаты = СтрокаНераспределенныеОплаты.СуммаДокументаОплаты;
	Область.Параметры.СуммаВозвратаДокументаОплаты = СтрокаНераспределенныеОплаты.СуммаВозвратаДокументаОплаты;
	Область.Параметры.ОстатокДокументаОплаты = СтрокаНераспределенныеОплаты.ОстатокДокументаОплаты;
	
	//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаНераспределенныеОплаты);
	Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаНераспределенныеОплаты);
	Область.Параметры.ОплатилИНН = СтрокаНераспределенныеОплаты.КонтрагентИНН;
	
	Область.Параметры.СуммаДокументаОплаты_кк = СтрокаНераспределенныеОплаты.СуммаДокументаОплатыКарта;
	Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаНераспределенныеОплаты.СуммаДокументаОплатыНаличные;
	
	Область.Параметры.СуммаВозвратаДокументаОплаты_кк = СтрокаНераспределенныеОплаты.СуммаВозвратаДокументаОплатыКарта;
	Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаНераспределенныеОплаты.СуммаДокументаОплатыНаличные;
	
	ОбластьВывода = ПолеОтчета.Вывести(Область, 0);
	ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
КонецЦикла;

//Область = Макет.ПолучитьОбласть("ПодножиеНераспределенныеОплатыДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ПодножиеНераспределенныеОплатыДополнение");
ПолеОтчета.Вывести(Область, 0);
// - Нераспределенные оплаты

Возврат ПолеОтчета;       
КонецФункции

Функция СформироватьОплатыБрони(Знач Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт

ПолеОтчета = Новый ТабличныйДокумент;

ТЗ_РодительУслуги = ТЗ_УслугиРодитель();

ПлатежиКонтрагенту = ПлатежиКонтрагенту(ДатаОтчетаС, ДатаОтчетаПо);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	ЗаявкиОплаты.Ссылка КАК Заявка,
                      |	ЗаявкиОплаты.Ссылка.РезервС КАК РезервС,
                      |	ЕСТЬNULL(ЗаявкиОплаты.СуммаРаспределено, 0) КАК СуммаОплаты,
                      |	ЕСТЬNULL(ЗаявкиОплаты.ГрупповаяОплата, ЛОЖЬ) КАК ГрупповаяОплата,
                      |	КассовыйДокумент.Номер КАК НомерДокументаОплаты,
                      |	КассовыйДокумент.Дата КАК ДатаДокументаОплаты,
                      |	КассовыйДокумент.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА КассовыйДокумент.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ КассовыйДокумент.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	ЕСТЬNULL(Возвраты.СуммаКарта, 0) КАК СуммаВозвратаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.СуммаНаличные, 0) КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ДолгиОплатыСумма,
                      |	КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |			ТОГДА 8
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ЛОЖЬ КАК ЭтоЭквайринг,
                      |	""КД"" КАК ТипДокументаОплаты,
                      |	ЕСТЬNULL(КассоваяСмена.НачалоКассовойСмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыККМ
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
                      |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата КАК ГрупповаяОплата,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноОплаты.СуммаРаспределено) КАК СуммаРаспределено
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты) КАК ЗаявкиОплаты
                      |		ПО КассовыйДокумент.Ссылка = ЗаявкиОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ДолгиОплаты
                      |		ПО КассовыйДокумент.Ссылка = ДолгиОплаты.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |			КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
                      |			МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
                      |				ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
                      |					И (ВЫБОР
                      |						КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
                      |							ТОГДА ИСТИНА
                      |						ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
                      |					КОНЕЦ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.Ссылка,
                      |			КассоваяСмена.НомерСменыККТ) КАК КассоваяСмена
                      |		ПО КассовыйДокумент.Ссылка = КассоваяСмена.ДокументОплаты
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания");
					  
					  
ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	
ТЗ = Запрос.Выполнить().Выгрузить();	

ТЗ_ОплатыБронь = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_ОплатыБронь.Колонки.Найти("ДокументОплаты");
ТЗ_ОплатыБронь.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_ОплатыБронь.Колонки.Добавить("ДокументОплаты");

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ЗаявкиОплаты.Ссылка КАК Заявка,
                      |	ЗаявкиОплаты.Ссылка.РезервС КАК РезервС,
                      |	ЕСТЬNULL(ЗаявкиОплаты.СуммаРаспределено, 0) КАК СуммаОплаты,
                      |	ЕСТЬNULL(ЗаявкиОплаты.ГрупповаяОплата, ЛОЖЬ) КАК ГрупповаяОплата,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	ВыпискаБанка.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	0 КАК СуммаВозвратаДокументаОплатыКарта,
                      |	0 КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ДолгиОплатыСумма,
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |			ТОГДА 8
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВыпискаБанка.ЭтоЭквайринг КАК ЭтоЭквайринг,
                      |	""ВБ"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата КАК ГрупповаяОплата,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноОплаты.СуммаРаспределено) КАК СуммаРаспределено
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты) КАК ЗаявкиОплаты
                      |		ПО ВыпискаБанка.Ссылка = ЗаявкиОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ДолгиОплаты
                      |		ПО ВыпискаБанка.Ссылка = ДолгиОплаты.Ссылка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Возврат = ЛОЖЬ
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания");		

					  //|			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		
ТЗ = Запрос.Выполнить().Выгрузить();
	
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

ТЗ_ОплатыБронь.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_ОплатыБронь.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_ОплатыБронь Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга <= &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;
// - Оплаты 

ТЗ_ОплатыБронь.Сортировать("ДатаОплаты, ДокументОплаты, Заявка");

// + Оплаты Бронь
//Область = Макет.ПолучитьОбласть("ШапкаОплатыБроньДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ШапкаОплатыБрониДополнение");
ПолеОтчета.Вывести(Область, 0);

ТЗ_Оплаты = ТЗ_ОплатыБронь.СкопироватьКолонки();

Заявки = ТЗ_Оплаты.ВыгрузитьКолонку("Заявка");

//ТЗ_ПроживаниеЗаявки = ОтчетыСервер.ТЗ_ПроживаниеЗаявки(Заявки);

//ТЗ_УслугиЗаявки = ОтчетыСервер.ТЗ_УслугиЗаявки(Заявки);

ТЗ_ОплатыЗаявки = ОтчетыСервер.ТЗ_ОплатыЗаявки(Заявки);


ДокументОплаты_Предыдущий = Неопределено;
Для Каждого Строка Из ТЗ_ОплатыБронь Цикл 
	Если Строка.ДокументОплаты = ДокументОплаты_Предыдущий Тогда Продолжить; КонецЕсли;
	
	ДокументОплаты_Предыдущий = Строка.ДокументОплаты;
	
	НоваяСтрока = ТЗ_Оплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Для Каждого СтрокаОплатыБронь Из ТЗ_Оплаты Цикл
	Область = Макет.ПолучитьОбласть("СтрокаОплатыБрониДополнение|КолонкиЛево");
	
	ДокументОплатыОбластьЗаполнить(СтрокаОплатыБронь, Область, Неопределено);
	
	ОтборСтроки = Новый Структура("ДокументОплаты", СтрокаОплатыБронь.ДокументОплаты); 
	ТЗ_ОплатыЗаявка = ТЗ_ОплатыБронь.Скопировать(ОтборСтроки);
	
	Если ТЗ_ОплатыЗаявка.Количество() = 1 Тогда
		Область.Параметры.Дата = Формат(СтрокаОплатыБронь.РезервС, "ДФ=dd.MM.yy");
		
		ОплатаОбластьЗаполнить(СтрокаОплатыБронь, Область, Неопределено);
	
		ЗаявкаОбластьЗаполнить(ТЗ_ОплатыЗаявки, СтрокаОплатыБронь.Заявка, Область, Неопределено);	
		
		ПлатежиОбластьЗаполнить(ПлатежиКонтрагенту, СтрокаОплатыБронь.Заявка, Область, Неопределено); 
		
		ПолеОтчета.Вывести(Область, 0);

		ИмяОбластьУслуги = "СтрокаОплатыБрониДополнение";
        ОбластьВывода = УслугиОбластьВывести(СтрокаОплатыБронь.Заявка, ТЗ_РодительУслуги, ИмяОбластьУслуги, Макет, ПолеОтчета, Неопределено); 
	Иначе
		Область.Параметры.Дата = ".";
		
		Область.Параметры.ТипОплаты = "";
		Область.Параметры.ДатаОплаты = "";
		
		СтрокаОплатыБронь.СуммаОплаты = ТЗ_ОплатыЗаявка.Итог("СуммаОплаты");
		Область.Параметры.СуммаОплаты = СтрокаОплатыБронь.СуммаОплаты;
		Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплатыБронь);
		
		Область.Параметры.ГрупповаяОплата = "";
		
		Область.Параметры.Номер = "";
		Область.Параметры.РасшифровкаНомер = "";
	
		Область.Параметры.ЗаявкаНомер = "";
		Область.Параметры.ЗаявкаДата = "";
		
		Область.Параметры.РасшифровкаЗаявка = "";
		
		ОбластьВывода = ПолеОтчета.Вывести(Область, 0);
	КонецЕсли;
	
	ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
	
	//Если СтрокаОплатыБронь.Заявка = Null Тогда
	//	ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);
	//КонецЕсли;
	
	//Если ТЗ_ОплатыЗаявка.Количество() = 1 Тогда
		Если СтрокаОплатыБронь.ОстатокДокументаОплаты > 0 Тогда
			ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);		
		КонецЕсли;
	//КонецЕсли;
	
	Если ТЗ_ОплатыЗаявка.Количество() > 1 Тогда
		Для Каждого СтрокаОплатыЗаявка Из ТЗ_ОплатыЗаявка Цикл
			Область_Заявки = Макет.ПолучитьОбласть("СтрокаОплатыБрониЗаявкаДополнение|КолонкиЛево");
			
			Область_Заявки.Параметры.ТипДокументаОплаты = "";
			Область_Заявки.Параметры.НомерДокументаОплаты = "";
			Область_Заявки.Параметры.ДатаДокументаОплаты = "";
			Область_Заявки.Параметры.СуммаДокументаОплаты = "";
			Область_Заявки.Параметры.СуммаВозвратаДокументаОплаты = "";
			Область_Заявки.Параметры.Оплатил = "";
			Область_Заявки.Параметры.РасшифровкаДокументОплаты = "";
			
//			
			Область_Заявки.Параметры.Дата = Формат(СтрокаОплатыЗаявка.РезервС, "ДФ=dd.MM.yy");

			ОплатаОбластьЗаполнить(СтрокаОплатыЗаявка, Область_Заявки, Неопределено);
			
			ЗаявкаОбластьЗаполнить(ТЗ_ОплатыЗаявки, СтрокаОплатыЗаявка.Заявка, Область_Заявки, Неопределено);			
			
			ПлатежиОбластьЗаполнить(ПлатежиКонтрагенту, СтрокаОплатыЗаявка.Заявка, Область, Неопределено);    
			
			ОластьВывода = ПолеОтчета.Вывести(Область, 0);
			
			ИмяОбластьУслуги = "СтрокаОплатыБрониЗаявкаДополнение";
	        ОбластьВывода = УслугиОбластьВывести(СтрокаОплатыЗаявка.Заявка, ТЗ_РодительУслуги, ИмяОбластьУслуги, Макет, ПолеОтчета, Неопределено); 
			
			ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
	
			Если СтрокаОплатыЗаявка.ОстатокДокументаОплаты > 0 Тогда
				ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);		
			КонецЕсли;
//			
		КонецЦикла;
	КонецЕсли;
КонецЦикла;

//Область = Макет.ПолучитьОбласть("ПодножиеОплатыБроньДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ПодножиеОплатыБрониДополнение");
ПолеОтчета.Вывести(Область, 0);
	
Возврат ПолеОтчета;       
КонецФункции

Функция СформироватьВозвраты(Знач Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт
////

ПолеОтчета = Новый ТабличныйДокумент;

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	КассовыйДокумент.Номер КАК НомерДокументаОплаты,
                      |	КассовыйДокумент.Дата КАК ДатаДокументаОплаты,
                      |	КассовыйДокумент.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА КассовыйДокумент.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ КассовыйДокумент.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	""КД"" КАК ТипДокументаОплаты,
                      |	ЕСТЬNULL(КассоваяСмена.НачалоКассовойСмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыККМ
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |			КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
                      |			МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
                      |				ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
                      |					И (ВЫБОР
                      |						КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
                      |							ТОГДА ИСТИНА
                      |						ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
                      |					КОНЕЦ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.Ссылка,
                      |			КассоваяСмена.НомерСменыККТ) КАК КассоваяСмена
                      |		ПО КассовыйДокумент.Ссылка = КассоваяСмена.ДокументОплаты
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Возврат = ИСТИНА
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания");		

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		

ТЗ = Запрос.Выполнить().Выгрузить();	

ТЗ_Возвраты = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_Возвраты.Колонки.Найти("ДокументОплаты");
ТЗ_Возвраты.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_Возвраты.Колонки.Добавить("ДокументОплаты");

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_Возвраты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	ВыпискаБанка.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	""ВБ"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Возврат = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания");		

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_Возвраты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;
//

ТЗ_Возвраты.Сортировать("ДатаОплаты");

//
//Область = Макет.ПолучитьОбласть("ШапкаВозвратыДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ШапкаВозвратыДополнение");
ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаВозвраты Из ТЗ_Возвраты Цикл
	Область = Макет.ПолучитьОбласть("СтрокаВозвратыДополнение|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
				
	Область.Параметры.ТипДокументаОплаты = СтрокаВозвраты.ТипДокументаОплаты;
	Область.Параметры.НомерДокументаОплаты = СтрокаВозвраты.НомерДокументаОплаты;
	//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаВозвраты.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
	Область.Параметры.ДатаДокументаОплаты = СтрокаВозвраты.ДатаДокументаОплаты;
	
	Если ЗначениеЗаполнено(СтрокаВозвраты.ДатаСменыККМ) Тогда	
		Область.Параметры.ДатаОткрытияСмены = Формат(СтрокаВозвраты.ДатаСменыККМ, "ДФ=dd.MM.yy");
	КонецЕсли;

	Область.Параметры.СуммаДокументаОплаты = СтрокаВозвраты.СуммаДокументаОплаты;
	
	//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаВозвраты);
	Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаВозвраты);
	Оплатил = СтрокаВозвраты.ДокументОплаты.ОтКого;
	Если КлиентыСервер.ЭтоЮрЛицо(Оплатил) Тогда
		Область.Параметры.ОплатилИНН = Оплатил.ИНН;
	КонецЕсли;
	
	Область.Параметры.СуммаДокументаОплаты_кк = СтрокаВозвраты.СуммаДокументаОплатыКарта;
	Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаВозвраты.СуммаДокументаОплатыНаличные;
	
	Область.Параметры.РасшифровкаДокументОплаты = СтрокаВозвраты.ДокументОплаты;
	
	ВыведеннаяОбласть = ПолеОтчета.Вывести(Область, 0);
КонецЦикла;          

//Область = Макет.ПолучитьОбласть("ПодножиеВозвратыДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ПодножиеВозвратыДополнение");
ПолеОтчета.Вывести(Область, 0);
// 

Возврат ПолеОтчета;       
КонецФункции

Функция СформироватьПлатежиКонтрагенту(Знач Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт
////

ПолеОтчета = Новый ТабличныйДокумент;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	ВыпискаБанка.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	""ВБ"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.ЭтоПлатежКонтрагенту = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания");		

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		

ТЗ = Запрос.Выполнить().Выгрузить();

ТЗ_Платежи = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_Платежи.Колонки.Найти("ДокументОплаты");
ТЗ_Платежи.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_Платежи.Колонки.Добавить("ДокументОплаты");

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_Платежи.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;
//

ТЗ_Платежи.Сортировать("ДатаОплаты");

//
//Область = Макет.ПолучитьОбласть("ШапкаПлатежиДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ШапкаПлатежиДополнение");
ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаПлатежи Из ТЗ_Платежи Цикл
	Область = Макет.ПолучитьОбласть("СтрокаПлатежиДополнение|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
				
	Область.Параметры.ТипДокументаОплаты = СтрокаПлатежи.ТипДокументаОплаты;
	Область.Параметры.НомерДокументаОплаты = СтрокаПлатежи.НомерДокументаОплаты;
	//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаПлатежи.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
	Область.Параметры.ДатаДокументаОплаты = СтрокаПлатежи.ДатаДокументаОплаты;
	Область.Параметры.СуммаДокументаОплаты = СтрокаПлатежи.СуммаДокументаОплаты;
	//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаВозвраты);
	
	//Область.Параметры.СуммаДокументаОплаты_кк = СтрокаВозвраты.СуммаДокументаОплатыКарта;
	//Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаВозвраты.СуммаДокументаОплатыНаличные;
	
	Область.Параметры.РасшифровкаДокументОплаты = СтрокаПлатежи.ДокументОплаты;
	
	ВыведеннаяОбласть = ПолеОтчета.Вывести(Область, 0);
КонецЦикла;          

//Область = Макет.ПолучитьОбласть("ПодножиеПлатежиДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ПодножиеПлатежиДополнение");
ПолеОтчета.Вывести(Область, 0);
// 

Возврат ПолеОтчета;       
КонецФункции
//

//
Функция СформироватьОплатыЗаявки(Знач Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт

ПолеОтчета = Новый ТабличныйДокумент;

ТЗ_РодительУслуги = ТЗ_УслугиРодитель();

Список_ОплатыКоворкингКассовыйДокумент = Список_ОплатыКоворкинг("КД");
Список_ОплатыКоворкингВыпискаБанка = Список_ОплатыКоворкинг("ВБ");

Список_ПлатежиВыпискаБанка = Список_ПлатежиКонтрагенту("ВБ");

ПлатежиКонтрагенту = ПлатежиКонтрагенту(ДатаОтчетаС, ДатаОтчетаПо);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	0 КАК Порядок,
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	ЗаявкиОплаты.Ссылка КАК Заявка,
                      |	ЗаявкиОплаты.Ссылка.РезервС КАК РезервС,
                      |	ЕСТЬNULL(ЗаявкиОплаты.СуммаРаспределено, 0) КАК СуммаОплаты,
                      |	ЕСТЬNULL(ЗаявкиОплаты.ГрупповаяОплата, ЛОЖЬ) КАК ГрупповаяОплата,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	КассовыйДокумент.Номер КАК НомерДокументаОплаты,
                      |	КассовыйДокумент.Дата КАК ДатаДокументаОплаты,
                      |	КассовыйДокумент.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА КассовыйДокумент.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ КассовыйДокумент.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	ЕСТЬNULL(Возвраты.СуммаКарта, 0) КАК СуммаВозвратаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.СуммаНаличные, 0) КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ДолгиОплатыСумма,
                      |	КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |			ТОГДА 8
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ЛОЖЬ КАК ЭтоЭквайринг,
                      |	""КД"" КАК ТипДокументаОплаты,
                      |	ЕСТЬNULL(КассоваяСмена.НачалоКассовойСмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыККМ
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
                      |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата КАК ГрупповаяОплата,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноОплаты.СуммаРаспределено) КАК СуммаРаспределено
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты) КАК ЗаявкиОплаты
                      |		ПО КассовыйДокумент.Ссылка = ЗаявкиОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ДолгиОплаты
                      |		ПО КассовыйДокумент.Ссылка = ДолгиОплаты.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |			КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
                      |			МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
                      |				ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
                      |					И (ВЫБОР
                      |						КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
                      |							ТОГДА ИСТИНА
                      |						ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
                      |					КОНЕЦ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.Ссылка,
                      |			КассоваяСмена.НомерСменыККТ) КАК КассоваяСмена
                      |		ПО КассовыйДокумент.Ссылка = КассоваяСмена.ДокументОплаты
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Приход = ИСТИНА
					  |	И КассовыйДокумент.ЭтоПроизвольныйЧек = ЛОЖЬ
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания
                      |	И НЕ КассовыйДокумент.Ссылка В (&СписокКоворкинг)");		

					  //|			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
					  
ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингКассовыйДокумент);

ТЗ = Запрос.Выполнить().Выгрузить();	
Для Каждого Строка Из ТЗ Цикл
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

ТЗ_ОплатыБронь = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_ОплатыБронь.Колонки.Найти("ДокументОплаты");
ТЗ_ОплатыБронь.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_ОплатыБронь.Колонки.Добавить("ДокументОплаты");

КЧ = Новый КвалификаторыЧисла(10, 2);
Массив = Новый Массив;
Массив.Добавить(Тип("Число"));
ОписаниеТипов_Ч = Новый ОписаниеТипов(Массив, , ,КЧ);
ТЗ_ОплатыБронь.Колонки.Добавить("СуммаОплаты_кк", ОписаниеТипов_Ч);
ТЗ_ОплатыБронь.Колонки.Добавить("СуммаОплаты_Нал", ОписаниеТипов_Ч);

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если Строка.ТипОплаты = 1 Тогда
		НоваяСтрока.СуммаОплаты_кк = Строка.СуммаОплаты;
	ИначеЕсли Строка.ТипОплаты = 2 Тогда
		НоваяСтрока.СуммаОплаты_Нал = Строка.СуммаОплаты;
	Иначе
		Если Строка.СуммаДокументаОплаты <> 0 Тогда 
			НоваяСтрока.СуммаОплаты_кк = Окр(Строка.СуммаОплаты * (Строка.СуммаДокументаОплатыНаличные / Строка.СуммаДокументаОплаты), 2);
			НоваяСтрока.СуммаОплаты_Нал = Окр(Строка.СуммаОплаты * (Строка.СуммаДокументаОплатыКарта / Строка.СуммаДокументаОплаты), 2);
		КонецЕсли;
	КонецЕсли;                                    
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	0 КАК Порядок,
                      |	ЗаявкиОплаты.Ссылка КАК Заявка,
                      |	ЗаявкиОплаты.Ссылка.РезервС КАК РезервС,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ЕСТЬNULL(ЗаявкиОплаты.СуммаРаспределено, 0) КАК СуммаОплаты,
                      |	ЕСТЬNULL(ЗаявкиОплаты.ГрупповаяОплата, 0) КАК ГрупповаяОплата,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	ВыпискаБанка.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	0 КАК СуммаВозвратаДокументаОплатыКарта,
                      |	0 КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ДолгиОплатыСумма,
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |			ТОГДА 8
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВыпискаБанка.ЭтоЭквайринг КАК ЭтоЭквайринг,
                      |	""ВБ"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата КАК ГрупповаяОплата,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноОплаты.СуммаРаспределено) КАК СуммаРаспределено
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата,
                      |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты) КАК ЗаявкиОплаты
                      |		ПО ВыпискаБанка.Ссылка = ЗаявкиОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ДолгиОплаты
                      |		ПО ВыпискаБанка.Ссылка = ДолгиОплаты.Ссылка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Приход = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания
                      |	И НЕ ВыпискаБанка.Ссылка В (&СписокКоворкинг)");

					  //|	И НЕ ВыпискаБанка.Ссылка В (&СписокПлатежи)");		

					  //|			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
					  
ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингВыпискаБанка);
//Запрос.УстановитьПараметр("СписокПлатежи", Список_ПлатежиВыпискаБанка);

ТЗ = Запрос.Выполнить().Выгрузить();
	
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

СписокКонтрагентыИИН_Эквайринг = БезналРаспределениеСервер.СписокИННЭквайринг();
ПолучательПлатежа = Константы.ПолучательПлатежаБезнал.Получить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	0 КАК Порядок,
                      |	БезналЗагрузка.ГУИД КАК ДокументОплаты,
                      |	0 КАК СуммаОплаты,
                      |	ЛОЖЬ КАК ГрупповаяОплата,
                      |	БезналЗагрузка.ДатаОплаты КАК ДатаОплаты,
                      |	БезналЗагрузка.КонтрагентНаименование КАК КонтрагентНаименование,
                      |	БезналЗагрузка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаВозвратаДокументаОплаты,
                      |	0 КАК СуммаВозвратаДокументаОплатыКарта,
                      |	0 КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	БезналЗагрузка.Сумма КАК ОстатокДокументаОплаты,
                      |	""НО"" КАК ТипДокументаОплаты,
                      |	БезналЗагрузка.КонтрагентИНН КАК КонтрагентИНН,
                      |	БезналЗагрузка.ТекстПлатежа КАК ТекстПлатежа
                      |ИЗ
                      |	РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ПО БезналЗагрузка.ГУИД = ВыпискаБанка.ГУИДЗагрузка
                      |ГДЕ
                      |	ВыпискаБанка.Ссылка ЕСТЬ NULL
                      |	И БезналЗагрузка.Отменено = ЛОЖЬ
                      |	И (БезналЗагрузка.ПолучательПлатежа = """"
                      |			ИЛИ БезналЗагрузка.ПолучательПлатежа = &ПолучательПлатежа)
                      |	И БезналЗагрузка.ДатаОплаты >= &ДатаНачала
                      |	И БезналЗагрузка.ДатаОплаты <= &ДатаОкончания");		

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);		
ТЗ = Запрос.Выполнить().Выгрузить();

//                      |	ВЫБОР
//                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
//                      |			ТОГДА ВЫБОР
//                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
//                      |						ТОГДА 5
//                      |					ИНАЧЕ 4
//                      |				КОНЕЦ
//                      |		ИНАЧЕ 3
//                      |	КОНЕЦ КАК ТипОплаты,
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	ЗначениеИНН = СписокКонтрагентыИИН_Эквайринг.НайтиПоЗначению(Строка.КонтрагентИНН);
	ЕстьВСписке = (ЗначениеИНН <> Неопределено);
	Если ЕстьВСписке Тогда
		Если СтрНайти(Строка.ТекстПлатежа,"СБП") > 0 Тогда
			НоваяСтрока.ТипОплаты = 5;
		Иначе	
			НоваяСтрока.ТипОплаты = 4;
		КонецЕсли;
		
		НоваяСтрока.ЭтоЭквайринг = Истина;
	Иначе
		НоваяСтрока.ТипОплаты = 3;
		
		НоваяСтрока.ЭтоЭквайринг = Ложь;
	КонецЕсли;
КонецЦикла;

ТЗ_ОплатыБронь.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_ОплатыБронь.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_ОплатыБронь Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга <= &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;
// - Оплаты 

Запрос =	Новый Запрос ("ВЫБРАТЬ
        	              |	1 КАК Порядок,
        	              |	ЗаявкаНаБронирование.Ссылка КАК Заявка,
        	              |	ЗаявкаНаБронирование.РезервС КАК РезервС,
        	              |	ЗаявкаНаБронирование.РезервС КАК ДатаОплаты
        	              |ИЗ
        	              |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
        	              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка
        	              |		ИЗ
        	              |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
        	              |		
        	              |		СГРУППИРОВАТЬ ПО
        	              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка) КАК РаспределениеОплат
        	              |		ПО ЗаявкаНаБронирование.Ссылка = РаспределениеОплат.Ссылка
        	              |ГДЕ
        	              |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
        	              |	И ВЫБОР
        	              |			КОГДА &ТипДатаС = ""ВсеЗаПериод""
        	              |					ИЛИ &ТипДатаПо = ""ВсеЗаПериод""
        	              |				ТОГДА ЗаявкаНаБронирование.РезервПо >= &ДатаОтчетаС
        	              |						И ЗаявкаНаБронирование.РезервС <= &ДатаОтчетаПо
        	              |			ИНАЧЕ ВЫБОР
        	              |						КОГДА &ТипДатаС = ""ДатаВыезда""
        	              |							ТОГДА ЗаявкаНаБронирование.РезервПо >= &ДатаОтчетаС
        	              |						ИНАЧЕ ЗаявкаНаБронирование.РезервС >= &ДатаОтчетаС
        	              |					КОНЕЦ
        	              |					И ВЫБОР
        	              |						КОГДА &ТипДатаПо = ""ДатаВыезда""
        	              |							ТОГДА ЗаявкаНаБронирование.РезервПо <= &ДатаОтчетаПо
        	              |						ИНАЧЕ ЗаявкаНаБронирование.РезервС <= &ДатаОтчетаПо
        	              |					КОНЕЦ
        	              |		КОНЕЦ
        	              |	И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
        	              |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает)
        	              |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
        	              |	И РаспределениеОплат.Ссылка ЕСТЬ NULL
        	              |
        	              |УПОРЯДОЧИТЬ ПО
        	              |	Заявка");
	
						  //|	И ВЫБОР
						  //|			КОГДА &БронируетОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
						  //|				ТОГДА ИСТИНА
						  //|			ИНАЧЕ ЗаявкаНаБронирование.Бронирует = &БронируетОтбор
						  //|		КОНЕЦ


Запрос.УстановитьПараметр("ДатаОтчетаС", ДатаОтчетаС);
Запрос.УстановитьПараметр("ДатаОтчетаПо", ДатаОтчетаПо);	
Запрос.УстановитьПараметр("ТипДатаС", ТипДатаС);
Запрос.УстановитьПараметр("ТипДатаПо", ТипДатаПо);	

Запрос.УстановитьПараметр("БронируетОтбор", БронируетОтбор);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	2 КАК Порядок,
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	КассовыйДокумент.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА КассовыйДокумент.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ КассовыйДокумент.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	""КД В"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Возврат = ИСТИНА
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания
                      |	И НЕ КассовыйДокумент.Ссылка В (&СписокКоворкинг)");					  	

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингКассовыйДокумент);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	2 КАК Порядок,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	""ВБ В"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Возврат = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания
                      |	И НЕ ВыпискаБанка.Ссылка В (&СписокКоворкинг)
                      |	И НЕ ВыпискаБанка.Ссылка В (&СписокПлатежи)");	

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингВыпискаБанка);
Запрос.УстановитьПараметр("СписокПлатежи", Список_ПлатежиВыпискаБанка);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	3 КАК Порядок,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	ВыпискаБанка.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	""ВБ П"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.ЭтоПлатежКонтрагенту = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания");		

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

ТЗ_ОплатыБронь.Сортировать("ДатаОплаты, Порядок, ДокументОплаты, Заявка");

// + Оплаты Бронь
//Область = Макет.ПолучитьОбласть("ШапкаОплатыДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ШапкаОплатыДополнение");
ПолеОтчета.Вывести(Область, 0);

ТЗ_Оплаты = ТЗ_ОплатыБронь.СкопироватьКолонки();

ДокументОплаты_Предыдущий = Неопределено;
Для Каждого Строка Из ТЗ_ОплатыБронь Цикл 
	Если Строка.ДокументОплаты = ДокументОплаты_Предыдущий Тогда Продолжить; КонецЕсли;
	
	ДокументОплаты_Предыдущий = Строка.ДокументОплаты;
	
	НоваяСтрока = ТЗ_Оплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Заявки = ТЗ_Оплаты.ВыгрузитьКолонку("Заявка");

ТЗ_ОплатыЗаявки = ОтчетыСервер.ТЗ_ОплатыЗаявки(Заявки);



//
Итоги = Новый Структура();
Итоги.Вставить("КоличествоНочей", 0);
Итоги.Вставить("КоличествоСутокТариф", 0);
Итоги.Вставить("СуммаЦенаПроживание", 0);
Итоги.Вставить("СуммаПроживание", 0);
Итоги.Вставить("СуммаНомера", 0);

Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаОплаты_кк", 0);
Итоги.Вставить("СуммаОплаты_Нал", 0);

Итоги.Вставить("СуммаДокументаОплаты", 0);
Итоги.Вставить("СуммаДокументаОплаты_кк", 0);
Итоги.Вставить("СуммаДокументаОплаты_Нал", 0);

Итоги.Вставить("СуммаВозвратаДокументаОплаты", 0);
Итоги.Вставить("СуммаВозвратаДокументаОплаты_кк", 0);
Итоги.Вставить("СуммаВозвратаДокументаОплаты_Нал", 0);

Итоги.Вставить("ОстатокДокументаОплаты", 0);

Итоги.Вставить("СуммаЭквайринга", 0);

Итоги.Вставить("СуммаКомиссииИнформационно", 0);
Итоги.Вставить("СуммаКомиссииКВыплате", 0);
Итоги.Вставить("СуммаКомиссииОплата", 0);

Итоги.Вставить("КоличествоСтатус", 0);
Итоги.Вставить("КоличествоЗавтраки", 0);

Итоги.Вставить("КоличествоЧеловек", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);
//

//
ИтогиДень = Новый Структура();
ИтогиДень.Вставить("КоличествоНочей", 0);
ИтогиДень.Вставить("КоличествоСутокТариф", 0);
ИтогиДень.Вставить("СуммаЦенаПроживание", 0);
ИтогиДень.Вставить("СуммаПроживание", 0);
ИтогиДень.Вставить("СуммаНомера", 0);

ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаОплаты_кк", 0);
ИтогиДень.Вставить("СуммаОплаты_Нал", 0);

ИтогиДень.Вставить("СуммаДокументаОплаты", 0);
ИтогиДень.Вставить("СуммаДокументаОплаты_кк", 0);
ИтогиДень.Вставить("СуммаДокументаОплаты_Нал", 0);

ИтогиДень.Вставить("СуммаВозвратаДокументаОплаты", 0);
ИтогиДень.Вставить("СуммаВозвратаДокументаОплаты_кк", 0);
ИтогиДень.Вставить("СуммаВозвратаДокументаОплаты_Нал", 0);

ИтогиДень.Вставить("ОстатокДокументаОплаты", 0);

ИтогиДень.Вставить("СуммаЭквайринга", 0);

ИтогиДень.Вставить("СуммаКомиссииИнформационно", 0);
ИтогиДень.Вставить("СуммаКомиссииКВыплате", 0);
ИтогиДень.Вставить("СуммаКомиссииОплата", 0);

ИтогиДень.Вставить("КоличествоСтатус", 0);
ИтогиДень.Вставить("КоличествоЗавтраки", 0);

ИтогиДень.Вставить("КоличествоЧеловек", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);
//

ПолеОтчета.НачатьАвтогруппировкуСтрок();

ПредыдущийДень = '00010101';

Для Каждого СтрокаОплатыБронь Из ТЗ_Оплаты Цикл
	
	//
	Если ПредыдущийДень <> СтрокаОплатыБронь.ДатаОплаты Тогда
		Если ПредыдущийДень <> '00010101' Тогда     
			ИтогиДеньОплатыЗаявка(Макет, ПолеОтчета, ПредыдущийДень, ИтогиДень, Итоги);
		КонецЕсли;
		
		Область = Макет.ПолучитьОбласть("ЗаголовокСтрокаДополнение|КолонкиЛево");
		Область.Параметры.Дата = Формат(СтрокаОплатыБронь.ДатаОплаты, "ДФ=dd.MM.yy");
		ПолеОтчета.Вывести(Область, 0);
		
		ПредыдущийДень = СтрокаОплатыБронь.ДатаОплаты;
	КонецЕсли;
	
	Если СтрокаОплатыБронь.Порядок = 1 Тогда Перейти ~НЕОПЛАЧЕННЫЕ_ЗАЯВКИ; КонецЕсли;
	Если СтрокаОплатыБронь.Порядок = 2 Тогда Перейти ~ВОЗВРАТЫ; КонецЕсли;
	Если СтрокаОплатыБронь.Порядок = 3 Тогда Перейти ~ПЛАТЕЖИ; КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("СтрокаОплатыДополнение|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
	
	ОтборСтроки = Новый Структура("ДокументОплаты", СтрокаОплатыБронь.ДокументОплаты); 
	ТЗ_ОплатыЗаявка = ТЗ_ОплатыБронь.Скопировать(ОтборСтроки);
	
	//Если ТипЗнч(СтрокаОплатыБронь.ДокументОплаты) <> Тип("УникальныйИдентификатор") Тогда
	//	Если СтрокаОплатыБронь.ДокументОплаты.Номер = "000004096" Тогда
	//		ш = 1;
	//	КонецЕсли;	
	//КонецЕсли;	
	
	ДокументОплатыОбластьЗаполнить(СтрокаОплатыБронь, Область, ИтогиДень); 
	
	Если ТЗ_ОплатыЗаявка.Количество() = 1 Тогда
		
		ОплатаОбластьЗаполнить(СтрокаОплатыБронь, Область, ИтогиДень);
		
		Если ЗначениеЗаполнено(СтрокаОплатыБронь.Заявка) Тогда
	
			Область.Параметры.Дата = Формат(СтрокаОплатыБронь.РезервС, "ДФ=dd.MM.yy");
			
			ЗаявкаОбластьЗаполнить(ТЗ_ОплатыЗаявки, СтрокаОплатыБронь.Заявка, Область, ИтогиДень);
			
			ПлатежиОбластьЗаполнить(ПлатежиКонтрагенту, СтрокаОплатыБронь.Заявка, Область, ИтогиДень);    
			
			ОластьВывода = ПолеОтчета.Вывести(Область, 1);
			
			ИмяОбластьУслуги = "СтрокаОплатыДополнение";
	        ОбластьВывода = УслугиОбластьВывести(СтрокаОплатыБронь.Заявка, ТЗ_РодительУслуги, ИмяОбластьУслуги, Макет, ПолеОтчета, ИтогиДень); 
			
		Иначе
			ОбластьВывода = ПолеОтчета.Вывести(Область, 1);
		КонецЕсли;
	Иначе
		
		Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплатыБронь.ТипОплаты);
		Область.Параметры.ДатаОплаты = Формат(СтрокаОплатыБронь.ДатаОплаты, "ДФ=dd.MM.yy");
		
		СтрокаОплатыБронь.СуммаОплаты = ТЗ_ОплатыЗаявка.Итог("СуммаОплаты");
		Область.Параметры.СуммаОплаты = СтрокаОплатыБронь.СуммаОплаты;
		Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплатыБронь);
		
		Область.Параметры.ГрупповаяОплата = "";
		
		Область.Параметры.Номер = "";
		Область.Параметры.РасшифровкаНомер = "";
	
		Область.Параметры.ЗаявкаНомер = "";
		Область.Параметры.ЗаявкаДата = "";
		
		Область.Параметры.РасшифровкаЗаявка = "";
		
		ОбластьВывода = ПолеОтчета.Вывести(Область, 1);
	КонецЕсли;
	
	ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
		
	Если СтрокаОплатыБронь.Заявка = Null Тогда
		ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);
	КонецЕсли;
	
	//Если ТЗ_ОплатыЗаявка.Количество() = 1 Тогда
		Если СтрокаОплатыБронь.ОстатокДокументаОплаты > 0 Тогда
			ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);		
		КонецЕсли;
	//КонецЕсли;
	
	Если ТЗ_ОплатыЗаявка.Количество() > 1 Тогда
		Для Каждого СтрокаОплатыЗаявка Из ТЗ_ОплатыЗаявка Цикл
			Область_Заявки = Макет.ПолучитьОбласть("СтрокаОплатыЗаявкаДополнение|КолонкиЛево");
			
			Область_Заявки.Параметры.Дата = ".";
			
			Область_Заявки.Параметры.ТипДокументаОплаты = "";
			Область_Заявки.Параметры.НомерДокументаОплаты = "";
			Область_Заявки.Параметры.ДатаДокументаОплаты = "";
			Область_Заявки.Параметры.СуммаДокументаОплаты = "";
			Область_Заявки.Параметры.СуммаВозвратаДокументаОплаты = "";
			
			Область_Заявки.Параметры.Оплатил = "";
			
			Область_Заявки.Параметры.РасшифровкаДокументОплаты = "";
			
			ОплатаОбластьЗаполнить(СтрокаОплатыЗаявка, Область_Заявки, ИтогиДень);
			
			Если ЗначениеЗаполнено(СтрокаОплатыЗаявка.Заявка) Тогда
				
				Область_Заявки.Параметры.Дата = Формат(СтрокаОплатыЗаявка.РезервС, "ДФ=dd.MM.yy");
				ЗаявкаОбластьЗаполнить(ТЗ_ОплатыЗаявки, СтрокаОплатыЗаявка.Заявка, Область_Заявки, ИтогиДень);	
				
				ПлатежиОбластьЗаполнить(ПлатежиКонтрагенту, СтрокаОплатыЗаявка.Заявка, Область, ИтогиДень);    
				
				ПолеОтчета.Вывести(Область_Заявки, 1);

				ИмяОбластьУслуги = "СтрокаОплатыЗаявкаДополнение";
		        ОбластьВывода = УслугиОбластьВывести(СтрокаОплатыЗаявка.Заявка, ТЗ_РодительУслуги, ИмяОбластьУслуги, Макет, ПолеОтчета, ИтогиДень); 
			Иначе
				ОбластьВывода = ПолеОтчета.Вывести(Область_Заявки, 1);
			КонецЕсли;
		
			ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
			
			Если СтрокаОплатыЗаявка.ОстатокДокументаОплаты > 0 Тогда
				ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Продолжить;
	
~НЕОПЛАЧЕННЫЕ_ЗАЯВКИ:	
	Область = Макет.ПолучитьОбласть("СтрокаОплатыНеоплаченныеЗаявкиДополнение|КолонкиЛево");
	
	Область.Параметры.ТипДокументаОплаты = "";
	Область.Параметры.НомерДокументаОплаты = "";
	Область.Параметры.ДатаДокументаОплаты = "";
	Область.Параметры.СуммаДокументаОплаты = "";
	Область.Параметры.СуммаВозвратаДокументаОплаты = "";
	Область.Параметры.ОстатокДокументаОплаты = "";
	
	Область.Параметры.Оплатил = "";
	
	Область.Параметры.ТипОплаты = "";
	Область.Параметры.ДатаОплаты = "";
	Область.Параметры.СуммаОплаты = "";
	Область.Параметры.СуммаЭквайринга = "";
	
	Область.Параметры.Дата = Формат(СтрокаОплатыБронь.РезервС, "ДФ=dd.MM.yy");
	
	ЗаявкаОбластьЗаполнить(ТЗ_ОплатыЗаявки, СтрокаОплатыБронь.Заявка, Область, ИтогиДень);			
	ВыведеннаяОбласть = ПолеОтчета.Вывести(Область, 1);

	ИмяОбластьУслуги = "СтрокаОплатыНеоплаченныеЗаявкиДополнение";
    УслугиОбласть = УслугиОбластьВывести(СтрокаОплатыБронь.Заявка, ТЗ_РодительУслуги, ИмяОбластьУслуги, Макет, ПолеОтчета, ИтогиДень); 
	ВыведеннаяОбласть = ПолеОтчета.Область(УслугиОбласть.Верх, , УслугиОбласть.Низ);
	
	Продолжить;
	
~ВОЗВРАТЫ:
	Область_Возврат = Макет.ПолучитьОбласть("СтрокаОплатыВозвратДополнение|КолонкиЛево");
	
	// + Очистка Параметров
	Область_Возврат.Параметры.Дата = ".";
	
	Область_Возврат.Параметры.ТипОплаты = "";
	Область_Возврат.Параметры.ДатаОплаты = "";
	Область_Возврат.Параметры.СуммаОплаты = "";
	// - Очистка Параметров
	
	Область_Возврат.Параметры.ТипДокументаОплаты = СтрокаОплатыБронь.ТипДокументаОплаты;
	Область_Возврат.Параметры.НомерДокументаОплаты = СтрокаОплатыБронь.ДокументОплаты.Номер;
	//Область_Возврат.Параметры.ДатаДокументаОплаты = Формат(СтрокаОплатыБронь.ДокументОплаты.Дата, "ДФ=dd.MM.yy");
	Область_Возврат.Параметры.ДатаДокументаОплаты = СтрокаОплатыБронь.ДокументОплаты.Дата;
	Область_Возврат.Параметры.СуммаВозвратаДокументаОплаты = СтрокаОплатыБронь.СуммаДокументаОплаты;
	Область_Возврат.Параметры.СуммаВозвратаДокументаОплаты_кк = СтрокаОплатыБронь.СуммаДокументаОплатыКарта;
	Область_Возврат.Параметры.СуммаВозвратаДокументаОплаты_Нал = СтрокаОплатыБронь.СуммаДокументаОплатыНаличные;
	
	Область_Возврат.Параметры.РасшифровкаДокументОплаты = СтрокаОплатыБронь.ДокументОплаты;

	Область_Возврат.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплатыБронь);
	Оплатил = СтрокаОплатыБронь.ДокументОплаты.ОтКого;
	Если КлиентыСервер.ЭтоЮрЛицо(Оплатил) Тогда
		Область_Возврат.Параметры.ОплатилИНН = Оплатил.ИНН;
	КонецЕсли;
	
	ИтогиДень.СуммаВозвратаДокументаОплаты = ИтогиДень.СуммаВозвратаДокументаОплаты + СтрокаОплатыБронь.СуммаДокументаОплаты;
	ИтогиДень.СуммаВозвратаДокументаОплаты_кк = ИтогиДень.СуммаВозвратаДокументаОплаты_кк + СтрокаОплатыБронь.СуммаДокументаОплатыКарта;
	ИтогиДень.СуммаВозвратаДокументаОплаты_Нал = ИтогиДень.СуммаВозвратаДокументаОплаты_Нал + СтрокаОплатыБронь.СуммаДокументаОплатыНаличные;
	
	ПолеОтчета.Вывести(Область_Возврат, 1);
	
	Продолжить;
	
~ПЛАТЕЖИ:
	Область_Платежи = Макет.ПолучитьОбласть("СтрокаОплатыПлатежиДополнение|КолонкиЛево");
	
	// + Очистка Параметров
	Область_Платежи.Параметры.Дата = ".";
	
	Область_Платежи.Параметры.ТипОплаты = "";
	Область_Платежи.Параметры.ДатаОплаты = "";
	Область_Платежи.Параметры.СуммаОплаты = "";
	// - Очистка Параметров
	
	Область_Платежи.Параметры.ТипДокументаОплаты = СтрокаОплатыБронь.ТипДокументаОплаты;
	Область_Платежи.Параметры.НомерДокументаОплаты = СтрокаОплатыБронь.ДокументОплаты.Номер;
	Область_Платежи.Параметры.ДатаДокументаОплаты = СтрокаОплатыБронь.ДокументОплаты.Дата;
	Область_Платежи.Параметры.СуммаДокументаОплаты = СтрокаОплатыБронь.СуммаДокументаОплаты;
	//Область_Возврат.Параметры.СуммаДокументаОплаты_кк = СтрокаОплатыБронь.СуммаДокументаОплатыКарта;
	//Область_Возврат.Параметры.СуммаДокументаОплаты_Нал = СтрокаОплатыБронь.СуммаДокументаОплатыНаличные;
	
	ПолеОтчета.Вывести(Область_Платежи, 1);
	
	Продолжить;

КонецЦикла;

ИтогиДеньОплатыЗаявка(Макет, ПолеОтчета, ПредыдущийДень, ИтогиДень, Итоги);

//
Область = Макет.ПолучитьОбласть("ИтогиДополнение|КолонкиЛево");

Область.Параметры.ИтогиДаты = "Период с " + Формат(ДатаОтчетаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаОтчетаПо, "ДФ=dd.MM.yy");

Область.Параметры.Номер = "Итого Ночей:";
Область.Параметры.КатегорияНомера = Итоги.КоличествоНочей;

Область.Параметры.ЦенаПроживание = Итоги.СуммаЦенаПроживание;

Область.Параметры.СуммаПроживание = Итоги.СуммаПроживание;
Область.Параметры.СуммаНомера = Итоги.СуммаНомера;
Область.Параметры.КоличествоСутокТариф = Итоги.КоличествоСутокТариф;
Область.Параметры.КоличествоЧеловек = Итоги.КоличествоЧеловек;

Область.Параметры.СуммаОплаты = Итоги.СуммаОплаты;
Область.Параметры.СуммаОплаты_кк = Итоги.СуммаОплаты_кк;
Область.Параметры.СуммаОплаты_Нал = Итоги.СуммаОплаты_Нал;

Область.Параметры.СуммаДокументаОплаты = Итоги.СуммаДокументаОплаты;
Область.Параметры.СуммаДокументаОплаты_кк = Итоги.СуммаДокументаОплаты_кк;
Область.Параметры.СуммаДокументаОплаты_Нал = Итоги.СуммаДокументаОплаты_Нал;

Область.Параметры.СуммаВозвратаДокументаОплаты = Итоги.СуммаВозвратаДокументаОплаты;
Область.Параметры.СуммаВозвратаДокументаОплаты_кк = Итоги.СуммаВозвратаДокументаОплаты_кк;
Область.Параметры.СуммаВозвратаДокументаОплаты_Нал = Итоги.СуммаВозвратаДокументаОплаты_Нал;

Область.Параметры.ОстатокДокументаОплаты = Итоги.ОстатокДокументаОплаты;

Область.Параметры.СуммаЭквайринга = Итоги.СуммаЭквайринга;

Область.Параметры.СуммаКомиссииКВыплате	 = Итоги.СуммаКомиссииКВыплате;
Область.Параметры.СуммаКомиссииИнформационно	 = Итоги.СуммаКомиссииИнформационно;
Область.Параметры.СуммаКомиссииОплата	 = Итоги.СуммаКомиссииОплата;

//Область.Параметры.КоличествоСтатус	 = ИтогиДень.КоличествоСтатус;
Область.Параметры.КоличествоЗавтраки	 = Итоги.КоличествоЗавтраки;

ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из Итоги.УслугиИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДополнение|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 0);
КонецЦикла;
//

ПолеОтчета.ЗакончитьАвтогруппировкуСтрок(); 

//Область = Макет.ПолучитьОбласть("ИтогиДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ИтогиДополнение");
ПолеОтчета.Вывести(Область, 0);


Возврат ПолеОтчета;       
КонецФункции

Процедура ИтогиДеньОплатыЗаявка(Макет, ПолеОтчета, ПредыдущийДень, ИтогиДень, Итоги)
Область = Макет.ПолучитьОбласть("ИтогиДеньДополнение|КолонкиЛево");

Область.Параметры.Дата = Формат(ПредыдущийДень, "ДФ=dd.MM.yy");

Месяц = Формат(ПредыдущийДень, "ДФ='МММ гг'" );  
Область.Параметры.Месяц = Месяц;		

ДеньНедели = Формат(ПредыдущийДень, "ДФ=дддд");   
Область.Параметры.ДеньНедели = ДеньНедели;

Область.Параметры.ЦенаПроживание = ИтогиДень.СуммаЦенаПроживание;

Область.Параметры.СуммаПроживание = ИтогиДень.СуммаПроживание;
Область.Параметры.СуммаНомера = ИтогиДень.СуммаНомера;
Область.Параметры.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф;
Область.Параметры.КоличествоЧеловек = ИтогиДень.КоличествоЧеловек;

Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
Область.Параметры.СуммаОплаты_кк = ИтогиДень.СуммаОплаты_кк;
Область.Параметры.СуммаОплаты_Нал = ИтогиДень.СуммаОплаты_Нал;

Область.Параметры.СуммаДокументаОплаты = ИтогиДень.СуммаДокументаОплаты;
Область.Параметры.СуммаДокументаОплаты_кк = ИтогиДень.СуммаДокументаОплаты_кк;
Область.Параметры.СуммаДокументаОплаты_Нал = ИтогиДень.СуммаДокументаОплаты_Нал;

Область.Параметры.СуммаВозвратаДокументаОплаты = ИтогиДень.СуммаВозвратаДокументаОплаты;
Область.Параметры.СуммаВозвратаДокументаОплаты_кк = ИтогиДень.СуммаВозвратаДокументаОплаты_кк;
Область.Параметры.СуммаВозвратаДокументаОплаты_Нал = ИтогиДень.СуммаВозвратаДокументаОплаты_Нал;

Область.Параметры.ОстатокДокументаОплаты = ИтогиДень.ОстатокДокументаОплаты;

Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;

Область.Параметры.СуммаКомиссииКВыплате	 = ИтогиДень.СуммаКомиссииКВыплате;
Область.Параметры.СуммаКомиссииИнформационно	 = ИтогиДень.СуммаКомиссииИнформационно;
Область.Параметры.СуммаКомиссииОплата	 = ИтогиДень.СуммаКомиссииОплата;

//Область.Параметры.КоличествоСтатус	 = ИтогиДень.КоличествоСтатус;
Область.Параметры.КоличествоЗавтраки	 = ИтогиДень.КоличествоЗавтраки;

ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДеньДополнение|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 0);
КонецЦикла;

//
Итоги.КоличествоНочей = Итоги.КоличествоНочей + ИтогиДень.КоличествоНочей;
Итоги.КоличествоСутокТариф = Итоги.КоличествоСутокТариф + ИтогиДень.КоличествоСутокТариф;

Итоги.СуммаЦенаПроживание = Итоги.СуммаЦенаПроживание + ИтогиДень.СуммаЦенаПроживание;
Итоги.СуммаПроживание = Итоги.СуммаПроживание + ИтогиДень.СуммаПроживание;

Итоги.СуммаНомера = Итоги.СуммаНомера + ИтогиДень.СуммаНомера;

Итоги.СуммаОплаты = Итоги.СуммаОплаты + ИтогиДень.СуммаОплаты;

Итоги.СуммаОплаты_кк = Итоги.СуммаОплаты_кк + ИтогиДень.СуммаОплаты_кк;
Итоги.СуммаОплаты_Нал = Итоги.СуммаОплаты_Нал + ИтогиДень.СуммаОплаты_Нал;

Итоги.СуммаДокументаОплаты = Итоги.СуммаДокументаОплаты + ИтогиДень.СуммаДокументаОплаты;
Итоги.СуммаДокументаОплаты_кк = Итоги.СуммаДокументаОплаты_кк + ИтогиДень.СуммаДокументаОплаты_кк;
Итоги.СуммаДокументаОплаты_Нал = Итоги.СуммаДокументаОплаты_Нал + ИтогиДень.СуммаДокументаОплаты_Нал;

Итоги.СуммаВозвратаДокументаОплаты = Итоги.СуммаВозвратаДокументаОплаты + ИтогиДень.СуммаВозвратаДокументаОплаты;
Итоги.СуммаВозвратаДокументаОплаты_кк = Итоги.СуммаВозвратаДокументаОплаты_кк + ИтогиДень.СуммаВозвратаДокументаОплаты_кк;
Итоги.СуммаВозвратаДокументаОплаты_Нал = Итоги.СуммаВозвратаДокументаОплаты_Нал + ИтогиДень.СуммаВозвратаДокументаОплаты_Нал;

Итоги.ОстатокДокументаОплаты = Итоги.ОстатокДокументаОплаты + ИтогиДень.ОстатокДокументаОплаты;

Итоги.СуммаЭквайринга = Итоги.СуммаЭквайринга + ИтогиДень.СуммаЭквайринга;  

Итоги.СуммаКомиссииИнформационно = Итоги.СуммаКомиссииИнформационно + ИтогиДень.СуммаКомиссииИнформационно;
Итоги.СуммаКомиссииКВыплате = Итоги.СуммаКомиссииКВыплате + ИтогиДень.СуммаКомиссииКВыплате;
Итоги.СуммаКомиссииОплата = Итоги.СуммаКомиссииОплата + ИтогиДень.СуммаКомиссииОплата;

Итоги.КоличествоСтатус = Итоги.КоличествоСтатус + ИтогиДень.КоличествоСтатус;
Итоги.КоличествоЗавтраки = Итоги.КоличествоЗавтраки + ИтогиДень.КоличествоЗавтраки;

Итоги.КоличествоЧеловек = Итоги.КоличествоЧеловек + ИтогиДень.КоличествоЧеловек;

Для Индекс = 0 По Итоги.УслугиИтоги.Количество() - 1 Цикл
	Итоги.УслугиИтоги[Индекс].СуммаУслуги = Итоги.УслугиИтоги[Индекс].СуммаУслуги 
		+ ИтогиДень.УслугиДеньИтоги[Индекс].СуммаУслуги;		
КонецЦикла;
//

ИтогиДень.КоличествоСтатус = 0;;
ИтогиДень.КоличествоНочей = 0;
ИтогиДень.КоличествоСутокТариф = 0;
ИтогиДень.СуммаЦенаПроживание = 0;
ИтогиДень.СуммаПроживание = 0;
ИтогиДень.СуммаНомера = 0;

ИтогиДень.СуммаОплаты = 0;
ИтогиДень.СуммаОплаты_кк = 0;
ИтогиДень.СуммаОплаты_Нал = 0;

ИтогиДень.СуммаДокументаОплаты = 0;
ИтогиДень.СуммаДокументаОплаты_кк = 0;
ИтогиДень.СуммаДокументаОплаты_Нал = 0;

ИтогиДень.СуммаДокументаОплаты = 0;
ИтогиДень.СуммаДокументаОплаты_кк = 0;
ИтогиДень.СуммаДокументаОплаты_Нал = 0;

ИтогиДень.СуммаВозвратаДокументаОплаты = 0;
ИтогиДень.СуммаВозвратаДокументаОплаты_кк = 0;
ИтогиДень.СуммаВозвратаДокументаОплаты_Нал = 0;

ИтогиДень.ОстатокДокументаОплаты = 0;

ИтогиДень.СуммаЭквайринга = 0;

ИтогиДень.СуммаКомиссииИнформационно = 0;
ИтогиДень.СуммаКомиссииКВыплате = 0;
ИтогиДень.СуммаКомиссииОплата = 0;

ИтогиДень.КоличествоСтатус = 0;;
ИтогиДень.КоличествоЗавтраки = 0;;

ИтогиДень.КоличествоЧеловек = 0;;

УслугиДеньИтоги = ИтогиДень.УслугиДеньИтоги;
Для Каждого Строка Из ИтогиДень.УслугиДеньИтоги Цикл
	Строка.СуммаУслуги = 0;	
КонецЦикла;

КонецПроцедуры	
//

////
Процедура ОплатаОбластьЗаполнить(СтрокаОплаты, Область, ИтогиДень)
Если ТипЗнч(СтрокаОплаты.ДокументОплаты) = Тип("УникальныйИдентификатор") Тогда	
	Область.Параметры.РасшифровкаДокументОплаты = "Нераспределенная выгрузка";
Иначе	
	Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
КонецЕсли;

Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yy");

Если ЗначениеЗаполнено(СтрокаОплаты.ДатаСменыККМ) Тогда
	Область.Параметры.ДатаОткрытияСмены = Формат(СтрокаОплаты.ДатаСменыККМ, "ДФ=dd.MM.yy");
КонецЕсли;	

Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);

СуммаОплаты = СтрокаОплаты.СуммаОплаты;
Область.Параметры.СуммаОплаты = СуммаОплаты;

СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;

Если СтрокаОплаты.СуммаДокументаОплаты <> 0 Тогда
	Область.Параметры.СуммаОплаты_кк = Окр(СтрокаОплаты.СуммаОплаты 
		* СтрокаОплаты.СуммаДокументаОплатыКарта / СтрокаОплаты.СуммаДокументаОплаты, 2);
	Область.Параметры.СуммаОплаты_Нал = Окр(СтрокаОплаты.СуммаДокументаОплаты 
		* СтрокаОплаты.СуммаДокументаОплатыНаличные / СтрокаОплаты.СуммаДокументаОплаты, 2);
КонецЕсли;

Область.Параметры.ГрупповаяОплата = ?(СтрокаОплаты.ГрупповаяОплата, "V", "");

//
Если ИтогиДень <> Неопределено Тогда
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;

	ИтогиДень.СуммаОплаты_кк = ИтогиДень.СуммаОплаты_кк + СтрокаОплаты.СуммаОплаты_кк;
	ИтогиДень.СуммаОплаты_Нал = ИтогиДень.СуммаОплаты_Нал + СтрокаОплаты.СуммаОплаты_Нал;

	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
КонецЕсли;	
//
КонецПроцедуры

Процедура ЗаявкаОбластьЗаполнить(ТЗ_ОплатыЗаявки, Заявка, Область, ИтогиДень)
Область.Параметры.Номер = Заявка.НомерВРезерв;
Область.Параметры.РасшифровкаНомер = Заявка;

Область.Параметры.ЗаявкаНомер = Заявка.Номер;
Область.Параметры.ЗаявкаДата = Заявка.Дата;

Область.Параметры.КатегорияНомера = Заявка.КатегорияНомера;
Область.Параметры.Статус = Заявка.Статус;

ЗаявкаЗакрыта = Заявка.Закрыто;
Если ЗаявкаЗакрыта Тогда
	Область.Параметры.ДатаЗакрытияЗаявки = Формат(Заявка.ДатаЗакрытия, "ДФ=dd.MM.yy");
КонецЕсли;

Область.Параметры.РасшифровкаЗаявка = Заявка;  

//
КоличествоЧеловек = Заявка.КолВоЧеловек;
Область.Параметры.КоличествоЧеловек = КоличествоЧеловек;

ПроживаниеЗаявка = ПроживаниеЗаявка(Заявка);
Если ПроживаниеЗаявка.Количество() > 0 Тогда 
	СтрокаПроживание = ПроживаниеЗаявка[0];
	
	СуммаПроживаниеБезСкидки_П = СтрокаПроживание.СуммаБезСкидки;
	СуммаПроживание_П = СтрокаПроживание.Сумма;
	ПроживаниеКоличество = СтрокаПроживание.Количество;
	
	ЦенаПроживание = СтрокаПроживание.Цена;
	КоличествоСутокТариф = СтрокаПроживание.Количество;
	
Иначе
	СуммаПроживаниеБезСкидки_П = 0;
	СуммаПроживание_П = 0;
	ПроживаниеКоличество = 0;
	
	ЦенаПроживание = 0;
	КоличествоСутокТариф = 0;
КонецЕсли;

КоличествоЗавтраки = 0;
Если НЕ (Заявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
ИЛИ Заявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
Тогда 
	Если (НЕ Заявка.БезЗавтрака) И (НЕ Заявка.БонШанс) Тогда
		КоличествоЗавтраки = Заявка.КолВоЧеловек * Заявка.Проживание.Количество();
	КонецЕсли;
КонецЕсли;	
Если КоличествоЗавтраки <> 0 Тогда Область.Параметры.КоличествоЗавтраки = КоличествоЗавтраки; КонецЕсли;

Если ЦенаПроживание <> 0 Тогда Область.Параметры.ЦенаПроживание = ЦенаПроживание; КонецЕсли;
Если КоличествоСутокТариф <> 0 Тогда Область.Параметры.КоличествоСутокТариф = КоличествоСутокТариф; КонецЕсли;

// + Комиссия
ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(Заявка.Бронирует, Заявка.РезервС); //, Заявка.В2В);

СуммаКомиссии = ДокументыСервер.СуммаКомиссии(Заявка, СуммаПроживаниеБезСкидки_П
	, Заявка.Счета, Заявка.СчетаДетальноДолги, Заявка.ДопУслуги, ПроцентКомиссии);

Если Заявка.Бронирует.Турагентство Тогда
	СуммаПроживание = СуммаПроживаниеБезСкидки_П;
	
	Если Заявка.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.Взаимозачет Тогда  
		Если Заявка.Бронирует = Заявка.Оплачивает Тогда  
			СуммаКомиссииИнформационно = СуммаКомиссии;
			СуммаКомиссииКВыплате = 0;
		Иначе	
			СуммаКомиссииИнформационно = 0;
			СуммаКомиссииКВыплате = СуммаКомиссии;
		КонецЕсли;	
	ИначеЕсли Заявка.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой Тогда 
		Если Заявка.Бронирует = Заявка.Оплачивает Тогда  
			СуммаКомиссииИнформационно = СуммаКомиссии;
			СуммаКомиссииКВыплате = 0;
		Иначе	
			СуммаКомиссииИнформационно = 0;
			СуммаКомиссииКВыплате = СуммаКомиссии;
		КонецЕсли;					
	ИначеЕсли Заявка.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ПолнаяОплатаТурагентствомСВозвратомКомиссии Тогда 
		СуммаКомиссииИнформационно = 0;
		СуммаКомиссииКВыплате = СуммаКомиссии;
	Иначе	
		СуммаКомиссииИнформационно = 0;
		СуммаКомиссииКВыплате = СуммаКомиссии;
	КонецЕсли;	
	
Иначе	
	СуммаПроживание = СуммаПроживание_П;  
	
	СуммаКомиссии = 0;
	СуммаКомиссииИнформационно = 0; 
	СуммаКомиссииКВыплате = 0;
КонецЕсли;	
// - Комиссия

Если СуммаПроживание <> 0 Тогда Область.Параметры.СуммаПроживание = СуммаПроживание; КонецЕсли;

Если СуммаКомиссииИнформационно > 0 Тогда Область.Параметры.СуммаКомиссииИнформационно = СуммаКомиссииИнформационно; КонецЕсли;
Если СуммаКомиссииКВыплате <> 0 Тогда Область.Параметры.СуммаКомиссииКВыплате = СуммаКомиссииКВыплате; КонецЕсли;

//ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка(Заявка);		    
ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка(ТЗ_ОплатыЗаявки, Заявка);		    
ТЗ_Проживание = Заявка.Проживание;

СуммаЭквайрингаПроживание = ОтчетыСервер.СуммаЭквайрингаПроживание(ТЗ_Проживание, ТЗ_Оплаты);

СуммаНомера = СуммаПроживание - СуммаКомиссии - СуммаЭквайрингаПроживание;
Если СуммаНомера <> 0 Тогда Область.Параметры.СуммаНомера = СуммаНомера; КонецЕсли;

//
Если ИтогиДень <> Неопределено Тогда
	ИтогиДень.КоличествоНочей = ИтогиДень.КоличествоНочей + ПроживаниеКоличество;
	ИтогиДень.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф + КоличествоСутокТариф;
		
	ИтогиДень.СуммаЦенаПроживание = ИтогиДень.СуммаЦенаПроживание + Заявка.Проживание.Итог("Цена");

	ИтогиДень.СуммаПроживание = ИтогиДень.СуммаПроживание + СуммаПроживание;
	ИтогиДень.СуммаНомера = ИтогиДень.СуммаНомера + СуммаНомера;
		
	ИтогиДень.СуммаКомиссииИнформационно = ИтогиДень.СуммаКомиссииИнформационно + СуммаКомиссииИнформационно;
	ИтогиДень.СуммаКомиссииКВыплате = ИтогиДень.СуммаКомиссииКВыплате + СуммаКомиссииКВыплате;
		
	Если НЕ (Заявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
	ИЛИ Заявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
	Тогда 
		ИтогиДень.КоличествоСтатус = ИтогиДень.КоличествоСтатус + 1;
	КонецЕсли;

	ИтогиДень.КоличествоЗавтраки = ИтогиДень.КоличествоЗавтраки + КоличествоЗавтраки;
		
	ИтогиДень.КоличествоЧеловек = ИтогиДень.КоличествоЧеловек + КоличествоЧеловек;
КонецЕсли;		
//
КонецПроцедуры

Функция УслугиОбластьВывести(Заявка, ТЗ_РодительУслуги, ИмяОбласти, Макет, ПолеОтчета, ИтогиДень) 
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                      |	СУММА(ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество) КАК Сумма
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |ГДЕ
                      |	ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
                      |	И ЗаявкаНаБронированиеДопУслуги.Ссылка = &Заявка
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга");
Запрос.УстановитьПараметр("Заявка", Заявка); 

ТЗ_Услуги = Запрос.Выполнить().Выгрузить();

Если ТЗ_Услуги.Количество() > 0 Тогда
	ш =1;
КонецЕсли;	

ТЗ_УслугиИтого = ТЗ_Услуги.Скопировать();
ТЗ_УслугиИтого.Колонки.Добавить("УслугаРодитель");
Для Каждого Строка Из ТЗ_УслугиИтого Цикл 
	Результат = Справочники.ДопУслуги.ПустаяСсылка();
	Ссылка = Строка.Услуга; 
	ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
	
	Строка.УслугаРодитель = Результат;	
КонецЦикла;	
ТЗ_УслугиИтого.Свернуть("УслугаРодитель", "Сумма");

Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
	ЕстьСтрока = Ложь;
	Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
		Если СтрокаУслугиИтого.УслугаРодитель = СтрокаРодительУслуги.Папка Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
	КонецЦикла;
	
	Область_П = Макет.ПолучитьОбласть(ИмяОбласти + "|КолонкаУслуги");
	//Область_П = Область;
	Если ЕстьСтрока Тогда
		Если СтрокаУслугиИтого.Сумма <> 0 Тогда
			Область_П.Параметры.СуммаУслуги = СтрокаУслугиИтого.Сумма;
		КонецЕсли;	
	КонецЕсли;
	
	ВыведеннаяОбласть = ПолеОтчета.Присоединить(Область_П, 1);
КонецЦикла;

Если ИтогиДень <> Неопределено Тогда
	Для Каждого СтрокаУслугиДеньИтого Из ИтогиДень.УслугиДеньИтоги Цикл 
		ЕстьСтрока = Ложь;
		Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
			Если СтрокаУслугиИтого.УслугаРодитель = СтрокаУслугиДеньИтого.УслугаРодитель Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
		КонецЦикла;
		
		Если ЕстьСтрока Тогда 
			Если СтрокаУслугиИтого.Сумма <> 0 Тогда
				СтрокаУслугиДеньИтого.СуммаУслуги = СтрокаУслугиДеньИтого.СуммаУслуги + СтрокаУслугиИтого.Сумма;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецЕсли;

Возврат ВыведеннаяОбласть;
КонецФункции

Процедура ДокументОплатыОбластьЗаполнить(СтрокаОплаты, Область, ИтогиДень)
Область.Параметры.ТипДокументаОплаты = СтрокаОплаты.ТипДокументаОплаты;
Область.Параметры.НомерДокументаОплаты = СтрокаОплаты.НомерДокументаОплаты;
//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаОплаты.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
Область.Параметры.ДатаДокументаОплаты = СтрокаОплаты.ДатаДокументаОплаты;

Область.Параметры.СуммаДокументаОплаты = СтрокаОплаты.СуммаДокументаОплаты;
Область.Параметры.СуммаДокументаОплаты_кк = СтрокаОплаты.СуммаДокументаОплатыКарта;
Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаОплаты.СуммаДокументаОплатыНаличные;

Область.Параметры.СуммаВозвратаДокументаОплаты = СтрокаОплаты.СуммаВозвратаДокументаОплаты;
Область.Параметры.СуммаВозвратаДокументаОплаты_кк = СтрокаОплаты.СуммаВозвратаДокументаОплатыКарта;
Область.Параметры.СуммаВозвратаДокументаОплаты_Нал = СтрокаОплаты.СуммаВозвратаДокументаОплатыНаличные;

Область.Параметры.ОстатокДокументаОплаты = СтрокаОплаты.ОстатокДокументаОплаты;

//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаОплаты);
Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплаты);
Если ТипЗнч(СтрокаОплаты.ДокументОплаты) <> Тип("УникальныйИдентификатор") Тогда
	Оплатил = СтрокаОплаты.ДокументОплаты.ОтКого;
	Если КлиентыСервер.ЭтоЮрЛицо(Оплатил) Тогда
		Область.Параметры.ОплатилИНН = Оплатил.ИНН;
	КонецЕсли;
КонецЕсли;

Если ИтогиДень <> Неопределено Тогда
	ИтогиДень.СуммаДокументаОплаты = ИтогиДень.СуммаДокументаОплаты + СтрокаОплаты.СуммаДокументаОплаты;
	ИтогиДень.СуммаДокументаОплаты_кк = ИтогиДень.СуммаДокументаОплаты_кк + СтрокаОплаты.СуммаДокументаОплатыКарта;
	ИтогиДень.СуммаДокументаОплаты_Нал = ИтогиДень.СуммаДокументаОплаты_Нал + СтрокаОплаты.СуммаДокументаОплатыНаличные;

	ИтогиДень.СуммаВозвратаДокументаОплаты = ИтогиДень.СуммаВозвратаДокументаОплаты + СтрокаОплаты.СуммаВозвратаДокументаОплаты;
	ИтогиДень.СуммаВозвратаДокументаОплаты_кк = ИтогиДень.СуммаВозвратаДокументаОплаты_кк + СтрокаОплаты.СуммаВозвратаДокументаОплатыКарта;
	ИтогиДень.СуммаВозвратаДокументаОплаты_Нал = ИтогиДень.СуммаВозвратаДокументаОплаты_Нал + СтрокаОплаты.СуммаВозвратаДокументаОплатыНаличные;
	
	ИтогиДень.ОстатокДокументаОплаты = ИтогиДень.ОстатокДокументаОплаты + СтрокаОплаты.ОстатокДокументаОплаты;
КонецЕсли;
КонецПроцедуры
////


//////

Функция СформироватьОтчетОплатыНаСервере(Макет, ДатаОплатыОтбор, ФормаОплатыОтбор, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();
ПолеОтчета = Новый ТабличныйДокумент;      

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Папка,
                      |	ДопУслуги.НомерПП КАК НомерПП,
                      |	ДопУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.ДопУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;
Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Папка) Тогда		
		//Область.Параметры.ШапкаДопУслуги = Строка.Папка;
		Если ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			ЗаголовокОтчета = Строка.ЗаголовокОтчеты;
		Иначе
			ЗаголовокОтчета = Строка.Папка;
		КонецЕсли;
		
		Область.Параметры.ШапкаДопУслуги = ЗаголовокОтчета;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область, 0);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

//Область = Макет.ПолучитьОбласть("Шапка|КолонкиПраво");
//ПолеОтчета.Присоединить(Область);

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

//Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
//КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 2;  // - 2 расшифровки

//Область = Макет.ПолучитьОбласть("Строка|КолонкиПраво");
//КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 1 ; // - 1 расшифровки

//КоличествоКолонок = КоличествоКолонок - 2;

ПолеОтчета.ФиксацияСверху = 1;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

//Для ш = 1 По 100 Цикл
//	Область = Макет.ПолучитьОбласть("Строка");	
//	Область.Параметры.Дата = ш;
//	
//	ПолеОтчета.Вывести(Область);
//КонецЦикла;

//
Итоги = Новый Структура();
Итоги.Вставить("КоличествоНочей", 0);
Итоги.Вставить("КоличествоСутокТариф", 0);
Итоги.Вставить("СуммаЦенаПроживание", 0);
Итоги.Вставить("СуммаПроживание", 0);
Итоги.Вставить("СуммаНомера", 0);
Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаЭквайринга", 0);
Итоги.Вставить("СуммаКомиссии", 0);
Итоги.Вставить("ПолнаяСуммаКомиссии", 0);

Итоги.Вставить("КоличествоСтатус", 0);
Итоги.Вставить("КоличествоЗавтраки", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);
//

//
ИтогиДень = Новый Структура();
ИтогиДень.Вставить("КоличествоНочей", 0);
ИтогиДень.Вставить("КоличествоСутокТариф", 0);
ИтогиДень.Вставить("СуммаЦенаПроживание", 0);
ИтогиДень.Вставить("СуммаПроживание", 0);
ИтогиДень.Вставить("СуммаНомера", 0);
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);
ИтогиДень.Вставить("СуммаКомиссии", 0);
ИтогиДень.Вставить("ПолнаяСуммаКомиссии", 0);

ИтогиДень.Вставить("КоличествоСтатус", 0);
ИтогиДень.Вставить("КоличествоЗавтраки", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);
//

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга КАК Услуга,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Сумма
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументОплатыКасса,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ВЫБОР
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Взаимозачет)
                      |						ТОГДА 9
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                      |						ТОГДА 10
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)
                      |						ТОГДА 11
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                      |						ТОГДА 12
                      |					ИНАЧЕ 10
                      |				КОНЕЦ
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |					ТОГДА ВЫБОР
                      |							КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |								ТОГДА 8
                      |							КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ЭтоЭквайринг
                      |								ТОГДА ВЫБОР
                      |										КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |											ТОГДА 5
                      |										ИНАЧЕ 4
                      |									КОНЕЦ
                      |							ИНАЧЕ 3
                      |						КОНЕЦ
                      |				ИНАЧЕ ВЫБОР
                      |						КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |							ТОГДА 8
                      |						КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные = 0
                      |								И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта > 0
                      |							ТОГДА 1
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные > 0
                      |										И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта = 0
                      |									ТОГДА 2
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ЭтоЭквайринг
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК ЭтоЭквайринг,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Сумма КАК СуммаДокументаОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого КАК ДокументОплатыОтКого,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК ДопУслугиУслуга,
                      |	ЕСТЬNULL(КассоваяСмена.НачалоКассовойСмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыККМ
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                      |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |			КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
                      |			МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
                      |				ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
                      |					И (ВЫБОР
                      |						КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
                      |							ТОГДА ИСТИНА
                      |						ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
                      |					КОНЕЦ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.Ссылка,
                      |			КассоваяСмена.НомерСменыККТ) КАК КассоваяСмена
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = КассоваяСмена.ДокументОплаты
                      |ГДЕ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты = &ДатаОплаты
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |	ДатаУслуги,
                      |	ДокументОплатыДатаОплаты,
                      |	ДокументОплаты");

Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплатыОтбор);
ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();	

Для Каждого Строка Из ТЗ_Оплаты Цикл
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ДокументОплатыОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_Оплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;

Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	Если ФормаОплатыОтбор <> "" Тогда
		Если ФормаОплатыОтбор <> ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты) 
		Тогда Продолжить; КонецЕсли;
	КонецЕсли;	
	
	Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
	
	//Область.Параметры.Дата = ".";
	
	НомерПредставление = "" + СтрокаОплаты.Заявка.НомерВРезерв + " / "
		 + ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(СтрокаОплаты.Заявка.Номер) + " от " + Формат(СтрокаОплаты.Заявка.Дата, "ДФ=dd.MM.yy");
	Область.Параметры.Номер = НомерПредставление;
	Область.Параметры.РасшифровкаНомер = СтрокаОплаты.Заявка;
	
	Область.Параметры.ЗаявкаНомер = СтрокаОплаты.Заявка.Номер;
	Область.Параметры.ЗаявкаДата = СтрокаОплаты.Заявка.Дата;
	
	Область.Параметры.РасшифровкаЗаявка = СтрокаОплаты.Заявка;
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	Если ЗначениеЗаполнено(СтрокаОплаты.ДатаСменыККМ) Тогда
		Область.Параметры.ДатаОткрытияСмены = Формат(СтрокаОплаты.ДатаСменыККМ, "ДФ=dd.MM.yy");
	КонецЕсли;
	
	Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
	
	//Область.Параметры.Оплатил = СтрокаОплаты.ДокументОплаты.ОтКого;
	//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаОплаты);
	Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплаты);
	
	СуммаОплаты = СтрокаОплаты.СуммаОплаты;
	Область.Параметры.СуммаОплаты = СуммаОплаты;
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
	Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;
	
	Если СтрокаОплаты.Услуга Тогда
		Область.Параметры.Дата = Формат(СтрокаОплаты.ДатаУслуги, "ДФ=dd.MM.yy");
		ПолеОтчета.Вывести(Область, 0);
					
		Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
			
			Результат = Справочники.ДопУслуги.ПустаяСсылка();
			Ссылка = СтрокаОплаты.ДопУслугиУслуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
			
			ЕстьСтрока = Ложь;
			Если Результат = СтрокаРодительУслуги.Папка Тогда
				ЕстьСтрока = Истина;
			КонецЕсли;
			
			ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
			Если ЕстьСтрока Тогда
				ОбластьУслуги.Параметры.СуммаУслуги = СтрокаОплаты.СуммаОплаты;
			КонецЕсли;
			
			ПолеОтчета.Присоединить(ОбластьУслуги, 0);
		КонецЦикла;
	
	Иначе
		Область.Параметры.Дата = Формат(СтрокаОплаты.ДеньПроживания, "ДФ=dd.MM.yy");
		Область.Параметры.СуммаПроживание = СтрокаОплаты.СуммаОплаты;
		
		ПолеОтчета.Вывести(Область, 0);
	КонецЕсли;
	
	
////
	//ИтогиДень.КоличествоНочей = ИтогиДень.КоличествоНочей + 1;
	//ИтогиДень.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф + КоличествоСутокТариф;
	//
	//ИтогиДень.СуммаЦенаПроживание = ИтогиДень.СуммаЦенаПроживание + ЦенаПроживание;
	
	//ИтогиДень.СуммаНомера = ИтогиДень.СуммаНомера + СуммаНомера;
	
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
	
	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
	
	//ИтогиДень.СуммаКомиссии = ИтогиДень.СуммаКомиссии + СуммаКомиссии;
	//ИтогиДень.ПолнаяСуммаКомиссии = ИтогиДень.ПолнаяСуммаКомиссии + ПолнаяСуммаКомиссии;
	
	//Если НЕ (СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
	//ИЛИ СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
	//Тогда 
	//	ИтогиДень.КоличествоСтатус = ИтогиДень.КоличествоСтатус + 1;
	//КонецЕсли;
	//
	//Если НЕ (СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
	//ИЛИ СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
	//Тогда 
	//	ИтогиДень.КоличествоЗавтраки = КоличествоЗавтраки;
	//КонецЕсли;
		
	Если СтрокаОплаты.Услуга Тогда
		Результат = Справочники.ДопУслуги.ПустаяСсылка();
		Ссылка = СтрокаОплаты.ДопУслугиУслуга; 
		ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
		
		ОтборСтроки = Новый Структура("УслугаРодитель", Результат); 
		НайденныеСтроки = ИтогиДень.УслугиДеньИтоги.НайтиСтроки(ОтборСтроки);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.СуммаУслуги = НайденнаяСтрока.СуммаУслуги + СтрокаОплаты.СуммаОплаты;
		КонецЦикла;
	Иначе	
		ИтогиДень.СуммаПроживание = ИтогиДень.СуммаПроживание + СтрокаОплаты.СуммаОплаты;
	КонецЕсли;		
	
КонецЦикла;

// + Нераспределенные оплаты
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Заявка,
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	NULL КАК СчетГУИД,
                      |	NULL КАК Услуга,
                      |	NULL КАК ДолгиГУИД,
                      |	КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) КАК СуммаОплаты,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументОплатыКасса,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаНаличные,
                      |	КассовыйДокумент.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА КассовыйДокумент.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ КассовыйДокумент.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаКарта,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ЛОЖЬ КАК ЭтоЭквайринг
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ДолгиОплата_КД
                      |		ПО КассовыйДокумент.Ссылка = ДолгиОплата_КД.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) <> 0
                      |	И КассовыйДокумент.Возврат = ЛОЖЬ
                      |	И НЕ КассовыйДокумент.ЭтоПроизвольныйЧек
                      |	И КассовыйДокумент.ДатаОплаты = &ДатаОплаты");		

Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплатыОтбор);		
ТЗ = Запрос.Выполнить().Выгрузить();	

ТЗ_НераспределенныеОплаты = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_НераспределенныеОплаты.Колонки.Найти("ДокументОплаты");
ТЗ_НераспределенныеОплаты.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_НераспределенныеОплаты.Колонки.Добавить("ДокументОплаты");

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ДокументОплатыОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Заявка,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	NULL КАК СчетГУИД,
                      |	NULL КАК Услуга,
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) КАК СуммаОплаты,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументОплатыКасса,
                      |	0 КАК СуммаНаличные,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВыпискаБанка.ЭтоЭквайринг КАК ЭтоЭквайринг
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ДолгиОплата_ВБ
                      |		ПО ВыпискаБанка.Ссылка = ДолгиОплата_ВБ.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) <> 0
                      |	И ВыпискаБанка.Возврат = Ложь
                      |	И ВыпискаБанка.ДатаОплаты = &ДатаОплаты");

Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплатыОтбор);		
ТЗ = Запрос.Выполнить().Выгрузить();
	
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

ТЗ_НераспределенныеОплаты.Колонки.Добавить("ПроцентЭквайринга");
Для Каждого Строка Из ТЗ_НераспределенныеОплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга
	                  |ИЗ
	                  |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                  |ГДЕ
	                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
КонецЦикла;

Для Каждого СтрокаНераспределенныеОплаты Из ТЗ_НераспределенныеОплаты Цикл
	Если ФормаОплатыОтбор <> "" Тогда
		Если ФормаОплатыОтбор <> ОтчетыСервер.ТипОплатыНаименование(СтрокаНераспределенныеОплаты.ТипОплаты) 
		Тогда Продолжить; КонецЕсли;
	КонецЕсли;	
	
	Область = Макет.ПолучитьОбласть("СтрокаНераспределенныеОплатыДополнение|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаНераспределенныеОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаНераспределенныеОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	СуммаОплаты = СтрокаНераспределенныеОплаты.СуммаОплаты;
	Область.Параметры.СуммаОплаты = СуммаОплаты;
	Область.Параметры.РасшифровкаДокументОплаты = СтрокаНераспределенныеОплаты.ДокументОплаты;
	
	//Область.Параметры.Оплатил = СтрокаНераспределенныеОплаты.ДокументОплаты.ОтКого;
	Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаНераспределенныеОплаты);
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаНераспределенныеОплаты);
	Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;
	
	ПолеОтчета.Вывести(Область, 0);
	
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
	
	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  

КонецЦикла;

	// - Нераспределенные оплаты

Область = Макет.ПолучитьОбласть("ИтогиДень|КолонкиЛево");

//Дата = Формат(ДатаОплатыОтбор, "ДФ='д.МММ гг'" );  
//Область.Параметры.Дата = Дата;		
Область.Параметры.Дата = ".";		


//Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
//Область.Параметры.Месяц = Месяц;		

//ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
//Область.Параметры.ДеньНедели = ДеньНедели;

//Область.Параметры.Номер = "Итого Ночей:";
//Область.Параметры.КатегорияНомера = ИтогиДень.КоличествоНочей;
//Область.Параметры.ЦенаПроживание = ИтогиДень.СуммаЦенаПроживание;
Область.Параметры.СуммаПроживание = ИтогиДень.СуммаПроживание;
//Область.Параметры.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф;
//Область.Параметры.СуммаКомиссии = ИтогиДень.СуммаКомиссии;
//Область.Параметры.ПолнаяСуммаКомиссии = ИтогиДень.ПолнаяСуммаКомиссии;
Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
//Область.Параметры.СуммаНомера = ИтогиДень.СуммаНомера;

//Область.Параметры.КоличествоСтатус = ИтогиДень.КоличествоСтатус;
//Область.Параметры.КоличествоЗавтраки = ИтогиДень.КоличествоЗавтраки;
ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 0);
КонецЦикла;

Возврат ПолеОтчета;
КонецФункции

//////

Функция ОплатилНаименование_ПеренесеноВОтчтетыСервер(Строка)
Если Строка.ТипОплаты = 0 Тогда	
	Возврат "Гость смеш.";
ИначеЕсли Строка.ТипОплаты = 1 Тогда	
	Возврат "Гость к/к";
ИначеЕсли Строка.ТипОплаты = 2 Тогда	
	Возврат "Гость нал";
ИначеЕсли Строка.ТипОплаты = 3 Тогда	
	//Возврат "б/н";
	//Возврат "" + Строка.КонтрагентНаименование + " б/н";
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("УникальныйИдентификатор") Тогда
		Возврат "" + Строка.КонтрагентНаименование + " б/н";
	Иначе		
		Возврат "" + Строка.ДокументОплаты.ОтКого + " б/н";
	КонецЕсли;		
ИначеЕсли Строка.ТипОплаты = 4 Тогда	
	Возврат "Гость п/к";
ИначеЕсли Строка.ТипОплаты = 5 Тогда	
	Возврат "Гость сбп";
ИначеЕсли Строка.ТипОплаты = 9 Тогда	
	Возврат "" + Строка.ДокументОплаты.ОтКого + " в/з";
КонецЕсли;

Возврат "";	
КонецФункции
 
Функция ТЗ_УслугиРодитель()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Папка,
                      |	ДопУслуги.НомерПП КАК НомерПП,
                      |	ДопУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_УслугиРодитель = Запрос.Выполнить().Выгрузить();
ТЗ_УслугиРодитель.Сортировать("НомерПП");

НоваяСтрока = ТЗ_УслугиРодитель.Добавить();
НоваяСтрока.Папка = Справочники.ДопУслуги.ПустаяСсылка();	

Возврат ТЗ_УслугиРодитель;
КонецФункции

Функция ПроживаниеЗаявка(Заявка) 
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
                      |	СУММА(ЗаявкаНаБронированиеПроживание.СуммаБезСкидки) КАК СуммаБезСкидки,
                      |	СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма,
                      |	СРЕДНЕЕ(ЗаявкаНаБронированиеПроживание.Цена) КАК Цена,
                      |	СУММА(ЗаявкаНаБронированиеПроживание.Количество) КАК Количество
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |ГДЕ
                      |	ЗаявкаНаБронированиеПроживание.Ссылка = &Заявка
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЗаявкаНаБронированиеПроживание.Ссылка");

Запрос.УстановитьПараметр("Заявка", Заявка);

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Строка.Цена = Окр(Строка.Цена);	
КонецЦикла;

Возврат ТЗ;
КонецФункции

Функция Список_ОплатыКоворкинг(ТипДокумента)
Список_ОплатыКоворкинг = Новый СписокЗначений;
	
Если ТипДокумента = "КД" Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КассовыйДокументДолгиОплата.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
	                      |ГДЕ
	                      |	ТИПЗНАЧЕНИЯ(КассовыйДокументДолгиОплата.ДокументДолг) = ТИП(Документ.КоворкингСчета)
	                      |	И КассовыйДокументДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	КассовыйДокументДолгиОплата.Ссылка");
	
ИначеЕсли ТипДокумента = "ВБ" Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
	                      |ГДЕ
	                      |	ТИПЗНАЧЕНИЯ(ВыпискаБанкаДолгиОплата.ДокументДолг) = ТИП(Документ.КоворкингСчета)
	                      |	И ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВыпискаБанкаДолгиОплата.Ссылка");
	
Иначе
	Возврат Список_ОплатыКоворкинг;
КонецЕсли;

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Список_ОплатыКоворкинг.Добавить(Строка.Ссылка);
КонецЦикла;

Возврат Список_ОплатыКоворкинг;
КонецФункции

Функция Список_ПлатежиКонтрагенту(ТипДокумента)
Список_ПлатежиКонтрагенту = Новый СписокЗначений;

Если ТипДокумента = "ВБ" Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыпискаБанка.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
	                      |ГДЕ
	                      |	ВыпискаБанка.ЭтоПлатежКонтрагенту = ИСТИНА");
Иначе
	Возврат Список_ПлатежиКонтрагенту; 
КонецЕсли;

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Список_ПлатежиКонтрагенту.Добавить(Строка.Ссылка);
КонецЦикла;

Возврат Список_ПлатежиКонтрагенту;
КонецФункции
//

//
Функция ПлатежиКонтрагенту(ДатаОтчетаС, ДатаОтчетаПо) Экспорт

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГрупповыеСчетаКомиссияДокументыДолги.Ссылка КАК ГрупповойСчет,
                      |	ГрупповыеСчетаКомиссияДокументыДолги.ДокументДолг КАК ДокументДолг,
                      |	ГрупповыеСчетаКомиссияДокументыДолги.СуммаКомиссииКонтрагент КАК СуммаКомиссииКонтрагент
					  |ИЗ
                      |	Документ.ГрупповыеСчета.КомиссияДокументыДолги КАК ГрупповыеСчетаКомиссияДокументыДолги
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК Клиенты
                      |		ПО ГрупповыеСчетаКомиссияДокументыДолги.Ссылка.Контрагент = Клиенты.Ссылка
                      |ГДЕ
                      |	ГрупповыеСчетаКомиссияДокументыДолги.ДокументДолг В
                      |			(ВЫБРАТЬ
                      |				ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |			ИЗ
                      |				Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |			ГДЕ
                      |				(ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |						И НЕ(ЗаявкаНаБронирование.РезервС < &ДатаС
                      |								И ЗаявкаНаБронирование.РезервПо < &ДатаС)
                      |					ИЛИ ЗаявкаНаБронирование.РезервС > &ДатаПо))
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ГрупповойСчет,
                      |	ДокументДолг");

Запрос.УстановитьПараметр("ДатаС", ДатаОтчетаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаОтчетаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

ТЗ_Комиссия = Новый ТаблицаЗначений;
ТЗ_Комиссия.Колонки.Добавить("ГрупповойСчет");
ТЗ_Комиссия.Колонки.Добавить("Заявка");
ТЗ_Комиссия.Колонки.Добавить("СуммаРаспределено");
ТЗ_Комиссия.Колонки.Добавить("ДокументПлатежа");

//ТЗ_Комиссия.Колонки.Добавить("ПроцентКомиссии");

ТЗ_ДокументыПлатежа = Новый ТаблицаЗначений;
ТЗ_ДокументыПлатежа.Колонки.Добавить("ДокументПлатежа");

СуммаОплаты = 0;
ОстатокОплаты = 0;
ГрупповойСчет_П = Неопределено;

Для Каждого Строка Из ТЗ Цикл
	Если Строка.ГрупповойСчет <> ГрупповойСчет_П Тогда  
		ГрупповойСчет_П = Строка.ГрупповойСчет;
		
		ТЗ_ДокументыПлатежа.Очистить();
		Для Каждого СтрокаОплаты Из ГрупповойСчет_П.ДокументыОплаты Цикл
			Если ТипЗнч(СтрокаОплаты.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда 
				НоваяСтрокаДокументыПлатежа = ТЗ_ДокументыПлатежа.Добавить();
				НоваяСтрокаДокументыПлатежа.ДокументПлатежа = СтрокаОплаты.ДокументОплаты;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаОплаты Из ГрупповойСчет_П.ДокументыПлатежиКонтрагенту Цикл
			НоваяСтрокаДокументыПлатежа = ТЗ_ДокументыПлатежа.Добавить();
			НоваяСтрокаДокументыПлатежа.ДокументПлатежа = СтрокаОплаты.ДокументПлатежа;
		КонецЦикла;
	КонецЕсли;
	
	Если Строка.СуммаКомиссииКонтрагент = 0 Тогда
		СуммаИтогоПроживание = Строка.ДокументДолг.Проживание.Итог("СуммаБезСкидки");
		
		//ПроцентКомиссии = Строка.ДокументДолг.Бронирует.ПроцентКомиссии;
		ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(Строка.ДокументДолг.Бронирует, Строка.ДокументДолг.РезервС); //, Строка.ДокументДолг.В2В);
		
		СуммаКомиссии = ДокументыСервер.СуммаКомиссии(Строка.ДокументДолг, СуммаИтогоПроживание
			, Строка.ДокументДолг.Счета, Строка.ДокументДолг.СчетаДетальноДолги, Строка.ДокументДолг.ДопУслуги, ПроцентКомиссии);
		
	Иначе
		СуммаКомиссии = Строка.СуммаКомиссииКонтрагент;
	КонецЕсли;		
	
	Для Каждого СтрокаДокументПлатежа Из ТЗ_ДокументыПлатежа Цикл
		ОстатокОплаты = СтрокаДокументПлатежа.ДокументПлатежа.Сумма;
		
		НоваяСтрока = ТЗ_Комиссия.Добавить();
		
		НоваяСтрока.ГрупповойСчет = Строка.ГрупповойСчет;
		НоваяСтрока.Заявка = Строка.ДокументДолг;
		НоваяСтрока.ДокументПлатежа = СтрокаДокументПлатежа.ДокументПлатежа;
		
		Если ОстатокОплаты >= СуммаКомиссии Тогда  
			НоваяСтрока.СуммаРаспределено = СуммаКомиссии;
			
			ОстатокОплаты = ОстатокОплаты - СуммаКомиссии;
			СуммаКомиссии = 0;
			
			Прервать;
		Иначе
			НоваяСтрока.СуммаРаспределено = ОстатокОплаты;
			СуммаКомиссии = СуммаКомиссии - ОстатокОплаты;
			
			ОстатокОплаты = 0;
		КонецЕсли;
	КонецЦикла;
КонецЦикла;

Возврат ТЗ_Комиссия;
КонецФункции
 
Процедура ПлатежиОбластьЗаполнить(Платежи, Заявка, Область, ИтогиДень)
ОтборСтроки = Новый Структура("Заявка", Заявка);
Массив_Платежи = Платежи.НайтиСтроки(ОтборСтроки);

КомиссияДатаОплаты = Неопределено;
КомиссияТипОплаты = Неопределено;
СуммаКомиссииРаспределено = 0;
Если Массив_Платежи.Количество() = 1 Тогда 
	СтрокаПлатежа = Массив_Платежи[0];
	
	СуммаКомиссииРаспределено = СтрокаПлатежа.СуммаРаспределено;
	
	КомиссияДатаОплаты = СтрокаПлатежа.ДокументПлатежа.ДатаОплаты;
	КомиссияТипОплаты = ОтчетыСервер.ТипПлатежаНаименование(СтрокаПлатежа.ДокументПлатежа);
	
	РасшифровкаКомиссияДокументПлатежа = СтрокаПлатежа.ДокументПлатежа;
ИначеЕсли Массив_Платежи.Количество() > 1 Тогда 
	Для Каждого СтрокаПлатежа Из Массив_Платежи Цикл 
		СуммаКомиссииРаспределено = СуммаКомиссииРаспределено + СтрокаПлатежа.СуммаРаспределено;
	КонецЦикла;
КонецЕсли;

Если СуммаКомиссииРаспределено <> 0 Тогда Область.Параметры.СуммаКомиссииОплата = СуммаКомиссииРаспределено; КонецЕсли;

Если ЗначениеЗаполнено(КомиссияДатаОплаты) Тогда 
	Область.Параметры.КомиссияДатаОплаты = Формат(КомиссияДатаОплаты, "ДФ=dd.MM.yy"); 
	
	Область.Параметры.РасшифровкаКомиссияДокументОплаты = РасшифровкаКомиссияДокументПлатежа; 
КонецЕсли;

Если ЗначениеЗаполнено(КомиссияТипОплаты) Тогда Область.Параметры.КомиссияТипОплаты = Формат(КомиссияТипОплаты, "ДФ=dd.MM.yy"); КонецЕсли;

Если ИтогиДень <> Неопределено Тогда
	 ИтогиДень.СуммаКомиссииОплата = ИтогиДень.СуммаКомиссииОплата + СуммаКомиссииРаспределено;
КонецЕсли;	
КонецПроцедуры
//


Функция ПлатежиКонтрагентуРаспределение(ДатаОтчетаС, ДатаОтчетаПо) Экспорт

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГрупповыеСчетаКомиссияДокументыДолги.Ссылка КАК ГрупповойСчет,
                      |	ГрупповыеСчетаКомиссияДокументыДолги.ДокументДолг КАК ДокументДолг,
                      |	ГрупповыеСчетаКомиссияДокументыДолги.СуммаКомиссииКонтрагент КАК СуммаКомиссииКонтрагент
                      |ИЗ
                      |	Документ.ГрупповыеСчета.КомиссияДокументыДолги КАК ГрупповыеСчетаКомиссияДокументыДолги
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК Клиенты
                      |		ПО ГрупповыеСчетаКомиссияДокументыДолги.Ссылка.Контрагент = Клиенты.Ссылка
                      |ГДЕ
                      |	ГрупповыеСчетаКомиссияДокументыДолги.ДокументДолг В
                      |			(ВЫБРАТЬ
                      |				ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |			ИЗ
                      |				Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |			ГДЕ
                      |				(ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |						И НЕ(ЗаявкаНаБронирование.РезервС < &ДатаС
                      |								И ЗаявкаНаБронирование.РезервПо < &ДатаС)
                      |					ИЛИ ЗаявкаНаБронирование.РезервС > &ДатаПо))
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ГрупповойСчет,
                      |	ДокументДолг");

Запрос.УстановитьПараметр("ДатаС", ДатаОтчетаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаОтчетаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

ТЗ_Комиссия = Новый ТаблицаЗначений;
ТЗ_Комиссия.Колонки.Добавить("ГрупповойСчет");
ТЗ_Комиссия.Колонки.Добавить("Заявка");
ТЗ_Комиссия.Колонки.Добавить("СуммаРаспределено");
ТЗ_Комиссия.Колонки.Добавить("ДокументПлатежа");

//ТЗ_Комиссия.Колонки.Добавить("ПроцентКомиссии");

ТЗ_ДокументыПлатежа = Новый ТаблицаЗначений;
ТЗ_ДокументыПлатежа.Колонки.Добавить("ДокументПлатежа");

СуммаОплаты = 0;
ОстатокОплаты = 0;
ГрупповойСчет_П = Неопределено;

Для Каждого Строка Из ТЗ Цикл
	Если Строка.ГрупповойСчет <> ГрупповойСчет_П Тогда  
		ГрупповойСчет_П = Строка.ГрупповойСчет;
		
		ТЗ_ДокументыПлатежа.Очистить();
		Для Каждого СтрокаОплаты Из ГрупповойСчет_П.ДокументыОплаты Цикл
			Если ТипЗнч(СтрокаОплаты.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда 
				НоваяСтрокаДокументыПлатежа = ТЗ_ДокументыПлатежа.Добавить();
				НоваяСтрокаДокументыПлатежа.ДокументПлатежа = СтрокаОплаты.ДокументОплаты;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаОплаты Из ГрупповойСчет_П.ДокументыПлатежиКонтрагенту Цикл
			НоваяСтрокаДокументыПлатежа = ТЗ_ДокументыПлатежа.Добавить();
			НоваяСтрокаДокументыПлатежа.ДокументПлатежа = СтрокаОплаты.ДокументПлатежа;
		КонецЦикла;
	КонецЕсли;
	
	Если Строка.СуммаКомиссииКонтрагент = 0 Тогда
		СуммаИтогоПроживание = Строка.ДокументДолг.Проживание.Итог("СуммаБезСкидки");
		
		ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(Строка.ДокументДолг.Бронирует, Строка.ДокументДолг.РезервС); //, Строка.ДокументДолг.В2В);
		
		СуммаКомиссии = ДокументыСервер.СуммаКомиссии(Строка.ДокументДолг, СуммаИтогоПроживание
			, Строка.ДокументДолг.Счета, Строка.ДокументДолг.СчетаДетальноДолги, Строка.ДокументДолг.ДопУслуги, ПроцентКомиссии);
		
	Иначе
		СуммаКомиссии = Строка.СуммаКомиссииКонтрагент;
	КонецЕсли;		
	
	Для Каждого СтрокаДокументПлатежа Из ТЗ_ДокументыПлатежа Цикл
		ОстатокОплаты = СтрокаДокументПлатежа.ДокументПлатежа.Сумма;
		
		НоваяСтрока = ТЗ_Комиссия.Добавить();
		
		НоваяСтрока.ГрупповойСчет = Строка.ГрупповойСчет;
		НоваяСтрока.Заявка = Строка.ДокументДолг;
		НоваяСтрока.ДокументПлатежа = СтрокаДокументПлатежа.ДокументПлатежа;
		
		Если ОстатокОплаты >= СуммаКомиссии Тогда  
			НоваяСтрока.СуммаРаспределено = СуммаКомиссии;
			
			ОстатокОплаты = ОстатокОплаты - СуммаКомиссии;
			СуммаКомиссии = 0;
			
			Прервать;
		Иначе
			НоваяСтрока.СуммаРаспределено = ОстатокОплаты;
			СуммаКомиссии = СуммаКомиссии - ОстатокОплаты;
			
			ОстатокОплаты = 0;
		КонецЕсли;
	КонецЦикла;
КонецЦикла;

ТЗ_КомиссияРаспределение = Новый ТаблицаЗначений;
ТЗ_КомиссияРаспределение.Колонки.Добавить("ГрупповойСчет");
ТЗ_КомиссияРаспределение.Колонки.Добавить("Заявка");
ТЗ_КомиссияРаспределение.Колонки.Добавить("Дата");
ТЗ_КомиссияРаспределение.Колонки.Добавить("СуммаКомиссииКЗачету");
ТЗ_КомиссияРаспределение.Колонки.Добавить("СуммаРаспределено");
ТЗ_КомиссияРаспределение.Колонки.Добавить("ДокументПлатежа");

Для Каждого СтрокаКомиссия Из ТЗ_Комиссия Цикл
	
	ОстатокСуммаКомиссии = СтрокаКомиссия.СуммаРаспределено;
	
	Если СтрокаКомиссия.Заявка.Проживание.Количество() = 0 Тогда
		Для Каждого СтрокаУслуги Из СтрокаКомиссия.Заявка.ДопУслуги Цикл
			Если НЕ СтрокаУслуги.ВСчет Тогда Продолжить; КонецЕсли;      
			
			ОтборСтроки = Новый Структура("ДолгиГУИД", СтрокаУслуги.ГУИД);
			ЗаявкаСчетаДетальноДолги = СтрокаКомиссия.Заявка.СчетаДетальноДолги.Выгрузить(ОтборСтроки);
			ЗаявкаДопУслуги = СтрокаКомиссия.Заявка.ДопУслуги.Выгрузить(ОтборСтроки);
			
			//ПроцентКомиссии = СтрокаКомиссия.Заявка.Бронирует.ПроцентКомиссии;
			ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(СтрокаКомиссия.Заявка.Бронирует, СтрокаКомиссия.РезервС); //, СтрокаКомиссия.Заявка.В2В);
			
			СуммаКомиссии = ДокументыСервер.СуммаКомиссии(СтрокаКомиссия.Заявка, 0
				, СтрокаКомиссия.Заявка.Счета, ЗаявкаСчетаДетальноДолги, ЗаявкаДопУслуги, ПроцентКомиссии);
			
			Если СуммаКомиссии = 0 Тогда Продолжить; КонецЕсли;
					
			НоваяСтрока = ТЗ_КомиссияРаспределение.Добавить();
			
			НоваяСтрока.ГрупповойСчет = СтрокаКомиссия.ГрупповойСчет;
			НоваяСтрока.Заявка = СтрокаКомиссия.Заявка;
			НоваяСтрока.ДокументПлатежа = СтрокаКомиссия.ДокументПлатежа;
			
			НоваяСтрока.Дата = СтрокаУслуги.ДатаУслуги;
			
			СуммаРаспределено = СуммаКомиссии;
			
			Если ОстатокСуммаКомиссии >= СуммаРаспределено Тогда  
				НоваяСтрока.СуммаРаспределено = СуммаРаспределено;
				НоваяСтрока.СуммаКомиссииКЗачету = СуммаРаспределено;
				
				ОстатокСуммаКомиссии = ОстатокСуммаКомиссии - НоваяСтрока.СуммаРаспределено;
			Иначе
				НоваяСтрока.СуммаРаспределено = ОстатокСуммаКомиссии;
				НоваяСтрока.СуммаКомиссииКЗачету = ОстатокСуммаКомиссии;
				
				ОстатокСуммаКомиссии = 0;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе		
		
		Для Каждого СтрокаПроживание Из СтрокаКомиссия.Заявка.Проживание Цикл
			НоваяСтрока = ТЗ_КомиссияРаспределение.Добавить();
			
			НоваяСтрока.ГрупповойСчет = СтрокаКомиссия.ГрупповойСчет;
			НоваяСтрока.Заявка = СтрокаКомиссия.Заявка;

			НоваяСтрока.ДокументПлатежа = СтрокаКомиссия.ДокументПлатежа;
			
			НоваяСтрока.Дата = СтрокаПроживание.ДеньПроживания;
			
			ОтборСтроки = Новый Структура("ДатаДолг", СтрокаПроживание.ДеньПроживания);
			ЗаявкаСчетаДетальноДолги = СтрокаКомиссия.Заявка.СчетаДетальноДолги.Выгрузить(ОтборСтроки);
		
			ОтборСтроки = Новый Структура("ДатаУслуги", СтрокаПроживание.ДеньПроживания);
			ЗаявкаДопУслуги = СтрокаКомиссия.Заявка.ДопУслуги.Выгрузить(ОтборСтроки);
		
			//ПроцентКомиссии = СтрокаКомиссия.Заявка.Бронирует.ПроцентКомиссии;
			ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(СтрокаКомиссия.Заявка.Бронирует, СтрокаКомиссия.Заявка.РезервС); //, СтрокаКомиссия.Заявка.В2В);
			
			СуммаКомиссии = ДокументыСервер.СуммаКомиссии(СтрокаКомиссия.Заявка, СтрокаПроживание.СуммаБезСкидки
				, СтрокаКомиссия.Заявка.Счета, ЗаявкаСчетаДетальноДолги, ЗаявкаДопУслуги, ПроцентКомиссии);
			
			СуммаРаспределено = СуммаКомиссии;
			
			Если ОстатокСуммаКомиссии >= СуммаРаспределено Тогда  
				НоваяСтрока.СуммаРаспределено = СуммаРаспределено;
				НоваяСтрока.СуммаКомиссииКЗачету = СуммаРаспределено;
				
				ОстатокСуммаКомиссии = ОстатокСуммаКомиссии - НоваяСтрока.СуммаРаспределено;
			Иначе
				НоваяСтрока.СуммаРаспределено = ОстатокСуммаКомиссии;
				НоваяСтрока.СуммаКомиссииКЗачету = ОстатокСуммаКомиссии;
				
				ОстатокСуммаКомиссии = 0;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
КонецЦикла;

Возврат ТЗ_КомиссияРаспределение;	
КонецФункции
////

////
Функция СформироватьОтчетРаспределениеОплатНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();
ПолеОтчета = Новый ТабличныйДокумент;      

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Папка,
                      |	ДопУслуги.НомерПП КАК НомерПП
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.ДопУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы; 

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

ПолеОтчета.ФиксацияСверху = 2;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

//

ИтогиДень = Новый Структура();
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаНаличные", 0);
ИтогиДень.Вставить("СуммаКарта", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);

ИтогиДень.Вставить("СуммаОплатыЗатраты", 0);
ИтогиДень.Вставить("СуммаОплатыНераспределено", 0);

//
ОбластьВидОплаты = Макет.ПолучитьОбласть("ЗаголовокВидОплаты|КолонкиЛево"); 
ОбластьВидОплаты.Параметры.ВидОплаты = "Касса";
ПолеОтчета.Вывести(ОбластьВидОплаты, 0);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассовыйДокумент.Приход КАК Приход,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаКарта,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаНаличные,
                      |	КассовыйДокумент.НомерСменыККМ КАК НомерСменыККМ,
                      |	КассовыйДокумент.НомерЧекаККМ КАК НомерЧекаККМ,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.Приход
                      |			ТОГДА КассовыйДокумент.Сумма
                      |		ИНАЧЕ -КассовыйДокумент.Сумма
                      |	КОНЕЦ КАК СуммаОплаты,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозврат,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ -1
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |			И КассовыйДокумент.Приход = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаОплатыC
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОплатыПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаОплаты,
                      |	НомерСменыККМ");

Запрос.УстановитьПараметр("ДатаОплатыC", ДатаОтчетаС );
Запрос.УстановитьПараметр("ДатаОплатыПо", ДатаОтчетаПо );
ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();	

ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайринга");
Для Каждого Строка Из ТЗ_Оплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга
	                  |ИЗ
	                  |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                  |ГДЕ
	                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
КонецЦикла;
	
Дата_П = '00010101';
Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	Если НЕ СтрокаОплаты.ДатаОплаты = Дата_П Тогда
		Если Дата_П <> '00010101' Тогда
			ИтогиДеньОплатыВывод(ПолеОтчета, Макет, ИтогиДень, Дата_П);						
		КонецЕсли;		
			
		ОбластьДатаОплаты = Макет.ПолучитьОбласть("ЗаголовокДата|КолонкиЛево"); 
		ОбластьДатаОплаты.Параметры.Дата = Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
		ПолеОтчета.Вывести(ОбластьДатаОплаты, 1);
		
		Дата_П = СтрокаОплаты.ДатаОплаты;
		
		ИтогиДень.СуммаОплаты = 0;
		ИтогиДень.СуммаНаличные = 0;
		ИтогиДень.СуммаКарта = 0;
		ИтогиДень.СуммаЭквайринга = 0;

		ИтогиДень.СуммаОплатыЗатраты = 0;
		ИтогиДень.СуммаОплатыНераспределено = 0;
	КонецЕсли;
	
	ОбластьСтрокаОплаты = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево"); 
	ОбластьСтрокаОплаты.Параметры.Дата = Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	ДокументОплатыПредставление = "Кассовый документ " + СтрокаОплаты.ДокументОплаты.Номер + " от " + Формат(СтрокаОплаты.ДокументОплаты.Дата, "ДФ=dd.MM.yy");
	ОбластьСтрокаОплаты.Параметры.ДокументОплаты = ДокументОплатыПредставление;
	ОбластьСтрокаОплаты.Параметры.ДокументОплатыРасшифровка = СтрокаОплаты.ДокументОплаты;
	
	ОбластьСтрокаОплаты.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);

	ОбластьСтрокаОплаты.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	ОбластьСтрокаОплаты.Параметры.НомерСменыККМ = СтрокаОплаты.НомерСменыККМ;
	
	ОбластьСтрокаОплаты.Параметры.СуммаОплаты = СтрокаОплаты.СуммаОплаты;
	ОбластьСтрокаОплаты.Параметры.СуммаКарта = СтрокаОплаты.СуммаКарта;
	ОбластьСтрокаОплаты.Параметры.СуммаНаличные = СтрокаОплаты.СуммаНаличные;
	ОбластьСтрокаОплаты.Параметры.СуммаВозврат = СтрокаОплаты.СуммаВозврат;
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
	ОбластьСтрокаОплаты.Параметры.СуммаЭквайринга = СуммаЭквайринга;
	
	ВыведеннаяОласть = ПолеОтчета.Вывести(ОбластьСтрокаОплаты, 2);
	
	ИтогиДеньДобавить(ИтогиДень, СтрокаОплаты.СуммаОплаты, СтрокаОплаты.СуммаНаличные, СтрокаОплаты.СуммаКарта, СуммаЭквайринга
		, 0, 0);
	
//
	ЗапросПроживание = Новый Запрос("ВЫБРАТЬ
	                                |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Заявка,
	                                |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
	                                |	ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
	                                |	ЗаявкаНаБронированиеПроживание.Цена КАК Цена,
	                                |	ЗаявкаНаБронированиеПроживание.Количество КАК Количество,
	                                |	ЗаявкаНаБронированиеПроживание.Сумма КАК Сумма,
	                                |	ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидки,
	                                |	ЗаявкаНаБронированиеПроживание.ПроцентСкидкиКлиента КАК ПроцентСкидкиКлиента
	                                |ИЗ
	                                |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                                |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
	                                |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
	                                |ГДЕ
	                                |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
	                                |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = &ДокументОплаты
	                                |
	                                |УПОРЯДОЧИТЬ ПО
	                                |	Заявка,
	                                |	ДеньПроживания");

	ЗапросПроживание.УстановитьПараметр("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
	ТЗ_Проживание = ЗапросПроживание.Выполнить().Выгрузить();
	
	СуммаИтогоДокументОплатыЗатрат = 0;
	Для Каждого СтрокаПроживание Из ТЗ_Проживание Цикл
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ЗаявкаПредставление = " " + СтрокаПроживание.Заявка.НомерВРезерв + " / ";
		ЗаявкаПредставление = ЗаявкаПредставление + 
			"Заявка " + СтрокаПроживание.Заявка.Номер + " от " + Формат(СтрокаПроживание.Заявка.Дата, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатраты = ЗаявкаПредставление;
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатратыРасшифровка = СтрокаПроживание.Заявка;
		
		ОбластьСтрокаЗатраты.Параметры.ДатаЗатрат = Формат(СтрокаПроживание.ДеньПроживания, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = "Проживание";
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СтрокаПроживание.СуммаОплаты;
		
		ОбластьСтрокаЗатраты.Параметры.СуммаЗатрат = СтрокаПроживание.Сумма;
	
		ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
	КонецЦикла;
	
	СуммаИтогоДокументОплатыЗатрат = СуммаИтогоДокументОплатыЗатрат + ТЗ_Проживание.Итог("СуммаОплаты");
//

//
	ЗапросУслуги = Новый Запрос("ВЫБРАТЬ
	                            |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Заявка,
	                            |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
	                            |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
	                            |	ЗаявкаНаБронированиеДопУслуги.Цена КАК Цена,
	                            |	ЗаявкаНаБронированиеДопУслуги.Количество КАК Количество,
	                            |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
	                            |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК Сумма
	                            |ИЗ
	                            |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
	                            |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
	                            |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
	                            |ГДЕ
	                            |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
	                            |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = &ДокументОплаты
	                            |	И ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	Заявка");

	ЗапросУслуги.УстановитьПараметр("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
	ТЗ_Услуги = ЗапросУслуги.Выполнить().Выгрузить();
	
	Для Каждого СтрокаУслуги Из ТЗ_Услуги Цикл
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ЗаявкаПредставление = " " + СтрокаУслуги.Заявка.НомерВРезерв + " / ";
		ЗаявкаПредставление = ЗаявкаПредставление + 
			"Заявка " + СтрокаУслуги.Заявка.Номер + " от " + Формат(СтрокаУслуги.Заявка.Дата, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатраты = ЗаявкаПредставление;
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатратыРасшифровка = СтрокаУслуги.Заявка;
		
		ОбластьСтрокаЗатраты.Параметры.ДатаЗатрат = Формат(СтрокаУслуги.ДатаУслуги, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = СтрокаУслуги.Услуга;
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СтрокаУслуги.СуммаОплаты;
		
		ОбластьСтрокаЗатраты.Параметры.СуммаЗатрат = СтрокаУслуги.Сумма;
	
		ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
	КонецЦикла;

	СуммаИтогоДокументОплатыЗатрат = СуммаИтогоДокументОплатыЗатрат + ТЗ_Услуги.Итог("СуммаОплаты");
//
	
//
	ЗапросКоворкинг = Новый Запрос("ВЫБРАТЬ
	                               |	КоворкингСчетаДокументыОплаты.Ссылка КАК Ссылка,
	                               |	КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
	                               |	КоворкингСчетаДокументыОплаты.СуммаРаспределено КАК СуммаРаспределено,
	                               |	КоворкингСчетаДокументыОплаты.Ссылка.Сумма КАК СуммаЗатрат
	                               |ИЗ
	                               |	Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
	                               |ГДЕ
	                               |	КоворкингСчетаДокументыОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
	                               |	И КоворкингСчетаДокументыОплаты.ДокументОплаты = &ДокументОплаты");

	ЗапросКоворкинг.УстановитьПараметр("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
	ТЗ_Коворкинг = ЗапросКоворкинг.Выполнить().Выгрузить();
	
	Для Каждого СтрокаКоворкинг Из ТЗ_Коворкинг Цикл
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ДокументЗатратыПредставление = "Коворкинг " + СтрокаКоворкинг.Ссылка.Номер + " от " + Формат(СтрокаКоворкинг.Ссылка.Дата, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатраты = ДокументЗатратыПредставление;
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатратыРасшифровка = СтрокаКоворкинг.Ссылка;
		
		//ОбластьСтрокаЗатраты.Параметры.ДатаЗатрат = Формат(СтрокаУслуги.ДатаУслуги, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = "Коворкинг";
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СтрокаКоворкинг.СуммаРаспределено;
		
		ОбластьСтрокаЗатраты.Параметры.СуммаЗатрат = СтрокаКоворкинг.СуммаЗатрат;
	
		ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
	КонецЦикла;

	СуммаИтогоДокументОплатыЗатрат = СуммаИтогоДокументОплатыЗатрат + ТЗ_Коворкинг.Итог("СуммаРаспределено");
	
//
	ЗапросУслугиКоворкинг = Новый Запрос("ВЫБРАТЬ
	                                     |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка КАК Счет,
	                                     |	КоворкингСчетаРаспределениеОплатКоворкинг.СуммаОплаты КАК СуммаОплаты,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК Услуга,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.Цена КАК Цена,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.Количество КАК Количество,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.Сумма КАК Сумма
	                                     |ИЗ
	                                     |	Документ.КоворкингСчета.РаспределениеОплатКоворкинг КАК КоворкингСчетаРаспределениеОплатКоворкинг
	                                     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
	                                     |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка = КоворкингСчетаДопУслугиКоворкинг.Ссылка
	                                     |			И КоворкингСчетаРаспределениеОплатКоворкинг.ГУИДДолги = КоворкингСчетаДопУслугиКоворкинг.ГУИД
	                                     |ГДЕ
	                                     |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка.ПометкаУдаления = ЛОЖЬ
	                                     |	И КоворкингСчетаРаспределениеОплатКоворкинг.ЭтоУслуга = ИСТИНА
	                                     |	И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты = &ДокументОплаты
	                                     |
	                                     |УПОРЯДОЧИТЬ ПО
	                                     |	Счет");

	ЗапросУслугиКоворкинг.УстановитьПараметр("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
	ТЗ_УслугиКоворкинг = ЗапросУслугиКоворкинг.Выполнить().Выгрузить();
	
	Для Каждого СтрокаУслуги Из ТЗ_УслугиКоворкинг Цикл
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ДокументЗатраты = " " + СтрокаУслуги.Счет.КоворкингЗаявка.КоворкингНомер + " / ";
		ДокументЗатраты = ДокументЗатраты + 
			"Счет " + СтрокаУслуги.Счет.Номер + " от " + Формат(СтрокаУслуги.Счет.Дата, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатраты = ДокументЗатраты;
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатратыРасшифровка = СтрокаУслуги.Счет;
		
		ОбластьСтрокаЗатраты.Параметры.ДатаЗатрат = Формат(СтрокаУслуги.ДатаУслуги, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = СтрокаУслуги.Услуга;
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СтрокаУслуги.СуммаОплаты;
		
		ОбластьСтрокаЗатраты.Параметры.СуммаЗатрат = СтрокаУслуги.Сумма;
	
		ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
	КонецЦикла;

	СуммаИтогоДокументОплатыЗатрат = СуммаИтогоДокументОплатыЗатрат + ТЗ_Услуги.Итог("СуммаОплаты");
	//СуммаНеРаспределено = СтрокаОплаты.СуммаОплаты - СуммаИтогоДокументОплатыЗатрат;
	Если СтрокаОплаты.Приход Тогда
		СуммаНеРаспределено = СтрокаОплаты.СуммаОплаты - СтрокаОплаты.СуммаВозврат - СуммаИтогоДокументОплатыЗатрат;
	Иначе
		СуммаНеРаспределено = 0;
	КонецЕсли;
	
	Если СуммаНеРаспределено <> 0 Тогда 
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = "Не распределено";
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СуммаНеРаспределено;
		
		ВыведеннаяОбласть = ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
		Для Индекс = 0 По КоличествоКолонок - 1 Цикл 
			ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).Шрифт 
			 //= Новый Шрифт(ОбластьОформления.Шрифт, ОбластьОформления.Шрифт.Размер, ,Истина);
			 	= Новый Шрифт("Arial", 8, ,Истина);
			ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).ЦветТекста = Новый Цвет(255, 0, 0);
		КонецЦикла;

	КонецЕсли;
	
	ИтогиДеньДобавить(ИтогиДень, 0, 0, 0, 0
		, СуммаИтогоДокументОплатыЗатрат, СуммаНеРаспределено);
КонецЦикла;

Если Дата_П <> '00010101' Тогда
	ИтогиДеньОплатыВывод(ПолеОтчета, Макет, ИтогиДень, Дата_П);						
КонецЕсли;	

Возврат ПолеОтчета;
КонецФункции

Процедура ИтогиДеньОплатыВывод(ПолеОтчета, Макет, ИтогиДень, Дата_П)
Область = Макет.ПолучитьОбласть("ИтогиДеньОплаты|КолонкиЛево");

Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
Область.Параметры.Дата = Дата;		

Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
Область.Параметры.СуммаНаличные = ИтогиДень.СуммаНаличные;
Область.Параметры.СуммаКарта = ИтогиДень.СуммаКарта;
Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
ПолеОтчета.Вывести(Область, 1);

Если ИтогиДень.СуммаОплатыЗатраты <> 0 Тогда
	Область = Макет.ПолучитьОбласть("ИтогиДеньЗатраты|КолонкиЛево");
	Область.Параметры.ТипЗатрат = "Затраты";
	Область.Параметры.СуммаОплатыЗатраты = ИтогиДень.СуммаОплатыЗатраты;
	ПолеОтчета.Вывести(Область, 1);
КонецЕсли;

Если ИтогиДень.СуммаОплатыНераспределено <> 0 Тогда
	Область = Макет.ПолучитьОбласть("ИтогиДеньЗатраты|КолонкиЛево");
	Область.Параметры.ТипЗатрат = "Не распределено";
	Область.Параметры.СуммаОплатыЗатраты = ИтогиДень.СуммаОплатыНераспределено;
	ВыведеннаяОбласть = ПолеОтчета.Вывести(Область, 1);

	КоличествоКолонок = Область.ШиринаТаблицы;
	Для Индекс = 0 По КоличествоКолонок - 1 Цикл 
		ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).Шрифт 
		 //= Новый Шрифт(ОбластьОформления.Шрифт, ОбластьОформления.Шрифт.Размер, ,Истина);
		 	= Новый Шрифт("Arial", 8, ,Истина);
		ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЦикла;
КонецЕсли;
КонецПроцедуры

Процедура ИтогиДеньДобавить(ИтогиДень, СуммаОплаты, СуммаНаличные, СуммаКарта, СуммаЭквайринга
		, СуммаОплатыЗатраты, СуммаОплатыНераспределено)

ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
ИтогиДень.СуммаНаличные = ИтогиДень.СуммаНаличные + СуммаНаличные ;
ИтогиДень.СуммаКарта = ИтогиДень.СуммаКарта + СуммаКарта ;
ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;

ИтогиДень.СуммаОплатыЗатраты = ИтогиДень.СуммаОплатыЗатраты + СуммаОплатыЗатраты;
ИтогиДень.СуммаОплатыНераспределено = ИтогиДень.СуммаОплатыНераспределено  + СуммаОплатыНераспределено ;
КонецПроцедуры
////


// +++++++++++++++++++++++++++++++++++++++++++++++++++



