&НаКлиенте
Перем MSWord, ДокументWord;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ИмяФайла", ИмяФайла);
Параметры.Свойство("ПолноеИмяФайла", ПолноеИмяФайла);
Параметры.Свойство("ДокументДолгСсылка", ДокументДолгСсылка);
Параметры.Свойство("СчетГУИД", СчетГУИД);

//Если НЕ ЗначениеЗаполнено(СчетГУИД) Тогда
//	Отказ = Истина;
//	Возврат;
//КонецЕсли;
	
ЭтоРеноме = НастройкиСервер.ЭтоРеноме();

ЗаполнитьДанныеБрони();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБрони()
Если ТипЗнч(ДокументДолгСсылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	Если ЭтоРеноме Тогда		
		ЗаполнитьДанныеБрониЗаявкаРеноме(ДокументДолгСсылка, СчетГУИД);
	Иначе
		ЗаполнитьДанныеБрониЗаявка(ДокументДолгСсылка, СчетГУИД);
	КонецЕсли;	
ИначеЕсли ТипЗнч(ДокументДолгСсылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда	
	Если ЭтоРеноме Тогда		
		ЗаполнитьДанныеБрониГрупповойСчетРеноме(ДокументДолгСсылка);
	Иначе
		ЗаполнитьДанныеБрониГрупповойСчет(ДокументДолгСсылка);
	КонецЕсли;	
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБрониЗаявка(ДокументДолгСсылка, СчетГУИД)
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
Счета = ДокументДолгСсылка.Счета.НайтиСтроки(ОтборСтроки);
Если Счета.Количество() = 0 Тогда Возврат; КонецЕсли;
Счет = Счета[0];

Результат = ПечатьСервер.ДокументТелоСтроки(ДокументДолгСсылка, Счет, Ложь);	
ТЗСтроки = Результат.ТЗСтроки;

Для Каждого Строка Из ТЗСтроки Цикл
	Нов = ДанныеБрони.Добавить();

	Нов.Бронь = ДокументДолгСсылка;

	//Нов.ЭтоУслуга = Строка.ЭтоУслуга;
	Нов.Клиент = Строка.Клиент;

	//Нов.Наименование = Строка.НаименованиеТовара;
	
	Нов.РезервС = Формат(Строка.ДатаС, "ДФ=dd.MM.yy");
	Нов.РезервПо = Формат(Строка.ДатаПо + 86400, "ДФ=dd.MM.yy");

	Нов.КолвоЧеловек = ДокументДолгСсылка.КолВоЧеловек;
	//Нов.Категория = ДокументДолгСсылка.КатегорияНомера.Наименование;

	Нов.КолвоНочей = Строка.Количество;

	Нов.СТ = Строка.Цена;	

	//Нов.ОСТ = Строка.СуммаСНДС;
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБрониЗаявкаРеноме(ДокументДолгСсылка, СчетГУИД)
	
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
Счета = ДокументДолгСсылка.Счета.НайтиСтроки(ОтборСтроки);
Если Счета.Количество() = 0 Тогда Возврат; КонецЕсли;
Счет = Счета[0];

Результат = ПечатьСервер.ДокументТелоСтроки(ДокументДолгСсылка, Счет, Ложь);	

ТЗСтроки = Результат.ТЗСтроки;

Для Каждого Строка Из ТЗСтроки Цикл
	Нов = ДанныеБрониРеноме.Добавить();

	Нов.Бронь = ДокументДолгСсылка;

	Нов.ЭтоУслуга = Строка.ЭтоУслуга;
	Нов.Клиент = Строка.Клиент;

	Нов.Наименование = Строка.НаименованиеТовара;
	
	Нов.РезервС = Формат(Строка.ДатаС, "ДФ=dd.MM.yy");
	Нов.РезервПо = Формат(Строка.ДатаПо + 86400, "ДФ=dd.MM.yy");

	Нов.КолвоЧеловек = ДокументДолгСсылка.КолВоЧеловек;
	Нов.Категория = ДокументДолгСсылка.КатегорияНомера.Наименование;

	Нов.КолвоНочей = Строка.Количество;

	Нов.Количество = Строка.Количество; 
	
	Нов.СТ = Строка.Цена;	

	Нов.ОСТ = Строка.СуммаСНДС;
КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБрониГрупповойСчет(ГрупповойСчетОбъект)
Счетчик = 0; СуммаДляПечатиОбщая = 0; СуммаДляПечатиОбщаяНДС = 0; ЕстьНДС0 = Ложь; ЕстьНДСНе0 = Ложь;	
	
ГрупповойСчетТелоСтроки = ПечатьСервер.ГрупповойСчетТелоСтроки(Счетчик, СуммаДляПечатиОбщая, СуммаДляПечатиОбщаяНДС
	, ЕстьНДС0, ЕстьНДСНе0
	, ГрупповойСчетОбъект);	
	
Для Каждого Строка Из ГрупповойСчетТелоСтроки Цикл
	Нов = ДанныеБрониРеноме.Добавить();

	Нов.Бронь = Строка.Бронь;

	Нов.ЭтоУслуга = Строка.ЭтоУслуга;
	Нов.Клиент = Строка.Клиент;

	Нов.Наименование = Строка.НаименованиеТовара;
	
	Нов.РезервС = Формат(Строка.ДатаС, "ДФ=dd.MM.yy");
	Нов.РезервПо = Формат(Строка.ДатаПо + 86400, "ДФ=dd.MM.yy");

	Нов.КолвоЧеловек = Строка.КолВоЧеловек;
	Нов.Категория = Строка.Категория;

	Нов.КолвоНочей = Строка.Количество;

	Нов.Количество = Строка.Количество; 
	
	Нов.СТ = Строка.Цена;	

	Нов.ОСТ = Строка.СуммаСНДС;
КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБрониГрупповойСчетРеноме(ГрупповойСчетОбъект)
Счетчик = 0; СуммаДляПечатиОбщая = 0; СуммаДляПечатиОбщаяНДС = 0; ЕстьНДС0 = Ложь; ЕстьНДСНе0 = Ложь;	
	
ГрупповойСчетТелоСтроки = ПечатьСервер.ГрупповойСчетТелоСтроки(Счетчик, СуммаДляПечатиОбщая, СуммаДляПечатиОбщаяНДС
	, ЕстьНДС0, ЕстьНДСНе0
	, ГрупповойСчетОбъект);	
	
Для Каждого Строка Из ГрупповойСчетТелоСтроки Цикл
	Нов = ДанныеБрониРеноме.Добавить();

	Нов.Бронь = Строка.Бронь;

	Нов.ЭтоУслуга = Строка.ЭтоУслуга;
	Нов.Клиент = Строка.Клиент;

	Нов.Наименование = Строка.НаименованиеТовара;
	
	Нов.РезервС = Формат(Строка.ДатаС, "ДФ=dd.MM.yy");
	//Нов.РезервПо = Формат(Строка.ДатаПо + 86400, "ДФ=dd.MM.yy");
	Нов.РезервПо = Формат(Строка.ДатаПо, "ДФ=dd.MM.yy");

	Нов.КолвоЧеловек = Строка.КолВоЧеловек;
	Нов.Категория = Строка.Категория;

	Нов.КолвоНочей = Строка.Количество;

	Нов.Количество = Строка.Количество; 
	
	Нов.СТ = Строка.Цена;	

	Нов.ОСТ = Строка.СуммаСНДС;
КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Запустить() Экспорт
Результат = ФормированиеПодтвержденияWORD(Ложь);

Если Результат.Ошибка Тогда
	Закрыть(Результат);
Иначе
	Закрыть();
КонецЕсли;	
Конецпроцедуры

&НаКлиенте
Функция ФормированиеПодтвержденияWORD(НаАнглийском)
Результат = Новый Структура("Ошибка, ТекстОшибки, ОписаниеОшибки", Ложь, "", "");

ФайлНаДиске = Новый Файл(ПолноеИмяФайла);
Если ФайлНаДиске.Существует() Тогда
	Попытка
		УдалитьФайлы(ПолноеИмяФайла);	
	Исключение
		Результат.Ошибка = Истина;
		Результат.ТекстОшибки = "Ошибка удаления 'старого' файла подтверждения ";
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат Результат; 
	КонецПопытки;		
КонецЕсли;	

//МойДокументВДвоичныхДанных = ПолучитьМакетПодтверждениеВДвоичныхДанных(НаАнглийском);
//МойДокументВДвоичныхДанных.Записать(ПолноеИмяФайла);

Ответ = СкопироватьОбразецПодтверждение(ПолноеИмяФайла, НаАнглийском);
Если Ответ.Ошибка Тогда
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка копирования шаблона файла подтверждения ";
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
	
	Возврат Результат;
КонецЕсли;

Индикатор = 15;
ОбновитьОтображениеДанных();

Попытка 
	MSWord = Новый COMОбъект("Word.Application");
Исключение
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка создания COMОбъекта Word.Application";
	Результат.ОписаниеОшибки = ОписаниеОшибки();
	
	Возврат Результат;
КонецПопытки;

MSWord.DisplayAlerts = Истина;

MSWord.Visible = Истина;
//MSWord.ScreenUpdating = Истина;

Попытка 
	//Revert = True;
	//OpenConflictDocument = True;
	//OpenAndRepair = True;
	//Документ = MSWord.Documents.Open(ПолноеИмяФайла 
	//	, , , , , , Revert, , , , , , OpenConflictDocument, OpenAndRepair);
	////, , , , , , Revert, , , , , Visible, OpenConflictDocument, OpenAndRepair, DocumentDirection, NoEncodingDialog);
	
	Документ = MSWord.Documents.Open(ПолноеИмяФайла); 
	//Документ = MSWord.Documents.OpenNoRepairDialog(ПолноеИмяФайла); 
Исключение
	
	Результат.Ошибка = Истина;
	
	Результат.ТекстОшибки = "Ошибка открытия подтверждения";
	Результат.ОписаниеОшибки = ОписаниеОшибки();
	
	Попытка
		MSWord.DisplayAlerts = Истина;
		
		wdDoNotSaveChanges = 0;
		MSWord.Quit(wdDoNotSaveChanges);
		MSWord = Неопределено;
	Исключение
		//Результат.Ошибка = Истина;
		//
		//Результат.ТекстОшибки = "Ошибка закрытия WORD после неудачного открытия подтвержения.";
		//Результат.ОписаниеОшибки = ОписаниеОшибки();
		//Возврат Результат;
	КонецПопытки;
	
	Возврат Результат;
КонецПопытки;

MSWord.DisplayAlerts = Ложь;

//MSWord.ScreenUpdating = False;
MSWord.Visible = Ложь;

//Документ.Activate();

Индикатор = 20;
ОбновитьОтображениеДанных();

Попытка 
	Table = Документ.Tables(1);
	Row1 = Table.Rows(2);
	
	Индикатор = 25;
	ОбновитьОтображениеДанных();

	Если ЭтоРеноме Тогда
		ДанныеБрони_П = ДанныеБрониРеноме;
	Иначе
		ДанныеБрони_П = ДанныеБрони;
	КонецЕсли;
	
	Для Индекс = 1 По ДанныеБрони_П.Количество() Цикл
		СтрНом = ДанныеБрони_П[Индекс - 1];
		
		Если Индекс > 1 Тогда
			Row1.Range.Copy();
			wdFormatOriginalFormatting = 16;
			Row1.Range.PasteAndFormat (wdFormatOriginalFormatting);
		КонецЕсли;
		
		Row = Документ.Tables(1).Rows(Индекс + 1);
		//ФормированиеСтрокиПодтверждения(Row, СтрНом);
		Если ЭтоРеноме Тогда
			ФормированиеСтрокиПодтвержденияРеноме(Row, СтрНом);
		Иначе
			ФормированиеСтрокиПодтверждения(Row, СтрНом);
		КонецЕсли;
		
		Индикатор = 25 + 0.7 * (Индекс * 100 / ДанныеБрони_П.Количество()) ;
		ОбновитьОтображениеДанных();
	КонецЦикла;

	ИтогоСумма = 0;
	Для Каждого Строка Из ДанныеБрони_П Цикл
		ИтогоСумма = ИтогоСумма + Строка.ОСТ
	КонецЦикла;
	Row = Документ.Tables(1).Rows(Индекс + 1);
	Текст = Строка(ИтогоСумма);
	Row.Cells(2).Range.Text = Текст;  
	
	//ш = ш /0;
Исключение
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка заполнения подтверждения";
	Результат.ОписаниеОшибки = ОписаниеОшибки();

	Попытка
		MSWord.DisplayAlerts = Истина;
		
		MSWord.Visible = Истина;
		//MSWord.ScreenUpdating = Истина;
	
		wdDoNotSaveChanges = 0;
		MSWord.Quit(wdDoNotSaveChanges);
		MSWord = Неопределено;
	Исключение
		//Результат.Ошибка = Истина;
		//
		//Результат.ТекстОшибки = "Ошибка закрытия WORD после неудачного заполнения подтвержения.";
		//Результат.ОписаниеОшибки = ОписаниеОшибки();
		//Возврат Результат;
	КонецПопытки;

	Возврат Результат;
КонецПопытки;

MSWord.ScreenUpdating = True;
MSWord.Visible = Истина;
MSWord.DisplayAlerts = Истина;

//Документ.SaveAs2(ПолноеИмяФайла);
Документ.Save();

wdDoNotSaveChanges = 0;
wdSaveChanges =	-1;
Документ.Close(wdSaveChanges);

Индикатор = 100;
ОбновитьОтображениеДанных();

Попытка
	MSWord.DisplayAlerts = Истина;
	
	wdDoNotSaveChanges = 0;
	MSWord.Quit(wdDoNotSaveChanges);
	MSWord = Неопределено;
Исключение
	Результат.Ошибка = Истина;
	Результат.ТекстОшибки = "Ошибка закрытия подтверждения";
	Результат.ОписаниеОшибки = ОписаниеОшибки();
	
	Возврат Результат;
КонецПопытки;

Возврат Результат;
КонецФункции

&НаКлиенте
Функция ФормированиеСтрокиПодтверждения(Row, СтрНом)  
	//Row.Cells(1).Range.Text = "<ФИО" + НомерСтроки + ">";
	//Текст = ПолучитьФИО(СтрНом.Бронь);
	Текст = СтрНом.Клиент;
	//Row.Cells(1).Range.Text = Текст;
	Row.Cells(1).Select();
	MsWord.Selection.Text = Текст;
	
	//Row.Cells(3).Range.Text = "<ДТ" + НомерСтроки + ">";
	Текст = Строка(СтрНом.РезервС);
	//Row.Cells(3).Range.Text = Текст;
	Row.Cells(3).Select();
	MsWord.Selection.Text = Текст;
	
	//Row.Cells(4).Range.Text = "<К" + НомерСтроки + ">";
	Текст = Строка(СтрНом.Колво);
	//Row.Cells(4).Range.Text = Текст;
	Row.Cells(4).Select();
	MsWord.Selection.Text = Текст;
	
	//Row.Cells(5).Range.Text = "<ДТВ" + НомерСтроки + ">";
	Текст = Строка(СтрНом.РезервПо);
	//Row.Cells(5).Range.Text = Текст;
	Row.Cells(5).Select();
	MsWord.Selection.Text = Текст;
	
	//Row.Cells(6).Range.Text = "<СТ" + НомерСтроки + ">";
	Текст = Строка(СтрНом.СТ);
	//Row.Cells(6).Range.Text = Текст;
	Row.Cells(6).Select();
	MsWord.Selection.Text = Текст;

	//Row.Cells(7).Range.Text = "<СТО" + НомерСтроки + ">";
	Текст = Строка(СтрНом.Колво * СтрНом.СТ);
	//Row.Cells(7).Range.Text = Текст;
	Row.Cells(7).Select();
	MsWord.Selection.Text = Текст;
КонецФункции

&НаКлиенте
Функция ФормированиеСтрокиПодтвержденияРеноме(Row, СтрНом)
Если СтрНом.ЭтоУслуга Тогда
	Текст = СтрНом.Наименование;
	//Row.Cells(1).Range.Text = Текст;
	Row.Cells(1).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = "";
	Row.Cells(2).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = "";
	Row.Cells(3).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = Строка(СтрНом.РезервС);
	Row.Cells(4).Select();
	MsWord.Selection.Text = Текст;

	Текст = Строка(СтрНом.Количество);
	Row.Cells(5).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = "";
	Row.Cells(6).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = Строка(СтрНом.СТ);
	Row.Cells(7).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = Строка(СтрНом.ОСТ);
	Row.Cells(8).Select();
	MsWord.Selection.Text = Текст;
	
Иначе
	
	//Текст = ПолучитьФИОРеноме(СтрНом.Бронь);
	Текст = СтрНом.Клиент;
	//Row.Cells(1).Range.Text = Текст;
	Row.Cells(1).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = Строка(СтрНом.Категория);
	Row.Cells(2).Select();
	MsWord.Selection.Text = Текст;

	Текст = Строка(СтрНом.КолвоЧеловек);
	Row.Cells(3).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = Строка(СтрНом.РезервС);
	Row.Cells(4).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = Строка(СтрНом.КолвоНочей);
	Row.Cells(5).Select();
	MsWord.Selection.Text = Текст;

	Текст = Строка(СтрНом.РезервПо);
	Row.Cells(6).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = Строка(СтрНом.СТ);
	Row.Cells(7).Select();
	MsWord.Selection.Text = Текст;
	
	Текст = Строка(СтрНом.ОСТ);
	Row.Cells(8).Select();
	MsWord.Selection.Text = Текст;
КонецЕсли;
КонецФункции

&НаСервере
Функция СкопироватьОбразецПодтверждение(ФайлПолучатель, НаАнглийском)
Результат = Новый Структура("Ошибка, ОписаниеОшибки", Ложь, "");	
	
ИмяОрганизации = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
КаталогОбразец = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
КаталогОбразец = КаталогОбразец + "ОбразцыДокументов\";

Если НаАнглийском тогда
	ПолноеИмяОбразца = КаталогОбразец + "НовоеПодтверждение_А_" + ИмяОрганизации;	
иначе
	ПолноеИмяОбразца =  КаталогОбразец + "НовоеПодтверждение_" + ИмяОрганизации; 
конецесли;

ПолноеИмяОбразца = ПолноеИмяОбразца + ".doc";

Попытка 
	КопироватьФайл(ПолноеИмяОбразца, ФайлПолучатель);
Исключение
	Результат.Ошибка = Истина;
	Результат.ОписаниеОшибки = ОписаниеОшибки();
	
	Возврат Результат;
КонецПопытки;

Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьМакетПодтверждениеВДвоичныхДанных(НаАнглийском)
	ИмяМакета = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
	Если НаАнглийском тогда
		ИмяМакета = "НовоеПодтверждение_А_" + ИмяМакета;	
		//Макет = ПолучитьМакетНаСервере(ИмяМакета);	
			
	иначе
		ИмяМакета = "НовоеПодтверждение_" + ИмяМакета; 
		//Макет = ПолучитьМакетНаСервере(ИмяМакета);		
	конецесли;
	Макет = Документы.ПодтверждениеБронирования.ПолучитьМакет(ИмяМакета);	
	
	//Получим путь во временной директории для сохранения туда файла
	ИмяВрем = ПолучитьИмяВременногоФайла(".doc");

	Макет.Записать(ИмяВрем);
	МойДокументВДвоичныхДанных = Новый ДвоичныеДанные(ИмяВрем);

	Возврат МойДокументВДвоичныхДанных;
КонецФункции
	
&НаСервере
Функция ПолучитьФИО(Бронь)
ФИО = Бронь.Клиент.Наименование +"(" + Бронь.КатегорияНомера.Наименование+")";	
Возврат ФИО;
КонецФункции	

&НаСервере
Функция ПолучитьФИОРеноме(Бронь)
ФИО = Бронь.Клиент.Наименование;	
Возврат ФИО;
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
Если MsWord = Неопределено Тогда Возврат; КонецЕсли;

Попытка
	wdDoNotSaveChanges = 0;
	wdSaveChanges =	-1;
	MSWord.Quit(wdDoNotSaveChanges); 
Исключение
	Сообщить(ОписаниеОшибки());
КонецПопытки;

MsWord = Неопределено;
КонецПроцедуры

// +++++++++++++++++++++++++++++++++++




