

// Создаёт новое Cоединение c PayKeeper
//
// Параметры:
//	Адрес - Строка - Адрес личного кабинета PayKeeper, например: renomme-hotel.server.paykeeper.ru
//	ИмяПользователя - Строка - Имя пользователя личного кабинета, например: admin
//	ПарольПользователя - Строка - Пароль пользователя личного кабинета, например: puPW0Mag2QmMXk7w
Функция СоздатьСоединение(Знач Адрес, Знач ИмяПользователя, Знач ПарольПользователя) Экспорт
	Попытка
		ПроверитьПараметр("PayKeeper.СоздатьСоединениеPayKeeper", "Адрес", Адрес, Тип("Строка")); 
		ПроверитьПараметр("PayKeeper.СоздатьСоединениеPayKeeper", "ИмяПользователя", ИмяПользователя, Тип("Строка")); 
		ПроверитьПараметр("PayKeeper.СоздатьСоединениеPayKeeper", "ПарольПользователя", ПарольПользователя, Тип("Строка")); 
//		СоединениеHTTP = Новый HTTPСоединение(АдресЛК, , ИмяПользователяЛК, ПарольПользователяЛК, , , Новый ЗащищенноеСоединениеOpenSSL);
		Параметры = Новый Структура("Адрес,ИмяПользователя,ПарольПользователя", 
									 Адрес,ИмяПользователя,ПарольПользователя);
		Возврат Новый Структура("Параметры,Токен,Ошибка,Описание", Параметры, Новый Структура("Идентификатор,ВремяИстечения", Неопределено, Неопределено), Ложь, "");
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// Создаёт новый платёж в кабинете PayKeeper, возвращает его идентификатор, QR код и адрес ссылки на QR код
//		Возвращает структуру с полями: ИдПлатежа, ДанныеКартинкиBase64, АдресКартинки, Ошибка = Ложь, Описание  = ""
//		В случае ошибки, возвращает структуру: Ошибка = Истина, Описание = "Описание ошибки"
//
// 	Пример отображения картинки на форме (где QR - реквизит формы типа ПолеКартинки) 
//      ДвоичныеДанныеКартинки = Base64Значение(ДанныеКартинкиBase64);
//		Картинка = Новый Картинка(ДвоичныеДанныеКартинки);
//		QR =  ПоместитьВоВременноеХранилище(Картинка); 
//
// Параметры:
//	Соединение - Структура - Соединение с личным кабинетом PayKeeper
//	ДанныеКартинкиBase64 - Строка - Возвращаемые данные JPEG картинки QR кода, закодированные BASE64; 
//	АдресКартинки - Строка - Возвращаемый URL картинки QR кода, размещённой на сайте СБП
//	Плательщик - Строка - Наименование плательщика: Иванов Иван Иванович
//	НомерСчёта - Строка - Номер счёта организации получателя
//	НаименованиеУслуги - Строка - Наименование или тип оплачиваемой услуги, например: проживание
//	СуммаПлатежа - Число - Сумма в рублях с дробной частью, например: 10.53
//	EmailОтсылкиЧека - Строка - (Необязательный) Адрес почты для отсылки чека, например: berezinan@gmail.com
//	ТелефонОтсылкиСМСУведомления - Строка - (Необязательный) Номер телефона для отсылки уведомления, например: +79221881555
Функция ПолучитьQRКод(Знач Соединение, Знач Плательщик, Знач НомерСчёта, Знач НаименованиеУслуги, Знач СуммаПлатежа = Неопределено, Знач EmailОтсылкиЧека = Неопределено, Знач ТелефонОтсылкиСМСУведомления = Неопределено, Знач Позиции = Неопределено)  Экспорт	
	Перем ОбъектJSON, Сообщ, ИдПлатежа, Картинка, АдресКартинки, ДанныеКартинкиBase64;
	
	Попытка
		ПроверитьПараметр("PayKeeper.ПолучитьQRКод", "Соединение", Соединение, Тип("Структура")); 
		ПроверитьПараметр("PayKeeper.ПолучитьQRКод", "Плательщик", Плательщик, Тип("Строка")); 
		ПроверитьПараметр("PayKeeper.ПолучитьQRКод", "НомерСчёта", НомерСчёта, Тип("Строка")); 
		ПроверитьПараметр("PayKeeper.ПолучитьQRКод", "НаименованиеУслуги", НаименованиеУслуги, Тип("Строка")); 
		//ПроверитьПараметр("PayKeeper.ПолучитьQRКод", "СуммаПлатежа", СуммаПлатежа, Тип("Число")); 
		Если ЗначениеЗаполнено(EmailОтсылкиЧека) Тогда 
			ПроверитьПараметр("PayKeeper.ПолучитьQRКод", "EmailОтсылкиЧека", EmailОтсылкиЧека, Тип("Строка"),, "^[a-zA-Z0-9.!#$%&’*+/=?^_`{|}~-]+@[a-zA-Z0-9-]+(?:\.[a-zA-Z0-9-]+)*$"); 
		КонецЕсли;
		Если ЗначениеЗаполнено(ТелефонОтсылкиСМСУведомления) Тогда 
			ПроверитьПараметр("PayKeeper.ПолучитьQRКод", "ТелефонОтсылкиСМСУведомления", ТелефонОтсылкиСМСУведомления, Тип("Строка")); 
		КонецЕсли;		
		
		_Позиции = Новый Массив();
		Если ЗначениеЗаполнено(Позиции) Тогда
			_Сумма = 0; 
			Если ТипЗнч(Позиции) <> Тип("Массив") Тогда
				ВызватьИсключение "Параметр Позиции не является массивом"; 
			КонецЕсли;  
			Для Каждого Поз Из Позиции Цикл
				Если ТипЗнч(Поз) <> Тип("Структура") Тогда
					ВызватьИсключение "Позиция не является структурой"; 
				КонецЕсли;
				_Поз = Новый Структура("item_type,payment_type,name,price,quantity,sum,tax", "service", "prepay", Неопределено, 0, 1, 0, "none");
				
				Если Не Поз.Свойство("name") Или Не ЗначениеЗаполнено(Поз.name) Тогда
					ВызватьИсключение "Не задано имя (name) позиции услуги/товара"; 
				КонецЕсли;
				_Поз.name = Строка(Поз.name);
				
				Если Поз.Свойство("quantity") И ЗначениеЗаполнено(Поз.quantity) Тогда
					Если ТипЗнч(Поз.quantity) <> Тип("Число") Тогда
						ВызватьИсключение "Количество (quantity) позиции " + _Поз.name + " не является числом:" + Строка(Поз.quantity); 
					КонецЕсли;
					_Поз.quantity = Поз.quantity;	
				КонецЕсли; 
				
				Если Поз.Свойство("price") И  ЗначениеЗаполнено(Поз.price) Тогда
					Если ТипЗнч(Поз.price) <> Тип("Число") Тогда
						ВызватьИсключение "Цена (price) позиции " + _Поз.name + " не является числом:" + Строка(Поз.price); 
					КонецЕсли;
					_Поз.price = Поз.price;
					Если Не Поз.Свойство("sum") Или Не ЗначениеЗаполнено(Поз.sum) Тогда
						_Поз.sum = _Поз.price * _Поз.quantity;
					КонецЕсли;
				КонецЕсли;
				Если Поз.Свойство("sum") И ЗначениеЗаполнено(Поз.sum) Тогда
					Если ТипЗнч(Поз.sum) <> Тип("Число") Тогда
						ВызватьИсключение "Сумма (sum) позиции " + _Поз.name + " не является числом:" + Строка(Поз.sum); 
					КонецЕсли;
					_Поз.sum = Поз.sum;
					Если _Поз.price = 0 Тогда
						_Поз.price = _Поз.sum / _Поз.quantity;
					ИначеЕсли _Поз.sum <> _Поз.price * _Поз.quantity Тогда
						ВызватьИсключение "Сумма (sum) позиции " + _Поз.name + " не соответствует произведению количества и цены" + Строка(_Поз.price * _Поз.quantity); 	
					КонецЕсли;
				КонецЕсли;
				Если _Поз.sum = 0 Или _Поз.price = 0 Тогда
					ВызватьИсключение "Для позиции " + _Поз.name + " не заданы ни сумма ни цена"; 
				КонецЕсли;
			    _Сумма = _Сумма + _Поз.sum;
				
				Если Поз.Свойство("item_type") И ЗначениеЗаполнено(Поз.item_type) Тогда 
					Если СтрНайти("service|goods", Поз.item_type) = 0 Тогда
						ВызватьИсключение "Для позиции " + _Поз.name + " тип позиции (item_type) имеет неверное значение";
					КонецЕсли;
					_Поз.item_type = Поз.item_type;
				КонецЕсли;
				
				Если Поз.Свойство("payment_type") И ЗначениеЗаполнено(Поз.payment_type) Тогда 
					Если СтрНайти("prepay|advance|full", Поз.payment_type) = 0 Тогда
						ВызватьИсключение "Для позиции " + _Поз.name + " тип платежа (payment_type) имеет неверное значение";
					КонецЕсли;
					_Поз.payment_type = Поз.payment_type;
				КонецЕсли;

				Если Поз.Свойство("tax") И ЗначениеЗаполнено(Поз.tax) Тогда 
					Если СтрНайти("none|vat0|vat5|vat20|vat22", Поз.tax) = 0 Тогда
						ВызватьИсключение "Для позиции " + _Поз.name + " НДС (tax) имеет неверное значение";
					КонецЕсли;
					_Поз.tax = Поз.tax;
				КонецЕсли;
				_Позиции.Добавить(_Поз);
			КонецЦикла;
			Если ЗначениеЗаполнено(СуммаПлатежа) И СуммаПлатежа <> _Сумма Тогда
				ВызватьИсключение "Сумма платежа " + Строка(СуммаПлатежа) + " не соответствует сумме позиций: " + Строка(_Сумма); 
			Иначе 
				СуммаПлатежа = _Сумма;
			КонецЕсли;	
		КонецЕсли;
		
		ОбновитьТокен(Соединение);
		
		ОбъектJSON = ВыполнитьЗапросИзПолучитьQRКод(Соединение, "/create/",
			"&sum=" + СтрЗаменить(Строка(СуммаПлатежа), Символы.НПП, "") + 							
			"&clientid=" + Плательщик +        		
			"&orderid=" + НомерСчёта +                                                             
			"&service_name=" + НаименованиеУслуги +            
			?(ЗначениеЗаполнено(EmailОтсылкиЧека), "&client_email=" + EmailОтсылкиЧека, "") +     	
			?(ЗначениеЗаполнено(ТелефонОтсылкиСМСУведомления), "&client_phone=" + ТелефонОтсылкиСМСУведомления, "")  +              		
			"&pstype=" + "sbp_default" +                     			
			"&json=" + "true" +
			?(ЗначениеЗаполнено(Позиции), "&cart=" + ПерекодироватьСтроку(ПолучитьСтрокуJSON(_Позиции)), ""));
			
		Если ТипЗнч(ОбъектJSON) = Тип("Строка") Тогда 
			Возврат Новый Структура("Ошибка, Описание", Истина, ОбъектJSON);				
		КонецЕсли;
		
		Если Не ОбъектJSON.Свойство("payment_id", ИдПлатежа) 
			Или Не ОбъектJSON.Свойство("qr_code", Картинка) 
			Или Не ОбъектJSON.Свойство("qr_link", АдресКартинки) Тогда 
			Сообщ = "";
			ОбъектJSON.Свойство("msg", Сообщ);
			ВызватьИсключение Сообщ;
		КонецЕсли;
		ДанныеКартинкиBase64 = Сред(Картинка, 23);
		//ИдПлатежа, ДанныеКартинкиBase64, АдресКартинки
		Возврат Новый Структура("ИдПлатежа,ДанныеКартинкиBase64,АдресКартинки,Ошибка,Описание", ОбъектJSON.payment_id, ДанныеКартинкиBase64, ОбъектJSON.qr_link, Ложь, "");
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

// Возвращает структуру с реквизитами:
//		СтатусПлатежа = "success"|"failed"|"canceled"|"refunding"|"partially_refunded"|"refunded", Ошибка = Ложь, Описание = ""
//    		где:
//         	"success" - успешно принят
//             "failed" - неудачный платёж
//             "canceled" - платеж отменён
//             "refunding" - в процессе возврата денег на карту клиента
//             "partially_refunded" - частично возвращен на карту клиента
//             "refunded" - полностью возвращен на карту клиента
//		В случае ошибки, возвращает структуру: Ошибка = Истина, Описание = "Описание ошибки"
//
// Параметры:
//	Соединение - Структура - Соединение с личным кабинетом PayKeeper
//	ИдПлатежа - Строка - Идентификатор платежа в системе PayKeeper 
Функция ПолучитьСтатусПлатежа(Знач Соединение, Знач ИдПлатежа) Экспорт
	Перем ОбъектJSON, Сообщ;
	Попытка
		ОбновитьТокен(Соединение);
		
		ПроверитьПараметр("PayKeeper.ПолучитьСтатусПлатежа", "Соединение", Соединение, Тип("Структура")); 
		ПроверитьПараметр("PayKeeper.ПолучитьСтатусПлатежа", "ИдПлатежа", ИдПлатежа, Тип("Строка") ,, ".+"); 
		
		ОбъектJSON = ВыполнитьЗапрос(Соединение,  "/info/payments/byid/?id="+ИдПлатежа);
		
		СтатусПлатежа = ОбъектJSON[0].status;
		
		Возврат Новый Структура("СтатусПлатежа,ДанныеПлатежа,Ошибка,Описание", СтатусПлатежа, ОбъектJSON[0], Ложь, "");
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// Получает список платежных систем, настроенных для paykeeper
// Возвращает структуру с реквизитами: 
//      СписокПлатежныхСистем, Ошибка = Ложь, Описание = ""
//		В случае ошибки, возвращает структуру: Ошибка = Истина, Описание = "Описание ошибки"
//
// СписокПлатежныхСистем - массив структур с реквизитами:
//		id - Строка - Идентификатор платежной системы в PayKeeper
//		site_description - Строка
//		system_description - Строка - Наименование в PayKeeper
// Платежные системы, подключенные к аккаунту Реноме:
// 	52 - ВТБ, 93 - Райффайзен, 127 - Тестовая
//
// Параметры:
//	Соединение - Структура - Соединение с личным кабинетом PayKeeper
Функция ПолучитьСписокПлатежныхСистем(Знач Соединение) Экспорт
	Перем ОбъектJSON, Сообщ;
	Попытка
		ОбновитьТокен(Соединение);
		
		ПроверитьПараметр("PayKeeper.ПолучитьСтатусПлатежа", "Соединение", Соединение, Тип("Структура")); 
		
		ОбъектJSON = ВыполнитьЗапрос(Соединение,  "/info/systems/list/");
		
		Возврат Новый Структура("СписокПлатежныхСистем,Ошибка,Описание", ОбъектJSON, Ложь, "");
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// Получает список платежей
// В случае успешного выполнения возвращает структуру с реквизитами:
// 	СписокПлатежей, Ошибка = "Ложь", Описание = ""
//		В случае ошибки, возвращает структуру: Ошибка = Истина, Описание = "Описание ошибки"
//
// СписокПлатежей - массив структур с реквизитами:
//		id - Строка - Идентификатор платежа в системе PayKeeper "1079"
//		clientid - Строка - ФИО клиента, заданный при создании платежа
//		obtain_datetime - Строка - дата-время создания платежа  "2023-08-02 17:02:09"
// 	orderid - Строка - номер счёта, переданный при создании платежа
//     pay_amount - Строка - сумма платежа
//     payment_system_id - Строка - ид платежной системы
//		pending_datetime - Строка - дата-время ожидания платежа  "2023-08-02 17:02:09"
//     repeat_counter - Строка - число попыток совершения платежа
//     status - Строка - статус платежа:  "success"|"failed"|"canceled"|"refunding"|"partially_refunded"|"refunded"
//		success_datetime - Строка - дата-время успешного завершения платежа  "2023-08-02 17:02:09"
//		unique_id - Строка - Уникальный идентификатор платежа в системе PayKeeper  "436133627"
//
// Параметры:
//	Соединение - Структура - Соединение с личным кабинетом PayKeeper
//		ДатаНач - Дата - Начало периода, если не задано = "01.01.2016"
//     ДатаКон - Дата - КонецПериода, если не задано = текущая дата
//		НачСтрока - Число - Начальная строка выборки данных, если не задано = 0
//     СтрокМакс - Число - Максимальное число строк в выборке, если не задано = 100
//		СписокСтатусов - Строка - Перечисление статусов, для отбора строк по значениям статусов, если не задано = "success,canceled,failed,refunding,partially_refunded,refunded"
//		СписокПлатежныхСистем - Строка - Перечисление идентификаторов платежных систем, если не задано = "93,52" (в других отелях могут быть другие иды, но Райффайзен 93 везде)
Функция ПолучитьСписокПлатежей(Знач Соединение, Знач ДатаНач = Неопределено, ДатаКон = Неопределено, Знач НачСтрока = 0, Знач СтрокМакс = 100, Знач СписокСтатусов = "success,canceled,failed,refunding,partially_refunded,refunded", Знач СписокПлатежныхСистем = "93,52") Экспорт
	Перем ОбъектJSON, Сообщ;
	Попытка
		ОбновитьТокен(Соединение);
		
		ПроверитьПараметр("PayKeeper.ПолучитьСтатусПлатежа", "Соединение", Соединение, Тип("Структура")); 
		Если Не ЗначениеЗаполнено(ДатаНач) Тогда
			ДатаНач = Дата(2016, 01, 01);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ДатаКон) Тогда
			ДатаКон = ТекущаяДата();
		КонецЕсли;
		
		ОбъектJSON = ВыполнитьЗапрос(Соединение,  
			"/info/payments/bydate/?"+
				"limit="+	Строка(СтрокМакс)+
				"&from="+Строка(НачСтрока)+
				"&start="+Формат(ДатаНач, "ДФ=yyyy-MM-dd")+
				"&end="+Формат(ДатаКон, "ДФ=yyyy-MM-dd")+
				РазвернутьВСтроку(СтрРазделить(СписокСтатусов, ",", Ложь), "&status[]=")+
				РазвернутьВСтроку(СтрРазделить(СписокПлатежныхСистем, ",", Ложь), "&payment_system_id[]="));
		
		Возврат Новый Структура("СписокПлатежей,Ошибка,Описание", ОбъектJSON, Ложь, "");
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// Возвращает средства клиенту, при заданной сумме, возвращает указанную сумму, если она не превышает сумму платежа, за вычетом возвращенной суммы,
// когда сумма платежа не указана (неопределена), возвращается оставшаяся, не возвращенная сумма, если уже были возвраты по платежу, и полная сумма, если возвратов не было.
// Возвращает структуру с реквизитами: 
//    	Ошибка = Ложь, Описание = ""
//	В случае ошибки, возвращает структуру: 
//		Ошибка = Истина, Описание = "Описание ошибки"
//
// Параметры:
//	Соединение - Структура - Соединение с личным кабинетом PayKeeper
//	ИдПлатежа - Строка - Идентификатор платежа
//	Сумма - Число - Возвращаемая сумма, если не задано = ПолнаяСуммаПлатежа - ВозвращеннаяСумма
Функция ВозвратДенег(Знач Соединение, Знач ИдПлатежа, Знач Сумма = Неопределено) Экспорт
	Перем ОбъектJSON, Сообщ;
	Попытка
		ОбновитьТокен(Соединение);
		
		ПроверитьПараметр("PayKeeper.ПолучитьСтатусПлатежа", "Соединение", Соединение, Тип("Структура")); 
		ПроверитьПараметр("PayKeeper.ПолучитьСтатусПлатежа", "ИдПлатежа", ИдПлатежа, Тип("Строка") ,, ".+"); 
		
		ОбъектJSON = ВыполнитьЗапрос(Соединение,  "/info/payments/byid/?id="+ИдПлатежа);
		
		ЧастичноВозвращен = Ложь;
		Если ОбъектJSON[0].status = "success" Тогда
		ИначеЕсли ОбъектJSON[0].status = "partially_refunded" Тогда	
			ЧастичноВозвращен = Истина;
		ИначеЕсли ОбъектJSON[0].status = "refunded" Тогда	
			ВызватьИсключение "Платеж уже был полностью возвращен";
		Иначе
			ВызватьИсключение "Неверный статус платежа " + ОбъектJSON[0].status;
		КонецЕсли;
		
		ПолученнаяСуммаСтр = ОбъектJSON[0].pay_amount;
		ПолученнаяСумма = ?(ЗначениеЗаполнено(ПолученнаяСуммаСтр), Число(ПолученнаяСуммаСтр), 0.0);
		Если ПолученнаяСумма <= 0.0 Тогда
			ВызватьИсключение "Некорректная сумма платежа в данных платежа paykeeper";
		КонецЕсли;
		
		ВозвращеннаяСуммаСтр = 0.0;
		Если ЧастичноВозвращен Тогда
			ВозвращеннаяСуммаСтр = ОбъектJSON[0].refund_amount;
			ВозвращеннаяСумма = ?(ЗначениеЗаполнено(ВозвращеннаяСуммаСтр), Число(ВозвращеннаяСуммаСтр), 0.0);
			Если ВозвращеннаяСумма < 0.0 Тогда
				ВызватьИсключение "Некорректная возвращенная сумма в данных платежа paykeeper";
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Сумма) Тогда
			Сумма = ПолученнаяСумма - ВозвращеннаяСумма;
		ИначеЕсли Сумма > ПолученнаяСумма - ВозвращеннаяСумма Тогда
			ВызватьИсключение "Указанная к возврату сумма больше суммы платежа за исключением уже возвращенных средств";
		КонецЕсли;
		
		ПолныйВозврат = ?(Сумма = ПолученнаяСумма, Истина, Ложь);
		
		ОбъектJSON = ВыполнитьЗапрос(Соединение,  "/change/payment/reverse/", "" + 
			"&id="+Строка(ИдПлатежа)+
			"&amount="+Строка(Сумма)+
			"&partial="+?(ПолныйВозврат,"false","true")
			);
			
		Если ОбъектJSON.result = "success" Тогда
			Возврат Новый Структура("Ошибка,Описание", Ложь, "");
		ИначеЕсли ОбъектJSON.result = "fail" Тогда
			Возврат Новый Структура("Ошибка,Описание", Истина, ОбъектJSON.msg);
		Иначе	
			Возврат Новый Структура("Ошибка,Описание", Истина, "Неопознанная ошибка");
		КонецЕсли;
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

Функция ПолучитьСтрокуJSON(Объект)
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Объект);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

// Вызывает исключение, если тип значения параметра ИмяПараметра процедуры или функции ИмяПроцедурыИлиФункции
// отличается от ожидаемого.
// Для быстрой диагностики типов параметров, передаваемых в процедуры и функции программного интерфейса.
//
// В связи с особенностью реализации ОписанияТипов всегда включает в себя тип <Неопределено>.
// если требуется жесткая проверка типа, используйте в параметре ОжидаемыеТипы 
// конкретный тип, массив или соответствие типов.
//
// Параметры:
//   ИмяПроцедурыИлиФункции - Строка - имя процедуры или функции, параметр которой проверяется.
//   ИмяПараметра - Строка - имя проверяемого параметра процедуры или функции.
//   ЗначениеПараметра - Произвольный - фактическое значение параметра.
//   ОжидаемыеТипы - ОписаниеТипов, Тип, Массив, ФиксированныйМассив, Соответствие, ФиксированноеСоответствие - тип(ы)
//       параметра процедуры или функции.
//   ОжидаемыеТипыСвойств - Структура - если ожидаемый тип - структура, то 
//       в этом параметре можно указать типы ее свойств.
//
Процедура ПроверитьПараметр(Знач ИмяПроцедурыИлиФункции, Знач ИмяПараметра, Знач ЗначениеПараметра, 
	Знач ОжидаемыеТипы, Знач ОжидаемыеТипыСвойств = Неопределено, Знач ОжидаемыйШаблон = Неопределено) Экспорт 
	
	Контекст = "ОбщегоНазначенияКлиентСервер.ПроверитьПараметр";
	
	Проверить(
		ТипЗнч(ИмяПроцедурыИлиФункции) = Тип("Строка"), 
		НСтр("ru = 'Недопустимое значение параметра ИмяПроцедурыИлиФункции'"), 
		Контекст);
	
	Проверить(
		ТипЗнч(ИмяПараметра) = Тип("Строка"), 
		НСтр("ru = 'Недопустимое значение параметра ИмяПараметра'"), 
		Контекст);
	
	ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеПараметра, ОжидаемыеТипы);
	
	Проверить(
		ЭтоКорректныйТип <> Неопределено, 
		НСтр("ru = 'Недопустимое значение параметра ОжидаемыеТипы'"), 
		Контекст);
	
	Проверить(
		ЭтоКорректныйТип,
		ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2. 
			           |Ожидалось: %3; передано значение: %4 (тип %5).'"),
			ИмяПараметра,
			ИмяПроцедурыИлиФункции,
			ПредставлениеТипов(ОжидаемыеТипы), 
			?(ЗначениеПараметра <> Неопределено, 
				ЗначениеПараметра, 
				НСтр("ru = 'Неопределено'")),
		ТипЗнч(ЗначениеПараметра)));
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") И ОжидаемыйШаблон <> Неопределено Тогда
		RegExp = Новый COMОбъект("VBScript.RegExp");
		RegExp.Pattern = Строка(ОжидаемыйШаблон);
		Если Не RegExp.Test(ЗначениеПараметра) Тогда
			ТекстИсключения = ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недопустимое значение параметра %1 в %2. 
			           |Ожидалось строка, соответствующая шаблону: %3; передано значение: %4.'"),
				ИмяПараметра,
				ИмяПроцедурыИлиФункции,
				Строка(ОжидаемыйШаблон), 
				ЗначениеПараметра);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		RegExp = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") И ОжидаемыеТипыСвойств <> Неопределено Тогда
		
		Проверить(
			ТипЗнч(ОжидаемыеТипыСвойств) = Тип("Структура"), 
			НСтр("ru = 'Недопустимое значение параметра ИмяПроцедурыИлиФункции'"), 
			Контекст);
		
		Для каждого Свойство Из ОжидаемыеТипыСвойств Цикл
			
			ОжидаемоеИмяСвойства = Свойство.Ключ;
			ОжидаемыйТипСвойства = Свойство.Значение;
			ЗначениеСвойства = Неопределено;
			
			Проверить(
				ЗначениеПараметра.Свойство(ОжидаемоеИмяСвойства, ЗначениеСвойства), 
				ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимое значение параметра %1 (Структура) в %2. 
					           |В структуре ожидалось свойство %3 (тип %4).'"), 
					ИмяПараметра, 
					ИмяПроцедурыИлиФункции, 
					ОжидаемоеИмяСвойства, 
					ОжидаемыйТипСвойства));
			
			ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеСвойства, ОжидаемыйТипСвойства);
			
			Проверить(
				ЭтоКорректныйТип, 
				ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимое значение свойства %1 в параметре %2 (Структура) в %3. 
					           |Ожидалось: %4; передано значение: %5 (тип %6).'"), 
					ОжидаемоеИмяСвойства,
					ИмяПараметра,
					ИмяПроцедурыИлиФункции,
					ПредставлениеТипов(ОжидаемыеТипы), 
					?(ЗначениеСвойства <> Неопределено, 
						ЗначениеСвойства, 
						НСтр("ru = 'Неопределено'")),
				ТипЗнч(ЗначениеСвойства)));
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   Условие - Булево - если не равно Истина, то вызывается исключение.
//   КонтекстПроверки - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//   Сообщение - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по умолчанию.
//
Процедура Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "")
	
	Если Условие <> Истина Тогда
		
		Если ПустаяСтрока(Сообщение) Тогда
			ТекстИсключения = НСтр("ru = 'Недопустимая операция'"); // Assertion failed
		Иначе
			ТекстИсключения = Сообщение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(КонтекстПроверки) Тогда
			ТекстИсключения = ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 в %2'"), 
				ТекстИсключения, 
				КонтекстПроверки);
		КонецЕсли;
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеОжидаемогоТипа(Значение, ОжидаемыеТипы)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗнч(ОжидаемыеТипы) = Тип("ОписаниеТипов") Тогда
		
		Возврат ОжидаемыеТипы.СодержитТип(ТипЗначения);
		
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Тип") Тогда
		
		Возврат ТипЗначения = ОжидаемыеТипы;
		
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Массив") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив") Тогда
		
		Возврат ОжидаемыеТипы.Найти(ТипЗначения) <> Неопределено;
		
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		
		Возврат ОжидаемыеТипы.Получить(ТипЗначения) <> Неопределено;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеТипов(ОжидаемыеТипы)
	
	Если ТипЗнч(ОжидаемыеТипы) = Тип("Массив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		
		Результат = "";
		Индекс = 0;
		Для Каждого Элемент Из ОжидаемыеТипы Цикл
			
			Если ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
				Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда 
				
				Тип = Элемент.Ключ;
			Иначе 
				Тип = Элемент;
			КонецЕсли;
			
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + ", ";
			КонецЕсли;
			
			Результат = Результат + ПредставлениеТипа(Тип);
			Индекс = Индекс + 1;
			Если Индекс > 10 Тогда
				Результат = ПодставитьПараметрыВСтроку(
					НСтр("ru='%1,... (всего %2 типов)'"), 
					Результат, 
					ОжидаемыеТипы.Количество());
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Результат;
		
	Иначе 
		Возврат ПредставлениеТипа(ОжидаемыеТипы);
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеТипа(Тип)
	
	Если Тип = Неопределено Тогда
		
		Возврат "Неопределено";
		
	ИначеЕсли ТипЗнч(Тип) = Тип("ОписаниеТипов") Тогда
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				ПодставитьПараметрыВСтроку(
					НСтр("ru='%1,... (всего %2 типов)'"),
					Лев(ТипСтрокой, 150),
					Тип.Типы().Количество()), 
				ТипСтрокой);
		
	Иначе
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				Лев(ТипСтрокой, 150) + "...", 
				ТипСтрокой);
		
	КонецЕсли;
	
КонецФункции

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  ШаблонСтроки  - Строка - шаблон строки с параметрами (вхождениями вида "%<номер параметра>", 
//                           например "%1 пошел в %2");
//  Параметр<n>   - Строка - значение подставляемого параметра.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел
//  в Зоопарк".
//
Функция ПодставитьПараметрыВСтроку(Знач ШаблонСтроки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) 
	
	ЕстьПараметрыСПроцентом = СтрНайти(Параметр1, "%")
		Или СтрНайти(Параметр2, "%")
		Или СтрНайти(Параметр3, "%")
		Или СтрНайти(Параметр4, "%")
		Или СтрНайти(Параметр5, "%")
		Или СтрНайти(Параметр6, "%")
		Или СтрНайти(Параметр7, "%")
		Или СтрНайти(Параметр8, "%")
		Или СтрНайти(Параметр9, "%");
		
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат ПодставитьПараметрыСПроцентом(ШаблонСтроки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	КонецЕсли;
	
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%2", Параметр2);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%3", Параметр3);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%4", Параметр4);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%5", Параметр5);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%6", Параметр6);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%7", Параметр7);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%8", Параметр8);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%9", Параметр9);
	Возврат ШаблонСтроки;
	
КонецФункции

Функция РазвернутьВСтроку(Массив, Префикс = "")
	Рез = "";
	Для Каждого Элемент Из Массив Цикл
		Рез = Рез + Префикс + Строка(Элемент);
	КонецЦикла;
	Возврат Рез;
КонецФункции

// Вставляет параметры в строку, учитывая, что в параметрах могут использоваться подстановочные слова %1, %2 и т.д.
Функция ПодставитьПараметрыСПроцентом(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = СтрНайти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = Неопределено;
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр = Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр = Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр = Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр = Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр = Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр = Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр = Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр = Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр = Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = Неопределено Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = СтрНайти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
КонецФункции


Функция ВыполнитьЗапросИзПолучитьQRКод(Соединение, Путь, ТелоЗапроса = Неопределено)
	HTTP = Новый HTTPСоединение(
									Соединение.Параметры.Адрес, 
									443, 
									Соединение.Параметры.ИмяПользователя, 
									Соединение.Параметры.ПарольПользователя,
									, , Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	ЗапросHTTP = Новый HTTPЗапрос(Путь, Заголовки);
	Если ТелоЗапроса <> Неопределено Тогда
		Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		ЗапросHTTP.УстановитьТелоИзСтроки("token=" + Соединение.Токен.Идентификатор + ТелоЗапроса);
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса);
		ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP);
	Иначе	
		ОтветHTTP = HTTP.Получить(ЗапросHTTP);
	КонецЕсли;
	ЧтениеJSON = Новый ЧтениеJSON();
	Тело = ОтветHTTP.ПолучитьТелоКакСтроку();
	
	Если СтрНайти(Тело, "Система заблокирована. Требуется продление хостинга.") > 0 Тогда
		Возврат "Система заблокирована. Требуется продление хостинга.";
	ИначеЕсли СтрНайти(Тело, "<!DOCTYPE html>") > 0 Тогда
		Поз = СтрНайти(Тело, "<p>") + 3;
		Возврат Сред(Тело, Поз, СтрНайти(Тело, ".", , Поз) - Поз);
	КонецЕсли;
	
	ЧтениеJSON.УстановитьСтроку(Тело);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	HTTP = Неопределено;
	Возврат Результат;
КонецФункции

Функция ВыполнитьЗапрос(Соединение, Путь, ТелоЗапроса = Неопределено, БезТокена = Ложь)
	HTTP = Новый HTTPСоединение(
									Соединение.Параметры.Адрес, 
									443, 
									Соединение.Параметры.ИмяПользователя, 
									Соединение.Параметры.ПарольПользователя,
									, , Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	ЗапросHTTP = Новый HTTPЗапрос(Путь, Заголовки);
	Если ТелоЗапроса <> Неопределено Тогда
		Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		Если Не БезТокена Тогда
			ЗапросHTTP.УстановитьТелоИзСтроки("token=" + Соединение.Токен.Идентификатор + ТелоЗапроса);
		Иначе
			ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса);
		КонецЕсли;
		ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP);
	Иначе	
		ОтветHTTP = HTTP.Получить(ЗапросHTTP);
	КонецЕсли;                  
	Результат = ОтветHTTP.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Результат);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	HTTP = Неопределено;
	Возврат Результат;
КонецФункции

Процедура ОбновитьТокен(Соединение)
	Если Соединение.Токен.Идентификатор = Неопределено ИЛИ Соединение.Токен.ВремяИстечения < ТекущаяДата() Тогда
		ОбъектJSON = ВыполнитьЗапрос(Соединение,  "/info/settings/token/");
		Токен = "";
		Если Не ОбъектJSON.Свойство("token", Токен) Тогда 
			Сообщ = "";
			ОбъектJSON.Свойство("msg", Сообщ);
			ВызватьИсключение "Ошибка получения токена PayKeeper: " + Сообщ;
		КонецЕсли;
		Соединение.Токен.Идентификатор = Токен;
		Соединение.Токен.ВремяИстечения = ТекущаяДата() + 1200;
	КонецЕсли;
КонецПроцедуры        

Функция ПерекодироватьСтроку(СтрокаКодирования, Кодировка = "UTF-8") экспорт
    
    ТекстДляПерекодирования = Новый ТекстовыйДокумент;        
    ТекстДляПерекодирования.УстановитьТипФайла(Кодировка);
    ТекстДляПерекодирования.УстановитьТекст(СтрокаКодирования);
    
    Возврат ТекстДляПерекодирования.ПолучитьТекст();

КонецФункции 

