
Функция ВызватьФункциюИлиПроцедуру(ИмяФункцииИлиПроцедуры, ЭтоФункция, Параметры = Неопределено, Форма = Неопределено, ИмяОбработчикаЗавершения = Неопределено, ИмяОбработчикаХодаВыполнения = Неопределено, Контекст = Неопределено, АвтоотменаЧерез = Неопределено) Экспорт
	
	Перем ПериодичностьПроверкиСостоянийАсинхронныхВызовов, ИдентификаторВызова, АсинхронныйВызов;
	
	ПериодичностьПроверкиСостоянийАсинхронныхВызовов = 1;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Массив;		
	КонецЕсли;
	
	Если НезавершенныеАсинхронныеВызовы = Неопределено Тогда
		НезавершенныеАсинхронныеВызовы = Новый Соответствие;
	КонецЕсли;		
	
	ИдентификаторВызова = АсинхронныеВызовыСервер.ВызватьФункциюИлиПроцедуру(ИмяФункцииИлиПроцедуры, ЭтоФункция, Параметры);
		
	АсинхронныйВызов = Новый Структура;
	АсинхронныйВызов.Вставить("Идентификатор", ИдентификаторВызова);
	АсинхронныйВызов.Вставить("ИмяФункцииИлиПроцедуры", ИмяФункцииИлиПроцедуры);
	АсинхронныйВызов.Вставить("ЭтоФункция", ЭтоФункция);
	АсинхронныйВызов.Вставить("Параметры", Параметры);
	АсинхронныйВызов.Вставить("Форма", Форма);
	АсинхронныйВызов.Вставить("ИмяОбработчикаЗавершения", ИмяОбработчикаЗавершения);
	АсинхронныйВызов.Вставить("ИмяОбработчикаХодаВыполнения", ИмяОбработчикаХодаВыполнения);
	АсинхронныйВызов.Вставить("АвтоотменаЧерез", АвтоотменаЧерез);
	АсинхронныйВызов.Вставить("НачатВ", ТекущаяУниверсальнаяДатаВМиллисекундах());
	АсинхронныйВызов.Вставить("Контекст", Контекст);
	АсинхронныйВызов.Вставить("Состояние", "Активен");
	Если ЭтоФункция Тогда
		АсинхронныйВызов.Вставить("ВозвращенноеЗначение", Неопределено);
	КонецЕсли;
	АсинхронныйВызов.Вставить("ЗначениеХодаВыполнения", Неопределено);
	АсинхронныйВызов.Вставить("СообщенияХодаВыполнения", Новый Массив());
	АсинхронныйВызов.Вставить("ОписаниеОшибки", Неопределено);
	
	НезавершенныеАсинхронныеВызовы.Вставить(ИдентификаторВызова, АсинхронныйВызов);
	
	ПодключитьОбработчикОжидания("ОбработчикПроверкиСостоянийАсинхронныхВызовов", ПериодичностьПроверкиСостоянийАсинхронныхВызовов);
	
	Возврат АсинхронныйВызов;	
	
КонецФункции

Процедура Отменить(АсинхронныйВызовИлиМассив) Экспорт
	
	Перем ИдентификаторыВызовов, МассивАсинхронныеВызовы;
	
	ИдентификаторыВызовов = ПолучитьИдентификаторыВызовов(АсинхронныйВызовИлиМассив);
	АсинхронныеВызовыСервер.Отменить(ИдентификаторыВызовов);	
	
КонецПроцедуры

Процедура ОтменитьВсе() Экспорт
	
	Отменить(ПолучитьИдентификаторыНезавершенныхВызовов());	
	
КонецПроцедуры

Процедура ПроверитьСостоянияВызовов() Экспорт
	
	Перем ИдентификаторыВызовов, АсинхронныйВызовКлючЗначение, СостоянияВызовов, ИдентификаторВызова, СВ, АВ, ДлительностьВызова;
	
	ИдентификаторыВызовов = Новый Массив;
	Для Каждого АсинхронныйВызовКлючЗначение Из НезавершенныеАсинхронныеВызовы Цикл
		ИдентификаторыВызовов.Добавить(АсинхронныйВызовКлючЗначение.Ключ);	
	КонецЦикла;
	
	СостоянияВызовов = АсинхронныеВызовыСервер.ПолучитьСостоянияВызовов(ИдентификаторыВызовов);
	
	Для Каждого СостояниеВызоваКлючЗначение Из СостоянияВызовов Цикл
		
		ИдентификаторВызова = СостояниеВызоваКлючЗначение.Ключ;
		СВ = СостояниеВызоваКлючЗначение.Значение; //СостояниеВызова
		АВ = НезавершенныеАсинхронныеВызовы.Получить(ИдентификаторВызова); //АсинхронныйВызов
		
		//Обновляем состояние асинхронного вызова
		АВ.Состояние = СВ.Состояние;
		Если АВ.ЭтоФункция Тогда
			АВ.ВозвращенноеЗначение = СВ.ВозвращенноеЗначение;
		КонецЕсли;
		Если СВ.ЗначениеХодаВыполнения <> Неопределено Тогда
			АВ.ЗначениеХодаВыполнения = СВ.ЗначениеХодаВыполнения;
		КонецЕсли;
		Для Каждого СообщениеХодаВыполнения Из СВ.СообщенияХодаВыполнения Цикл
			АВ.СообщенияХодаВыполнения.Добавить(СообщениеХодаВыполнения);	
		КонецЦикла;
		АВ.ОписаниеОшибки = СВ.ОписаниеОшибки;
		
		//Обработчик хода выполнения
		Если АВ.Форма <> Неопределено И ЗначениеЗаполнено(АВ.ИмяОбработчикаХодаВыполнения) И (СВ.ЗначениеХодаВыполнения <> Неопределено Или СВ.СообщенияХодаВыполнения.Количество() > 0) Тогда
			Выполнить("АВ.Форма." + АВ.ИмяОбработчикаХодаВыполнения + "(АВ, АВ.ЗначениеХодаВыполнения, СВ.СообщенияХодаВыполнения);");								
		КонецЕсли;
				
		Если СВ.Состояние <> "Активен" Тогда
			НезавершенныеАсинхронныеВызовы.Удалить(ИдентификаторВызова);
			Если АВ.Форма <> Неопределено И ЗначениеЗаполнено(АВ.ИмяОбработчикаЗавершения) Тогда
				Выполнить("АВ.Форма." + АВ.ИмяОбработчикаЗавершения + "(АВ, АВ.Состояние," + ?(АВ.ЭтоФункция, "АВ.ВозвращенноеЗначение, ", " ") + "АВ.ОписаниеОшибки);");
			КонецЕсли;
		Иначе //Активен			                              			
			Если ЗначениеЗаполнено(АВ.АвтоотменаЧерез) Тогда //Автоотмена
				ДлительностьВызова = (ТекущаяУниверсальнаяДатаВМиллисекундах() - АВ.НачатВ) / 1000;
				Если АВ.АвтоотменаЧерез < ДлительностьВызова Тогда
					Отменить(АВ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
		
	Если НезавершенныеАсинхронныеВызовы.Количество() = 0 Тогда
		ОтключитьОбработчикОжидания("ОбработчикПроверкиСостоянийАсинхронныхВызовов");		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьИдентификаторыНезавершенныхВызовов()
	
	Перем ИдентификаторыВызовов;
	
	ИдентификаторыВызовов = Новый Массив;
	
	Для Каждого АсинхронныйВызовКлючЗначение Из НезавершенныеАсинхронныеВызовы Цикл
		ИдентификаторыВызовов.Добавить(АсинхронныйВызовКлючЗначение.Ключ);		
	КонецЦикла;
	
	Возврат ИдентификаторыВызовов;
	
КонецФункции

Функция ПолучитьИдентификаторыВызовов(АсинхронныйВызовИлиМассив)
	
	Перем ИдентификаторыВызовов, МассивАсинхронныеВызовы;
	
	ИдентификаторыВызовов = Новый Массив;
	
	Если ТипЗнч(АсинхронныйВызовИлиМассив) = Тип("Массив") Тогда
		МассивАсинхронныеВызовы = АсинхронныйВызовИлиМассив;
	Иначе
		МассивАсинхронныеВызовы = Новый Массив;
		МассивАсинхронныеВызовы.Добавить(АсинхронныйВызовИлиМассив);
	КонецЕсли;
	
	Для Каждого АсинхронныйВызов Из МассивАсинхронныеВызовы Цикл
		Если ТипЗнч(АсинхронныйВызов) = Тип("Структура") Тогда
			ИдентификаторыВызовов.Добавить(АсинхронныйВызов.Идентификатор);
		ИначеЕсли ТипЗнч(АсинхронныйВызов) = Тип("УникальныйИдентификатор") Тогда
			ИдентификаторыВызовов.Добавить(АсинхронныйВызов);
		ИначеЕсли ТипЗнч(АсинхронныйВызов) = Тип("Строка") Тогда
			ИдентификаторыВызовов.Добавить(Новый УникальныйИдентификатор(АсинхронныйВызов));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИдентификаторыВызовов;
	
КонецФункции

