
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если Параметры = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли;	

ЭтаФорма.ТолькоПросмотр = Истина;
	
Если Параметры.Свойство("Турагентство") Тогда 
	Турагентство = Параметры.Турагентство;
Иначе	
	Отказ = Истина; Возврат; 
КонецЕсли;		

Если Параметры.Свойство("СписокЗначенийТипыОплатыСчета") Тогда 
	СписокЗначенийТипыОплатыСчета = Параметры.СписокЗначенийТипыОплатыСчета; 
Иначе	
	СписокЗначенийТипыОплатыСчета = Неопределено;
КонецЕсли;

ОбщийФункционалКлиентСервер.ЗаполнитьЭлементОтбораСписок(Список, "Турагентство", Турагентство
	, ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
Если СписокЗначенийТипыОплатыСчета <> Неопределено Тогда
	ОбщийФункционалКлиентСервер.ЗаполнитьЭлементОтбораСписок(Список, "ТипОплатыСчета", СписокЗначенийТипыОплатыСчета
		, ВидСравненияКомпоновкиДанных.ВСписке, Ложь);
КонецЕсли;
		
ЗапрещенныеПоля = Новый Массив;
ЗапрещенныеПоля.Добавить("ПолнаяПапка");
	
Список.УстановитьОграниченияИспользованияВГруппировке(ЗапрещенныеПоля);
Список.УстановитьОграниченияИспользованияВОтборе(ЗапрещенныеПоля);
Список.УстановитьОграниченияИспользованияВПорядке(ЗапрещенныеПоля);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
МассивСтрок = Строки.ПолучитьКлючи();
Для Каждого КлючСтроки Из МассивСтрок Цикл
	СтрокаДинСписка = Строки[КлючСтроки];   
	
	ТекущийРодитель = "";
	ОбщийФункционалСервер.ПолнаяПапкаРодитель(СтрокаДинСписка.Данные.Ссылка, ТекущийРодитель);
	ПолнаяПапкаРодитель = ТекущийРодитель;
	СтрокаДинСписка.Данные["ПолнаяПапка"] = ПолнаяПапкаРодитель;
	
КонецЦикла;
КонецПроцедуры

