
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если РаботаСИнтерфейсомСервер.УстановитьТолькоПросмотр(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;

РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(ЭтаФорма.КоманднаяПанель,"ФормаУдалить");
	
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Если Параметры.Свойство("КоворкингНомер", Объект.КоворкингНомер) Тогда
		Элементы.КоворкингНомер.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецЕсли;

Счета.Параметры.УстановитьЗначениеПараметра("КоворкингЗаявка", Объект.Ссылка);

НастройкаФормы();
КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()
Объект.ПочасоваяОплата = Объект.КоворкингНомер.ПочасоваяОплата;
ПочасоваяОплата = Объект.ПочасоваяОплата;

//Элементы.ДатаПо.Видимость = НЕ ПочасоваяОплата; 
Элементы.ЧасС.Видимость = ПочасоваяОплата; 
Элементы.ЧасПо.Видимость = ПочасоваяОплата; 
//Элементы.ВключатьВыходные.Видимость = НЕ ПочасоваяОплата; 

Элементы.СчетаДатаПо.Видимость = НЕ ПочасоваяОплата; 
Элементы.СчетаЧасС.Видимость = ПочасоваяОплата; 
Элементы.СчетаЧасПо.Видимость = ПочасоваяОплата; 

Если ПочасоваяОплата Тогда
	Элементы.ПериодАренды.СписокВыбора.Добавить("ЧАС"); 
Иначе
	Элементы.ПериодАренды.СписокВыбора.Добавить("МЕСЯЦ"); 
	Элементы.ПериодАренды.СписокВыбора.Добавить("НЕДЕЛЯ"); 
	Элементы.ПериодАренды.СписокВыбора.Добавить("ДЕНЬ"); 
КонецЕсли;

Если ПочасоваяОплата Тогда
	Если Объект.ПериодАренды <> "ЧАС" Тогда
		Объект.ПериодАренды = "ЧАС";
	КонецЕсли;
	Объект.ДатаПо = Объект.ДатаС;

	Элементы.ПериодАренды.ТолькоПросмотр = Истина;
	
	КоворкингСервер.ЗаполнитьЧасыСписокВыбора(Элементы.ЧасС.СписокВыбора, Элементы.ЧасПо.СписокВыбора);
	
	Объект.Цена = Объект.КоворкингНомер.ЦенаЗаЧас;	
КонецЕсли;
КонецПроцедуры

//
&НаКлиенте
Процедура КоворкингНомерПриИзменении(Элемент)
Если КоворкингСервер.ЕстьКоворкингСчета(Объект.Ссылка) Тогда 	
	ПоказатьПредупреждение(, "Есть Счета.
	|
	|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	Объект.КоворкингНомер = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "КоворкингНомер");
	Возврат;
КонецЕсли;

КоворкингНомерПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоворкингНомерПриИзмененииНаСервере()
НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОплачиваетОнЖе(Команда)
Объект.Оплачивает = Объект.Клиент;	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАрендыПриИзменении(Элемент)
ПериодАрендыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодАрендыПриИзмененииНаСервере()
Если Объект.ПериодАренды = "МЕСЯЦ" Тогда
	Объект.Цена = Объект.КоворкингНомер.ЦенаЗаМесяц;		
ИначеЕсли Объект.ПериодАренды = "НЕДЕЛЯ" Тогда
	Объект.Цена = Объект.КоворкингНомер.ЦенаЗаНеделю;	
ИначеЕсли Объект.ПериодАренды = "ДЕНЬ" Тогда
	Объект.Цена = Объект.КоворкингНомер.ЦенаЗаДень;
ИначеЕсли Объект.ПериодАренды = "ЧАС" Тогда
	Объект.Цена = Объект.КоворкингНомер.ЦенаЗаЧас;;
Иначе	
	Объект.Цена = 0;
КонецЕсли;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(Объект.ДатаС)	Тогда Возврат; КонецЕсли;
	
Если НЕ ЗначениеЗаполнено(Объект.ДатаПо) Тогда 
	Если Объект.ПочасоваяОплата Тогда
		Объект.ДатаПо = Объект.ДатаС;
	КонецЕсли;
КонецЕсли;
	
КонтрольДаты("ДатаС", "Дата С");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
КонтрольДаты("ДатаПо", "Дата По");
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДаты(ДатаИмяРеквизита, ДатаНаименованиеРеквизита)
Если НЕ (ЗначениеЗаполнено(Объект.ДатаС) И ЗначениеЗаполнено(Объект.ДатаПо)) Тогда 
	
	Возврат; 
КонецЕсли;

Если Объект.ДатаПо < Объект.ДатаС  Тогда 
	ПоказатьПредупреждение(, "'Дата По' меньше 'Дата С'
		|
		|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	Дата_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, ДатаИмяРеквизита);
	Объект[ДатаИмяРеквизита] = Дата_OldValue;
	
	Возврат; 
КонецЕсли;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЧасСПриИзменении(Элемент)
КонтрольЧасы("ЧасС", "Час С");
КонецПроцедуры

&НаКлиенте
Процедура ЧасПоПриИзменении(Элемент)
КонтрольЧасы("ЧасПо", "Час По");
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЧасы(ЧасИмяРеквизита, ЧасНаименованиеРеквизита)
Если Объект.ЧасС = 0 ИЛИ Объект.ЧасПо = 0 Тогда Возврат; КонецЕсли;

ЧасыМинимумМаксимум = КоворкингСервер.НачальныйЧасКонечныйЧас();
Если Объект[ЧасИмяРеквизита] < ЧасыМинимумМаксимум.НачальныйЧас
ИЛИ Объект[ЧасИмяРеквизита] > ЧасыМинимумМаксимум.КонечныйЧас
Тогда 	
	Час_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, ЧасИмяРеквизита);
	Объект[ЧасИмяРеквизита] = Час_OldValue;
	
	Возврат;
КонецЕсли;

Если Объект.ЧасПо <= Объект.ЧасС Тогда 
	ПоказатьПредупреждение(, "'Час По' меньше либо равен 'Час С'.
		|
		|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	Дата_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, ЧасИмяРеквизита);
	Объект[ЧасИмяРеквизита] = Дата_OldValue;
	
	Возврат; 
КонецЕсли;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
ТекстСообщения = ПроверкаЗаполненияТекстСообщенияПередЗаписьюНаСервере();
Если ТекстСообщения <> "" Тогда
	ТекстСообщения = ТекстСообщения + " ЗАПИСЬ ОТМЕНЯЕТСЯ.";
	Сообщить(ТекстСообщения); 
	
	Отказ = Истина;
	Возврат; 
КонецЕсли;

Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
	ДанныеОбъект = Объект;
	Результат = КоворкингСервер.ПроверкаЗанятостиКоворкинг(ДанныеОбъект);
	Если Результат.Ошибка Тогда
		ТекстПредупреждения = "";
		Первый = Истина;
		Для Каждого Строка Из Результат.Сообщение Цикл
			Если Первый Тогда Первый = Ложь; Продолжить; КонецЕсли; 
			
			ТекстПредупреждения = ТекстПредупреждения + Строка + Символы.ПС;
		КонецЦикла;
		ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + "ЗАПИСЬ ОТМЕНЯЕТСЯ.";
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
		ТекстСообщения = "";
		Для Каждого Строка Из Результат.Сообщение Цикл
			ТекстСообщения = ТекстСообщения + Строка + " ";
		КонецЦикла;	
		ТекстСообщения = ТекстСообщения + "ЗАПИСЬ ОТМЕНЯЕТСЯ.";
		Сообщить(ТекстСообщения);
		
		Отказ = Истина; Возврат;	
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаЗаполненияТекстСообщенияПередЗаписьюНаСервере()
Возврат КоворкингСервер.ПроверкаЗаполненияКоворкингЗаявкаТекстСообщения(Объект, " ");
КонецФункции
//

////
&НаСервере
Процедура ОбновитьСчета() 
Счета.Параметры.УстановитьЗначениеПараметра("КоворкингЗаявка", Объект.Ссылка);
Элементы.Счета.Обновить();	

Если ЗначениеЗаполнено(ТекущийСчет) Тогда 
	Элементы.Счета.ТекущаяСтрока = ТекущийСчет;
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СчетаПередНачаломДобавления_НеНужно(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СчетаПриАктивизацииСтроки(Элемент)
ТД = Элементы.Счета.ТекущиеДанные;
Если ТД = Неопределено Тогда
	Оплаты.Параметры.УстановитьЗначениеПараметра("КоворкингСчет", Неопределено);
	
	Возврат;
КонецЕсли;
	
Оплаты.Параметры.УстановитьЗначениеПараметра("КоворкингСчет", ТД.Ссылка);  
КонецПроцедуры

// + Добавление Счета
&НаКлиенте
Асинх Процедура ДобавитьСчет(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;	

Если НЕ Объект.ПочасоваяОплата Тогда
	СледующийСчетДатаС = КоворкингСервер.СледующийСчетДатаС(Объект.Ссылка);

	Если СледующийСчетДатаС > Объект.ДатаПо Тогда
		Текст = "'Следующая 'Дата C' счета: " + Формат(СледующийСчетДатаС, "ДФ=dd.MM.yyyy")
			+ " БОЛЬШЕ 'Дата По' Заявки: " + Формат(Объект.ДатаПо, "ДФ=dd.MM.yyyy") + ".";
		ПоказатьПредупреждение(, Текст);
		
		Возврат;

		//Результат = Ждать ВопросАсинх("'Расчетная 'Дата C' счета: " + Формат(СледующийСчетДатаС, "ДФ=dd.MM.yyyy")
		//	+ " БОЛЬШЕ 'Дата По' Заявки: " + Формат(Объект.ДатаПо, "ДФ=dd.MM.yyyy") + "
		//	|
		//	|ПРОДОЛЖИТЬ ?"		
		//	, РежимДиалогаВопрос.ОКОтмена); 
		//Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
	КонецЕсли;
КонецЕсли;

//ДобавитьСчетНаСервере();	
ОбъектДанные = Объект;
Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_КоворкингСчета", ЭтаФорма);
КоворкингКлиент.ДобавитьСчет(ЭтаФорма, Оповещение, ОбъектДанные);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы_КоворкингСчета(Результат, ДополнительныеПараметры) Экспорт
ОбновитьСчета();	
	
Конецпроцедуры
// - Добавление Счета


// + Удаление Счета
&НаКлиенте
Процедура СчетаПередУдалением(Элемент, Отказ)
ТС = Элементы.Счета.ТекущаяСтрока;	
ТД = Элементы.Счета.ДанныеСтроки(ТС);	
Счет = ТД.Ссылка;
	
Отказ = КоворкингКлиент.ПроверкаУдаленияСчета(Счет); 	
КонецПроцедуры
// - Удаление Счета

&НаКлиенте
Процедура СчетаВыбор_НеНужно(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТС = Элементы.Счета.ТекущаяСтрока;	
ТД = Элементы.Счета.ДанныеСтроки(ТС);	
Счет = ТД.Ссылка;

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("Ключ", Счет);

ОткрытьФорму("Документ.КоворкингСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

// Оплаты
&НаСервереБезКонтекста
Процедура ОплатыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
Для Каждого Строка Из Строки Цикл
	ДокументДолгОбъект = Строка.Значение.Данные.КоворкингСчет.ПолучитьОбъект();
	
	ОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(Строка.Значение.Данные.ДокументОплаты
		, ДокументДолгОбъект);	
	Строка.Значение.Данные.СуммаОстатокДокументаОплаты = ОстатокКРаспределению;  
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Элемент.ТекущиеДанные;

ОплатыОбщееКлиент.ОткрытьДокументОплаты(ЭтаФорма, ТД.ДокументОплаты, Истина, Неопределено);
КонецПроцедуры


// ++++++++++++++++++++++++++++++++++




