

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТекстСообщения = Параметры.ТекстСообщения;	
	
//Элементы.Декорация1.Заголовок = "Открытие Зарплата Администраторы
//			|Идет загрука данных. 
//			|
//			|ПОДОЖДИТЕ ...";  
Элементы.Декорация1.Заголовок = ТекстСообщения;  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения_НеИспользуется(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытьФорму_СообщениеСообщениеОперация" Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры



