
Функция ФайлЗакрытиеФинансовогоПериода(ДатаС, ДатаПо) Экспорт
ИмяТекущаяОрганизация = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();	
	
ИмяФайлОшибка = "C:\_Base1C\ЛогВыгрузки\" + "ОтправкаЗакрытиеФинансовогоПериода_" + ИмяТекущаяОрганизация + "_Ошибка";
//Если Тест Тогда
//	ИмяФайлОшибка = ИмяФайлОшибка + "Тест_";
//КонецЕсли;
ИмяФайлОшибка = ИмяФайлОшибка + ".txt";

ЕстьОшибки = Ложь;
Попытка
	//щ = 1/0;
	
	НомерСтрокиШапкаДолги = 0;
	НомерКомментарий_Долги = 0;

	ДанныеДолги = Новый ТаблицаЗначений;
	ДанныеДолги.Колонки.Добавить("ЗаявкаНаБронирование");
	ДанныеДолги.Колонки.Добавить("КомментарийОтветственного");
	ДанныеДолги.Колонки.Добавить("ЕстьИзменения");

	ТабДок = Обработки.ЗакрытиеФинансовогоПериода.ПолныйОтчетНаСервере(ДатаС, ДатаПо
		, ДанныеДолги, НомерСтрокиШапкаДолги, НомерКомментарий_Долги);
	
Исключение
	ТекстОшибки = "Ошибка формирования ОтчетЗакрытиеФинансовогоПериода: " + ОписаниеОшибки();	
	Сообщить(ТекстОшибки);	
	
	ЕстьОшибки = Истина;
	
	Файл = Новый ЗаписьТекста(ИмяФайлОшибка,,, Истина);
	Файл.ЗаписатьСтроку(ТекстОшибки + " " + ТекущаяДата());
	Файл.Закрыть();
КонецПопытки;

Если НЕ ЕстьОшибки  Тогда 
	Попытка 	
//		щ = 1/0;
		
		Каталог = "C:\_Base1C";
		ИмяФайла = Каталог + "\" + "ОтчетЗакрытиеФинансовогоПериода.xls";
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		
	Исключение
		ТекстОшибки = 	"Ошибка выгрузки в EXEL ОтчетЗакрытиеФинансовогоПериода: " + ОписаниеОшибки();	
		Сообщить(ТекстОшибки);	
		
		ЕстьОшибки = Истина;
		
		Файл = Новый ЗаписьТекста(ИмяФайлОшибка,,, Истина);
		Файл.ЗаписатьСтроку(ТекстОшибки + " " + ТекущаяДата());
		Файл.Закрыть();
	КонецПопытки;
КонецЕсли;

Если ЕстьОшибки Тогда
	Тема = ТекстОшибки;
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(ИмяФайлОшибка);
	
	МассивПолучатели = Новый Массив;
	МассивПолучатели.Добавить("postnikov_sn@invina.ru");
	
	ТекстСообщения = ТекстОшибки;
	
	СлужебныеСервер.ОтправитьEmail(Тема, МассивФайлов, МассивПолучатели, ТекстСообщения);
	
	Сообщить("Есть ошибки");
	
	Возврат Неопределено;
КонецЕсли;

Возврат ИмяФайла; 
КонецФункции

Функция ФайлЕжедневныйОтчетФактСводный(ДатаС, ДатаПо) Экспорт
ИмяТекущаяОрганизация = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();	
	
ИмяФайлОшибка = "C:\_Base1C\ЛогВыгрузки\" + "ЕжедневныйОтчетСводный_" + ИмяТекущаяОрганизация + "_Ошибка";
//Если Тест Тогда
//	ИмяФайлОшибка = ИмяФайлОшибка + "Тест_";
//КонецЕсли;
ИмяФайлОшибка = ИмяФайлОшибка + ".txt";

ЕстьОшибки = Ложь;
ЕстьОшибкиФормированияОтчета = Ложь;
Попытка
	//щ = 1/0;
	
	Данные = ЕжедневныйОтчетФакт.ПолучитьДанныеДляЕжедневныйОтчетФактСводный(ДатаС, ДатаПо);

	Если ЗначениеЗаполнено(Данные.ТекстОшибки) Тогда
		ЕстьОшибкиФормированияОтчета = Истина;	
	КонецЕсли;

	ТабДок = ЕжедневныйОтчетФакт.СформироватьЕжедневныйОтчетСводный(Данные);

Исключение
	ТекстОшибки = "Ошибка формирования ЕжедневныйОтчетСводный: " + ОписаниеОшибки();	
	Сообщить(ТекстОшибки);	
	
	ЕстьОшибки = Истина;
	
	Файл = Новый ЗаписьТекста(ИмяФайлОшибка,,, Истина);
	Файл.ЗаписатьСтроку(ТекстОшибки + " " + ТекущаяДата());
	Файл.Закрыть();
КонецПопытки;

Если НЕ ЕстьОшибки  Тогда 
	Попытка 	
//		щ = 1/0;
		
		Каталог = "C:\_Base1C";
		ИмяФайла = Каталог + "\" + "ЕжедневныйОтчетФактСводный.xls";
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		
	Исключение
		ТекстОшибки = 	"Ошибка выгрузки в EXEL ЕжедневныйОтчетФактСводный: " + ОписаниеОшибки();	
		Сообщить(ТекстОшибки);	
		
		ЕстьОшибки = Истина;
		
		Файл = Новый ЗаписьТекста(ИмяФайлОшибка,,, Истина);
		Файл.ЗаписатьСтроку(ТекстОшибки + " " + ТекущаяДата());
		Файл.Закрыть();
	КонецПопытки;
КонецЕсли;

Если ЕстьОшибки 
ИЛИ ЕстьОшибкиФормированияОтчета 
Тогда
	Тема = ТекстОшибки;
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(ИмяФайлОшибка);
	
	МассивПолучатели = Новый Массив;
	МассивПолучатели.Добавить("postnikov_sn@invina.ru");
	
	ТекстСообщения = ТекстОшибки;
	
	СлужебныеСервер.ОтправитьEmail(Тема, МассивФайлов, МассивПолучатели, ТекстСообщения);
	
	Сообщить("Есть ошибки");
	
	Возврат Неопределено;
КонецЕсли;

Возврат ИмяФайла; 
КонецФункции
