&НаКлиенте
Процедура ПриОткрытии___()
	//Если НЕ ТекПол.Админ тогда
	//	ДокументСписок.Отбор["Кому"].Значение=ТекПол;	
	//	ДокументСписок.Отбор["Кому"].Использование=Истина;
	//конецесли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если НЕ ТекПол.Админ Тогда
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекущийПользователь.Админ Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Кому");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		//	 ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
		ЭлементОтбора.ПравоеЗначение = ТекущийПользователь;
		ЭлементОтбора.Использование = Истина;

		//ДокументСписок.Отбор["Кому"].Значение=ТекПол;	
		//ДокументСписок.Отбор["Кому"].Использование=Истина;
	КонецЕсли;
КонецПроцедуры
