
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("КонтрагентыОтбор", КонтрагентыОтбор);
Список.Параметры.УстановитьЗначениеПараметра("КонтрагентыОтбор", КонтрагентыОтбор);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ЗначениеВыбора = Новый Структура;
ТД = Элементы.Список.ДанныеСтроки(Элементы.Список.ТекущаяСтрока);
ДокументДолг = ТД.ДокументДолг;
ЗначениеВыбора.Вставить("ДокументДолг", ДокументДолг);

//Если ТипЗнч(ДокументДолг) = Тип("ДокументСсылка.РабочееМестоБронь") Тогда
//	СчетГУИД = Элементы.Список.ТекущиеДанные.СчетГУИД;
//	ЗначениеВыбора.Вставить("СчетГУИД", СчетГУИД);	
//КонецЕсли;

ОповеститьОВыборе(ЗначениеВыбора);
КонецПроцедуры





