
&НаКлиенте
Процедура ТестSQL_1(Команда)
НомерSQL = "Исходный";
//ТД = ТестSQLНаСервере_Тест();
ТД = ТестSQLНаСервере();

ТД.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ТестSQL_2(Команда)
НомерSQL = "Новый";
//ТД = ТестSQLНаСервере_Тест();
ТД = ТестSQLНаСервере();

ТД.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ТестSQL_3(Команда)
НомерSQL = "Местный";
//ТД = ТестSQLНаСервере_Тест();
ТД = ТестSQLНаСервере();

Если ТД = Неопределено Тогда Возврат;  КонецЕсли;

ТД.Показать();
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Функция ТестSQLНаСервере()
ТекстЗапроса="SELECT * FROM  hostel";
ТЗ = ЗапросMySQL(ТекстЗапроса);	
Если ТЗ = Неопределено Тогда Возврат Неопределено; КонецЕсли;
ТД = ПолучитьТабличныйДокумент(ТЗ);
Возврат ТД;
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокумент(Таблица) Экспорт
    ТабДокумент = Новый ТабличныйДокумент;
    
    // Выводим заголовок таблицы
    КолонкаИндекс = 0;
    Пока КолонкаИндекс < Таблица.Колонки.Количество() Цикл
        Колонка = Таблица.Колонки[КолонкаИндекс];
        ТабДокумент.Область(1, КолонкаИндекс + 1, 1, КолонкаИндекс + 1).Текст = Колонка.Имя;  
        КолонкаИндекс = КолонкаИндекс + 1;
    КонецЦикла;
    
    // Выводим строки таблицы
    СтрокаИндекс = 0;
    Пока СтрокаИндекс < Таблица.Количество() Цикл
        Таблица_Строка = Таблица[СтрокаИндекс];
        КолонкаИндекс = 0;
        Пока КолонкаИндекс < Таблица.Колонки.Количество() Цикл
            Колонка = Таблица.Колонки[КолонкаИндекс];
            ТабДокумент.Область(СтрокаИндекс + 2, КолонкаИндекс + 1, СтрокаИндекс + 2, КолонкаИндекс + 1).Текст = Формат(Таблица_Строка[Колонка.Имя], "ЧГ=0");
            КолонкаИндекс = КолонкаИндекс + 1;
        КонецЦикла;        
        СтрокаИндекс = СтрокаИндекс + 1;
    КонецЦикла;
    
    Возврат ТабДокумент;
КонецФункции

//
&НаСервере
Функция ТестSQLНаСервере_Тест()
ТЗ = ПолучитьТЗ();
ТД = ПолучитьТабличныйДокумент(ТЗ);

Возврат ТД;
КонецФункции

&НаСервере
Функция ПолучитьТЗ()
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	Горничные.Ссылка КАК Ссылка,
               |	Горничные.ВерсияДанных КАК ВерсияДанных,
               |	Горничные.ПометкаУдаления КАК ПометкаУдаления,
               |	Горничные.Код КАК Код,
               |	Горничные.Наименование КАК Наименование,
               |	Горничные.Предопределенный КАК Предопределенный,
               |	Горничные.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
               |	Горничные.Представление КАК Представление
               |ИЗ
               |	Справочник.Горничные КАК Горничные";

ТЗ = Запрос.Выполнить().Выгрузить();

Возврат ТЗ;
КонецФункции

&НаСервере
Функция СоединениеConnectionString()
Если НомерSQL = "Исходный" Тогда	
	Возврат "DRIVER={MySQL ODBC 5.2 Unicode Driver};OPTION=3;DATABASE=artemis;PWD=wertyu;PORT=3306;SERVER=192.168.20.100;UID=artemis;";
ИначеЕсли НомерSQL = "Новый" Тогда
	Возврат "DRIVER={MySQL ODBC 5.2 Unicode Driver};OPTION=3;DATABASE=artemis;PWD=wertyu;PORT=3306;SERVER=127.0.0.1;UID=artemis;";
ИначеЕсли НомерSQL = "Местный" Тогда
	Возврат "Provider=SQLOLEDB.1;Persist Security Info=False;User ID=postnikovsn;Password=,hfn-yjcjhju;Initial Catalog=artemis;Data Source=10.1.3.196";
//Sc.ConnectionString=
//          "Provider=SQLOLEDB.1;Persist Security Info=False;User ID=postnikovsn;Password=,hfn-yjcjhju;Initial Catalog=artemis;Data Source=10.1.3.196";
Иначе		
	Сообщить("Не указан срервер");
КонецЕсли;	
	
КонецФункции	

//Sc=New COMObject("ADODB.Connection");
//Sc.ConnectionTimeout=160;
//Sc.CommandTimeout=260;
//Sc.ConnectionString="Provider=SQLOLEDB.1;Persist Security Info=False;User ID=postnikovsn;Password=,hfn-yjcjhju;Initial Catalog=artemis;Data Source=10.1.3.196";
//Sc.Open();
//Table=Sc.execute("select * from dbo.hostel");

//
&НаСервере
Функция КомандаMySQL(ТекстЗапроса) 

	Соединение = Новый COMОбъект("ADODB.Connection");
	
	//Соединение.ConnectionString ="DRIVER={MySQL ODBC 5.2a Driver};OPTION=3;DATABASE=artemis;PWD=wertyu;PORT=3306;SERVER=127.0.0.1;UID=artemis;";
	Соединение.ConnectionString = СоединениеConnectionString();
	
	// инициализируем набор записей и комманду
	НаборЗаписей = Новый COMОбъект("ADODB.Recordset");
	Команда = Новый COMОбъект("ADODB.Command");
	Попытка
		Соединение.Open();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Попытка
		
		Соединение.execute(ТекстЗапроса);	
		
	Исключение
		
	КонецПопытки;	  
	//  ТЗ=СКЛ_ТЗ(Table);
	//  Возврат ТЗ;
КонецФункции

&НаСервере
Функция ЗапросMySQL(ТекстЗапроса) 
// + ПСН Отладка	
	//ТЗ = Новый ТаблицаЗначений;
	//Возврат ТЗ;
// - ПСН Отладка	
	
	Соединение = Новый COMОбъект("ADODB.Connection");
	
Соединение.ConnectionTimeout=160;
Соединение.CommandTimeout=260;
	
	
	//Соединение.ConnectionString ="DRIVER={MySQL ODBC 5.2a Driver};OPTION=3;DATABASE=artemis;PWD=wertyu;PORT=3306;SERVER=127.0.0.1;UID=artemis;";
	Соединение.ConnectionString = СоединениеConnectionString();
	
	// инициализируем набор записей и комманду
	НаборЗаписей = Новый COMОбъект("ADODB.Recordset");
	Команда = Новый COMОбъект("ADODB.Command");
	Попытка
		Соединение.Open();
	Исключение
		Сообщить(ОписаниеОшибки());
		
		Возврат Неопределено;
	КонецПопытки;
	Table=Соединение.execute(ТекстЗапроса);	  
	ТЗ=СКЛ_ТЗ(Table);
	Возврат ТЗ;
КонецФункции

&НаСервере
Функция СКЛ_ТЗ(Результ) 
	ТЗ=Новый ТаблицаЗначений;
	Если Результ<>неопределено тогда
		
		
		Для сч=0 По Результ.Fields.Count-1 Цикл
			ТЗ.Колонки.Добавить(Результ.Fields(сч).Name);	
		КонецЦикла; 
		Пока Результ.EOF()=0 Цикл
			Нов=ТЗ.Добавить();
			Для сч=0 По Результ.Fields.Count-1 Цикл
				Нов[Результ.Fields(сч).Name]=Результ.Fields(сч).Value;				
			КонецЦикла; 
			
			Результ.MoveNext();			
		конеццикла;
		
	конецесли;
	Возврат ТЗ;
КонецФункции



&НаКлиенте
Процедура Команда2(Команда)
ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаСписка");	
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
ОткрытьФорму("Справочник.ДрайверыОборудования.Форма.ФормаСписка1");	
//ИмяФ = ПредопределенноеЗначение("Константы.Папка_C_BASE");
//ИмяФ = ОбщиеСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");

//Сообщить(ИмяФ);

//РегистрНакопленияНаборЗаписей.Отбор.Регистратор.Значение = ПолучитьРегистратор(Номер);
//РегистрНакопленияНаборЗаписей.Отбор.Регистратор.Использование = Истина;	
КонецПроцедуры

&НаСервере
Функция ПолучитьРегистратор(Номер)
Объект_ = Документы.ВыпискаБанка.НайтиПоНомеру(Номер);	
Возврат Объект_.Ссылка; 	
КонецФункции	


&НаКлиенте
Процедура ПочтаТест__(Команда)
// Профиль = новый ИнтернетПочтовыйПрофиль;
// Профиль.АдресСервераSMTP = "10.1.2.3";
//// Профиль.АдресСервераSMTP = "srvex1.corp.invina.ru";

// Профиль.ПользовательSMTP = "rassupp";
// Профиль.ПарольSMTP = "dfrxpo*87695";

// ПочтовыйПрофиль = новый ИнтернетПочтовыйПрофиль;
// ПочтовыйПрофиль.АдресСервераSMTP = "10.1.2.3";
//// Профиль.АдресСервераSMTP = "srvex1.corp.invina.ru";

// ПочтовыйПрофиль.ПользовательSMTP = "rassupp";
// ПочтовыйПрофиль.ПарольSMTP = "dfrxpo*87695";
	
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	ПочтовыйПрофиль.АдресСервераSMTP   = "srvex1.corp.invina.ru"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
		смтпПользователь="postnikov_sn";//Константы.АдресЭлПочтыОтправителя.Получить();
		//смтпПользователь="postnikov_sn@invina.ru";//Константы.АдресЭлПочтыОтправителя.Получить();
	
	ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	ПочтовыйПрофиль.ПарольSMTP         = "<HFNyjcjhju*12"; 
	//ПочтовыйПрофиль.Пароль = "<HFNyjcjhju*12";
	//ПочтовыйПрофиль.ВремяОжидания      = 15;                 
	//ПочтовыйПрофиль.АутентификацияSMTP=СпособSMTPАутентификации.Login; 

	// - ПСН
	
	Почта = Новый ИнтернетПочта(); 
	
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		//ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки(),ЛогФайл, , Истина); 
		
		Сообщить("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " 
			+ Символы.ПС + ОписаниеОшибки() ,СтатусСообщения.ОченьВажное); 
		Возврат; 
	КонецПопытки; 

КонецПроцедуры


&НаКлиенте
Процедура ПочтаТест(Команда)
Тема = "ТЕСТ";
Получатель = "postnikov_sn@invina.ru";
ОтправитьМылом_Анкета(Тема,"",Получатель);	
КонецПроцедуры

Процедура ОтправитьМылом_Анкета(Тема,Файло,Получатель,Полные=Ложь) Экспорт
	
	ЛогФайл = "Рассылка.log";
	
	// + ПСН
	
	//ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	//ПочтовыйПрофиль.АдресСервераSMTP   = "127.0.0.1"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
	//	смтпПользователь="renomehotel@gmail.com";//Константы.АдресЭлПочтыОтправителя.Получить();
	//
	//ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	//ПочтовыйПрофиль.ПарольSMTP         = "zxcvnm*258"; 
	//ПочтовыйПрофиль.Пароль = "zxcvnm*258";
	//ПочтовыйПрофиль.ВремяОжидания      = 15;                 
	//ПочтовыйПрофиль.АутентификацияSMTP=СпособSMTPАутентификации.Login; 
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	ПочтовыйПрофиль.АдресСервераSMTP   = "srvex1.corp.invina.ru"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
	смтпПользователь="postnikov_sn";//Константы.АдресЭлПочтыОтправителя.Получить();
	
	ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	ПочтовыйПрофиль.ПарольSMTP         = "<HFNyjcjhju*14"; 

	// - ПСН
	
	Почта = Новый ИнтернетПочта(); 
	
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		//ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки(),ЛогФайл, , Истина); 
		
		//ОбщийМодульСлужебныеСервер.ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " 
		//	+ Символы.ПС + ОписаниеОшибки(), ЛогФайл, , Истина); 
		Сообщить("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " ,СтатусСообщения.ОченьВажное); 
		Возврат; 
	КонецПопытки;
	
	ТелоСообщения = "
	|
	|-------------------------------------------------------------------------
	|Данное сообщение сгенерировано автоматически.
	|Отвечать на это письмо по адресу отправителя не имеет смысла.
	|-------------------------------------------------------------------------";
	
	ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение; 
	
	ПочтовоеСообщение.Тема = Тема + " " + ТекущаяДата();
	ПочтовоеСообщение.Тексты.Добавить(ТелоСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);
	
	Если НЕ ЗначениеЗаполнено(Получатель) тогда
		// + ПСН отсутсвует Справочники.СписокРассылки
		
		//Рассылка=Справочники.СписокРассылки.Выбрать();
		//Пока Рассылка.Следующий() цикл
		//	Если НЕ Рассылка.ПометкаУдаления тогда
		//		ПочтовоеСообщение.Получатели.Добавить(СокрЛП(Рассылка.Наименование));
		//	КонецЕсли;
		//КонецЦикла;
		
		// - ПСН отсутсвует Справочники.СписокРассылки
		
	иначе
		
		ПочтовоеСообщение.Получатели.Добавить(Получатель);
		Если Полные тогда
			
		конецесли;
		
// + ПСН		
		//ПочтовоеСообщение.Получатели.Добавить("guz@agent5.ru");
		//ПочтовоеСообщение.Получатели.Добавить("Kantorov_EE@invina.ru");
// - ПСН
		
	КонецЕсли;
	
	ПочтовоеСообщение.Отправитель = "renomehotel@gmail.com";
	ПочтовоеСообщение.ИмяОтправителя = "Уведомление RENOME";
			
			//ПочтовоеСообщение.Вложения.Добавить(Файло);
	
	Если ПочтовоеСообщение.Получатели.Количество()>0 тогда	
		Попытка
			Почта.Послать(ПочтовоеСообщение);

			//ВЛог(ТЕма +" отправлен",ЛогФайл);
			//ОбщийМодульСлужебныеСервер.ВЛог(ТЕма +" отправлен",ЛогФайл);
		Исключение
			//ВЛог(ОписаниеОшибки(),ЛогФайл,,Истина);
			//ОбщийМодульСлужебныеСервер.ВЛог(ОписаниеОшибки(),ЛогФайл,,Истина);
			
			Сообщить(ОписаниеОшибки(),СтатусСообщения.ОченьВажное);
		КонецПопытки;
	иначе
//		Сообщить("Не заполнен справочник ""Список рассылки""!",СтатусСообщения.ОченьВажное);
		Сообщить("Не заполнено поле: Получатель.",СтатусСообщения.ОченьВажное);
	КонецЕсли;
КонецПроцедуры	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры


///// Пример открытия формы без сохранения
&НаКлиенте
Процедура СоздатьНовыйОбъект()
    ФормаОбъекта    = ПолучитьФорму("Документ.ЗаказПокупателя.Форма.ФормаДокумента");
    // Или справочник
    ФормаОбъекта    = ПолучитьФорму("Справочник.Партнеры.Форма.ФормаЭлемента");
 
    ДанныеФормы     = ФормаОбъекта.Объект;
    СоздатьНовыйОбъектНаСервере(ДанныеФормы);
 
    КопироватьДанныеФормы(ДанныеФормы, ФормаОбъекта.Объект);  
    ФормаОбъекта.Открыть();
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура СоздатьНовыйОбъектНаСервере(НовыйОбъект)
    НовыйОбъект.Дата    = ТекущаяДата();
    // Другой произвольный алгоритм
КонецПроцедуры



&НаКлиенте
Процедура РеквизвитОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
ш= 1;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Бронь = Документы.ЗаявкаНаБронирование.НайтиПоНомеру("000042014");
	
	НовЭлементОтбора = РегистрНакопленияНаборЗаписей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Бронь"); 
	НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовЭлементОтбора.Использование = Истина;
	НовЭлементОтбора.ПравоеЗначение = Бронь;	
	
	//РегистрНакопленияНаборЗаписей.отбор.Бронь.Значение = Бронь;
	//РегистрНакопленияНаборЗаписей.отбор.Бронь.ВидСравнения = ВидСравнения.Равно;
	//РегистрНакопленияНаборЗаписей.отбор.Бронь.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
//	ПараметрыПеретаскивания.ДопустимыеДействия = ДействиеПеретаскивания.Перемещение;
	ш = 1;
КонецПроцедуры







