&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
УсловноеОформлениеЗагрузить();
КонецПроцедуры

//
&НаСервере
Процедура ТоварыПриВыводеСтроки__(Элемент, ОформлениеСтроки, ДанныеСтроки)
	//Если ДанныеСтроки.Расхождение=0 тогда
	//	ОформлениеСтроки.ЦветФона=Новый Цвет(103,238,16);
	//иначеесли ДанныеСтроки.Расхождение>0 тогда
	//	ОформлениеСтроки.ЦветФона=Новый Цвет(200,211,93);
	//иначе
	//	ОформлениеСтроки.ЦветФона=Новый Цвет(251,128,49);
	//конецесли;
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеЗагрузить()
УсловноеОформление.Элементы.Очистить();

ЭлементыТабНаФормеИмя = Элементы.Товары.Имя;
ПутьКПолюОтбора = "Объект.Товары.Расхождение";
ПравоеЗначение = 0;

Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;
//Web_Цвета = WebЦвета.СветлоЖелтый; 
Web_Цвета = Новый Цвет(103,238,16);
УсловноеОформлениеДобавитьПоле(
ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета );

Вид_Сравнения = ВидСравненияКомпоновкиДанных.Меньше;
//Web_Цвета = WebЦвета.Коралловый;
Web_Цвета = Новый Цвет(251,128,49);
УсловноеОформлениеДобавитьПоле(
ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета );

Вид_Сравнения = ВидСравненияКомпоновкиДанных.Больше;
//Web_Цвета = WebЦвета.БледноЗеленый;
Web_Цвета = Новый Цвет(200,211,93);
УсловноеОформлениеДобавитьПоле(
ЭлементыТабНаФормеИмя,ПутьКПолюОтбора,Вид_Сравнения, ПравоеЗначение, Web_Цвета );
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеДобавитьПоле(
ЭлементыТабНаФормеИмя,ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета)	

ЭлементОформления = УсловноеОформление.Элементы.Добавить();

ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыТабНаФормеИмя);

ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
ОтборЭлемента.ВидСравнения = Вид_Сравнения;
ОтборЭлемента.ПравоеЗначение = ПравоеЗначение;
ОтборЭлемента.Использование  = Истина;

ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Web_Цвета);
ЭлементОформления.Использование = Истина;
//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", ТолькоПросмотр);	

КонецПроцедуры
//


//
&НаСервере
Процедура КоманднаяПанель1Заполнить__(Кнопка)
	//Продолжать=Ложь;
	//Если Товары.Количество()=0 тогда
	//	Продолжать=Истина;
	//иначеесли Вопрос("Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
	//	Продолжать=Истина;
	//конецесли;
	//
	//Если Продолжать тогда
	//	Товары.Очистить();
	//	Запрос=Новый Запрос("ВЫБРАТЬ
	//	                    |	Товары.Ссылка,
	//	                    |	ЕСТЬNULL(ОстаткиПродукцииОстатки.КоличествоОстаток, 0) КАК Остаток,
	//	                    |	ЕСТЬNULL(СебестоимостьТоваровСрезПоследних.Себестоимость, 0) КАК Себестоимость
	//	                    |ИЗ
	//	                    |	Справочник.Товары КАК Товары
	//	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПродукции.Остатки(&ДТ, ) КАК ОстаткиПродукцииОстатки
	//	                    |		ПО Товары.Ссылка = ОстаткиПродукцииОстатки.Товар
	//	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьТоваров.СрезПоследних(&ДТ, ) КАК СебестоимостьТоваровСрезПоследних
	//	                    |		ПО Товары.Ссылка = СебестоимостьТоваровСрезПоследних.Товар
	//	                    |ГДЕ
	//	                    |	Товары.Ссылка В ИЕРАРХИИ(&Ссылка)
	//	                    |	И Товары.ЭтоГруппа = ЛОЖЬ");

	//	Запрос.УстановитьПараметр("Ссылка",Справочники.Товары.НайтиПоНаименованию("Бар"));
	//	Запрос.УстановитьПараметр("ДТ",Дата);
	//	ТЗ=запрос.Выполнить().Выгрузить();
	//	Для каждого СтрТЗ Из ТЗ Цикл
	//		Нов=Товары.Добавить();
	//		Нов.Товар=СтрТЗ.Ссылка;
	//		Нов.КоличествоУчет=СтрТЗ.Остаток;
	//		Нов.Себестоимость=СтрТЗ.Себестоимость/?(СтрТЗ.Остаток=0,1,СтрТЗ.Остаток);
	//		Нов.Расхождение=Нов.КоличествоФакт-Нов.КоличествоУчет;

	//	КонецЦикла; 
	//конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Товары.Количество()=0 тогда
		ЗаполнитьНаСервере();
		
	Иначе
		Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаТабличнаяЧастьБудетОчищенаПродолжить", ЭтаФорма);	
		ПоказатьВопрос(Оповещение,"Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаТабличнаяЧастьБудетОчищенаПродолжить(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	//Продолжать=Ложь;
	//Если Товары.Количество()=0 тогда
	//	Продолжать=Истина;
	//иначеесли Вопрос("Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
	//	Продолжать=Истина;
	//конецесли;
	//
	//Если Продолжать тогда
		Объект.Товары.Очистить();
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	Товары.Ссылка,
		                    |	ЕСТЬNULL(ОстаткиПродукцииОстатки.КоличествоОстаток, 0) КАК Остаток,
		                    |	ЕСТЬNULL(СебестоимостьТоваровСрезПоследних.Себестоимость, 0) КАК Себестоимость
		                    |ИЗ
		                    |	Справочник.Товары КАК Товары
		                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПродукции.Остатки(&ДТ, ) КАК ОстаткиПродукцииОстатки
		                    |		ПО Товары.Ссылка = ОстаткиПродукцииОстатки.Товар
		                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьТоваров.СрезПоследних(&ДТ, ) КАК СебестоимостьТоваровСрезПоследних
		                    |		ПО Товары.Ссылка = СебестоимостьТоваровСрезПоследних.Товар
		                    |ГДЕ
		                    |	Товары.Ссылка В ИЕРАРХИИ(&Ссылка)
		                    |	И Товары.ЭтоГруппа = ЛОЖЬ");

		Запрос.УстановитьПараметр("Ссылка",Справочники.Товары.НайтиПоНаименованию("Бар"));
		Запрос.УстановитьПараметр("ДТ",Объект.Дата);
		ТЗ=запрос.Выполнить().Выгрузить();
		Для каждого СтрТЗ Из ТЗ Цикл
			Нов=Объект.Товары.Добавить();
			Нов.Товар=СтрТЗ.Ссылка;
			Нов.КоличествоУчет=СтрТЗ.Остаток;
			Нов.Себестоимость=СтрТЗ.Себестоимость/?(СтрТЗ.Остаток=0,1,СтрТЗ.Остаток);
			Нов.Расхождение=Нов.КоличествоФакт-Нов.КоличествоУчет;

		КонецЦикла; 
		
	//конецесли;

	
КонецПроцедуры
//

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//Для каждого СтрТов Из Товары Цикл
	//
	//	СтрТов.Расхождение=СтрТов.КоличествоФакт-СтрТов.КоличествоУчет;
	//
	//КонецЦикла; 
	
Элемент.ТекущиеДанные.Расхождение = Элемент.ТекущиеДанные.КоличествоФакт - Элемент.ТекущиеДанные.КоличествоУчет;
КонецПроцедуры


