
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаОтчетаС = ТекущаяДата();
ДатаОтчетаПо = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетаСПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(ДатаОтчетаС) Тогда 
	ПоказатьПредупреждение(,"Заполните дату отчета С");
	
	Возврат;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ДатаОтчетаПо) Тогда ДатаОтчетаПо = ДатаОтчетаС; КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
ОтчетОбъект = РеквизитФормыВЗначение("Объект");

МакетИмя = "Ф_РаспределениеОплат";
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);
	
ИмяОбработки = ОтчетОбъект.Метаданные().Имя;
ТабДок = Обработки[ИмяОбработки].СформироватьОтчетНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо, БронируетОтбор, Истина);	

////ТабДок = Новый ТабличныйДокумент;
//КоличествоСтрок = ТабДок.ВысотаТаблицы;
//Для Индекс = 1 По КоличествоСтрок Цикл
//	ОбластьТекст = ТабДок.Область(Индекс, 1, Индекс, 1).Текст; 	
//	Если ОбластьТекст = "" Тогда
//		ОбластьКУдалению = ТабДок.Область(Индекс, , Индекс, ); 	

//		ТабДок.УдалитьОбласть(ОбластьКУдалению, ТипСмещенияТабличногоДокумента.ПоВертикали);
//	КонецЕсли;
//КонецЦикла;

ПолеОтчета = ТабДок;
КонецПроцедуры


// ++++++++++++++++++++
&НаСервере
Процедура СформироватьОтчетНаСервере_ПеренесеноВМодульМенеджера()
ПолеОтчета.Очистить();             

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

МакетИмя = "ФинансовыйРезультат";
//Макет = Обработки.ФинансовыйРезультат_Новый.ПолучитьМакет(МакетИмя);
ОтчетОбъект = РеквизитФормыВЗначение("Объект");
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Родитель КАК Родитель,
                      |	ДопУслуги.НомерПП КАК НомерПП
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.Родитель <> ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ДопУслуги.Родитель,
                      |	ДопУслуги.НомерПП
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДопУслуги.Родитель.Наименование");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Родитель = Справочники.ДопУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево);

КоличествоКолонок = 0;
Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Родитель) Тогда		
		Область.Параметры.ШапкаДопУслуги = Строка.Родитель;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

Область = Макет.ПолучитьОбласть("Шапка|КолонкиПраво");
ПолеОтчета.Присоединить(Область);

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 2;  // - 2 расшифровки

Область = Макет.ПолучитьОбласть("Строка|КолонкиПраво");
КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 1 ; // - 1 расшифровки

КоличествоКолонок = КоличествоКолонок - 2;

ПолеОтчета.ФиксацияСверху = 1;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

//Для ш = 1 По 100 Цикл
//	Область = Макет.ПолучитьОбласть("Строка");	
//	Область.Параметры.Дата = ш;
//	
//	ПолеОтчета.Вывести(Область);
//КонецЦикла;

Итоги = Новый Структура();
Итоги.Вставить("КоличествоНочей", 0);
Итоги.Вставить("КоличествоСутокТариф", 0);
Итоги.Вставить("СуммаЦенаПроживание", 0);
Итоги.Вставить("СуммаПроживание", 0);
Итоги.Вставить("СуммаНомера", 0);
Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаЭквайринга", 0);
Итоги.Вставить("СуммаКомиссии", 0);
Итоги.Вставить("ПолнаяСуммаКомиссии", 0);

Итоги.Вставить("КоличествоСтатус", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Родитель;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;

Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);

////Итоги.Вставить("СуммаЗавтракиУслуги", 0);
////Итоги.Вставить("СуммаПроживаниеУслуги", 0);
////Итоги.Вставить("СуммаТранспортныеУслуги", 0);

ИтогиДень = Новый Структура();
ИтогиДень.Вставить("КоличествоНочей", 0);
ИтогиДень.Вставить("КоличествоСутокТариф", 0);
ИтогиДень.Вставить("СуммаЦенаПроживание", 0);
ИтогиДень.Вставить("СуммаПроживание", 0);
ИтогиДень.Вставить("СуммаНомера", 0);
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);
ИтогиДень.Вставить("СуммаКомиссии", 0);
ИтогиДень.Вставить("ПолнаяСуммаКомиссии", 0);

ИтогиДень.Вставить("КоличествоСтатус", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Родитель;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);

Дата_П = ДатаОтчетаС;
Пока Дата_П <= ДатаОтчетаПо Цикл
	
	Запрос =	Новый Запрос ("ВЫБРАТЬ
	        	              |	НомернойФонд.Ссылка КАК НомерВРезерв,
	        	              |	ЗаявкаДанные.Ссылка КАК Заявка,
	        	              |	ЗаявкаДанные.Бронирует КАК Бронирует,
	        	              |	ЗаявкаДанные.Оплачивает КАК Оплачивает,
	        	              |	ЗаявкаДанные.Статус КАК Статус,
	        	              |	ЗаявкаДанные.КолВоЧеловек КАК КолВоЧеловек,
	        	              |	ЗаявкаДанные.КоличествоСчетов КАК КоличествоСчетов
	        	              |ИЗ
	        	              |	Справочник.НомернойФонд КАК НомернойФонд
	        	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        	              |			ЗаявкаНаБронирование.Ссылка КАК Ссылка,
	        	              |			ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
	        	              |			ЗаявкаНаБронирование.Бронирует КАК Бронирует,
	        	              |			ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
	        	              |			ЗаявкаНаБронирование.Статус КАК Статус,
	        	              |			ЗаявкаНаБронирование.КолВоЧеловек КАК КолВоЧеловек,
	        	              |			СчетаКоличество.КоличествоСчетов КАК КоличествоСчетов
	        	              |		ИЗ
	        	              |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	        	              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        	              |					ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
	        	              |					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронированиеСчета.СчетГУИД) КАК КоличествоСчетов
	        	              |				ИЗ
	        	              |					Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
	        	              |				
	        	              |				СГРУППИРОВАТЬ ПО
	        	              |					ЗаявкаНаБронированиеСчета.Ссылка) КАК СчетаКоличество
	        	              |				ПО ЗаявкаНаБронирование.Ссылка = СчетаКоличество.Ссылка
	        	              |		ГДЕ
	        	              |			ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	        	              |			И (ЗаявкаНаБронирование.РезервС <= &ДеньПроживания
	        	              |						И ЗаявкаНаБронирование.РезервПо > &ДеньПроживания
	        	              |					ИЛИ ЗаявкаНаБронирование.РезервС = &ДеньПроживания
	        	              |						И ЗаявкаНаБронирование.РезервПо = &ДеньПроживания)
	        	              |			И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
	        	              |					ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает))
	        	              |			И ВЫБОР
	        	              |					КОГДА &БронируетОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
	        	              |						ТОГДА ИСТИНА
	        	              |					ИНАЧЕ ЗаявкаНаБронирование.Бронирует = &БронируетОтбор
	        	              |				КОНЕЦ) КАК ЗаявкаДанные
	        	              |		ПО НомернойФонд.Ссылка = ЗаявкаДанные.НомерВРезерв
	        	              |ГДЕ
	        	              |	НомернойФонд.ПометкаУдаления = ЛОЖЬ
	        	              |
	        	              |УПОРЯДОЧИТЬ ПО
	        	              |	НомернойФонд.Наименование,
	        	              |	Заявка");

	Запрос.УстановитьПараметр("ДеньПроживания", Дата_П);
	Запрос.УстановитьПараметр("БронируетОтбор", БронируетОтбор);
	ТЗ_Заявки = Запрос.Выполнить().Выгрузить();

	Если ТЗ_Заявки.Количество() = 0 Тогда Перейти ~ПРОДОЛЖИТЬ_ДатаОтчетаПо; КонецЕсли;
	
		Область = Макет.ПолучитьОбласть("ЗаголовокСтрока");
	Дата = Формат(Дата_П, "ДФ='дд.МММ гг'" );  
	Область.Параметры.Дата = Дата;	
	ПолеОтчета.Вывести(Область, 1);
	
	ИтогиДень.КоличествоСтатус = 0;;
	ИтогиДень.КоличествоНочей = 0;
	ИтогиДень.КоличествоСутокТариф = 0;
	ИтогиДень.СуммаЦенаПроживание = 0;
	ИтогиДень.СуммаПроживание = 0;
	ИтогиДень.СуммаНомера = 0;
	ИтогиДень.СуммаОплаты = 0;
	ИтогиДень.СуммаЭквайринга = 0;
	ИтогиДень.СуммаКомиссии = 0;
	ИтогиДень.ПолнаяСуммаКомиссии = 0;
	
	ИтогиДень.КоличествоСтатус = 0;;
	
	УслугиДеньИтоги = ИтогиДень.УслугиДеньИтоги;
	Для Каждого Строка Из УслугиДеньИтоги Цикл
		НоваяСтрока.СуммаУслуги = 0;	
	КонецЦикла;
	
	Для Каждого СтрокаЗаявка Из ТЗ_Заявки Цикл
		КоличествоНочей = 0;
		КоличествоСутокТариф = 0;
		СуммаЦенаПроживание = 0;
		СуммаПроживание = 0;
		СуммаНомера = 0;
		СуммаОплаты = 0;
		СуммаЭквайринга = 0;
		СуммаКомиссии = 0;
		ПолнаяСуммаКомиссии = 0;
		
		ТЗ_УслугиИтого = Неопределено;
		
		Если НЕ ЗначениеЗаполнено(СтрокаЗаявка.Заявка) Тогда Продолжить; КонецЕсли;
		Если СтрокаЗаявка.Заявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования Тогда Продолжить; КонецЕсли;
		
		//Если СтрокаЗаявка.Заявка.НомерВРезерв.Наименование <> "Номер 212 / Б" Тогда Продолжить; КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
		                      |	ЗаявкаНаБронированиеПроживание.ГУИД КАК ГУИД,
		                      |	ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
		                      |	ЗаявкаНаБронированиеПроживание.Тариф КАК Тариф,
		                      |	ЗаявкаНаБронированиеПроживание.Сумма КАК Сумма,
		                      |	ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидки,
		                      |	ЗаявкаНаБронированиеПроживание.ПроцентСкидкиКлиента КАК ПроцентСкидкиКлиента,
		                      |	ЗаявкаНаБронированиеПроживание.Цена КАК Цена,
		                      |	ЗаявкаНаБронированиеПроживание.Количество КАК Количество
		                      |ИЗ
		                      |	Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
		                      |ГДЕ
		                      |	ЗаявкаНаБронированиеПроживание.Ссылка = &Заявка
		                      |	И ЗаявкаНаБронированиеПроживание.ДеньПроживания = &ДеньПроживания");
		
		Запрос.УстановитьПараметр("Заявка", СтрокаЗаявка.Заявка);
		Запрос.УстановитьПараметр("ДеньПроживания", Дата_П);
		ТЗ_Проживание = Запрос.Выполнить().Выгрузить(); 		
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
		                      |	ЗаявкаНаБронированиеДопУслуги.ГУИД КАК ГУИД,
		                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
		                      |	ЗаявкаНаБронированиеДопУслуги.Цена КАК Цена,
		                      |	ЗаявкаНаБронированиеДопУслуги.Количество КАК Количество,
		                      |	ЗаявкаНаБронированиеДопУслуги.ВСчет КАК ВСчет,
		                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
		                      |	ЗаявкаНаБронированиеДопУслуги.Услуга.Родитель КАК УслугаРодитель,
		                      |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК Сумма,
		                      |	ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД
		                      |ИЗ
		                      |	Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
		                      |		ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка
		                      |			И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД
		                      |ГДЕ
		                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка = &Заявка
		                      |	И ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
		                      |	И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги = &ДеньПроживания");
		
		Запрос.УстановитьПараметр("Заявка", СтрокаЗаявка.Заявка);
		Запрос.УстановитьПараметр("ДеньПроживания", Дата_П);
		//Запрос.УстановитьПараметр("СледующийДеньПроживания", Дата_П + 24*3600);
		ТЗ_Услуги = Запрос.Выполнить().Выгрузить(); 		
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
		                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
		                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
		                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга КАК Услуга,
		                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
		                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
		                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Сумма
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК СуммаДокументОплатыКасса,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
		                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК СуммаНаличные,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
		                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК СуммаКарта,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
		                      |			ТОГДА 4
		                      |		ИНАЧЕ ВЫБОР
		                      |				КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
		                      |					ТОГДА 3
		                      |				ИНАЧЕ ВЫБОР
		                      |						КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные = 0
		                      |								И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта > 0
		                      |							ТОГДА 1
		                      |						ИНАЧЕ ВЫБОР
		                      |								КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные > 0
		                      |										И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта = 0
		                      |									ТОГДА 2
		                      |								ИНАЧЕ 0
		                      |							КОНЕЦ
		                      |					КОНЕЦ
		                      |			КОНЕЦ
		                      |	КОНЕЦ КАК ТипОплаты,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
		                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ЭтоЭквайринг
		                      |		ИНАЧЕ ЛОЖЬ
		                      |	КОНЕЦ КАК ЭтоЭквайринг,
		                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Сумма КАК СуммаДокументаОплаты
		                      |ИЗ
		                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
		                      |ГДЕ
		                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = &Заявка");
		
		Запрос.УстановитьПараметр("Заявка", СтрокаЗаявка.Заявка);
		ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();	
		
		ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайринга");
		Для Каждого Строка Из ТЗ_Оплаты Цикл
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			                  |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга
			                  |ИЗ
			                  |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
			                  |ГДЕ
			                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
			                  |
			                  |УПОРЯДОЧИТЬ ПО
			                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

			Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

			ТЗ = Запрос.Выполнить().Выгрузить();
			ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
			
			Строка.ПроцентЭквайринга = ПроцентЭквайринга;
		КонецЦикла;
		
		ТЗ_ПроживаниеКоличество = ТЗ_Проживание.Количество();
		Если ТЗ_ПроживаниеКоличество = 0 Тогда Перейти ~УСЛУГИ; КонецЕсли;
		
		Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");

		Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
		Область.Параметры.Дата = Дата;		

		Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
		Область.Параметры.Месяц = Месяц;		

		ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
		Область.Параметры.ДеньНедели = ДеньНедели;
			
		НомерНаименование = СтрокаЗаявка.НомерВРезерв.Наименование;
		Область.Параметры.Номер = НомерНаименование;
		Область.Параметры.РасшифровкаНомер = СтрокаЗаявка.Заявка;

		КатегорияНомера = СтрокаЗаявка.НомерВРезерв.КатегорияНомера;
		Область.Параметры.КатегорияНомера = КатегорияНомера;

		Область.Параметры.КоличествоЧеловек = СтрокаЗаявка.КолВоЧеловек;
		
		Область.Параметры.Статус = СтрокаЗаявка.Статус;
	
		Бронирует = СтрокаЗаявка.Бронирует;
		ЭтоЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Бронирует);
		Если ЭтоЮрЛицо Тогда
			Область.Параметры.Бронирует = Бронирует;
			Область.Параметры.РасшифровкаБронирует = Бронирует;
		КонецЕсли;
		
		Область.Параметры.БронируетИНН = Бронирует.ИНН;
		
		//ТЗ_ПроживаниеИтого = ТЗ_Проживание.Скопировать();
		//ТЗ_ПроживаниеИтого.Свернуть("ДеньПроживания", "Цена, СуммаБезСкидки, Сумма, Количество"); 
		//
		//СтрокаПроживание = ТЗ_ПроживаниеИтого[0];
		//Цена = Окр(СтрокаПроживание.Цена / ТЗ_ПроживаниеКоличество, 2);
		//СтрокаПроживание.Цена = Цена; 		
		
		//ЦенаПроживание = ЦенаПроживание(СтрокаПроживание);
		СтрокаПроживание = ТЗ_Проживание[0];
		
		ЦенаПроживание = СтрокаПроживание.Цена;
		Область.Параметры.ЦенаПроживание = ЦенаПроживание;
			
		КоличествоСутокТариф = СтрокаПроживание.Количество;
		Область.Параметры.КоличествоСутокТариф = КоличествоСутокТариф;
			
		Счета = СтрокаЗаявка.Заявка.Счета;		
		
		//ПроцентКомиссии = СтрокаЗаявка.Бронирует.ПроцентКомиссии;
		ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(СтрокаЗаявка.Бронирует, СтрокаЗаявка.РезервС); //, СтрокаЗаявка.Заявка.В2В);
		Если СтрокаЗаявка.Бронирует.Турагентство Тогда
			СуммаПроживание = СтрокаПроживание.СуммаБезСкидки;
			
			ПолнаяСуммаКомиссии = Окр(СтрокаПроживание.СуммаБезСкидки * ПроцентКомиссии/100, 2); 
			
			ПолнаяСуммаКомиссииУслуги = 0;
			//ОтборСтроки = Новый Структура("Контрагент", СтрокаЗаявка.Бронирует);  
			//НайденныеСтроки = Счета.НайтиСтроки(ОтборСтроки);
			//Если НайденныеСтроки.Количество() > 0 Тогда
				Счета = СтрокаЗаявка.Заявка.Счета;
				Для Каждого СтрокаСчета Из Счета Цикл
					ОтборСтроки = Новый Структура("СчетГУИД", СтрокаСчета.СчетГУИД);  
					НайденныеСтрокиУслуги = ТЗ_Услуги.НайтиСтроки(ОтборСтроки);
					Для Каждого СтрокаУслуги Из НайденныеСтрокиУслуги Цикл
						
						Если СтрокаУслуги.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ 
						ИЛИ СтрокаУслуги.Услуга.Родитель.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ 
						Тогда 
	   						ПолнаяСуммаКомиссииУслуги = ПолнаяСуммаКомиссииУслуги + Окр(СтрокаУслуги.Сумма * ПроцентКомиссии/100, 2);;						
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;                       
			//КонецЕсли;
			
			ПолнаяСуммаКомиссии = ПолнаяСуммаКомиссии + ПолнаяСуммаКомиссииУслуги;
		Иначе	
			СуммаПроживание = СтрокаПроживание.Сумма;
			
			ПолнаяСуммаКомиссии = 0; 
		КонецЕсли;
		Область.Параметры.СуммаПроживание = СуммаПроживание;
		Если ПолнаяСуммаКомиссии > 0 Тогда Область.Параметры.ПолнаяСуммаКомиссии = ПолнаяСуммаКомиссии; КонецЕсли;

		Если СтрокаЗаявка.Оплачивает = СтрокаЗаявка.Бронирует Тогда
			СуммаКомиссии = 0; 
		Иначе	
			СуммаКомиссии = ПолнаяСуммаКомиссии;
		КонецЕсли;
		Если СуммаКомиссии > 0 Тогда Область.Параметры.СуммаКомиссии = СуммаКомиссии; КонецЕсли;

		СуммаОплаты = 0;
		СуммаЭквайринга = 0;
		Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
			ВСписке = ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Проживание);
			Если ВСписке Тогда   
				СуммаОплаты = СуммаОплаты + СтрокаОплаты.СуммаОплаты;		
				
				СуммаЭквайринга = СуммаЭквайринга + СуммаЭквайринга(СтрокаОплаты) ;					
			КонецЕсли;
			
			ВСписке = ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Услуги);
			Если ВСписке Тогда   
				СуммаОплаты = СуммаОплаты + СтрокаОплаты.СуммаОплаты;	
				
				СуммаЭквайринга = СуммаЭквайринга + СуммаЭквайринга(СтрокаОплаты) ;					
			КонецЕсли;
		КонецЦикла;
		Область.Параметры.СуммаОплаты = СуммаОплаты;
		Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;
		
		СуммаЭквайрингаПроживание = 0;
		Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
			Для Каждого СтрокаПроживание Из ТЗ_Проживание Цикл 
				Если СтрокаПроживание.ГУИД = СтрокаОплаты.ДолгиГУИД Тогда
					СуммаЭквайрингаПроживание = СуммаЭквайрингаПроживание + СуммаЭквайринга(СтрокаОплаты);			
				КонецЕсли;		
			КонецЦикла;
			
			СуммаЭквайрингаПроживание_Услуги = 0;
			Для Каждого СтрокаСчет Из СтрокаЗаявка.Заявка.Счета Цикл
				Если НЕ СтрокаЗаявка.Бронирует.Турагентство Тогда
					ОтборСтрокиУслуги = Новый Структура("ГУИД, СчетГУИД", СтрокаОплаты.ДолгиГУИД, СтрокаСчет.СчетГУИД);
					НайденныеУслуги = ТЗ_Услуги.НайтиСтроки(ОтборСтрокиУслуги);
					Для Каждого СтрокаУслуга Из НайденныеУслуги Цикл 
						Если СтрокаУслуга.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ
						ИЛИ СтрокаУслуга.Услуга.Родитель.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ
						Тогда 
							СуммаЭквайрингаПроживание_Услуги = СуммаЭквайрингаПроживание_Услуги + СуммаЭквайринга(СтрокаОплаты);			
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			СуммаЭквайрингаПроживание = СуммаЭквайрингаПроживание + СуммаЭквайрингаПроживание_Услуги;
		КонецЦикла;
		
		СуммаНомера = СуммаПроживание - СуммаЭквайрингаПроживание - ПолнаяСуммаКомиссии;
		Область.Параметры.СуммаНомера = СуммаНомера;
		
		ПолеОтчета.Вывести(Область, 2);		
			
~УСЛУГИ:
		ТЗ_УслугиИтого = ТЗ_Услуги.Скопировать();
		ТЗ_УслугиИтого.Свернуть("ДатаУслуги, УслугаРодитель", "Сумма");
		
		Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
			ЕстьСтрока = Ложь;
			Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
				Если СтрокаУслугиИтого.УслугаРодитель = СтрокаРодительУслуги.Родитель Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("Строка|КолонкаУслуги");
			Если ЕстьСтрока Тогда
				Если СтрокаУслугиИтого.Сумма <> 0 Тогда
					Область.Параметры.СуммаУслуги = СтрокаУслугиИтого.Сумма;
				КонецЕсли;	
			КонецЕсли;
			
			ПолеОтчета.Присоединить(Область);
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Строка|КолонкиПраво");
		
		Область.Параметры.ЗаявкаСсылка = СтрокаЗаявка.Заявка;
		Область.Параметры.РасшифровкаЗаявка = СтрокаЗаявка.Заявка;
		Область.Параметры.КоличествоСчетов = СтрокаЗаявка.КоличествоСчетов;
		
		ВыведеннаяОбласть = ПолеОтчета.Присоединить(Область);
		//ВыведеннаяОбласть = ТД.Вывести(Обл);
		//Сообщить("Я вывелась тут: R" + (ВыведеннаяОбласть.Верх) + "C"+(ВыведеннаяОбласть.Лево+1));		
//

		Если СтрокаЗаявка.КоличествоСчетов = 0 Тогда 
			Для Индекс = 0 По КоличествоКолонок - 1 Цикл 
				ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).ЦветФона = Новый Цвет(220, 220, 220);
			КонецЦикла	
		КонецЕсли;

		СуммаУслуги_П = ТЗ_Услуги.Итог("Сумма");
		СуммаПроживание_П = СтрокаПроживание.Сумма; 
		
		Если СуммаПроживание_П + СуммаУслуги_П <> СуммаОплаты Тогда 
			Для Индекс = 0 По КоличествоКолонок - 1 Цикл 
				ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).Шрифт 
				 //= Новый Шрифт(ОбластьОформления.Шрифт, ОбластьОформления.Шрифт.Размер, ,Истина);
				 	= Новый Шрифт("Arial", 8, ,Истина);
				ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).ЦветТекста = Новый Цвет(255, 0, 0);
			КонецЦикла;	
		КонецЕсли;

// ОПЛАТЫ
		Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
			Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
			
			Область.Параметры.ТипОплаты = ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
			Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
			Область.Параметры.СуммаОплаты = СтрокаОплаты.СуммаОплаты;
			
			Область.Параметры.СуммаЭквайринга = СуммаЭквайринга(СтрокаОплаты);

			Если СтрокаОплаты.Услуга Тогда
				
				Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
					ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ДолгиГУИД);
					НайденныеСтроки = ТЗ_Услуги.НайтиСтроки(ОтборСтроки);
					
					ЕстьСтрока = Ложь;
					Для Каждого Строка Из НайденныеСтроки Цикл
						Если Строка.УслугаРодитель = СтрокаРодительУслуги.Родитель Тогда
							ЕстьСтрока = Истина;
							
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если ЕстьСтрока Тогда Прервать;  КонецЕсли;
				КонецЦикла;	
				
				Если ЕстьСтрока Тогда  
					ПолеОтчета.Вывести(Область);
				КонецЕсли;
				
				Если ЕстьСтрока Тогда 
					Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
						ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ДолгиГУИД);
						НайденныеСтроки = ТЗ_Услуги.НайтиСтроки(ОтборСтроки);
						
						ЕстьСтрока = Ложь;
						Для Каждого Строка Из НайденныеСтроки Цикл
							Если Строка.УслугаРодитель = СтрокаРодительУслуги.Родитель Тогда
								ЕстьСтрока = Истина;
								
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
						Если ЕстьСтрока Тогда
							ОбластьУслуги.Параметры.СуммаУслуги = СтрокаОплаты.СуммаОплаты;
						КонецЕсли;
						
						ПолеОтчета.Присоединить(ОбластьУслуги);
					КонецЦикла;
				КонецЕсли;
			Иначе
				ВСписке = ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Проживание); 
				Если ВСписке Тогда 
					Область.Параметры.СуммаПроживание = СтрокаОплаты.СуммаОплаты;
					ПолеОтчета.Вывести(Область);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
////
		ИтогиДень.КоличествоНочей = ИтогиДень.КоличествоНочей + 1;
		ИтогиДень.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф + КоличествоСутокТариф;
		
		ИтогиДень.СуммаЦенаПроживание = ИтогиДень.СуммаЦенаПроживание + ЦенаПроживание;
		ИтогиДень.СуммаПроживание = ИтогиДень.СуммаПроживание + СуммаПроживание;
		
		ИтогиДень.СуммаНомера = ИтогиДень.СуммаНомера + СуммаНомера;
		
		ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
		
		ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
		
		ИтогиДень.СуммаКомиссии = ИтогиДень.СуммаКомиссии + СуммаКомиссии;
		ИтогиДень.ПолнаяСуммаКомиссии = ИтогиДень.ПолнаяСуммаКомиссии + ПолнаяСуммаКомиссии;
		
		Если СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
		ИЛИ СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования 
		Тогда 
			ИтогиДень.КоличествоСтатус = ИтогиДень.КоличествоСтатус + 1;
		КонецЕсли;
		
		Если ТЗ_УслугиИтого <> Неопределено Тогда 
			Для Каждого СтрокаУслугиДеньИтого Из ИтогиДень.УслугиДеньИтоги Цикл 
				ЕстьСтрока = Ложь;
				Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
					Если СтрокаУслугиИтого.УслугаРодитель = СтрокаРодительУслуги.Родитель Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
				КонецЦикла;
				
				Если ЕстьСтрока Тогда 
					Если СтрокаУслугиИтого.Сумма <> 0 Тогда
						СтрокаУслугиДеньИтого.СуммаУслуги = СтрокаУслугиДеньИтого.СуммаУслуги + СтрокаУслугиИтого.Сумма;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ИтогиДень");
	
	Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
	Область.Параметры.Дата = Дата;		

	Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
	Область.Параметры.Месяц = Месяц;		

	ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
	Область.Параметры.ДеньНедели = ДеньНедели;

	Область.Параметры.Номер = "Итого Ночей:";
	Область.Параметры.КатегорияНомера = ИтогиДень.КоличествоНочей;
	Область.Параметры.ЦенаПроживание = ИтогиДень.СуммаЦенаПроживание;
	Область.Параметры.СуммаПроживание = ИтогиДень.СуммаПроживание;
	Область.Параметры.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф;
	Область.Параметры.СуммаКомиссии = ИтогиДень.СуммаКомиссии;
	Область.Параметры.ПолнаяСуммаКомиссии = ИтогиДень.ПолнаяСуммаКомиссии;
	Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
	Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
	Область.Параметры.СуммаНомера = ИтогиДень.СуммаНомера;
	
	Область.Параметры.КоличествоСтатус = ИтогиДень.КоличествоСтатус;
	ПолеОтчета.Вывести(Область, 1);
	
	Область = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
	Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
		Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
			Область.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
		КонецЕсли;	
		ПолеОтчета.Присоединить(Область);
	КонецЦикла;

//
	Итоги.КоличествоНочей = Итоги.КоличествоНочей + ИтогиДень.КоличествоНочей;
	Итоги.КоличествоСутокТариф = Итоги.КоличествоСутокТариф + ИтогиДень.КоличествоСутокТариф;
	
	Итоги.СуммаЦенаПроживание = Итоги.СуммаЦенаПроживание + ИтогиДень.СуммаЦенаПроживание;
	Итоги.СуммаПроживание = Итоги.СуммаПроживание + ИтогиДень.СуммаПроживание;
	
	Итоги.СуммаНомера = Итоги.СуммаНомера + ИтогиДень.СуммаНомера;
	
	Итоги.СуммаОплаты = Итоги.СуммаОплаты + ИтогиДень.СуммаОплаты;
	
	Итоги.СуммаЭквайринга = Итоги.СуммаЭквайринга + ИтогиДень.СуммаЭквайринга;  
	
	Итоги.СуммаКомиссии = Итоги.СуммаКомиссии + ИтогиДень.СуммаКомиссии;
	Итоги.ПолнаяСуммаКомиссии = Итоги.ПолнаяСуммаКомиссии + ИтогиДень.ПолнаяСуммаКомиссии;
	
	Для Индекс = 0 По Итоги.УслугиИтоги.Количество() - 1 Цикл
		Итоги.УслугиИтоги[Индекс].СуммаУслуги = Итоги.УслугиИтоги[Индекс].СуммаУслуги 
			+ ИтогиДень.УслугиДеньИтоги[Индекс].СуммаУслуги;		
	КонецЦикла;
	
	Итоги.КоличествоСтатус = Итоги.КоличествоСтатус + ИтогиДень.КоличествоСтатус;

~ПРОДОЛЖИТЬ_ДатаОтчетаПо:	
	Дата_П = Дата_П + 60*60*24;	
КонецЦикла;	
ПолеОтчета.ЗакончитьАвтогруппировкуСтрок();

Область = Макет.ПолучитьОбласть("Итоги");

Область.Параметры.ИтогиДаты = "Период с " + Формат(ДатаОтчетаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаОтчетаПо, "ДФ=dd.MM.yy");

Область.Параметры.Номер = "Итого Ночей:";
Область.Параметры.КатегорияНомера = Итоги.КоличествоНочей;
Область.Параметры.ЦенаПроживание = Итоги.СуммаЦенаПроживание;
Область.Параметры.СуммаПроживание = Итоги.СуммаПроживание;
Область.Параметры.КоличествоСутокТариф = Итоги.КоличествоСутокТариф;
//Область.Параметры.СуммаТранспортныеУслуги = Итоги.СуммаТранспортныеУслуги;
//Область.Параметры.СуммаПроживаниеУслуги = Итоги.СуммаПроживаниеУслуги;
//Область.Параметры.СуммаЗавтракиУслуги = Итоги.СуммаЗавтракиУслуги;
Область.Параметры.СуммаКомиссии = Итоги.СуммаКомиссии;
Область.Параметры.ПолнаяСуммаКомиссии = Итоги.ПолнаяСуммаКомиссии;
Область.Параметры.СуммаОплаты = Итоги.СуммаОплаты;
Область.Параметры.СуммаЭквайринга = Итоги.СуммаЭквайринга;
Область.Параметры.СуммаНомера = Итоги.СуммаНомера;

Область.Параметры.КоличествоСтатус = ИтогиДень.КоличествоСтатус;

ПолеОтчета.Вывести(Область, 1);

Область = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
Для Каждого СтрокаУслугиИтого Из Итоги.УслугиИтоги Цикл
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		Область.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(Область);
КонецЦикла;

ПолеОтчета.Вывести(Область, 1);

ПолеОтчета.Область(, КоличествоКолонок, ,КоличествоКолонок + 2).Видимость = Ложь;

Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
КолонкаИНН = Область.ШиринаТаблицы;
ПолеОтчета.Область(, КолонкаИНН, ,КолонкаИНН).Видимость = Ложь;   

КонецПроцедуры

&НаСервере
Функция ВСписке(Значение, Имя, Список) 	
ВСписке = Ложь;	
Для Каждого Строка Из Список Цикл
	Если Строка[Имя] = Значение Тогда 
		ВСписке = Истина;	
		Прервать;
	КонецЕсли;
КонецЦикла;

Возврат ВСписке;
КонецФункции

&НаСервере
Функция ЦенаПроживание(ТекущаяСтрока) 	
ЦенаПроживание = ТекущаяСтрока.Цена;
//ЦенаПроживание = ТекущаяЗаявка.ЦенаПроживание*(1 - ТекущаяЗаявка.ПроцентСкидкиКлиента/100);
Возврат ЦенаПроживание;
КонецФункции

&НаСервере
Функция СуммаЭквайринга(Строка)
ТипОплаты = Строка.ТипОплаты;

Если ТипОплаты = 1	Тогда 
	Сумма = Строка.СуммаОплаты;
ИначеЕсли ТипОплаты = 0	Тогда 
	Сумма = Окр(Строка.СуммаОплаты * (Строка.СуммаКарта / Строка.СуммаДокументаОплаты), 2);
ИначеЕсли ТипОплаты = 3	Тогда 
	Если Строка.ЭтоЭквайринг Тогда
		Сумма = Строка.СуммаОплаты;
	Иначе
		Сумма = 0; 
	КонецЕсли;
Иначе
	Сумма = 0; 
КонецЕсли;

СуммаЭквайринга = Окр(Сумма * Строка.ПроцентЭквайринга / 100, 2);     

Возврат СуммаЭквайринга; 
КонецФункции	

&НаСервере
Функция ТипОплатыНаименование(ТипОплаты)
Если ТипОплаты = 0 Тогда	
	Возврат "смеш.";
ИначеЕсли ТипОплаты = 1 Тогда	
	Возврат "к/к";
ИначеЕсли ТипОплаты = 2 Тогда	
	Возврат "нал";
ИначеЕсли ТипОплаты = 3 Тогда	
	Возврат "б/н";
ИначеЕсли ТипОплаты = 4 Тогда	
	Возврат "п/о";
КонецЕсли;

Возврат "";	
КонецФункции



