
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаС = ТекущаяДата();	
ДатаПо = ТекущаяДата();	
	
КомпоновщикНастроек_Элементы = ЭтаФорма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;	
КомпоновщикНастроек_Элементы[0].ПравоеЗначение = ДатаС; //'20240101';
КомпоновщикНастроек_Элементы[1].ПравоеЗначение = ДатаПо; //'20241201';

ДатаЗадания = ТекущаяДата();

Запрос = новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентовАналитика.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЦеныКонкурентовАналитика КАК ЦеныКонкурентовАналитика
                      |ГДЕ
                      |	ЦеныКонкурентовАналитика.ПометкаУдаления = ЛОЖЬ
                      |	И ЦеныКонкурентовАналитика.ДатаЗадания = &ДатаЗадания");

Запрос.УстановитьПараметр("ДатаЗадания", ДатаЗадания);
Результат = Запрос.Выполнить();

Если НЕ Результат.Пустой() Тогда
	КоманднаяПанель_ПодчиненныеЭлементы = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы;
	ЭлементСоздать = КоманднаяПанель_ПодчиненныеЭлементы.Найти("ФормаСоздать");
	ЭлементСоздать.Доступность = Ложь;
КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
КомпоновщикНастроек_Элементы = ЭтаФорма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;	
КомпоновщикНастроек_Элементы[0].ПравоеЗначение = ДатаС;
КонецПроцедуры


&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
КомпоновщикНастроек_Элементы = ЭтаФорма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;	
КомпоновщикНастроек_Элементы[1].ПравоеЗначение = ДатаПо;
КонецПроцедуры

