
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = Истина;

Список.ТекстЗапроса = ГрупповойСчетСервер.ЗапросТекстОтборСчетовЗаявокГрупповойСчет();
	
Параметры.Свойство("Контрагент", КонтрагентОтбор); 

ГрупповойСчет = Неопределено;
Параметры.Свойство("ГрупповойСчет", ГрупповойСчет); 

Параметры.Свойство("ТолькоПроживание", ТолькоПроживание); 
Параметры.Свойство("ТолькоУслуги", ТолькоУслуги); 

Параметры.Свойство("ДатаС", ДатаС); 
Параметры.Свойство("ДатаПо", ДатаПо); 

Если НЕ Параметры.Свойство("Неоплачено", Неоплачено) Тогда Неоплачено = Истина; КонецЕсли; 

Список.Параметры.УстановитьЗначениеПараметра("КонтрагентОтбор", КонтрагентОтбор);
Список.Параметры.УстановитьЗначениеПараметра("ТолькоПроживание", ТолькоПроживание);
Список.Параметры.УстановитьЗначениеПараметра("ТолькоУслуги", ТолькоУслуги);

Если ТолькоПроживание Тогда
	Элементы.ДекорацияТолькоПроживаниеТолькоУслуги.Заголовок = "Только проживание";
	Элементы.СуммаУслуги.Видимость = Ложь;
	//Элементы.СуммаДолг.Видимость = Ложь;
ИначеЕсли ТолькоУслуги Тогда
	Элементы.ДекорацияТолькоПроживаниеТолькоУслуги.Заголовок = "Только услуги";
	Элементы.СуммаПроживание.Видимость = Ложь;
	//Элементы.СуммаДолг.Видимость = Ложь;
Иначе
	Элементы.ДекорацияТолькоПроживаниеТолькоУслуги.Заголовок = "Проживание и услуги";
	//Элементы.СуммаУслуги.Видимость = Ложь;
	//Элементы.СуммаПроживание.Видимость = Ложь;
КонецЕсли;

УсловноеОформлениеЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Список.Параметры.УстановитьЗначениеПараметра("РезервС", ДатаС);
УстановитьЗначениеПараметраДатаПо();
	
УстановитьОтборНеоплачено();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНеоплачено()
ИмяПоля = "СуммаОплаты"; Значение_П = 0; РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
Если Неоплачено Тогда	
	ВидСравнения_П = ВидСравненияКомпоновкиДанных.Равно;
Иначе
	ВидСравнения_П = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
КонецЕсли;	
УстановитьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля, Значение_П, ВидСравнения_П, РежимОтображения);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля, Значение, ВидСравнения, РежимОтображения)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				 Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если СуществующийЭлементОтбора = Неопределено Тогда
			НовыйЭлементОтбора = ПользовательскийОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
	
		НовыйЭлементОтбора.ВидСравнения = ВидСравнения;
		НовыйЭлементОтбора.Использование = Истина;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		НовыйЭлементОтбора.РежимОтображения = РежимОтображения;
		НовыйЭлементОтбора.ПравоеЗначение = Значение;
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеЗагрузить()
УсловноеОформление.Элементы.Очистить();

ЭлементыТабНаФормеИмя = Элементы.Список.Имя;

ПутьКПолюОтбора = "Список.СуммаОплаты";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Больше;
ПравоеЗначение = 0;
Web_Цвета = WebЦвета.БледноЛиловый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	,ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета );
КонецПроцедуры

//
&НаКлиенте
Процедура КонтрагентОтборПриИзменении(Элемент)
КонтрагентОтборПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентОтборПриИзмененииНаСервере()
Список.Параметры.УстановитьЗначениеПараметра("КонтрагентОтбор", КонтрагентОтбор);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
Список.Параметры.УстановитьЗначениеПараметра("РезервС", ДатаС);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
УстановитьЗначениеПараметраДатаПо();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПараметраДатаПо()
РезервПо_П = ?(ЗначениеЗаполнено(ДатаПо), ДатаПо, '30010101'); 
Список.Параметры.УстановитьЗначениеПараметра("РезервПо", РезервПо_П);
КонецПроцедуры
//

//
&НаКлиенте
Процедура НеоплаченоПриИзменении(Элемент)
УстановитьОтборНеоплачено();
КонецПроцедуры
//

&НаКлиенте
Процедура Выбрать(Команда)
Если Элементы.Список.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли; 

ВыборОповестить();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если Элементы.Список.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли; 

ВыборОповестить();
КонецПроцедуры

&НаКлиенте
Процедура ВыборОповестить()
ТекущиеДанные = Элементы.Список.ТекущиеДанные;
Результат = Новый Структура("ЗаявкаСсылка, СчетГУИД, ТолькоПроживание, ТолькоУслуги"
	, ТекущиеДанные.Ссылка, ТекущиеДанные.СчетГУИД, ТолькоПроживание, ТолькоУслуги);
ОповеститьОВыборе(Результат);

Элементы.Список.Обновить();
КонецПроцедуры




