
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("Авто", Отчет.Авто);

Отчет.ДатаС = ТекущаяДата();
Отчет.ДатаПо = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если Отчет.Авто тогда
	ОтчетАвто();
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетАвто()
Если Отчет.Авто тогда
	Отчет.ДатаС=НачалоДня(ТекущаяДата()-86400);
	Отчет.ДатаПо=НачалоДня(ТекущаяДата());
	
	ВыполнитьКоманда(Неопределено);
	
	//ЭлементыФормы.ПолеОтчета.Записать("C:\1c_base\rep\Gorn.xls",ТипФайлаТабличногоДокумента.XLS97);
	
	ИмяФайла = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
	ИмяФайла = ИмяФайла + "rep\Gorn.xls"; 
	
	//ПолеОтчета.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS97);
	ДопПараметры = Новый Структура("ИмяФайла", ИмяФайла);
	Оповещение = Новый ОписаниеОповещения("ЗавершитьЗаписьФайла", ЭтаФорма, ДопПараметры);
	ПолеОтчета.НачатьЗапись(Оповещение, ИмяФайла,ТипФайлаТабличногоДокумента.XLS97);
	
	//ОтправитьМылом("Отчет горничных за "+ Формат(ТекущаяДата()-86400, "ДФ=dd.MM.yy")
	//	,"C:\1c_base\rep\Gorn.xls", "", "guz@agent5.ru");
конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаписьФайла(Результат, ДополнительныеПараметры) Экспорт
ИмяФайла = ДополнительныеПараметры.ИмяФайла; 
	
//ОтправитьМылом("Отчет горничных за "+ Формат(ТекущаяДата()-86400, "ДФ=dd.MM.yy")
//	,ИмяФайла, "", "guz@agent5.ru");
//ОбщийМодульСлужебныеСервер.ОтправитьМылом_ОбщийОтчетПоГорничным("Отчет горничных за "+ Формат(ТекущаяДата()-86400, "ДФ=dd.MM.yy")
//	,ИмяФайла, "", "guz@agent5.ru");

Получатели = Новый СписокЗначений;
Получатели.Добавить("postnikov_sn@invina.ru");
//Получатели.Добавить("Kantorov_EE@invina.ru");
//Получатели.Добавить("arestova_ov@invina.ru");
//Получатели.Добавить("isaeva_js@invina.ru");

Файлы = Новый СписокЗначений;
Файлы.Добавить("ИмяФайла");

СлужебныеСервер.ОтправитьМейлом("Отчет горничных за "+ Формат(ТекущаяДата()-86400, "ДФ=dd.MM.yy")
	,Файлы, Получатели);
КонецПроцедуры	
//

//
&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
ОбменГорничныеСервер.ЗагрузитьОбслуживаниеПомещений(Отчет.ДатаС, Отчет.ДатаПо);	

СформироватьОбщийСтраница();
КонецПроцедуры
//

////
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	СформироватьТекущий();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекущий()
	Имя=Элементы.Страницы.ТекущаяСтраница.Имя;
	Выполнить("Сформировать"+Имя+"()");
	
	ПолеОтчета.ФиксацияСверху = 1;
КонецПроцедуры

&НаСервере
Процедура СформироватьОбщийСтраница()
ЗапросТекст = "ВЫБРАТЬ
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка КАК Ссылка,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.ДатаОбслуживания КАК ДатаОбслуживания,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.НомерОбслуживания_пп КАК НомерОбслуживания_пп,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.Горничная КАК Горничная,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.РучноеИзменение КАК РучноеИзменение,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.ГорничныеПомещение КАК ГорничныеПомещение,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.ГорничныеПомещение.Наименование КАК ГорничныеПомещениеНаименование,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.ВремяУборки КАК ВремяУборки,
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Обслужено КАК Обслужено
              |ИЗ
              |	Документ.ГорничныеОбслуживаниеПомещения.ПомещенияУборки КАК ГорничныеОбслуживаниеПомещенияПомещенияУборки
              |ГДЕ
              |	ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.ПометкаУдаления = ЛОЖЬ
              |	И ГорничныеОбслуживаниеПомещенияПомещенияУборки.Обслужено = ИСТИНА
              |	И ГорничныеОбслуживаниеПомещенияПомещенияУборки.ВремяУборки МЕЖДУ &ДН И &ДК";

ЗапросТекстОкончание = "
              |УПОРЯДОЧИТЬ ПО
              |	ДатаОбслуживания,
			  | НомерОбслуживания_пп,
			  | Горничная,
              |	ГорничныеПомещениеНаименование";

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекст;
Если ЗначениеЗаполнено(Отчет.Помещение) тогда
	Запрос.Текст = Запрос.Текст + "
		                    |	И ГорничныеОбслуживаниеПомещенияПомещенияУборки.ГорничныеПомещение = &ГорничныеПомещение";
			
	Запрос.УстановитьПараметр("ГорничныеПомещение",Отчет.Помещение);
КонецЕсли;

Если ЗначениеЗаполнено(Отчет.Горничная) тогда
	Запрос.Текст = Запрос.Текст + "
		                    |	И ГорничныеОбслуживаниеПомещенияПомещенияУборки.Ссылка.Горничная = &Горничная";
			
	Запрос.УстановитьПараметр("Горничная",Отчет.Горничная);
КонецЕсли;

Запрос.Текст = Запрос.Текст + ЗапросТекстОкончание;

Запрос.УстановитьПараметр("ДН",Отчет.ДатаС);
Запрос.УстановитьПараметр("Дк",КонецДня(Отчет.ДатаПо));

ТЗ=Запрос.Выполнить().Выгрузить();
   
ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
Макет = ОтчетОбъект.ПолучитьМакет("МакетОбщий");  

ПолеОтчета.Очистить();
ПолеОтчета.ФиксацияСверху = 1;

Шапка=Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(Шапка);

Для каждого Стр Из ТЗ Цикл
	
	Область=Макет.ПолучитьОбласть("Строка");
	               
	Область.Параметры.Дата = Формат(Стр.ДатаОбслуживания, "ДФ=dd.MM.yy");
	Область.Параметры.Номер_пп = Стр.НомерОбслуживания_пп;
	Область.Параметры.Помещение = Стр.ГорничныеПомещениеНаименование;
	Область.Параметры.Горничная = Стр.Горничная;
	                           
	ПолеОтчета.Вывести(Область);     
КонецЦикла;

ПолеОтчета.ФиксацияСверху = 1;
КонецПроцедуры

&НаСервере
Процедура СформироватьОбщийСтраница_1()
ЗапросТекст = "ВЫБРАТЬ
              |	ГорничныеОбслуживаниеПомещения.Ссылка КАК Ссылка,
              |	ГорничныеОбслуживаниеПомещения.ДатаОбслуживания КАК ДатаОбслуживания,
              |	ГорничныеОбслуживаниеПомещения.НомерОбслуживания_пп КАК НомерОбслуживания_пп,
              |	ГорничныеОбслуживаниеПомещения.ГорничныеПомещение КАК ГорничныеПомещение,
              |	ГорничныеОбслуживаниеПомещения.ГорничныеПомещение.Наименование КАК ГорничныеПомещениеНаименование,
              |	ГорничныеОбслуживаниеПомещения.Горничная КАК Горничная,
              |	ГорничныеОбслуживаниеПомещения.РучноеИзменение КАК РучноеИзменение
              |ИЗ
              |	Документ.ГорничныеОбслуживаниеПомещения КАК ГорничныеОбслуживаниеПомещения
              |ГДЕ
              |	ГорничныеОбслуживаниеПомещения.ПометкаУдаления = ЛОЖЬ
              |	И ГорничныеОбслуживаниеПомещения.Обслужено = ИСТИНА
              |	И ГорничныеОбслуживаниеПомещения.ВремяУборки МЕЖДУ &ДН И &ДК";

ЗапросТекстОкончание = "
              |УПОРЯДОЧИТЬ ПО
              |	ДатаОбслуживания,
			  | Горничная,
              |	ГорничныеПомещениеНаименование,
              |	НомерОбслуживания_пп";

Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекст;
Если ЗначениеЗаполнено(Отчет.Помещение) тогда
	Запрос.Текст = ЗапросТекст + "
		                    |	И ГорничныеОбслуживаниеПомещения.ГорничныеПомещение = &ГорничныеПомещение";
			
	Запрос.УстановитьПараметр("ГорничныеПомещение",Отчет.Помещение);
КонецЕсли;
Запрос.Текст = Запрос.Текст + ЗапросТекстОкончание;

Запрос.УстановитьПараметр("ДН",Отчет.ДатаС);
Запрос.УстановитьПараметр("Дк",КонецДня(Отчет.ДатаПо));

ТЗ=Запрос.Выполнить().Выгрузить();
   
ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
Макет = ОтчетОбъект.ПолучитьМакет("МакетОбщий");  

ПолеОтчета.Очистить();
ПолеОтчета.ФиксацияСверху = 1;

Шапка=Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(Шапка);

Для каждого Стр Из ТЗ Цикл
	
	Область=Макет.ПолучитьОбласть("Строка");
	               
	Область.Параметры.Дата = Формат(Стр.ДатаОбслуживания, "ДФ=dd.MM.yy");
	Область.Параметры.Номер_пп = Стр.НомерОбслуживания_пп;
	Область.Параметры.Помещение = Стр.ГорничныеПомещениеНаименование;
	Область.Параметры.Горничная = Стр.Горничная;
	                           
	ПолеОтчета.Вывести(Область);     
КонецЦикла;

ПолеОтчета.ФиксацияСверху = 1;
КонецПроцедуры
////













