

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ПолеОтчета.Очистить();

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

ПолеОтчета.ФиксацияСверху = 2;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

ОтчетОбъект = РеквизитФормыВЗначение("Объект");

МакетИмя = "МакетСтатистика";
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;
//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КатегорииНомеров.Ссылка КАК Категория
					  |ИЗ
                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                      |ГДЕ
                      |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КатегорииНомеров.Номер_пп");

ТЗ_КатегорииНомеров = Запрос.Выполнить().Выгрузить();

ОбластьКатегории = Макет.ПолучитьОбласть("Шапка|КолонкиЦенаКатегория");
ОбластьКатегорииНачало = ОбластьЛево.ШиринаТаблицы + 1; 
ОбластьКатегорииКонец = ОбластьЛево.ШиринаТаблицы; 
Для Каждого Строка Из ТЗ_КатегорииНомеров Цикл
	ОбластьКатегории.Параметры.ШапкаКатегорияНомера = Строка.Категория;
	
	ПолеОтчета.Присоединить(ОбластьКатегории, 0);
	
	ОбластьКатегорииКонец = ОбластьКатегорииКонец + 1;
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;
Если ОбластьКатегорииНачало <= ОбластьКатегорииКонец Тогда
	ПолеОтчета.Область(1, ОбластьКатегорииНачало, 1, ОбластьКатегорииКонец).Объединить();
КонецЕсли;	
//

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Турагентство
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты
                      |ГДЕ
                      |	Клиенты.ПометкаУдаления = ЛОЖЬ
                      |	И Клиенты.Турагентство = ИСТИНА
                      |	И Клиенты.ПоказыватьВСтатистике = ИСТИНА
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Клиенты.Наименование,
                      |	Клиенты.Ссылка");

ТЗ_Турагентства = Запрос.Выполнить().Выгрузить();

ОбластьТурагентства = Макет.ПолучитьОбласть("Шапка|КолонкиТурагентства");
ОбластьТурагентстваНачало = КоличествоКолонок + 1; 
ОбластьТурагентстваКонец = КоличествоКолонок; 
Для Каждого Строка Из ТЗ_Турагентства Цикл
	ОбластьТурагентства.Параметры.ШапкаТурагентство = Строка.Турагентство;
	
	ПолеОтчета.Присоединить(ОбластьТурагентства, 0);
	
	ОбластьТурагентстваКонец = ОбластьТурагентстваКонец + 1;
КонецЦикла;
Если ОбластьТурагентстваНачало <= ОбластьТурагентстваКонец Тогда
	ПолеОтчета.Область(1, ОбластьТурагентстваНачало, 1, ОбластьТурагентстваКонец).Объединить();
КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоНомеров
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд
                      |ГДЕ
                      |	НомернойФонд.ПометкаУдаления = ЛОЖЬ");

ТЗ = Запрос.Выполнить().Выгрузить();
ОбщееКоличествоНомеров = ТЗ[0].КоличествоНомеров;

Итоги = Новый Структура();
Итоги.Вставить("Номеров", 0);
Итоги.Вставить("Гостей", 0);
Итоги.Вставить("ГостейБезЗавтрака", 0);
Итоги.Вставить("ГостейСЗавтраком", 0);
Итоги.Вставить("Романтик", 0);

Итоги.Вставить("ПостоянныхГостей", 0);
Итоги.Вставить("КоличествоНомеров", 0);

Итоги.Вставить("НомеровСоСкидкой_0", 0);
Итоги.Вставить("НомеровСоСкидкой_1_9", 0);
Итоги.Вставить("НомеровСоСкидкой_10_14", 0);
Итоги.Вставить("НомеровСоСкидкой_15_19", 0);
Итоги.Вставить("НомеровСоСкидкой_20", 0);
Итоги.Вставить("НомеровСТарифныйПлан", 0);

Итоги.Вставить("ПостоянныхГостей", 0);

Итоги.Вставить("СуммаНомера", 0);

КатегорииИтоги = Новый ТаблицаЗначений;
КатегорииИтоги.Колонки.Добавить("Категория");
КатегорииИтоги.Колонки.Добавить("СуммаНомера");
КатегорииИтоги.Колонки.Добавить("ПроживаниеКоличество");
Для Каждого Строка Из ТЗ_КатегорииНомеров Цикл
	НоваяСтрока = КатегорииИтоги.Добавить();
	НоваяСтрока.Категория = Строка.Категория;	
	НоваяСтрока.СуммаНомера = 0;	
	НоваяСтрока.ПроживаниеКоличество = 0;	
КонецЦикла;
Итоги.Вставить("КатегорииИтоги", КатегорииИтоги);

ТурагентстваИтоги = Новый ТаблицаЗначений;
ТурагентстваИтоги.Колонки.Добавить("Турагентство");
ТурагентстваИтоги.Колонки.Добавить("НомеровОтТурагентства");
Для Каждого Строка Из ТЗ_Турагентства Цикл
	НоваяСтрока = ТурагентстваИтоги.Добавить();
	НоваяСтрока.Турагентство = Строка.Турагентство;	
	НоваяСтрока.НомеровОтТурагентства = 0;	
КонецЦикла;
Итоги.Вставить("ТурагентстваИтоги", ТурагентстваИтоги);
////

////
ИтогиМесяц = Новый Структура();
Итоги.Вставить("КоличествоНомеров", 0);

ИтогиМесяц.Вставить("Номеров", 0);
ИтогиМесяц.Вставить("Гостей", 0);
ИтогиМесяц.Вставить("ГостейБезЗавтрака", 0);
ИтогиМесяц.Вставить("ГостейСЗавтраком", 0);
ИтогиМесяц.Вставить("Романтик", 0);

ИтогиМесяц.Вставить("ПостоянныхГостей", 0);
ИтогиМесяц.Вставить("КоличествоНомеров", 0);

ИтогиМесяц.Вставить("НомеровСоСкидкой_0", 0);
ИтогиМесяц.Вставить("НомеровСоСкидкой_1_9", 0);
ИтогиМесяц.Вставить("НомеровСоСкидкой_10_14", 0);
ИтогиМесяц.Вставить("НомеровСоСкидкой_15_19", 0);
ИтогиМесяц.Вставить("НомеровСоСкидкой_20", 0);
ИтогиМесяц.Вставить("НомеровСТарифныйПлан", 0);

ИтогиМесяц.Вставить("ПостоянныхГостей", 0);

ИтогиМесяц.Вставить("СуммаНомера", 0);

КатегорииИтогиМесяц = Новый ТаблицаЗначений;
КатегорииИтогиМесяц.Колонки.Добавить("Категория");
КатегорииИтогиМесяц.Колонки.Добавить("СуммаНомера");
КатегорииИтогиМесяц.Колонки.Добавить("ПроживаниеКоличество");
Для Каждого Строка Из ТЗ_КатегорииНомеров Цикл
	НоваяСтрока = КатегорииИтогиМесяц.Добавить();
	НоваяСтрока.Категория = Строка.Категория;	
	НоваяСтрока.СуммаНомера = 0;	
	НоваяСтрока.ПроживаниеКоличество = 0;	
КонецЦикла;
ИтогиМесяц.Вставить("КатегорииИтогиМесяц", КатегорииИтогиМесяц);

ТурагентстваИтогиМесяц = Новый ТаблицаЗначений;
ТурагентстваИтогиМесяц.Колонки.Добавить("Турагентство");
ТурагентстваИтогиМесяц.Колонки.Добавить("НомеровОтТурагентства");
Для Каждого Строка Из ТЗ_Турагентства Цикл
	НоваяСтрока = ТурагентстваИтогиМесяц.Добавить();
	НоваяСтрока.Турагентство = Строка.Турагентство;	
	НоваяСтрока.НомеровОтТурагентства = 0;	
КонецЦикла;
ИтогиМесяц.Вставить("ТурагентстваИтогиМесяц", ТурагентстваИтогиМесяц);
////

КоличествоЗаписей = 0;
КоличествоЗаписейМесяц = 0;


Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаПроживание.ДеньПроживания КАК ДеньПроживания,
                      |	ЗаявкаПроживание.ПроцентСкидкиКлиента КАК ПроцентСкидкиКлиента,
                      |	1 КАК КоличествоНомеров,
                      |	ЗаявкаПроживание.Количество КАК КоличествоПроживание,
                      |	ЗаявкаПроживание.Ссылка.КолВоЧеловек КАК КолВоЧеловек,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаПроживание.Ссылка.БезЗавтрака
                      |				ИЛИ ЗаявкаПроживание.Ссылка.БонШанс
                      |			ТОГДА ЗаявкаПроживание.Ссылка.КолВоЧеловек
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК КолВоЧеловекБезЗавтрака,
                      |	ВЫБОР
                      |		КОГДА НЕ ЗаявкаПроживание.Ссылка.БезЗавтрака
                      |			ТОГДА ЗаявкаПроживание.Ссылка.КолВоЧеловек
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК КолВоЧеловекСЗавтраком,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаПроживание.Ссылка.БонШанс
                      |			ТОГДА 1
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК БонШанс,
                      |	ЗаявкаПроживание.Ссылка КАК Заявка,
                      |	ЕСТЬNULL(ПостоянныеГости.ПостоянныйГость, 0) КАК ПостоянныеГости,
                      |	ЗаявкаПроживание.Сумма КАК Сумма,
                      |	ЗаявкаПроживание.СуммаБезСкидки КАК СуммаБезСкидки,
                      |	ЗаявкаПроживание.Количество КАК ПроживаниеКоличество
                      |ИЗ
                      |	(ВЫБРАТЬ
                      |		ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
                      |		ЗаявкаНаБронированиеПроживание.НомерСтроки КАК НомерСтроки,
                      |		ЗаявкаНаБронированиеПроживание.ГУИД КАК ГУИД,
                      |		ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
                      |		ЗаявкаНаБронированиеПроживание.Сумма КАК Сумма,
                      |		ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидки,
                      |		ЗаявкаНаБронированиеПроживание.Цена КАК Цена,
                      |		ЗаявкаНаБронированиеПроживание.Количество КАК Количество,
                      |		ЗаявкаНаБронированиеПроживание.ПроцентСкидкиКлиента КАК ПроцентСкидкиКлиента
                      |	ИЗ
                      |		Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание) КАК ЗаявкаПроживание
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КлиентыКоличество.Клиент КАК Клиент,
                      |			ВЫБОР
                      |				КОГДА КлиентыКоличество.КлиентКоличество > 2
                      |					ТОГДА 1
                      |				ИНАЧЕ 0
                      |			КОНЕЦ КАК ПостоянныйГость
                      |		ИЗ
                      |			(ВЫБРАТЬ
                      |				ИсторияКлиента.Клиент КАК Клиент,
                      |				КОЛИЧЕСТВО(ИсторияКлиента.ЗаявкаГУИД) КАК КлиентКоличество
                      |			ИЗ
                      |				РегистрСведений.ИсторияКлиента КАК ИсторияКлиента
                      |			ГДЕ
                      |				ИсторияКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                      |				И ИсторияКлиента.Клиент.НеПоказыватьИсторию = ЛОЖЬ
                      |			
                      |			СГРУППИРОВАТЬ ПО
                      |				ИсторияКлиента.Клиент) КАК КлиентыКоличество
                      |		ГДЕ
                      |			КлиентыКоличество.КлиентКоличество > 2) КАК ПостоянныеГости
                      |		ПО ЗаявкаПроживание.Ссылка.Клиент = ПостоянныеГости.Клиент
                      |ГДЕ
                      |	ЗаявкаПроживание.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаПроживание.Ссылка.ТипБронирования <> &ТипБронирования
                      |	И ЗаявкаПроживание.Ссылка.Проведен = ИСТИНА
                      |	И (ЗаявкаПроживание.Ссылка.Статус = ЗНАЧЕНИЕ(перечисление.СтатусБрони.Проживает)
                      |			ИЛИ ЗаявкаПроживание.Ссылка.Статус = ЗНАЧЕНИЕ(перечисление.СтатусБрони.Выехал))
                      |	И ЗаявкаПроживание.ДеньПроживания >= &ДатаНачала
                      |	И ЗаявкаПроживание.ДеньПроживания <= &ДатаОкончания
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДеньПроживания");

Запрос.УстановитьПараметр("ДатаНачала", ДатаОтчетаС);		
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОтчетаПо);		
Запрос.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);		

ТЗ_0 = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Возврат;  КонецЕсли;

ТЗ_0.Колонки.Добавить("СуммаНомера");
ТЗ_0.Колонки.Добавить("СуммаКомиссии");
ТЗ_0.Колонки.Добавить("СуммаЭквайрингаПроживание");

ТЗ_0.Колонки.Добавить("СуммаПроживание");

ТЗ_0.Колонки.Добавить("ПроцентСкидкиКлиента_0");
ТЗ_0.Колонки.Добавить("ПроцентСкидкиКлиента_1_9");
ТЗ_0.Колонки.Добавить("ПроцентСкидкиКлиента_10_14");
ТЗ_0.Колонки.Добавить("ПроцентСкидкиКлиента_15_19");
ТЗ_0.Колонки.Добавить("ПроцентСкидкиКлиента_20");
ТЗ_0.Колонки.Добавить("ТарифныйПлан");

Для Каждого Строка Из ТЗ_0 Цикл
	Если Строка.Заявка.Бронирует.Турагентство Тогда
		СуммаПроживание = Строка.СуммаБезСкидки;
	Иначе
		СуммаПроживание = Строка.Сумма;
	КонецЕсли;	
	Строка.СуммаПроживание = СуммаПроживание;
	
	Заявка = Строка.Заявка; 
	//ПроцентКомиссии = Заявка.Бронирует.ПроцентКомиссии;
	ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(Заявка.Бронирует, Заявка.РезервС); //, Заявка.В2В);
	
	//ТЗ_Услуги = ОтчетыСервер.ТЗ_УслугиЗаявкаДеньПроживания(Заявка, Строка.ДеньПроживания); 
	ТЗ_Услуги = ОтчетыСервер.ТЗ_УслугиЗаявкаДеньПроживания_ЧерезЗапрос(Заявка, Строка.ДеньПроживания); 
	СуммаКомиссии = ДокументыСервер.СуммаКомиссии(Заявка, Строка.СуммаБезСкидки
			, Заявка.Счета, Заявка.СчетаДетальноДолги, ТЗ_Услуги, ПроцентКомиссии);
			
	Строка.СуммаКомиссии = СуммаКомиссии;

	//ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка(Заявка);
	ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка_ЧерезЗапрос(Заявка);
	
	//ТЗ_Проживание = ОтчетыСервер.ТЗ_ПроживаниеЗаявкаДеньПроживания(Заявка, Строка.ДеньПроживания);
	ТЗ_Проживание = ОтчетыСервер.ТЗ_ПроживаниеЗаявкаДеньПроживания_ЧерезЗапрос(Заявка, Строка.ДеньПроживания);
	
	СуммаЭквайрингаПроживание = ОтчетыСервер.СуммаЭквайрингаПроживание(ТЗ_Проживание, ТЗ_Оплаты); 
	Строка.СуммаЭквайрингаПроживание = ОтчетыСервер.СуммаЭквайрингаПроживание(ТЗ_Проживание, ТЗ_Оплаты); 
	
	СуммаНомера = СуммаПроживание - СуммаКомиссии - СуммаЭквайрингаПроживание;    
	
	Строка.СуммаНомера = СуммаНомера;
	
	Если Строка.ПроцентСкидкиКлиента = 0 Тогда
		Если Заявка.Ссылка.Бронирует.Турагентство Тогда 
			Строка.ПроцентСкидкиКлиента = ДокументыСервер.ПроцентКомиссииКлиента(Заявка.Ссылка.Бронирует, Заявка.Ссылка.РезервС); //, Заявка.Ссылка.В2В);
		КонецЕсли;
	КонецЕсли;
	
	Строка.ПроцентСкидкиКлиента = Окр(Строка.ПроцентСкидкиКлиента); 
	
	Если Строка.ПроцентСкидкиКлиента = 0 
	Тогда Строка.ПроцентСкидкиКлиента_0 = 1; Иначе Строка.ПроцентСкидкиКлиента_0 = 0; КонецЕсли;
	
	Если Строка.ПроцентСкидкиКлиента > 0 И Строка.ПроцентСкидкиКлиента < 10
	Тогда Строка.ПроцентСкидкиКлиента_1_9 = 1; Иначе Строка.ПроцентСкидкиКлиента_1_9 = 0; КонецЕсли;
   
	Если Строка.ПроцентСкидкиКлиента >= 10 И Строка.ПроцентСкидкиКлиента < 15
	Тогда Строка.ПроцентСкидкиКлиента_10_14 = 1; Иначе Строка.ПроцентСкидкиКлиента_10_14 = 0; КонецЕсли;
   
	Если Строка.ПроцентСкидкиКлиента >= 15 И Строка.ПроцентСкидкиКлиента < 20
	Тогда Строка.ПроцентСкидкиКлиента_15_19 = 1; Иначе Строка.ПроцентСкидкиКлиента_15_19 = 0; КонецЕсли;
   
	Если Строка.ПроцентСкидкиКлиента >= 20
	Тогда Строка.ПроцентСкидкиКлиента_20 = 1; Иначе Строка.ПроцентСкидкиКлиента_20 = 0; КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.Заявка.Ссылка.ТарифныйПлан) 
	Тогда Строка.ТарифныйПлан = 1; Иначе Строка.ТарифныйПлан = 0; КонецЕсли;
   
КонецЦикла;

ТЗ_ЗаявкиВсе = ТЗ_0.Скопировать();

КолонкиСуммирования = "ПроцентСкидкиКлиента_0, ПроцентСкидкиКлиента_1_9, ПроцентСкидкиКлиента_10_14, ПроцентСкидкиКлиента_15_19";
КолонкиСуммирования = КолонкиСуммирования + ", ПроцентСкидкиКлиента_20, ТарифныйПлан";
КолонкиСуммирования = КолонкиСуммирования + ", ПостоянныеГости, ПроживаниеКоличество, КоличествоНомеров";
КолонкиСуммирования = КолонкиСуммирования + ", КолВоЧеловек, КолВоЧеловекБезЗавтрака , КолВоЧеловекСЗавтраком, БонШанс";
КолонкиСуммирования = КолонкиСуммирования + ", СуммаНомера, СуммаКомиссии, СуммаЭквайрингаПроживание, СуммаПроживание";      

ТЗ_ЗаявкиВсе.Свернуть("ДеньПроживания", КолонкиСуммирования); 

ЗапросКатегорииЗаявки = Новый Запрос("ВЫБРАТЬ
                                     |	КатегорииНомеров.Ссылка КАК Категория,
                                     |	ЗаявкаНаБронированиеПроживание.Ссылка КАК Заявка,
                                     |	ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
                                     |	ЗаявкаНаБронированиеПроживание.Сумма КАК Сумма,
                                     |	ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидки,
                                     |	ЗаявкаНаБронированиеПроживание.ПроцентСкидкиКлиента КАК ПроцентСкидкиКлиента,
                                     |	ЗаявкаНаБронированиеПроживание.Цена КАК Цена,
                                     |	ЗаявкаНаБронированиеПроживание.Количество КАК ПроживаниеКоличество
                                     |ИЗ
                                     |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                                     |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                                     |		ПО КатегорииНомеров.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка.КатегорияНомера
                                     |ГДЕ
                                     |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ
                                     |	И ЗаявкаНаБронированиеПроживание.Ссылка.ПометкаУдаления = ЛОЖЬ
                                     |	И ЗаявкаНаБронированиеПроживание.Ссылка.Проведен = ИСТИНА
                                     |	И ЗаявкаНаБронированиеПроживание.Ссылка.ТипБронирования = &ТипБронирования
                                     |	И (ЗаявкаНаБронированиеПроживание.Ссылка.Статус = ЗНАЧЕНИЕ(перечисление.СтатусБрони.Проживает)
                                     |			ИЛИ ЗаявкаНаБронированиеПроживание.Ссылка.Статус = ЗНАЧЕНИЕ(перечисление.СтатусБрони.Выехал))
                                     |	И ЗаявкаНаБронированиеПроживание.ДеньПроживания >= &ДатаНачала
                                     |	И ЗаявкаНаБронированиеПроживание.ДеньПроживания <= &ДатаОкончания
                                     |
                                     |УПОРЯДОЧИТЬ ПО
                                     |	КатегорииНомеров.Номер_пп");

ЗапросКатегорииЗаявки.УстановитьПараметр("ДатаНачала", ДатаОтчетаС);		
ЗапросКатегорииЗаявки.УстановитьПараметр("ДатаОкончания", ДатаОтчетаПо);	
ЗапросКатегорииЗаявки.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);	
ТЗ_1 = ЗапросКатегорииЗаявки.Выполнить().Выгрузить();

ТЗ_1.Колонки.Добавить("СуммаНомера");
Для Каждого Строка Из ТЗ_1 Цикл
	Если Строка.Заявка.Бронирует.Турагентство Тогда
		СуммаПроживание = Строка.СуммаБезСкидки;
	Иначе
		СуммаПроживание = Строка.Сумма;
	КонецЕсли;	
	
	Заявка = Строка.Заявка; 
	//ПроцентКомиссии = Заявка.Бронирует.ПроцентКомиссии;
	ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(Заявка.Бронирует, Заявка.РезервС); //, Заявка.Ссылка.В2В);
	
	//ТЗ_Услуги = ОтчетыСервер.ТЗ_УслугиЗаявкаДеньПроживания(Заявка, Строка.ДеньПроживания); 
	ТЗ_Услуги = ОтчетыСервер.ТЗ_УслугиЗаявкаДеньПроживания_ЧерезЗапрос(Заявка, Строка.ДеньПроживания); 
	СуммаКомиссии = ДокументыСервер.СуммаКомиссии(Заявка, Строка.СуммаБезСкидки
			, Заявка.Счета, Заявка.СчетаДетальноДолги, ТЗ_Услуги, ПроцентКомиссии);
			
	//ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка(Заявка);
	ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка_ЧерезЗапрос(Заявка);
	
	//ТЗ_Проживание = ОтчетыСервер.ТЗ_ПроживаниеЗаявкаДеньПроживания(Заявка, Строка.ДеньПроживания);
	ТЗ_Проживание = ОтчетыСервер.ТЗ_ПроживаниеЗаявкаДеньПроживания_ЧерезЗапрос(Заявка, Строка.ДеньПроживания);
	
	СуммаЭквайрингаПроживание = ОтчетыСервер.СуммаЭквайрингаПроживание(ТЗ_Проживание, ТЗ_Оплаты); 
	
	СуммаНомера = СуммаПроживание - СуммаКомиссии - СуммаЭквайрингаПроживание;
	
	Строка.СуммаНомера = СуммаНомера;
КонецЦикла;

ТЗ_КатегорииЗаявкиВсе = ТЗ_1.Скопировать();
ТЗ_КатегорииЗаявкиВсе.Свернуть("ДеньПроживания, Категория", "СуммаНомера, ПроживаниеКоличество"); 

ЗапросТурагентстваЗаявки = Новый Запрос("ВЫБРАТЬ
                                        |	ЗаявкиКлиенты.ДеньПроживания КАК ДеньПроживания,
                                        |	Клиенты.Ссылка КАК Турагентство,
                                        |	ЕСТЬNULL(ЗаявкиКлиенты.КоличествоНомерВРезерв, 0) КАК КоличествоНомерВРезерв
                                        |ИЗ
                                        |	Справочник.Клиенты КАК Клиенты
                                        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                                        |			ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
                                        |			ЗаявкаНаБронированиеПроживание.Ссылка.Бронирует КАК Бронирует,
                                        |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронированиеПроживание.Ссылка.НомерВРезерв) КАК КоличествоНомерВРезерв
                                        |		ИЗ
                                        |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                                        |		ГДЕ
                                        |			ЗаявкаНаБронированиеПроживание.Ссылка.ПометкаУдаления = ЛОЖЬ
                                        |			И ЗаявкаНаБронированиеПроживание.Ссылка.Проведен = ИСТИНА
                                        |			И ЗаявкаНаБронированиеПроживание.Ссылка.ТипБронирования <> &ТипБронирования
                                        |			И (ЗаявкаНаБронированиеПроживание.Ссылка.Статус = ЗНАЧЕНИЕ(перечисление.СтатусБрони.Проживает)
                                        |					ИЛИ ЗаявкаНаБронированиеПроживание.Ссылка.Статус = ЗНАЧЕНИЕ(перечисление.СтатусБрони.Выехал))
                                        |			И ЗаявкаНаБронированиеПроживание.ДеньПроживания >= &ДатаНачала
                                        |			И ЗаявкаНаБронированиеПроживание.ДеньПроживания <= &ДатаОкончания
                                        |		
                                        |		СГРУППИРОВАТЬ ПО
                                        |			ЗаявкаНаБронированиеПроживание.Ссылка.Бронирует,
                                        |			ЗаявкаНаБронированиеПроживание.ДеньПроживания) КАК ЗаявкиКлиенты
                                        |		ПО Клиенты.Ссылка = ЗаявкиКлиенты.Бронирует
                                        |ГДЕ
                                        |	Клиенты.ПометкаУдаления = ЛОЖЬ
                                        |	И Клиенты.Турагентство = ИСТИНА
                                        |
                                        |УПОРЯДОЧИТЬ ПО
                                        |	ДеньПроживания,
                                        |	Клиенты.Наименование,
                                        |	Клиенты.Ссылка");

ЗапросТурагентстваЗаявки.УстановитьПараметр("ДатаНачала", ДатаОтчетаС);		
ЗапросТурагентстваЗаявки.УстановитьПараметр("ДатаОкончания", ДатаОтчетаПо);
ЗапросТурагентстваЗаявки.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);
ТЗ_ТурагентстваЗаявкиВсе = ЗапросТурагентстваЗаявки.Выполнить().Выгрузить();

//НетЗаписей = Истина;
//Дата_П = ДатаОтчетаС;
//Пока Дата_П <= ДатаОтчетаПо Цикл
//Для Каждого Строка Из ТЗ Цикл	

//Для Индекс = 0 По ТЗ.Количество() - 1 Цикл	
Для Индекс = 0 По ТЗ_ЗаявкиВсе.Количество() - 1 Цикл	
	Если ТЗ_ЗаявкиВсе[Индекс].ДеньПроживания = '20211123' ТОгда
		ш = 1;		
	КонецЕсли;
	
	Номеров = 0;
	Гостей = 0;
	ГостейБезЗавтрака = 0;
	ГостейСЗавтраком = 0;
	Романтик = 0;

	НомеровСоСкидкой_0 = 0;
	НомеровСоСкидкой_1_9 = 0;
	НомеровСоСкидкой_10_14 = 0;
	НомеровСоСкидкой_15_19 = 0;
	НомеровСоСкидкой_20 = 0;
	НомеровСТарифныйПлан = 0;

	ПостоянныхГостей = 0;
	КоличествоНомеров = 0;
	
	СуммаНомера = 0;
	
	ОсновнаяСтрока = ТЗ_ЗаявкиВсе[Индекс];
	Дата_П = ОсновнаяСтрока.ДеньПроживания;
	
	Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
	
	Область.Параметры.Дата= Формат(Дата_П, "ДФ=dd.MM.yy");	
	Область.Параметры.ДеньНедели= Формат(Дата_П, "ДФ=ддд");	
	
	//Номеров = ОсновнаяСтрока.КоличествоПроживание;
	Номеров = ОсновнаяСтрока.ПроживаниеКоличество;
	Область.Параметры.Номеров = Номеров;	
	Область.Параметры.ЗагрузкаПроцент = Окр(Номеров * 100 / ОбщееКоличествоНомеров, 0) ;

	Гостей = ОсновнаяСтрока.КолВоЧеловек; 
	Область.Параметры.Гостей = Гостей;
	Область.Параметры.СреднееГостей = Окр(Гостей / ОсновнаяСтрока.КоличествоНомеров, 2);

	ГостейБезЗавтрака = ОсновнаяСтрока.КолВоЧеловекБезЗавтрака;
	Область.Параметры.ГостейБезЗавтрака = ГостейБезЗавтрака;
	ГостейСЗавтраком = ОсновнаяСтрока.КолВоЧеловекСЗавтраком;
	Область.Параметры.ГостейСЗавтраком = ГостейСЗавтраком;

	Романтик = ОсновнаяСтрока.БонШанс;
	Область.Параметры.Романтик = Романтик;

	//ПостоянныхГостей = ОсновнаяСтрока.ПостоянныеГостиКоличество;
	ПостоянныхГостей = ОсновнаяСтрока.ПостоянныеГости;
	Область.Параметры.ПостоянныхГостей = ПостоянныхГостей;
	//Если Строка.КолВоЧеловек <> 0 Тогда
	КоличествоНомеров = ОсновнаяСтрока.КоличествоНомеров;
	Если КоличествоНомеров <> 0 Тогда
		Область.Параметры.ПостоянныхГостейПроцент = Окр(ПостоянныхГостей * 100 / КоличествоНомеров, 0);
	КонецЕсли;
	
	НомеровСоСкидкой_0 = ОсновнаяСтрока.ПроцентСкидкиКлиента_0;
	Область.Параметры.НомеровСоСкидкой_0 = НомеровСоСкидкой_0;
	НомеровСоСкидкой_1_9 = ОсновнаяСтрока.ПроцентСкидкиКлиента_1_9;
	Область.Параметры.НомеровСоСкидкой_1_9 = НомеровСоСкидкой_1_9;
	НомеровСоСкидкой_10_14 = ОсновнаяСтрока.ПроцентСкидкиКлиента_10_14;
	Область.Параметры.НомеровСоСкидкой_10_14 = НомеровСоСкидкой_10_14;
	НомеровСоСкидкой_15_19 = ОсновнаяСтрока.ПроцентСкидкиКлиента_15_19;
	Область.Параметры.НомеровСоСкидкой_15_19 = НомеровСоСкидкой_15_19;
	НомеровСоСкидкой_20 = ОсновнаяСтрока.ПроцентСкидкиКлиента_20;
	Область.Параметры.НомеровСоСкидкой_20 = НомеровСоСкидкой_20;
	НомеровСТарифныйПлан = ОсновнаяСтрока.ТарифныйПлан;
	Область.Параметры.НомеровСТарифныйПлан  = НомеровСТарифныйПлан;

	НомеровСоСкидкой = ОсновнаяСтрока.ПроцентСкидкиКлиента_1_9
		+ ОсновнаяСтрока.ПроцентСкидкиКлиента_10_14
		+ ОсновнаяСтрока.ПроцентСкидкиКлиента_15_19
		+ ОсновнаяСтрока.ПроцентСкидкиКлиента_20
		+ ОсновнаяСтрока.ТарифныйПлан
		;
		
	ВсегоНомеров = НомеровСоСкидкой + ОсновнаяСтрока.ПроцентСкидкиКлиента_0;
	Если ВсегоНомеров <> 0 Тогда 
		Область.Параметры.ПроцентНомеровСоСкидкой = Окр(НомеровСоСкидкой * 100 / ВсегоНомеров, 0); 
	КонецЕсли;
	
	//Область.Параметры.СредняяЦенаНомера = Окр(ОсновнаяСтрока.Цена, 0); 
	//СредняяЦенаНомера = Окр(ОсновнаяСтрока.СуммаНомера / ОсновнаяСтрока.ПроживаниеКоличество, 2); 
	СуммаНомера = ОсновнаяСтрока.СуммаНомера;
	СредняяЦенаНомера = Окр(СуммаНомера / ОсновнаяСтрока.ПроживаниеКоличество, 0); 
	Область.Параметры.СредняяЦенаНомера = СредняяЦенаНомера; 
	
	Область.Параметры.СуммаПроживание = ОсновнаяСтрока.СуммаПроживание; 
	Область.Параметры.СуммаНомера = ОсновнаяСтрока.СуммаНомера; 
	Область.Параметры.СуммаКомиссии = ОсновнаяСтрока.СуммаКомиссии; 
	Область.Параметры.ПроживаниеКоличество = ОсновнаяСтрока.ПроживаниеКоличество; 
	Область.Параметры.СуммаЭквайрингаПроживание = ОсновнаяСтрока.СуммаЭквайрингаПроживание; 
	
	ПолеОтчета.Вывести(Область, 0);
	
	ОтборСтроки = Новый Структура("ДеньПроживания", Дата_П); 
	ТЗ_КатегорииЗаявки = ТЗ_КатегорииЗаявкиВсе.Скопировать(ОтборСтроки);
	
	Для Каждого Строка Из ТЗ_КатегорииНомеров Цикл	
		ОтборСтроки = Новый Структура("Категория", Строка.Категория);
		НайденныеСтроки = ТЗ_КатегорииЗаявки.НайтиСтроки(ОтборСтроки);
		
		ОбластьКатегория = Макет.ПолучитьОбласть("Строка|КолонкиЦенаКатегория");
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаКатегория = НайденныеСтроки[0];
			
			Если СтрокаКатегория.ПроживаниеКоличество <> 0 Тогда
				ЦенаКатегория = Окр(СтрокаКатегория.СуммаНомера / СтрокаКатегория.ПроживаниеКоличество, 2);
				ОбластьКатегория.Параметры.ЦенаКатегория = ЦенаКатегория;
			КонецЕсли;		
		КонецЕсли;
		
		ПолеОтчета.Присоединить(ОбластьКатегория, 0);
	КонецЦикла;	

	ОтборСтроки = Новый Структура("ДеньПроживания", Дата_П); 
	ТЗ_ТурагентстваЗаявки = ТЗ_ТурагентстваЗаявкиВсе.Скопировать(ОтборСтроки);
	
	Для Каждого Строка Из ТЗ_Турагентства Цикл	
		ОтборСтроки = Новый Структура("Турагентство", Строка.Турагентство);
		НайденныеСтроки = ТЗ_ТурагентстваЗаявки.НайтиСтроки(ОтборСтроки);
		
		ОбластьТурагентство = Макет.ПолучитьОбласть("Строка|КолонкиТурагентства");
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаТурагентство = НайденныеСтроки[0];
			
			ОбластьТурагентство.Параметры.НомеровОтТурагентства = СтрокаТурагентство.КоличествоНомерВРезерв;
		КонецЕсли;
		
		ПолеОтчета.Присоединить(ОбластьТурагентство, 0);
	КонецЦикла;	

	Итоги.Номеров = Итоги.Номеров + Номеров;
	Итоги.Гостей = Итоги.Гостей + Гостей;
	Итоги.ГостейБезЗавтрака = Итоги.ГостейБезЗавтрака + ГостейБезЗавтрака;
	Итоги.ГостейСЗавтраком = Итоги.ГостейСЗавтраком + ГостейСЗавтраком;
	Итоги.Романтик = Итоги.Романтик + Романтик;

	Итоги.НомеровСоСкидкой_0 = Итоги.НомеровСоСкидкой_0 + НомеровСоСкидкой_0;
	Итоги.НомеровСоСкидкой_1_9 = Итоги.НомеровСоСкидкой_1_9 + НомеровСоСкидкой_1_9;
	Итоги.НомеровСоСкидкой_10_14 = Итоги.НомеровСоСкидкой_10_14 + НомеровСоСкидкой_10_14;
	Итоги.НомеровСоСкидкой_15_19 = Итоги.НомеровСоСкидкой_15_19 + НомеровСоСкидкой_15_19;
	Итоги.НомеровСоСкидкой_20 = Итоги.НомеровСоСкидкой_20 + НомеровСоСкидкой_20;
	Итоги.НомеровСТарифныйПлан = Итоги.НомеровСТарифныйПлан + НомеровСТарифныйПлан;

	Итоги.ПостоянныхГостей = Итоги.ПостоянныхГостей + ПостоянныхГостей;
	Итоги.КоличествоНомеров = Итоги.КоличествоНомеров + КоличествоНомеров;
	
	Итоги.СуммаНомера = Итоги.СуммаНомера + СуммаНомера;
	
	КатегорииИтоги = Итоги.КатегорииИтоги;
	Для Каждого Строка Из КатегорииИтоги Цикл
		ОтборСтроки = Новый Структура("Категория", Строка.Категория);
		НайденныеСтроки = ТЗ_КатегорииЗаявки.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаКатегория = НайденныеСтроки[0];
			
			Строка.СуммаНомера = Строка.СуммаНомера + СтрокаКатегория.СуммаНомера;
			Строка.ПроживаниеКоличество = Строка.ПроживаниеКоличество + СтрокаКатегория.ПроживаниеКоличество;
		КонецЕсли;					
	КонецЦикла;
	
	ТурагентстваИтоги = Итоги.ТурагентстваИтоги;
	Для Каждого Строка Из ТурагентстваИтоги Цикл
		ОтборСтроки = Новый Структура("Турагентство", Строка.Турагентство);
		НайденныеСтроки = ТЗ_ТурагентстваЗаявки.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтроки.Количество() > 0 Тогда 
			СтрокаТурагентство = НайденныеСтроки[0];
			
			Строка.НомеровОтТурагентства = Строка.НомеровОтТурагентства + СтрокаТурагентство.КоличествоНомерВРезерв;
		КонецЕсли;		
	КонецЦикла;

	КоличествоЗаписейМесяц = КоличествоЗаписейМесяц + 1;
	КоличествоЗаписей = КоличествоЗаписей + 1;
	
	//НетЗаписей = Ложь;
	
~ПРОДОЛЖИТЬ_ДатаОтчетаПо:

	//Если НетЗаписей Тогда Перейти ~СЛЕДУЮЩАЯ_ДАТА; КонецЕсли;
	
	ИтогиМесяц.Номеров = ИтогиМесяц.Номеров + Номеров;
	ИтогиМесяц.Гостей = ИтогиМесяц.Гостей + Гостей;
	ИтогиМесяц.ГостейБезЗавтрака = ИтогиМесяц.ГостейБезЗавтрака + ГостейБезЗавтрака;
	ИтогиМесяц.ГостейСЗавтраком = ИтогиМесяц.ГостейСЗавтраком + ГостейСЗавтраком;
	ИтогиМесяц.Романтик = ИтогиМесяц.Романтик + Романтик;

	ИтогиМесяц.НомеровСоСкидкой_0 = ИтогиМесяц.НомеровСоСкидкой_0 + НомеровСоСкидкой_0;
	ИтогиМесяц.НомеровСоСкидкой_1_9 = ИтогиМесяц.НомеровСоСкидкой_1_9 + НомеровСоСкидкой_1_9;
	ИтогиМесяц.НомеровСоСкидкой_10_14 = ИтогиМесяц.НомеровСоСкидкой_10_14 + НомеровСоСкидкой_10_14;
	ИтогиМесяц.НомеровСоСкидкой_15_19 = ИтогиМесяц.НомеровСоСкидкой_15_19 + НомеровСоСкидкой_15_19;
	ИтогиМесяц.НомеровСоСкидкой_20 = ИтогиМесяц.НомеровСоСкидкой_20 + НомеровСоСкидкой_20;
	ИтогиМесяц.НомеровСТарифныйПлан = ИтогиМесяц.НомеровСТарифныйПлан + НомеровСТарифныйПлан;

	ИтогиМесяц.ПостоянныхГостей = ИтогиМесяц.ПостоянныхГостей + ПостоянныхГостей;
	ИтогиМесяц.КоличествоНомеров = ИтогиМесяц.КоличествоНомеров + КоличествоНомеров;
	
	ИтогиМесяц.СуммаНомера = ИтогиМесяц.СуммаНомера + СуммаНомера;
	
	КатегорииИтогиМесяц = ИтогиМесяц.КатегорииИтогиМесяц;
	Для Каждого Строка Из КатегорииИтогиМесяц Цикл
		ОтборСтроки = Новый Структура("Категория", Строка.Категория);
		НайденныеСтроки = ТЗ_КатегорииЗаявки.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаКатегория = НайденныеСтроки[0];
			
			Строка.СуммаНомера = Строка.СуммаНомера + СтрокаКатегория.СуммаНомера;
			Строка.ПроживаниеКоличество = Строка.ПроживаниеКоличество + СтрокаКатегория.ПроживаниеКоличество;
		КонецЕсли;					
	КонецЦикла;
	
	ТурагентстваИтогиМесяц = ИтогиМесяц.ТурагентстваИтогиМесяц;
	Для Каждого Строка Из ТурагентстваИтогиМесяц Цикл
		ОтборСтроки = Новый Структура("Турагентство", Строка.Турагентство);
		НайденныеСтроки = ТЗ_ТурагентстваЗаявки.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтроки.Количество() > 0 Тогда 
			СтрокаТурагентство = НайденныеСтроки[0];
			
			Строка.НомеровОтТурагентства = Строка.НомеровОтТурагентства + СтрокаТурагентство.КоличествоНомерВРезерв;
		КонецЕсли;		
	КонецЦикла;
	
	Если ТЗ_ЗаявкиВсе.Количество() = Индекс + 1 Тогда
		СменаМесяца = Истина;
	Иначе
		СменаМесяца = ТЗ_ЗаявкиВсе[Индекс + 1].ДеньПроживания > НачалоДня(КонецМесяца(Дата_П));
	КонецЕсли;	
	
	Если СменаМесяца Тогда
		//НетЗаписей = Истина;
		
		ОбластьИтогиМесяц = Макет.ПолучитьОбласть("ИтогиМесяц|КолонкиЛево");

		ОбластьИтогиМесяц.Параметры.ИтогоМесяц = "Итого " + Формат(Дата_П, "ДФ='ММMM yy'") + ":";
		
		ОбластьИтогиМесяц.Параметры.Номеров = ИтогиМесяц.Номеров;
		ОбластьИтогиМесяц.Параметры.Гостей = ИтогиМесяц.Гостей;
		
		ОбластьИтогиМесяц.Параметры.СреднееГостей = Окр(ИтогиМесяц.Гостей  / ИтогиМесяц.КоличествоНомеров, 2);
		
		ОбластьИтогиМесяц.Параметры.ГостейБезЗавтрака = ИтогиМесяц.ГостейБезЗавтрака;
		ОбластьИтогиМесяц.Параметры.ГостейСЗавтраком = ИтогиМесяц.ГостейСЗавтраком;
		ОбластьИтогиМесяц.Параметры.Романтик = ИтогиМесяц.Романтик;

		ОбластьИтогиМесяц.Параметры.НомеровСоСкидкой_0 = ИтогиМесяц.НомеровСоСкидкой_0;
		ОбластьИтогиМесяц.Параметры.НомеровСоСкидкой_1_9 = ИтогиМесяц.НомеровСоСкидкой_1_9;
		ОбластьИтогиМесяц.Параметры.НомеровСоСкидкой_10_14 = ИтогиМесяц.НомеровСоСкидкой_10_14;
		ОбластьИтогиМесяц.Параметры.НомеровСоСкидкой_15_19 = ИтогиМесяц.НомеровСоСкидкой_15_19;
		ОбластьИтогиМесяц.Параметры.НомеровСоСкидкой_20 = ИтогиМесяц.НомеровСоСкидкой_20;
		ОбластьИтогиМесяц.Параметры.НомеровСТарифныйПлан = ИтогиМесяц.НомеровСТарифныйПлан;

		ОбластьИтогиМесяц.Параметры.ПостоянныхГостей = ИтогиМесяц.ПостоянныхГостей;
		
		Если ИтогиМесяц.Номеров <> 0 Тогда
			СредняяЦенаНомераИтогиМесяц = Окр(ИтогиМесяц.СуммаНомера / ИтогиМесяц.Номеров, 0); 
			ОбластьИтогиМесяц.Параметры.СредняяЦенаНомера = СредняяЦенаНомераИтогиМесяц; 
		КонецЕсли;	
			
		Если ИтогиМесяц.КоличествоНомеров <> 0 Тогда
			ОбластьИтогиМесяц.Параметры.ПостоянныхГостейПроцент = Окр(ИтогиМесяц.ПостоянныхГостей * 100 / ИтогиМесяц.КоличествоНомеров, 0);
		КонецЕсли;

		Если КоличествоЗаписейМесяц > 0 Тогда 
			СреднееКоличествоНомеровМесяц = ИтогиМесяц.Номеров / КоличествоЗаписейМесяц;
			ОбластьИтогиМесяц.Параметры.ЗагрузкаПроцент = Окр(СреднееКоличествоНомеровМесяц * 100 / ОбщееКоличествоНомеров, 0) ;
		КонецЕсли;

		ИтогиНомеровСоСкидкойМесяц = ИтогиМесяц.НомеровСоСкидкой_1_9 + ИтогиМесяц.НомеровСоСкидкой_10_14 + ИтогиМесяц.НомеровСоСкидкой_15_19 
								+ ИтогиМесяц.НомеровСоСкидкой_20 + ИтогиМесяц.НомеровСТарифныйПлан; 
								
		ИтогиНомеровМесяц = ИтогиНомеровСоСкидкойМесяц + ИтогиМесяц.НомеровСоСкидкой_0; 						
		Если ИтогиНомеровМесяц <> 0 Тогда						
			ОбластьИтогиМесяц.Параметры.ПроцентНомеровСоСкидкой = Окр(ИтогиНомеровСоСкидкойМесяц * 100 / ИтогиНомеровМесяц, 0) ;
		КонецЕсли;
		
		ПолеОтчета.Вывести(ОбластьИтогиМесяц, 0);
			
		КатегорииИтогиМесяц = ИтогиМесяц.КатегорииИтогиМесяц;
		Для Каждого Строка Из ТЗ_КатегорииНомеров Цикл
			ОтборСтроки = Новый Структура("Категория", Строка.Категория);
			НайденныеСтроки = КатегорииИтогиМесяц.НайтиСтроки(ОтборСтроки);
			СтрокаКатегория = НайденныеСтроки[0];
			
			ОбластьКатегория = Макет.ПолучитьОбласть("ИтогиМесяц|КолонкиЦенаКатегория");
			
			Если СтрокаКатегория.ПроживаниеКоличество <> 0 Тогда			
				ЦенаКатегория = Окр(СтрокаКатегория.СуммаНомера / СтрокаКатегория.ПроживаниеКоличество, 2); 
				ОбластьКатегория.Параметры.ЦенаКатегория = ЦенаКатегория;
			КонецЕсли;
			
			ПолеОтчета.Присоединить(ОбластьКатегория, 0);
		КонецЦикла;
		
		ТурагентстваИтогиМесяц = ИтогиМесяц.ТурагентстваИтогиМесяц;
		Для Каждого Строка Из ТЗ_Турагентства Цикл
			ОтборСтроки = Новый Структура("Турагентство", Строка.Турагентство);
			НайденныеСтроки = ТурагентстваИтогиМесяц.НайтиСтроки(ОтборСтроки);
			СтрокаТурагентство = НайденныеСтроки[0];
			
			ОбластьТурагентство = Макет.ПолучитьОбласть("ИтогиМесяц|КолонкиТурагентства");
			ОбластьТурагентство.Параметры.НомеровОтТурагентства = СтрокаТурагентство.НомеровОтТурагентства;
			
			ПолеОтчета.Присоединить(ОбластьТурагентство, 0);
		КонецЦикла;
		
		КоличествоЗаписейМесяц = 0;
		
		ИтогиМесяц.Номеров = 0;
		ИтогиМесяц.Гостей = 0;
		ИтогиМесяц.ГостейБезЗавтрака = 0;
		ИтогиМесяц.ГостейСЗавтраком = 0;
		ИтогиМесяц.Романтик = 0;

		ИтогиМесяц.НомеровСоСкидкой_0 = 0;
		ИтогиМесяц.НомеровСоСкидкой_1_9 = 0;
		ИтогиМесяц.НомеровСоСкидкой_10_14 = 0;
		ИтогиМесяц.НомеровСоСкидкой_15_19 = 0;
		ИтогиМесяц.НомеровСоСкидкой_20 = 0;
		ИтогиМесяц.НомеровСТарифныйПлан = 0;

		ИтогиМесяц.ПостоянныхГостей = 0;
		ИтогиМесяц.КоличествоНомеров = 0;
		
		ИтогиМесяц.СуммаНомера = 0;
		
		КатегорииИтогиМесяц = ИтогиМесяц.КатегорииИтогиМесяц;
		Для Каждого Строка Из КатегорииИтогиМесяц Цикл
			Строка.СуммаНомера = 0;
			Строка.ПроживаниеКоличество = 0;
		КонецЦикла;
		
		ТурагентстваИтогиМесяц = ИтогиМесяц.ТурагентстваИтогиМесяц;
		Для Каждого Строка Из ТурагентстваИтогиМесяц Цикл
			Строка.НомеровОтТурагентства = 0;
		КонецЦикла;
	КонецЕсли;	

~СЛЕДУЮЩАЯ_ДАТА:
	//Дата_П = Дата_П + 60*60*24;	
КонецЦикла;

ОбластьИтоги = Макет.ПолучитьОбласть("Итоги|КолонкиЛево");

ОбластьИтоги.Параметры.Номеров = Итоги.Номеров;
ОбластьИтоги.Параметры.Гостей = Итоги.Гостей;

Если Итоги.Номеров <> 0 Тогда
	ОбластьИтоги.Параметры.СреднееГостей = Окр(Итоги.Гостей  / Итоги.Номеров, 2);
КонецЕсли;
	
ОбластьИтоги.Параметры.ГостейБезЗавтрака = Итоги.ГостейБезЗавтрака;
ОбластьИтоги.Параметры.ГостейСЗавтраком = Итоги.ГостейСЗавтраком;
ОбластьИтоги.Параметры.Романтик = Итоги.Романтик;

ОбластьИтоги.Параметры.НомеровСоСкидкой_0 = Итоги.НомеровСоСкидкой_0;
ОбластьИтоги.Параметры.НомеровСоСкидкой_1_9 = Итоги.НомеровСоСкидкой_1_9;
ОбластьИтоги.Параметры.НомеровСоСкидкой_10_14 = Итоги.НомеровСоСкидкой_10_14;
ОбластьИтоги.Параметры.НомеровСоСкидкой_15_19 = Итоги.НомеровСоСкидкой_15_19;
ОбластьИтоги.Параметры.НомеровСоСкидкой_20 = Итоги.НомеровСоСкидкой_20;
ОбластьИтоги.Параметры.НомеровСТарифныйПлан = Итоги.НомеровСТарифныйПлан;

Если Итоги.Номеров <> 0 Тогда
	СредняяЦенаНомераИтоги = Окр(Итоги.СуммаНомера / Итоги.Номеров, 0); 
	ОбластьИтоги.Параметры.СредняяЦенаНомера = СредняяЦенаНомераИтоги; 
КонецЕсли;
	
ОбластьИтоги.Параметры.ПостоянныхГостей = Итоги.ПостоянныхГостей;
Если Итоги.Гостей <> 0 Тогда
	ОбластьИтоги.Параметры.ПостоянныхГостейПроцент = Окр(Итоги.ПостоянныхГостей * 100 / Итоги.Гостей, 0);
КонецЕсли;

Если КоличествоЗаписей > 0 Тогда 
	СреднееКоличествоНомеров = Итоги.Номеров / КоличествоЗаписей;
	ОбластьИтоги.Параметры.ЗагрузкаПроцент = Окр(СреднееКоличествоНомеров * 100 / ОбщееКоличествоНомеров, 0) ;
КонецЕсли;

ИтогиНомеровСоСкидкой = Итоги.НомеровСоСкидкой_1_9 + Итоги.НомеровСоСкидкой_10_14 + Итоги.НомеровСоСкидкой_15_19 
						+ Итоги.НомеровСоСкидкой_20 + Итоги.НомеровСТарифныйПлан; 
ИтогиНомеров = ИтогиНомеровСоСкидкой + Итоги.НомеровСоСкидкой_0; 						
Если ИтогиНомеров <> 0 Тогда  
	ОбластьИтоги.Параметры.ПроцентНомеровСоСкидкой = Окр(ИтогиНомеровСоСкидкой * 100 / ИтогиНомеров, 0) ;
КонецЕсли;

ПолеОтчета.Вывести(ОбластьИтоги, 0);

КатегорииИтоги = Итоги.КатегорииИтоги;
Для Каждого Строка Из ТЗ_КатегорииНомеров Цикл
	ОтборСтроки = Новый Структура("Категория", Строка.Категория);
	НайденныеСтроки = КатегорииИтоги.НайтиСтроки(ОтборСтроки);
	СтрокаКатегория = НайденныеСтроки[0];
	
	ОбластьКатегория = Макет.ПолучитьОбласть("Итоги|КолонкиЦенаКатегория");
	Если СтрокаКатегория.ПроживаниеКоличество <> 0 Тогда			
		ЦенаКатегория = Окр(СтрокаКатегория.СуммаНомера / СтрокаКатегория.ПроживаниеКоличество, 2); 
		ОбластьКатегория.Параметры.ЦенаКатегория = ЦенаКатегория;
	КонецЕсли;
	
	ПолеОтчета.Присоединить(ОбластьКатегория, 0);
КонецЦикла;

ТурагентстваИтоги = Итоги.ТурагентстваИтоги;
Для Каждого Строка Из ТЗ_Турагентства Цикл
	ОтборСтроки = Новый Структура("Турагентство", Строка.Турагентство);
	НайденныеСтроки = ТурагентстваИтоги.НайтиСтроки(ОтборСтроки);
	СтрокаТурагентство = НайденныеСтроки[0];
	
	ОбластьТурагентство = Макет.ПолучитьОбласть("Итоги|КолонкиТурагентства");
	ОбластьТурагентство.Параметры.НомеровОтТурагентства = СтрокаТурагентство.НомеровОтТурагентства;
	
	ПолеОтчета.Присоединить(ОбластьТурагентство, 0);
КонецЦикла;

КолонкаНачало = 20; КолонкаОкончание = 24;
ПолеОтчета.Область(, КолонкаНачало, ,КолонкаОкончание).Видимость = Ложь;  

КонецПроцедуры


