
//
Процедура КнопкаСформироватьНажатие___(Кнопка)
	//ТабДок=СформироватьПоЮрЛицу(ЮрЛицо,ДатаН,ДатаК);
	//ТабДок.Показать();	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	ТабДок=СформироватьПоЮрЛицу(Отчет.ЮрЛицо, Отчет.ДатаН, Отчет.ДатаК);
	ТабДок.Показать();  
КонецПроцедуры

&НаСервере
Функция СформироватьПоЮрЛицу(ЮЛ,ДН,ДК,ТД=Истина)
	//Макет=ПолучитьМакет("МакетСверка");
	Макет = Отчеты.СверкаПоЮрЛицам_LOD.ПолучитьМакет("МакетСверка");
	
	
	ТабДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДН=Формат(ДН, "ДФ=dd.MM.yy");
	Обл.Параметры.ДК=Формат(ДК, "ДФ=dd.MM.yy");
	Обл.Параметры.ЮрЛицо=ЮЛ.Наименование;
	ТабДок.Вывести(Обл);
	
	ТЗСверка=Новый ТаблицаЗначений;
	ТЗСверка.Колонки.Добавить("ДатаОперации");
	ТЗСверка.Колонки.Добавить("Документ");
	ТЗСверка.Колонки.Добавить("Проживание");
	ТЗСверка.Колонки.Добавить("Оплата");

	ЗапросБронирований=Новый Запрос("ВЫБРАТЬ
	                                |	ЗаявкаНаБронирование.Ссылка
	                                |ИЗ
	                                |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                                |ГДЕ
	                                |	ЗаявкаНаБронирование.Оплачивает = &Оплачивает
	                                |	И ЗаявкаНаБронирование.Проведен = ИСТИНА
	                                |	И ЗаявкаНаБронирование.РезервПо МЕЖДУ &ДН И &ДК");
									
	ЗапросБронирований.УстановитьПараметр("Оплачивает",ЮЛ);
	ЗапросБронирований.УстановитьПараметр("ДН",НачалоДня(ДН));
	ЗапросБронирований.УстановитьПараметр("ДК",КонецДня(ДК));
	ТЗБрон=ЗапросБронирований.Выполнить().Выгрузить();
	Для Каждого СтрБ из ТЗБрон цикл
    	 НовСтр=ТЗСверка.Добавить();
		 НовСтр.ДатаОперации=СтрБ.Ссылка.РезервПо;
		 НовСтр.Документ="Бронирование " + СтрБ.Ссылка.Номер + " от " + Формат(СтрБ.Ссылка.РезервПо, "ДФ=dd.MM.yy");
		 НовСтр.Проживание=РассчитатьСуммуЗапроживание(СтрБ.Ссылка,СтрБ.Ссылка.ПеременныйТариф);
		 НовСтр.Оплата=0;		 
	 КонецЦикла;
	 
	 
	 ЗапросБронированийДоНачала=Новый Запрос("ВЫБРАТЬ
	                                |	ЗаявкаНаБронирование.Ссылка
	                                |ИЗ
	                                |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                                |ГДЕ
	                                |	ЗаявкаНаБронирование.Оплачивает = &Оплачивает
	                                |	И ЗаявкаНаБронирование.Проведен = ИСТИНА
	                                |	И ЗаявкаНаБронирование.РезервПо <&ДН");
									
	ЗапросБронированийДоНачала.УстановитьПараметр("Оплачивает",ЮЛ);
	ЗапросБронированийДоНачала.УстановитьПараметр("ДН",НачалоДня(ДН));
	
	ТЗБрон=ЗапросБронированийДоНачала.Выполнить().Выгрузить();
	СуммаБрониДо=0;
	Для Каждого СтрБ из ТЗБрон цикл
    	СуммаБрониДо=СуммаБрониДо+РассчитатьСуммуЗапроживание(СтрБ.Ссылка,СтрБ.Ссылка.ПеременныйТариф);
	КонецЦикла;


	ЗапросОплат=Новый Запрос("ВЫБРАТЬ
	                         |	Деньги.Период КАК Дата,
	                         |	Деньги.Сумма,
	                         |	""БезНал"" КАК Вид,
	                         |	Деньги.Регистратор.Номер КАК Номер
	                         |ИЗ
	                         |	РегистрНакопления.Деньги КАК Деньги
	                         |ГДЕ
	                         |	Деньги.ВидОплаты = &ВидОплатыБН
	                         |	И Деньги.Контрагент = &ОтКого
	                         |
	                         |ОБЪЕДИНИТЬ ВСЕ
	                         |
	                         |ВЫБРАТЬ
	                         |	КассовыйДокумент.Дата,
	                         |	КассовыйДокумент.Сумма,
	                         |	ВЫБОР
	                         |		КОГДА КассовыйДокумент.КредитнаяКарта
	                         |			ТОГДА ""Карт.""
	                         |		ИНАЧЕ ""Нал""
	                         |	КОНЕЦ,
	                         |	КассовыйДокумент.Номер
	                         |ИЗ
	                         |	Документ.КассовыйДокумент КАК КассовыйДокумент
	                         |ГДЕ
	                         |	КассовыйДокумент.ОтКого = &ОтКого
	                         |
	                         |УПОРЯДОЧИТЬ ПО
	                         |	Дата");
							 
	ЗапросОплат=Новый Запрос("ВЫБРАТЬ
	                         |	Деньги.Период КАК Дата,
	                         |	Деньги.Сумма,
	                         |	""БезНал"" КАК Вид,
	                         |	Деньги.Регистратор.Номер КАК Номер
	                         |ИЗ
	                         |	РегистрНакопления.Деньги КАК Деньги
	                         |ГДЕ
	                         |	Деньги.ВидОплаты = &ВидОплатыБН
	                         |	И Деньги.Контрагент = &ОтКого
	                         |	И Деньги.Период МЕЖДУ &ДН И &ДК");
						 
    ЗапросОплат.УстановитьПараметр("ДН",НачалоДня(ДН));
	ЗапросОплат.УстановитьПараметр("ДК",КонецДня(ДК));
    ЗапросОплат.УстановитьПараметр("ОтКого",ЮЛ);
	ЗапросОплат.УстановитьПараметр("ВидОплатыБН",Перечисления.ВидОплаты.Безнал);
	ТЗОпл=ЗапросОплат.Выполнить().Выгрузить();
	Для Каждого СтрОпл из ТЗОпл цикл
    	 НовСтр=ТЗСверка.Добавить();
		 НовСтр.ДатаОперации=СтрОпл.Дата;
		 НовСтр.Документ=СтрОпл.Вид+" " + СтрОпл.Номер + " от " + Формат(СтрОпл.Дата, "ДФ=dd.MM.yy");
		 НовСтр.Проживание=0;
		 НовСтр.Оплата=СтрОпл.Сумма;		 
	КонецЦикла;
	
	
	ЗапросОплатДО=Новый Запрос("ВЫБРАТЬ
	                         |	Деньги.Период КАК Дата,
	                         |	Деньги.Сумма,
	                         |	""БезНал"" КАК Вид,
	                         |	Деньги.Регистратор.Номер КАК Номер
	                         |ИЗ
	                         |	РегистрНакопления.Деньги КАК Деньги
	                         |ГДЕ
	                         |	Деньги.ВидОплаты = &ВидОплатыБН
	                         |	И Деньги.Контрагент = &ОтКого
	                         |	И Деньги.Период < &ДН");
						 
    ЗапросОплатДО.УстановитьПараметр("ДН",НачалоДня(ДН));
    ЗапросОплатДО.УстановитьПараметр("ОтКого",ЮЛ);
	ЗапросОплатДО.УстановитьПараметр("ВидОплатыБН",Перечисления.ВидОплаты.Безнал);
	ТЗОпл=ЗапросОплатДО.Выполнить().Выгрузить();
	СуммаОплатДо=0;
	Для Каждого СтрОпл из ТЗОпл цикл
    	СуммаОплатДо=СуммаОплатДо+СтрОпл.Сумма;		 
	КонецЦикла;

	
	
	ТЗСверка.Сортировать("ДатаОперации Возр");
	Обл=Макет.ПолучитьОбласть("Строка");
		//Дата	Документ	Бронирование	Оплата
		Обл.Параметры.Дата="На начало периода";
		Обл.Параметры.Бронирование=Формат(СуммаБрониДо, "ЧГ=");
		Обл.Параметры.Оплата=Формат(СуммаОплатДо, "ЧГ=");
		ТабДок.Вывести(Обл);

	Для каждого СтрСв Из ТЗСверка Цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		//Дата	Документ	Бронирование	Оплата
		Обл.Параметры.Дата=Формат(СтрСв.ДатаОперации, "ДФ=dd.MM.yy");
		Обл.Параметры.Документ=СтрСв.Документ;
		Обл.Параметры.Бронирование=Формат(СтрСв.Проживание, "ЧГ=");
		Обл.Параметры.Оплата=Формат(СтрСв.Оплата, "ЧГ=");
		ТабДок.Вывести(Обл);
	
	КонецЦикла; 
	Обл=Макет.ПолучитьОбласть("Итого");
	
	Обл.Параметры.Бронирование=Формат(ТЗСверка.Итог("Проживание")+СуммаБрониДо, "ЧГ=");
	Обл.Параметры.Оплата=Формат(ТЗСверка.Итог("Оплата")+СуммаОплатДо, "ЧГ=");
	Обл.Параметры.Итого=Формат(ТЗСверка.Итог("Проживание")+СуммаБрониДо-ТЗСверка.Итог("Оплата")-СуммаОплатДо, "ЧГ=");
	ТабДок.Вывести(Обл);
	
	Если ТД тогда
	Возврат ТабДок;
иначе
	Возврат Новый Структура("Проживание,Оплата",ТЗСверка.Итог("Проживание"),ТЗСверка.Итог("Оплата"));
	конецесли;
КонецФункции


&НаСервере
Функция РассчитатьСуммуЗапроживание(СсылкаДок=Неопределено,ПеременныйТариф=Ложь) 
	СуммаОсн=0;
	
	//Если ПеременныйТариф Тогда
	//	Если СсылкаДок.КолВоЧеловек>1 тогда
	//		Если СсылкаДок.КатегорияНомера.Наименование="Стандартный" тогда
	//			БТ=КонстантБазовыйТарифБудни_XXХXХ.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходные.Получить();		
	//		ИначеЕсли СсылкаДок.КатегорияНомера.Наименование="Полулюкс" тогда
	//			БТ=Константы.БазовыйТарифБудниПолулюкс.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходныеПолулюкс.Получить();		
	//		ИначеЕсли СсылкаДок.КатегорияНомера.Наименование="Люкс" тогда
	//			БТ=Константы.БазовыйТарифБудниЛюкс.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходныеЛюкс.Получить();		
	//		КонецЕсли;
	//	иначе
	//		Если СсылкаДок.КатегорияНомера.Наименование="Стандартный" тогда
	//			БТ=Константы.БазовыйТарифБудниДвух.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходныеДвух.Получить();		
	//		ИначеЕсли СсылкаДок.КатегорияНомера.Наименование="Полулюкс" тогда
	//			БТ=Константы.БазовыйТарифБудниПолулюксДвух.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходныеПолулюксДвух.Получить();		
	//		ИначеЕсли СсылкаДок.КатегорияНомера.Наименование="Люкс" тогда
	//			БТ=Константы.БазовыйТарифБудниЛюксДвух.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходныеЛюксДвух.Получить();		
	//		КонецЕсли;
	//	КонецЕсли;
	//	ДТН=СсылкаДок.РезервС;
	//	ДатаПо=СсылкаДок.РезервПо;
	//	ЗапросЦен=Новый Запрос("ВЫБРАТЬ
	//	|	ЦеныПоДатам.ДатаЦены,
	//	|	ЦеныПоДатам.ПроцентИзменения
	//	|ИЗ
	//	|	РегистрСведений.ЦеныПоДатам КАК ЦеныПоДатам
	//	|ГДЕ
	//	|	ЦеныПоДатам.ДатаЦены = &ДатаЦены
	//	|	И ЦеныПоДатам.Категория = &Категория");
	//	ЗапросЦен.УстановитьПараметр("Категория",СсылкаДок.КатегорияНомера);					   
	//	Стоимость=0;
	//	Сч=0;
	//	Пока ДТН<=ДатаПо цикл
	//		ЗапросЦен.УстановитьПараметр("ДатаЦены",ДТН);
	//		ТЗЦ=ЗапросЦен.Выполнить().Выгрузить();
	//		Если ТЗЦ.Количество()=0 тогда
	//			//Сообщить("На дату " + Формат(ДТН, "ДФ=dd.MM.yy") + " не занесена цена");
	//			//Обл.Параметры.Стоимость="---";
	//			ЦенаДня=?(ДеньНедели(ДТН)<5,ОкруглитьЦену(БТ),ОкруглитьЦену(БТ_Вых));
	//			Стоимость=Стоимость+ЦенаДня;
	//		иначе
	//			ЦенаДня=?(ДеньНедели(ДТН)<5,ОкруглитьЦену(БТ+ТЗЦ[0].ПроцентИзменения/100),ОкруглитьЦену(БТ_Вых+ТЗЦ[0].ПроцентИзменения/100));
	//			Стоимость=Стоимость+ЦенаДня;
	//		КонецЕсли;
	//	    сч=сч+1;
	//		если сч>=СсылкаДок.КолВо тогда
	//			
	//		конецесли;
	//		
	//		ДТН=ДТН+86400;	
	//	КонецЦикла;
	//	СуммаОсн=Стоимость;
	//иначе
	//	
	//	СуммаИск=0;
	//	
	//	
	//	Для каждого СтрИскл Из СсылкаДок.Исключения Цикл
	//		
	//		СуммаИск=СуммаИск+СтрИскл.Тариф_НеИспользуется.Цена;
	//		
	//	КонецЦикла; 
	//	СуммаОсн=СсылкаДок.Тариф_НеИспользуется.Цена*(СсылкаДок.КолВо-СсылкаДок.Исключения.Количество())+СуммаИск;
	//	Если НЕ СсылкаДок.Оплачивает.Категория.Пустая() тогда
	//		СуммаОсн=Окр(СуммаОсн-СуммаОсн*(СсылкаДок.Оплачивает.Категория.Скидка/100));
	//	конецесли;
	//	Если СсылкаДок.ВидОплаты=Перечисления.ВидОплаты.Безнал и НЕ СсылкаДок.Турагентство.Пустая() тогда // дополнительно скидку турагенства
	//		СуммаОсн=Окр(-СуммаОсн*(СсылкаДок.Турагентство.Категория.Скидка/100));
	//		
	//		
	//	конецесли;
	//	
	//	
	//	
	//КонецЕсли; 
	//Возврат СуммаОсн;
КонецФункции

&НаСервереБезКонтекста
Функция ОкруглитьЦену(Цена)
	 
    Сотен = 100 * Цел(Цена/100);
    Рублей = Цена - Сотен;
    Если Рублей>=75 Тогда
        Рублей = 100;
    ИначеЕсли Рублей >= 25 Тогда
        Рублей = 50;
    Иначе
        Рублей = 0;        
    КонецЕсли;
    Возврат Сотен+Рублей;
КонецФункции


