//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
Элементы.Фото_1.РазмерКартинки = РазмерКартинки.Пропорционально;	
	
ОбновитьКоманда(Неопределено);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьКоманда(Команда)
Каталог = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_СКАНЫ");
	
ПоискФ = НайтиФайлы(Каталог, "*.jpg");
Для каждого Ф из ПоискФ цикл
	НовФ = Объект.СканыДокументов.Добавить();
	НовФ.ПутьДоФото=Ф.ПолноеИмя;
КонецЦикла;
КонецПроцедуры
//


//
&НаКлиенте
Процедура СканыДокументовПриАктивизацииСтроки(Элемент)
Если Элемент.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли; 

ПутьДоФото = Элемент.ТекущиеДанные.ПутьДоФото;

ПоказатьКартинку(ПутьДоФото, Фото_1);
КонецПроцедуры

&НаСервере
Процедура ПоказатьКартинку(ПутьДоКартинки, РеквизитКартинки) Экспорт
КартинкаЗначение = Новый Картинка(ПутьДоКартинки, Истина);
КартинкаАдрес = ПоместитьВоВременноеХранилище(КартинкаЗначение.ПолучитьДвоичныеДанные(), ЭтаФорма.УникальныйИдентификатор);
РеквизитКартинки = КартинкаАдрес;
КонецПроцедуры

&НаКлиенте
Процедура СканыДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СканыДокументовПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры


//
&НаКлиенте
Процедура ПрикрепитьФото(Команда)
ПрикрепитьФотоДействие();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФотоДействие()
Счетчик = 0;

//КаталогБаза = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
//КаталогПриемник = КаталогБаза + "SCAN\";
//КаталогАрхив = КаталогБаза + "SCAN_АРХИВ\";

КаталогПриемник = СлужебныеСервер.КаталогСканов();
КаталогАрхив = СлужебныеСервер.КаталогСкановАрхив();

МассивКУдалению = Новый Массив;
Для Каждого СтрФото Из Объект.СканыДокументов Цикл
	Если НЕ СтрФото.Клиент.Пустая() тогда
		
		Файл = Новый Файл(СтрФото.ПутьДоФото);
		ГУИДКлиентаСтрока = ГУИДКлиентаСтрока(СтрФото.Клиент);
		
		ПутьДоФото = ПереместитьФайлВПутьДоФото(Файл, КаталогПриемник, ГУИДКлиентаСтрока, КаталогАрхив);   
		Если ПутьДоФото = Неопределено Тогда
			Сообщить("Ошибка перемещения файла " + Файл.ПолноеИмя);
			
			Продолжить;
		КонецЕсли;
		
		ЗаписатьКлиентСканыДокументов(Счетчик, ПутьДоФото);
		
		МассивКУдалению.Добавить(СтрФото);

		Если НЕ ЕстьФормаКлиента(СтрФото.Клиент) Тогда 
			ПараметрФормы = Новый Структура("Ключ", СтрФото.Клиент);
			
			ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрФормы, ЭтаФорма);
		КонецЕсли;		
	КонецЕсли;
	
	Счетчик = Счетчик + 1; 
КонецЦикла;

Для Каждого Строка Из МассивКУдалению Цикл
	Объект.СканыДокументов.Удалить(Строка);
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФотоДействие_1()
Счетчик = 0;

//КаталогБаза = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
//КаталогПриемник = КаталогБаза + "SCAN\";
//КаталогАрхив = КаталогБаза + "SCAN_АРХИВ\";

КаталогПриемник = СлужебныеСервер.КаталогСканов();
КаталогАрхив = СлужебныеСервер.КаталогСкановАрхив();

МассивКУдалению = Новый Массив;
Для Каждого СтрФото Из Объект.СканыДокументов Цикл
	Если НЕ СтрФото.Клиент.Пустая() тогда
		
		Файл = Новый Файл(СтрФото.ПутьДоФото);
		ГУИДКлиентаСтрока = ГУИДКлиентаСтрока(СтрФото.Клиент);
		
		ПутьДоФото = ПереместитьФайлВПутьДоФото(Файл, КаталогПриемник, ГУИДКлиентаСтрока, КаталогАрхив);
		ЗаписатьКлиентСканыДокументов(Счетчик, ПутьДоФото);
		
		МассивКУдалению.Добавить(СтрФото);

		Если НЕ ЕстьФормаКлиента(СтрФото.Клиент) Тогда 
			ПараметрФормы = Новый Структура("Ключ", СтрФото.Клиент);
			
			ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрФормы, ЭтаФорма);
		КонецЕсли;		
	КонецЕсли;
	
	Счетчик = Счетчик + 1; 
КонецЦикла;

Для Каждого Строка Из МассивКУдалению Цикл
	Объект.СканыДокументов.Удалить(Строка);
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПереместитьФайлВПутьДоФото(Файл, КаталогПриемник, ГУИДКлиентаСтрока, КаталогАрхив)
ИмяФайла = Файл.Имя;
ИмяФайла = ГУИДКлиентаСтрока + "_" + ИмяФайла; 

НомерФайла = 0;
Пока Истина Цикл
	Если НомерФайла = 0 Тогда 
		ИмяФайла_П = ИмяФайла;
	Иначе
		ИмяФайла_П = ИмяФайла + "_" + Строка(НомерФайла);
	КонецЕсли;
	
	ПоискФайлов = НайтиФайлы(КаталогПриемник, ИмяФайла_П);
	Если ПоискФайлов.Количество() = 0 Тогда
		ИмяФайлаАрхив = КаталогАрхив + Файл.Имя;
		//КопироватьФайл(Файл.ПолноеИмя, ИмяФайлаАрхив);
Попытка
    КопироватьФайл(Файл.ПолноеИмя, ИмяФайлаАрхив);
Исключение                      
    Сообщить("Ошибка копирования в Архив: " + ОписаниеОшибки());    
    Возврат Неопределено;
КонецПопытки;
		
		ИмяФайлаПриемник = КаталогПриемник + ИмяФайла_П;
		//ПереместитьФайл(Файл.ПолноеИмя, ИмяФайлаПриемник); 
		
Попытка
    КопироватьФайл(Файл.ПолноеИмя, ИмяФайлаПриемник);
Исключение
    Сообщить("Ошибка копирования: " + ОписаниеОшибки());    
    Возврат Неопределено;
КонецПопытки;
Попытка
    УдалитьФайлы(Файл.ПолноеИмя);
Исключение
    Сообщить("Ошибка удаления: " + ОписаниеОшибки());
//    Возврат Неопределено;
КонецПопытки;
		               
		ПутьДоФото = ИмяФайла_П;
		
		Возврат ПутьДоФото; 
	КонецЕсли;

	НомерФайла = НомерФайла + 1;
КонецЦикла;

КонецФункции

&НаКлиенте
Функция ПереместитьФайлВПутьДоФото_1(Файл, КаталогПриемник, ГУИДКлиентаСтрока, КаталогАрхив)
ИмяФайла = Файл.Имя;
ИмяФайла = ГУИДКлиентаСтрока + "_" + ИмяФайла; 

НомерФайла = 0;
Пока Истина Цикл
	Если НомерФайла = 0 Тогда 
		ИмяФайла_П = ИмяФайла;
	Иначе
		ИмяФайла_П = ИмяФайла + "_" + Строка(НомерФайла);
	КонецЕсли;
	
	ПоискФайлов = НайтиФайлы(КаталогПриемник, ИмяФайла_П);
	Если ПоискФайлов.Количество() = 0 Тогда
		ИмяФайлаАрхив = КаталогАрхив + Файл.Имя;
		КопироватьФайл(Файл.ПолноеИмя, ИмяФайлаАрхив);
		
		ИмяФайлаПриемник = КаталогПриемник + ИмяФайла_П;
		ПереместитьФайл(Файл.ПолноеИмя, ИмяФайлаПриемник); 
		
		ПутьДоФото = ИмяФайла_П;
		
		Возврат ПутьДоФото; 
	КонецЕсли;

	НомерФайла = НомерФайла + 1;
КонецЦикла;

КонецФункции

&НаСервере
Функция ГУИДКлиентаСтрока(Клиент)
ГУИД = Клиент.УникальныйИдентификатор();

ГУИДКлиентаСтрока = Строка(ГУИД);
	
Возврат ГУИДКлиентаСтрока;	
КонецФункции


&НаКлиенте
Функция ЕстьФормаКлиента(Клиент)  
Окна = ПолучитьОкна();
Для Каждого ТекущееОкно Из Окна Цикл
	Если ТекущееОкно.Содержимое.Количество() > 0 Тогда
		ЭтоФормаКлиента = Ложь;
		Для каждого Форма Из ТекущееОкно.Содержимое Цикл
			Если Форма.Заголовок = "Клиент" Тогда ЭтоФормаКлиента = Истина; Прервать; КонецЕсли; 
		КонецЦикла;
		
		Если ЭтоФормаКлиента Тогда
			ФормаОбъект = Форма.Объект;
			ФормаКлиент = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ФормаОбъект, "Ссылка");			
			
			Если ФормаКлиент = Клиент Тогда
				Возврат Истина;
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;
КонецЦикла;	

Возврат Ложь;
КонецФункции

&НаСервере
Процедура ЗаписатьКлиентСканыДокументов(Счетчик, ПутьДоФото)
СтрФото = Объект.СканыДокументов[Счетчик]; 

Об = СтрФото.Клиент.ПолучитьОбъект();
НовФ=Об.СканыДокументов.Добавить();
НовФ.ПутьДоФото= ПутьДоФото;

НовФ.Комментарий=СтрФото.Комментарий;
Об.Записать();
КонецПроцедуры	


