
#Область ОбработчикиКомандФормы 

Процедура ВыполнитьОперациюЗавершениеПоУмолчанию(РезультатВыполнения, Параметры) Экспорт
	ФормаУникальныйИдентификатор = Параметры.ФормаУникальныйИдентификатор;
	Форма = НайтиУправляемуюФорму(ФормаУникальныйИдентификатор);

	Форма.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		
		ТипТранзакции = "";
		Если ЗначениеЗаполнено(Параметры) Тогда 
			Если Параметры.Свойство("ТипТранзакции") Тогда ТипТранзакции = Параметры.ТипТранзакции; КонецЕсли;
		КонецЕсли;	
		
		Если ТипТранзакции = "AuthorizeSales" 
		ИЛИ  ТипТранзакции = "AuthorizeRefund" 
		ИЛИ  ТипТранзакции = "AuthorizeVoid" 
		Тогда
			ЭТСервер.ЗаписатьОперацию(РезультатВыполнения, Параметры);
		КонецЕсли;
		
		Если ТипТранзакции = "AuthorizeSales" 
		ИЛИ  ТипТранзакции = "AuthorizeRefund" 
		ИЛИ  ТипТранзакции = "AuthorizeVoid" 
		Тогда
			ФорматированнаяСтрока = Новый ФорматированнаяСтрока("НЕ ЗАБУДЬТЕ ОФОРМИТЬ КАССОВЫЙ ЧЕК !!!"
				, Новый Шрифт(, 12, Истина), WebЦвета.Красный);
			ПоказатьПредупреждение(, ФорматированнаяСтрока); 
		КонецЕсли;
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

Процедура ВыполнитьОперациюПоПлатежнойКарте_Исходный(ТипТранзакции)
	
	ОчиститьСообщения();
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ТипТранзакции"               , ТипТранзакции);
	ПараметрыОперации.Вставить("УказатьДополнительныеДанные" , Истина);
	ПараметрыОперации.Вставить("ЗапретРедактированияСуммы"   , Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюПоПлатежнойКартеЗавершение", ЭтотОбъект, ПараметрыОперации);
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ", ПараметрыОперации,,,  ,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ВыполнитьОперациюПоПлатежнойКартеЗавершение_Исходный(Результат, Параметры) Экспорт
	
	//Если ТипЗнч(Результат) = Тип("Структура") Тогда
	//	
	//	Если НЕ Параметры.Свойство("ТипТранзакции") Тогда
	//		ТекстСообщения = НСтр("ru = 'Не указан тип транзакции.'");
	//		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Доступность = Ложь;
	//	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
	//	ПараметрыОперации.ТипТранзакции  = Параметры.ТипТранзакции;
	//	ПараметрыОперации.СуммаОперации  = Результат.Сумма;
	//	ПараметрыОперации.НомерЧека      = ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, "");
	//	ПараметрыОперации.НомерЧекаЭТ    = ?(Результат.Свойство("НомерЧекаЭТ"), Результат.НомерЧекаЭТ, "");

	//	ПараметрыОперации.СсылочныйНомер = Результат.СсылочныйНомер;
	//	
	//	Оповещение = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект);
	//	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОперациюПоПлатежнойКарте(Форма, ТипТранзакции, ИмяОповещенияОЗавершении)
	
	ОчиститьСообщения();
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ТипТранзакции"               , ТипТранзакции);
	
	ПараметрыОперации.Вставить("УказатьДополнительныеДанные" , Истина);
	Если ТипТранзакции = "AuthorizeSales" Тогда ПараметрыОперации.УказатьДополнительныеДанные = Ложь; КонецЕсли;
	
	ПараметрыОперации.Вставить("ЗапретРедактированияСуммы"   , Ложь);
	
	Если ТипТранзакции = "AuthorizeRefund" 
	ИЛИ  ТипТранзакции = "AuthorizeVoid" 
	Тогда
		ПараметрыОперации.Вставить("ПоказыватьНомерКарты" , Истина);
	КонецЕсли;	
		
	ПараметрыОперации.Вставить("ФормаУникальныйИдентификатор"   , Форма.УникальныйИдентификатор);
	
	ПараметрыОперации.Вставить("ИмяОповещенияОЗавершении"   , ИмяОповещенияОЗавершении);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюПоПлатежнойКартеЗавершение", ЭтотОбъект, ПараметрыОперации);
	
	Если ТипТранзакции = "AuthorizeSales"       
	ИЛИ  ТипТранзакции = "AuthorizeRefund" 
	ИЛИ  ТипТранзакции = "AuthorizeVoid" 
	Тогда
		//ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ_ПСН", ПараметрыОперации, Форма 
		//	,,  ,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ОткрытьФорму("ОбщаяФорма.ФормаАвторизацииЭТ_ПСН", ПараметрыОперации, Форма 
			,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		//ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ", ПараметрыОперации, Форма
		//	,,  ,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры


Процедура ВыполнитьОперациюПоПлатежнойКартеЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если НЕ Параметры.Свойство("ТипТранзакции") Тогда
			ТекстСообщения = НСтр("ru = 'Не указан тип транзакции.'");
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		//Форма = Результат.Форма;
		
		ФормаУникальныйИдентификатор = Параметры.ФормаУникальныйИдентификатор;
		Форма = НайтиУправляемуюФорму(ФормаУникальныйИдентификатор);
		
		Форма.Доступность = Ложь;
		
		ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
		ПараметрыОперации.ТипТранзакции  = Параметры.ТипТранзакции;
		ПараметрыОперации.СуммаОперации  = Результат.Сумма;
		ПараметрыОперации.НомерЧека      = ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, "");
		ПараметрыОперации.НомерЧекаЭТ    = ?(Результат.Свойство("НомерЧекаЭТ"), Результат.НомерЧекаЭТ, "");

		ПараметрыОперации.СсылочныйНомер = Результат.СсылочныйНомер;
		
		ДанныеОперации = Новый Структура();
		ДанныеОперации.Вставить("ТипТранзакции", Параметры.ТипТранзакции);
		ДанныеОперации.Вставить("ДанныеКарты", ?(Результат.Свойство("ДанныеКарты")  , Результат.ДанныеКарты, ""));
		ДанныеОперации.Вставить("ТипКарты", ?(Результат.Свойство("ТипКарты")  , Результат.ТипКарты, 0));
		ДанныеОперации.Вставить("НомерЧека", ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, ""));
		
		ДанныеОперации.Вставить("СсылочныйНомерВозврат", Результат.СсылочныйНомер);
		
		ДанныеОперации.Вставить("ФормаУникальныйИдентификатор",  Параметры.ФормаУникальныйИдентификатор);
		
		ДанныеОперации.Вставить("ЭтоКоворкинг",  Форма.ЭтоКоворкинг);
		
		//Оповещение = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект, ДанныеОперации);
		ИмяОповещенияОЗавершении = Параметры.ИмяОповещенияОЗавершении;
		Если ЗначениеЗаполнено(ИмяОповещенияОЗавершении) Тогда
			Оповещение = Новый ОписаниеОповещения(Параметры.ИмяОповещенияОЗавершении , Форма, ДанныеОперации);
		Иначе
			Оповещение = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершениеПоУмолчанию", ЭтотОбъект, ДанныеОперации);
		КонецЕсли;
		ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение
			, ФормаУникальныйИдентификатор, Неопределено, ПараметрыОперации);
		
	КонецЕсли;
	
КонецПроцедуры


Функция НайтиУправляемуюФорму(УникальныйИдентификатор) 
 
    Перем Окно, СодержимоеОкна;
 
    Для Каждого Окно Из ПолучитьОкна() Цикл
        Для Каждого СодержимоеОкна Из Окно.Содержимое Цикл
            Если ТипЗнч(СодержимоеОкна) = Тип("УправляемаяФорма")
                    И СодержимоеОкна.УникальныйИдентификатор = УникальныйИдентификатор Тогда
                Возврат СодержимоеОкна;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    Возврат Неопределено;
 
    // Для демонстрации
	//Сообщить(Формат(Отказ, "БЛ=Нашел!; БИ='Не нашел!'"));
 
КонецФункции

//
Процедура ОплатитьПлатежнойКартой(Форма, ИмяОповещенияОЗавершении) Экспорт
	
ВыполнитьОперациюПоПлатежнойКарте(Форма, "AuthorizeSales", ИмяОповещенияОЗавершении);
	
КонецПроцедуры

Процедура ВернутьПлатежПоКарте(Форма, ИмяОповещенияОЗавершении) Экспорт
	
ВыполнитьОперациюПоПлатежнойКарте(Форма, "AuthorizeRefund", ИмяОповещенияОЗавершении);
	
КонецПроцедуры

Процедура ОтменитьПлатежПоКарте(Форма, ИмяОповещенияОЗавершении) Экспорт
	
ВыполнитьОперациюПоПлатежнойКарте(Форма, "AuthorizeVoid", ИмяОповещенияОЗавершении);
	
КонецПроцедуры

//
Процедура ВыполнитьСверкуИтогов(Форма, ОповещениеОЗавершении) Экспорт     
	
	ОчиститьСообщения();
	Форма.Доступность = Ложь;
	
	//ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект);
	//ОписаниеОповещения = Новый ОписаниеОповещения(ИмяОповещенияОЗавершении, Форма);
	//ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОписаниеОповещения
	//	, Форма.УникальныйИдентификатор);
		
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОповещениеОЗавершении
		, Форма.УникальныйИдентификатор);
		
КонецПроцедуры

Функция ЗаписатьСверкуИтогов(РезультатВыполнения, Параметры) Экспорт
Если Параметры <> Неопределено Тогда
	Если Параметры.Свойство("ТипТранзакции") Тогда
		ТипТранзакции = Параметры.ТипТранзакции;
		
		Если ТипТранзакции = "СверкаИтогов" Тогда
			ЭТСервер.СверкаИтоговЗаписать(РезультатВыполнения, Параметры);
			
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецЕсли;	

Возврат Ложь;
КонецФункции

//

//Процедура НапечататьПоследнийСлипЧек(Форма, глПодключаемоеОборудование, ИмяОповещенияОЗавершении) Экспорт
Процедура НапечататьПоследнийСлипЧек(Форма, ИмяОповещенияОЗавершении) Экспорт
	
	ОчиститьСообщения();
	
	//Если Не ПустаяСтрока(глПодключаемоеОборудование.ПоследнийСлипЧек) Тогда  
	ПоследнийСлипЧек = ОборудованиеПлатежныеСистемыКлиент.ПоследнийСлипЧек(); 
	Если Не ПустаяСтрока(ПоследнийСлипЧек) Тогда  
		Доступность = Ложь;

		//ПараметрыОперации = Новый Структура("СтрокиТекста", глПодключаемоеОборудование.ПоследнийСлипЧек);    
		ПараметрыОперации = Новый Структура("СтрокиТекста", ПоследнийСлипЧек);    

		//Оповещение = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект);
		Оповещение = Новый ОписаниеОповещения(ИмяОповещенияОЗавершении, Форма);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(Оповещение, Форма.УникальныйИдентификатор, Неопределено, ПараметрыОперации);
	Иначе
		ТекстСообщения = НСтр("ru = 'Отсутствует последний слип чек.'");
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры




//// ?????
Процедура ВыполнитьПреавторизацию(Форма, ИмяОповещенияОЗавершении)
	
	ВыполнитьОперациюПоПлатежнойКарте(Форма, "AuthorizePreSales", ИмяОповещенияОЗавершении);
	
КонецПроцедуры

Процедура ЗавершитьПреавторизацию(Форма, ИмяОповещенияОЗавершении)
	
	ВыполнитьОперациюПоПлатежнойКарте(Форма, "AuthorizeCompletion", ИмяОповещенияОЗавершении);
	
КонецПроцедуры

Процедура ОтменитьПреавторизацию(Форма, ИмяОповещенияОЗавершении)
	
	ВыполнитьОперациюПоПлатежнойКарте(Форма, "AuthorizeVoidPreSales", ИмяОповещенияОЗавершении);
	
КонецПроцедуры

// + Не нужно
Процедура ОтменитьОперацию() 
//Если РезультатЭТ И Не РезультатФР Тогда
//  ОписаниеОшибкиФР = ВыходныеПараметры[1];
//  ВходныеПараметры = Новый Массив();
//  ВыходныеПараметры = Неопределено;
//  ВходныеПараметры.Добавить(СуммаОперации);
//  ВходныеПараметры.Добавить(НомерСсылкиОперации);
//  ВходныеПараметры.Добавить(НомерЧекаЭТ);
//  МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваЭТ,
//"EmergencyVoid",
//ВходныеПараметры,
//ВыходныеПараметры);
//  ТекстСообщения = НСтр("ru = 'При печати слип-чека возникла ошибка:
//  |""%ОписаниеОшибки%"".
//  |Операция по карте была отменена.'");
//  ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибкиФР);
//  ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
//КонецЕсли;
КонецПроцедуры
// - Не нужно

#КонецОбласти