
Процедура ПриОткрытии___()
	////КнопкаВыполнитьНажатие(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если Параметры.Свойство("ЗавершитьРаботу") Тогда	
	 ЗавершитьРаботу = Параметры.ЗавершитьРаботу;
Иначе
	 ЗавершитьРаботу = Ложь;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ВыполнитьКомандаНаСервере();

Если ЗавершитьРаботу Тогда
	Отказ = Истина;	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыполнитьНажатие___(Кнопка)
	//ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                               |	ЗанятостьНомеров.Клиент,
	//                               |	ЗанятостьНомеров.Номер КАК Номер,
	//                               |	ЗанятостьНомеров.Регистратор,
	//                               |	ЗанятостьНомеров.Регистратор.РаздельныеКровати КАК РК
	//                               |ИЗ
	//                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//                               |ГДЕ
	//                               |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//                               |	И ЗанятостьНомеров.Регистратор.Статус = &Статус
	//                               |
	//                               |УПОРЯДОЧИТЬ ПО
	//                               |	ЗанятостьНомеров.Номер.Наименование");
	//ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
	//ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
	//ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));

	//СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
	// ОчиститьЗначки();
	//Для каждого Стр Из СписокПроживающих Цикл
	//     //Сообщить(Стр.Регистратор.РезервС);
	//	 Если Час(Стр.Регистратор.ВремяЗаездаТочное)<5 тогда
	//		ДатаСКоторойСчитать=НачалоДня(Стр.Регистратор.ВремяЗаездаТочное)-86400;
	//	иначе
	//		ДатаСКоторойСчитать=НачалоДня(Стр.Регистратор.ВремяЗаездаТочное);
	//	конецесли;
	//	Если НачалоДня(Стр.Регистратор.РезервПО)=НачалоДня(ТекущаяДата()) тогда
	//		Продолжить;
	//	конецесли;
	//		РазницаДат=Окр((НачалоДня(ТекущаяДата())-ДатаСКоторойСчитать)/84600);
	////	Если 
	//	КолВоДат=3;
	//	Если Стр.Регистратор.НомерВРезерв.КатегорияНомера.Наименование="Люкс" тогда
	//		КолВоДат=1;
	//	ИначеЕсли Стр.Регистратор.НомерВРезерв.КатегорияНомера.Наименование="Полулюкс" тогда
	//		КолВоДат=2;
	//	иначеЕсли Цел(Стр.Регистратор.КолВо)=4 тогда
	//		КолВоДат=2;
	//	КонецЕсли;
	//	
	//	Если РазницаДат>=КолВоДат  и (РазницаДат/КолВоДат=Окр(РазницаДат/КолВоДат)) тогда

	////	Если НачалоДня(ТекущаяДата())-ДатаСКоторойСчитать>=3*84600 тогда
	//		Сообщить(Стр.Регистратор.НомерВРезерв);
	//		СоздатьЗаданиеГорничной(Стр.Номер,"Необходимо осуществить смену белья");
	//		СоздатьЗначок(Стр.Номер,"fa-bed");
	//		
	//	конецесли;
	//	
	//
	//КонецЦикла; 
	//
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
ВыполнитьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандаНаСервере()
	ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	ЗанятостьНомеров.Клиент,
	                               |	ЗанятостьНомеров.Номер КАК Номер,
	                               |	ЗанятостьНомеров.Регистратор,
	                               |	ЗанятостьНомеров.Регистратор.РаздельныеКровати КАК РК
	                               |ИЗ
	                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                               |ГДЕ
	                               |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                               |	И ЗанятостьНомеров.Регистратор.Статус = &Статус
	                               |
	                               |УПОРЯДОЧИТЬ ПО
	                               |	ЗанятостьНомеров.Номер.Наименование");
	ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
	ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
	ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));

	СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
	ОбщееСервер.ОчиститьЗначки();
	Для каждого Стр Из СписокПроживающих Цикл
	     //Сообщить(Стр.Регистратор.РезервС);
		 Если Час(Стр.Регистратор.ВремяЗаездаТочное)<5 тогда
			ДатаСКоторойСчитать=НачалоДня(Стр.Регистратор.ВремяЗаездаТочное)-86400;
		иначе
			ДатаСКоторойСчитать=НачалоДня(Стр.Регистратор.ВремяЗаездаТочное);
		конецесли;
		Если НачалоДня(Стр.Регистратор.РезервПО)=НачалоДня(ТекущаяДата()) тогда
			Продолжить;
		конецесли;
			РазницаДат=Окр((НачалоДня(ТекущаяДата())-ДатаСКоторойСчитать)/84600);
	//	Если 
		КолВоДат=3;
		Если Стр.Регистратор.НомерВРезерв.КатегорияНомера.Наименование="Люкс" тогда
			КолВоДат=1;
		ИначеЕсли Стр.Регистратор.НомерВРезерв.КатегорияНомера.Наименование="Полулюкс" тогда
			КолВоДат=2;
		иначеЕсли Цел(Стр.Регистратор.КолВо)=4 тогда
			КолВоДат=2;
		КонецЕсли;
		
		Если РазницаДат>=КолВоДат  и (РазницаДат/КолВоДат=Окр(РазницаДат/КолВоДат)) тогда

	//	Если НачалоДня(ТекущаяДата())-ДатаСКоторойСчитать>=3*84600 тогда
			Сообщить(Стр.Регистратор.НомерВРезерв);
			ОбщееСервер.СоздатьЗаданиеГорничной(Стр.Номер,"Необходимо осуществить смену белья");
			ОбщееСервер.СоздатьЗначок(Стр.Номер,"fa-bed");
		 	
		конецесли;
		
	
	КонецЦикла; 
	
КонецПроцедуры



