
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = Истина;	
	
Параметры.Свойство("РезервС", РезервС);	
Параметры.Свойство("РезервПо", РезервПо);	
Параметры.Свойство("ВремяЗаезда", ВремяЗаезда);	
Параметры.Свойство("ВремяВыезда", ВремяВыезда);	

Параметры.Свойство("БонШанс", БонШанс);	

//Параметры.Свойство("Курящий", Курящий);
Параметры.Свойство("КатегорияНомера", КатегорияНомера);

Ответ = ДокументыСервер.ЗанятостьНомераПериодРезерва(РезервС, РезервПо, ВремяЗаезда, ВремяВыезда);  

НачалоПериодаРезерва = Ответ.НачалоПериодаРезерва;
КонецПериодаРезерва = Ответ.КонецПериодаРезерва;

Если БонШанс Тогда
	Если НачалоПериодаРезерва > КонецПериодаРезерва Тогда  
		НачалоПериодаРезерва = НачалоДня(РезервС) + 3600 * 13;
		КонецПериодаРезерва = НачалоДня(РезервС) + 3600 * 18;
	КонецЕсли;	
КонецЕсли;
	
Список.Параметры.УстановитьЗначениеПараметра("ПериодРезерваС", НачалоПериодаРезерва);
Список.Параметры.УстановитьЗначениеПараметра("ПериодРезерваПо", КонецПериодаРезерва);
Список.Параметры.УстановитьЗначениеПараметра("БонШанс", БонШанс);

УсловноеОформлениеЗагрузить();
КонецПроцедуры

//
&НаСервере
Процедура УсловноеОформлениеЗагрузить()
УсловноеОформление.Элементы.Очистить();

ЭлементыТабНаФормеИмя = Элементы.Список.Имя;

ПутьКПолюОтбора = "Список.Зарезервирован";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;
ПравоеЗначение = Истина;
Web_Цвета = WebЦвета.БледноКрасноФиолетовый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	, ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета );
КонецПроцедуры
//


&НаКлиенте
Процедура ОбновитьФорму()
//ОбщийФункционалКлиент.ЗаполнитьЭлементОтбораСписок(Список, "КатегорияНомера", КатегорияНомера
//	, ВидСравненияКомпоновкиДанных.Равно, Истина); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНомераЭлементПриИзменении(Элемент)
ОбновитьФорму();
КонецПроцедуры


&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
Если Элемент.ТекущиеДанные.Зарезервирован Тогда 
	СтандартнаяОбработка = Ложь;
	ПоказатьПредупреждение(,"Номер зарезервирован");
	
	Возврат; 
КонецЕсли;

// + Нет разделения номеров для курящих и некурящих 
Возврат;
// - Нет разделения номеров для курящих и некурящих 

Если Элемент.ТекущиеДанные.Курящий <> Курящий Тогда
	СтандартнаяОбработка = Ложь;
	Если НЕ ДоступныВсе Тогда 
		ТекстПредупреждения = "Номер для " + ?(Элемент.ТекущиеДанные.Курящий, "курящих", "некурящих") 
			+ Символы.ПС + Символы.ПС + "Для выбора номера отметьте 'Доступны Все'"; 
		ПоказатьПредупреждение(, ТекстПредупреждения );
		
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаБудетВыбранНомер", ЭтаФорма);
	ТекстВопроса = "Будет выбран номер для " + ?(Элемент.ТекущиеДанные.Курящий, "курящих", "некурящих") + " ?";
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);  
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаБудетВыбранНомер(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Ссылка);	
КонецПроцедуры

