
Функция ТоварЕдиницаИзмеренияКоворкинг(ДокументДолгСсылка)
ИмяКоврокинга = "";

ЭтоРеноме = НастройкиСервер.ЭтоРеноме();
Если ЭтоРеноме Тогда
	ИмяКоврокинга = "Renomme ";
ИначеЕсли НастройкиСервер.ЭтоЛайв() Тогда
	ИмяКоврокинга = "Live ";
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда
	ИмяКоврокинга = "Street Art ";
КонецЕсли;

Если ЭтоРеноме И ДокументДолгСсылка.ПочасоваяОплата Тогда
	Товар = "Аренда переговорной комнаты";	
Иначе
	Товар = "Аренда офиса " + ?(ЗначениеЗаполнено(ДокументДолгСсылка.КоворкингЗаявка.КоворкингНомер.НаименованиеДляСчета)
								, ДокументДолгСсылка.КоворкингЗаявка.КоворкингНомер.НаименованиеДляСчета
								,ДокументДолгСсылка.КоворкингЗаявка.КоворкингНомер.Наименование)
		+ " в коворкинге " + ИмяКоврокинга; 
КонецЕсли;

Если ДокументДолгСсылка.ПочасоваяОплата Тогда
	Товар = Товар + " " + Формат(ДокументДолгСсылка.ДатаС, "ДФ=dd.MM.yy")
		+ " c " + Строка(ДокументДолгСсылка.ЧасС) 
		+ " по " + Строка(ДокументДолгСсылка.ЧасПо) + " ч.";
		
	ЕдиницаИЗмерения = "час";
Иначе	
	Товар = Товар + "c " + Формат(ДокументДолгСсылка.ДатаС, "ДФ=dd.MM.yy") 
			+ "  по " + Формат(ДокументДолгСсылка.ДатаПо, "ДФ=dd.MM.yy");
	ЕдиницаИЗмерения = "услуга";
КонецЕсли;
		
Возврат Новый Структура("Товар, ЕдиницаИЗмерения", Товар, ЕдиницаИЗмерения) ;		
КонецФункции

Процедура ПечатьКоворкингТело(ТабДок, Макет, ДокументДолгСсылка, ПечататьВсегоКОплате)

ДатаУчетаНДС = ДокументДолгСсылка.ДатаПо;	
СтавкаНДС = ДокументыСервер.СтавкаНДС(Истина); СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
УчитыватьНДС = ДокументыСервер.УчитыватьНДС(ДокументДолгСсылка.ДатаПо);

Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
ОбластьПовтора = ТабДок.Вывести(Область);
ТабДок.ПовторятьПриПечатиСтроки = ОбластьПовтора;

СуммаИтого = 0;
СуммаИтогоНДС = 0;
НомерСтроки = 0;

Если ДокументДолгСсылка.Сумма <> 0 Тогда
	СтрокаТабл = Макет.ПолучитьОбласть("Строка");

	НомерСтроки = НомерСтроки + 1;
	СтрокаТабл.Параметры.НомерСтроки = НомерСтроки;

	ТоварЕдиницаИзмерения = ТоварЕдиницаИзмеренияКоворкинг(ДокументДолгСсылка);
	СтрокаТабл.Параметры.Товар = ТоварЕдиницаИзмерения.Товар;
	СтрокаТабл.Параметры.ЕдиницаИзмерения = ТоварЕдиницаИзмерения.ЕдиницаИзмерения;

	СтрокаТабл.Параметры.Количество = ДокументДолгСсылка.Количество;

	СтрокаТабл.Параметры.Цена = ДокументДолгСсылка.Цена;
	СтрокаТабл.Параметры.Сумма = ДокументДолгСсылка.Сумма;

	Если УчитыватьНДС Тогда
		СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, ДокументДолгСсылка.Сумма); 
	Иначе 	
		СуммаНДС = 0;	
	КонецЕсли;

	ТабДок.Вывести(СтрокаТабл);

	СуммаИтого = СуммаИтого + ДокументДолгСсылка.Сумма; 
	СуммаИтогоНДС = СуммаИтогоНДС + СуммаНДС; 
КонецЕсли;

Для Каждого Строка Из ДокументДолгСсылка.ДопУслугиКоворкинг Цикл
	СтрокаТабл = Макет.ПолучитьОбласть("Строка");
	
	НомерСтроки = НомерСтроки + 1;
	СтрокаТабл.Параметры.НомерСтроки = НомерСтроки;
	
	СтрокаТабл.Параметры.Товар = Строка.Услуга;
	СтрокаТабл.Параметры.ЕдиницаИзмерения = "услуга";

	СтрокаТабл.Параметры.Количество = Строка.Количество;

	СтрокаТабл.Параметры.Цена = Строка.Цена;
	СтрокаТабл.Параметры.Сумма = Строка.Сумма;
	
	Если УчитыватьНДС Тогда
		СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, Строка.Сумма); 
	Иначе
		СуммаНДС = 0;
	КонецЕсли;	
	ТабДок.Вывести(СтрокаТабл);
	
	СуммаИтого = СуммаИтого + Строка.Сумма;	
	
	СуммаИтогоНДС = СуммаИтогоНДС + СуммаНДС; 
КонецЦикла;

СчетчикСтрок = НомерСтроки;

ИтогоСтр=Макет.ПолучитьОбласть("Итого");
ИтогоСтр.Параметры.Всего = СуммаИтого;

Если УчитыватьНДС Тогда
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС 
	ИЛИ  СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка()
	Тогда 
		ИтогоСтр.Параметры.ВсегоНДСТекст = "Без налога (НДС):";
		ИтогоСтр.Параметры.ВсегоНДССумма = "-";
	Иначе
		Если СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
			ВсегоНДСТекст = "В том числе НДС 22%:";	
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
			ВсегоНДСТекст = "В том числе НДС 20%:";	
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
			ВсегоНДСТекст = "В том числе НДС 5%:";		
		КонецЕсли;	
		ИтогоСтр.Параметры.ВсегоНДСТекст = ВсегоНДСТекст;
		ИтогоСтр.Параметры.ВсегоНДССумма =СуммаИтогоНДС;
	КонецЕсли;
Иначе
	ИтогоСтр.Параметры.ВсегоНДСТекст = "Без налога (НДС):";
	ИтогоСтр.Параметры.ВсегоНДССумма = "-";
КонецЕсли;
Если ПечататьВсегоКОплате Тогда 
	ИтогоСтр.Параметры.ВсегоКОплате =СуммаИтого;
КонецЕсли;
ТабДок.Вывести(ИтогоСтр);

ИтогоСтр=Макет.ПолучитьОбласть("СуммаПрописью");  
ИтогоСтр.Параметры.ИтоговаяСтрока="Всего "+Строка(СчетчикСтрок) + " наименований на сумму:";
ИтогоСтр.Параметры.СуммаПрописью=ЧислоПрописью(СуммаИтого,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
ТабДок.Вывести(ИтогоСтр);
КонецПроцедуры

//
Функция ТабличныйДокументСчетКоворкинг(ДокументДолгСсылка) Экспорт
ТабДок = Новый ТабличныйДокумент;

ПечатьСчета_СчетКоворкинг(ТабДок, ДокументДолгСсылка);
	
ТабДок.ОтображатьСетку = Ложь; ТабДок.Защита = Ложь; ТабДок.ТолькоПросмотр = Истина; ТабДок.ОтображатьЗаголовки = Ложь;

Возврат ТабДок;	
КонецФункции	

Процедура ПечатьСчета_СчетКоворкинг(ТабДок,  ДокументДолгСсылка) Экспорт
МакСчетЮрЛицо = "СчетКоворкинг";
МакСчетФизЛицо = "СчетКоворкинг";

Оплачивает = КоворкингСервер.ОплачиваетСчет(ДокументДолгСсылка);
Если Оплачивает.ТипКлиента = Перечисления.ТипыКлиентов.ПустаяСсылка() Тогда
	Сообщить("У клиента: " + Оплачивает + " не заполнен 'Тип клиента'. ПЕЧАТЬ СЧЕТА ОТМЕНЯЕТСЯ ...");
	
	Возврат;
КонецЕсли;

ОплачиваетЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Оплачивает);
Если ОплачиваетЮрЛицо Тогда
	//МакетЮрЛицо = ПолучитьМакетДокументаСчетКоворкинг(МакСчетЮрЛицо);
	МакетЮрЛицо = ПолучитьОбщийМакет(МакСчетЮрЛицо);
	
	ПечатьСчетаЮрЛицо_СчетКоворкинг(ТабДок, МакетЮрЛицо, ДокументДолгСсылка); 
	
Иначе	
	//МакетФизЛицо = ПолучитьМакетДокументаСчетКоворкинг(МакСчетФизЛицо);
	МакетФизЛицо = ПолучитьОбщийМакет(МакСчетФизЛицо);

	ПечатьСчетаФизЛицо_СчетКоворкинг(ТабДок, МакетФизЛицо, ДокументДолгСсылка);
КонецЕсли;
КонецПроцедуры

Функция ПолучитьМакетДокументаСчетКоворкинг(ИмяМакета) Экспорт
МакетИмя = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();	
МакетИмя = ИмяМакета + "_" + МакетИмя;

Макет = Документы.КоворкингСчета.ПолучитьМакет(МакетИмя);
Возврат Макет;
КонецФункции


//
Процедура ПечатьСчетаЮрЛицо_СчетКоворкинг(ТабДок, Макет, ДокументДолгСсылка) Экспорт
ТекстЗаголовка = ПечатьСчетаЮрЛицоШапка_СчетКоворкинг(ТабДок, Макет, ДокументДолгСсылка);	

//СчетчикСтрок = 0; СуммаИтого = 0;
//ПечатьСчетаЮрЛицоСтроки_СчетКоворкинг(ТабДок, Макет, СчетчикСтрок, СуммаИтого, ДокументДолгСсылка); 	
ПечатьКоворкингТело(ТабДок, Макет, ДокументДолгСсылка, Истина); 	

ПечатьСчетаЮрЛицоПодвал_СчетКоворкинг(ТабДок, Макет); 
КонецПроцедуры

Функция ПечатьСчетаЮрЛицоШапка_СчетКоворкинг(ТабДок, Макет, ДокументДолгСсылка)  Экспорт  
НомерСчета = ДокументДолгСсылка.Номер;
ДатаСчета = ДокументДолгСсылка.Дата;

Оплачивает = КоворкингСервер.ОплачиваетСчет(ДокументДолгСсылка);	

//ДанныеОрганизация = Справочники.Организации.ПолучитьДанныеОрганизации(Истина);
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

Область = Макет.ПолучитьОбласть("ЗаголовокСчета");
Область.Параметры.ЗаголовокСчета = "Коворкинг " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " ИНН " + ТекущаяОрганизация.КоворкингИНН 
	+ ?(ЗначениеЗаполнено(ТекущаяОрганизация.КоворкингКПП), " КПП " + ТекущаяОрганизация.КоворкингКПП, "")
	+ " " + ТекущаяОрганизация.КоворкингОрганизацияДляДокументов
	+ Символы.ПС + ТекущаяОрганизация.КоворкингАдресДляДокументов;	
	;
	
Область.Параметры.Получатель = "Коворкинг " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " ИНН " + ТекущаяОрганизация.КоворкингИНН 
	+ ?(ЗначениеЗаполнено(ТекущаяОрганизация.КоворкингКПП), " КПП " + ТекущаяОрганизация.КоворкингКПП, "")
	+ " " + ТекущаяОрганизация.КоворкингОрганизацияДляДокументов
	;	

Область.Параметры.БанкПолучателя = ТекущаяОрганизация.КоворкингСчетБанкПолучателя;
Область.Параметры.БИКБанкаПолучателя = ТекущаяОрганизация.КоворкингСчетБИКБанкаПолучателя;	
Область.Параметры.КорСчетБанкаПолучателя = ТекущаяОрганизация.КоворкингСчетКорСчетБанкаПолучателя;	
Область.Параметры.СчетБанкаПолучателя = ТекущаяОрганизация.КоворкингСчетСчетБанкаПолучателя;	
Область.Параметры.ЗаголовокИНН = ТекущаяОрганизация.КоворкингИНН;	
Область.Параметры.ЗаголовокКПП = ТекущаяОрганизация.КоворкингКПП;	

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Заголовок");
ТекстЗаголовка="Счет № " + НомерСчета + " от " + Формат(ДатаСчета, "ДФ=dd.MM.yy");	
Область.Параметры.ТекстЗаголовка = ТекстЗаголовка; 
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Поставщик");
ПредставлениеПолучателя = ОбщееСервер.ПолучитьПредставлениеКлиента(Оплачивает);
Область.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Покупатель");
//Область.Параметры.ПредставлениеПолучателя=ОбщийМодульСервер.ПолучитьПредставлениеКлиента(Клиент);	
//ТабДок.Вывести(Область);

Возврат ТекстЗаголовка;  
КонецФункции

Процедура ПечатьСчетаЮрЛицоПодвал_СчетКоворкинг(ТабДок, Макет) 
ИтогоСтр=Макет.ПолучитьОбласть("ПодвалСчета");
ТабДок.Вывести(ИтогоСтр);

Папка_C_BASE = ОбщееСервер.КаталогИБ();
Если НастройкиСервер.ЭтоРеноме() Тогда
	Печать = Новый Картинка(Папка_C_BASE + "ОбразцыДокументов\Печать ГУК.png"); 
Иначе
	Печать = Новый Картинка(Папка_C_BASE + "ОбразцыДокументов\Печать Новые отели.bmp"); 
КонецЕсли;

ОбластьКартинка=Макет.ПолучитьОбласть("ОбластьКартинка");  
ОбластьКартинка.Рисунки.Печать.Картинка  = Печать; 
ТабДок.Вывести(ОбластьКартинка); 
КонецПроцедуры
//

//
Процедура ПечатьСчетаФизЛицо_СчетКоворкинг(ТабДок, Макет, ДокументДолгСсылка) Экспорт
ТекстЗаголовка = ПечатьСчетаФизЛицоШапка_СчетКоворкинг(ТабДок, Макет, ДокументДолгСсылка);	

ПечатьКоворкингТело(ТабДок, Макет, ДокументДолгСсылка, Истина); 	

ПечатьСчетаФизЛицоПодвал_СчетКоворкинг(ТабДок, Макет);	
КонецПроцедуры

Функция ПечатьСчетаФизЛицоШапка_СчетКоворкинг(ТабДок, Макет, ДокументДолгСсылка) Экспорт
НомерСчета = ДокументДолгСсылка.Номер;
ДатаСчета = ДокументДолгСсылка.Дата;
Оплачивает = КоворкингСервер.ОплачиваетСчет(ДокументДолгСсылка);	

//ДанныеОрганизации = Справочники.Организации.ПолучитьДанныеОрганизации(Истина);
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

Область = Макет.ПолучитьОбласть("ЗаголовокСчета");
Область.Параметры.ЗаголовокСчета = "Коворкинг " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " ИНН " + ТекущаяОрганизация.КоворкингИНН 
	+ ?(ЗначениеЗаполнено(ТекущаяОрганизация.КоворкингКПП), " КПП " + ТекущаяОрганизация.КоворкингКПП, "")
	+ " " + ТекущаяОрганизация.КоворкингОрганизацияДляДокументов
	+ Символы.ПС + ТекущаяОрганизация.КоворкингАдресДляДокументов;
	;
	
Область.Параметры.Получатель = "Коворкинг " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " " + ТекущаяОрганизация.КоворкингОрганизацияДляДокументов
	+ " ИНН " + ТекущаяОрганизация.КоворкингИНН 
	+ ?(ЗначениеЗаполнено(ТекущаяОрганизация.КоворкингКПП), " КПП " + ТекущаяОрганизация.КоворкингКПП, "")
	;

Область.Параметры.БанкПолучателя = ТекущаяОрганизация.КоворкингСчетБанкПолучателя;	
Область.Параметры.БИКБанкаПолучателя = ТекущаяОрганизация.КоворкингСчетБИКБанкаПолучателя;	
Область.Параметры.КорСчетБанкаПолучателя = ТекущаяОрганизация.КоворкингСчетКорСчетБанкаПолучателя;	
Область.Параметры.СчетБанкаПолучателя = ТекущаяОрганизация.КоворкингСчетСчетБанкаПолучателя;	
ТабДок.Вывести(Область);
Область = Макет.ПолучитьОбласть("Заголовок");

ТекстЗаголовка="Счет № " + НомерСчета + " от " + Формат(ДатаСчета, "ДФ=dd.MM.yy");	
Область.Параметры.ТекстЗаголовка = ТекстЗаголовка;	
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Поставщик");
ПредставлениеПолучателя = ОбщееСервер.ПолучитьПредставлениеКлиента(Оплачивает);
Область.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Покупатель");
//Область.Параметры.ПредставлениеПолучателя=ОбщийМодульСервер.ПолучитьПредставлениеКлиента(Клиент);	
//ТабДок.Вывести(Область);

Возврат ТекстЗаголовка;  
КонецФункции

Функция ПечатьСчетаФизЛицоПодвал_СчетКоворкинг(ТабДок, Макет) 
ИтогоСтр=Макет.ПолучитьОбласть("ПодвалСчета");
ТабДок.Вывести(ИтогоСтр);

ТабДок.ОтображатьСетку = Ложь;
ТабДок.Защита = Ложь;
ТабДок.ТолькоПросмотр = Истина;
ТабДок.ОтображатьЗаголовки = Ложь;
КонецФункции
//

//
Функция ПечатьАктаДействие(КоворкингОбъект) Экспорт
ТабДок = Новый ТабличныйДокумент;

//МакАкт="Акт";
//Макет = КоворкингПечатьСервер.ПолучитьМакетДокументаСчетКоворкинг(МакАкт);
Макет = ПолучитьОбщийМакет("АктКоворкинг");

ДатаУчетаНДС = КоворкингОбъект.ДатаПо;
СтавкаНДС = ДокументыСервер.СтавкаНДС(Истина);  СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);

УчитыватьНДС =  ДокументыСервер.УчитыватьНДС(КоворкингОбъект.ДатаПо);

НомерАкта = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(КоворкингОбъект.Номер);
ДатаАкта = НачалоДня(КоворкингОбъект.ДатаПо);

Если ЗначениеЗаполнено(КоворкингОбъект.ОплачиваетСчет) Тогда 
	Контрагент = КоворкингОбъект.ОплачиваетСчет;	
Иначе
	Контрагент = КоворкингОбъект.КоворкингЗаявка.Клиент;	
КонецЕсли;

ТекстЗаголовка = ПечатьАкта_Шапка(ТабДок, Макет, НомерАкта, ДатаАкта, Контрагент);  

СчетчикСтрок = 0; СуммаИтого = 0;
ПечатьКоворкингТело(ТабДок, Макет, КоворкингОбъект, Ложь);

ПечатьАкта_Подвал(ТабДок, Макет, ТекстЗаголовка); 

Возврат ТабДок;
КонецФункции

Функция ПечатьАкта_Шапка(ТабДок, Макет, Номер, Дата, Контрагент) 
// Заголовок

//ДанныеОрганизации = Справочники.Организации.ПолучитьДанныеОрганизации(Истина);
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

ТекстЗаголовка="Акт № " + Номер + " от "+ Формат(Дата, "ДФ=dd.MM.yy");

Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.ТекстЗаголовка = ТекстЗаголовка;
Область.Параметры.ЗаголовокАкт = "Коворкинг " + ТекущаяОрганизация.НаименованииеОтеляДляДокументов 
	+ " ИНН " + ТекущаяОрганизация.КоворкингИНН + " КПП " + ТекущаяОрганизация.КоворкингКПП
	+ " " + ТекущаяОрганизация.КоворкингОрганизацияДляДокументов; 
Область.Параметры.АдресАкт = ТекущаяОрганизация.КоворкингАдресДляДокументов;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Покупатель");
ПредставлениеКлиента = ОбщееСервер.ПолучитьПредставлениеКлиента(Контрагент);	

Область.Параметры.Заказчик = ПредставлениеКлиента;	
ТабДок.Вывести(Область);

Возврат ТекстЗаголовка;
КонецФункции

Функция ПечатьАкта_Подвал(ТабДок, Макет, ТекстЗаголовка)

ИтогоСтр=Макет.ПолучитьОбласть("Подписи");
ТабДок.Вывести(ИтогоСтр);

ТабДок.ВерхнийКолонтитул.ТекстВЦентре = ТекстЗаголовка;
ТабДок.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
ТабДок.ВерхнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.ВерхнийКолонтитул.Шрифт = мШрифт;
//ТабДок.ВерхнийКолонтитул.Выводить = Истина;
ТабДок.ВерхнийКолонтитул.Выводить = Ложь;

ТабДок.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы] из [&СтраницВсего]";
ТабДок.НижнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.НижнийКолонтитул.Шрифт = мШрифт;
//ТабДок.НижнийКолонтитул.Выводить = Истина;
ТабДок.НижнийКолонтитул.Выводить = Ложь;

Возврат ТабДок;
КонецФункции
//


Функция НомерДатаДокумента(Документ) Экспорт
НомерДокумента = ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(Документ.Номер);
ДатаДокумента = Документ.ДатаПо;

Возврат Новый Структура("Номер, Дата", НомерДокумента, ДатаДокумента);  
КонецФункции



//Функция СчетФактураСтроки(ТабДок, Номер, Дата
//	, Контрагент, ДокументОтгрузки, ДокументДолгСсылка) Экспорт
Функция СчетФактураСтроки(ДокументДолгСсылка, ИтогоСуммаБезНДС, ИтогоСуммаНДС, ИтогоСумма) Экспорт

СтавкаНДС = ДокументыСервер.СтавкаНДС(Истина); 

ДатаУчетаНДС = Неопределено;
Если ТипЗнч(ДокументДолгСсылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	ДатаУчетаНДС = ДокументДолгСсылка.РезервПо;
ИначеЕсли ТипЗнч(ДокументДолгСсылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда
	ДатаУчетаНДС = ДокументДолгСсылка.ДатаПо;
ИначеЕсли ТипЗнч(ДокументДолгСсылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	ДатаУчетаНДС = ГрупповойСчетСервер.ДатаУчетаНДС(ДокументДолгСсылка);
КонецЕсли;		

Если ЗначениеЗаполнено(ДатаУчетаНДС) Тогда
	СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
КонецЕсли;
//ДанныеОрганизации = Справочники.Организации.ПолучитьДанныеОрганизации(Истина);
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

//
ТЗ_Строки = Новый ТаблицаЗначений;
ТЗ_Строки.Колонки.Добавить("НомерСтроки");

ТЗ_Строки.Колонки.Добавить("НаименованиеТовара");
ТЗ_Строки.Колонки.Добавить("КодЕдиницыИзмерения");
ТЗ_Строки.Колонки.Добавить("ЕдиницаИзмерения");

ТЗ_Строки.Колонки.Добавить("Количество");
ТЗ_Строки.Колонки.Добавить("Цена");

ТЗ_Строки.Колонки.Добавить("НалоговаяСтавка");
ТЗ_Строки.Колонки.Добавить("СуммаБезНДС");
ТЗ_Строки.Колонки.Добавить("СуммаНДС");
ТЗ_Строки.Колонки.Добавить("СуммаСНДС");

ТЗ_Строки.Колонки.Добавить("ЭтоУслуга");
ТЗ_Строки.Колонки.Добавить("Дата");

ИтогоСуммаБезНДС = 0;
ИтогоСуммаНДС = 0;
ИтогоСумма = 0;

сч = 0;

Если ДокументДолгСсылка.Сумма <> 0 Тогда
	Строка_ТЗ_Строки = ТЗ_Строки.Добавить();
	
	сч = сч + 1;
	Строка_ТЗ_Строки.НомерСтроки = сч;

	ТоварЕдиницаИзмерения = ТоварЕдиницаИзмеренияКоворкинг(ДокументДолгСсылка);
	Строка_ТЗ_Строки.НаименованиеТовара = ТоварЕдиницаИзмерения.Товар;

	Если ДокументДолгСсылка.ПочасоваяОплата Тогда
		Строка_ТЗ_Строки.КодЕдиницыИзмерения = "356";
		Строка_ТЗ_Строки.ЕдиницаИзмерения = "час";
	Иначе
		Строка_ТЗ_Строки.КодЕдиницыИзмерения = "359";
		Строка_ТЗ_Строки.ЕдиницаИзмерения = "сутки";
	КонецЕсли;
		
	Строка_ТЗ_Строки.Количество = ДокументДолгСсылка.Количество;
	Строка_ТЗ_Строки.Цена = ДокументДолгСсылка.Цена;

	СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, ДокументДолгСсылка.Сумма);
	Строка_ТЗ_Строки.СуммаБезНДС = СуммаБезНДС;

	Строка_ТЗ_Строки.НалоговаяСтавка = СтавкаНДС;

	СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, ДокументДолгСсылка.Сумма);
	Строка_ТЗ_Строки.СуммаНДС = СуммаНДС;

	Строка_ТЗ_Строки.СуммаСНДС = ДокументДолгСсылка.Сумма;
	
	Строка_ТЗ_Строки.ЭтоУслуга = Ложь;
	Строка_ТЗ_Строки.Дата = ДокументДолгСсылка.ДатаС;

	ИтогоСумма = ИтогоСумма + ДокументДолгСсылка.Сумма;
	ИтогоСуммаБезНДС = ИтогоСуммаБезНДС + СуммаБезНДС;
	ИтогоСуммаНДС = ИтогоСуммаНДС + СуммаНДС;
КонецЕсли;
		
Для Каждого Строка Из ДокументДолгСсылка.ДопУслугиКоворкинг Цикл
	Строка_ТЗ_Строки = ТЗ_Строки.Добавить();
	
 	сч = сч + 1;
	Строка_ТЗ_Строки.НомерСтроки = сч;
	
	Строка_ТЗ_Строки.НаименованиеТовара = "" + Строка.Услуга + " " + Формат(Строка.ДатаУслуги, "ДФ=dd.MM.yy"); 
											
	Строка_ТЗ_Строки.КодЕдиницыИзмерения = "796";
	Строка_ТЗ_Строки.ЕдиницаИзмерения = "шт";
	
	Строка_ТЗ_Строки.Количество = Строка.Количество;
	Строка_ТЗ_Строки.Цена = Строка.Цена;
	
	СуммаБезНДС = ДокументыСервер.СуммаБезНДС(СтавкаНДС, Строка.Сумма);
	Строка_ТЗ_Строки.СуммаБезНДС = СуммаБезНДС;
	
	Строка_ТЗ_Строки.НалоговаяСтавка = СтавкаНДС;
	
	СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, Строка.Сумма);
	Строка_ТЗ_Строки.СуммаНДС = СуммаНДС;
	
	Строка_ТЗ_Строки.СуммаСНДС = Строка.Сумма;
	
	Строка_ТЗ_Строки.ЭтоУслуга = Истина;
	
	ИтогоСумма = ИтогоСумма + Строка.Сумма;
	ИтогоСуммаБезНДС = ИтогоСуммаБезНДС + СуммаБезНДС;
	ИтогоСуммаНДС = ИтогоСуммаНДС + СуммаНДС;
КонецЦикла;

Возврат ТЗ_Строки;
КонецФункции



Функция ПечатьСчетаФактуры(ТабДок, Номер, Дата
	, Контрагент, ДокументОтгрузки, ДокументДолгСсылка) Экспорт
Макет = ПолучитьОбщийМакет("СчетФактураМакет");

Область = Макет.ПолучитьОбласть("Заголовок");

Область.Параметры.Номер = Номер;
Область.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");

ДатаУчетаНДС = ДокументДолгСсылка.ДатаПо;
СтавкаНДС = ДокументыСервер.СтавкаНДС(Истина); СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);
//ДанныеОрганизации = Справочники.Организации.ПолучитьДанныеОрганизации(Истина);
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();

Продавец = ТекущаяОрганизация.КоворкингОрганизацияДляДокументов;
АдресПродавца = ТекущаяОрганизация.КоворкингАдресДляДокументов;
ИННКПППродавца = ТекущаяОрганизация.КоворкингИНН + "/" + ТекущаяОрганизация.КоворкингИНН;

Область.Параметры.Продавец = Продавец;
Область.Параметры.АдресПродавца = АдресПродавца;
Область.Параметры.ИННКПППродавца = ИННКПППродавца;
Область.Параметры.ДокументОтгрузки = ДокументОтгрузки;

Если Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо Тогда 
	//Область.Параметры.Покупатель = Контрагент.Наименование;
	Область.Параметры.Покупатель = "Гость отеля";
	
	Область.Параметры.АдресПокупателя = "";
	Область.Параметры.ИННКПППокупателя = "" + "/" + "";
Иначе	
	Область.Параметры.Покупатель = ?(ЗначениеЗаполнено(Контрагент.НаименованиеЮрЛица)
										, Контрагент.НаименованиеЮрЛица, Контрагент.Наименование);
	Область.Параметры.АдресПокупателя = Контрагент.Адрес;
	Область.Параметры.ИННКПППокупателя = Контрагент.ИНН + "/" + Контрагент.КПП;
КонецЕсли;
	
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

//
ИтогоСуммаБезНДС = 0;
ИтогоСуммаНДС = 0;
ИтогоСумма = 0;

сч = 0;
ТЗ_Строки = СчетФактураСтроки(ДокументДолгСсылка, ИтогоСуммаБезНДС, ИтогоСуммаНДС, ИтогоСумма);

Для Каждого Строка Из ТЗ_Строки Цикл
	Область = Макет.ПолучитьОбласть("Строка");

	Область.Параметры.НомерСтроки = Строка.НомерСтроки;

	Область.Параметры.НаименованиеТовара = Строка.НаименованиеТовара;

	Область.Параметры.КодЕдиницыИзмерения = Строка.КодЕдиницыИзмерения;
	Область.Параметры.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;
	
	Область.Параметры.Количество = Строка.Количество;

	Область.Параметры.Цена = Строка.Цена;

	Область.Параметры.НалоговаяСтавка = Строка.НалоговаяСтавка;

	Область.Параметры.СуммаБезНДС = Строка.СуммаБезНДС;
	
	Область.Параметры.СуммаНДС = Строка.СуммаНДС;

	Область.Параметры.СуммаСНДС = Строка.СуммаСНДС;

	ТабДок.Вывести(Область);
КонецЦикла;

Область = Макет.ПолучитьОбласть("Итоги");
	
Область.Параметры.СуммаБезНДС = ИтогоСуммаБезНДС;
Область.Параметры.СуммаНДС = ИтогоСуммаНДС;
Область.Параметры.СуммаСНДС = ИтогоСумма;

ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Подвал");

Область.Параметры.Руководитель =  ТекущаяОрганизация.КоворкингФИОРуководительДляДокументов;
Область.Параметры.Бухгалтер =  ТекущаяОрганизация.КоворкингФИОБухгалтерДляСчетаФактуры;

ТабДок.Вывести(Область);

ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
ТабДок.АвтоМасштаб = Истина;
КонецФункции

