
//// + Запуск
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ЗакрыватьПриВыборе = Ложь;	

ОбъектЗначение = ДанныеФормыВЗначение(Параметры.ДокументДолг, Тип("ДокументОбъект.ЗаявкаНаБронирование"));
ЗначениеВДанныеФормы(ОбъектЗначение, ДокументДолгОбъект);

Счет = Параметры.Счет;

Счета.Загрузить(ДокументДолгОбъект.Счета.Выгрузить());
	
МассивОплатСчета = ЗаявкаСервер.МассивОплатСчета(Счет.СчетГУИД, ДокументДолгОбъект);
ОбщийФункционалСервер.ДобавитьСтроки(СчетаДетальноОплаты, МассивОплатСчета); 

ОбновитьДанныеСчетаДетальноОплаты();

ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
МассивРаспределениеОплатДолги = ДокументДолгОбъект.РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
ОбщийФункционалСервер.ДобавитьСтроки(РаспределениеОплатДолги, МассивРаспределениеОплатДолги); 

МассивСчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
ОбщийФункционалСервер.ДобавитьСтроки(СчетаДетальноДолги, МассивСчетаДетальноДолги); 
Для Каждого Строка Из СчетаДетальноДолги Цикл
	Строка.Цена_OldValue = Строка.Цена;	
КонецЦикла;

МассивСчетаДетальноСтроки = ДокументДолгОбъект.СчетаДетальноСтроки.НайтиСтроки(ОтборСтроки);
ОбщийФункционалСервер.ДобавитьСтроки(СчетаДетальноСтроки, МассивСчетаДетальноСтроки); 

// + Счет
СчетГУИД = Счет.СчетГУИД;
НомерСчета = Счет.НомерСчета;
ДатаСчета = Счет.ДатаСчета;

Контрагент = Счет.Контрагент;
Клиент = Счет.Клиент;

НомерВРезерв = ДокументДолгОбъект.НомерВРезерв;

ТолькоПроживание = Счет.ТолькоПроживание;
ТолькоУслуги = Счет.ТолькоУслуги;

РазделитьСчет = Счет.РазделитьСчет;
СвернутьВСчете = Счет.СвернутьВСчете;

Закрыт = Счет.Закрыт;

ДатаС = Счет.ДатаС;
ДатаПо = Счет.ДатаПо;
КоличествоДней = ЗаявкаСервер.КоличествоСуток(ДатаС, ДатаПо, МассивСчетаДетальноДолги);  

ГрупповойСчет = Счет.ГрупповойСчет;
ЭтоПредварительныйГрупповойСчет = Счет.ЭтоПредварительныйГрупповойСчет;
// - Счет

//ЕстьКлиент2 = ЗначениеЗаполнено(ДокументДолгОбъект.Клиент2) И ДокументДолгОбъект.РазделитьСчет;

ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Контрагент);

Если ЗначениеЗаполнено(ГрупповойСчет) Тогда                     
	Элементы.ЭтоПредварительныйГрупповойСчет.ТолькоПросмотр = Истина;
КонецЕсли;

Элементы.ФормаЧек.Доступность = НЕ ЮрЛицо;
Элементы.ФормаБезналСчет.Доступность = ЮрЛицо;

Если НЕ ЗначениеЗаполнено(СчетГУИД) Тогда
	Элементы.ДекорацияЭтоНовыйСчет.Заголовок = "НОВЫЙ СЧЕТ";	
КонецЕсли;	

ТолькоПросмотр_П = Ложь;
Если НЕ Параметры.Свойство("ТолькоПросмотр", ТолькоПросмотр_П) Тогда ТолькоПросмотр_П = Ложь; КонецЕсли;
Если ТолькоПросмотр_П = Неопределено Тогда ТолькоПросмотр_П = Ложь; КонецЕсли;
//Элементы.СчетаДетальноДолги.ТолькоПросмотр = ТолькоПросмотр_П;;

Если Закрыт ИЛИ ЗначениеЗаполнено(ГрупповойСчет) Или ТолькоПросмотр_П Тогда 
	ЭтаФорма.ТолькоПросмотр = Истина;   
КонецЕсли;

Для Каждого Строка Из СчетаДетальноДолги Цикл
	ИтогоСуммаДолг = ИтогоСуммаДолг + Строка.СуммаДолг;	
	ИтогоСуммаОплачено = ИтогоСуммаОплачено + Строка.СуммаОплачено;	
	ИтогоСуммаКЗакрытию = ИтогоСуммаКЗакрытию + Строка.СуммаКЗакрытию;	
КонецЦикла;

ФормаНастройка();

ФормаОтладка();
КонецПроцедуры

&НаСервере
Процедура ФормаНастройка()
ТекущийПользовательКодРавноАдминистратор = НастройкиСервер.ТекущийПользовательКодРавноАдминистратор();

Элементы.РаспределениеОплат.Видимость = ТекущийПользовательКодРавноАдминистратор; 
Элементы.ФормаТЕСТ.Видимость = ТекущийПользовательКодРавноАдминистратор; 
КонецПроцедуры	

&НаСервере
Процедура ФормаОтладка()
ЭтоОтладка = Константы.ЭтоОтладка.Получить();

Элементы.СчетГУИД.Видимость = ЭтоОтладка;
Элементы.СчетаДетальноДолгиДолгиГУИД.Видимость = ЭтоОтладка;
Элементы.СчетаДетальноДолгиСчетГУИД.Видимость = ЭтоОтладка;

КонецПроцедуры	
//

//
&НаКлиенте
Процедура ПриОткрытии(Отказ)

Если НЕ ЗначениеЗаполнено(Клиент) Тогда
	КлиентыОтбор = Новый СписокЗначений;	
	КлиентыОтбор.Добавить(ДокументДолгОбъект.Клиент);
	КлиентыОтбор.Добавить(ДокументДолгОбъект.Клиент2);
	
	ПараметрыФормы = Новый Структура("КлиентыОтбор", КлиентыОтбор);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_СчетНаОплатуВыборКлиента", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.СчетНаОплатуВыборКлиента", ПараметрыФормы, ЭтаФорма
		,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецЕсли;                                

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_СчетНаОплатуВыборКлиента(Результат, ДополительныеПараметры) Экспорт
Если Результат = Неопределено Тогда ЭтаФорма.Закрыть(); Возврат; КонецЕсли;
			
Клиент = Результат;
Если НЕ ЗначениеЗаполнено(Клиент) Тогда ЭтаФорма.Закрыть(); Возврат; КонецЕсли;

Если Клиент = ДокументДолгОбъект.Клиент2 Тогда
	Контрагент = ДокументДолгОбъект.Клиент2;	
ИначеЕсли НЕ ЗначениеЗаполнено(ДокументДолгОбъект.Оплачивает) Тогда 
	Контрагент = Клиент;
КонецЕсли;
	
КонецПроцедуры
//// - Запуск

&НаСервере 
Процедура ОбновитьДанныеСчетаДетальноОплаты()
МассивДокументовДолг = Новый Массив; 
СуммаРаспределеноИтогоОплаты = 0;
ОплатыОбщееСервер.ОбновитьДанныеКолонокДокументыОплаты(СуммаРаспределеноИтогоОплаты
	, СчетаДетальноОплаты, ДокументДолгОбъект, МассивДокументовДолг);	
КонецПроцедуры

//
&НаКлиенте
Процедура СвернутьВСчетеПриИзменении(Элемент)
Счет.СвернутьВСчете = СвернутьВСчете;

ЗаполнитьСчетаДетальноСтроки()
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСчетаДетальноСтроки(Команда)
ЗаполнитьСчетаДетальноСтроки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаДетальноСтроки()
КоличествоСуток = ЗаявкаСервер.КоличествоСуток(ДатаС, ДатаПо, СчетаДетальноДолги);  

СчетаДетальноСтроки.Очистить();	
ЗаявкаСервер.ЗаполнитьСчетаДетальноСтроки(Счет, КоличествоСуток
	, СчетаДетальноСтроки, СчетаДетальноДолги, РаспределениеОплатДолги);	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗакрытПриИзменении(Элемент)
ЗакрытПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытПриИзмененииНаСервере()
ЭтаФорма.ТолькоПросмотр = Закрыт;
КонецПроцедуры
//

//// + СчетаДетальноДолги

//
&НаКлиенте
Процедура СчетаДетальноДолгиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СчетаДетальноДолгиПередУдалением(Элемент, Отказ)
Если Закрыт Тогда Отказ = Истина; Возврат; КонецЕсли;
	
ТекущиеДанные = Элементы.СчетаДетальноДолги.ТекущиеДанные;	

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопромаПодтвердитеУдалениеСчетаДетальноДолги", ЭтаФорма);

ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ...", РежимДиалогаВопрос.ОКОтмена);
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопромаПодтвердитеУдалениеСчетаДетальноДолги(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

УдалитьТекущуюСтрокуСчетаДетальноДолги();
Конецпроцедуры	

&НаСервере
Процедура УдалитьТекущуюСтрокуСчетаДетальноДолги() Экспорт
ТекущаяСтрока = Элементы.СчетаДетальноДолги.ТекущаяСтрока;
ТекущиеДанные = СчетаДетальноДолги.НайтиПоИдентификатору(ТекущаяСтрока);

ОтборСтроки	= Новый Структура("ДолгиГУИД", ТекущиеДанные.ДолгиГУИД);
НайденныеСтрокиРаспределениеОплатДолги = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);

ОстатокОплаты = ТекущиеДанные.СуммаОплачено;
Для Каждого Строка Из  НайденныеСтрокиРаспределениеОплатДолги Цикл
	
	ОтборСтроки = Новый Структура("ДокументОплаты", Строка.ДокументОплаты);
	НайденныеСтрокиСчетаДетальноОплаты = СчетаДетальноОплаты.НайтиСтроки(ОтборСтроки);
	НайденнаяСтрокаСчетаДетальноОплаты = НайденныеСтрокиСчетаДетальноОплаты[0];
	
	НайденнаяСтрокаСчетаДетальноОплаты.СуммаРаспределено = НайденнаяСтрокаСчетаДетальноОплаты.СуммаРаспределено 
		- Строка.СуммаОплаты; 
			
	//ОстатокОплаты = ОстатокОплаты - Строка.СуммаОплаты;            
	//Если ОстатокОплаты >= 0 Тогда
	//	РаспределениеОплатДолги.Удалить(Строка);
	//Иначе
	//	Строка.СуммаОплаты = (- ОстатокОплаты); 
	//	Прервать;
	//КонецЕсли;
	
	Если ОстатокОплаты >= Строка.СуммаОплаты Тогда
		РаспределениеОплатДолги.Удалить(Строка);
		
		ОстатокОплаты = ОстатокОплаты - Строка.СуммаОплаты;            
	Иначе
		Строка.СуммаОплаты = Строка.СуммаОплаты - ОстатокОплаты; 
		
		Прервать;
	КонецЕсли;
	
КонецЦикла;

ИтогоСуммаДолг = ИтогоСуммаДолг - ТекущиеДанные.СуммаДолг;	
ИтогоСуммаОплачено = ИтогоСуммаОплачено - ТекущиеДанные.СуммаОплачено;	
ИтогоСуммаКЗакрытию = ИтогоСуммаКЗакрытию - ТекущиеДанные.СуммаКЗакрытию;	

СчетаДетальноДолги.Удалить(ТекущиеДанные);	
Конецпроцедуры	
//

//
&НаКлиенте
Процедура ДобавитьДолгиДетально(Команда)
ПараметрыФормы = Новый Структура;
ВыборДетальноДолги = МассивВыборДетальноДолги();
Если ВыборДетальноДолги.Количество() = 0 Тогда 
	ПоказатьПредупреждение(, "Нечего добавлять");
	Возврат; 
КонецЕсли;

ПараметрыФормы.Вставить("ВыборДетальноДолги", ВыборДетальноДолги);
ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
ОткрытьФорму("ОбщаяФорма.ПодборСтрокиЗаявки", ПараметрыФормы, Элементы.СчетаДетальноДолги
	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);   
КонецПроцедуры

&НаСервере
Функция МассивВыборДетальноДолги()
ДополнительныеСтрокиДетальноДолги = ЗаявкаСервер.ДополнительныеСтрокиДетальноДолги(Ложь 
	, ДокументДолгОбъект, Счет, СчетаДетальноДолги, Истина);

Массив = ОбщийФункционалСервер.ТаблицаЗначенийВМассивСтруктур(ДополнительныеСтрокиДетальноДолги);
Возврат Массив;	
КонецФункции

&НаКлиенте
Процедура СчетаДетальноДолгиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
ДолгиГУИД = ВыбранноеЗначение.ДолгиГУИД;	
ОтборСтроки = Новый Структура("ДолгиГУИД", ДолгиГУИД); 	
НайденныеСтроки = СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

Если НайденныеСтроки.Количество() > 0 Тогда
	ТекущаяСтрока = НайденныеСтроки[0];
Иначе
	ТекущаяСтрока = СчетаДетальноДолги.Добавить();
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ВыбранноеЗначение);
	ТекущаяСтрока.СчетГУИД = СчетГУИД;
	
	Для Каждого СтрокаОплата Из СчетаДетальноОплаты Цикл		
		Если ТекущаяСтрока.СуммаКЗакрытию = 0 Тогда Прервать; КонецЕсли;   
		
		ДокументДолгОбъект_П = ДокументДолгОбъект;
		ОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(СтрокаОплата.ДокументОплаты
			, ДокументДолгОбъект_П);  
		ЗаявкаОбщееКлиентСервер.РаспределитьОплатаСтрокаДолгСтрока(СтрокаОплата
			, ОстатокКРаспределению, ТекущаяСтрока, РаспределениеОплатДолги);	
		
		//ОплатыОбщееКлиентСерверРаспределитьОплатаСтрокаДолгСтрока(СтрокаОплата
		//	, СтрокаОплата.ОстатокКРаспределению, ТекущаяСтрока, РаспределениеОплатДолги);	
	КонецЦикла;
	
	ТекущаяСтрока.Цена_OldValue = ТекущаяСтрока.Цена; 
КонецЕсли;

ИтогоСуммаДолг = ИтогоСуммаДолг + ТекущаяСтрока.СуммаДолг;
ИтогоСуммаОплачено = ИтогоСуммаОплачено + ТекущаяСтрока.СуммаОплачено;
ИтогоСуммаКЗакрытию = ИтогоСуммаКЗакрытию + ТекущаяСтрока.СуммаКЗакрытию;

Индекс = СчетаДетальноДолги.Индекс(ТекущаяСтрока);
Элементы.СчетаДетальноДолги.ТекущаяСтрока = Индекс;
КонецПроцедуры
//
//// - СчетаДетальноДолги

//// + Сохранить
&НаКлиенте
Процедура СохранитьКоманда(Команда)
Результат = Новый Структура;

Если ЗначениеЗаполнено(СчетГУИД) Тогда
	ОтборСтроки = Новый Структура;
	ОтборСтроки.Вставить("СчетГУИД", СчетГУИД); 

	НайденыСтроки = Счета.НайтиСтроки(ОтборСтроки);
	ЗаполнитьЗначенияСвойств(Счет, НайденыСтроки[0]); 	
	
	Результат.Вставить("НовыйСчет", Ложь);
Иначе
	Счет = ЗаполнитьНовыйСчетДанные();
	Результат.Вставить("НовыйСчет", Истина);
КонецЕсли;	

Счет.ДатаСчета = ДатаСчета;

Счет.Контрагент = Контрагент;
Счет.Клиент = Клиент;

Счет.СвернутьВСчете = СвернутьВСчете;
Счет.РазделитьСчет = РазделитьСчет;

//
ОтборСтроки = Новый Структура("Услуга", Истина);
НайденныеСтроки = СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
НетУслуги = НайденныеСтроки.Количество() = 0;

ОтборСтроки = Новый Структура("Услуга", Ложь);
НайденныеСтроки = СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
НетПроживание = НайденныеСтроки.Количество() = 0;

ТолькоПроживание = НетУслуги;
ТолькоУслуги = НетПроживание;

Счет.ТолькоУслуги = ТолькоУслуги;
Счет.ТолькоПроживание = ТолькоПроживание;
//

Счет.ДатаС = ДатаС;
Счет.ДатаПо = ДатаПо;

Счет.Закрыт = Закрыт;

Счет.ГрупповойСчет = ГрупповойСчет;
Счет.ЭтоПредварительныйГрупповойСчет = ЭтоПредварительныйГрупповойСчет;

Результат.Вставить("Счет", Счет);

ДанныеСчета = Новый Структура();
ДанныеСчета.Вставить("СчетаДетальноДолги", СчетаДетальноДолги);
ДанныеСчета.Вставить("РаспределениеОплатДолги", РаспределениеОплатДолги);
ДанныеСчета.Вставить("СчетаДетальноОплаты", СчетаДетальноОплаты);

ЗаполнитьСчетаДетальноСтроки();
ДанныеСчета.Вставить("СчетаДетальноСтроки", СчетаДетальноСтроки);

ОбновитьУдаленныеОплаты();
ДанныеСчета.Вставить("УдаленныеОплаты", УдаленныеОплаты);

Результат.Вставить("ДанныеСчета", ДанныеСчета);

ОповеститьОВыборе(Результат);

// + После сохранения
ОбновитьДанныеСчетаДетальноОплаты();
УдаленныеОплаты.Очистить();
// - После сохранения
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьНовыйСчетДанные() 
Возврат ЗаполнитьНовыйСчетДанныеНаСервере();
КонецФункции

&НаСервере
Функция ЗаполнитьНовыйСчетДанныеНаСервере() 
СчетПараметр = ЗаявкаСервер.ЗаполнитьНовыйСчетДанные(Счет, Счета, СчетаДетальноДолги, РаспределениеОплатДолги);
Возврат СчетПараметр; 
КонецФункции

&НаСервере
Функция ОбновитьУдаленныеОплаты() 
УдаленныеОплаты_П =  УдаленныеОплаты.Выгрузить();
УдаленныеОплаты_П.Свернуть("ДокументОплаты");
МассивКУдалению = Новый Массив;
Для Каждого Строка Из УдаленныеОплаты_П Цикл
	ОтборСтрока = Новый Структура("ДокументОплаты", Строка.ДокументОплаты);
	НайденныеСтроки = СчетаДетальноОплаты.НайтиСтроки(ОтборСтрока);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивКУдалению.Добавить(НайденнаяСтрока);
	КонецЦикла;
КонецЦикла;
ОбщийФункционалСервер.УдалитьСтроки(УдаленныеОплаты_П, МассивКУдалению);

УдаленныеОплаты.Очистить();
ОбщийФункционалСервер.ДобавитьСтроки(УдаленныеОплаты, УдаленныеОплаты_П);

КонецФункции
//// - Сохранить

//
&НаКлиенте
Процедура ПечатьСчета(Команда)
СохранитьКоманда(Неопределено);

ПечатьКлиент.ПечатьСчетаИПодтверждения(ЭтаФорма, ДокументДолгОбъект.Ссылка, Счет, Истина);
КонецПроцедуры
//

//// + Оплаты

&НаКлиенте
Процедура СчетаДетальноОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ТД = Элементы.СчетаДетальноОплаты.ТекущиеДанные;

ТолькоПросмотр = Истина;
ОплатыОбщееКлиент.ОткрытьДокументОплаты(ЭтаФорма, ТД.ДокументОплаты, ТолькоПросмотр, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

// + Фискализация Чека

&НаКлиенте
Процедура Чек(Команда)
Если КлиентыСервер.ЭтоЮрЛицо(Контрагент) Тогда 	
	ПоказатьПредупреждение(,"Счет выписан на юр. лицо"	
		+ Символы.ПС + Символы.ПС + "Операция НЕ возможна");		
	Возврат;
КонецЕсли;

Если ОплатыОбщееСервер.ЕстьОстаткиОплатКассаКонтрагент(Контрагент) Тогда
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Счет", Счет);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВопрос_ЕстьКассовыеОстаткиОплат", ЭтаФорма, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, "Есть кассовые остатки оплат для контрагента
										|
										|ПРОДОЛЖИТЬ ФОРМИРОВАНИЕ ЧЕКА ?"
					, РежимДиалогаВопрос.ОКОтмена);
						
	Возврат;				
КонецЕсли;

ЧекОплатыДействие();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопрос_ЕстьКассовыеОстаткиОплат(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
	
ЧекОплатыДействие();
КонецПроцедуры

&НаКлиенте
Процедура ЧекОплатыДействие()
СохранитьКоманда(Неопределено);	

ДопПараметры = Новый Структура;
ДопПараметры.Вставить("Счет", Счет);  
ДопПараметры.Вставить("ДокументДолгОбъектДанные", ДокументДолгОбъект);  

ДопПараметры.Вставить("ЭтоСчетНаОплату", Истина);

ДопПараметры.Вставить("СчетаДетальноДолги", СчетаДетальноДолги);  
ДопПараметры.Вставить("РаспределениеОплатДолги", РаспределениеОплатДолги);  
ДопПараметры.Вставить("СчетаДетальноОплаты", СчетаДетальноОплаты);  

ДопПараметрыОповещения = Новый Структура;
ОповещениеЗавершениеЧекОплаты = Новый ОписаниеОповещения("ОповещениеЗавершениеЧекОплаты", ЭтаФорма, ДопПараметрыОповещения);
ДопПараметры.Вставить("ОповещениеЗавершениеЧек", ОповещениеЗавершениеЧекОплаты);

ОплатыЧекКлиент.ЧекОплаты(ДопПараметры, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗавершениеЧекОплаты(Результат, ДополнительныеПараметры) Экспорт
ЗаполнитьСчетаДетальноСтроки();

СохранитьКоманда(Неопределено);
КонецПроцедуры	
// + Фискализация Чека

// + Безнал
&НаКлиенте
Процедура БезналСчет(Команда)
СохранитьКоманда(Неопределено);	

ПараметрыФормы = Новый Структура();
ДопПараметры = Новый Структура();

СписокКонтрагентыЗаявка = Новый СписокЗначений; 
СписокКонтрагентыЗаявка.Добавить(Контрагент);

ПараметрыФормы.Вставить("ОтКого", СписокКонтрагентыЗаявка);

СуммаКОплатеСчет = 0;
Для Каждого Строка Из СчетаДетальноДолги Цикл
	СуммаКОплатеСчет = СуммаКОплатеСчет + Строка.СуммаКЗакрытию;
КонецЦикла;
Если СуммаКОплатеСчет <= 0 Тогда Возврат; КонецЕсли;

ПараметрыФормы.Вставить("СуммаКОплате", СуммаКОплатеСчет);
ДопПараметры.Вставить("СуммаКОплатеСчет", СуммаКОплатеСчет);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормаВыбораОплата_БезналСчет", ЭтаФорма, ДопПараметры);
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаВыбораОплата", ПараметрыФормы , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы .БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормаВыбораОплата_БезналСчет(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

ДокументОплаты = Результат;
СуммаКОплатеСчет = ДополнительныеПараметры.СуммаКОплатеСчет; 

ДобавитьОплатаБезналНаСервере_БезналСчет(ДокументОплаты, СуммаКОплатеСчет);

ЗаполнитьСчетаДетальноСтроки();

СохранитьКоманда(Неопределено);
Конецпроцедуры

&НаСервере
Процедура ДобавитьОплатаБезналНаСервере_БезналСчет(ДокументОплаты, СуммаКОплате) Экспорт
СуммаКРаспределению = ДокументОплаты.Сумма - ДокументОплаты.ДолгиОплата.Итог("Сумма");

Если СуммаКОплате > СуммаКРаспределению Тогда
	СуммаОплаты = СуммаКРаспределению;
Иначе
	СуммаОплаты = СуммаКОплате;
КонецЕсли;                                       

СтрокаОплаты = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(СчетаДетальноОплаты, ДокументОплаты, Ложь);

ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(СтрокаОплаты, СуммаОплаты, СчетаДетальноДолги, РаспределениеОплатДолги);  
КонецПроцедуры
// - Безнал
//// - Оплаты


//// + Оплаты 

// + Удалить Оплата

&НаКлиенте
Процедура СчетаДетальноОплатыПередУдалением(Элемент, Отказ)
Если Закрыт Тогда Отказ = Истина; Возврат; КонецЕсли;

ТекущиеДанные = Элементы.СчетаДетальноОплаты.ТекущиеДанные;	

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопромаПодтвердитеУдалениеСчетаДетальноОплаты", ЭтаФорма);

ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ...", РежимДиалогаВопрос.ОКОтмена);
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопромаПодтвердитеУдалениеСчетаДетальноОплаты(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

УдалитьТекущуюСтрокуСчетаДетальноОплаты();

СохранитьКоманда(Неопределено);	
Конецпроцедуры	

&НаСервере
Процедура УдалитьТекущуюСтрокуСчетаДетальноОплаты()
ТекущаяСтрока = Элементы.СчетаДетальноОплаты.ТекущаяСтрока;

ТекущиеДанные = СчетаДетальноОплаты.НайтиПоИдентификатору(ТекущаяСтрока); 

ОтборСтроки = Новый Структура("ДокументОплаты", ТекущиеДанные.ДокументОплаты); 
НайденыеСтрокиРаспределениеОплатДолги = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
Для Каждого НайденаяСтрокаРаспределениеОплатДолги Из НайденыеСтрокиРаспределениеОплатДолги Цикл
	
	ОтборСтрокиСчетаДетальноДолги = Новый Структура("ДолгиГУИД", НайденаяСтрокаРаспределениеОплатДолги.ДолгиГУИД);
	НайденыеСтрокиСчетаДетальноДолги = СчетаДетальноДолги.НайтиСтроки(ОтборСтрокиСчетаДетальноДолги);
	
	Если НайденыеСтрокиСчетаДетальноДолги.Количество() > 0 Тогда 
		НайденаяСтрокаСчетаДетальноДолги = НайденыеСтрокиСчетаДетальноДолги[0];
		
		НайденаяСтрокаСчетаДетальноДолги.СуммаКЗакрытию = НайденаяСтрокаСчетаДетальноДолги.СуммаКЗакрытию 
			+ НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
		НайденаяСтрокаСчетаДетальноДолги.СуммаОплачено = НайденаяСтрокаСчетаДетальноДолги.СуммаОплачено 
			- НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
	КонецЕсли;		
КонецЦикла;

Для Каждого Строка Из НайденыеСтрокиРаспределениеОплатДолги Цикл
	РаспределениеОплатДолги.Удалить(Строка);
КонецЦикла;	

НоваяУдаленнаяОплата = УдаленныеОплаты.Добавить();
НоваяУдаленнаяОплата.ДокументОплаты = ТекущиеДанные.ДокументОплаты;

СчетаДетальноОплаты.Удалить(ТекущиеДанные);	

ОбновитьОплаты();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОплаты()
Для Каждого СтрокаОплаты Из СчетаДетальноОплаты Цикл
	ДокументОплаты = СтрокаОплаты.ДокументОплаты;
	СуммаРаспределено_OldValue = СтрокаОплаты.СуммаРаспределено; 
	
	ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты); 
	НайденыеСтрокиРаспределениеОплатДолги = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
	
	МассивКУдалению = Новый Массив;
	Для Каждого НайденаяСтрокаРаспределениеОплатДолги Из НайденыеСтрокиРаспределениеОплатДолги Цикл
		
		ОтборСтрокиСчетаДетальноДолги = Новый Структура("ДолгиГУИД", НайденаяСтрокаРаспределениеОплатДолги.ДолгиГУИД);
		НайденыеСтрокиСчетаДетальноДолги = СчетаДетальноДолги.НайтиСтроки(ОтборСтрокиСчетаДетальноДолги);
		
		Если НайденыеСтрокиСчетаДетальноДолги.Количество() > 0 Тогда 
			НайденаяСтрокаСчетаДетальноДолги = НайденыеСтрокиСчетаДетальноДолги[0];
			
			НайденаяСтрокаСчетаДетальноДолги.СуммаКЗакрытию = НайденаяСтрокаСчетаДетальноДолги.СуммаКЗакрытию 
				+ НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
			НайденаяСтрокаСчетаДетальноДолги.СуммаОплачено = НайденаяСтрокаСчетаДетальноДолги.СуммаОплачено 
				- НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
		КонецЕсли;
		
		СтрокаОплаты.СуммаРаспределено = СтрокаОплаты.СуммаРаспределено - НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
		
		МассивКУдалению.Добавить(НайденаяСтрокаРаспределениеОплатДолги);	
	КонецЦикла;
	ОбщийФункционалСервер.УдалитьСтроки(РаспределениеОплатДолги, МассивКУдалению);
	
	ОплатаОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(ДокументОплаты, ДокументДолгОбъект)
		+ СуммаРаспределено_OldValue - СтрокаОплаты.СуммаРаспределено;
	
	ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(СтрокаОплаты, ОплатаОстатокКРаспределению, СчетаДетальноДолги, РаспределениеОплатДолги);  
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СчетаДетальноОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СчетаДетальноОплатыПередНачаломИзменения(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЕСТ(Команда)
ОбновитьОплаты();
КонецПроцедуры

&НаКлиенте
Процедура СчетаДетальноДолгиЦенаПриИзменении(Элемент)
ТД = Элементы.СчетаДетальноДолги.ТекущиеДанные;	
ТД.СуммаДолг = ТД.Цена * ТД.Количество;	

СуммаДолг_OldValue = ТД.Цена_OldValue * ТД.Количество;	
ИзменениеСуммы = ТД.СуммаДолг - СуммаДолг_OldValue;
ТД.СуммаКЗакрытию = ТД.СуммаКЗакрытию + ИзменениеСуммы;

ТД.Цена_OldValue = ТД.Цена;
КонецПроцедуры

// + Удалить Оплата


//// - Оплаты 

////// - Дополнительные возможности НЕ ИСПОЛЬЗУЮТСЯ

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++










