&НаКлиенте
Перем ПоследнийАсинхронныйВызов;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//ПутьКФайловойБазе = "C:\_Base1C\InfoBase";
ПутьКФайловойБазе = "C:\_Base1C\BASE";
ИмяПользователя = "Администратор";
Пароль = "123";

РезервПо = ТекущаяДата();

ИмяПапкиИсточник = "C:\_Base1C\BASE\SCAN\";
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере()

КонецПроцедуры

//
&НаКлиенте
Процедура ЗагрузитьКлиентов(Команда)
ПараметрыВызова = Новый Массив;
ПараметрыВызова.Добавить(ПутьКФайловойБазе);
ПараметрыВызова.Добавить(ИмяПользователя);
ПараметрыВызова.Добавить(Пароль);

//ПоследнийАсинхронныйВызов = АсинхронныеВызовы.ВызватьПроцедуру("ПереносДанныхРеноме.ЗагрузитьКлиентовНаСервере", ПараметрыВызова
//	, ЭтаФорма, "ЗавершениеЗагрузкиКлиентов", "СозданиеЭлементовХодВыполнения");
ПоследнийАсинхронныйВызов = АсинхронныеВызовы.ВызватьПроцедуру("Обработки.ПереносКлиентаРеноме.ЗагрузитьКлиентовНаСервере", ПараметрыВызова
	, ЭтаФорма, "ЗавершениеЗагрузкиКлиентов", "СозданиеЭлементовХодВыполнения");
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЗагрузкиКлиентов(АсинхронныйВызов, Состояние, ОписаниеОшибки) Экспорт
Сообщить("Завершение загрузки Клиентов; " + Состояние + " ОписаниеОшибки: " + ОписаниеОшибки);	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеЭлементовХодВыполнения(АсинхронныйВызов, Значение, Сообщения) Экспорт
	
Если ПоследнийАсинхронныйВызов.Идентификатор = АсинхронныйВызов.Идентификатор Тогда
	ИндикаторПроцентВыполнения = Значение.ПроцентВыполнения;
	КоличествоСозданныхЭлементов = Значение.КоличествоСозданныхЭлементов;
	Для Каждого ТекущееСообщение Из Сообщения Цикл
		Сообщить(ТекущееСообщение);			
	КонецЦикла;
КонецЕсли;
	
КонецПроцедуры
//

&НаКлиенте
Процедура ЗагрузитьКлиентовПоНаименованию(Команда)
ПараметрыВызова = Новый Массив;
ПараметрыВызова.Добавить(ПутьКФайловойБазе);
ПараметрыВызова.Добавить(ИмяПользователя);
ПараметрыВызова.Добавить(Пароль);

ПараметрыВызова.Добавить(НаименованиеКлиента);

//ПоследнийАсинхронныйВызов = АсинхронныеВызовы.ВызватьПроцедуру("ПереносДанныхРеноме.ЗагрузитьКлиентовНаСервере", ПараметрыВызова
//	, ЭтаФорма, "ЗавершениеЗагрузкиКлиентов", "СозданиеЭлементовХодВыполнения");
ПоследнийАсинхронныйВызов = АсинхронныеВызовы.ВызватьПроцедуру("Обработки.ПереносКлиентаРеноме.ЗагрузитьКлиентовПоНаименованию", ПараметрыВызова
	, ЭтаФорма, "ЗавершениеЗагрузкиКлиентов", "СозданиеЭлементовХодВыполнения");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИсториюКлиентов(Команда)
ПараметрыВызова = Новый Массив;
ПараметрыВызова.Добавить(ПутьКФайловойБазе);
ПараметрыВызова.Добавить(ИмяПользователя);
ПараметрыВызова.Добавить(Пароль);
ПараметрыВызова.Добавить(РезервС);
ПараметрыВызова.Добавить(РезервПо);

ПоследнийАсинхронныйВызов = АсинхронныеВызовы.ВызватьПроцедуру("Обработки.ПереносКлиентаРеноме.ЗагрузитьИсториюКлиентовНаСервере", ПараметрыВызова
	, ЭтаФорма, "ЗавершениеЗагрузкиКлиентов", "СозданиеЭлементовХодВыполнения");
КонецПроцедуры

//
&НаКлиенте
Процедура ЗагрузитьЗаявки(Команда)
ПараметрыВызова = Новый Массив;
ПараметрыВызова.Добавить(ПутьКФайловойБазе);
ПараметрыВызова.Добавить(ИмяПользователя);
ПараметрыВызова.Добавить(Пароль);
ПараметрыВызова.Добавить(РезервС);

ПапкаГости = ПапкаГости();
ПараметрыВызова.Добавить(ПапкаГости);
ПоследнийАсинхронныйВызов = АсинхронныеВызовы.ВызватьПроцедуру("Обработки.ПереносКлиентаРеноме.ЗагрузитьЗаявкиНаСервере", ПараметрыВызова
	, ЭтаФорма, "ЗавершениеЗагрузкиКлиентов", "СозданиеЭлементовХодВыполнения");
	
КонецПроцедуры

&НаСервере
Функция ПапкаГости()
ПапкаГости = Справочники.Клиенты.НайтиПоРеквизиту("ПрограммныйКод", "ГОСТИ");
Возврат ПапкаГости;
КонецФункции
//

&НаКлиенте
Процедура ЗагрузитьКлиентовВЗаявках(Команда)
ПараметрыВызова = Новый Массив;
ПараметрыВызова.Добавить(ПутьКФайловойБазе);
ПараметрыВызова.Добавить(ИмяПользователя);
ПараметрыВызова.Добавить(Пароль);
ПараметрыВызова.Добавить(РезервС);

ПоследнийАсинхронныйВызов = АсинхронныеВызовы.ВызватьПроцедуру("Обработки.ПереносКлиентаРеноме.ЗагрузитьКлиентовВЗаявкахНаСервере", ПараметрыВызова
	, ЭтаФорма, "ЗавершениеЗагрузкиКлиентов", "СозданиеЭлементовХодВыполнения");
КонецПроцедуры

&НаСервере
Функция ПолучитьПодключениеКФайловойБД()
//Параметры = "File=""C:\1CBase"";Usr=""login"";Pwd=""password"";";

ПараметрыСоединения = "File=""" + ПутьКФайловойБазе + """;Usr=""" + ИмяПользователя + """;Pwd=""" + Пароль + """;";

COMConnector= Новый COMОбъект("V83.COMConnector");
Попытка
Возврат COMConnector.Connect(ПараметрыСоединения);
Исключение
Сообщить("Ошибка подключения! " + ОписаниеОшибки() );
Возврат Неопределено;
КонецПопытки;

КонецФункции
//


//
&НаКлиенте
Процедура ЗагрузитьФотоКлиентов(Команда)
	ЗагрузитьФотоКлиентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФотоКлиентовНаСервере()
Соединение = ПолучитьПодключениеКФайловойБД();

Запрос = Соединение.NewObject("Запрос");
	
Запрос.Текст = "ВЫБРАТЬ
|	Клиенты.Ссылка Как Ссылка,
|	Клиенты.СканыДокументов.(
|		Ссылка,
|		НомерСтроки,
|		ПутьДоФото,
|		Комментарий
|	) КАК СканыДокументов
|ИЗ
|	Справочник.Клиенты КАК Клиенты
              |ГДЕ
              |	Клиенты.ПометкаУдаления = ЛОЖЬ
              |	И Клиенты.ЭтоГруппа = ЛОЖЬ";
			  //|	И НЕ Клиенты.Ссылка В ИЕРАРХИИ (&СписокЗначений)";

ТЗ_КлиентыСоединение = Запрос.Выполнить().Выгрузить(); 
Если ТЗ_КлиентыСоединение.Количество() = 0 Тогда 
	Сообщить("Нет клиентов");
	Возврат; 
КонецЕсли;

Для Каждого Строка Из ТЗ_КлиентыСоединение Цикл
	ЗагрузитьСканыКлиента(Строка, Соединение);
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСканыКлиента(Строка, Соединение)
Если Строка.СканыДокументов.Количество() = 0 Тогда Возврат; КонецЕсли; 	
	
ЗагрузкаГИУДСтрока = Соединение.XMLСтрока(Строка.Ссылка);
КлиентПоЗагрузкаГИУДСтрока = Справочники.Клиенты.НайтиПоРеквизиту("ЗагрузкаГИУДСтрока", ЗагрузкаГИУДСтрока);
Если НЕ ЗначениеЗаполнено(КлиентПоЗагрузкаГИУДСтрока) Тогда Возврат; КонецЕсли;

КлиентОбъект = КлиентПоЗагрузкаГИУДСтрока.ПолучитьОбъект();
	
ИмяПапкиПриемник = Константы.Папка_C_BASE.Получить();
ИмяПапкиПриемник = ИмяПапкиПриемник + "SCAN\"; 

Префикс = ЗагрузкаГИУДСтрока;

ИмяФайлаПрефикс = ИмяПапкиПриемник + Префикс; 

Для Каждого СтрокаСканыДокументов Из Строка.СканыДокументов Цикл
	
	ПутьДоФото = СтрокаСканыДокументов.ПутьДоФото;
	//ПутьДоФото = "C" + Сред(ПутьДоФото, 2, СтрДлина(ПутьДоФото) - 1);
	Индекс = СтрНайти(ПутьДоФото, "\", НаправлениеПоиска.СКонца);
	Если Индекс = 0 тогда Продолжить; КонецЕсли;
	
	ИмяФайла = Прав(ПутьДоФото, СтрДлина(ПутьДоФото) - Индекс);
	Если СтрДлина(ИмяФайла) = 0 тогда Продолжить; КонецЕсли;
	
	ПолноеИмяФайлаИсточник = ИмяПапкиИсточник + ИмяФайла;
	
	Файл = Новый Файл(ПолноеИмяФайлаИсточник);
	Если НЕ Файл.Существует() Тогда Продолжить; КонецЕсли;
	
	ИмяФайлаПриемник = ИмяФайлаПрефикс + "_" + ИмяФайла;
	
	ОтборСтроки = Новый Структура("ПутьДоФото", ИмяФайлаПриемник);
	НайденныеСтроки = КлиентОбъект.СканыДокументов.НайтиСтроки(ОтборСтроки);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		КлиентОбъект.СканыДокументов.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	Попытка
		КопироватьФайл(ПолноеИмяФайлаИсточник, ИмяФайлаПриемник);
		НетОшибкаКопирования = Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		НетОшибкаКопирования = Ложь;
	КонецПопытки;
	
	Если НетОшибкаКопирования Тогда
		НовыйВидСканыДокументов = КлиентОбъект.СканыДокументов.Добавить();
		НовыйВидСканыДокументов.ПутьДоФото = ИмяФайлаПриемник; 
		НовыйВидСканыДокументов.Комментарий = СтрокаСканыДокументов.Комментарий; 
	КонецЕсли;
КонецЦикла;	

Попытка
	КлиентОбъект.Записать();
Исключение
	Сообщить(ОписаниеОшибки());		
КонецПопытки;

	
	
КонецПроцедуры
//

&НаКлиенте
Процедура УдалитьСканыКлиентов(Команда)
	УдалитьСканыКлиентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСканыКлиентовНаСервере()
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	Клиенты.Ссылка Как Ссылка
|ИЗ
|	Справочник.Клиенты КАК Клиенты
              |ГДЕ
              |	Клиенты.ПометкаУдаления = ЛОЖЬ
              |	И Клиенты.ЗагрузкаГИУДСтрока <> """"
              |	И Клиенты.ЭтоГруппа = ЛОЖЬ";

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	КлиентОбъект = Строка.Ссылка.ПолучитьОбъект();
	Если КлиентОбъект.СканыДокументов.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	МассивКУдалению = Новый Массив;
	Для Каждого СтрокаСканы Из КлиентОбъект.СканыДокументов Цикл
		ПутьДоФото = СтрокаСканы.ПутьДоФото;
		Если СтрДлина(ПутьДоФото) < 40 Тогда Продолжить; КонецЕсли;
		Попытка 
			УдалитьФайлы(ПутьДоФото);
		Исключение
			Сообщить("Ошибка удаления файла: " + ПутьДоФото + " Описание ошибки: " + ОписаниеОшибки());
		КонецПопытки;
		
		МассивКУдалению.Добавить(СтрокаСканы);
	КонецЦикла;

	Для Каждого СтрокаСканы Из МассивКУдалению Цикл
		КлиентОбъект.СканыДокументов.Удалить(СтрокаСканы);
	КонецЦикла;
	КлиентОбъект.Записать();
КонецЦикла;
КонецПроцедуры








