
//
&НаКлиенте
Процедура ПередОткрытием___(Отказ, СтандартнаяОбработка)
	//Если ЭтоНовый() тогда
	//	ЗапросЗакрытыхДней=Новый Запрос("ВЫБРАТЬ
	//	                                |	ЗакрытыеДни.День
	//	                                |ИЗ
	//	                                |	РегистрСведений.ЗакрытыеДни КАК ЗакрытыеДни
	//	                                |ГДЕ
	//	                                |	ЗакрытыеДни.Закрыт = ИСТИНА");	
	//	ТЗЗД=ЗапросЗакрытыхДней.Выполнить().Выгрузить();
	//	ДН=Дата(2010,01,01);
	//	ДК=НачалоДня(ТекущаяДата()-86400);
	//	Пока ДН<ДК цикл
	//		Если ТЗЗД.Найти(ДН,"День")=Неопределено тогда
	//			НовД=Дни.Добавить();
	//			Новд.День=ДН;
	//			НовД.Закрыть=Истина;
	//		конецесли;
	//		ДН=ДН+86400;	
	//	конеццикла;
	//иначе
	//	если ТекПол.Наименование<>"Администратор" тогда
	//		Предупреждение("Редактирование документа запрещено!");
	//		Отказ=Истина;
	//	конецесли;
	//	
	//конецесли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьДни();		
	Иначе
		ТекПол = ОбщийФункционалСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
		ТекПолНаименование = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(ТекПол,"Наименование");
	//	если ТекПол.Наименование<>"Администратор" тогда
		Если ТекПолНаименование <> "Администратор" Тогда
			ПоказатьПредупреждение(, "Редактирование документа запрещено!");
			Отказ=Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДни()
ЗапросЗакрытыхДней=Новый Запрос("ВЫБРАТЬ
                                |	ЗакрытыеДни.День
                                |ИЗ
                                |	РегистрСведений.ЗакрытыеДни КАК ЗакрытыеДни
                                |ГДЕ
                                |	ЗакрытыеДни.Закрыт = ИСТИНА");	

ТЗЗД=ЗапросЗакрытыхДней.Выполнить().Выгрузить();

ДН=Дата(2010,01,01);
ДК=НачалоДня(ТекущаяДата()-86400);
Пока ДН<ДК Цикл
	Если ТЗЗД.Найти(ДН,"День")=Неопределено тогда
		НовД=Объект.Дни.Добавить();
		Новд.День=ДН;
		НовД.Закрыть=Истина;
	конецесли;
	ДН=ДН+86400;	
КонецЦикла;
КонецПроцедуры
//

&НаКлиенте
Процедура ДниПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

// + ПСН
&НаКлиенте
Процедура ДниПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
// - ПСН
