
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Ложь);
КонецПроцедуры

&НаКлиенте
Асинх Процедура УстановитьПароль(Команда)
ТД = Элементы.Список.ТекущиеДанные;	
Если Элементы.Список.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

Обещание = ВвестиСтрокуАсинх(, "Введите новый пароль ...");
Результат = Ждать Обещание;
	
ПользовательКод = ТД.Код;
УстановитьПарольНаСервере(ПользовательКод, Результат);
КонецПроцедуры

&НаСервере
Процедура УстановитьПарольНаСервере(ПользовательКод ,Пароль)
ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательКод);	

ПользовательИБ.Пароль = Пароль;	
ПользовательИБ.Записать();
КонецПроцедуры
