
Функция ПолучитьБазовыеЦены(ДатаБазовойЦены) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	БазовыеЦены.Ссылка КАК Ссылка,
                      |	БазовыеЦены.Код КАК Код,
                      |	БазовыеЦены.Наименование КАК Наименование,
                      |	БазовыеЦены.ДатаУстановкиЦены КАК ДатаУстановкиЦены,
                      |	БазовыеЦены.БазоваяЦена КАК БазоваяЦена,
                      |	БазовыеЦены.ДоплатаЗаЗавтрак КАК ДоплатаЗаЗавтрак,
                      |	БазовыеЦены.ДоплатаЗаДвухместный КАК ДоплатаЗаДвухместный,
                      |	БазовыеЦены.ДоплатыЗаКатегории.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		КатегорияНомера КАК КатегорияНомера,
                      |		ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию
                      |	) КАК ДоплатыЗаКатегории
                      |ИЗ
                      |	Справочник.БазовыеЦены КАК БазовыеЦены
                      |ГДЕ
                      |	БазовыеЦены.ПометкаУдаления = ЛОЖЬ
                      |	И БазовыеЦены.ДатаУстановкиЦены <= &ДатаУстановкиЦены
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаУстановкиЦены УБЫВ");

Запрос.УстановитьПараметр("ДатаУстановкиЦены", ДатаБазовойЦены); 

ТЗ = Запрос.Выполнить().Выгрузить();

Возврат ТЗ;
КонецФункции

Функция ПолучитьБазоваяЦенаДня(ДатаЦены, КатегорияНомера, БезЗавтрака) Экспорт
//Результат = Новый Структура("БазоваяЦена, ДоплатаЗаЗавтрак, ДоплатаЗаДвухместный", 0, 0, 0);	
	
ТЗ_БазовыеЦены = ПолучитьБазовыеЦены(ДатаЦены);	

Если ТЗ_БазовыеЦены.Количество() = 0 Тогда
	БазоваяЦена = 0;	
	ДоплатаЗаЗавтрак = 0;	
	ДоплатаЗаДвухместный = 0;
	
	ДоплатаЗаКатегорию = 0;
Иначе
	Строка = ТЗ_БазовыеЦены[0];
	
	БазоваяЦена = Строка.БазоваяЦена;	
	ДоплатаЗаЗавтрак = Строка.ДоплатаЗаЗавтрак;	
	ДоплатаЗаДвухместный = Строка.ДоплатаЗаДвухместный;
	
	ДоплатыЗаКатегории = Строка.ДоплатыЗаКатегории;
	ОтборСтроки = Новый Структура("КатегорияНомера", КатегорияНомера); 	
	НайденныеСтроки = ДоплатыЗаКатегории.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		ДоплатаЗаКатегорию = 0;
	Иначе
		ДоплатаЗаКатегорию = НайденныеСтроки[0].ДоплатаЗаКатегорию;
	КонецЕсли;		
КонецЕсли;

	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КалендарьЦенБазовый.ДатаЦены КАК ДатаЦены,
                      |	КалендарьЦенБазовый.ТипЦены КАК ТипЦены,
                      |	КалендарьЦенБазовый.ЦенаДоплата КАК ЦенаДоплата
                      |ИЗ
                      |	РегистрСведений.КалендарьЦенБазовый КАК КалендарьЦенБазовый
                      |ГДЕ
                      |	КалендарьЦенБазовый.ДатаЦены = &ДатаЦены");

Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены); 

ТЗ = Запрос.Выполнить().Выгрузить();

ИзменениеБазовойЦены = Ложь;
Если ТЗ.Количество() > 0 Тогда

	Для Каждого Строка Из ТЗ Цикл
		Если Строка.ТипЦены = Перечисления.КалендарьЦенТипЦены.БазоваяЦена Тогда
			БазоваяЦена = Строка.ЦенаДоплата;
		ИначеЕсли Строка.ТипЦены = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный Тогда
		    ДоплатаЗаДвухместный = Строка.ЦенаДоплата;
		ИначеЕсли Строка.ТипЦены = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак Тогда
		    ДоплатаЗаЗавтрак = Строка.ЦенаДоплата;
		КонецЕсли;		
		
		ИзменениеБазовойЦены = Истина;
	КонецЦикла;
КонецЕсли;

БазоваяЦенаДняОдноместный = БазоваяЦена;	
БазоваяЦенаДняДвухместный = БазоваяЦена + ДоплатаЗаДвухместный;	

Если НЕ БезЗавтрака Тогда
	БазоваяЦенаДняОдноместный = БазоваяЦенаДняОдноместный + ДоплатаЗаЗавтрак;	
	БазоваяЦенаДняДвухместный = БазоваяЦена + ДоплатаЗаДвухместный + ДоплатаЗаЗавтрак * 2;	
КонецЕсли;
	
Результат = Новый Структура("БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный, БазоваяДоплатаЗаКатегорию, ИзменениеБазовойЦены"
	, БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный, ДоплатаЗаКатегорию, ИзменениеБазовойЦены);

Возврат Результат;
КонецФункции

Функция ПолучитьЦенаДня(ДатаЦены, КатегорияНомера
	, БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный, БазоваяДоплатаЗаКатегорию) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КалендарьЦенКатегории.ДатаЦены КАК ДатаЦены,
                      |	КалендарьЦенКатегории.КатегорияНомера КАК КатегорияНомера,
                      |	КалендарьЦенКатегории.ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию
                      |ИЗ
                      |	РегистрСведений.КалендарьЦенКатегории КАК КалендарьЦенКатегории
                      |ГДЕ
                      |	КалендарьЦенКатегории.ДатаЦены = &ДатаЦены
                      |	И КалендарьЦенКатегории.КатегорияНомера = &КатегорияНомера");

Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены); 
Запрос.УстановитьПараметр("КатегорияНомера", КатегорияНомера); 

ТЗ = Запрос.Выполнить().Выгрузить();

ИзменениЦеныДня = Ложь;
Если ТЗ.Количество() = 0 Тогда
	ЦенаДняОдноместный = БазоваяЦенаДняОдноместный	+ БазоваяДоплатаЗаКатегорию;
	ЦенаДняДвухместный = БазоваяЦенаДняДвухместный	+ БазоваяДоплатаЗаКатегорию;
Иначе
	Строка = ТЗ[0];
	
	ЦенаДняОдноместный = БазоваяЦенаДняОдноместный	+ Строка.ДоплатаЗаКатегорию;
	ЦенаДняДвухместный = БазоваяЦенаДняДвухместный	+ Строка.ДоплатаЗаКатегорию;;
	
	ИзменениЦеныДня = Истина;
КонецЕсли;	

Результат = Новый Структура("ЦенаДняОдноместный, ЦенаДняДвухместный, ИзменениЦеныДня"
	, ЦенаДняОдноместный, ЦенаДняДвухместный, ИзменениЦеныДня);

Возврат Результат;
КонецФункции

