
//
Функция ДеньПроживанияМинимум(Проживание) Экспорт
ДатаМинКонстанта = '30000101';
ДатаМин = ДатаМинКонстанта;
Для Каждого Строка Из Проживание Цикл
	ДатаМин = Мин(ДатаМин, Строка.Деньпроживания);	
КонецЦикла;
Если ДатаМин = ДатаМинКонстанта Тогда ДатаМин = '00010101'; КонецЕсли;
Возврат ДатаМин; 
КонецФункции	

Функция ДеньПроживанияМаксимум(Проживание) Экспорт
ДатаМакс = '00010101';
Для Каждого Строка Из Проживание Цикл
	ДатаМакс = Макс(ДатаМакс, Строка.Деньпроживания);	
КонецЦикла;
Возврат ДатаМакс; 
КонецФункции	
//

//
Функция РаспределитьОплатаСтрокаДолгСтрока(ОплатыСтрока, ОстатокКРаспределению, ДолгСтрока, РаспределениеОплатДолги) Экспорт
	
Если ДолгСтрока.СуммаКЗакрытию = 0 Тогда Возврат +1; КонецЕсли;
Если ОстатокКРаспределению = 0 Тогда Возврат -1; КонецЕсли;

ОплатыОстаток = ОстатокКРаспределению - ДолгСтрока.СуммаКЗакрытию;

Если ОплатыОстаток > 0 Тогда
	СуммаОплаты = ДолгСтрока.СуммаКЗакрытию; 
	ОстатокКРаспределению = ОплатыОстаток;
	
	ОплатыСтрока.СуммаРаспределено = ОплатыСтрока.СуммаРаспределено + СуммаОплаты;
	
	ДолгСтрока.СуммаОплачено = ДолгСтрока.СуммаДолг; 
	ДолгСтрока.СуммаКЗакрытию = 0; 
Иначе
	СуммаОплаты = ОстатокКРаспределению;
	СуммаКЗакрытию = ДолгСтрока.СуммаКЗакрытию - ОстатокКРаспределению; 
	
	ОплатыСтрока.СуммаРаспределено = ОплатыСтрока.СуммаРаспределено + СуммаОплаты;
	
	ДолгСтрока.СуммаКЗакрытию = СуммаКЗакрытию; 
	ДолгСтрока.СуммаОплачено = ДолгСтрока.СуммаОплачено + СуммаОплаты; 
	
	ОстатокКРаспределению = 0;
КонецЕсли;	

ОтборСтроки = Новый Структура("ДокументОплаты, ДолгиГУИД", ОплатыСтрока.ДокументОплаты, ДолгСтрока.ДолгиГУИД); 
НайденныеСтроки = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки); 
Если НайденныеСтроки.Количество() = 0 Тогда
	СтрокаРаспределениеОплатДолги = РаспределениеОплатДолги.Добавить();
	
	СтрокаРаспределениеОплатДолги.ДокументОплаты = ОплатыСтрока.ДокументОплаты;	
	СтрокаРаспределениеОплатДолги.Услуга = ДолгСтрока.Услуга;	
	СтрокаРаспределениеОплатДолги.ДолгиГУИД = ДолгСтрока.ДолгиГУИД;	
	СтрокаРаспределениеОплатДолги.СчетГУИД = ДолгСтрока.СчетГУИД;	
Иначе
	СтрокаРаспределениеОплатДолги = НайденныеСтроки[0];
КонецЕсли;	
СтрокаРаспределениеОплатДолги.СуммаОплаты = СтрокаРаспределениеОплатДолги.СуммаОплаты + СуммаОплаты;

Если ДолгСтрока.СуммаКЗакрытию = 0 Тогда 
	Возврат +1; 
ИначеЕсли ОстатокКРаспределению = 0 Тогда	
	Возврат -1; 
Иначе
	Возврат 0;
КонецЕсли;
КонецФункции

Функция РаспределитьОплатаНаСчетаДетальноДолги(ОплатаСтрока, ОстатокКРаспределению, СчетаДетальноДолги, РаспределениеОплатДолги)  Экспорт
Для Каждого Строка Из СчетаДетальноДолги Цикл
	Ответ = ЗаявкаОбщееКлиентСервер.РаспределитьОплатаСтрокаДолгСтрока(ОплатаСтрока, ОстатокКРаспределению, Строка, РаспределениеОплатДолги);
	
	Если ОстатокКРаспределению = 0 Тогда Возврат -1; КонецЕсли;	
КонецЦикла;

Возврат 0;
КонецФункции

Процедура РаспределитьСтрокаОплатаНаСчета(ОплатаСтрока, ОстатокКРаспределению, Счета
	, СчетаДетальноДолги, РаспределениеОплатДолги) Экспорт
Контрагент = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ОплатаСтрока.ДокументОплаты,"ОтКого");	
	
ОтборСтроки = Новый Структура("Контрагент", Контрагент);
НайденныеСчета = Счета.НайтиСтроки(ОтборСтроки);	
Для Каждого Счет Из НайденныеСчета Цикл
	
	ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
	НайденныеСчетаДетальноДолги = СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);	
	ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(ОплатаСтрока, ОстатокКРаспределению
		, НайденныеСчетаДетальноДолги, РаспределениеОплатДолги);
	
	//Строка.Закрыт = ОбщийМодульОплатыСервер.СчетЗакрыт(СчетаДетальноДолги, Строка.СчетГУИД); 
	
	Если ОстатокКРаспределению = 0 Тогда Прервать; КонецЕсли;	
КонецЦикла;	
КонецПроцедуры
// 




