
Функция СуммаЭквайринга(Строка) Экспорт
ТипОплаты = Строка.ТипОплаты;
ПроцентЭквайринга = Строка.ПроцентЭквайринга;

Проверить = Ложь;
Если ЗначениеЗаполнено(Строка.ДокументОплаты) Тогда
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("УникальныйИдентификатор") Тогда
		Проверить = Истина;
	ИначеЕсли Строка.ДокументОплаты.ПолучитьОбъект() <> Неопределено Тогда 
		Проверить = Истина;
	КонецЕсли;
КонецЕсли;	
	
Если Проверить Тогда
	Если ТипОплаты = 1	Тогда 
		Сумма = Строка.СуммаОплаты;
	ИначеЕсли ТипОплаты = 0	Тогда 
		Сумма = Окр(Строка.СуммаОплаты * (Строка.СуммаДокументаОплатыКарта / Строка.СуммаДокументаОплаты), 2);
	ИначеЕсли ТипОплаты = 4	Тогда 
		Сумма = Строка.СуммаОплаты;
	ИначеЕсли ТипОплаты = 5	Тогда 
		Сумма = Строка.СуммаОплаты;
		ПроцентЭквайринга = Строка.ПроцентЭквайрингаСБП;
	Иначе
		Сумма = 0; 
	КонецЕсли;
Иначе
	Сумма = 0; 
КонецЕсли;

СуммаЭквайринга = Окр(Сумма * ПроцентЭквайринга / 100, 2);     

Возврат СуммаЭквайринга; 
КонецФункции

//
Функция СуммаЭквайрингаПроживание(ТЗ_Проживание, ТЗ_Оплаты) Экспорт
СуммаЭквайрингаПроживание = 0;
Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	Для Каждого СтрокаПроживание Из ТЗ_Проживание Цикл 
		Если СтрокаПроживание.ГУИД = СтрокаОплаты.ДолгиГУИД Тогда
			СуммаЭквайрингаПроживание = СуммаЭквайрингаПроживание + СуммаЭквайринга(СтрокаОплаты);			
		КонецЕсли;		
	КонецЦикла;
КонецЦикла;
		
Возврат СуммаЭквайрингаПроживание;		
КонецФункции

//
Функция ТЗ_ОплатыЗаявки(Заявки) Экспорт

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга КАК Услуга,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
					  |	ЗаявкаДетальноОплаты.ГрупповаяОплата КАК ГрупповаяОплата,
					  //|	ЛОЖЬ КАК ГрупповаяОплата,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Номер КАК НомерДокументаОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Дата КАК ДатаДокументаОплаты,
                      |	ЕСТЬNULL(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Сумма, 0) КАК СуммаДокументаОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого КАК ДокументОплатыОтКого,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Сумма
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыКасса,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ЕСТЬNULL(ВозвратыВыписка.Сумма, 0)
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.Сумма, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.СуммаКарта, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.СуммаНаличные, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплатаНаличные,
                      |	0 КАК ОстатокДокументаОплаты,
                      |	ЕСТЬNULL(ОплатыДокументОплатыВыписка.Сумма, 0) КАК ОплатыДокументОплатыВыписка,
                      |	ЕСТЬNULL(ОплатыДокументОплатыКасса.Сумма, 0) КАК ОплатыДокументОплатыКасса,
                      |	ЕСТЬNULL(ОплатыДокументОплатыПрочиеОплаты.Сумма, 0) КАК ОплатыДокументОплатыПрочиеОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ВЫБОР
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Взаимозачет)
                      |						ТОГДА 9
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                      |						ТОГДА 10
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)
                      |						ТОГДА 11
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                      |						ТОГДА 12
                      |					ИНАЧЕ 10
                      |				КОНЕЦ
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |					ТОГДА ВЫБОР
                      |							КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |								ТОГДА 8
                      |							КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ЭтоЭквайринг
                      |								ТОГДА ВЫБОР
                      |										КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |											ТОГДА 5
                      |										ИНАЧЕ 4
                      |									КОНЕЦ
                      |							ИНАЧЕ 3
                      |						КОНЕЦ
                      |				ИНАЧЕ ВЫБОР
                      |						КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |							ТОГДА 8
                      |						КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные = 0
                      |								И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта > 0
                      |							ТОГДА 1
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные > 0
                      |										И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта = 0
                      |									ТОГДА 2
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ЭтоЭквайринг
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК ЭтоЭквайринг,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ""ВБ""
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ""КД""
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ""ПО""
                      |		ИНАЧЕ ""Ошибка""
                      |	КОНЕЦ КАК ТипДокументаОплаты,
					  //|	ЕСТЬNULL(КассоваяСмена.НачалоКассовойСмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыККМ
                      |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСменыККМ
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма,
                      |			0 КАК СуммаКарта,
                      |			0 КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК ВозвратыВыписка
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ВозвратыВыписка.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
                      |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК ВозвратыКасса
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ВозвратыКасса.ВозвратДокумент
					  |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					  |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК Ссылка,
					  |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
					  |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата КАК ГрупповаяОплата
					  |		ИЗ
					  |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты) КАК ЗаявкаДетальноОплаты
					  |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаДетальноОплаты.Ссылка
					  |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ЗаявкаДетальноОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ОплатыДокументОплатыКасса
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ОплатыДокументОплатыКасса.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ОплатыДокументОплатыВыписка
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ОплатыДокументОплатыВыписка.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ПрочиеОплатыДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ПрочиеОплатыДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ПрочиеОплаты.ДолгиОплата КАК ПрочиеОплатыДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ПрочиеОплатыДолгиОплата.Ссылка) КАК ОплатыДокументОплатыПрочиеОплаты
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ОплатыДокументОплатыПрочиеОплаты.Ссылка
					  //|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					  //|			КассовыйДокумент.Ссылка КАК ДокументОплаты,
					  //|			КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
					  //|			МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
					  //|		ИЗ
					  //|			Документ.КассовыйДокумент КАК КассовыйДокумент
					  //|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
					  //|				ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
					  //|					И (ВЫБОР
					  //|						КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
					  //|							ТОГДА ИСТИНА
					  //|						ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
					  //|					КОНЕЦ)
					  //|		
					  //|		СГРУППИРОВАТЬ ПО
					  //|			КассовыйДокумент.Ссылка,
					  //|			КассоваяСмена.НомерСменыККТ) КАК КассоваяСмена
					  //|		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = КассоваяСмена.ДокументОплаты
                      |ГДЕ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка В (&Заявки)
					  | И НЕ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого ЕСТЬ NULL
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДокументОплатыДатаОплаты,
                      |	ДокументОплаты");


Запрос.УстановитьПараметр("Заявки", Заявки);
ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();	

//
ТЗ_Оплаты_ДокументыОплаты = ТЗ_Оплаты.Скопировать(, "ДокументОплаты");
ТЗ_Оплаты_ДокументыОплаты.Свернуть("ДокументОплаты");
Массив_Оплаты_ДокументыОплаты = ТЗ_Оплаты_ДокументыОплаты.ВыгрузитьКолонку("ДокументОплаты");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
                      |	МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
                      |		ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
                      |			И (ВЫБОР
                      |				КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
                      |					ТОГДА ИСТИНА
                      |				ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
                      |			КОНЕЦ)
                      |ГДЕ
                      |	КассовыйДокумент.Ссылка В(&ДокументыОплаты)
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	КассовыйДокумент.Ссылка,
                      |	КассоваяСмена.НомерСменыККТ");

Запрос.УстановитьПараметр("ДокументыОплаты", Массив_Оплаты_ДокументыОплаты);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	СтрокаТЗ = ТЗ.Найти(СтрокаОплаты.ДокументОплаты, "ДокументОплаты");
	Если ЗначениеЗаполнено(СтрокаТЗ) ТОгда
		СтрокаОплаты.ДатаСменыККМ = СтрокаТЗ.НачалоКассовойСмены;
	Иначе
		СтрокаОплаты.ДатаСменыККМ = '00010101';
	КонецЕсли;	
		
КонецЦикла;
//

ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Если ЗначениеЗаполнено(СтрокаОплаты.ДокументОплаты) Тогда
		ДатаОплаты = СтрокаОплаты.ДокументОплаты.ДатаОплаты;
	Иначе
		ДатаОплаты = '00010101';
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", ДатаОплаты);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
		
	СтрокаОплаты.ПроцентЭквайринга = ПроцентЭквайринга;
	СтрокаОплаты.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;
	
Для Каждого Строка Из ТЗ_Оплаты Цикл
	Строка.ОстатокДокументаОплаты = Строка.СуммаДокументаОплаты - Строка.СуммаВозвратаДокументаОплаты;
		
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыВыписка;	
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыКасса;	
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыПрочиеОплаты;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ДокументОплатыОтКого.Наименование;	
	КонецЕсли;
	
КонецЦикла;

//Для Каждого Строка Из ТЗ_Оплаты Цикл
//	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
//		Строка.КонтрагентНаименование = Строка.ДокументОплатыОтКого.Наименование;	
//	КонецЕсли;
//КонецЦикла;

Возврат ТЗ_Оплаты;
КонецФункции

Функция ТЗ_ОплатыЗаявка(ТЗ_ОплатыЗаявки, Заявка) Экспорт
ОтборСтроки = Новый Структура("Заявка", Заявка); 
ТЗ_ОплатыЗаявка = ТЗ_ОплатыЗаявки.Скопировать(ОтборСтроки);	

Возврат ТЗ_ОплатыЗаявка;		
КонецФункции
//

Функция ТЗ_ОплатыЗаявка_ЧерезЗапрос(Заявка) Экспорт
                     
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга КАК Услуга,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
					  |	ЗаявкаДетальноОплаты.ГрупповаяОплата КАК ГрупповаяОплата,
					  //|	ЛОЖЬ КАК ГрупповаяОплата,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Номер КАК НомерДокументаОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Дата КАК ДатаДокументаОплаты,
                      |	ЕСТЬNULL(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Сумма, 0) КАК СуммаДокументаОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого КАК ДокументОплатыОтКого,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Сумма
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыКасса,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ЕСТЬNULL(ВозвратыВыписка.Сумма, 0)
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.Сумма, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.СуммаКарта, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.СуммаНаличные, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплатаНаличные,
                      |	0 КАК ОстатокДокументаОплаты,
                      |	ЕСТЬNULL(ОплатыДокументОплатыВыписка.Сумма, 0) КАК ОплатыДокументОплатыВыписка,
                      |	ЕСТЬNULL(ОплатыДокументОплатыКасса.Сумма, 0) КАК ОплатыДокументОплатыКасса,
                      |	ЕСТЬNULL(ОплатыДокументОплатыПрочиеОплаты.Сумма, 0) КАК ОплатыДокументОплатыПрочиеОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ВЫБОР
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Взаимозачет)
                      |						ТОГДА 9
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                      |						ТОГДА 10
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)
                      |						ТОГДА 11
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                      |						ТОГДА 12
                      |					ИНАЧЕ 10
                      |				КОНЕЦ
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |					ТОГДА ВЫБОР
                      |							КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |								ТОГДА 8
                      |							КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ЭтоЭквайринг
                      |								ТОГДА ВЫБОР
                      |										КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |											ТОГДА 5
                      |										ИНАЧЕ 4
                      |									КОНЕЦ
                      |							ИНАЧЕ 3
                      |						КОНЕЦ
                      |				ИНАЧЕ ВЫБОР
                      |						КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |							ТОГДА 8
                      |						КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные = 0
                      |								И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта > 0
                      |							ТОГДА 1
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные > 0
                      |										И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта = 0
                      |									ТОГДА 2
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ЭтоЭквайринг
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК ЭтоЭквайринг,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ""ВБ""
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ""КД""
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ""ПО""
                      |		ИНАЧЕ ""Ошибка""
                      |	КОНЕЦ КАК ТипДокументаОплаты,
					  //|	ЕСТЬNULL(КассоваяСмена.НачалоКассовойСмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыККМ
                      |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСменыККМ
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма,
                      |			0 КАК СуммаКарта,
                      |			0 КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК ВозвратыВыписка
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ВозвратыВыписка.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
                      |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК ВозвратыКасса
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ВозвратыКасса.ВозвратДокумент
					  |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					  |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК Ссылка,
					  |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
					  |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата КАК ГрупповаяОплата
					  |		ИЗ
					  |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты) КАК ЗаявкаДетальноОплаты
					  |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаДетальноОплаты.Ссылка
					  |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ЗаявкаДетальноОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ОплатыДокументОплатыКасса
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ОплатыДокументОплатыКасса.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ОплатыДокументОплатыВыписка
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ОплатыДокументОплатыВыписка.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ПрочиеОплатыДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ПрочиеОплатыДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ПрочиеОплаты.ДолгиОплата КАК ПрочиеОплатыДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ПрочиеОплатыДолгиОплата.Ссылка) КАК ОплатыДокументОплатыПрочиеОплаты
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ОплатыДокументОплатыПрочиеОплаты.Ссылка
					  //|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					  //|			КассовыйДокумент.Ссылка КАК ДокументОплаты,
					  //|			КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
					  //|			МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
					  //|		ИЗ
					  //|			Документ.КассовыйДокумент КАК КассовыйДокумент
					  //|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
					  //|				ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
					  //|					И (ВЫБОР
					  //|						КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
					  //|							ТОГДА ИСТИНА
					  //|						ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
					  //|					КОНЕЦ)
					  //|		
					  //|		СГРУППИРОВАТЬ ПО
					  //|			КассовыйДокумент.Ссылка,
					  //|			КассоваяСмена.НомерСменыККТ) КАК КассоваяСмена
					  //|		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = КассоваяСмена.ДокументОплаты
                      |ГДЕ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = &Заявка
					  | И НЕ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого ЕСТЬ NULL
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДокументОплатыДатаОплаты,
                      |	ДокументОплаты");


Запрос.УстановитьПараметр("Заявка", Заявка);
ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();	

//
ТЗ_Оплаты_ДокументыОплаты = ТЗ_Оплаты.Скопировать(, "ДокументОплаты");
ТЗ_Оплаты_ДокументыОплаты.Свернуть("ДокументОплаты");
Массив_Оплаты_ДокументыОплаты = ТЗ_Оплаты_ДокументыОплаты.ВыгрузитьКолонку("ДокументОплаты");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
                      |	МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
                      |		ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
                      |			И (ВЫБОР
                      |				КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
                      |					ТОГДА ИСТИНА
                      |				ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
                      |			КОНЕЦ)
                      |ГДЕ
                      |	КассовыйДокумент.Ссылка В(&ДокументыОплаты)
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	КассовыйДокумент.Ссылка,
                      |	КассоваяСмена.НомерСменыККТ");

Запрос.УстановитьПараметр("ДокументыОплаты", Массив_Оплаты_ДокументыОплаты);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	СтрокаТЗ = ТЗ.Найти(СтрокаОплаты.ДокументОплаты, "ДокументОплаты");
	Если ЗначениеЗаполнено(СтрокаТЗ) ТОгда
		СтрокаОплаты.ДатаСменыККМ = СтрокаТЗ.НачалоКассовойСмены;
	Иначе
		СтрокаОплаты.ДатаСменыККМ = '00010101';
	КонецЕсли;	
		
КонецЦикла;
//

ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Если ЗначениеЗаполнено(СтрокаОплаты.ДокументОплаты) Тогда
		ДатаОплаты = СтрокаОплаты.ДокументОплаты.ДатаОплаты;
	Иначе
		ДатаОплаты = '00010101';
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", ДатаОплаты);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
		
	СтрокаОплаты.ПроцентЭквайринга = ПроцентЭквайринга;
	СтрокаОплаты.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;
	
Для Каждого Строка Из ТЗ_Оплаты Цикл
	Строка.ОстатокДокументаОплаты = Строка.СуммаДокументаОплаты - Строка.СуммаВозвратаДокументаОплаты;
		
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыВыписка;	
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыКасса;	
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыПрочиеОплаты;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ДокументОплатыОтКого.Наименование;	
	КонецЕсли;
	
КонецЦикла;

//Для Каждого Строка Из ТЗ_Оплаты Цикл
//	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
//		Строка.КонтрагентНаименование = Строка.ДокументОплатыОтКого.Наименование;	
//	КонецЕсли;
//КонецЦикла;

Возврат ТЗ_Оплаты;
КонецФункции
//

//
Функция СуммаЭквайрингаСчет(Счет, ТЗ_Оплаты) Экспорт
СуммаЭквайрингаСчет = 0;
		
ТЗ_Услуги = Счет.ДопУслугиКоворкинг;

Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	СуммаЭквайрингаСчет_Услуги = 0;
		
	Если НЕ СтрокаОплаты.ЭтоУслуга Тогда
		СуммаЭквайрингаСчет = СуммаЭквайрингаСчет + СуммаЭквайринга(СтрокаОплаты);			
		
	Иначе
		
		ОтборСтрокиУслуги = Новый Структура("ГУИД", СтрокаОплаты.ДолгиГУИД);
		НайденныеУслуги = ТЗ_Услуги.НайтиСтроки(ОтборСтрокиУслуги);
		Для Каждого СтрокаУслуга Из НайденныеУслуги Цикл
			Результат = Справочники.ДопУслуги.ПустаяСсылка();
			Ссылка = СтрокаУслуга.Услуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
			
			СуммаЭквайрингаСчет_Услуги = СуммаЭквайрингаСчет_Услуги + СуммаЭквайринга(СтрокаОплаты);			
		КонецЦикла;
	КонецЕсли;		
	
	СуммаЭквайрингаСчет = СуммаЭквайрингаСчет + СуммаЭквайрингаСчет_Услуги;
КонецЦикла;
		
Возврат СуммаЭквайрингаСчет;		
КонецФункции

Функция ТЗ_ОплатыСчет(Счет) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка КАК Заявка,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты КАК ДокументОплаты,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ЭтоУслуга КАК ЭтоУслуга,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ГУИДДолги КАК ДолгиГУИД,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.СуммаОплаты КАК СуммаОплаты,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.Номер КАК НомерДокументаОплаты,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.Дата КАК ДатаДокументаОплаты,
                      |	ЕСТЬNULL(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.Сумма, 0) КАК СуммаДокументаОплаты,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ОтКого КАК ДокументаОплатыОтКого,
                      |	ВЫБОР
                      |		КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.Сумма
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыКасса,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ЕСТЬNULL(ВозвратыВыписка.Сумма, 0)
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.Сумма, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.СуммаКарта, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.СуммаНаличные, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплатаНаличные,
                      |	0 КАК ОстатокДокументаОплаты,
                      |	ЕСТЬNULL(ОплатыДокументОплатыВыписка.Сумма, 0) КАК ОплатыДокументОплатыВыписка,
                      |	ЕСТЬNULL(ОплатыДокументОплатыКасса.Сумма, 0) КАК ОплатыДокументОплатыКасса,
                      |	ЕСТЬNULL(ОплатыДокументОплатыПрочиеОплаты.Сумма, 0) КАК ОплатыДокументОплатыПрочиеОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ВЫБОР
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Взаимозачет)
                      |						ТОГДА 9
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                      |						ТОГДА 10
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)
                      |						ТОГДА 11
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                      |						ТОГДА 12
                      |					ИНАЧЕ 10
                      |				КОНЕЦ
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |					ТОГДА ВЫБОР
                      |							КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |								ТОГДА 8
                      |							КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |								ТОГДА ВЫБОР
                      |										КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |											ТОГДА 5
                      |										ИНАЧЕ 4
                      |									КОНЕЦ
                      |							ИНАЧЕ 3
                      |						КОНЕЦ
                      |				ИНАЧЕ ВЫБОР
                      |						КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |							ТОГДА 8
                      |						КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные = 0
                      |								И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта > 0
                      |							ТОГДА 1
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные > 0
                      |										И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта = 0
                      |									ТОГДА 2
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК ЭтоЭквайринг,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ""ВБ""
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ""КД""
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ""ПО""
                      |		ИНАЧЕ """"
                      |	КОНЕЦ КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.КоворкингСчета.РаспределениеОплатКоворкинг КАК КоворкингСчетаРаспределениеОплатКоворкинг
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма,
                      |			0 КАК СуммаКарта,
                      |			0 КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК ВозвратыВыписка
                      |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты = ВозвратыВыписка.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
                      |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК ВозвратыКасса
                      |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты = ВозвратыКасса.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ДокументКоворкингСчетаДокументыОплаты.Ссылка КАК Ссылка,
                      |			ДокументКоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты
                      |		ИЗ
                      |			Документ.КоворкингСчета.ДокументыОплаты КАК ДокументКоворкингСчетаДокументыОплаты) КАК СчетаДокументыОплаты
                      |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка = СчетаДокументыОплаты.Ссылка
                      |			И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты = СчетаДокументыОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ОплатыДокументОплатыКасса
                      |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты = ОплатыДокументОплатыКасса.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ОплатыДокументОплатыВыписка
                      |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты = ОплатыДокументОплатыВыписка.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ПрочиеОплатыДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ПрочиеОплатыДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ПрочиеОплаты.ДолгиОплата КАК ПрочиеОплатыДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ПрочиеОплатыДолгиОплата.Ссылка) КАК ОплатыДокументОплатыПрочиеОплаты
                      |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты = ОплатыДокументОплатыПрочиеОплаты.Ссылка
                      |ГДЕ
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка = &Счет
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДокументОплатыДатаОплаты,
                      |	ДокументОплаты");


Запрос.УстановитьПараметр("Счет", Счет);
ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();	

ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", СтрокаОплаты.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	СтрокаОплаты.ПроцентЭквайринга = ПроцентЭквайринга;
	СтрокаОплаты.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;
	
Для Каждого Строка Из ТЗ_Оплаты Цикл
	Строка.ОстатокДокументаОплаты = Строка.СуммаДокументаОплаты - Строка.СуммаВозвратаДокументаОплаты;
		
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыВыписка;	
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыКасса;	
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыПрочиеОплаты;	
	КонецЕсли;
КонецЦикла;

Для Каждого Строка Из ТЗ_Оплаты Цикл
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ДокументаОплатыОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Возврат ТЗ_Оплаты;
КонецФункции
//

Функция ТЗ_Возвраты(ДокументОплаты) Экспорт
	
КонецФункции

//
Функция ТЗ_ПроживаниеЗаявки(Заявки) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронированиеПроживание.Ссылка КАК Заявка,
	                      |	ЗаявкаНаБронированиеПроживание.ГУИД КАК ГУИД,
	                      |	ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
	                      |	ЗаявкаНаБронированиеПроживание.Тариф КАК Тариф,
	                      |	ЗаявкаНаБронированиеПроживание.Сумма КАК Сумма,
	                      |	ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидки,
	                      |	ЗаявкаНаБронированиеПроживание.ПроцентСкидкиКлиента КАК ПроцентСкидкиКлиента,
	                      |	ЗаявкаНаБронированиеПроживание.Цена КАК Цена,
	                      |	ЗаявкаНаБронированиеПроживание.Количество КАК Количество,
	                      |	ЕСТЬNULL(Счет.ГрупповойСчет, ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка) КАК ЭтоГрупповойСчет,
	                      |	ЕСТЬNULL(Счет.ЭтоПредварительныйГрупповойСчет, ЛОЖЬ) КАК ЭтоПредварительныйГрупповойСчет,
	                      |	ЕСТЬNULL(Счет.СвернутьВСчете, ЛОЖЬ) КАК СвернутьВСчете
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
	                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД КАК ДолгиГУИД,
	                      |			ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
	                      |			ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет КАК ЭтоПредварительныйГрупповойСчет,
	                      |			ЗаявкаНаБронированиеСчета.СвернутьВСчете КАК СвернутьВСчете
	                      |		ИЗ
	                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
	                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
	                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
	                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД) КАК Счет
	                      |		ПО ЗаявкаНаБронированиеПроживание.Ссылка = Счет.Ссылка
	                      |			И ЗаявкаНаБронированиеПроживание.ГУИД = Счет.ДолгиГУИД
	                      |ГДЕ
	                      |	ЗаявкаНаБронированиеПроживание.Ссылка В(&Заявки)");
	
	Запрос.УстановитьПараметр("Заявки", Заявки);
	ТЗ_Проживание = Запрос.Выполнить().Выгрузить(); 
Возврат ТЗ_Проживание	
КонецФункции

Функция ТЗ_ПроживаниеЗаявкаДеньПроживания(ТЗ_ПроживаниеЗаявки, Заявка, ДеньПроживания) Экспорт 
	ОтборСтроки = Новый Структура("Заявка, ДеньПроживания", Заявка, ДеньПроживания); 
	ТЗ_ПроживаниеЗаявкаДеньПроживания = ТЗ_ПроживаниеЗаявки.Скопировать(ОтборСтроки);	
	
	Возврат ТЗ_ПроживаниеЗаявкаДеньПроживания;	
КонецФункции
//

Функция ТЗ_ПроживаниеЗаявкаДеньПроживания_ЧерезЗапрос(Заявка, ДеньПроживания) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	                      |	ЗаявкаНаБронированиеПроживание.ГУИД КАК ГУИД,
	                      |	ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
	                      |	ЗаявкаНаБронированиеПроживание.Тариф КАК Тариф,
	                      |	ЗаявкаНаБронированиеПроживание.Сумма КАК Сумма,
	                      |	ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидки,
	                      |	ЗаявкаНаБронированиеПроживание.ПроцентСкидкиКлиента КАК ПроцентСкидкиКлиента,
	                      |	ЗаявкаНаБронированиеПроживание.Цена КАК Цена,
	                      |	ЗаявкаНаБронированиеПроживание.Количество КАК Количество,
	                      |	ЕСТЬNULL(Счет.ГрупповойСчет, ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка) КАК ЭтоГрупповойСчет,
	                      |	ЕСТЬNULL(Счет.ЭтоПредварительныйГрупповойСчет, ЛОЖЬ) КАК ЭтоПредварительныйГрупповойСчет
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
	                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД КАК ДолгиГУИД,
	                      |			ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
	                      |			ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет КАК ЭтоПредварительныйГрупповойСчет
	                      |		ИЗ
	                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
	                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
	                      |				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
	                      |					И ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД) КАК Счет
	                      |		ПО ЗаявкаНаБронированиеПроживание.Ссылка = Счет.Ссылка
	                      |			И ЗаявкаНаБронированиеПроживание.ГУИД = Счет.ДолгиГУИД
	                      |ГДЕ
	                      |	ЗаявкаНаБронированиеПроживание.Ссылка = &Заявка
	                      |	И ЗаявкаНаБронированиеПроживание.ДеньПроживания = &ДеньПроживания");
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ДеньПроживания", ДеньПроживания);
	ТЗ_Проживание = Запрос.Выполнить().Выгрузить(); 
Возврат ТЗ_Проживание	
КонецФункции


//
Функция ТЗ_УслугиЗаявки(Заявки) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеДопУслуги.ГУИД КАК ГУИД,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена КАК Цена,
                      |	ЗаявкаНаБронированиеДопУслуги.Количество КАК Количество,
                      |	ЗаявкаНаБронированиеДопУслуги.ВСчет КАК ВСчет,
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК Сумма,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК СуммаУслугиДолг,
                      |	ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |	ЕСТЬNULL(ЗаявкаДопУслугиОплаты.СуммаОплаты, 0) КАК СуммаУслугиОплата
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка
                      |			И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК ЗаявкаДопУслугиОплаты
                      |		ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаДопУслугиОплаты.Ссылка
                      |			И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаДопУслугиОплаты.ДолгиГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка В (&Заявки)
                      |	И ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
                      |	");
	
	Запрос.УстановитьПараметр("Заявки", Заявки);
	ТЗ_Услуги = Запрос.Выполнить().Выгрузить(); 
	
Возврат ТЗ_Услуги;	
КонецФункции

Функция ТЗ_УслугиЗаявкаДеньПроживания(ТЗ_УслугиЗаявки, Заявка, ДатаУслуги) Экспорт
ОтборСтроки = Новый Структура("Заявка, ДатаУслуги", Заявка, ДатаУслуги); 
ТЗ_УслугиЗаявкаДеньПроживания = ТЗ_УслугиЗаявки.Скопировать(ОтборСтроки);	

Возврат ТЗ_УслугиЗаявкаДеньПроживания;
КонецФункции
//

Функция ТЗ_УслугиЗаявкаДеньПроживания_ЧерезЗапрос(Заявка, ДеньПроживания) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронированиеДопУслуги.ГУИД КАК ГУИД,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена КАК Цена,
                      |	ЗаявкаНаБронированиеДопУслуги.Количество КАК Количество,
                      |	ЗаявкаНаБронированиеДопУслуги.ВСчет КАК ВСчет,
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК Сумма,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК СуммаУслугиДолг,
                      |	ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |	ЕСТЬNULL(ЗаявкаДопУслугиОплаты.СуммаОплаты, 0) КАК СуммаУслугиОплата
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка
                      |			И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК ЗаявкаДопУслугиОплаты
                      |		ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаДопУслугиОплаты.Ссылка
                      |			И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаДопУслугиОплаты.ДолгиГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка = &Заявка
                      |	И ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
                      |	И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги = &ДеньПроживания");
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ДеньПроживания", ДеньПроживания);
	ТЗ_Услуги = Запрос.Выполнить().Выгрузить(); 
	
Возврат ТЗ_Услуги;	
КонецФункции


Функция ТипОплатыСписокВыбора() Экспорт
СписокВыбора = Новый СписокЗначений;

СписокВыбора.Добавить("нал");
СписокВыбора.Добавить("к/к");
СписокВыбора.Добавить("смеш.");
СписокВыбора.Добавить("б/н");
СписокВыбора.Добавить("п/к");
СписокВыбора.Добавить("сбп");
СписокВыбора.Добавить("в/з");
СписокВыбора.Добавить("спис.");
СписокВыбора.Добавить("спис. услуги");
СписокВыбора.Добавить("спис. зачет");
СписокВыбора.Добавить("оverbooking");

Возврат СписокВыбора;
КонецФункции

Функция ТипОплатыНаименование(ТипОплаты) Экспорт
Если ТипОплаты = 0 Тогда	
	Возврат "смеш.";
ИначеЕсли ТипОплаты = 1 Тогда	
	Возврат "к/к";
ИначеЕсли ТипОплаты = 2 Тогда	
	Возврат "нал";
ИначеЕсли ТипОплаты = 3 Тогда	
	Возврат "б/н";
ИначеЕсли ТипОплаты = 4 Тогда	
	Возврат "п/к";
ИначеЕсли ТипОплаты = 5 Тогда	
	Возврат "сбп";
ИначеЕсли ТипОплаты = 8 Тогда	
	Возврат "оverbooking";
ИначеЕсли ТипОплаты = 9 Тогда	
	Возврат "в/з";
ИначеЕсли ТипОплаты = 10 ИЛИ ТипОплаты = 11 Тогда	
	Возврат "спис.";
ИначеЕсли ТипОплаты = 11 Тогда	
	Возврат "спис. услуги";
ИначеЕсли ТипОплаты = 12 Тогда	
	Возврат "спис. зачет";
КонецЕсли;

Возврат "";	
КонецФункции

Функция ТипПлатежаНаименование(ДокументПлатежа) Экспорт
Если ТипЗнч(ДокументПлатежа) = Тип("ДокументСсылка.ВыпискаБанка") Тогда	
	Возврат "ВБ";
ИначеЕсли ТипЗнч(ДокументПлатежа) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда	
	Возврат "ПО";
ИначеЕсли ТипЗнч(ДокументПлатежа) = Тип("ДокументСсылка.КассовыйДокумент") Тогда	
	Возврат "КД";
КонецЕсли;

Возврат "";	
КонецФункции

Функция ОплатилНаименование(Строка) Экспорт
Если ЗначениеЗаполнено(Строка.ДокументОплаты) Тогда
	
	Если Строка.ТипОплаты = 0 Тогда	
		Возврат "Гость смеш.";
	ИначеЕсли Строка.ТипОплаты = 1 Тогда	
		Возврат "Гость к/к";
	ИначеЕсли Строка.ТипОплаты = 2 Тогда	
		Возврат "Гость нал";
	ИначеЕсли Строка.ТипОплаты = 3 Тогда	
		Возврат "" + Строка.КонтрагентНаименование + " б/н";
	ИначеЕсли Строка.ТипОплаты = 4 Тогда	
		Возврат "Гость п/к";
	ИначеЕсли Строка.ТипОплаты = 5 Тогда	
		Возврат "Гость сбп";
	ИначеЕсли Строка.ТипОплаты = 9 Тогда	
		//Возврат "" + Строка.ДокументОплаты.ОтКого + " в/з";
		Возврат "" + Строка.КонтрагентНаименование + " в/з";
	КонецЕсли;
Иначе
	Возврат "";	
КонецЕсли;
КонецФункции
