
&НаКлиенте
Процедура ПриОткрытии___()
	//КнопкаВыполнитьНажатие(Неопределено);
	//Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//КнопкаВыполнитьНажатие(Неопределено);
 ВыполнитьКомандаНаСервере();
	
	//Закрыть();
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыполнитьНажатие(Кнопка)
	//СпрНомеров=Справочники.НомернойФонд.Выбрать();
	//ЗапросТекущейБрони=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	//                                |	ЗанятостьНомеров.Регистратор,
	//                                |	ЗанятостьНомеров.ПериодРезерва КАК ПериодРезерва
	//                                |ИЗ
	//                                |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//                                |ГДЕ
	//                                |	ЗанятостьНомеров.Номер = &Номер
	//                                |	И ЗанятостьНомеров.ПериодРезерва >= &ПериодРезерва
	//                                |
	//                                |УПОРЯДОЧИТЬ ПО
	//                                |	ПериодРезерва");
	//ЗапросТекущейБрони.УстановитьПараметр("ПериодРезерва",ТекущаяДата());
	//Пока СпрНомеров.Следующий() цикл
	//	ЗапросТекущейБрони.УстановитьПараметр("Номер",СпрНомеров.Ссылка);
	//	ТЗБрони=ЗапросТекущейБрони.Выполнить().Выгрузить();
	//	Если ТЗБрони.Количество()=0 тогда
	//		Сообщение="Заездов не ожидается";
	//	иначе
	//		Сообщение="Номер "+Строка(СпрНомеров.Код)+ " проживает: " +ТЗБрони[0].Регистратор.Клиент.Наименование + ", тариф " +  ТЗБрони[0].Регистратор.Тариф.Наименование + ", кол-во гостей "+ Строка(ТЗБрони[0].Регистратор.КолВоЧеловек)+ ", с " + Формат(ТЗБрони[0].Регистратор.РезервС, "ДФ=dd.MM") +", по "+ Формат(ТЗБрони[0].Регистратор.РезервПо, "ДФ=dd.MM");    
	//	конецесли;
	//	СоздатьСообщениеПроверяющему(СпрНомеров.Ссылка,Сообщение);
	//конеццикла;
	//
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
 ВыполнитьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандаНаСервере()
	СпрНомеров=Справочники.НомернойФонд.Выбрать();
	ЗапросТекущейБрони=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                                |	ЗанятостьНомеров.Регистратор,
	                                |	ЗанятостьНомеров.ПериодРезерва КАК ПериодРезерва
	                                |ИЗ
	                                |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                                |ГДЕ
	                                |	ЗанятостьНомеров.Номер = &Номер
	                                |	И ЗанятостьНомеров.ПериодРезерва >= &ПериодРезерва
	                                |
	                                |УПОРЯДОЧИТЬ ПО
	                                |	ПериодРезерва");
	ЗапросТекущейБрони.УстановитьПараметр("ПериодРезерва",ТекущаяДата());
	Пока СпрНомеров.Следующий() цикл
		ЗапросТекущейБрони.УстановитьПараметр("Номер",СпрНомеров.Ссылка);
		ТЗБрони=ЗапросТекущейБрони.Выполнить().Выгрузить();
		Если ТЗБрони.Количество()=0 тогда
			Сообщение="Заездов не ожидается";
		иначе
			Сообщение="Номер "+Строка(СпрНомеров.Код)+ " проживает: " +ТЗБрони[0].Регистратор.Клиент.Наименование + ", Тариф_НеИспользуется " +  ТЗБрони[0].Регистратор.Тариф_НеИспользуется.Наименование + ", кол-во гостей "+ Строка(ТЗБрони[0].Регистратор.КолВоЧеловек)+ ", с " + Формат(ТЗБрони[0].Регистратор.РезервС, "ДФ=dd.MM") +", по "+ Формат(ТЗБрони[0].Регистратор.РезервПо, "ДФ=dd.MM");    
		конецесли;
		СоздатьСообщениеПроверяющему(СпрНомеров.Ссылка,Сообщение);
	конеццикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСообщениеПроверяющему(Номер,Сообщение) Экспорт
	
	Запрос="UPDATE super_zaezd set info='"+Сообщение+"' where nomer = "+Строка(Число(Номер.Код));	
	СлужебныеСервер.КомандаMySQL(Запрос);
	
	ТекПол = ПараметрыСеанса.ТекущийПользователь;
	
	СлужебныеСервер.ВЛог("Создано сообщение проверяющему: " + Сообщение + " по номеру " + Строка(Число(Номер.Код))+" пользователем " + ТекПол,"Задания.log");	
КонецПроцедуры

&НаСервере
Функция КомандаMySQL___ (ТекстЗапроса)
		Возврат Неопределено;
	
		Соединение = Новый COMОбъект("ADODB.Connection");
		Соединение.ConnectionString ="DRIVER={MySQL ODBC 5.2a Driver};OPTION=3;DATABASE=artemis;PWD=wertyu;PORT=3306;SERVER=127.0.0.1;UID=artemis;";
		// инициализируем набор записей и комманду
		НаборЗаписей = Новый COMОбъект("ADODB.Recordset");
		Команда = Новый COMОбъект("ADODB.Command");
		Попытка
			Соединение.Open();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
      Попытка
	  
	  	Соединение.execute(ТекстЗапроса);	
	  
	  Исключение
	  
	  КонецПопытки;	  
	//  ТЗ=СКЛ_ТЗ(Table);
	//  Возврат ТЗ;
КонецФункции




