&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
	//Если ВариантОтбора=0 тогда
	//	Запрос=Новый Запрос("ВЫБРАТЬ
	//	|	ЗаявкаНаБронирование.Ссылка,
	//	|	ЗаявкаНаБронирование.Бронирует,
	//	|	ЗаявкаНаБронирование.Дата КАК Дата,
	//	|	ЗаявкаНаБронирование.РезервС,
	//	|	ЗаявкаНаБронирование.ДатаАннуляции,
	//	|	1 КАК КолВо,
	//	|	ЗаявкаНаБронирование.Бронирует.ВидКлиента КАК Вид
	//	|ИЗ
	//	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//	|ГДЕ
	//	|	ЗаявкаНаБронирование.ДатаАннуляции МЕЖДУ &ПериодС И &ПериодПо
	//	 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
	//	|	И ЗаявкаНаБронирование.Статус = &Статус
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Дата");
	//ИначеЕсли ВариантОтбора=1 тогда
	//	Запрос=Новый Запрос("ВЫБРАТЬ
	//	|	ЗаявкаНаБронирование.Ссылка,
	//	|	ЗаявкаНаБронирование.Бронирует,
	//	|	ЗаявкаНаБронирование.Дата КАК Дата,
	//	|	ЗаявкаНаБронирование.РезервС,
	//	|	ЗаявкаНаБронирование.ДатаАннуляции,
	//	|	1 КАК КолВо,
	//	|	ЗаявкаНаБронирование.Бронирует.ВидКлиента КАК Вид
	//	|ИЗ
	//	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//	|ГДЕ
	//	|	ЗаявкаНаБронирование.РезервС МЕЖДУ &ПериодС И &ПериодПо
	//	 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
	//	|	И ЗаявкаНаБронирование.Статус = &Статус
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Дата");	
	//ИначеЕсли ВариантОтбора=2 тогда
	//	Запрос=Новый Запрос("ВЫБРАТЬ
	//	|	ЗаявкаНаБронирование.Ссылка,
	//	|	ЗаявкаНаБронирование.Бронирует,
	//	|	ЗаявкаНаБронирование.Дата КАК Дата,
	//	|	ЗаявкаНаБронирование.РезервС,
	//	|	ЗаявкаНаБронирование.ДатаАннуляции,
	//	|	1 КАК КолВо,
	//	|	ЗаявкаНаБронирование.Бронирует.ВидКлиента КАК Вид
	//	|ИЗ
	//	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//	|ГДЕ
	//	|	ЗаявкаНаБронирование.Дата МЕЖДУ &ПериодС И &ПериодПо
	//	|	И ЗаявкаНаБронирование.Статус = &Статус
	//	 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Дата");
	//КонецЕсли;	
	//Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);
	//Запрос.УстановитьПараметр("ПериодС",НачалоДня(ПериодС));
	//Запрос.УстановитьПараметр("ПериодПо",КонецДня(ПериодПо));
	//Запрос.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

	//ТЗ=Запрос.Выполнить().Выгрузить();
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//Макет=ПолучитьМакет("Макет");
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//ТЗ.Колонки.Добавить("Категория");
	//ТЗ.Колонки.Добавить("ВидКлиента");
	//Для каждого СтрТЗ Из ТЗ Цикл
	//	
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	Обл.Параметры.Заполнить(СтрТЗ);
	//	Глубина=Макс(Окр((СтрТЗ.РезервС-СтрТЗ.ДатаАннуляции)/86400),0);
	//	Обл.Параметры.глубина=Глубина;
	//	Если Глубина=0 тогда
	//		СтрТЗ.Категория=0;
	//	ИначеЕсли Глубина<3 тогда 
	//		СтрТЗ.Категория=1;
	//	ИначеЕсли Глубина<5 тогда 
	//		СтрТЗ.Категория=2;
	//	ИначеЕсли Глубина<10 тогда 
	//		СтрТЗ.Категория=3;	
	//	Иначе 
	//		СтрТЗ.Категория=4;	
	//	КонецЕсли;
	//	Если СтрТЗ.Вид=Null тогда
	//		Продолжить;
	//	конецесли;
	//	
	//		
	//	Если СтрТЗ.Вид.Код="000000007" тогда
	//		СтрТЗ.ВидКлиента=1;// корп
	//	иначеесли СтрТЗ.Вид.Код="000000001" или СтрТЗ.Вид.Код="000000002" тогда
	//		СтрТЗ.ВидКлиента=2;// агент
	//	иначе
	//		СтрТЗ.ВидКлиента=0;// част
	//	КонецЕсли;
	//	
	//		
	//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//КонецЦикла; 
	//
	//ТЗ.свернуть("Категория,ВидКлиента","Колво");
	//КатТЗ=ТЗ.Скопировать();
	//КатТЗ.свернуть("Категория","Колво");
	//ВидТЗ=ТЗ.Скопировать();
	//ВидТЗ.свернуть("ВидКлиента","Колво");

	//Макет=ПолучитьМакет("Макет1");
	//Обл=Макет.ПолучитьОбласть("Статистика");
	//Обл.Параметры.Колво=ТЗ.Итог("Колво");
	//Для каждого СтрКат Из КатТЗ Цикл
	//	Обл.Параметры["Колво"+Строка(СтрКат.Категория)]=СтрКат.Колво;
	//КонецЦикла; 
	//
	//Для каждого СтрВид Из ВидТЗ Цикл
	//	Если СтрВид.ВидКлиента=1 тогда
	//		Обл.Параметры.КолВо_К=СтрВид.Колво;
	//		Для Сч=0 По 4 Цикл
	//			ПоискСтр=ТЗ.НайтиСтроки(Новый Структура("Категория,ВидКлиента",Сч,СтрВид.ВидКлиента));
	//			Обл.Параметры["КолВо_К"+Строка(Сч)]=?(ПоискСтр.Количество()=0,0,ПоискСтр[0].Колво);
	//		КонецЦикла; 
	//	иначеЕсли СтрВид.ВидКлиента=2 тогда
	//		Обл.Параметры.КолВо_А=СтрВид.Колво;
	//		Для Сч=0 По 4 Цикл
	//			ПоискСтр=ТЗ.НайтиСтроки(Новый Структура("Категория,ВидКлиента",Сч,СтрВид.ВидКлиента));
	//			Обл.Параметры["КолВо_А"+Строка(Сч)]=?(ПоискСтр.Количество()=0,0,ПоискСтр[0].Колво);
	//		КонецЦикла; 
	//	иначе
	//		Обл.Параметры.КолВо_Г=СтрВид.Колво;
	//		Для Сч=0 По 4 Цикл
	//			ПоискСтр=ТЗ.НайтиСтроки(Новый Структура("Категория,ВидКлиента",Сч,СтрВид.ВидКлиента));
	//			Обл.Параметры["КолВо_Г"+Строка(Сч)]=?(ПоискСтр.Количество()=0,0,ПоискСтр[0].Колво);
	//		КонецЦикла; 
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	//	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	////	КолВо	КолВо0	КолВо1	КолВо2	КолВо3	КолВо4
	////КолВо_К	КолВо0_К	КолВо1_К	КолВо2_К	КолВо3_К	КолВо4_К
	////КолВо_А	КолВо0_А	КолВо1_А	КолВо2_А	КолВо3_А	КолВо4_А
	////КолВо_Г	КолВо0_Г	КолВо1_Г	КолВо2_Г	КолВо3_Г	КолВо4_Г
	//
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
	Если Отчет.ВариантОтбора=0 тогда
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ЗаявкаНаБронирование.Ссылка,
		|	ЗаявкаНаБронирование.Бронирует,
		|	ЗаявкаНаБронирование.Дата КАК Дата,
		|	ЗаявкаНаБронирование.РезервС,
		|	ЗаявкаНаБронирование.ДатаАннуляции,
		|	1 КАК КолВо,
		|	ЗаявкаНаБронирование.Бронирует.ВидКлиента КАК Вид
		|ИЗ
		|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
		|ГДЕ
		|	ЗаявкаНаБронирование.ДатаАннуляции МЕЖДУ &ПериодС И &ПериодПо
		 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
		|	И ЗаявкаНаБронирование.Статус = &Статус
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата");
	ИначеЕсли Отчет.ВариантОтбора=1 тогда
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ЗаявкаНаБронирование.Ссылка,
		|	ЗаявкаНаБронирование.Бронирует,
		|	ЗаявкаНаБронирование.Дата КАК Дата,
		|	ЗаявкаНаБронирование.РезервС,
		|	ЗаявкаНаБронирование.ДатаАннуляции,
		|	1 КАК КолВо,
		|	ЗаявкаНаБронирование.Бронирует.ВидКлиента КАК Вид
		|ИЗ
		|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
		|ГДЕ
		|	ЗаявкаНаБронирование.РезервС МЕЖДУ &ПериодС И &ПериодПо
		 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
		|	И ЗаявкаНаБронирование.Статус = &Статус
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата");	
	ИначеЕсли Отчет.ВариантОтбора=2 тогда
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ЗаявкаНаБронирование.Ссылка,
		|	ЗаявкаНаБронирование.Бронирует,
		|	ЗаявкаНаБронирование.Дата КАК Дата,
		|	ЗаявкаНаБронирование.РезервС,
		|	ЗаявкаНаБронирование.ДатаАннуляции,
		|	1 КАК КолВо,
		|	ЗаявкаНаБронирование.Бронирует.ВидКлиента КАК Вид
		|ИЗ
		|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
		|ГДЕ
		|	ЗаявкаНаБронирование.Дата МЕЖДУ &ПериодС И &ПериодПо
		|	И ЗаявкаНаБронирование.Статус = &Статус
		 |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата");
	КонецЕсли;	
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);
	Запрос.УстановитьПараметр("ПериодС",НачалоДня(Отчет.ПериодС));
	Запрос.УстановитьПараметр("ПериодПо",КонецДня(Отчет.ПериодПо));
	Запрос.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));

	ТЗ=Запрос.Выполнить().Выгрузить();
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	//Макет=ПолучитьМакет("Макет");
	Макет=Отчеты.ОтчетПоОтменамБронирования.ПолучитьМакет("Макет");
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	ТЗ.Колонки.Добавить("Категория");
	ТЗ.Колонки.Добавить("ВидКлиента");
	Для каждого СтрТЗ Из ТЗ Цикл
		
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(СтрТЗ);
		Глубина=Макс(Окр((СтрТЗ.РезервС-СтрТЗ.ДатаАннуляции)/86400),0);
		Обл.Параметры.глубина=Глубина;
		Если Глубина=0 тогда
			СтрТЗ.Категория=0;
		ИначеЕсли Глубина<3 тогда 
			СтрТЗ.Категория=1;
		ИначеЕсли Глубина<5 тогда 
			СтрТЗ.Категория=2;
		ИначеЕсли Глубина<10 тогда 
			СтрТЗ.Категория=3;	
		Иначе 
			СтрТЗ.Категория=4;	
		КонецЕсли;
		Если СтрТЗ.Вид=Null тогда
			Продолжить;
		конецесли;
		
			
		Если СтрТЗ.Вид.Код="000000007" тогда
			СтрТЗ.ВидКлиента=1;// корп
		иначеесли СтрТЗ.Вид.Код="000000001" или СтрТЗ.Вид.Код="000000002" тогда
			СтрТЗ.ВидКлиента=2;// агент
		иначе
			СтрТЗ.ВидКлиента=0;// част
		КонецЕсли;
		
			
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);
	КонецЦикла;  
	
	ТЗ.свернуть("Категория,ВидКлиента","Колво");
	КатТЗ=ТЗ.Скопировать();
	КатТЗ.свернуть("Категория","Колво");
	ВидТЗ=ТЗ.Скопировать();
	ВидТЗ.свернуть("ВидКлиента","Колво");

	//Макет=ПолучитьМакет("Макет1");
	Макет = Отчеты.ОтчетПоОтменамБронирования.ПолучитьМакет("Макет1");
	
	Обл=Макет.ПолучитьОбласть("Статистика");
	Обл.Параметры.Колво=ТЗ.Итог("Колво");
	Для каждого СтрКат Из КатТЗ Цикл
		Обл.Параметры["Колво"+Строка(СтрКат.Категория)]=СтрКат.Колво;
	КонецЦикла; 
	
	Для каждого СтрВид Из ВидТЗ Цикл
		Если СтрВид.ВидКлиента=1 тогда
			Обл.Параметры.КолВо_К=СтрВид.Колво;
			Для Сч=0 По 4 Цикл
				ПоискСтр=ТЗ.НайтиСтроки(Новый Структура("Категория,ВидКлиента",Сч,СтрВид.ВидКлиента));
				Обл.Параметры["КолВо_К"+Строка(Сч)]=?(ПоискСтр.Количество()=0,0,ПоискСтр[0].Колво);
			КонецЦикла; 
		иначеЕсли СтрВид.ВидКлиента=2 тогда
			Обл.Параметры.КолВо_А=СтрВид.Колво;
			Для Сч=0 По 4 Цикл
				ПоискСтр=ТЗ.НайтиСтроки(Новый Структура("Категория,ВидКлиента",Сч,СтрВид.ВидКлиента));
				Обл.Параметры["КолВо_А"+Строка(Сч)]=?(ПоискСтр.Количество()=0,0,ПоискСтр[0].Колво);
			КонецЦикла; 
		иначе
			Обл.Параметры.КолВо_Г=СтрВид.Колво;
			Для Сч=0 По 4 Цикл
				ПоискСтр=ТЗ.НайтиСтроки(Новый Структура("Категория,ВидКлиента",Сч,СтрВид.ВидКлиента));
				Обл.Параметры["КолВо_Г"+Строка(Сч)]=?(ПоискСтр.Количество()=0,0,ПоискСтр[0].Колво);
			КонецЦикла; 
		КонецЕсли;
		
	КонецЦикла; 
		
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	//	КолВо	КолВо0	КолВо1	КолВо2	КолВо3	КолВо4
	//КолВо_К	КолВо0_К	КолВо1_К	КолВо2_К	КолВо3_К	КолВо4_К
	//КолВо_А	КолВо0_А	КолВо1_А	КолВо2_А	КолВо3_А	КолВо4_А
	//КолВо_Г	КолВо0_Г	КолВо1_Г	КолВо2_Г	КолВо3_Г	КолВо4_Г
	
КонецПроцедуры

