//// + Проведение

//
Процедура ОбработкаПроведения(Отказ, Режим)
Отказ=Не ПроверкаЗаполнения();
Если Отказ Тогда Возврат; КонецЕсли;

Если ЛистОжидания тогда Возврат; КонецЕсли;

Если Статус=Перечисления.СтатусБрони.ОтменаБронирования тогда Возврат; КонецЕсли;
Если Статус=Перечисления.СтатусБрони.ОтказОтБронирования тогда Возврат; КонецЕсли;

Ответ = ДокументыСервер.ЗанятостьНомераПроверить(РезервС, РезервПо, ВремяЗаезда, ВремяВыезда, НомерВРезерв, БонШанс, Неопределено); 
Если Ответ.Результат Тогда 
	Сообщить("Номер занят. " + Ответ.Регистратор + ". ЗАПИСЬ ОТМЕНЯЕТСЯ.");
	Отказ = Истина;
	Возврат;
КонецЕсли;

ЗаявкаСервер.ОбновитьИсториюКлиента(ЭтотОбъект);

//Если БонШанс Тогда
Если РезервС = РезервПо Тогда
	ТемпС = Ответ.НачалоПериодаРезерва;
	ТемпПо = Ответ.КонецПериодаРезерва;
	Если ТемпПо = НачалоДня(ТемпС) Тогда
		ТемпПо = НачалоДня(РезервС) + 3600 * 24;
	КонецЕсли;
	
	Если ТемпПо < ТемпС Тогда
		//ТемпС = НачалоДня(РезервС) + 3600 * 12;
		ТемпС = НачалоДня(РезервС) + 3600 * 13;
		//ТемпПо = НачалоДня(РезервС) + 3600 * 14;
		ТемпПо = НачалоДня(РезервС) + 3600 * 18;
	КонецЕсли;
Иначе	
	ТемпС = Ответ.НачалоПериодаРезерва;
	ТемпПо = Ответ.КонецПериодаРезерва;
КонецЕсли;	
ТемпПо = ТемпПо - 1;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗанятостьНомеров.ПериодРезерва КАК ПериодРезерва,
                      |	ЗанятостьНомеров.Номер_пп КАК Номер_пп
                      |ИЗ
                      |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                      |ГДЕ
                      |	ЗанятостьНомеров.Номер = &Номер
                      |	И ЗанятостьНомеров.Клиент = &Клиент
                      |	И ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
                      |	И ЗанятостьНомеров.БонШанс = &БонШанс");

Запрос.УстановитьПараметр("Номер", НомерВРезерв); 
Запрос.УстановитьПараметр("Клиент", Клиент); 
Запрос.УстановитьПараметр("ДатаС", ТемпС); 
Запрос.УстановитьПараметр("ДатаПо", ТемпПо); 
Запрос.УстановитьПараметр("БонШанс", БонШанс); 

ТЗ = Запрос.Выполнить().Выгрузить();

Пока ТемпС < ТемпПо цикл
	Движение = Движения.ЗанятостьНомеров.Добавить();
	Движение.Номер = НомерВРезерв;
	Движение.Клиент = Клиент;
	Движение.ПериодРезерва = ТемпС;
	Движение.Зарезервирован = Истина;

	Движение.БонШанс = БонШанс;
	
	НайденнаяСтрока = ТЗ.Найти(ТемпС, "ПериодРезерва");
	Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда 
		Движение.Номер_пп = НайденнаяСтрока.Номер_пп + 1;
	КонецЕсли;
	
	ТемпС=ТемпС+3600;
КонецЦикла;

Для Каждого Счет Из Счета Цикл
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	
	Движение.Период = РезервС;
	
	Движение.Контрагент = Счет.Контрагент;
	
	ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
	ТЗ = СчетаДетальноДолги.Выгрузить(ОтборСтроки, "СуммаДолг");
	СуммаДолг = ТЗ.Итог("СуммаДолг");
	
	Движение.Сумма = СуммаДолг; 
КонецЦикла;	

Возврат;


// ДОЛГИ
//Если КлиентыСервер.ЭтоЮрЛицо(Оплачивает) Тогда
//	НеПервый = Ложь;
//	СуммаПроживание = ПолучитьПроживаниеИтого(Оплачивает, НеПервый);
//	ДобавитьДвиженияДолг(Оплачивает, СуммаПроживание);
//	
//	// Первый Клиент
//	СуммаУслуги = ПолучитьУслугиИтого(НеПервый);
//	ДобавитьДвиженияДолг(Клиент, СуммаУслуги);
//	
//	Если РазделитьСчет и ЗначениеЗаполнено(Клиент2) Тогда
//		// Второй Клиент
//		НеПервый = Истина;
//		СуммаУслуги = ПолучитьУслугиИтого(НеПервый);
//		ДобавитьДвиженияДолг(Клиент2, СуммаУслуги);
//	КонецЕсли;
//	
//Иначе
//	Если РазделитьСчет и ЗначениеЗаполнено(Клиент2) Тогда
//		// Первый Клиент
//		НеПервый = Ложь;
//		СуммаПроживание = ПолучитьПроживаниеИтого(Клиент, НеПервый);
//		ДобавитьДвиженияДолг(Клиент, СуммаПроживание);
//		
//		СуммаУслуги = ПолучитьУслугиИтого(НеПервый);
//		ДобавитьДвиженияДолг(Клиент, СуммаУслуги);
//		
//		// Второй Клиент   
//		НеПервый = Истина;
//		СуммаПроживание = ПолучитьПроживаниеИтого(Клиент2, НеПервый);
//		ДобавитьДвиженияДолг(Клиент2, СуммаПроживание);
//		
//		СуммаУслуги = ПолучитьУслугиИтого(НеПервый);
//		ДобавитьДвиженияДолг(Клиент2, СуммаУслуги);
//	Иначе
//		НеПервый = Ложь;
//		СуммаПроживание = ПолучитьПроживаниеИтого(Клиент, НеПервый);
//		ДобавитьДвиженияДолг(Клиент, СуммаПроживание);
//		
//		СуммаУслуги = ПолучитьУслугиИтого(НеПервый);
//		ДобавитьДвиженияДолг(Клиент, СуммаУслуги);
//	КонецЕсли;
//КонецЕсли;					
	
КонецПроцедуры

// + ПроверкаЗаполнения
Функция ПроверкаЗаполнения()
ТекстСообщения = ДокументыСервер.ПроверкаЗаполненияЗаявкаНабронированиеТекстСообщения(ЭтотОбъект, " ");
Если ТекстСообщения <> "" Тогда
	ТекстСообщения = ТекстСообщения + "ЗАПИСЬ ОТМЕНЯЕТСЯ."; 

	Сообщить(ТекстСообщения);
	Возврат Ложь;
КонецЕсли;	

Возврат Истина;	
КонецФункции
// - ПроверкаЗаполнения
//// - Проведение 

//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
МассивКУдалению = Новый Массив;	
Для Каждого Счет Из Счета Цикл
	СчетГУИД = Счет.СчетГУИД;
	
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);	
	СчетаДетальноДолги_П = СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
	Если СчетаДетальноДолги_П.Количество() = 0 Тогда 
		ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, СчетаДетальноСтроки); 
		МассивКУдалению.Добавить(Счет);

		Продолжить;
	КонецЕсли;
	
	ЗаявкаСервер.ОбновитьСчетаСтроки(СчетаДетальноСтроки, Счета
		, СчетаДетальноДолги, РаспределениеОплатДолги,СчетГУИД);	
	
	Счет.Закрыт = ЗаявкаСервер.СчетЗакрытСчетаДетальноДолги(СчетаДетальноДолги_П);   
КонецЦикла;	

Для Каждого Строка Из МассивКУдалению Цикл
	Счета.Удалить(Строка);
КонецЦикла;

ДатаИзменения = ТекущаяДата();

Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
	 ДатаСоздания = ТекущаяДата();
КонецЕсли;
КонецПроцедуры
//

//
Процедура ПередУдалением___(Отказ)
	//Если НЕ ТекПол.Админ тогда
	//	Сообщить("Удаление документов запрещено");
	//	Отказ=Истина;
	//	//иначеесли ВремяЗаездаТочное>Дата(1, 1, 1) тогда
	//	//	Сообщить("Удаление старых документов запрещено");
	//	//	Отказ=Истина;
	//	
	//конецесли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
ТекПол = ПараметрыСеанса.ТекущийПользователь;

Если НЕ ТекПол.Админ тогда
	Сообщить("Удаление документов запрещено");
	Отказ=Истина;
	
	////иначеесли ВремяЗаездаТочное>Дата(1, 1, 1) тогда
	////	Сообщить("Удаление старых документов запрещено");
	////	Отказ=Истина;
	
	Возврат;
конецесли;

УдалитьДанныеДокумента();

// + Аудит
//ЗаявкаСервер.УдалитьИсториюКлиента(ЭтотОбъект);  
// - Аудит
КонецПроцедуры

Процедура УдалитьДанныеДокумента()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ДокументДолг = &ДокументДолг");
Запрос.УстановитьПараметр("ДокументДолг", Ссылка);
ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	КассовыйДокументОбъект = Строка.Ссылка.ПолучитьОбъект();
	КассовыйДокументОбъект.ДокументДолг = Неопределено;
	КассовыйДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |ГДЕ
                      |	ВыпискаБанкаДолгиОплата.ДокументДолг = &ДокументДолг
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Ссылка,
                      |	ДокументДолг");

Запрос.УстановитьПараметр("ДокументДолг", Ссылка);
ТЗ = Запрос.Выполнить().Выгрузить();
ТЗ.Свернуть("Ссылка");

ОтборСтроки = Новый Структура("ДокументДолг", Ссылка);
Для Каждого Строка Из ТЗ Цикл
	ВыпискаБанкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, ВыпискаБанкаОбъект.ДолгиОплата); 
КонецЦикла;

ЗаявкаСервер.УдалитьИсториюКлиента(ЭтотОбъект);  
КонецПроцедуры

//


Процедура ПриКопировании(ОбъектКопирования)
//ЭтотОбъект.ВремяВыезда = Неопределено;    

ЭтотОбъект.ВремяВыездаТочное = Неопределено;    
ЭтотОбъект.ВремяЗаездаТочное = Неопределено;

ЭтотОбъект.КатегорияНомера = Неопределено;
ЭтотОбъект.КолВоДней = Неопределено;

ЭтотОбъект.Курящий = Неопределено;
ЭтотОбъект.НомерВРезерв = Неопределено;
ЭтотОбъект.НомерЧека = Неопределено;
ЭтотОбъект.Оплачено = Неопределено;

ЭтотОбъект.Статус = Перечисления.СтатусБрони.Бронь;

ЭтотОбъект.Сумма = Неопределено;

// + Движения
ЭтотОбъект.Движения.ЗанятостьНомеров.Очистить();

ЭтотОбъект.Движения.Долги.Очистить();

ЭтотОбъект.Движения.ОстаткиПродукции.Очистить();
ЭтотОбъект.Движения.ПродажиТоваров.Очистить();

// - Движения

// + Табличные Части
ЭтотОбъект.Дни.Очистить();

ЭтотОбъект.Проживание.Очистить();;
ЭтотОбъект.ДопУслуги.Очистить();
ЭтотОбъект.РаспределениеОплатДолги.Очистить();
ЭтотОбъект.СМС.Очистить();
ЭтотОбъект.Счета.Очистить();
ЭтотОбъект.СчетаДетальноДолги.Очистить();
ЭтотОбъект.СчетаДетальноОплаты.Очистить();
ЭтотОбъект.СчетаДетальноСтроки.Очистить();
//ЭтотОбъект.ТаблицаЧекаККМ.Очистить();

ЭтотОбъект.ДопПожелания.Очистить();
ЭтотОбъект.ЗабытыеВещи.Очистить();
// - Табличные Части

КонецПроцедуры

////// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 

Процедура ОбновитьИсториюКлиента(ЭтотОбъект) 
	
КонецПроцедуры	

//
Функция ПолучитьПроживаниеИтого(Контрагент, НеПервый) 
ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Контрагент);
ЕстьКлиент2 = ЗначениеЗаполнено(Клиент2);

СуммаПроживание = 0;
Строка = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("ЗаявкаНаБронирование", "Проживание");
Для Каждого СтрокаИсходный Из Проживание Цикл
	ЗаполнитьЗначенияСвойств(Строка, СтрокаИсходный); 
	ЗаявкаСервер.УстановитьЦенаСуммаДляРазделитьСчет(Строка, РазделитьСчет, ЮрЛицо, ЕстьКлиент2, НеПервый);     
	
	СуммаПроживание = СуммаПроживание + Строка.Сумма;	
КонецЦикла;	

Возврат СуммаПроживание;
КонецФункции	

Функция ПолучитьУслугиИтого(НеПервый)  
СуммаУслуги = 0;
Для Каждого Строка Из ДопУслуги Цикл
	Если НЕ Строка.ВСчет Тогда Продолжить; КонецЕсли;

	Если РазделитьСчет И ЗначениеЗаполнено(Клиент2) Тогда 
		Если НЕ (Строка.НеПервый = НеПервый) Тогда Продолжить; КонецЕсли;
	КонецЕсли;
	
	СуммаУслуги = СуммаУслуги + Строка.Количество * Строка.Цена;
КонецЦикла;	
Возврат СуммаУслуги;
КонецФункции	

Процедура ДобавитьДвиженияДолг(Контрагент, Сумма)
Если Сумма= 0 Тогда Возврат; КонецЕсли;
	
Движение = Движения.Долги.Добавить();

Движение.Период = Дата;

Движение.ВидДвижения = ВидДвиженияНакопления.Приход;

Движение.ДокументДолг = Ссылка;
Движение.Контрагент = Контрагент;

Движение.Сумма = Сумма;
КонецПроцедуры	
//


////// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++






