

Процедура ПриОткрытии___()
	//ДатаС = НачалоМесяца(ТекущаяДата());
	//ДатаПо = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаС = НачалоМесяца(ТекущаяДата());
	ДатаПо = КонецМесяца(ТекущаяДата());
КонецПроцедуры



Процедура КнопкаВыполнитьНажатие__(Кнопка)
	//
	//ЭлементыФормы.ТаблицаВывод.Очистить();
	//
	//Тз = Новый ТаблицаЗначений;
	//м= Новый Массив;
	//м.Добавить(Тип("Дата"));
	//Тз = Новый ТаблицаЗначений;
	//тз.Колонки.Добавить("День", Новый ОписаниеТипов(м,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	////Переберем все даты за период 
	//ТекДат = НачалоДня(ДатаС);
	//Пока ТекДат <= НачалоДня(ДатаПо) Цикл 
	//	//Состояние(ТекДат);
	//	//Добавим текущую дату в таблицу периодов
	//	НовСтр = Тз.Добавить();
	//	НовСтр.День = ТекДат;
	//	
	//	ТекДат = ТекДат+86400;//Добавим 1 День
	//КонецЦикла;
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗанятостьНомеров.ПериодРезерва, ЧАС, -13), ДЕНЬ) КАК ЗанятыйДень,
	//                      |	ЗанятостьНомеров.Регистратор,
	//                      |	ЗанятостьНомеров.Номер КАК Номер,
	//                      |	ЗанятостьНомеров.ПериодРезерва,
	//                      |	ЗанятостьНомеров.Регистратор.Дата
	//                      |ПОМЕСТИТЬ ВТ_Бронь
	//                      |ИЗ
	//                      |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//                      |ГДЕ
	//                      |	ЗанятостьНомеров.ПериодРезерва >= &ПериодНачало
	//                      |	И ЗанятостьНомеров.ПериодРезерва <= &ПериодКонец
	//                      |	И ЧАС(ЗанятостьНомеров.ПериодРезерва) <> ЧАС(ДАТАВРЕМЯ(1, 1, 1, 12, 0, 0))
	//                      |	И ЗанятостьНомеров.Номер <> &Номер
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК ОбщееКоличество,
	//                      |	НомернойФонд.КатегорияНомера
	//                      |ПОМЕСТИТЬ ВТ_КоличествоНомеров
	//                      |ИЗ
	//                      |	Справочник.НомернойФонд КАК НомернойФонд
	//                      |ГДЕ
	//                      |	НЕ НомернойФонд.ПометкаУдаления
	//                      |	И НомернойФонд.Ссылка <> &Номер
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	НомернойФонд.КатегорияНомера
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоЗанятых,
	//                      |	ВТ_Бронь.ЗанятыйДень КАК ЗанятыйДень,
	//                      |	НомернойФонд.КатегорияНомера,
	//                      |	СРЕДНЕЕ(РАЗНОСТЬДАТ(ВТ_Бронь.РегистраторДата, ВТ_Бронь.ПериодРезерва, ДЕНЬ)) КАК ГлубинаБрони
	//                      |ПОМЕСТИТЬ ВТ_Номера
	//                      |ИЗ
	//                      |	Справочник.НомернойФонд КАК НомернойФонд
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Бронь КАК ВТ_Бронь
	//                      |		ПО (ВТ_Бронь.Номер = НомернойФонд.Ссылка)
	//                      |ГДЕ
	//                      |	НЕ НомернойФонд.ПометкаУдаления
	//                      |	И НЕ ВТ_Бронь.ЗанятыйДень = 0
	//                      |	И НомернойФонд.Ссылка <> &Номер
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ВТ_Бронь.ЗанятыйДень,
	//                      |	НомернойФонд.КатегорияНомера
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ТабДата.День
	//                      |ПОМЕСТИТЬ ВТ_Дни
	//                      |ИЗ
	//                      |	&ТабДата КАК ТабДата
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ВТ_Дни.День,
	//                      |	МАКСИМУМ(ВТ_КоличествоНомеров.ОбщееКоличество) КАК ОбщееКоличество,
	//                      |	ВТ_КоличествоНомеров.КатегорияНомера
	//                      |ПОМЕСТИТЬ ВТ_ДниС
	//                      |ИЗ
	//                      |	ВТ_Дни КАК ВТ_Дни,
	//                      |	ВТ_КоличествоНомеров КАК ВТ_КоличествоНомеров
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ВТ_КоличествоНомеров.КатегорияНомера,
	//                      |	ВТ_Дни.День
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ЕСТЬNULL(ВТ_Номера.КоличествоЗанятых, 0) КАК ЗанятыеНомера,
	//                      |	ВТ_ДниС.День КАК ПериодДень,
	//                      |	ВТ_ДниС.ОбщееКоличество КАК ОбщееКоличество,
	//                      |	ВТ_ДниС.КатегорияНомера КАК КатегорияНомера,
	//                      |	ВТ_ДниС.КатегорияНомера.Наименование КАК Наименование,
	//                      |	ВТ_ДниС.ОбщееКоличество - ЕСТЬNULL(ВТ_Номера.КоличествоЗанятых, 0) КАК СвободныеНомера,
	//                      |	ВТ_Номера.ГлубинаБрони КАК ГлубинаБрони
	//                      |ИЗ
	//                      |	ВТ_ДниС КАК ВТ_ДниС
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номера КАК ВТ_Номера
	//                      |		ПО ВТ_ДниС.День = ВТ_Номера.ЗанятыйДень
	//                      |			И ВТ_ДниС.КатегорияНомера = ВТ_Номера.КатегорияНомера
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	ПериодДень,
	//                      |	КатегорияНомера
	//                      |ИТОГИ
	//                      |	СУММА(ЗанятыеНомера),
	//                      |	СУММА(ОбщееКоличество),
	//                      |	СРЕДНЕЕ(ГлубинаБрони)
	//                      |ПО
	//                      |	ПериодДень");
	//	Запрос.УстановитьПараметр("ТабДата", ТЗ);
	//	Запрос.УстановитьПараметр("ПериодНачало",ДатаС);
	//	Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ДатаПо));
	//	Запрос.УстановитьПараметр("Номер", Справочники.НомернойФонд.НайтиПоНаименованию("Переговорная", Истина));

	//	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	
	//	Макет = ПолучитьМакет("Макет");
	//	ТабДок = Новый ТабличныйДокумент;
	//	
	//	ПервыйПроход = Истина;
	//	Пока Выборка.Следующий() Цикл
	//		ВыборкаДва = Выборка.Выбрать();
	//		Если ПервыйПроход Тогда
	//			ТабДокЗаголовки = Новый ТабличныйДокумент;
	//			ЗаголовкиОтступ = Макет.ПолучитьОбласть("Заголовки|Отступ");
	//			ЗаголовкиОтступ.Параметры.ДатаПо = Формат(ДатаПо,"ДФ=dd.MM.yyyy");
	//			ЗаголовкиОтступ.Параметры.ДатаС = Формат(ДатаС,"ДФ=dd.MM.yyyy");
	//			ТабДокЗаголовки.Вывести(ЗаголовкиОтступ);
	//					
	//			ГруппаКатегории = Новый ТабличныйДокумент;
	//			
	//			ЗаголовкиКатегории = Макет.ПолучитьОбласть("Заголовки|Категории");
	//			Пока ВыборкаДва.Следующий() Цикл
	//				ЗаголовкиКатегории.Параметры.Категория = ВыборкаДва.Наименование;
	//				ЗаголовкиКатегории.Параметры.ВсегоНомеров = ВыборкаДва.ОбщееКоличество;
	//				ГруппаКатегории.Вывести(ЗаголовкиКатегории);
	//			КонецЦикла;
	//			ТабДокЗаголовки.Вывести(ГруппаКатегории);
	//			
	//			ЗаголовкиПодвал = Макет.ПолучитьОбласть("Заголовки|Подвал");
	//			ТабДокЗаголовки.Вывести(ЗаголовкиПодвал);
	//			
	//			ТабДок.Присоединить(ТабДокЗаголовки);
	//			
	//			ПервыйПроход = Ложь;
	//		КонецЕсли;
	//		
	//		ТабДокДата = Новый ТабличныйДокумент;
	//		
	//		ДатаШапка = макет.ПолучитьОбласть("Дата|Отступ");
	//		ДатаШапка.Параметры.Дата = Формат(Выборка.ПериодДень,"ДФ=dd.MM.yyyy");
	//		ТабДокДата.Вывести(ДатаШапка);
	//		
	//		
	//		
	//		ВыборкаДва.Сбросить();
	//		Пока ВыборкаДва.Следующий() Цикл
	//			ДатаКатегории = Макет.ПолучитьОбласть("Дата|Категории");
	//			ДатаКатегории.Параметры.КоличествоЗабронированных = ВыборкаДва.ЗанятыеНомера;
	//			ДатаКатегории.Параметры.КоличествоСвободных = ВыборкаДва.СвободныеНомера;
	//			ТабДокДата.Вывести(ДатаКатегории);
	//		КонецЦикла;
	//		
	//		ДатаПодвал = Макет.ПолучитьОбласть("Дата|Подвал");
	//		ДатаПодвал.Параметры.ИтогСвободных = Выборка.ОбщееКоличество - Выборка.ЗанятыеНомера;
	//		ДатаПодвал.Параметры.ЗагрузкаПроцент = Формат(?(Выборка.ЗанятыеНомера = 0, "-", 100/(Выборка.ОбщееКоличество/Выборка.ЗанятыеНомера)),"ЧДЦ=2");
	//		ДатаПодвал.Параметры.Глубина = Формат(?(Выборка.ГлубинаБрони = 0, "-", Выборка.ГлубинаБрони), "ЧДЦ=2");
	//		ТабДокДата.Вывести(ДатаПодвал);
	//		
	//		ТабДок.Присоединить(ТабДокДата);
	//		
	//	КонецЦикла;
	//	ТабДок.ОтображатьСетку = ложь;
	//ЭлементыФормы.ТаблицаВывод.Вывести(ТабДок);	
	//	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
	
	//ЭлементыФормы.ТаблицаВывод.Очистить();
	ТаблицаВывод.Очистить();
	
	Тз = Новый ТаблицаЗначений;
	м= Новый Массив;
	м.Добавить(Тип("Дата"));
	Тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("День", Новый ОписаниеТипов(м,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	//Переберем все даты за период 
	ТекДат = НачалоДня(ДатаС);
	Пока ТекДат <= НачалоДня(ДатаПо) Цикл 
		//Состояние(ТекДат);
		//Добавим текущую дату в таблицу периодов
		НовСтр = Тз.Добавить();
		НовСтр.День = ТекДат;
		
		ТекДат = ТекДат + 86400; //Добавим 1 День
	КонецЦикла;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗанятостьНомеров.ПериодРезерва, ЧАС, -13), ДЕНЬ) КАК ЗанятыйДень,
	                      |	ЗанятостьНомеров.Регистратор КАК Регистратор,
	                      |	ЗанятостьНомеров.Номер КАК Номер,
	                      |	ЗанятостьНомеров.ПериодРезерва КАК ПериодРезерва,
	                      |	ЗанятостьНомеров.Регистратор.Дата КАК РегистраторДата
	                      |ПОМЕСТИТЬ ВТ_Бронь
	                      |ИЗ
	                      |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                      |ГДЕ
	                      |	ЗанятостьНомеров.ПериодРезерва >= &ПериодНачало
	                      |	И ЗанятостьНомеров.ПериодРезерва <= &ПериодКонец
	                      |	И ЧАС(ЗанятостьНомеров.ПериодРезерва) <> ЧАС(ДАТАВРЕМЯ(1, 1, 1, 12, 0, 0))
	                      |	И ЗанятостьНомеров.Номер <> &Номер
	                      |	И ЗанятостьНомеров.Регистратор.ТипБронирования <> &ТипБронирования
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК ОбщееКоличество,
	                      |	НомернойФонд.КатегорияНомера КАК КатегорияНомера
	                      |ПОМЕСТИТЬ ВТ_КоличествоНомеров
	                      |ИЗ
	                      |	Справочник.НомернойФонд КАК НомернойФонд
	                      |ГДЕ
	                      |	НЕ НомернойФонд.ПометкаУдаления
	                      |	И НомернойФонд.Ссылка <> &Номер
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	НомернойФонд.КатегорияНомера
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоЗанятых,
	                      |	ВТ_Бронь.ЗанятыйДень КАК ЗанятыйДень,
	                      |	НомернойФонд.КатегорияНомера КАК КатегорияНомера,
	                      |	СРЕДНЕЕ(РАЗНОСТЬДАТ(ВТ_Бронь.РегистраторДата, ВТ_Бронь.ПериодРезерва, ДЕНЬ)) КАК ГлубинаБрони
	                      |ПОМЕСТИТЬ ВТ_Номера
	                      |ИЗ
	                      |	Справочник.НомернойФонд КАК НомернойФонд
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Бронь КАК ВТ_Бронь
	                      |		ПО (ВТ_Бронь.Номер = НомернойФонд.Ссылка)
	                      |ГДЕ
	                      |	НЕ НомернойФонд.ПометкаУдаления
	                      |	И НЕ ВТ_Бронь.ЗанятыйДень = 0
	                      |	И НомернойФонд.Ссылка <> &Номер
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_Бронь.ЗанятыйДень,
	                      |	НомернойФонд.КатегорияНомера
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТабДата.День КАК День
	                      |ПОМЕСТИТЬ ВТ_Дни
	                      |ИЗ
	                      |	&ТабДата КАК ТабДата
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Дни.День КАК День,
	                      |	МАКСИМУМ(ВТ_КоличествоНомеров.ОбщееКоличество) КАК ОбщееКоличество,
	                      |	ВТ_КоличествоНомеров.КатегорияНомера КАК КатегорияНомера
	                      |ПОМЕСТИТЬ ВТ_ДниС
	                      |ИЗ
	                      |	ВТ_Дни КАК ВТ_Дни,
	                      |	ВТ_КоличествоНомеров КАК ВТ_КоличествоНомеров
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_КоличествоНомеров.КатегорияНомера,
	                      |	ВТ_Дни.День
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(ВТ_Номера.КоличествоЗанятых, 0) КАК ЗанятыеНомера,
	                      |	ВТ_ДниС.День КАК ПериодДень,
	                      |	ВТ_ДниС.ОбщееКоличество КАК ОбщееКоличество,
	                      |	ВТ_ДниС.КатегорияНомера КАК КатегорияНомера,
	                      |	ВТ_ДниС.КатегорияНомера.Наименование КАК Наименование,
	                      |	ВТ_ДниС.ОбщееКоличество - ЕСТЬNULL(ВТ_Номера.КоличествоЗанятых, 0) КАК СвободныеНомера,
	                      |	ВТ_Номера.ГлубинаБрони КАК ГлубинаБрони
	                      |ИЗ
	                      |	ВТ_ДниС КАК ВТ_ДниС
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номера КАК ВТ_Номера
	                      |		ПО ВТ_ДниС.День = ВТ_Номера.ЗанятыйДень
	                      |			И ВТ_ДниС.КатегорияНомера = ВТ_Номера.КатегорияНомера
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПериодДень,
	                      |	КатегорияНомера
	                      |ИТОГИ
	                      |	СУММА(ЗанятыеНомера),
	                      |	СУММА(ОбщееКоличество),
	                      |	СРЕДНЕЕ(ГлубинаБрони)
	                      |ПО
	                      |	ПериодДень
						  |");
		Запрос.УстановитьПараметр("ТабДата", ТЗ);
		Запрос.УстановитьПараметр("ПериодНачало",ДатаС);
		Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ДатаПо));
		Запрос.УстановитьПараметр("Номер", Справочники.НомернойФонд.НайтиПоНаименованию("Переговорная", Истина));
		Запрос.УстановитьПараметр("ТипБронирования",Справочники.ТипБронирования.Ремонт);

		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//Макет = ПолучитьМакет("Макет");
		Макет = Обработки.ОтчетПоЗагрузкеНомеров.ПолучитьМакет("Макет");
		
		ТабДок = Новый ТабличныйДокумент;
		
		ПервыйПроход = Истина;
		Пока Выборка.Следующий() Цикл
			ВыборкаДва = Выборка.Выбрать();
			Если ПервыйПроход Тогда
				ТабДокЗаголовки = Новый ТабличныйДокумент;
				ЗаголовкиОтступ = Макет.ПолучитьОбласть("Заголовки|Отступ");
				ЗаголовкиОтступ.Параметры.ДатаПо = Формат(ДатаПо,"ДФ=dd.MM.yyyy");
				ЗаголовкиОтступ.Параметры.ДатаС = Формат(ДатаС,"ДФ=dd.MM.yyyy");
				ТабДокЗаголовки.Вывести(ЗаголовкиОтступ);
						
				ГруппаКатегории = Новый ТабличныйДокумент;
				
				ЗаголовкиКатегории = Макет.ПолучитьОбласть("Заголовки|Категории");
				Пока ВыборкаДва.Следующий() Цикл
					ЗаголовкиКатегории.Параметры.Категория = ВыборкаДва.Наименование;
					ЗаголовкиКатегории.Параметры.ВсегоНомеров = ВыборкаДва.ОбщееКоличество;
					ГруппаКатегории.Вывести(ЗаголовкиКатегории);
				КонецЦикла;
				ТабДокЗаголовки.Вывести(ГруппаКатегории);
				
				ЗаголовкиПодвал = Макет.ПолучитьОбласть("Заголовки|Подвал");
				ТабДокЗаголовки.Вывести(ЗаголовкиПодвал);
				
				ТабДок.Присоединить(ТабДокЗаголовки);
				
				ПервыйПроход = Ложь;
			КонецЕсли;
			
			ТабДокДата = Новый ТабличныйДокумент;
			
			ДатаШапка = макет.ПолучитьОбласть("Дата|Отступ");
			ДатаШапка.Параметры.Дата = Формат(Выборка.ПериодДень,"ДФ=dd.MM.yyyy");
			ТабДокДата.Вывести(ДатаШапка);
			
			
			
			ВыборкаДва.Сбросить();
			Пока ВыборкаДва.Следующий() Цикл
				ДатаКатегории = Макет.ПолучитьОбласть("Дата|Категории");
				ДатаКатегории.Параметры.КоличествоЗабронированных = ВыборкаДва.ЗанятыеНомера;
				ДатаКатегории.Параметры.КоличествоСвободных = ВыборкаДва.СвободныеНомера;
				ТабДокДата.Вывести(ДатаКатегории);
			КонецЦикла;
			
			ДатаПодвал = Макет.ПолучитьОбласть("Дата|Подвал");
			ДатаПодвал.Параметры.ИтогСвободных = Выборка.ОбщееКоличество - Выборка.ЗанятыеНомера;
			ДатаПодвал.Параметры.ЗагрузкаПроцент = Формат(?(Выборка.ЗанятыеНомера = 0, "-", 100/(Выборка.ОбщееКоличество/Выборка.ЗанятыеНомера)),"ЧДЦ=2");
			ДатаПодвал.Параметры.Глубина = Формат(?(Выборка.ГлубинаБрони = 0, "-", Выборка.ГлубинаБрони), "ЧДЦ=2");
			ТабДокДата.Вывести(ДатаПодвал);
			
			ТабДок.Присоединить(ТабДокДата);
			
		КонецЦикла;
		ТабДок.ОтображатьСетку = ложь;
		
	//ЭлементыФормы.ТаблицаВывод.Вывести(ТабДок);	
	ТаблицаВывод.Вывести(ТабДок);	
		
КонецПроцедуры



