
Функция ТекстПредупрежденияИзМассив(Массив) Экспорт
ТекстПредупрежеднияИзМассив = "";
Для Каждого Элемент Из Массив Цикл
	ТекстПредупрежеднияИзМассив = ТекстПредупрежеднияИзМассив + Элемент + Символы.ПС;	
КонецЦикла;
Если ТекстПредупрежеднияИзМассив <> "" Тогда 
	ТекстПредупрежеднияИзМассив = Лев(ТекстПредупрежеднияИзМассив, СтрДлина(ТекстПредупрежеднияИзМассив) - 1); 
КонецЕсли;

Возврат ТекстПредупрежеднияИзМассив; 
КонецФункции

Процедура ЗащититьФорму(Форма) Экспорт
Форма.ТолькоПросмотр = Истина;

Для каждого ЭФ Из Форма.Элементы Цикл
	Если ТипЗнч(ЭФ) = Тип("КнопкаФормы")
	//ИЛИ ТипЗнч(ЭФ) = Тип("ПолеФормы") 
	Тогда
		ЭФ.Доступность=Ложь;			
	КонецЕсли;		
КонецЦикла;
Конецпроцедуры	



//// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Функция ЭтаФормаПровести_НеИспользуется(Форма) Экспорт
ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);	
Форма.Записать(ПараметрыЗаписи);	
КонецФункции

