
Процедура ОбновитьЗначениеХодаВыполнения(ЗначениеХодаВыполнения) Экспорт
	
	Перем СообщениеПользователю;
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ЗначениеВСтрокуВнутр(ЗначениеХодаВыполнения);
	СообщениеПользователю.Поле = "АсинхронныйВызов.ЗначениеХодаВыполнения";
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры

Процедура ДобавитьСообщениеХодаВыполнения(Сообщение) Экспорт
	
	Перем СообщениеПользователю;
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ЗначениеВСтрокуВнутр(Сообщение);
	СообщениеПользователю.Поле = "АсинхронныйВызов.СообщениеХодаВыполнения";
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры

Функция ВызватьФункциюИлиПроцедуру(ИмяФункцииИлиПроцедуры, ЭтоФункция, Параметры) Экспорт
	
	Перем ПараметрыФЗ, НаименованиеФоновогоЗадания, ФЗ, ИдентификаторВызова;
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(ИмяФункцииИлиПроцедуры);
	ПараметрыФЗ.Добавить(ЭтоФункция);
	ПараметрыФЗ.Добавить(Параметры);
	НаименованиеФоновогоЗадания = "Асинхронный вызов " + ?(ЭтоФункция, "функции", "процедуры") + " " + ИмяФункцииИлиПроцедуры;
	ФЗ = ФоновыеЗадания.Выполнить("АсинхронныеВызовыСервер.ВызватьФункциюИлиПроцедуруФЗ", ПараметрыФЗ, ,НаименованиеФоновогоЗадания);
	ИдентификаторВызова = ФЗ.УникальныйИдентификатор;
	Возврат ИдентификаторВызова;
	
КонецФункции

Процедура ВызватьФункциюИлиПроцедуруФЗ(ИмяФункцииИлиПроцедуры, ЭтоФункция, Параметры) Экспорт
	
	Перем СтрокаНаВыполнение, ИндексПараметра, ВозвращенноеЗначение, СообщениеПользователю;   
	
	СтрокаНаВыполнение = "";
	Если ЭтоФункция Тогда
		СтрокаНаВыполнение = "ВозвращенноеЗначение = ";
	КонецЕсли;
	СтрокаНаВыполнение = СтрокаНаВыполнение + ИмяФункцииИлиПроцедуры + "(";
	Для ИндексПараметра = 0 По Параметры.Количество() - 2 Цикл
		СтрокаНаВыполнение = СтрокаНаВыполнение + "Параметры[" + ИндексПараметра + "], "	
	КонецЦикла;
	Если Параметры.Количество() > 0 Тогда
		СтрокаНаВыполнение = СтрокаНаВыполнение + "Параметры[" + (Параметры.Количество()-1) + "]"			
	КонецЕсли;
	СтрокаНаВыполнение = СтрокаНаВыполнение +  ");";
	
	ВозвращенноеЗначение = Неопределено;
	Выполнить(СтрокаНаВыполнение);
	
	Если ЭтоФункция Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ЗначениеВСтрокуВнутр(ВозвращенноеЗначение);
		СообщениеПользователю.Поле = "АсинхронныйВызов.ВозвращенноеЗначение"; 
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура Отменить(ИдентификаторыВызовов) Экспорт
	
	Перем ФоновоеЗадание, ТекущийИдентификаторВызова;
	
	Для Каждого ТекущийИдентификаторВызова Из ИдентификаторыВызовов Цикл
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ТекущийИдентификаторВызова);
		ФоновоеЗадание.Отменить();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСостоянияВызовов(ИдентификаторыВызовов) Экспорт
	
	Перем СостоянияВызовов, ТекущийИдентификаторВызова, СостояниеВызова, ФоновоеЗадание, ЗначениеХодаВыполненияСтрокой, ТекущееСообщение, МассивСообщений;  
	
	СостоянияВызовов = Новый Соответствие;
	
	Для Каждого ТекущийИдентификаторВызова Из ИдентификаторыВызовов Цикл
		
		СостояниеВызова = Новый Структура("Состояние, ВозвращенноеЗначение, ОписаниеОшибки, ЗначениеХодаВыполнения, СообщенияХодаВыполнения");
		СостояниеВызова.СообщенияХодаВыполнения = Новый Массив();
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ТекущийИдентификаторВызова);
		
		Если ФоновоеЗадание = Неопределено Тогда
			СостояниеВызова.Состояние = Неопределено;	
		Иначе
			
			Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				СостояниеВызова.Состояние = "Активен";
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
				СостояниеВызова.Состояние = "Завершен";
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
				СостояниеВызова.Состояние = "Отменен";
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				СостояниеВызова.Состояние = "ЗавершенСОшибкой";
				СостояниеВызова.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке);
			Иначе
				ВызватьИсключение "Не удалось определить состояние асинхронного вызова";
			КонецЕсли;
							
			МассивСообщений = ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
			ЗначениеХодаВыполненияСтрокой = Неопределено;
			Если МассивСообщений <> Неопределено Тогда
				Для Каждого ТекущееСообщение Из МассивСообщений Цикл
					Если ТекущееСообщение.Поле = "АсинхронныйВызов.ВозвращенноеЗначение" Тогда
						СостояниеВызова.ВозвращенноеЗначение = ЗначениеИзСтрокиВнутр(ТекущееСообщение.Текст);
					КонецЕсли;
					Если ТекущееСообщение.Поле = "АсинхронныйВызов.ЗначениеХодаВыполнения" Тогда
						ЗначениеХодаВыполненияСтрокой = ТекущееСообщение.Текст;
					КонецЕсли;
					Если ТекущееСообщение.Поле = "АсинхронныйВызов.СообщениеХодаВыполнения" Тогда
						СостояниеВызова.СообщенияХодаВыполнения.Добавить(ЗначениеИзСтрокиВнутр(ТекущееСообщение.Текст));
					КонецЕсли;
				КонецЦикла;
				Если ЗначениеХодаВыполненияСтрокой <> Неопределено Тогда
					СостояниеВызова.ЗначениеХодаВыполнения = ЗначениеИзСтрокиВнутр(ЗначениеХодаВыполненияСтрокой);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
					
		СостоянияВызовов.Вставить(ТекущийИдентификаторВызова, СостояниеВызова);
		
	КонецЦикла;	
	
	Возврат СостоянияВызовов;
	
КонецФункции

