//Перем СписокПоиска Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Массив = ВосстановитьЗначение("Строки для полнотекстового поиска");
	Если Массив <> Неопределено Тогда
		Элементы.ПоисковоеВыражение.СписокВыбора.ЗагрузитьЗначения(Массив);
	КонецЕсли;	
 	
	РазмерПорции = 20;
	Нечеткость = 25;
	ПоказыватьОписания = Истина;
	
	//Элементы.ПанельНастройки.Свертка = РежимСверткиЭлементаУправления.Верх;
	Элементы.ПараметрыНастройки.Скрыть();
	Элементы.СписокМетаданных.Доступность = Ложь;
	
	Элементы.Нечеткость.Доступность = Ложь;
	//Элементы.КоманднаяПанель.Кнопки.Настройка.Пометка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
	//    ПолнотекстовыйПоиск.ОбновитьИндекс(, Истина);
	//КонецЕсли;
	
Если НЕ ПолнотекстовыйПоискИндексАктуален() Тогда
	Состояние("Обновление индекса Полнотекстового Поиска");
    ПолнотекстовыйПоискОбновитьИндекс();
КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолнотекстовыйПоискИндексАктуален()
Возврат ПолнотекстовыйПоиск.ИндексАктуален();	
КонецФункции	

&НаСервере
Функция  ПолнотекстовыйПоискОбновитьИндекс()
ПолнотекстовыйПоиск.ОбновитьИндекс(, Истина);
КонецФункции	


//
&НаКлиенте
Процедура Поиск(Команда)
   Искать(0);
КонецПроцедуры

&НаКлиенте
Процедура Предыдущая(Команда)
    Искать(-1);
КонецПроцедуры

&НаКлиенте
Процедура Следующая(Команда)
    Искать(1);
КонецПроцедуры

&НаКлиенте
Процедура Искать(Направление)
    Если ПустаяСтрока(ПоисковоеВыражение) Тогда
        ПоказатьПредупреждение(,"Не задан поисковый запрос!");
        Возврат;
    КонецЕсли;
    ИскатьСервер(Направление);
КонецПроцедуры

&НаСервере
Процедура ИскатьСервер(Направление) Экспорт
    СписокПоиска=ПолнотекстовыйПоиск.СоздатьСписок();
	
	Если ОграничитьОбъектыПоиска = Истина Тогда
		
		МассивМД = Новый Массив();
		//Для Каждого МД Из СписокМетаданных Цикл
		//	МассивМД.Добавить(МД.Значение);
		//КонецЦикла;	
		
		МассивМД = Новый Массив();
		Для Каждого МД Из СписокМетаданных Цикл
			ОМД = Метаданные.НайтиПоПолномуИмени(МД.Значение);
			МассивМД.Добавить(ОМД);
		КонецЦикла;	
		
		СписокПоиска.ОбластьПоиска = МассивМД;
		
	Иначе	
		
		МассивМД = Новый Массив();
		СписокПоиска.ОбластьПоиска = МассивМД;
		
	КонецЕсли;
	
	Если ПрименитьНечеткийПоиск = Истина Тогда
		СписокПоиска.ПорогНечеткости = Нечеткость;
	Иначе	
		СписокПоиска.ПорогНечеткости = 0;
	КонецЕсли;
	
	СписокПоиска.РазмерПорции = РазмерПорции;	
	
	СписокПоиска.ПолучатьОписание = ПоказыватьОписания;

    СписокПоиска.СтрокаПоиска=ПоисковоеВыражение;
    Если Направление=0 Тогда
        СписокПоиска.ПерваяЧасть();
    ИначеЕсли Направление=-1 Тогда
        СписокПоиска.ПредыдущаяЧасть(ТекущаяПозиция);
    ИначеЕсли Направление=1 Тогда
        СписокПоиска.СледующаяЧасть(ТекущаяПозиция);
    КонецЕсли;
    РезультатыПоиска.Очистить();
    Для каждого Результат Из СписокПоиска Цикл
        РезультатыПоиска.Добавить(Результат.Значение);
    КонецЦикла;
    РезультатПоиска=СписокПоиска.ПолучитьОтображение(ВидОтображенияПолнотекстовогоПоиска.HTMLТекст);
    ТекущаяПозиция=СписокПоиска.НачальнаяПозиция();
    ПолноеКоличество=СписокПоиска.ПолноеКоличество();
    Если СписокПоиска.Количество()<>0 Тогда
        СообщениеОРезультате="Показаны "+Строка(ТекущаяПозиция+1)+"-"+Строка(ТекущаяПозиция+СписокПоиска.Количество())+" из "+
        Строка(ПолноеКоличество);
        Элементы.Следующая.Доступность=(ПолноеКоличество-ТекущаяПозиция)>СписокПоиска.Количество();
        Элементы.Предыдущая.Доступность=ТекущаяПозиция>0;
		
	// + ПСН	
	Если Элементы.ПоисковоеВыражение.СписокВыбора.НайтиПоЗначению(СписокПоиска.СтрокаПоиска) = Неопределено Тогда
		Элементы.ПоисковоеВыражение.СписокВыбора.Вставить(0, СписокПоиска.СтрокаПоиска);
		СохранитьЗначение("Строки для полнотекстового поиска", Элементы.ПоисковоеВыражение.СписокВыбора.ВыгрузитьЗначения());
	КонецЕсли;
	// - ПСН	
		
	Иначе
        СообщениеОРезультате="По данному запросу ничего не найдено!";
        Элементы.Следующая.Доступность=Ложь;
        Элементы.Предыдущая.Доступность=Ложь;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СохранитьЗначение(КлючОбъекта, Значение)
//КлючОбъекта  = КлючОбъекта; //вот тут надо что-то прописать, параметр обязательный
//    КлючНастроек = ИмяФормата + Параметры.Организация +  "ИмяФайла" + Параметры.Режим;
КлючНастроек = "";
//    // настройки могут быть произвольного типа
//Настройки    = Новый Структура("ТекущееИмяФайла",Параметры.ТекущееИмяФайла);
Настройки    = Значение;
ИмяПользователя = ИмяПользователя(); //необязательный параметр
//    ХранилищеОбщихНастроек.Cохранить(КлючОбъекта,  КлючНастроек, Настройки, , ИмяПользователя);	
 ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, Настройки, ,ИмяПользователя );	
КонецФункции	

&НаСервере
Функция ВосстановитьЗначение(КлючОбъекта)
КлючНастроек = "";
ИмяПользователя = ИмяПользователя(); //необязательный параметр
	//Попытка
        Настройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек,,ИмяПользователя);
        // если настроек нет, то будет возвращено значение "Неопределено"
	//Исключение
		//Сообщить("Нет прав на восстановление настроек.");
	//КонецПопытки;
 
	//Если СтруктураНастроек = Неопределено Тогда
	//    Сообщить("Не вышло восстановить настройки!");
	//КонецЕсли;	
	Возврат Настройки;
КонецФункции	

&НаКлиенте
Процедура РезультатПоискаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
ЭлементHTML=ДанныеСобытия.Event.srcElement;
Если ЭлементHTML.id="FullTextSearchListItem" Тогда
	//НомерВСписке=Число(ЭлементHTML.nameProp);
    НомерВСписке=Число(ЭлементHTML.getAttribute("sel_num"));

	ВыбраннаяСтрока=РезультатыПоиска[НомерВСписке].Значение;
	
	//ОткрытьЗначение(ВыбраннаяСтрока);
	ПоказатьЗначение(, ВыбраннаяСтрока);
	
	СтандартнаяОбработка=Ложь;
КонецЕсли;
КонецПроцедуры
//

// + Настройки
&НаКлиенте
Процедура ОграничитьОбъектыПоискаПриИзменении(Элемент)
	Элементы.СписокМетаданных.Доступность = ОграничитьОбъектыПоиска;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьМетаданныеНажатие___(Элемент)
	
	//Форма = ПолучитьФорму("ФормаВыбораМетаданных");
	//Форма.СписокОМД = СписокМетаданных;
	//Форма.ОткрытьМодально();
	//
	//Если Форма.ОК = Истина Тогда
	//	
	//	СписокМетаданных.Очистить();
	//	Для Каждого ОМД Из Форма.ТаблицаОМД Цикл
	//		Если ОМД.Отбор = Истина Тогда
	//			ОграничитьОбъектыПоиска = Истина;
	//			ЭлементыФормы.СписокМетаданных.Доступность = Истина;
	//			СписокМетаданных.Добавить(ОМД.Значение);
	//			Картинка = Новый Картинка
	//		КонецЕсли;	
	//	КонецЦикла;
	//
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМетаданные(Команда)
	//Форма = ПолучитьФорму("ФормаВыбораМетаданных");
	//Форма.СписокОМД = СписокМетаданных;
	//Форма.ОткрытьМодально();
	
	ПарамФормы = Новый Структура("СписокОМД", СписокМетаданных); 
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормаВыбораМетаданных", ЭтаФорма);
	Форма = ОткрытьФорму("Обработка.ПоискДанных.Форма.ФормаВыбораМетаданных", ПарамФормы, ЭтаФорма
		,,,, Оповещение,  РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Форма.СписокОМД = СписокМетаданных;
	//Форма.ОткрытьМодально();

	
	//Если Форма.ОК = Истина Тогда
	//	
	//	СписокМетаданных.Очистить();
	//	Для Каждого ОМД Из Форма.ТаблицаОМД Цикл
	//		Если ОМД.Отбор = Истина Тогда
	//			ОграничитьОбъектыПоиска = Истина;
	//			Элементы.СписокМетаданных.Доступность = Истина;
	//			СписокМетаданных.Добавить(ОМД.Значение);
	//			Картинка = Новый Картинка
	//		КонецЕсли;	
	//	КонецЦикла;
	//
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормаВыбораМетаданных(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
Если Результат.ОК Тогда
	СписокМетаданных.Очистить();
	
	ТаблицаОМД = Результат.ТаблицаОМД;
	
	Для Каждого Строка Из ТаблицаОМД Цикл
		
		Если Строка.Отбор = Истина Тогда
			ОграничитьОбъектыПоиска = Истина;
			Элементы.СписокМетаданных.Доступность = Истина;
			
			ЭлементСписка = СписокМетаданных.Добавить(Строка.Значение);
			ЭлементСписка.Картинка = Строка.ТипКартинки;
		КонецЕсли;	
	КонецЦикла;
	
КонецЕсли;
	
//Если Форма.ОК = Истина Тогда
//	
//	СписокМетаданных.Очистить();
//	Для Каждого ОМД Из Форма.ТаблицаОМД Цикл
//		Если ОМД.Отбор = Истина Тогда
//			ОграничитьОбъектыПоиска = Истина;
//			Элементы.СписокМетаданных.Доступность = Истина;
//			СписокМетаданных.Добавить(ОМД.Значение);
//			Картинка = Новый Картинка
//		КонецЕсли;	
//	КонецЦикла;
//
//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьНечеткийПоискПриИзменении(Элемент)
Элементы.Нечеткость.Доступность = ПрименитьНечеткийПоиск;
КонецПроцедуры


// - Настройки

