
Функция СформироватьОтчетНаСервере(Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();

ТабДок = Новый ТабличныйДокумент;      

// + Оплаты Дни
ПолеОтчета = СформироватьОплатыДни(Макет,  ДатаОтчетаС,  ДатаОтчетаПо, ЭтоОтчет);
ТабДок.Вывести(ПолеОтчета);
// - Оплаты Дни

////
// + Нераспределенные оплаты
ПолеОтчета = СформироватьНераспределенныеОплаты(Макет,  ДатаОтчетаС,  ДатаОтчетаПо
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет);
ТабДок.Вывести(ПолеОтчета);
// - Нераспределенные оплаты
	
// + Возвраты
ПолеОтчета = СформироватьВозвраты(Макет,  ДатаОтчетаС,  ДатаОтчетаПо, ЭтоОтчет);
ТабДок.Вывести(ПолеОтчета);
// - Возвраты

// + Оплаты                            
ПолеОтчета = СформироватьОплатыСчета(Макет,  ДатаОтчетаС,  ДатаОтчетаПо, ЭтоОтчет);
ТабДок.Вывести(ПолеОтчета);
// - Оплаты 

Если ЭтоОтчет Тогда
	Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
	Колонка_1 = Область.ШиринаТаблицы - 5;
	Колонка_2 = Область.ШиринаТаблицы;
	ТабДок.Область(, Колонка_1, ,Колонка_2).Видимость = Ложь;   
КонецЕсли;
		
//
ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;


//ОбластьШапка = ТабДок.Область("R1"); 
ОбластьШапка = ТабДок.Область(0,,0); 
ТабДок.ПовторятьПриПечатиСтроки = ОбластьШапка;

ТабДок.ФиксацияСверху = 1;
Возврат ТабДок;
КонецФункции

Функция СформироватьОплатыДни(Макет, ДатаОтчетаС, ДатаОтчетаПо, ЭтоОтчет) Экспорт
ПолеОтчета = Новый ТабличныйДокумент; 

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингУслуги.Ссылка КАК Папка,
                      |	КоворкингУслуги.НомерПП КАК НомерПП,
                      |	КоворкингУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты
                      |ИЗ
                      |	Справочник.КоворкингУслуги КАК КоворкингУслуги
                      |ГДЕ
                      |	КоворкингУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингУслуги.ЭтоГруппа = ИСТИНА
                      |	И КоворкингУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.КоворкингУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.КоворкингУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;

Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Папка) Тогда		
		//Область.Параметры.ШапкаДопУслуги = Строка.Папка;
		Если ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			ЗаголовокОтчета = Строка.ЗаголовокОтчеты;
		Иначе
			ЗаголовокОтчета = Строка.Папка;
		КонецЕсли;
		
		Область.Параметры.ШапкаДопУслуги = ЗаголовокОтчета;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область, 0);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

ПолеОтчета.ФиксацияСверху = 1;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

Итоги = Новый Структура();
Итоги.Вставить("Количество", 0);
//Итоги.Вставить("Цена", 0);
Итоги.Вставить("Сумма", 0);
Итоги.Вставить("СуммаЧистая", 0);
Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаОплаты_кк", 0);
Итоги.Вставить("СуммаОплаты_нал", 0);
Итоги.Вставить("СуммаЭквайринга", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);

ИтогиДень = Новый Структура();
ИтогиДень.Вставить("Количество", 0);
//ИтогиДень.Вставить("Цена", 0);
ИтогиДень.Вставить("Сумма", 0);
ИтогиДень.Вставить("СуммаЧистая", 0);
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаОплаты_кк", 0);
ИтогиДень.Вставить("СуммаОплаты_нал", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК НомерКоворкинг,
                      |	КоворкингСчета.Ссылка КАК Счет,
                      |	ВЫБОР
                      |		КОГДА КоворкингСчета.ОплачиваетСчет = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
                      |			ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
                      |		ИНАЧЕ КоворкингСчета.ОплачиваетСчет
                      |	КОНЕЦ КАК Оплачивает,
                      |	КоворкингСчета.Сумма КАК Сумма,
                      |	КоворкингСчета.Цена КАК Цена,
                      |	КоворкингСчета.Сумма КАК СуммаСчета,
                      |	КоворкингСчета.Количество КАК Количество,
                      |	КоворкингСчета.КоличествоЕдиниц КАК КоличествоЕдиниц,
                      |	КоворкингСчета.КоворкингЗаявка.ПериодАренды КАК ПериодАренды,
                      |	КоворкингСчета.ДатаС КАК ДатаС,
                      |	КоворкингСчета.ДатаПо КАК ДатаПо
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоворкингСчета КАК КоворкингСчета
                      |		ПО КоворкингНомера.Ссылка = КоворкингСчета.КоворкингЗаявка.КоворкингНомер
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингСчета.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингСчета.Проведен = ИСТИНА
                      |	И НЕ (КоворкингСчета.ДатаС > &ДатаПо
                      |	ИЛИ КоворкингСчета.ДатаПо < &ДатаC)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоворкингНомера.Наименование");

Запрос.УстановитьПараметр("ДатаC", ДатаОтчетаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаОтчетаПо);
ТЗ_ВсеСчета = Запрос.Выполнить().Выгрузить();

Счета = Новый СписокЗначений;
Для Каждого Строка Из ТЗ_ВсеСчета Цикл
	Счета.Добавить(Строка.Счет);					
КонецЦикла;

Если ТЗ_ВсеСчета.Количество() = 0 Тогда Возврат ПолеОтчета; КонецЕсли; 
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка КАК Счет,
                      |	КоворкингСчетаДопУслугиКоворкинг.НомерСтроки КАК НомерСтроки,
                      |	КоворкингСчетаДопУслугиКоворкинг.ГУИД КАК ГУИД,
                      |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
                      |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК Услуга,
                      |	КоворкингСчетаДопУслугиКоворкинг.Цена КАК Цена,
                      |	КоворкингСчетаДопУслугиКоворкинг.Количество КАК Количество,
                      |	КоворкингСчетаДопУслугиКоворкинг.Сумма КАК Сумма,
                      |	КоворкингСчетаДопУслугиКоворкинг.СуммаОплачено КАК СуммаОплачено,
                      |	КоворкингСчетаДопУслугиКоворкинг.Примечание КАК Примечание
                      |ИЗ
                      |	Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                      |ГДЕ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка В (&Счета)");

Запрос.УстановитьПараметр("Счета", Счета);
ТЗ_ВсеУслуги = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	РаспределениеОплатКоворкинг.Ссылка КАК Счет,
                      |	РаспределениеОплатКоворкинг.ДокументОплаты.ОтКого КАК ДокументОплатыОтКого,
                      |	ВЫБОР
                      |		КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ РаспределениеОплатКоворкинг.ДокументОплаты.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	РаспределениеОплатКоворкинг.ДокументОплаты КАК ДокументОплаты,
                      |	РаспределениеОплатКоворкинг.ДокументОплаты.Номер КАК НомерДокументаОплаты,
                      |	РаспределениеОплатКоворкинг.ДокументОплаты.Дата КАК ДатаДокументаОплаты,
                      |	РаспределениеОплатКоворкинг.ДокументОплаты.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК ОстатокДокументаОплаты,
                      |	РаспределениеОплатКоворкинг.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
                      |	РаспределениеОплатКоворкинг.СуммаОплаты КАК СуммаОплаты,
                      |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
                      |	РаспределениеОплатКоворкинг.ЭтоУслуга КАК ЭтоУслуга,
                      |	РаспределениеОплатКоворкинг.ГУИДДолги КАК ГУИДДолги,
                      |	ЕСТЬNULL(ОплатыДокументОплатыВыписка.Сумма, 0) КАК ОплатыДокументОплатыВыписка,
                      |	ЕСТЬNULL(ОплатыДокументОплатыКасса.Сумма, 0) КАК ОплатыДокументОплатыКасса,
                      |	ЕСТЬNULL(ОплатыДокументОплатыПрочиеОплаты.Сумма, 0) КАК ОплатыДокументОплатыПрочиеОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.Сумма
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументОплатыКасса,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументОплатыНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ВЫБОР
                      |					КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Взаимозачет)
                      |						ТОГДА 9
                      |					КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                      |						ТОГДА 10
                      |					КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)
                      |						ТОГДА 11
                      |					КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                      |						ТОГДА 12
                      |					ИНАЧЕ 10
                      |				КОНЕЦ
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |					ТОГДА ВЫБОР
                      |							КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |								ТОГДА 8
                      |							КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |								ТОГДА ВЫБОР
                      |										КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |											ТОГДА 5
                      |										ИНАЧЕ 4
                      |									КОНЕЦ
                      |							ИНАЧЕ 3
                      |						КОНЕЦ
                      |				ИНАЧЕ ВЫБОР
                      |						КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |							ТОГДА 8
                      |						КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные = 0
                      |								И РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта > 0
                      |							ТОГДА 1
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные > 0
                      |										И РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта = 0
                      |									ТОГДА 2
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК ЭтоЭквайринг,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ЕСТЬNULL(ВозвратыВыписка.Сумма, 0)
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.Сумма, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.СуммаКарта, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЕСТЬNULL(ВозвратыКасса.СуммаНаличные, 0)
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаВозвратаДокументаОплатаНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ""ВБ""
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ""КД""
                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ""ПО""
                      |		ИНАЧЕ """"
                      |	КОНЕЦ КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.КоворкингСчета.РаспределениеОплатКоворкинг КАК РаспределениеОплатКоворкинг
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма,
                      |			0 КАК СуммаКарта,
                      |			0 КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК ВозвратыВыписка
                      |		ПО РаспределениеОплатКоворкинг.ДокументОплаты = ВозвратыВыписка.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
                      |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК ВозвратыКасса
                      |		ПО РаспределениеОплатКоворкинг.ДокументОплаты = ВозвратыКасса.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                      |		ПО РаспределениеОплатКоворкинг.Ссылка = КоворкингСчетаДопУслугиКоворкинг.Ссылка
                      |			И РаспределениеОплатКоворкинг.ГУИДДолги = КоворкингСчетаДопУслугиКоворкинг.ГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ОплатыДокументОплатыКасса
                      |		ПО РаспределениеОплатКоворкинг.ДокументОплаты = ОплатыДокументОплатыКасса.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ОплатыДокументОплатыВыписка
                      |		ПО РаспределениеОплатКоворкинг.ДокументОплаты = ОплатыДокументОплатыВыписка.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ПрочиеОплатыДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ПрочиеОплатыДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ПрочиеОплаты.ДолгиОплата КАК ПрочиеОплатыДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ПрочиеОплатыДолгиОплата.Ссылка) КАК ОплатыДокументОплатыПрочиеОплаты
                      |		ПО РаспределениеОплатКоворкинг.ДокументОплаты = ОплатыДокументОплатыПрочиеОплаты.Ссылка
                      |ГДЕ
                      |	РаспределениеОплатКоворкинг.Ссылка В(&Счета)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДокументОплатыДатаОплаты,
                      |	ДокументОплаты");

Запрос.УстановитьПараметр("Счета", Счета);
ТЗ_ВсеОплаты = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ_ВсеОплаты Цикл
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда	
		Строка.КонтрагентНаименование = Строка.ДокументОплатыОтКого.Наименование;			
	КонецЕсли;
КонецЦикла;

Для Каждого Строка Из ТЗ_ВсеОплаты Цикл
	Строка.ОстатокДокументаОплаты = Строка.СуммаДокументаОплаты - Строка.СуммаВозвратаДокументаОплаты;
		
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыВыписка;	
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыКасса;	
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
		Строка.ОстатокДокументаОплаты = Строка.ОстатокДокументаОплаты
			- Строка.ОплатыДокументОплатыПрочиеОплаты;	
	КонецЕсли;
КонецЦикла;

ТЗ_ВсеОплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_ВсеОплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_ВсеОплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;

ТЗ_ВсяАренда = Новый ТаблицаЗначений;
ТЗ_ВсяАренда.Колонки.Добавить("Счет");
ТЗ_ВсяАренда.Колонки.Добавить("ДатаАренды");
ТЗ_ВсяАренда.Колонки.Добавить("СуммаАренды");

Для Индекс = 0 По ТЗ_ВсеСчета.Количество() - 1 Цикл
	СтрокаСчет = ТЗ_ВсеСчета[Индекс];
	
	ОстатокСуммаСчета = СтрокаСчет.СуммаСчета;
	
	Если СтрокаСчет.КоличествоЕдиниц = 0 Тогда
		СуммаЗаДень = 0;	
	Иначе
		СуммаЗаДень = Окр(СтрокаСчет.СуммаСчета / СтрокаСчет.КоличествоЕдиниц, 2); 
	КонецЕсли;
	
	Дата_П = СтрокаСчет.ДатаС;
	ДатаПо = СтрокаСчет.ДатаПо;
	Пока Дата_П <= ДатаПо Цикл
		НоваяСтрока = ТЗ_ВсяАренда.Добавить();
		НоваяСтрока.Счет = СтрокаСчет.Счет;
		НоваяСтрока.ДатаАренды = Дата_П;
		
		Если Дата_П = ДатаПо Тогда
			НоваяСтрока.СуммаАренды = ОстатокСуммаСчета;
		Иначе
			НоваяСтрока.СуммаАренды = СуммаЗаДень;
			ОстатокСуммаСчета = ОстатокСуммаСчета - СуммаЗаДень; 				
		КонецЕсли;
		
		Дата_П = Дата_П + 24 * 60 *60;
	КонецЦикла;		
КонецЦикла;

ТЗ_ВсеОплатыАренда = ТЗ_ВсеОплаты.СкопироватьКолонки();
ТЗ_ВсеОплатыАренда.Колонки.Добавить("ДатаАренды");

Для Каждого СтрокаСчет Из ТЗ_ВсеСчета Цикл
	ОтборСтроки = Новый Структура("Счет, ЭтоУслуга", СтрокаСчет.Счет, Ложь);
	ОплатыСчет = ТЗ_ВсеОплаты.НайтиСтроки(ОтборСтроки);

	ОтборСтроки = Новый Структура("Счет", СтрокаСчет.Счет);
	АрендаСчет = ТЗ_ВсяАренда.НайтиСтроки(ОтборСтроки);
	
	Для Каждого СтрокаАрендаСчет Из АрендаСчет Цикл
		ОстатокСуммаАренды = СтрокаАрендаСчет.СуммаАренды;
		
		Для Каждого СтрокаОплата Из ОплатыСчет Цикл
			ОстатокСуммаОплаты = СтрокаОплата.СуммаОплаты;
			
			// + Аудит
			Если ОстатокСуммаОплаты = 0 Тогда Продолжить; КонецЕсли;
			// - Аудит

			НоваяСтрока = ТЗ_ВсеОплатыАренда.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплата); 
			
			НоваяСтрока.ДатаАренды = СтрокаАрендаСчет.ДатаАренды;
			
			Если ОстатокСуммаОплаты >= ОстатокСуммаАренды Тогда 
				НоваяСтрока.СуммаОплаты = ОстатокСуммаАренды;
				
				ОстатокСуммаОплаты = ОстатокСуммаОплаты - ОстатокСуммаАренды;
				ОстатокСуммаАренды = 0;      
				
				// + Аудит
				СтрокаОплата.СуммаОплаты = ОстатокСуммаОплаты;
				// - Аудит
				
				Прервать;
			Иначе
				НоваяСтрока.СуммаОплаты = ОстатокСуммаОплаты;
				
				ОстатокСуммаАренды = ОстатокСуммаАренды - ОстатокСуммаОплаты;   
				
				ОстатокСуммаОплаты = 0;

				// + Аудит
				СтрокаОплата.СуммаОплаты = ОстатокСуммаОплаты;
				// - Аудит
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецЦикла;

Дата_П = ДатаОтчетаС;
Пока Дата_П <= ДатаОтчетаПо Цикл
	ТЗ_Счета = ТЗ_ВсеСчета.СкопироватьКолонки();
	Для Каждого Строка Из ТЗ_ВсеСчета Цикл
		Если Строка.ДатаС > Дата_П ИЛИ Строка.ДатаПо < Дата_П Тогда Продолжить; КонецЕсли;
		
		НоваяСтрока = ТЗ_Счета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Если ТЗ_Счета.Количество() = 0 Тогда Перейти ~ПРОДОЛЖИТЬ_ДатаОтчетаПо; КонецЕсли;
	
	ИтогиДень.Количество = 0;
	//ИтогиДень.Вставить("Цена", 0);
	ИтогиДень.Сумма =  0;
	ИтогиДень.СуммаЧистая = 0;
	ИтогиДень.СуммаОплаты = 0;
	ИтогиДень.СуммаЭквайринга = 0;
	
	УслугиДеньИтоги = ИтогиДень.УслугиДеньИтоги;
	Для Каждого Строка Из ИтогиДень.УслугиДеньИтоги Цикл
		Строка.СуммаУслуги = 0;	
	КонецЦикла;

	Область = Макет.ПолучитьОбласть("ЗаголовокСтрока");
	Дата = Формат(Дата_П, "ДФ='дд.МММ гг'" );  
	Область.Параметры.Дата = Дата;	
	ПолеОтчета.Вывести(Область, 0);
	
	Для Каждого СтрокаСчет Из ТЗ_Счета Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаСчет.Счет) Тогда Продолжить; КонецЕсли;
		
		ОтборСтроки = Новый Структура("Счет, ДатаУслуги", СтрокаСчет.Счет, Дата_П);
		НайденныеСтроки = ТЗ_ВсеУслуги.НайтиСтроки(ОтборСтроки);
		ТЗ_УслугиСчет = ТЗ_ВсеУслуги.СкопироватьКолонки();
		Для Каждого Строка Из НайденныеСтроки Цикл
			НоваяСтрока = ТЗ_УслугиСчет.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
		КонецЦикла;
		
		ОтборСтроки = Новый Структура("Счет", СтрокаСчет.Счет);
		НайденныеСтроки = ТЗ_ВсеОплаты.НайтиСтроки(ОтборСтроки);
		ТЗ_ОплатыСчет = ТЗ_ВсеОплаты.СкопироватьКолонки();
		Для Каждого Строка Из НайденныеСтроки Цикл
			НоваяСтрока = ТЗ_ОплатыСчет.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
		КонецЦикла;
		
		ОтборСтроки = Новый Структура("Счет, ДатаАренды", СтрокаСчет.Счет, Дата_П);
		ТЗ_ОплатыАрендаСчетДата = ТЗ_ВсеОплатыАренда.НайтиСтроки(ОтборСтроки);                  
		
		Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");

		Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
		Область.Параметры.Дата = Дата;		

		Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
		Область.Параметры.Месяц = Месяц;		

		ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
		Область.Параметры.ДеньНедели = ДеньНедели;
			
		НомерНаименование = СтрокаСчет.НомерКоворкинг.Наименование;
		Область.Параметры.Номер = НомерНаименование;
		Область.Параметры.РасшифровкаНомер = СтрокаСчет.Счет;

		//Если СтрокаСчет.СуммаСчета = 0 Тогда Перейти ~УСЛУГИ; КонецЕсли;
		
		Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
		Область.Параметры.РасшифровкаСчет = СтрокаСчет.Счет;
		
		Если КлиентыСервер.ЭтоЮрЛицо(СтрокаСчет.Счет.КоворкингЗаявка.Клиент) Тогда
			Область.Параметры.Клиент = СтрокаСчет.Счет.КоворкингЗаявка.Клиент;
			Область.Параметры.КлиентИНН = СтрокаСчет.Счет.КоворкингЗаявка.Клиент.ИНН;
		КонецЕсли;	
			
		Область.Параметры.ДатаСчета = СтрокаСчет.Счет.Дата;
		Область.Параметры.НомерСчета = СтрокаСчет.Счет.Номер;
		Область.Параметры.ДатаС = Формат(СтрокаСчет.Счет.ДатаС, "ДФ=dd.MM.yy");
		Область.Параметры.ДатаПо = Формат(СтрокаСчет.Счет.ДатаПо, "ДФ=dd.MM.yy");
		
		Область.Параметры.ПериодАренды = СтрокаСчет.ПериодАренды;
		
		Цена = СтрокаСчет.Цена;
		Если Цена <> 0 Тогда Область.Параметры.Цена = Цена; КонецЕсли;
		
		СуммаСчета = СтрокаСчет.СуммаСчета;
		Если СуммаСчета <> 0 Тогда Область.Параметры.СуммаСчета = СуммаСчета; КонецЕсли;

		Если СтрокаСчет.ПериодАренды = "ЧАС" Тогда 
			Количество = СтрокаСчет.Количество;
		Иначе
			Количество = 1;
		КонецЕсли;      
		Область.Параметры.Количество = Количество;

		Область.Параметры.КоличествоЕдиниц = СтрокаСчет.КоличествоЕдиниц;      

		Если СтрокаСчет.ПериодАренды = "ЧАС" Тогда 
			СуммаЗаДень = СуммаСчета;
		Иначе
			ОтборСтроки = Новый Структура("Счет, ДатаАренды", Строкасчет.Счет, Дата_П);	
			НайденныеСтроки = ТЗ_ВсяАренда.НайтиСтроки(ОтборСтроки);
			
			СуммаЗаДень = НайденныеСтроки[0].СуммаАренды;
		КонецЕсли;      
		Если СуммаЗаДень <> 0 Тогда Область.Параметры.Сумма = СуммаЗаДень; КонецЕсли;
		
		ТЗ_ДокументыОплаты = Новый ТаблицаЗначений;
		ТЗ_ДокументыОплаты.Колонки.Добавить("ДокументОплаты");
		
		СуммаОплаты = 0;
		СуммаЭквайринга = 0;
		
		СуммаОплаты_кк = 0;
		СуммаОплаты_нал = 0;

		Для Каждого СтрокаОплаты Из ТЗ_ОплатыАрендаСчетДата Цикл             
			СуммаОплаты = СуммаОплаты + Окр(СтрокаОплаты.СуммаОплаты, 2);		
			СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты) ;					
			
			Если СтрокаОплаты.СуммаДокументаОплаты <> 0 Тогда
				СуммаОплаты_кк = СуммаОплаты_кк + 
						Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыКарта / СтрокаОплаты.СуммаДокументаОплаты, 2);
				СуммаОплаты_нал = СуммаОплаты_нал + 
					Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыНаличные / СтрокаОплаты.СуммаДокументаОплаты, 2);
			КонецЕсли;

			НоваяСтрокаДокументыОплаты = ТЗ_ДокументыОплаты.Добавить();
			НоваяСтрокаДокументыОплаты.ДокументОплаты = СтрокаОплаты.ДокументОплаты;
		КонецЦикла;

		Для Каждого СтрокаОплаты Из ТЗ_ОплатыСчет Цикл
			Если СтрокаОплаты.ЭтоУслуга Тогда   
				ВСписке = ОбщийФункционалСервер.ВСписке(СтрокаОплаты.ГУИДДолги, "ГУИД", ТЗ_УслугиСчет);
				Если ВСписке Тогда   
					СуммаОплаты = СуммаОплаты + Окр(СтрокаОплаты.СуммаОплаты, 2);	
					СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
					
					Если СтрокаОплаты.СуммаДокументаОплаты <> 0 Тогда
						СуммаОплаты_кк = СуммаОплаты_кк + 
								Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыКарта / СтрокаОплаты.СуммаДокументаОплаты, 2);
						СуммаОплаты_нал = СуммаОплаты_нал + 
							Окр(СтрокаОплаты.СуммаОплаты * СтрокаОплаты.СуммаДокументаОплатыНаличные / СтрокаОплаты.СуммаДокументаОплаты, 2);
					КонецЕсли;
					
					НоваяСтрокаДокументыОплаты = ТЗ_ДокументыОплаты.Добавить();
					НоваяСтрокаДокументыОплаты.ДокументОплаты = СтрокаОплаты.ДокументОплаты;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ТЗ_ДокументыОплаты.Свернуть("ДокументОплаты");

		Если СуммаОплаты <> 0 Тогда Область.Параметры.СуммаОплаты = СуммаОплаты; КонецЕсли;
		Если СуммаОплаты_кк <> 0 Тогда Область.Параметры.СуммаОплаты_кк = СуммаОплаты_кк; КонецЕсли;
		Если СуммаОплаты_нал <> 0 Тогда Область.Параметры.СуммаОплаты_нал = СуммаОплаты_нал; КонецЕсли;
		Если СуммаЭквайринга <> 0 Тогда Область.Параметры.СуммаЭквайринга = СуммаЭквайринга; КонецЕсли;
		
		Если ТЗ_ДокументыОплаты.Количество() = 1 Тогда
			// + ПСН
			//СтрокаДокументыОплаты = ТЗ_ДокументыОплаты[0];
			ОтборСтроки = Новый Структура("ДокументОплаты", ТЗ_ДокументыОплаты[0].ДокументОплаты);
			НайденныеСтроки = ТЗ_ОплатыСчет.НайтиСтроки(ОтборСтроки);
			СтрокаОплаты = НайденныеСтроки[0]; 
			// - ПСН
			
			Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
			Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
			Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
			
			//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаОплаты);
			Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплаты);
			
			ЗаполнитьОтчетДокументОплаты(Область, СтрокаОплаты);
		КонецЕсли;
		
//~УСЛУГИ:
		ТЗ_УслугиИтого = ТЗ_УслугиСчет.СкопироватьКолонки();
		ТЗ_УслугиИтого.Колонки.Добавить("УслугаРодитель");
		
		ОтборСтроки = Новый Структура("ДатаУслуги", Дата_П);
		НайденныеСтроки = ТЗ_УслугиСчет.НайтиСтроки(ОтборСтроки);
		//Для Каждого Строка Из ТЗ_Услуги Цикл
		Для Каждого Строка Из НайденныеСтроки Цикл
			НоваяСтрока = ТЗ_УслугиИтого.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
			
			Результат = Справочники.КоворкингУслуги.ПустаяСсылка();
			Ссылка = НоваяСтрока.Услуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
			
			НоваяСтрока.УслугаРодитель = Результат;	
		КонецЦикла;	
		ТЗ_УслугиИтого.Свернуть("ДатаУслуги, УслугаРодитель", "Сумма");
		
		СуммаЧистая = СуммаЗаДень  + ТЗ_УслугиИтого.Итог("Сумма") - СуммаЭквайринга;
		Если СуммаЧистая <> 0 Тогда Область.Параметры.СуммаЧистая = СуммаЧистая; КонецЕсли;
		
		ОбластьВывода = ПолеОтчета.Вывести(Область, 1);		
		
		Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
			ЕстьСтрока = Ложь;
			Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
				Если СтрокаУслугиИтого.УслугаРодитель = СтрокаРодительУслуги.Папка Тогда 
					ЕстьСтрока = Истина; 
					Прервать; 
				КонецЕсли;
			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("Строка|КолонкаУслуги");
			Если ЕстьСтрока Тогда
				Если СтрокаУслугиИтого.Сумма <> 0 Тогда
					Область.Параметры.СуммаУслуги = СтрокаУслугиИтого.Сумма;
				КонецЕсли;	
			КонецЕсли;
			
			ОбластьВывода = ПолеОтчета.Присоединить(Область, 1);
		КонецЦикла;
		
		ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
		
		СуммаИтого_П = СуммаЗаДень  + ТЗ_УслугиИтого.Итог("Сумма");
		
		Если СуммаИтого_П <> СуммаОплаты Тогда 
			ШрифтСтроки = Новый Шрифт("Arial", 8, ,Истина); 
			ВыведеннаяОбласть.Шрифт = ШрифтСтроки;
			
			ВыведеннаяОбласть.ЦветТекста = Новый Цвет(255, 0, 0);
			//Для Индекс = 0 По КоличествоКолонок - 1 Цикл 
			//	ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).Шрифт 
			//	 //= Новый Шрифт(ОбластьОформления.Шрифт, ОбластьОформления.Шрифт.Размер, ,Истина);
			//	 	= Новый Шрифт("Arial", 8, ,Истина);
			//	ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).ЦветТекста = Новый Цвет(255, 0, 0);
			//КонецЦикла;	
		КонецЕсли;

// ОПЛАТЫ
		Если ТЗ_ДокументыОплаты.Количество() > 1 Тогда
		
			Для Каждого СтрокаОплаты Из ТЗ_ОплатыАрендаСчетДата Цикл
				Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
				
				Область.Параметры.Дата = ".";
				Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
				
				Область.Параметры.ДатаСчета = СтрокаСчет.Счет.Дата;
				Область.Параметры.НомерСчета = СтрокаСчет.Счет.Номер;
				Область.Параметры.ДатаС = Формат(СтрокаСчет.Счет.ДатаС, "ДФ=dd.MM.yy");
				Область.Параметры.ДатаПо = Формат(СтрокаСчет.Счет.ДатаПо, "ДФ=dd.MM.yy");

				Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
				Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
				Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
				
				//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаОплаты);
				Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплаты);
				
				СуммаОплатыСтрокаОплаты  = Окр(СтрокаОплаты.СуммаОплаты, 2);
				Область.Параметры.СуммаОплаты = СуммаОплатыСтрокаОплаты;
				
				Если ТипЗнч(СтрокаОплаты.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
					Область.Параметры.СуммаОплаты_кк = СтрокаОплаты.ДокументОплаты.СуммаКарта;
					Область.Параметры.СуммаОплаты_нал = СтрокаОплаты.ДокументОплаты.СуммаНаличные;
				КонецЕсли;	
					
				Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
				
				ЗаполнитьОтчетДокументОплаты(Область, СтрокаОплаты);
				
				ПолеОтчета.Вывести(Область, 1);
			КонецЦикла;

			ОтборСтроки = Новый Структура("ДатаУслуги", Дата_П);
			НайденныеСтроки =  ТЗ_ОплатыСчет.НайтиСтроки(ОтборСтроки);
			Для Каждого СтрокаОплаты Из НайденныеСтроки Цикл
				Если НЕ СтрокаОплаты.ЭтоУслуга Тогда Продолжить; КонецЕсли;
				
				Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
				Область.Параметры.Дата = ".";
				
				Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
				
				Область.Параметры.ДатаСчета = СтрокаСчет.Счет.Дата;
				Область.Параметры.НомерСчета = СтрокаСчет.Счет.Номер;
				Область.Параметры.ДатаС = Формат(СтрокаСчет.Счет.ДатаС, "ДФ=dd.MM.yy");
				Область.Параметры.ДатаПо = Формат(СтрокаСчет.Счет.ДатаПо, "ДФ=dd.MM.yy");
				
				Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
				Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
				Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
				
				СуммаОплатыСтрокаОплаты  = Окр(СтрокаОплаты.СуммаОплаты, 2);
				Область.Параметры.СуммаОплаты = СуммаОплатыСтрокаОплаты;
				
				Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
		
				ПолеОтчета.Вывести(Область, 1);
				
				Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
					ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ГУИДДолги);
					НайденныеСтроки = ТЗ_УслугиСчет.НайтиСтроки(ОтборСтроки);
					
					ЕстьСтрока = Ложь;
					Для Каждого Строка Из НайденныеСтроки Цикл
						Результат = Справочники.КоворкингУслуги.ПустаяСсылка();
						Ссылка = Строка.Услуга; 
						ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
						
						Если Результат = СтрокаРодительУслуги.Папка Тогда
							ЕстьСтрока = Истина;
							
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
					Если ЕстьСтрока Тогда
						ОбластьУслуги.Параметры.СуммаУслуги = СуммаОплатыСтрокаОплаты;
					КонецЕсли;
					
					ПолеОтчета.Присоединить(ОбластьУслуги, 1);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		//ИтогиДень.Количество = ИтогиДень.Количество + ;
		//ИтогиДень.Вставить("Цена", 0);
		ИтогиДень.Сумма =  ИтогиДень.Сумма + СуммаЗаДень;
		ИтогиДень.СуммаЧистая = ИтогиДень.СуммаЧистая + СуммаЧистая;
		ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
		ИтогиДень.СуммаОплаты_кк = ИтогиДень.СуммаОплаты_кк + СуммаОплаты_кк;
		ИтогиДень.СуммаОплаты_нал = ИтогиДень.СуммаОплаты_нал + СуммаОплаты_нал;
		ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;
		
		Для Каждого СтрокаУслугиДеньИтого Из ИтогиДень.УслугиДеньИтоги Цикл 
			ЕстьСтрока = Ложь;
			Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
				Если СтрокаУслугиИтого.УслугаРодитель = СтрокаУслугиДеньИтого.УслугаРодитель Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
			КонецЦикла;
			
			Если ЕстьСтрока Тогда 
				Если СтрокаУслугиИтого.Сумма <> 0 Тогда
					СтрокаУслугиДеньИтого.СуммаУслуги = СтрокаУслугиДеньИтого.СуммаУслуги + СтрокаУслугиИтого.Сумма;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;		
	КонецЦикла;		
	
	Область = Макет.ПолучитьОбласть("ИтогиДень|КолонкиЛево");
	
	Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
	Область.Параметры.Дата = Дата;		

	Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
	Область.Параметры.Месяц = Месяц;		

	ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
	Область.Параметры.ДеньНедели = ДеньНедели;

	//Область.Параметры.Номер = "Итого: " + ИтогиДень.Количество;
	//Область.Параметры.Цена = ИтогиДень.Цена;
	Область.Параметры.Сумма = ИтогиДень.Сумма;
	Область.Параметры.Количество = ИтогиДень.Количество;
	Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
	Область.Параметры.СуммаОплаты_кк = ИтогиДень.СуммаОплаты_кк;
	Область.Параметры.СуммаОплаты_нал = ИтогиДень.СуммаОплаты_нал;
	Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
	Область.Параметры.СуммаЧистая = ИтогиДень.СуммаЧистая;
	
	ПолеОтчета.Вывести(Область, 0);
	
	Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
		ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
		Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
			ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
		КонецЕсли;	
		ПолеОтчета.Присоединить(ОбластьУслуги, 1);
	КонецЦикла;
	
	Итоги.Сумма =  Итоги.Сумма + ИтогиДень.Сумма;
	Итоги.СуммаЧистая = Итоги.СуммаЧистая + ИтогиДень.СуммаЧистая;
	Итоги.СуммаОплаты = Итоги.СуммаОплаты + ИтогиДень.СуммаОплаты;
	Итоги.СуммаЭквайринга = Итоги.СуммаЭквайринга + ИтогиДень.СуммаЭквайринга;
	
	Для Индекс = 0 По Итоги.УслугиИтоги.Количество() - 1 Цикл
		Итоги.УслугиИтоги[Индекс].СуммаУслуги = Итоги.УслугиИтоги[Индекс].СуммаУслуги 
			+ ИтогиДень.УслугиДеньИтоги[Индекс].СуммаУслуги;		
	КонецЦикла;
	
~ПРОДОЛЖИТЬ_ДатаОтчетаПо:	
	Дата_П = Дата_П + 60*60*24;	
КонецЦикла;	
ПолеОтчета.ЗакончитьАвтогруппировкуСтрок();

Область = Макет.ПолучитьОбласть("Итоги|КолонкиЛево");

//Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
//Область.Параметры.Дата = Дата;		

//Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
//Область.Параметры.Месяц = Месяц;		

//ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
//Область.Параметры.ДеньНедели = ДеньНедели;

Область.Параметры.ИтогиДаты = "Период с " + Формат(ДатаОтчетаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаОтчетаПо, "ДФ=dd.MM.yy");

Область.Параметры.Сумма = Итоги.Сумма;
//Область.Параметры.Количество = Итоги.Количество;
Область.Параметры.СуммаОплаты = Итоги.СуммаОплаты;
Область.Параметры.СуммаОплаты_кк = Итоги.СуммаОплаты_кк;
Область.Параметры.СуммаОплаты_нал = Итоги.СуммаОплаты_нал;
Область.Параметры.СуммаЭквайринга = Итоги.СуммаЭквайринга;
Область.Параметры.СуммаЧистая = Итоги.СуммаЧистая;

ПолеОтчета.Вывести(Область, 1);

Для Каждого СтрокаУслугиИтого Из Итоги.УслугиИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("Итоги|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 1);
КонецЦикла;

//Если ЭтоОтчет Тогда
//	Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
//	Колонка_1 = Область.ШиринаТаблицы - 5;
//	Колонка_2 = Область.ШиринаТаблицы;
//	ПолеОтчета.Область(, Колонка_1, ,Колонка_2).Видимость = Ложь;   
//КонецЕсли;
//	
Возврат ПолеОтчета;	
КонецФункции

Процедура ЗаполнитьОтчетДокументОплаты(ОбластьОплаты, СтрокаОплаты)
ОбластьОплаты.Параметры.ТипДокументаОплаты = СтрокаОплаты.ТипДокументаОплаты;

ОбластьОплаты.Параметры.НомерДокументаОплаты = СтрокаОплаты.НомерДокументаОплаты;

//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаОплаты.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
ОбластьОплаты.Параметры.ДатаДокументаОплаты = СтрокаОплаты.ДатаДокументаОплаты;

ОбластьОплаты.Параметры.СуммаДокументаОплаты = СтрокаОплаты.СуммаДокументаОплаты;

ОбластьОплаты.Параметры.СуммаВозвратаДокументаОплаты = СтрокаОплаты.СуммаВозвратаДокументаОплаты;
ОбластьОплаты.Параметры.ОстатокДокументаОплаты = СтрокаОплаты.ОстатокДокументаОплаты;

ОбластьОплаты.Параметры.СуммаДокументаОплаты_кк = СтрокаОплаты.СуммаДокументаОплатыКарта;
ОбластьОплаты.Параметры.СуммаДокументаОплаты_Нал = СтрокаОплаты.СуммаДокументаОплатыНаличные;

ОбластьОплаты.Параметры.СуммаВозвратаДокументаОплаты_кк = СтрокаОплаты.СуммаВозвратаДокументаОплатыКарта;
ОбластьОплаты.Параметры.СуммаВозвратаДокументаОплаты_Нал = СтрокаОплаты.СуммаВозвратаДокументаОплатаНаличные;
КонецПроцедуры

//
Функция СформироватьНераспределенныеОплаты(Знач Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт
////
// + Нераспределенные оплаты
//НеПоказыватьЗакрытыеНераспределенныеОплаты = Истина;

ПолеОтчета = Новый ТабличныйДокумент;

//Список_ОплатыКоворкингКассовыйДокумент = Список_ОплатыКоворкинг("КД");
//Список_ОплатыКоворкингВыпискаБанка = Список_ОплатыКоворкинг("ВБ");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Счет,
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) КАК СуммаОплаты,
                      |	КассовыйДокумент.Номер КАК НомерДокументаОплаты,
                      |	КассовыйДокумент.Дата КАК ДатаДокументаОплаты,
                      |	КассовыйДокумент.ОтКого.Наименование КАК КонтрагентНаименование,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплатыКасса,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	ЕСТЬNULL(Возвраты.СуммаНаличные, 0) КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	ЕСТЬNULL(Возвраты.СуммаКарта, 0) КАК СуммаВозвратаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ЛОЖЬ КАК ЭтоЭквайринг,
                      |	""КД"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ДолгиОплата_КД
                      |		ПО КассовыйДокумент.Ссылка = ДолгиОплата_КД.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
                      |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Приход = ИСТИНА
                      |	И ВЫБОР
                      |			КОГДА ДолгиОплата_КД.Ссылка ЕСТЬ NULL
                      |				ТОГДА ВЫБОР
                      |						КОГДА &НеПоказыватьЗакрытыеНераспределенныеОплаты
                      |							ТОГДА КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) <> 0
                      |						ИНАЧЕ ИСТИНА
                      |					КОНЕЦ
                      |			ИНАЧЕ КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) <> 0
                      |		КОНЕЦ
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания");

					  //|	И НЕ КассовыйДокумент.Ссылка В (&СписокКоворкинг)");		

ДатаНачала = '20230101';

Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ТекущаяДата();
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		

Запрос.УстановитьПараметр("НеПоказыватьЗакрытыеНераспределенныеОплаты", НеПоказыватьЗакрытыеНераспределенныеОплаты);		

//Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКассовыйДокумент);

ТЗ = Запрос.Выполнить().Выгрузить();	

ТЗ_НераспределенныеОплаты = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_НераспределенныеОплаты.Колонки.Найти("ДокументОплаты");
ТЗ_НераспределенныеОплаты.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_НераспределенныеОплаты.Колонки.Добавить("ДокументОплаты");

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Счет,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) КАК СуммаОплаты,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	ВыпискаБанка.ОтКого.Наименование КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	0 КАК СуммаДокументОплатыКасса,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВыпискаБанка.ЭтоЭквайринг КАК ЭтоЭквайринг,
                      |	""ВБ"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ДолгиОплата_ВБ
                      |		ПО ВыпискаБанка.Ссылка = ДолгиОплата_ВБ.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Приход = ИСТИНА
                      |	И ВЫБОР
                      |			КОГДА ДолгиОплата_ВБ.Ссылка ЕСТЬ NULL
                      |				ТОГДА ВЫБОР
                      |						КОГДА &НеПоказыватьЗакрытыеНераспределенныеОплаты
                      |							ТОГДА ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) <> 0
                      |						ИНАЧЕ ИСТИНА
                      |					КОНЕЦ
                      |			ИНАЧЕ ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) <> 0
                      |		КОНЕЦ
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания");

					//|	И НЕ ВыпискаБанка.Ссылка В (&СписокКоворкинг)");

//ДатаНачала = '20230101';

Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ТекущаяДата();
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);			

Запрос.УстановитьПараметр("НеПоказыватьЗакрытыеНераспределенныеОплаты", НеПоказыватьЗакрытыеНераспределенныеОплаты);			

//Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыВыпискаБанка);

ТЗ = Запрос.Выполнить().Выгрузить();
	
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

СписокКонтрагентыИИН_Эквайринг = БезналРаспределениеСервер.СписокИННЭквайринг();
ПолучательПлатежа = Константы.ПолучательПлатежаБезнал.Получить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Счет,
                      |	БезналЗагрузка.ГУИД КАК ДокументОплаты,
                      |	БезналЗагрузка.ДатаОплаты КАК ДатаОплаты,
                      |	0 КАК СуммаОплаты,
                      |	NULL КАК НомерДокументаОплаты,
                      |	NULL КАК ДатаДокументаОплаты,
                      |	БезналЗагрузка.КонтрагентНаименование КАК КонтрагентНаименование,
                      |	БезналЗагрузка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаВозвратаДокументаОплаты,
                      |	БезналЗагрузка.Сумма КАК ОстатокДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыКасса,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	NULL КАК ТипОплаты,
                      |	NULL КАК ЭтоЭквайринг,
                      |	""НО"" КАК ТипДокументаОплаты,
                      |	БезналЗагрузка.КонтрагентИНН КАК КонтрагентИНН,
                      |	БезналЗагрузка.ТекстПлатежа КАК ТекстПлатежа
                      |ИЗ
                      |	РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ПО БезналЗагрузка.ГУИД = ВыпискаБанка.ГУИДЗагрузка
                      |ГДЕ
                      |	ВыпискаБанка.Ссылка ЕСТЬ NULL
                      |	И БезналЗагрузка.Отменено = ЛОЖЬ
                      |	И (БезналЗагрузка.ПолучательПлатежа = """"
                      |			ИЛИ БезналЗагрузка.ПолучательПлатежа = &ПолучательПлатежа)
                      |	И БезналЗагрузка.ДатаОплаты >= &ДатаНачала
                      |	И БезналЗагрузка.ДатаОплаты <= &ДатаОкончания");		

//ДатаНачала = '20200101';

Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ТекущаяДата();
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);							  

//                      |	ВЫБОР
//                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
//                      |			ТОГДА ВЫБОР
//                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
//                      |						ТОГДА 5
//                      |					ИНАЧЕ 4
//                      |				КОНЕЦ
//                      |		ИНАЧЕ 3
//                      |	КОНЕЦ КАК ТипОплаты,

Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);		
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	ЗначениеИНН = СписокКонтрагентыИИН_Эквайринг.НайтиПоЗначению(Строка.КонтрагентИНН);
	ЕстьВСписке = (ЗначениеИНН <> Неопределено);
	Если ЕстьВСписке Тогда
		Если СтрНайти(Строка.ТекстПлатежа,"СБП") > 0 Тогда
			НоваяСтрока.ТипОплаты = 5;
		Иначе	
			НоваяСтрока.ТипОплаты = 4;
		КонецЕсли;
		
		НоваяСтрока.ЭтоЭквайринг = Истина;
	Иначе
		НоваяСтрока.ТипОплаты = 3;
		
		НоваяСтрока.ЭтоЭквайринг = Ложь;
	КонецЕсли;
КонецЦикла;

ТЗ_НераспределенныеОплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_НераспределенныеОплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_НераспределенныеОплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга <= &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	//Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);
	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;
// - Нераспределенные оплаты

ТЗ_НераспределенныеОплаты.Сортировать("ДатаОплаты");

// + Нераспределенные оплаты
//Область = Макет.ПолучитьОбласть("ШапкаНераспределенныеОплатыДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ШапкаНераспределенныеОплатыДополнение");
ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаНераспределенныеОплаты Из ТЗ_НераспределенныеОплаты Цикл
	Область = Макет.ПолучитьОбласть("СтрокаНераспределенныеОплатыДополнение|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаНераспределенныеОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаНераспределенныеОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	Область.Параметры.СуммаОплаты = СтрокаНераспределенныеОплаты.СуммаОплаты;
	Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаНераспределенныеОплаты);
	
	Если СтрокаНераспределенныеОплаты.СуммаДокументаОплаты <> 0 Тогда
		Область.Параметры.СуммаОплаты_кк = Окр(СтрокаНераспределенныеОплаты.СуммаОплаты 
				* СтрокаНераспределенныеОплаты.СуммаДокументаОплатыКарта / СтрокаНераспределенныеОплаты.СуммаДокументаОплаты, 2);
		Область.Параметры.СуммаОплаты_Нал = Окр(СтрокаНераспределенныеОплаты.СуммаОплаты 
				* СтрокаНераспределенныеОплаты.СуммаДокументаОплатыНаличные / СтрокаНераспределенныеОплаты.СуммаДокументаОплаты, 2);
	КонецЕсли;
				
	Область.Параметры.ТипДокументаОплаты = СтрокаНераспределенныеОплаты.ТипДокументаОплаты;
	Область.Параметры.НомерДокументаОплаты = СтрокаНераспределенныеОплаты.НомерДокументаОплаты;
	//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаНераспределенныеОплаты.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
	Область.Параметры.ДатаДокументаОплаты = СтрокаНераспределенныеОплаты.ДатаДокументаОплаты;
	Область.Параметры.СуммаДокументаОплаты = СтрокаНераспределенныеОплаты.СуммаДокументаОплаты;
	Область.Параметры.СуммаВозвратаДокументаОплаты = СтрокаНераспределенныеОплаты.СуммаВозвратаДокументаОплаты;
	Область.Параметры.ОстатокДокументаОплаты = СтрокаНераспределенныеОплаты.ОстатокДокументаОплаты;
	
	//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаНераспределенныеОплаты);
	Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаНераспределенныеОплаты);
	
	Область.Параметры.СуммаДокументаОплаты_кк = СтрокаНераспределенныеОплаты.СуммаДокументаОплатыКарта;
	Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаНераспределенныеОплаты.СуммаДокументаОплатыНаличные;
	
	Область.Параметры.СуммаВозвратаДокументаОплаты_кк = СтрокаНераспределенныеОплаты.СуммаВозвратаДокументаОплатыКарта;
	Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаНераспределенныеОплаты.СуммаДокументаОплатыНаличные;
	
	Если ТипЗнч(СтрокаНераспределенныеОплаты.ДокументОплаты) = Тип("УникальныйИдентификатор") Тогда
		Область.Параметры.РасшифровкаДокументОплаты = "Нераспределенная выгрузка";
	Иначе	
		Область.Параметры.РасшифровкаДокументОплаты = СтрокаНераспределенныеОплаты.ДокументОплаты;
	КонецЕсли;
	
	ОбластьВывода = ПолеОтчета.Вывести(Область, 0);
	ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
	
	//Если СтрокаНераспределенныеОплаты.ОстатокДокументаОплаты > 0 Тогда
	//	ВыведеннаяОбласть.ЦветФона = Новый Цвет(235, 235, 235);		
	//КонецЕсли;
КонецЦикла;

Область = Макет.ПолучитьОбласть("ПодножиеНераспределенныеОплатыДополнение");
ПолеОтчета.Вывести(Область, 0);
// - Нераспределенные оплаты

Возврат ПолеОтчета;       
КонецФункции

Функция СформироватьВозвраты(Знач Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ЭтоОтчет) Экспорт
////

ПолеОтчета = Новый ТабличныйДокумент;

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	КассовыйДокумент.Номер КАК НомерДокументаОплаты,
                      |	КассовыйДокумент.Дата КАК ДатаДокументаОплаты,
                      |	КассовыйДокумент.ОтКого.Наименование КАК КонтрагентНаименование,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	""КД"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Возврат = ИСТИНА
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания");		

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		

ТЗ = Запрос.Выполнить().Выгрузить();	

ТЗ_Возвраты = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_Возвраты.Колонки.Найти("ДокументОплаты");
ТЗ_Возвраты.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_Возвраты.Колонки.Добавить("ДокументОплаты");

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_Возвраты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	ВыпискаБанка.ОтКого.Наименование КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	""ВБ"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Возврат = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания");		

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_Возвраты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;
//

ТЗ_Возвраты.Сортировать("ДатаОплаты");

//
//Область = Макет.ПолучитьОбласть("ШапкаВозвратыДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ШапкаВозвратыДополнение");
ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаВозвраты Из ТЗ_Возвраты Цикл
	Область = Макет.ПолучитьОбласть("СтрокаВозвратыДополнение|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
				
	Область.Параметры.ТипДокументаОплаты = СтрокаВозвраты.ТипДокументаОплаты;
	Область.Параметры.НомерДокументаОплаты = СтрокаВозвраты.НомерДокументаОплаты;
	//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаВозвраты.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
	Область.Параметры.ДатаДокументаОплаты = СтрокаВозвраты.ДатаДокументаОплаты;
	Область.Параметры.СуммаДокументаОплаты = СтрокаВозвраты.СуммаДокументаОплаты;
	
	//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаВозвраты);
	Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаВозвраты);
	
	Область.Параметры.СуммаДокументаОплаты_кк = СтрокаВозвраты.СуммаДокументаОплатыКарта;
	Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаВозвраты.СуммаДокументаОплатыНаличные;
	
	Область.Параметры.РасшифровкаДокументОплаты = СтрокаВозвраты.ДокументОплаты;
	
	ВыведеннаяОбласть = ПолеОтчета.Вывести(Область, 0);
КонецЦикла;          

//Область = Макет.ПолучитьОбласть("ПодножиеВозвратыДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ПодножиеВозвратыДополнение");
ПолеОтчета.Вывести(Область, 0);
// 

Возврат ПолеОтчета;       
КонецФункции
//

//
Функция СформироватьОплатыСчета(Знач Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ЭтоОтчет) Экспорт
ПолеОтчета = Новый ТабличныйДокумент;

ТЗ_РодительУслуги = ТЗ_УслугиРодитель();

Список_ОплатыКоворкингКассовыйДокумент = Список_ОплатыКоворкинг("КД");
Список_ОплатыКоворкингВыпискаБанка = Список_ОплатыКоворкинг("ВБ");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	0 КАК Порядок,
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КоворкингОплаты.Ссылка КАК Счет,
                      |	КоворкингОплаты.Ссылка.ДатаС КАК ДатаС,
                      |	КоворкингОплаты.Ссылка.КоворкингЗаявка.ПериодАренды КАК ПериодАренды,
                      |	ЕСТЬNULL(КоворкингОплаты.СуммаРаспределено, 0) КАК СуммаОплаты,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	КассовыйДокумент.Номер КАК НомерДокументаОплаты,
                      |	КассовыйДокумент.Дата КАК ДатаДокументаОплаты,
                      |	КассовыйДокумент.ОтКого.Наименование КАК КонтрагентНаименование,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	ЕСТЬNULL(Возвраты.СуммаКарта, 0) КАК СуммаВозвратаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.СуммаНаличные, 0) КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ДолгиОплатыСумма,
                      |	КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |			ТОГДА 8
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ЛОЖЬ КАК ЭтоЭквайринг,
                      |	""КД"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
                      |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КоворкингСчетаДокументыОплаты.Ссылка КАК Ссылка,
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                      |		ИЗ
                      |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                      |		ГДЕ
                      |			КоворкингСчетаДокументыОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КоворкингСчетаДокументыОплаты.Ссылка,
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты) КАК КоворкингОплаты
                      |		ПО КассовыйДокумент.Ссылка = КоворкингОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ДолгиОплаты
                      |		ПО КассовыйДокумент.Ссылка = ДолгиОплаты.Ссылка
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Приход = ИСТИНА
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания
					  |	И КассовыйДокумент.Ссылка В(&СписокКоворкинг)");		
					  
ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингКассовыйДокумент);

ТЗ = Запрос.Выполнить().Выгрузить();	

ТЗ_ОплатыБронь = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_ОплатыБронь.Колонки.Найти("ДокументОплаты");
ТЗ_ОплатыБронь.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_ОплатыБронь.Колонки.Добавить("ДокументОплаты");

КЧ = Новый КвалификаторыЧисла(10, 2);
Массив = Новый Массив;
Массив.Добавить(Тип("Число"));
ОписаниеТипов_Ч = Новый ОписаниеТипов(Массив, , ,КЧ);
ТЗ_ОплатыБронь.Колонки.Добавить("СуммаОплаты_кк", ОписаниеТипов_Ч);
ТЗ_ОплатыБронь.Колонки.Добавить("СуммаОплаты_Нал", ОписаниеТипов_Ч);

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если Строка.ТипОплаты = 1 Тогда
		НоваяСтрока.СуммаОплаты_кк = Строка.СуммаОплаты;
	ИначеЕсли Строка.ТипОплаты = 2 Тогда
		НоваяСтрока.СуммаОплаты_Нал = Строка.СуммаОплаты;
	Иначе
		Если Строка.СуммаДокументаОплаты <> 0 Тогда 
			НоваяСтрока.СуммаОплаты_кк = Окр(Строка.СуммаОплаты * (Строка.СуммаДокументаОплатыНаличные / Строка.СуммаДокументаОплаты), 2);
			НоваяСтрока.СуммаОплаты_Нал = Окр(Строка.СуммаОплаты * (Строка.СуммаДокументаОплатыКарта / Строка.СуммаДокументаОплаты), 2);
		КонецЕсли;
	КонецЕсли;                                    
КонецЦикла;
					  
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	0 КАК Порядок,
                      |	КоворкингОплаты.Ссылка КАК Счет,
                      |	КоворкингОплаты.Ссылка.ДатаС КАК ДатаС,
                      |	КоворкингОплаты.Ссылка.КоворкингЗаявка.ПериодАренды КАК ПериодАренды,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ЕСТЬNULL(КоворкингОплаты.СуммаРаспределено, 0) КАК СуммаОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	ВыпискаБанка.ОтКого.Наименование КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозвратаДокументаОплаты,
                      |	0 КАК СуммаВозвратаДокументаОплатыКарта,
                      |	0 КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ДолгиОплатыСумма,
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплаты.Сумма, 0) КАК ОстатокДокументаОплаты,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |			ТОГДА 8
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВыпискаБанка.ЭтоЭквайринг КАК ЭтоЭквайринг,
                      |	""ВБ"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КоворкингСчетаДокументыОплаты.Ссылка КАК Ссылка,
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                      |		ИЗ
                      |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                      |		ГДЕ
                      |			КоворкингСчетаДокументыОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КоворкингСчетаДокументыОплаты.Ссылка,
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты) КАК КоворкингОплаты
                      |		ПО ВыпискаБанка.Ссылка = КоворкингОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ДолгиОплаты
                      |		ПО ВыпискаБанка.Ссылка = ДолгиОплаты.Ссылка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Приход = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания
                      |	И ВыпискаБанка.Ссылка В(&СписокКоворкинг)");						  
ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингВыпискаБанка);

ТЗ = Запрос.Выполнить().Выгрузить();
	
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

СписокКонтрагентыИИН_Эквайринг = БезналРаспределениеСервер.СписокИННЭквайринг();
ПолучательПлатежа = Константы.ПолучательПлатежаБезнал.Получить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	0 КАК Порядок,
                      |	БезналЗагрузка.ГУИД КАК ДокументОплаты,
                      |	0 КАК СуммаОплаты,
                      |	БезналЗагрузка.ДатаОплаты КАК ДатаС,
                      |	БезналЗагрузка.ДатаОплаты КАК ДатаОплаты,
                      |	БезналЗагрузка.КонтрагентНаименование КАК КонтрагентНаименование,
                      |	БезналЗагрузка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	0 КАК СуммаВозвратаДокументаОплаты,
                      |	0 КАК СуммаВозвратаДокументаОплатыКарта,
                      |	0 КАК СуммаВозвратаДокументаОплатыНаличные,
                      |	БезналЗагрузка.Сумма КАК ОстатокДокументаОплаты,
                      |	""НО"" КАК ТипДокументаОплаты,
                      |	БезналЗагрузка.КонтрагентИНН КАК КонтрагентИНН,
                      |	БезналЗагрузка.ТекстПлатежа КАК ТекстПлатежа
                      |ИЗ
                      |	РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ПО БезналЗагрузка.ГУИД = ВыпискаБанка.ГУИДЗагрузка
                      |ГДЕ
                      |	ВыпискаБанка.Ссылка ЕСТЬ NULL
                      |	И БезналЗагрузка.Отменено = ЛОЖЬ
                      |	И (БезналЗагрузка.ПолучательПлатежа = """"
                      |			ИЛИ БезналЗагрузка.ПолучательПлатежа = &ПолучательПлатежа)
                      |	И БезналЗагрузка.ДатаОплаты >= &ДатаНачала
                      |	И БезналЗагрузка.ДатаОплаты <= &ДатаОкончания");		

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);		
ТЗ = Запрос.Выполнить().Выгрузить();

//                      |	ВЫБОР
//                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
//                      |			ТОГДА ВЫБОР
//                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
//                      |						ТОГДА 5
//                      |					ИНАЧЕ 4
//                      |				КОНЕЦ
//                      |		ИНАЧЕ 3
//                      |	КОНЕЦ КАК ТипОплаты,
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	ЗначениеИНН = СписокКонтрагентыИИН_Эквайринг.НайтиПоЗначению(Строка.КонтрагентИНН);
	ЕстьВСписке = (ЗначениеИНН <> Неопределено);
	Если ЕстьВСписке Тогда
		Если СтрНайти(Строка.ТекстПлатежа,"СБП") > 0 Тогда
			НоваяСтрока.ТипОплаты = 5;
		Иначе	
			НоваяСтрока.ТипОплаты = 4;
		КонецЕсли;
		
		НоваяСтрока.ЭтоЭквайринг = Истина;
	Иначе
		НоваяСтрока.ТипОплаты = 3;
		
		НоваяСтрока.ЭтоЭквайринг = Ложь;
	КонецЕсли;
КонецЦикла;

//ТЗ_ОплатыБронь.Колонки.Добавить("ПроцентЭквайринга");
//ТЗ_ОплатыБронь.Колонки.Добавить("ПроцентЭквайрингаСБП");
//Для Каждого Строка Из ТЗ_ОплатыБронь Цикл
//	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
//	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
//	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
//	                      |ИЗ
//	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
//	                      |ГДЕ
//	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга <= &ДатаУстановкиПроцентаЭквайринга
//	                      |
//	                      |УПОРЯДОЧИТЬ ПО
//	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

//	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДатаОплаты);

//	ТЗ = Запрос.Выполнить().Выгрузить();
//	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
//	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
//	
//	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
//	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
//КонецЦикла;
// - Оплаты 

Запрос =	Новый Запрос ("ВЫБРАТЬ
        	              |	1 КАК Порядок,
        	              |	КоворкингСчета.Ссылка КАК Счет,
        	              |	КоворкингСчета.ДатаС КАК ДатаС,
        	              |	КоворкингСчета.ДатаС КАК ДатаОплаты
        	              |ИЗ
        	              |	Документ.КоворкингСчета КАК КоворкингСчета
        	              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |			КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка КАК Ссылка
        	              |		ИЗ
        	              |			Документ.КоворкингСчета.РаспределениеОплатКоворкинг КАК КоворкингСчетаРаспределениеОплатКоворкинг
        	              |		
        	              |		СГРУППИРОВАТЬ ПО
        	              |			КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка) КАК РаспределениеОплат
        	              |		ПО КоворкингСчета.Ссылка = РаспределениеОплат.Ссылка
        	              |ГДЕ
        	              |	КоворкингСчета.ПометкаУдаления = ЛОЖЬ
        	              |	И КоворкингСчета.ДатаПо >= &ДатаОтчетаС
        	              |	И КоворкингСчета.ДатаС <= &ДатаОтчетаПо
        	              |	И РаспределениеОплат.Ссылка ЕСТЬ NULL
        	              |
        	              |УПОРЯДОЧИТЬ ПО
        	              |	Счет");
						  
						  
Запрос.УстановитьПараметр("ДатаОтчетаС", ДатаОтчетаС);
Запрос.УстановитьПараметр("ДатаОтчетаПо", ДатаОтчетаПо);	
//Запрос.УстановитьПараметр("ТипДатаС", ТипДатаС);
//Запрос.УстановитьПараметр("ТипДатаПо", ТипДатаПо);	

//Запрос.УстановитьПараметр("БронируетОтбор", БронируетОтбор);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	2 КАК Порядок,
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	КассовыйДокумент.ОтКого.Наименование КАК КонтрагентНаименование,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	""КД В"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Возврат = ИСТИНА
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания
                      |	И КассовыйДокумент.Ссылка В(&СписокКоворкинг)");					  	

					  //|	И НЕ КассовыйДокумент.Ссылка В (&СписокКоворкинг)");					  	

ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингКассовыйДокумент);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	2 КАК Порядок,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.ОтКого.Наименование КАК КонтрагентНаименование,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	""ВБ В"" КАК ТипДокументаОплаты
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Возврат = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания
					  |	И ВыпискаБанка.Ссылка В(&СписокКоворкинг)");	

					  //|	И НЕ ВыпискаБанка.Ссылка В (&СписокКоворкинг)


ДатаНачала = ДатаОтчетаС;
Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ДатаОтчетаПо;
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

Запрос.УстановитьПараметр("СписокКоворкинг", Список_ОплатыКоворкингВыпискаБанка);

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_ОплатыБронь.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

ТЗ_ОплатыБронь.Сортировать("ДатаОплаты, Порядок, ДокументОплаты, Счет");

ТЗ_ОплатыБронь.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_ОплатыБронь.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_ОплатыБронь Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга <= &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;

// + Оплаты Бронь
//Область = Макет.ПолучитьОбласть("ШапкаОплатыДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ШапкаОплатыДополнение");
ПолеОтчета.Вывести(Область, 0);

ТЗ_Оплаты = ТЗ_ОплатыБронь.СкопироватьКолонки();

ДокументОплаты_Предыдущий = Неопределено;
Для Каждого Строка Из ТЗ_ОплатыБронь Цикл 
	Если Строка.ДокументОплаты = ДокументОплаты_Предыдущий Тогда Продолжить; КонецЕсли;
	
	ДокументОплаты_Предыдущий = Строка.ДокументОплаты;
	
	НоваяСтрока = ТЗ_Оплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

//
Итоги = Новый Структура();

Итоги.Вставить("СуммаСчета", 0);
Итоги.Вставить("Сумма", 0);
Итоги.Вставить("СуммаЧистая", 0);

Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаОплаты_кк", 0);
Итоги.Вставить("СуммаОплаты_Нал", 0);

Итоги.Вставить("СуммаЭквайринга", 0);

Итоги.Вставить("СуммаДокументаОплаты", 0);
Итоги.Вставить("СуммаДокументаОплаты_кк", 0);
Итоги.Вставить("СуммаДокументаОплаты_Нал", 0);

Итоги.Вставить("СуммаВозвратаДокументаОплаты", 0);
Итоги.Вставить("СуммаВозвратаДокументаОплаты_кк", 0);
Итоги.Вставить("СуммаВозвратаДокументаОплаты_Нал", 0);

Итоги.Вставить("ОстатокДокументаОплаты", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);
//

//
ИтогиДень = Новый Структура();
//ИтогиДень.Вставить("КоличествоНочей", 0);

ИтогиДень.Вставить("СуммаСчета", 0);
ИтогиДень.Вставить("Сумма", 0);
ИтогиДень.Вставить("СуммаЧистая", 0);

ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаОплаты_кк", 0);
ИтогиДень.Вставить("СуммаОплаты_Нал", 0);

ИтогиДень.Вставить("СуммаЭквайринга", 0);

ИтогиДень.Вставить("СуммаДокументаОплаты", 0);
ИтогиДень.Вставить("СуммаДокументаОплаты_кк", 0);
ИтогиДень.Вставить("СуммаДокументаОплаты_Нал", 0);

ИтогиДень.Вставить("СуммаВозвратаДокументаОплаты", 0);
ИтогиДень.Вставить("СуммаВозвратаДокументаОплаты_кк", 0);
ИтогиДень.Вставить("СуммаВозвратаДокументаОплаты_Нал", 0);

ИтогиДень.Вставить("ОстатокДокументаОплаты", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);
//

ПолеОтчета.НачатьАвтогруппировкуСтрок();

ПредыдущийДень = '00010101';

Для Каждого СтрокаОплатыБронь Из ТЗ_Оплаты Цикл
	//
	Если ПредыдущийДень <> СтрокаОплатыБронь.ДатаОплаты Тогда
		Если ПредыдущийДень <> '00010101' Тогда     
			ИтогиДеньОплаты(Макет, ПолеОтчета, ПредыдущийДень, ИтогиДень, Итоги);
		КонецЕсли;
		
		Область = Макет.ПолучитьОбласть("ЗаголовокСтрокаДополнение|КолонкиЛево");
		Область.Параметры.Дата = Формат(СтрокаОплатыБронь.ДатаОплаты, "ДФ=dd.MM.yy");
		ПолеОтчета.Вывести(Область, 0);
		
		ПредыдущийДень = СтрокаОплатыБронь.ДатаОплаты;
	КонецЕсли;
	
	Если СтрокаОплатыБронь.Порядок = 1 Тогда Перейти ~НЕОПЛАЧЕННЫЕ_СЧЕТА; КонецЕсли;
	Если СтрокаОплатыБронь.Порядок = 2 Тогда Перейти ~ВОЗВРАТЫ; КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("СтрокаОплатыДополнение|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
	
	ОтборСтроки = Новый Структура("ДокументОплаты", СтрокаОплатыБронь.ДокументОплаты); 
	ТЗ_ОплатыСчет = ТЗ_ОплатыБронь.Скопировать(ОтборСтроки);
	
	//Если ТипЗнч(СтрокаОплатыБронь.ДокументОплаты) <> Тип("УникальныйИдентификатор") Тогда
	//	Если СтрокаОплатыБронь.ДокументОплаты.Номер = "000004096" Тогда
	//		ш = 1;
	//	КонецЕсли;	
	//КонецЕсли;	
	
	ДокументОплатыОбластьЗаполнить(СтрокаОплатыБронь, Область, ИтогиДень); 
	
	Если ТЗ_ОплатыСчет.Количество() = 1 Тогда
		
		ОплатаОбластьЗаполнить(СтрокаОплатыБронь, Область, ИтогиДень);
		
		Если ЗначениеЗаполнено(СтрокаОплатыБронь.Счет) Тогда
	
			Область.Параметры.Дата = Формат(СтрокаОплатыБронь.ДатаС, "ДФ=dd.MM.yy");
			
			СчетОбластьЗаполнить(СтрокаОплатыБронь.Счет, Область, ИтогиДень);
			
			ОластьВывода = ПолеОтчета.Вывести(Область, 1);
			
			ИмяОбластьУслуги = "СтрокаОплатыДополнение";
	        ОбластьВывода = УслугиОбластьВывести(СтрокаОплатыБронь.Счет, ТЗ_РодительУслуги, ИмяОбластьУслуги, Макет, ПолеОтчета, ИтогиДень); 
			
		Иначе
			ОбластьВывода = ПолеОтчета.Вывести(Область, 1);
		КонецЕсли;
	Иначе
		
		Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплатыБронь.ТипОплаты);
		Область.Параметры.ДатаОплаты = Формат(СтрокаОплатыБронь.ДатаОплаты, "ДФ=dd.MM.yy");
		
		СтрокаОплатыБронь.СуммаОплаты = ТЗ_ОплатыСчет.Итог("СуммаОплаты");
		Область.Параметры.СуммаОплаты = СтрокаОплатыБронь.СуммаОплаты;
		Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплатыБронь);
		
		Область.Параметры.Номер = "";
		Область.Параметры.РасшифровкаНомер = "";
	
		Область.Параметры.НомерСчета = "";
		Область.Параметры.ДатаСчета = "";
		
		Область.Параметры.РасшифровкаСчет = "";
		
		ОбластьВывода = ПолеОтчета.Вывести(Область, 1);
	КонецЕсли;
	
	ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
		
	Если СтрокаОплатыБронь.Счет = Null Тогда
		ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);
	КонецЕсли;
	
	//Если ТЗ_ОплатыЗаявка.Количество() = 1 Тогда
		Если СтрокаОплатыБронь.ОстатокДокументаОплаты > 0 Тогда
			ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);		
		КонецЕсли;
	//КонецЕсли;
	
	Если ТЗ_ОплатыСчет.Количество() > 1 Тогда
		Для Каждого СтрокаОплатыСчет Из ТЗ_ОплатыСчет Цикл
			Область_ОплатыСчет = Макет.ПолучитьОбласть("СтрокаОплатыСчетДополнение|КолонкиЛево");
			
			Область_ОплатыСчет.Параметры.Дата = ".";
			
			Область_ОплатыСчет.Параметры.ТипДокументаОплаты = "";
			Область_ОплатыСчет.Параметры.НомерДокументаОплаты = "";
			Область_ОплатыСчет.Параметры.ДатаДокументаОплаты = "";
			Область_ОплатыСчет.Параметры.СуммаДокументаОплаты = "";
			Область_ОплатыСчет.Параметры.СуммаВозвратаДокументаОплаты = "";
			
			Область_ОплатыСчет.Параметры.Оплатил = "";
			
			Область_ОплатыСчет.Параметры.РасшифровкаДокументОплаты = "";
			
			Область_ОплатыСчет.Параметры.Дата = Формат(СтрокаОплатыСчет.ДатаС, "ДФ=dd.MM.yy");
			СчетОбластьЗаполнить(СтрокаОплатыСчет.Счет, Область_ОплатыСчет, ИтогиДень);	
			
			ОплатаОбластьЗаполнить(СтрокаОплатыСчет, Область_ОплатыСчет, ИтогиДень);
			
			ПолеОтчета.Вывести(Область_ОплатыСчет, 1);

			ИмяОбластьУслуги = "СтрокаОплатыСчетДополнение";
	        ОбластьВывода = УслугиОбластьВывести(СтрокаОплатыСчет.Счет, ТЗ_РодительУслуги, ИмяОбластьУслуги, Макет, ПолеОтчета, ИтогиДень); 
			
			ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
			
			Если СтрокаОплатыСчет.ОстатокДокументаОплаты > 0 Тогда
				ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Продолжить;
	
~НЕОПЛАЧЕННЫЕ_СЧЕТА:	
	Область = Макет.ПолучитьОбласть("СтрокаОплатыНеоплаченныеСчетаДополнение|КолонкиЛево");
	
	Область.Параметры.ТипДокументаОплаты = "";
	Область.Параметры.НомерДокументаОплаты = "";
	Область.Параметры.ДатаДокументаОплаты = "";
	Область.Параметры.СуммаДокументаОплаты = "";
	Область.Параметры.СуммаВозвратаДокументаОплаты = "";
	Область.Параметры.ОстатокДокументаОплаты = "";
	
	Область.Параметры.Оплатил = "";
	
	Область.Параметры.ТипОплаты = "";
	Область.Параметры.ДатаОплаты = "";
	Область.Параметры.СуммаОплаты = "";
	Область.Параметры.СуммаЭквайринга = "";
	
	Область.Параметры.Дата = Формат(СтрокаОплатыБронь.ДатаС, "ДФ=dd.MM.yy");
	
	СчетОбластьЗаполнить(СтрокаОплатыБронь.Счет, Область, ИтогиДень);			
	ВыведеннаяОбласть = ПолеОтчета.Вывести(Область, 1);

	ИмяОбластьУслуги = "СтрокаОплатыНеоплаченныеСчетаДополнение";
    УслугиОбласть = УслугиОбластьВывести(СтрокаОплатыБронь.Счет, ТЗ_РодительУслуги, ИмяОбластьУслуги, Макет, ПолеОтчета, ИтогиДень); 
	ВыведеннаяОбласть = ПолеОтчета.Область(УслугиОбласть.Верх, , УслугиОбласть.Низ);
	
	Продолжить;
	
~ВОЗВРАТЫ:
	Область_Возврат = Макет.ПолучитьОбласть("СтрокаОплатыВозвратДополнение|КолонкиЛево");
	
	// + Очистка Параметров
	Область_Возврат.Параметры.Дата = ".";
	
	Область_Возврат.Параметры.ТипОплаты = "";
	Область_Возврат.Параметры.ДатаОплаты = "";
	Область_Возврат.Параметры.СуммаОплаты = "";
	// - Очистка Параметров
	
	Область_Возврат.Параметры.ТипДокументаОплаты = СтрокаОплатыБронь.ТипДокументаОплаты;
	Область_Возврат.Параметры.НомерДокументаОплаты = СтрокаОплатыБронь.ДокументОплаты.Номер;
	//Область_Возврат.Параметры.ДатаДокументаОплаты = Формат(СтрокаОплатыБронь.ДокументОплаты.Дата, "ДФ=dd.MM.yy");
	Область_Возврат.Параметры.ДатаДокументаОплаты = СтрокаОплатыБронь.ДокументОплаты.Дата;
	Область_Возврат.Параметры.СуммаВозвратаДокументаОплаты = СтрокаОплатыБронь.СуммаДокументаОплаты;
	Область_Возврат.Параметры.СуммаВозвратаДокументаОплаты_кк = СтрокаОплатыБронь.СуммаДокументаОплатыКарта;
	Область_Возврат.Параметры.СуммаВозвратаДокументаОплаты_Нал = СтрокаОплатыБронь.СуммаДокументаОплатыНаличные;
	
	Область_Возврат.Параметры.РасшифровкаДокументОплаты = СтрокаОплатыБронь.ДокументОплаты;


	ИтогиДень.СуммаВозвратаДокументаОплаты = ИтогиДень.СуммаВозвратаДокументаОплаты + СтрокаОплатыБронь.СуммаДокументаОплаты;
	ИтогиДень.СуммаВозвратаДокументаОплаты_кк = ИтогиДень.СуммаВозвратаДокументаОплаты_кк + СтрокаОплатыБронь.СуммаДокументаОплатыКарта;
	ИтогиДень.СуммаВозвратаДокументаОплаты_Нал = ИтогиДень.СуммаВозвратаДокументаОплаты_Нал + СтрокаОплатыБронь.СуммаДокументаОплатыНаличные;
	
	ПолеОтчета.Вывести(Область_Возврат, 1);
	
	Продолжить;
КонецЦикла;

ИтогиДеньОплаты(Макет, ПолеОтчета, ПредыдущийДень, ИтогиДень, Итоги);

//
Область = Макет.ПолучитьОбласть("ИтогиДополнение|КолонкиЛево");

Область.Параметры.ИтогиДаты = "Период с " + Формат(ДатаОтчетаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаОтчетаПо, "ДФ=dd.MM.yy");

//Область.Параметры.Номер = "Итого Ночей:";
//Область.Параметры.КатегорияНомера = Итоги.КоличествоНочей;

Область.Параметры.СуммаОплаты = Итоги.СуммаОплаты;
Область.Параметры.СуммаОплаты_кк = Итоги.СуммаОплаты_кк;
Область.Параметры.СуммаОплаты_Нал = Итоги.СуммаОплаты_Нал;

Область.Параметры.СуммаДокументаОплаты = Итоги.СуммаДокументаОплаты;
Область.Параметры.СуммаДокументаОплаты_кк = Итоги.СуммаДокументаОплаты_кк;
Область.Параметры.СуммаДокументаОплаты_Нал = Итоги.СуммаДокументаОплаты_Нал;

Область.Параметры.СуммаВозвратаДокументаОплаты = Итоги.СуммаВозвратаДокументаОплаты;
Область.Параметры.СуммаВозвратаДокументаОплаты_кк = Итоги.СуммаВозвратаДокументаОплаты_кк;
Область.Параметры.СуммаВозвратаДокументаОплаты_Нал = Итоги.СуммаВозвратаДокументаОплаты_Нал;

Область.Параметры.ОстатокДокументаОплаты = Итоги.ОстатокДокументаОплаты;

Область.Параметры.СуммаЭквайринга = Итоги.СуммаЭквайринга;

ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из Итоги.УслугиИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДополнение|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 0);
КонецЦикла;
//

ПолеОтчета.ЗакончитьАвтогруппировкуСтрок(); 

//Область = Макет.ПолучитьОбласть("ИтогиДополнение|КолонкиЛево");
Область = Макет.ПолучитьОбласть("ИтогиДополнение");
ПолеОтчета.Вывести(Область, 0);


Возврат ПолеОтчета;       
КонецФункции

Процедура ИтогиДеньОплаты(Макет, ПолеОтчета, ПредыдущийДень, ИтогиДень, Итоги)
Область = Макет.ПолучитьОбласть("ИтогиДеньДополнение|КолонкиЛево");

Область.Параметры.Дата = Формат(ПредыдущийДень, "ДФ=dd.MM.yy");

Месяц = Формат(ПредыдущийДень, "ДФ='МММ гг'" );  
Область.Параметры.Месяц = Месяц;		

ДеньНедели = Формат(ПредыдущийДень, "ДФ=дддд");   
Область.Параметры.ДеньНедели = ДеньНедели;

Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
Область.Параметры.СуммаОплаты_кк = ИтогиДень.СуммаОплаты_кк;
Область.Параметры.СуммаОплаты_Нал = ИтогиДень.СуммаОплаты_Нал;
Область.Параметры.СуммаЧистая = ИтогиДень.СуммаЧистая;

Область.Параметры.СуммаДокументаОплаты = ИтогиДень.СуммаДокументаОплаты;
Область.Параметры.СуммаДокументаОплаты_кк = ИтогиДень.СуммаДокументаОплаты_кк;
Область.Параметры.СуммаДокументаОплаты_Нал = ИтогиДень.СуммаДокументаОплаты_Нал;

Область.Параметры.СуммаВозвратаДокументаОплаты = ИтогиДень.СуммаВозвратаДокументаОплаты;
Область.Параметры.СуммаВозвратаДокументаОплаты_кк = ИтогиДень.СуммаВозвратаДокументаОплаты_кк;
Область.Параметры.СуммаВозвратаДокументаОплаты_Нал = ИтогиДень.СуммаВозвратаДокументаОплаты_Нал;

Область.Параметры.ОстатокДокументаОплаты = ИтогиДень.ОстатокДокументаОплаты;

ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДеньДополнение|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 0);
КонецЦикла;

//
Итоги.СуммаОплаты = Итоги.СуммаОплаты + ИтогиДень.СуммаОплаты;

Итоги.СуммаОплаты_кк = Итоги.СуммаОплаты_кк + ИтогиДень.СуммаОплаты_кк;
Итоги.СуммаОплаты_Нал = Итоги.СуммаОплаты_Нал + ИтогиДень.СуммаОплаты_Нал;

Итоги.СуммаДокументаОплаты = Итоги.СуммаДокументаОплаты + ИтогиДень.СуммаДокументаОплаты;
Итоги.СуммаДокументаОплаты_кк = Итоги.СуммаДокументаОплаты_кк + ИтогиДень.СуммаДокументаОплаты_кк;
Итоги.СуммаДокументаОплаты_Нал = Итоги.СуммаДокументаОплаты_Нал + ИтогиДень.СуммаДокументаОплаты_Нал;

Итоги.СуммаВозвратаДокументаОплаты = Итоги.СуммаВозвратаДокументаОплаты + ИтогиДень.СуммаВозвратаДокументаОплаты;
Итоги.СуммаВозвратаДокументаОплаты_кк = Итоги.СуммаВозвратаДокументаОплаты_кк + ИтогиДень.СуммаВозвратаДокументаОплаты_кк;
Итоги.СуммаВозвратаДокументаОплаты_Нал = Итоги.СуммаВозвратаДокументаОплаты_Нал + ИтогиДень.СуммаВозвратаДокументаОплаты_Нал;

Итоги.ОстатокДокументаОплаты = Итоги.ОстатокДокументаОплаты + ИтогиДень.ОстатокДокументаОплаты;

Итоги.СуммаЭквайринга = Итоги.СуммаЭквайринга + ИтогиДень.СуммаЭквайринга;  
Итоги.СуммаЧистая = Итоги.СуммаЧистая + ИтогиДень.СуммаЧистая;  

Для Индекс = 0 По Итоги.УслугиИтоги.Количество() - 1 Цикл
	Итоги.УслугиИтоги[Индекс].СуммаУслуги = Итоги.УслугиИтоги[Индекс].СуммаУслуги 
		+ ИтогиДень.УслугиДеньИтоги[Индекс].СуммаУслуги;		
КонецЦикла;
//

ИтогиДень.СуммаОплаты = 0;
ИтогиДень.СуммаОплаты_кк = 0;
ИтогиДень.СуммаОплаты_Нал = 0;
ИтогиДень.СуммаЭквайринга = 0;
ИтогиДень.СуммаЧистая = 0;

ИтогиДень.СуммаДокументаОплаты = 0;
ИтогиДень.СуммаДокументаОплаты_кк = 0;
ИтогиДень.СуммаДокументаОплаты_Нал = 0;

ИтогиДень.СуммаДокументаОплаты = 0;
ИтогиДень.СуммаДокументаОплаты_кк = 0;
ИтогиДень.СуммаДокументаОплаты_Нал = 0;

ИтогиДень.СуммаВозвратаДокументаОплаты = 0;
ИтогиДень.СуммаВозвратаДокументаОплаты_кк = 0;
ИтогиДень.СуммаВозвратаДокументаОплаты_Нал = 0;

ИтогиДень.ОстатокДокументаОплаты = 0;

УслугиДеньИтоги = ИтогиДень.УслугиДеньИтоги;
Для Каждого Строка Из ИтогиДень.УслугиДеньИтоги Цикл
	Строка.СуммаУслуги = 0;	
КонецЦикла;

КонецПроцедуры	

Процедура ДокументОплатыОбластьЗаполнить(СтрокаОплаты, Область, ИтогиДень)
Область.Параметры.ТипДокументаОплаты = СтрокаОплаты.ТипДокументаОплаты;
Область.Параметры.НомерДокументаОплаты = СтрокаОплаты.НомерДокументаОплаты;
//Область.Параметры.ДатаДокументаОплаты = Формат(СтрокаОплаты.ДатаДокументаОплаты, "ДФ=dd.MM.yy");
Область.Параметры.ДатаДокументаОплаты = СтрокаОплаты.ДатаДокументаОплаты;

Область.Параметры.СуммаДокументаОплаты = СтрокаОплаты.СуммаДокументаОплаты;
Область.Параметры.СуммаДокументаОплаты_кк = СтрокаОплаты.СуммаДокументаОплатыКарта;
Область.Параметры.СуммаДокументаОплаты_Нал = СтрокаОплаты.СуммаДокументаОплатыНаличные;

Область.Параметры.СуммаВозвратаДокументаОплаты = СтрокаОплаты.СуммаВозвратаДокументаОплаты;
Область.Параметры.СуммаВозвратаДокументаОплаты_кк = СтрокаОплаты.СуммаВозвратаДокументаОплатыКарта;
Область.Параметры.СуммаВозвратаДокументаОплаты_Нал = СтрокаОплаты.СуммаВозвратаДокументаОплатыНаличные;

Область.Параметры.ОстатокДокументаОплаты = СтрокаОплаты.ОстатокДокументаОплаты;

//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаОплаты);
Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплаты);

Если ИтогиДень <> Неопределено Тогда
	ИтогиДень.СуммаДокументаОплаты = ИтогиДень.СуммаДокументаОплаты + СтрокаОплаты.СуммаДокументаОплаты;
	ИтогиДень.СуммаДокументаОплаты_кк = ИтогиДень.СуммаДокументаОплаты_кк + СтрокаОплаты.СуммаДокументаОплатыКарта;
	ИтогиДень.СуммаДокументаОплаты_Нал = ИтогиДень.СуммаДокументаОплаты_Нал + СтрокаОплаты.СуммаДокументаОплатыНаличные;

	ИтогиДень.СуммаВозвратаДокументаОплаты = ИтогиДень.СуммаВозвратаДокументаОплаты + СтрокаОплаты.СуммаВозвратаДокументаОплаты;
	ИтогиДень.СуммаВозвратаДокументаОплаты_кк = ИтогиДень.СуммаВозвратаДокументаОплаты_кк + СтрокаОплаты.СуммаВозвратаДокументаОплатыКарта;
	ИтогиДень.СуммаВозвратаДокументаОплаты_Нал = ИтогиДень.СуммаВозвратаДокументаОплаты_Нал + СтрокаОплаты.СуммаВозвратаДокументаОплатыНаличные;
	
	ИтогиДень.ОстатокДокументаОплаты = ИтогиДень.ОстатокДокументаОплаты + СтрокаОплаты.ОстатокДокументаОплаты;
КонецЕсли;
КонецПроцедуры

Процедура ОплатаОбластьЗаполнить(СтрокаОплаты, Область, ИтогиДень)
Если ТипЗнч(СтрокаОплаты.ДокументОплаты) = Тип("УникальныйИдентификатор") Тогда	
	Область.Параметры.РасшифровкаДокументОплаты = "Нераспределенная выгрузка";
Иначе	
	Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
КонецЕсли;

Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yy");

СуммаОплаты = СтрокаОплаты.СуммаОплаты;
Область.Параметры.СуммаОплаты = СуммаОплаты;

СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;

Если СтрокаОплаты.СуммаДокументаОплаты <> 0 Тогда
	Область.Параметры.СуммаОплаты_кк = Окр(СтрокаОплаты.СуммаОплаты 
		* СтрокаОплаты.СуммаДокументаОплатыКарта / СтрокаОплаты.СуммаДокументаОплаты, 2);
	Область.Параметры.СуммаОплаты_Нал = Окр(СтрокаОплаты.СуммаДокументаОплаты 
		* СтрокаОплаты.СуммаДокументаОплатыНаличные / СтрокаОплаты.СуммаДокументаОплаты, 2);
КонецЕсли;

//
Если ИтогиДень <> Неопределено Тогда
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;

	ИтогиДень.СуммаОплаты_кк = ИтогиДень.СуммаОплаты_кк + СтрокаОплаты.СуммаОплаты_кк;
	ИтогиДень.СуммаОплаты_Нал = ИтогиДень.СуммаОплаты_Нал + СтрокаОплаты.СуммаОплаты_Нал;

	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
КонецЕсли;	
//

КонецПроцедуры

Процедура СчетОбластьЗаполнить(Счет, Область, ИтогиДень)
Область.Параметры.Номер = Счет.КоворкингЗаявка.КоворкингНомер;
Область.Параметры.РасшифровкаНомер = Счет;

Область.Параметры.НомерСчета = Счет.Номер;
Область.Параметры.ДатаСчета = Счет.Дата;

Область.Параметры.ПериодАренды = Счет.КоворкингЗаявка.ПериодАренды;

//ЗаявкаЗакрыта = Заявка.Закрыто;
//Если ЗаявкаЗакрыта Тогда
//	Область.Параметры.ДатаЗакрытияЗаявки = Формат(Заявка.ДатаЗакрытия, "ДФ=dd.MM.yy");
//КонецЕсли;

Область.Параметры.РасшифровкаСчет = Счет;  

Область.Параметры.СуммаСчета = Счет.Сумма; 

Область.Параметры.Цена = Счет.Цена; 
Область.Параметры.Сумма = Счет.Сумма; 
Область.Параметры.КоличествоЕдиниц = Счет.КоличествоЕдиниц;
Область.Параметры.Количество = Счет.Количество;

ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыСчет(Счет);		    
СуммаЭквайрингаСчет = ОтчетыСервер.СуммаЭквайрингаСчет(Счет, ТЗ_Оплаты);

СуммаЧистая = Счет.Сумма - СуммаЭквайрингаСчет;
Если СуммаЧистая <> 0 Тогда Область.Параметры.СуммаЧистая = СуммаЧистая; КонецЕсли;

//                                             
Если ИтогиДень <> Неопределено Тогда
	ИтогиДень.СуммаСчета = ИтогиДень.СуммаСчета + Счет.Сумма;
	ИтогиДень.Сумма = ИтогиДень.Сумма + Счет.Сумма;
КонецЕсли;		
//
КонецПроцедуры

Функция УслугиОбластьВывести(Счет, ТЗ_РодительУслуги, ИмяОбласти, Макет, ПолеОтчета, ИтогиДень) 
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка КАК Ссылка,
                      |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК Услуга,
                      |	СУММА(КоворкингСчетаДопУслугиКоворкинг.Цена * КоворкингСчетаДопУслугиКоворкинг.Количество) КАК Сумма
                      |ИЗ
                      |	Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                      |ГДЕ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка = &Счет
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка,
                      |	КоворкингСчетаДопУслугиКоворкинг.Услуга");
Запрос.УстановитьПараметр("Счет", Счет); 

ТЗ_Услуги = Запрос.Выполнить().Выгрузить();

Если ТЗ_Услуги.Количество() > 0 Тогда
	ш =1;
КонецЕсли;	

ТЗ_УслугиИтого = ТЗ_Услуги.Скопировать();
ТЗ_УслугиИтого.Колонки.Добавить("УслугаРодитель");
Для Каждого Строка Из ТЗ_УслугиИтого Цикл 
	Результат = Справочники.КоворкингУслуги.ПустаяСсылка();
	Ссылка = Строка.Услуга; 
	ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
	
	Строка.УслугаРодитель = Результат;	
КонецЦикла;	
ТЗ_УслугиИтого.Свернуть("УслугаРодитель", "Сумма");

Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
	ЕстьСтрока = Ложь;
	Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
		Если СтрокаУслугиИтого.УслугаРодитель = СтрокаРодительУслуги.Папка Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
	КонецЦикла;
	
	Область_П = Макет.ПолучитьОбласть(ИмяОбласти + "|КолонкаУслуги");
	Если ЕстьСтрока Тогда
		Если СтрокаУслугиИтого.Сумма <> 0 Тогда
			Область_П.Параметры.СуммаУслуги = СтрокаУслугиИтого.Сумма;
		КонецЕсли;	
	КонецЕсли;
	
	ВыведеннаяОбласть = ПолеОтчета.Присоединить(Область_П, 1);
КонецЦикла;

Если ИтогиДень <> Неопределено Тогда
	Для Каждого СтрокаУслугиДеньИтого Из ИтогиДень.УслугиДеньИтоги Цикл 
		ЕстьСтрока = Ложь;
		Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
			Если СтрокаУслугиИтого.УслугаРодитель = СтрокаУслугиДеньИтого.УслугаРодитель Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
		КонецЦикла;
		
		Если ЕстьСтрока Тогда 
			Если СтрокаУслугиИтого.Сумма <> 0 Тогда
				СтрокаУслугиДеньИтого.СуммаУслуги = СтрокаУслугиДеньИтого.СуммаУслуги + СтрокаУслугиИтого.Сумма;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецЕсли;

Возврат ВыведеннаяОбласть;
КонецФункции

//
Функция СформироватьОтчетОплатыНаСервере(Макет, ДатаОплатыОтбор, ФормаОплатыОтбор, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();
ПолеОтчета = Новый ТабличныйДокумент;      

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингУслуги.Ссылка КАК Папка,
                      |	КоворкингУслуги.НомерПП КАК НомерПП,
                      |	КоворкингУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты
                      |ИЗ
                      |	Справочник.КоворкингУслуги КАК КоворкингУслуги
                      |ГДЕ
                      |	КоворкингУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингУслуги.ЭтоГруппа = ИСТИНА
                      |	И КоворкингУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.КоворкингУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.КоворкингУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;
Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Папка) Тогда		
		//Область.Параметры.ШапкаДопУслуги = Строка.Папка;
		Если ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			ЗаголовокОтчета = Строка.ЗаголовокОтчеты;
		Иначе
			ЗаголовокОтчета = Строка.Папка;
		КонецЕсли;
		
		Область.Параметры.ШапкаДопУслуги = ЗаголовокОтчета;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область, 0);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

//Область = Макет.ПолучитьОбласть("Шапка|КолонкиПраво");
//ПолеОтчета.Присоединить(Область);

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

//Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
//КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 2;  // - 2 расшифровки

//Область = Макет.ПолучитьОбласть("Строка|КолонкиПраво");
//КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 1 ; // - 1 расшифровки

//КоличествоКолонок = КоличествоКолонок - 2;

ПолеОтчета.ФиксацияСверху = 1;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

//Для ш = 1 По 100 Цикл
//	Область = Макет.ПолучитьОбласть("Строка");	
//	Область.Параметры.Дата = ш;
//	
//	ПолеОтчета.Вывести(Область);
//КонецЦикла;

//
Итоги = Новый Структура();
Итоги.Вставить("Количество", 0);
//Итоги.Вставить("Цена", 0);
Итоги.Вставить("Сумма", 0);
Итоги.Вставить("СуммаЧистая", 0);
Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаЭквайринга", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);

ИтогиДень = Новый Структура();
ИтогиДень.Вставить("Количество", 0);
//ИтогиДень.Вставить("Цена", 0);
ИтогиДень.Вставить("Сумма", 0);
ИтогиДень.Вставить("СуммаЧистая", 0);
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка КАК Счет,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты КАК ДокументОплаты,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ЭтоУслуга КАК ЭтоУслуга,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ГУИДДолги КАК ГУИДДолги,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.СуммаОплаты КАК СуммаОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.Сумма
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументОплатыКасса,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ВЫБОР
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Взаимозачет)
                      |						ТОГДА 9
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                      |						ТОГДА 10
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)
                      |						ТОГДА 11
                      |					КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                      |						ТОГДА 12
                      |					ИНАЧЕ 10
                      |				КОНЕЦ
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |					ТОГДА ВЫБОР
                      |							КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |								ТОГДА ВЫБОР
                      |										КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |											ТОГДА 5
                      |										ИНАЧЕ 4
                      |									КОНЕЦ
                      |							ИНАЧЕ 3
                      |						КОНЕЦ
                      |				ИНАЧЕ ВЫБОР
                      |						КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные = 0
                      |								И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта > 0
                      |							ТОГДА 1
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные > 0
                      |										И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта = 0
                      |									ТОГДА 2
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК ЭтоЭквайринг,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.Сумма КАК СуммаДокументаОплаты,
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
                      |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
                      |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК ДопУслугиУслуга
                      |ИЗ
                      |	Документ.КоворкингСчета.РаспределениеОплатКоворкинг КАК КоворкингСчетаРаспределениеОплатКоворкинг
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                      |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка = КоворкингСчетаДопУслугиКоворкинг.Ссылка
                      |			И КоворкингСчетаРаспределениеОплатКоворкинг.ГУИДДолги = КоворкингСчетаДопУслугиКоворкинг.ГУИД
                      |ГДЕ
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка.Проведен = ИСТИНА
                      |	И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты.ДатаОплаты = &ДатаОплаты
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка,
                      |	ДатаУслуги,
                      |	ДокументОплатыДатаОплаты,
                      |	ДокументОплаты");

Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплатыОтбор);
ТЗ_ВсеОплаты = Запрос.Выполнить().Выгрузить();	

ТЗ_ВсеОплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_ВсеОплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_ВсеОплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 	
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
	
	Строка.СуммаОплаты = Окр(Строка.СуммаОплаты, 2);
КонецЦикла;

ТЗ_Счета = ТЗ_ВсеОплаты.Скопировать(,"Счет");
ТЗ_Счета.Свернуть("Счет");

СчетаСписок = Новый СписокЗначений;
Для Каждого Строка Из ТЗ_Счета Цикл
	СчетаСписок.Добавить(Строка.Счет);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка КАК Ссылка,
                      |	КоворкингСчетаДопУслугиКоворкинг.НомерСтроки КАК НомерСтроки,
                      |	КоворкингСчетаДопУслугиКоворкинг.ГУИД КАК ГУИД,
                      |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
                      |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК Услуга,
                      |	КоворкингСчетаДопУслугиКоворкинг.Цена КАК Цена,
                      |	КоворкингСчетаДопУслугиКоворкинг.Количество КАК Количество,
                      |	КоворкингСчетаДопУслугиКоворкинг.Сумма КАК Сумма,
                      |	КоворкингСчетаДопУслугиКоворкинг.СуммаОплачено КАК СуммаОплачено,
                      |	КоворкингСчетаДопУслугиКоворкинг.Примечание КАК Примечание
                      |ИЗ
                      |	Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
                      |ГДЕ
                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка В(&Счета)");

Запрос.УстановитьПараметр("Счета", СчетаСписок);  
ТЗ_ВсеУслуги = Запрос.Выполнить().Выгрузить();

ТЗ_ВсяАренда = Новый ТаблицаЗначений;
ТЗ_ВсяАренда.Колонки.Добавить("Счет");
ТЗ_ВсяАренда.Колонки.Добавить("ДатаАренды");
ТЗ_ВсяАренда.Колонки.Добавить("СуммаАренды");

Для Индекс = 0 По ТЗ_Счета.Количество() - 1 Цикл
	СтрокаСчет = ТЗ_Счета[Индекс];
	
	Счет = СтрокаСчет.Счет;
	ОстатокСуммаСчета = Счет.Сумма;
	
	Если Счет.КоличествоЕдиниц = 0 Тогда
		СуммаЗаДень = 0;	
	Иначе
		СуммаЗаДень = Окр(Счет.Сумма / Счет.КоличествоЕдиниц, 2); 
	КонецЕсли;
	
	Дата_П = Счет.ДатаС;
	ДатаПо = Счет.ДатаПо;
	Пока Дата_П <= ДатаПо Цикл
		НоваяСтрока = ТЗ_ВсяАренда.Добавить();
		НоваяСтрока.Счет = Счет;
		НоваяСтрока.ДатаАренды = Дата_П;
		
		Если Дата_П = ДатаПо Тогда
			НоваяСтрока.СуммаАренды = ОстатокСуммаСчета;
		Иначе
			НоваяСтрока.СуммаАренды = СуммаЗаДень;
			ОстатокСуммаСчета = ОстатокСуммаСчета - СуммаЗаДень; 				
		КонецЕсли;
		
		Дата_П = Дата_П + 24 * 60 *60;
	КонецЦикла;		
КонецЦикла;

ТЗ_ВсеОплатыАренда = ТЗ_ВсеОплаты.СкопироватьКолонки();
ТЗ_ВсеОплатыАренда.Колонки.Добавить("ДатаАренды");
ТЗ_ВсеОплатыАренда.Колонки.Добавить("СуммаАренды");

Для Каждого СтрокаСчет Из ТЗ_Счета Цикл
	ОтборСтроки = Новый Структура("Счет, ЭтоУслуга", СтрокаСчет.Счет, Ложь);
	ОплатыСчет = ТЗ_ВсеОплаты.НайтиСтроки(ОтборСтроки);

	ОтборСтроки = Новый Структура("Счет", СтрокаСчет.Счет);
	АрендаСчет = ТЗ_ВсяАренда.НайтиСтроки(ОтборСтроки);
	
	Для Каждого СтрокаОплата Из ОплатыСчет Цикл
		ОстатокСуммаОплаты = СтрокаОплата.СуммаОплаты;
		
		Для Каждого СтрокаАренда Из АрендаСчет Цикл
			НоваяСтрока = ТЗ_ВсеОплатыАренда.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплата); 
			НоваяСтрока.ДатаАренды = СтрокаАренда.ДатаАренды;
			НоваяСтрока.СуммаАренды = СтрокаАренда.СуммаАренды;
			
			Если ОстатокСуммаОплаты > СтрокаАренда.СуммаАренды Тогда 
				НоваяСтрока.СуммаОплаты = СтрокаАренда.СуммаАренды;
				ОстатокСуммаОплаты = ОстатокСуммаОплаты - СтрокаАренда.СуммаАренды;
			Иначе
				НоваяСтрока.СуммаОплаты = ОстатокСуммаОплаты;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецЦикла;

СуммаОплаты = 0;
Для Каждого СтрокаОплаты Из ТЗ_ВсеОплатыАренда Цикл
	Если ФормаОплатыОтбор <> "" Тогда
		Если ФормаОплатыОтбор <> ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты) 
		Тогда Продолжить; КонецЕсли;
	КонецЕсли;	
	
	Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
	
	Область.Параметры.Дата = Формат(СтрокаОплаты.ДатаАренды, "ДФ=dd.MM.yy");
	
	Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
	Область.Параметры.РасшифровкаСчет = СтрокаСчет.Счет;
	
	Область.Параметры.Номер = СтрокаСчет.Счет.КоворкингЗаявка.КоворкингНомер;
	Область.Параметры.РасшифровкаНомер = СтрокаСчет.Счет;
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	СуммаАренды = СтрокаОплаты.СуммаАренды;
	Область.Параметры.Сумма = СуммаАренды;
	
	СуммаОплатыСтрокаОплаты  = Окр(СтрокаОплаты.СуммаОплаты, 2);
	Область.Параметры.СуммаОплаты = СуммаОплатыСтрокаОплаты;
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
	Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;
	
	ПолеОтчета.Вывести(Область, 1);
	
	ИтогиДень.Сумма = ИтогиДень.Сумма + СуммаАренды;
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплатыСтрокаОплаты;
	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
КонецЦикла;

Для Каждого СтрокаОплаты Из ТЗ_ВсеОплаты Цикл
	Если НЕ СтрокаОплаты.ЭтоУслуга Тогда Продолжить; КонецЕсли;
	
	Если ФормаОплатыОтбор <> "" Тогда
		Если ФормаОплатыОтбор <> ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты) 
		Тогда Продолжить; КонецЕсли;
	КонецЕсли;	
	
	Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
	
	ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ГУИДДолги);
	НайденныеСтроки = ТЗ_ВсеУслуги.НайтиСтроки(ОтборСтроки);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		ДатаУслуги = ".";
	Иначе
		ДатаУслуги = НайденныеСтроки[0].ДатаУслуги;
	КонецЕсли;
	Область.Параметры.Дата = Формат(ДатаУслуги, "ДФ=dd.MM.yy");
	
	Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
	Область.Параметры.РасшифровкаСчет = СтрокаСчет.Счет;
	
	Область.Параметры.Номер = СтрокаСчет.Счет.КоворкингЗаявка.КоворкингНомер;
	Область.Параметры.РасшифровкаНомер = СтрокаСчет.Счет;
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	СуммаОплатыСтрокаОплаты  = Окр(СтрокаОплаты.СуммаОплаты, 2);
	Область.Параметры.СуммаОплаты = СуммаОплатыСтрокаОплаты;
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
	Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;

	ПолеОтчета.Вывести(Область, 1);
	
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплатыСтрокаОплаты;
	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
	
	Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
		ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ГУИДДолги);
		НайденныеСтроки = ТЗ_ВсеУслуги.НайтиСтроки(ОтборСтроки);
		
		ЕстьСтрока = Ложь;
		Для Каждого Строка Из НайденныеСтроки Цикл
			Результат = Справочники.КоворкингУслуги.ПустаяСсылка();
			Ссылка = Строка.Услуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
			
			//Если Строка.УслугаРодитель = СтрокаРодительУслуги.Родитель Тогда
			Если Результат = СтрокаРодительУслуги.Папка Тогда
				ЕстьСтрока = Истина;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
		Если ЕстьСтрока Тогда
			ОбластьУслуги.Параметры.СуммаУслуги = СуммаОплатыСтрокаОплаты;
		КонецЕсли;
		
		ПолеОтчета.Присоединить(ОбластьУслуги, 1);
		
		Если ЕстьСтрока Тогда
			ОтборСтроки = Новый Структура("УслугаРодитель", Результат); 
			НайденныеСтроки = ИтогиДень.УслугиДеньИтоги.НайтиСтроки(ОтборСтроки);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.СуммаУслуги = НайденнаяСтрока.СуммаУслуги + СуммаОплатыСтрокаОплаты;
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
КонецЦикла;

Область = Макет.ПолучитьОбласть("ИтогиДень|КолонкиЛево");

//Дата = Формат(ДатаОплатыОтбор, "ДФ='д.МММ гг'" );  
//Область.Параметры.Дата = Дата;		
Область.Параметры.Дата = ".";		

Область.Параметры.Сумма = ИтогиДень.Сумма;
Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;

ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 0);
КонецЦикла;

//Если ЭтоОтчет Тогда
//	Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
//	Колонка_1 = Область.ШиринаТаблицы - 3;
//	Колонка_2 = Область.ШиринаТаблицы;
//	ПолеОтчета.Область(, Колонка_1, ,Колонка_2).Видимость = Ложь;   
//КонецЕсли;

Возврат ПолеОтчета;
КонецФункции

Функция ТЗ_УслугиРодитель()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингУслуги.Ссылка КАК Папка,
                      |	КоворкингУслуги.НомерПП КАК НомерПП,
                      |	КоворкингУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты
                      |ИЗ
                      |	Справочник.КоворкингУслуги КАК КоворкингУслуги
                      |ГДЕ
                      |	КоворкингУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингУслуги.ЭтоГруппа = ИСТИНА
                      |	И КоворкингУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.КоворкингУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_УслугиРодитель = Запрос.Выполнить().Выгрузить();
ТЗ_УслугиРодитель.Сортировать("НомерПП");

НоваяСтрока = ТЗ_УслугиРодитель.Добавить();
НоваяСтрока.Папка = Справочники.КоворкингУслуги.ПустаяСсылка();	

Возврат ТЗ_УслугиРодитель;
КонецФункции


Функция Список_ОплатыКоворкинг(ТипДокумента)
Список_ОплатыКоворкинг = Новый СписокЗначений;
	
Если ТипДокумента = "КД" Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КассовыйДокументДолгиОплата.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
	                      |ГДЕ
	                      |	ТИПЗНАЧЕНИЯ(КассовыйДокументДолгиОплата.ДокументДолг) = ТИП(Документ.КоворкингСчета)
	                      |	И КассовыйДокументДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	КассовыйДокументДолгиОплата.Ссылка");
	
ИначеЕсли ТипДокумента = "ВБ" Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
	                      |ГДЕ
	                      |	ТИПЗНАЧЕНИЯ(ВыпискаБанкаДолгиОплата.ДокументДолг) = ТИП(Документ.КоворкингСчета)
	                      |	И ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВыпискаБанкаДолгиОплата.Ссылка");
	
Иначе
	Возврат Список_ОплатыКоворкинг;
КонецЕсли;

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Список_ОплатыКоворкинг.Добавить(Строка.Ссылка);
КонецЦикла;

Возврат Список_ОплатыКоворкинг;
КонецФункции

Функция Список_ОплатыКоворкинг_1(ТипДокумента)
Список_ОплатыКоворкинг = Новый СписокЗначений;
	
Если ТипДокумента = "КД" Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КассовыйДокумент.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка
	                      |		ИЗ
	                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
	                      |		ГДЕ
	                      |			ТИПЗНАЧЕНИЯ(КассовыйДокументДолгиОплата.ДокументДолг) = ТИП(Документ.КоворкингСчета)) КАК ДолгиОплатаКоворкинг
	                      |		ПО КассовыйДокумент.Ссылка = ДолгиОплатаКоворкинг.Ссылка
	                      |ГДЕ
	                      |	НЕ ДолгиОплатаКоворкинг.Ссылка ЕСТЬ NULL");
ИначеЕсли ТипДокумента = "ВБ" Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыпискаБанка.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка
	                      |		ИЗ
	                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
	                      |		ГДЕ
	                      |			ТИПЗНАЧЕНИЯ(ВыпискаБанкаДолгиОплата.ДокументДолг) = ТИП(Документ.КоворкингСчета)) КАК ДолгиОплатаКоворкинг
	                      |		ПО ВыпискаБанка.Ссылка = ДолгиОплатаКоворкинг.Ссылка
	                      |ГДЕ
	                      |	НЕ ДолгиОплатаКоворкинг.Ссылка ЕСТЬ NULL");
	
Иначе
	Возврат Список_ОплатыКоворкинг;
КонецЕсли;

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Список_ОплатыКоворкинг.Добавить(Строка.Ссылка);
КонецЦикла;

Возврат Список_ОплатыКоворкинг;
КонецФункции

Функция ОплатилНаименование_ПеренесеноВОтчетыСервер(Строка)
Если Строка.ТипОплаты = 0 Тогда	
	Возврат "Гость смеш.";
ИначеЕсли Строка.ТипОплаты = 1 Тогда	
	Возврат "Гость к/к";
ИначеЕсли Строка.ТипОплаты = 2 Тогда	
	Возврат "Гость нал";
ИначеЕсли Строка.ТипОплаты = 3 Тогда	
	//Возврат "б/н";
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("УникальныйИдентификатор") Тогда
		Возврат "" + Строка.КонтрагентНаименование + " б/н";
	Иначе		
		Возврат "" + Строка.ДокументОплаты.ОтКого + " б/н";
	КонецЕсли;		
ИначеЕсли Строка.ТипОплаты = 4 Тогда	
	Возврат "Гость п/к";
ИначеЕсли Строка.ТипОплаты = 5 Тогда	
	Возврат "Гость сбп";
ИначеЕсли Строка.ТипОплаты = 9 Тогда	
	Возврат "" + Строка.ДокументОплаты.ОтКого + " в/з";
КонецЕсли;

Возврат "";	
КонецФункции

// ++++++++++++++++++++++++++++++

