&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Ложь);	

Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Объект.Приход = Истина;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии___()
	//Если ПроверитьДату(Дата) тогда
	//	Для каждого ЭФ Из ЭлементыФормы Цикл
	//		Если ЭФ.Имя="ПолеHTMLДокумента1" или ЭФ.Имя="Панель1" тогда
	//			Продолжить;
	//		конецесли;
	//		
	//		ЭФ.Доступность=Ложь;			
	//	КонецЦикла; 
	//	Предупреждение("Документ закрыт для редактирования!");
	//	
	//иначе
	//	Если Не ЭтоНовый() Тогда
	//		ПересчетДолга();
	//	КонецЕсли;
	//КонецЕсли;

КонецПроцедуры

//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если ОбщееСервер.ПроверитьДату(Объект.Дата) тогда
	//Для каждого ЭФ Из Элементы Цикл
	//	Если ЭФ.Имя="ПолеHTMLДокумента1" или ЭФ.Имя="Панель1" тогда
	//		Продолжить;
	//	конецесли;
	//	
	//	ЭФ.Доступность=Ложь;			
	//КонецЦикла; 
	
	ОбщийФункционалКлиент.ЗащититьФорму(ЭтаФорма);
	
	ПоказатьПредупреждение( ,"Документ закрыт для редактирования!");
Иначе
	//Если Не ЭтоНовый() Тогда
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПересчетДолга();
	КонецЕсли;
КонецЕсли;

Элементы.ФормаЗакрытьОткрыть.Заголовок = ?(Объект.Закрыт, "Открыть", "Закрыть");
КонецПроцедуры

&НаСервере
Процедура ПересчетДолга()
Возврат;	
	
Если НЕ ЗначениеЗаполнено(Объект.ДокументДолг) Тогда 
	Элементы.НадписьДолг.Заголовок = "";
	Элементы.НадписьДолг.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;		
	Возврат; 
КонецЕсли;
	
ЗапросДолга=Новый запрос("ВЫБРАТЬ
                         |	ЕстьNULL(ДолгиОстатки.СуммаОстаток,0) КАК СуммаОстаток
                         |ИЗ
                         |	РегистрНакопления.Долги.Остатки(
                         |		,
                         |			ДокументДолг = &Док
						 //|				И Контрагент = &Клиент
						 |) КАК ДолгиОстатки");	
ЗапросДолга.УстановитьПараметр("Док",Объект.ДокументДолг.Ссылка);
ЗапросДолга.УстановитьПараметр("Клиент", Объект.ОтКого);
ТЗДолг=ЗапросДолга.Выполнить().Выгрузить();
Если ТЗДолг.Количество()=0 тогда
	Долг=0;
иначе
	Долг=ТЗДолг[0].СуммаОстаток;
конецесли;

//Элементы.НадписьДолг.Заголовок=?(Долг <> 0,"Долг по брони "+Формат(Долг, "ЧГ="),"Долг отсутствует!");
Если Долг > 0 тогда
	Текст = "Долг по брони "+Формат(Долг, "ЧГ=");
ИначеЕсли Долг < 0 тогда
	Текст = "Переплата по брони "+Формат(-Долг, "ЧГ=");
Иначе
	Текст = "Долг отсутствует.";
КонецЕсли;	

Элементы.НадписьДолг.Заголовок = Текст;
Если Долг < 0 тогда
	Элементы.НадписьДолг.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
Иначе
	Элементы.НадписьДолг.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
КонецЕсли;
КонецПроцедуры
//

//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры
//


//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Ответ = ТекстОшибки();
Если ЗначениеЗаполнено(Ответ) Тогда
	ТекстПредупреждение = Ответ.ТекстПредупреждение;
	ТекстСообщение = Ответ.ТекстСообщение; 
	
	ТекстПредупреждение = "ОШИБОЧНЫЕ ДАННЫЕ" + Символы.ПС + ТекстПредупреждение;	
	ТекстПредупреждение = ТекстПредупреждение + Символы.ПС + "Документ НЕ сохранен";	
	ПоказатьПредупреждение(, ТекстПредупреждение); 
	
	ТекстСообщение = "ОШИБОЧНЫЕ ДАННЫЕ: " + ТекстСообщение;	
	ТекстСообщение = ТекстСообщение + ". Документ НЕ сохранен.";	
	Сообщить(ТекстСообщение);
	
	Отказ = Истина;
КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ТекстОшибки()
ДокументОбъект = РеквизитФормыВЗначение("Объект");
ТекстОшибки = ДокументОбъект.ТекстОшибки();
Возврат ТекстОшибки;	
КонецФункции	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
ПересчетДолга();
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтКогоПриИзменении__(Элемент)
	//Форм=Документы.ЗаявкаНаБронирование.ПолучитьФорму("ФормаВыбораДляДенег_OLD");
	//ФОрм.КлиентОтбор=ОтКого;
	//ДокументОплаты=Форм.ОткрытьМодально();
	//ПересчетДолга();
КонецПроцедуры

&НаКлиенте
Процедура ОтКогоПриИзменении(Элемент)
Если ЕстьДолгиОплатаПредупреждение() Тогда 
	ОтКого_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "ОтКого"); 
	Объект.ОтКого = ОтКого_OldValue;
	
	Возврат; 
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ЕстьДолгиОплатаПредупреждение()
Если Объект.ДолгиОплата.Количество() > 0 Тогда
	ТекстПредупреждения = "Есть документы долги, связанные с оплатой
						|
						|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...";
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
	Возврат Истина;
КонецЕсли;	

Возврат Ложь;
КонецФункции
//

&НаКлиенте
Процедура ДокументДолгПриИзменении(Элемент)
	ПересчетДолга();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
Если ЕстьДолгиОплатаПредупреждение() Тогда 
	Сумма_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "Сумма"); 
	Объект.Сумма = Сумма_OldValue;
	
	Возврат; 
КонецЕсли;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗакрытьОткрыть(Команда)
ЗакрытьОткрытьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьОткрытьНаСервере()
Объект.Закрыт = НЕ Объект.Закрыт; 

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
Элементы.ФормаЗакрытьОткрыть.Заголовок = ?(Объект.Закрыт, "Открыть", "Закрыть");
КонецПроцедуры
//
	

// ++++++++++++++++++++++





// - Кнопка1






