
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если РаботаСИнтерфейсомСервер.УстановитьТолькоПросмотр(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВБронь(Команда)
Ответ = ПеревестиВБроньНаСервере();
Если Ответ.КодОтвета <> 0 Тогда
	ПоказатьПредупреждение(, Ответ.ТекстОтвета);
	Возврат;
КонецЕсли;

НомерВРезерв = Ответ.НомерВРезерв;
		
СоздатьОткрытьЗаявкаНаБронирование(НомерВРезерв);

Закрыть();
КонецПроцедуры

&НаСервере
Функция ПеревестиВБроньНаСервере()
Ответ = Новый Структура("КодОтвета, ТекстОтвета, НомерВРезерв", 0, "", Неопределено);	// поиск номера

Заезд=0;
Если Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр0 тогда
	Заезд=0;
иначеесли Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр6 тогда
	Заезд=6;
иначеесли Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр14 тогда
	Заезд=14;
иначеесли Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр18 тогда
	Заезд=18;
конецесли;  
	
Выезд=0;
Если Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр0 тогда
	Выезд=0;
иначеесли Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр6 тогда
	Выезд=6;
иначеесли Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр12 тогда
	//Выезд=12;
	Выезд=14;
иначеесли Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр18 тогда
	Выезд=18;
конецесли;
	
ТемпС=НачалоЧаса(НачалоДня(Объект.РезервС) + Заезд*3600);
ТемпПо=НачалоЧаса(НачалоДня(Объект.РезервПо) + Выезд*3600);

ЗапросСвободных=Новый Запрос("ВЫБРАТЬ
                             |	НомернойФонд.Ссылка,
                             |	НомернойФонд.Курящий
                             |ИЗ
                             |	Справочник.НомернойФонд КАК НомернойФонд
                             |ГДЕ
                             |	(НЕ НомернойФонд.Ссылка В
                             |				(ВЫБРАТЬ
                             |					ЗанятостьНомеров.Номер
                             |				ИЗ
                             |					РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                             |				ГДЕ
                             |					ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ПериодН И &ПериодК))
                             |	И НомернойФонд.КатегорияНомера = &КатегорияНомера");
ЗапросСвободных.УстановитьПараметр("ПериодН",ТемпС);
ЗапросСвободных.УстановитьПараметр("ПериодК",ТемпПо);
ЗапросСвободных.УстановитьПараметр("КатегорияНомера",Объект.КатегорияНомера);
ТЗсвободных=ЗапросСвободных.Выполнить().Выгрузить();

НомерВРезерв=Справочники.НомернойФонд.ПустаяСсылка();    

Если ТЗсвободных.Количество()=0 тогда
	Ответ.КодОтвета = 1;
	Ответ.ТекстОтвета = "Свободных номеров на эти даты данной категории нет!";
	
	Возврат Ответ;
	
иначе
	
	Для каждого НомерСтр из ТЗсвободных цикл
		Если НомерСтр.курящий = Объект.Курящий тогда
			НомерВРезерв=НомерСтр.ссылка;   
		конецесли;
		
	конеццикла;
	Если НомерВРезерв=Справочники.НомернойФонд.ПустаяСсылка() тогда
	////	Если Вопрос("Номер для "+?(Курящий,"курящих","некурящих")+" не найден, но есть другой, забронировать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
			НомерВРезерв=ТЗсвободных[0].ссылка;
	////	конецесли;
	конецесли;
			
конецесли;
	
Если НомерВРезерв=Справочники.НомернойФонд.ПустаяСсылка() тогда 
	Ответ.КодОтвета = 1;
	Ответ.ТекстОтвета = "Свободный номер на выбранную дату не найден!";
	
	Возврат Ответ;
иначе
	//НовБР=Документы.ЗаявкаНаБронирование.СоздатьДокумент();
	//НовБР.Бронирует = Объект.Клиент;
	//НовБр.КатегорияНомера = Объект.КатегорияНомера;
	//НовБр.Курящий = Объект.Курящий;
	//НовБр.РезервС = Объект.РезервС;
	//НовБр.РезервПо = Объект.РезервПо;
	//НовБр.ВремяВыезда = Объект.ВремяВыезда;
	//НовБр.ВремяЗаезда = Объект.ВремяЗаезда;
	//НовБр.НомерВРезерв = НомерВРезерв;
	
	ОбъектДокумент = Объект.Ссылка.ПолучитьОбъект();
	ОбъектДокумент.УстановитьПометкуУдаления(Истина);
	
	Ответ.НомерВРезерв =  НомерВРезерв;
	Возврат Ответ;
	
конецесли;

КонецФункции

&НаКлиенте
Процедура СоздатьОткрытьЗаявкаНаБронирование(НомерВРезерв)
//НовБр.Бронирует = Объект.Клиент;
//НовБр.КатегорияНомера = Объект.КатегорияНомера;
//НовБр.Курящий = Объект.Курящий;
//НовБр.РезервС = Объект.РезервС;
//НовБр.РезервПо = Объект.РезервПо;
//НовБр.ВремяВыезда = Объект.ВремяВыезда;
//НовБр.ВремяЗаезда = Объект.ВремяЗаезда;

//НовБр.НомерВРезерв = НомерВРезерв;

ПарамФормы = Новый Структура;	
ПарамФормы.Вставить("Бронирует", Объект.Клиент);
ПарамФормы.Вставить("КатегорияНомера", Объект.КатегорияНомера);
ПарамФормы.Вставить("Курящий", Объект.Курящий);
ПарамФормы.Вставить("РезервС", Объект.РезервС);
ПарамФормы.Вставить("РезервПо", Объект.РезервПо);
ПарамФормы.Вставить("ВремяВыезда", Объект.ВремяВыезда);
ПарамФормы.Вставить("ВремяЗаезда", Объект.ВремяЗаезда);

// + Аудит
ПарамФормы.Вставить("НомерВРезерв", НомерВРезерв);
// - Аудит
	
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПарамФормы, ЭтаФорма
	,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры

 


