&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТолькоОтклонения = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
СформироватьТаблицаОтчета();

ОтчетПоле.Очистить();
ОтчетПоле.ФиксацияСверху = 1;
ОтчетПоле.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ОтчетПоле.ОтображатьСетку = Истина;

Макет = Обработки.ОтчетДолгиЗаявки.ПолучитьМакет("ОтчетДолгиЗаявки");

Шапка = Макет.ПолучитьОбласть("Шапка");
ОбластьПовтора = ОтчетПоле.Вывести(Шапка);
ОтчетПоле.ПовторятьПриПечатиСтроки = ОбластьПовтора;
	
ДатаСвертка = '00010101';
Заявка_П = Неопределено;

Пропустить = Ложь;
СчетГУИД_П = Неопределено;
Счетчик = 0;

ОтчетПоле.НачатьАвтогруппировкуСтрок();
Для Каждого СтрокаТаблица Из ТаблицаОтчета Цикл
	
	СтрокаОтчета = Макет.ПолучитьОбласть("Строка");
	Если СтрокаТаблица.Заявка <> Заявка_П Тогда 
		
		Заявка_П = СтрокаТаблица.Заявка;
		
		ИтогОплатаЗаявка = ИтогОплатаЗаявка(СтрокаТаблица.Заявка, Счетчик);
		СуммаДолгаЗаявка = СтрокаТаблица.СуммаПроживаниеПроживание + СтрокаТаблица.СуммаУслугиУслуги - ИтогОплатаЗаявка;   
		
		Если ТолькоОтклонения Тогда 
			Если СуммаДолгаЗаявка = 0 Тогда 
				Пропустить = Истина;
				
				Перейти ~СЛЕДУЮЩИЙ;
			Иначе 	
				Пропустить = Ложь;
			КонецЕсли;
		КонецЕсли;			
		
		СтрокаОтчета.Параметры.РезервС = Формат(СтрокаТаблица.РезервС, "ДФ=dd.MM.yy");	
		СтрокаОтчета.Параметры.РезервПо = Формат(СтрокаТаблица.РезервПо, "ДФ=dd.MM.yy");	
		
		ДокументПредставление = ПечатьСервер.ДокументПредставление(СтрокаТаблица.Заявка); 	
		СтрокаОтчета.Параметры.Заявка = ДокументПредставление;	
		
		СтрокаОтчета.Параметры.НомерВРезерв = СтрокаТаблица.Заявка.НомерВРезерв;	
		СтрокаОтчета.Параметры.Клиент = СтрокаТаблица.Клиент;	
		
		//СтрокаОтчета.Параметры.ОплачиваетЗаявка = СтрокаТаблица.ОплачиваетЗаявка;	
		ОплачиваетЗаявка = СтрокаТаблица.ОплачиваетЗаявка;
		Если ОплачиваетЗаявка.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда 
			НаименованиеЮрЛица = СтрокаТаблица.ОплачиваетЗаявка.НаименованиеЮрЛица;
			Если ЗначениеЗаполнено(НаименованиеЮрЛица) Тогда
				ОплачиваетЗаявкаНаименование = НаименованиеЮрЛица;
			Иначе
				ОплачиваетЗаявкаНаименование = СтрокаТаблица.ОплачиваетЗаявка.Наименование;
			КонецЕсли;
		Иначе
			ОплачиваетЗаявкаНаименование = СтрокаТаблица.ОплачиваетЗаявка.Наименование;
		КонецЕсли;			
		СтрокаОтчета.Параметры.ОплачиваетЗаявка = ОплачиваетЗаявкаНаименование;	
			
		СтрокаОтчета.Параметры.Статус = СтрокаТаблица.Заявка.Статус;	
		
		СтрокаОтчета.Параметры.СуммаПроживаниеСчета = СтрокаТаблица.СуммаПроживаниеСчета;	
		СтрокаОтчета.Параметры.СуммаПроживаниеПолная = СтрокаТаблица.СуммаПроживаниеПроживание;	
		
	Если СтрокаТаблица.СуммаПроживаниеСчета <> СтрокаТаблица.СуммаПроживаниеПроживание Тогда
		//СуммаПроживаниеПолная
		СтрокаОтчета.Область("СуммаПроживаниеПолная").ЦветФона = WebЦвета.СветлоСерый;	
		
		//СтрокаОтчета.Область(1, 5, 1, 5).ЦветФона = WebЦвета.СветлоСерый;	
		//ЯчейкаСуммаПроживанияПолная = СтрокаОтчета.ПолучитьОбласть("Строка|СуммаПроживаниеПолная");		
		//ЯчейкаСуммаПроживанияПолная.ТекущаяОбласть.ЦветФона = WebЦвета.СветлоСерый;
	КонецЕсли;	

	СтрокаОтчета.Параметры.СуммаУслугиСчета = СтрокаТаблица.СуммаУслугиСчета;	
	СтрокаОтчета.Параметры.СуммаУслугиПолная = СтрокаТаблица.СуммаУслугиУслуги;	
	
	Если СтрокаТаблица.СуммаУслугиСчета <> СтрокаТаблица.СуммаУслугиУслуги Тогда
		СтрокаОтчета.Область("СуммаУслугиПолная").ЦветФона = WebЦвета.СветлоСерый;	
	КонецЕсли;	
	
		СтрокаОтчета.Параметры.СуммаЗаявки = СтрокаТаблица.СуммаПроживаниеПроживание + СтрокаТаблица.СуммаУслугиУслуги;	
		
		СтрокаОтчета.Параметры.СуммаДолгаЗаявка = СуммаДолгаЗаявка;  
		
		СтрокаОтчета.Параметры.СуммаОплаты = ИтогОплатаЗаявка;  
		
		СтрокаОтчета.Параметры.РасшифровкаЗаявка = СтрокаТаблица.Заявка;	
		
		Результат = СчетаЗаявка(СтрокаТаблица.Заявка, Счетчик);
		КоличествоСчетовЗаявка = Результат.КоличествоСчетовЗаявка;	
		СуммаСчетовЗаявка = Результат.СуммаСчетовЗаявка;
		
		СтрокаОтчета.Параметры.СуммаСчета = СуммаСчетовЗаявка;  
				
		//Если КоличествоСчетовЗаявка(СтрокаТаблица.Заявка, Счетчик) > 1 Тогда
		Если КоличествоСчетовЗаявка > 1 Тогда
			СтрокаОтчета.Параметры.Уровень = 1;	
			СтрокаПоле =  ОтчетПоле.Вывести(СтрокаОтчета, 1);
			
			СтрокаОтчета.Параметры.РезервС = "";	
			СтрокаОтчета.Параметры.РезервПо = "";	
			
			СтрокаОтчета.Параметры.Заявка = "";	
			
			СтрокаОтчета.Параметры.НомерВРезерв = "";	
			СтрокаОтчета.Параметры.Клиент = "";	
			
			СтрокаОтчета.Параметры.СуммаПроживаниеСчета = "";	
			
			СтрокаОтчета.Параметры.СуммаПроживаниеПолная = "";	
			СтрокаОтчета.Область("СуммаПроживаниеПолная").ЦветФона = Новый Цвет();	
			
			СтрокаОтчета.Параметры.СуммаУслугиПолная = "";	
			СтрокаОтчета.Область("СуммаУслугиПолная").ЦветФона = Новый Цвет();	
			
			СтрокаОтчета.Параметры.СуммаЗаявки = "";	
			
			СтрокаОтчета.Параметры.СуммаДолгаЗаявка = "";  
			СтрокаОтчета.Параметры.СуммаОплаты = "";
			СтрокаОтчета.Параметры.СуммаСчета = ""; 
		
			СтрокаОтчета.Параметры.РасшифровкаЗаявка = "";
			
			УровеньГруппировки = 2;
		Иначе
			УровеньГруппировки = 1;
		КонецЕсли;	
		
	Иначе	
		Если Пропустить Тогда Перейти ~СЛЕДУЮЩИЙ; КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблица.СчетГУИД) Тогда
		Если СтрокаТаблица.СчетГУИД <> СчетГУИД_П Тогда  
			
			СчетГУИД_П = СтрокаТаблица.СчетГУИД;
			
			СтрокаОтчета.Параметры.НомерСчета = СтрокаТаблица.НомерСчета;	
			СтрокаОтчета.Параметры.ДатаСчета = Формат(СтрокаТаблица.ДатаСчета, "ДФ=dd.MM.yy");	
			
			СтрокаОтчета.Параметры.ТолькоПроживание = ?(СтрокаТаблица.ТолькоПроживание, "V", "");	
			СтрокаОтчета.Параметры.ТолькоУслуги = ?(СтрокаТаблица.ТолькоУслуги, "V", "");	
			
			СтрокаОтчета.Параметры.СуммаСчета = СтрокаТаблица.СуммаСчета;
			
			ИтогОплатаСчет = ИтогОплатаСчет(СтрокаТаблица.СчетГУИД, Счетчик);
			СтрокаОтчета.Параметры.СуммаДолгаСчет = СтрокаТаблица.СуммаСчета - ИтогОплатаСчет;   

			ДокументПредставление = ПечатьСервер.ДокументПредставление(СтрокаТаблица.ГрупповойСчет); 	
			СтрокаОтчета.Параметры.ГрупповойСчет = ДокументПредставление;
			
			СтрокаОтчета.Параметры.РасшифровкаГрупповойСчет = СтрокаТаблица.ГрупповойСчет;	
			
			Если УровеньГруппировки > 1 Тогда
					
				Результат =  ОплатыСчет(СтрокаТаблица.СчетГУИД, Счетчик);
				КоличествоОплатСчета = Результат.КоличествоОплатСчета;
				СуммаОплатСчета = Результат.СуммаОплатСчета;
				
				СтрокаОтчета.Параметры.СуммаОплаты = СуммаОплатСчета;  
				
				Если КоличествоОплатСчета > 1 Тогда
					СтрокаОтчета.Параметры.Уровень = 2;	
					СтрокаПоле =  ОтчетПоле.Вывести(СтрокаОтчета, 2);
					
					СтрокаОтчета.Параметры.НомерСчета = "";	
					СтрокаОтчета.Параметры.ДатаСчета = "";	
					
					СтрокаОтчета.Параметры.ТолькоПроживание = "";	
					СтрокаОтчета.Параметры.ТолькоУслуги = "";	
					
					СтрокаОтчета.Параметры.СуммаСчета = "";
					СтрокаОтчета.Параметры.СуммаДолгаСчет = "";   

					СтрокаОтчета.Параметры.ГрупповойСчет = "";
					
					СтрокаОтчета.Параметры.РасшифровкаГрупповойСчет = "";
					
					УровеньГруппировки = 3;
				Иначе
					УровеньГруппировки = 2;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтрокаТаблица.ДокументОплаты) Тогда
			//СтрокаОтчета.Параметры.ДокументОплаты = СтрокаТаблица.ДокументОплаты;
			ДокументПредставление = ПечатьСервер.ДокументПредставление(СтрокаТаблица.ДокументОплаты); 	
			СтрокаОтчета.Параметры.ДокументОплаты = ДокументПредставление;	
			
			СтрокаОтчета.Параметры.Оплатил = СтрокаТаблица.ДокументОплаты.ОтКого;	
			СтрокаОтчета.Параметры.ДатаОплаты = Формат(СтрокаТаблица.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");	
			СтрокаОтчета.Параметры.СуммаОплаты = СтрокаТаблица.СуммаОплаты;	
			СтрокаОтчета.Параметры.СуммаДокументаОплаты = СтрокаТаблица.ДокументОплаты.Сумма;	
			СтрокаОтчета.Параметры.СуммаВозврата = СтрокаТаблица.СуммаВозврата;	
			
			СтрокаОтчета.Параметры.РасшифровкаДокументОплаты = СтрокаТаблица.ДокументОплаты;	
			
		КонецЕсли;	
	КонецЕсли;	
	
	//УровеньГруппировки = 1;
	СтрокаОтчета.Параметры.Уровень = УровеньГруппировки;	
	СтрокаПоле =  ОтчетПоле.Вывести(СтрокаОтчета, УровеньГруппировки);

	
~СЛЕДУЮЩИЙ:	
	Счетчик = Счетчик + 1;
КонецЦикла;

ОтчетПоле.ЗакончитьАвтогруппировкуСтрок();
ОтчетПоле.ПоказатьУровеньГруппировокСтрок(0);
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицаОтчета()
Запрос = Новый Запрос;	
Запрос.Текст = "ВЫБРАТЬ
               |	ЗаявкаНаБронирование.Ссылка КАК Заявка,
               |	ЗаявкаНаБронирование.РезервС КАК РезервС,
               |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
               |	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
               |	ЗаявкаНаБронирование.Клиент КАК Клиент,
               |	ЗаявкаНаБронирование.Оплачивает КАК ОплачиваетЗаявка,
               |	ЕСТЬNULL(ПроживаниеСуммаПроживание.Сумма, 0) КАК СуммаПроживаниеПроживание,
               |	ЕСТЬNULL(ДолгиСуммаПроживания.СуммаДолг, 0) КАК СуммаПроживаниеСчета,
               |	ЕСТЬNULL(УслугиСуммаУслуги.Сумма, 0) КАК СуммаУслугиУслуги,
               |	ЕСТЬNULL(ДолгиСуммаУслуги.СуммаДолг, 0) КАК СуммаУслугиСчета,
               |	СчетаДолгОплаты.СчетГУИД КАК СчетГУИД,
               |	СчетаДолгОплаты.НомерСчета КАК НомерСчета,
               |	СчетаДолгОплаты.ДатаСчета КАК ДатаСчета,
               |	СчетаДолгОплаты.СуммаДолг КАК СуммаСчета,
               |	СчетаДолгОплаты.ТолькоПроживание КАК ТолькоПроживание,
               |	СчетаДолгОплаты.ТолькоУслуги КАК ТолькоУслуги,
               |	СчетаДолгОплаты.ГрупповойСчет КАК ГрупповойСчет,
               |	СчетаДолгОплаты.ДокументОплаты КАК ДокументОплаты,
               |	СчетаДолгОплаты.СуммаОплаты КАК СуммаОплаты,
               |	ЕСТЬNULL(ВозвратКасса.Сумма, 0) КАК СуммаВозвратаКасса,
               |	ЕСТЬNULL(ВозвратВыписка.Сумма, 0) КАК СуммаВозвратаВыписка,
               |	ВЫБОР
               |		КОГДА ТИПЗНАЧЕНИЯ(СчетаДолгОплаты.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
               |			ТОГДА ВозвратКасса.Сумма
               |		ИНАЧЕ ВозвратВыписка.Сумма
               |	КОНЕЦ КАК СуммаВозврата
               |ИЗ
               |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК ПроживаниеСуммаПроживание
               |		ПО ЗаявкаНаБронирование.Ссылка = ПроживаниеСуммаПроживание.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество) КАК Сумма
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
               |		ГДЕ
               |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка) КАК УслугиСуммаУслуги
               |		ПО ЗаявкаНаБронирование.Ссылка = УслугиСуммаУслуги.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
               |			ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
               |			ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
               |			ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
               |			ЗаявкаНаБронированиеСчета.ТолькоПроживание КАК ТолькоПроживание,
               |			ЗаявкаНаБронированиеСчета.ТолькоУслуги КАК ТолькоУслуги,
               |			ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
               |			ДолгиСчет.СуммаДолг КАК СуммаДолг,
               |			ОплатыСчет.ДокументОплаты КАК ДокументОплаты,
               |			ОплатыСчет.СуммаОплаты КАК СуммаОплаты
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |					ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
               |					СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
               |				ИЗ
               |					Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |				
               |				СГРУППИРОВАТЬ ПО
               |					ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
               |					ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК ДолгиСчет
               |				ПО ЗаявкаНаБронированиеСчета.СчетГУИД = ДолгиСчет.СчетГУИД
               |					И ЗаявкаНаБронированиеСчета.Ссылка = ДолгиСчет.Ссылка
               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
               |					СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
               |				ИЗ
               |					Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
               |				
               |				СГРУППИРОВАТЬ ПО
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД,
               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) КАК ОплатыСчет
               |				ПО ЗаявкаНаБронированиеСчета.СчетГУИД = ОплатыСчет.СчетГУИД
               |					И ЗаявкаНаБронированиеСчета.Ссылка = ОплатыСчет.Ссылка) КАК СчетаДолгОплаты
               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |				КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
               |				СУММА(КассовыйДокумент.Сумма) КАК Сумма
               |			ИЗ
               |				Документ.КассовыйДокумент КАК КассовыйДокумент
               |			ГДЕ
               |				КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
               |			
               |			СГРУППИРОВАТЬ ПО
               |				КассовыйДокумент.ВозвратДокумент) КАК ВозвратКасса
               |			ПО СчетаДолгОплаты.ДокументОплаты = ВозвратКасса.ВозвратДокумент
               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |				ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
               |				СУММА(ВыпискаБанка.Сумма) КАК Сумма
               |			ИЗ
               |				Документ.ВыпискаБанка КАК ВыпискаБанка
               |			ГДЕ
               |				ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
               |			
               |			СГРУППИРОВАТЬ ПО
               |				ВыпискаБанка.ВозвратДокумент) КАК ВозвратВыписка
               |			ПО СчетаДолгОплаты.ДокументОплаты = ВозвратВыписка.ВозвратДокумент
               |		ПО ЗаявкаНаБронирование.Ссылка = СчетаДолгОплаты.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |				ПО ЗаявкаНаБронированиеПроживание.Ссылка = ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка
               |					И ЗаявкаНаБронированиеПроживание.ГУИД = ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК ДолгиСуммаПроживания
               |		ПО ЗаявкаНаБронирование.Ссылка = ДолгиСуммаПроживания.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |				ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка
               |					И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК ДолгиСуммаУслуги
               |		ПО ЗаявкаНаБронирование.Ссылка = ДолгиСуммаУслуги.Ссылка
               |ГДЕ
               |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
               |	И ЗаявкаНаБронирование.ТипБронирования <> &ТипБронирования
               |	И ЗаявкаНаБронирование.РезервПо >= &Дата_С
               |	И ЗаявкаНаБронирование.РезервПо <= &Дата_По";

			   //|	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
			   //|	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
			   //|	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
			   //|
			   //|УПОРЯДОЧИТЬ ПО
			   //|	РезервС,
			   //|	Заявка,
			   //|	НомерСчета,
			   //|	ДокументОплаты";

Если НЕ ВключитьБрони Тогда
	Запрос.Текст = Запрос.Текст + "
               |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)";
КонецЕсли;
		   
Если НЕ ВключитьОтменыБронирования Тогда
	Запрос.Текст = Запрос.Текст + "
               |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)";
КонецЕсли;

Если НЕ ВключитьОтказыБронирования Тогда
	Запрос.Текст = Запрос.Текст + "
               |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)";
КонецЕсли;

Запрос.Текст = Запрос.Текст + "
				|
				|УПОРЯДОЧИТЬ ПО
				|	РезервС,
				|	Заявка,
				|	НомерСчета,
				|	ДокументОплаты";

Запрос.УстановитьПараметр("Дата_С", ДатаОтбор_С);

ДатаОтбор_По_П = ?(ЗначениеЗаполнено(ДатаОтбор_По), ДатаОтбор_По, '30010101'); 
Запрос.УстановитьПараметр("Дата_По", ДатаОтбор_По_П);

Запрос.УстановитьПараметр("ТипБронирования", Справочники.ТипБронирования.Ремонт);

ТЗ = Запрос.Выполнить().Выгрузить();

ТаблицаОтчета.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТаблицаОтчета.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ИтогОплатаСчет(СчетГУИД, Знач Счетчик)
ИтогОплатаСчет = 0;	

Пока Счетчик < ТаблицаОтчета.Количество() Цикл
//Для Каждого Строка Из ОтчетТаблица Цикл
	Строка = ТаблицаОтчета[Счетчик]; 
	//Если НачалоДня(Строка.ДатаОплаты) < ДатаИтога Тогда Продолжить; КонецЕсли;
	Если Строка.СчетГУИД <> СчетГУИД Тогда Прервать; КонецЕсли;
	
	ИтогОплатаСчет = ИтогОплатаСчет + Строка.СуммаОплаты;	
	
 	Счетчик	=  Счетчик + 1;
КонецЦикла;

Возврат ИтогОплатаСчет;
КонецФункции

&НаСервере
Функция ИтогОплатаЗаявка(Заявка, Знач Счетчик)
ИтогОплатаЗаявка = 0;	

Пока Счетчик < ТаблицаОтчета.Количество() Цикл
//Для Каждого Строка Из ОтчетТаблица Цикл
	Строка = ТаблицаОтчета[Счетчик]; 
	//Если НачалоДня(Строка.ДатаОплаты) < ДатаИтога Тогда Продолжить; КонецЕсли;
	Если Строка.Заявка <> Заявка Тогда Прервать; КонецЕсли;
	
	ИтогОплатаЗаявка = ИтогОплатаЗаявка + Строка.СуммаОплаты;	
	
 	Счетчик	=  Счетчик + 1;
КонецЦикла;

Возврат ИтогОплатаЗаявка;
КонецФункции

&НаСервере
Функция КоличествоСчетовЗаявка(Заявка, Знач Счетчик)
КоличествоСчетовЗаявка = 0;	

Пока Счетчик < ТаблицаОтчета.Количество() Цикл
	Строка = ТаблицаОтчета[Счетчик]; 

	СчетГУИД = Неопределено;
	Пока Счетчик < ТаблицаОтчета.Количество() Цикл
		Строка = ТаблицаОтчета[Счетчик]; 
		Если Строка.Заявка <> Заявка Тогда Прервать; КонецЕсли;

		Если Строка.СчетГУИД = СчетГУИД Тогда Продолжить; КонецЕсли;

		КоличествоСчетовЗаявка = КоличествоСчетовЗаявка + 1;	
		
		СчетГУИД = Строка.СчетГУИД;
		
		Счетчик	=  Счетчик + 1;
	КонецЦикла;
	
	Если Строка.Заявка <> Заявка Тогда Прервать; КонецЕсли;
	Счетчик	=  Счетчик + 1;
КонецЦикла;

Возврат КоличествоСчетовЗаявка;
КонецФункции

&НаСервере
Функция КоличествоОплатСчет(СчетГУИД, Знач Счетчик)
КоличествоОплатСчета = 0;	

Пока Счетчик < ТаблицаОтчета.Количество() Цикл
	Строка = ТаблицаОтчета[Счетчик]; 

	Если Строка.СчетГУИД <> СчетГУИД Тогда Прервать; КонецЕсли;

	КоличествоОплатСчета = КоличествоОплатСчета + 1;	
	
	Счетчик	=  Счетчик + 1;
КонецЦикла;

Возврат КоличествоОплатСчета;
КонецФункции

&НаСервере
Функция СчетаЗаявка(Заявка, Знач Счетчик)
КоличествоСчетовЗаявка = 0;	
СуммаСчетовЗаявка = 0;	

Пока Счетчик < ТаблицаОтчета.Количество() Цикл
	Строка = ТаблицаОтчета[Счетчик]; 

	СчетГУИД = Неопределено;
	Пока Счетчик < ТаблицаОтчета.Количество() Цикл
		Строка = ТаблицаОтчета[Счетчик]; 
		Если Строка.Заявка <> Заявка Тогда Прервать; КонецЕсли;

		Если Строка.СчетГУИД = СчетГУИД Тогда Перейти ~СЛЕДУЩИЙ; КонецЕсли;

		КоличествоСчетовЗаявка = КоличествоСчетовЗаявка + 1;	
		СуммаСчетовЗаявка = СуммаСчетовЗаявка + Строка.СуммаСчета;		
		
		СчетГУИД = Строка.СчетГУИД;
		
~СЛЕДУЩИЙ:
		Счетчик	=  Счетчик + 1;
	КонецЦикла;
	
	Если Строка.Заявка <> Заявка Тогда Прервать; КонецЕсли;
	
	Счетчик	=  Счетчик + 1;
КонецЦикла;

Результат = Новый Структура("КоличествоСчетовЗаявка, СуммаСчетовЗаявка", КоличествоСчетовЗаявка, СуммаСчетовЗаявка); 
Возврат Результат;
КонецФункции

&НаСервере
Функция ОплатыСчет(СчетГУИД, Знач Счетчик)
КоличествоОплатСчета = 0;	
СуммаОплатСчета = 0;

Пока Счетчик < ТаблицаОтчета.Количество() Цикл
	Строка = ТаблицаОтчета[Счетчик]; 

	Если Строка.СчетГУИД <> СчетГУИД Тогда Прервать; КонецЕсли;

	КоличествоОплатСчета = КоличествоОплатСчета + 1;	
	СуммаОплатСчета = СуммаОплатСчета + Строка.СуммаОплаты;
	
	Счетчик	=  Счетчик + 1;
КонецЦикла;

Результат = Новый Структура("КоличествоОплатСчета, СуммаОплатСчета", КоличествоОплатСчета, СуммаОплатСчета);
Возврат Результат;
КонецФункции

//
&НаКлиенте
Процедура РаскрытьГруппировки(Команда)
РаскрытьГруппировкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаскрытьГруппировкиНаСервере()
УровеньРаскрытияГруппировок = УровеньРаскрытияГруппировок + 1;	
Если УровеньРаскрытияГруппировок > 2 Тогда
	УровеньРаскрытияГруппировок = 0;
КонецЕсли;
	
ОтчетПоле.ПоказатьУровеньГруппировокСтрок(УровеньРаскрытияГруппировок);	
КонецПроцедуры

//

