

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаОтбора = Параметры.ДатаОтбора;	

ТЗ = Параметры.Заселения;

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЗаселенияПолный.Добавить();	
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

Администратор = Параметры.Администратор;

ЗаполнитьЗаселения();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаселения()
Заселения.Очистить();
Если Все Тогда	
	Для Каждого Строка Из ЗаселенияПолный Цикл
		НоваяСтрока = Заселения.Добавить();	
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	КонецЦикла;
Иначе
	ДатаС = ДатаОтбора + 9 * 60 * 60;	
	ДатаПо = ДатаС + 24 * 60 * 60;	
	
	Для Каждого Строка Из ЗаселенияПолный Цикл
		Если Строка.ДатаВремя < ДатаС ИЛИ Строка.ДатаВремя > ДатаПо	Тогда Продолжить; КонецЕсли;
		
		НоваяСтрока = Заселения.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	КонецЦикла;	
	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВсеПриИзменении(Элемент)
ЗаполнитьЗаселения();
КонецПроцедуры



