//
&НаКлиенте
Процедура ПриОткрытии__()
	//КнопкаСформироватьНажатие(ЭтаФорма);
	////	ПодключитьОбработчикОжидания("Отчет",10);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
СформироватьКоманда(Неопределено);
КонецПроцедуры
//

Процедура КнопкаСформироватьНажатие__(Кнопка)
	//Отчет();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	Отчет();
КонецПроцедуры

&НаСервере
Функция Отчет(ТолькоБаллы=Ложь)
	ПолеОтчета.Очистить();
	
	
	Макет = Отчеты.ОтчетПроживающие.ПолучитьМакет("Макет");
	
	ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	ЗанятостьНомеров.Клиент КАК Клиент,
	                               |	ЗанятостьНомеров.Номер КАК Номер,
	                               |	ЗанятостьНомеров.Регистратор КАК Регистратор,
	                               |	ЗанятостьНомеров.Регистратор.РаздельныеКровати КАК РК
	                               |ИЗ
	                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                               |ГДЕ
	                               |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                               |	И ЗанятостьНомеров.Регистратор.Статус = &Статус
	                               |	И ЗанятостьНомеров.Регистратор.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
	                               |
	                               |УПОРЯДОЧИТЬ ПО
	                               |	ЗанятостьНомеров.Номер.Наименование");
	ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
	ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
	ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));
	
	СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
	
	ЗапросКолВаПроживаний=Новый Запрос("ВЫБРАТЬ
	                                   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИсторияКлиента.ЗаявкаГУИД) КАК КолВо
	                                   |ИЗ
	                                   |	РегистрСведений.ИсторияКлиента КАК ИсторияКлиента
	                                   |ГДЕ
	                                   |	ИсторияКлиента.Клиент = &Клиент
	                                   |	И ИсторияКлиента.Статус = &Статус");	
	ЗапросКолВаПроживаний.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Выехал);	
	
	Обл=Макет.ПолучитьОбласть("ШапкаПроживающие");
	Обл.Параметры.ДТ=Формат(ТекущаяДата(), "ДЛФ=DD");
	
	ПолеОтчета.Вывести(Обл);
	
	сч=1;
	Для каждого КлДР Из СписокПроживающих Цикл
		КлиентДР = Ложь;
		Клиент2Наименование = "";
		Если День(КлДР.КЛиент.ДатаРождения)=День(ТекущаяДата()) и Месяц(КлДР.КЛиент.ДатаРождения)=Месяц(ТекущаяДата()) тогда
			Обл=Макет.ПолучитьОбласть("СтрокаПроживающиеДР");
			КлиентДР = Истина;	
		иначе
			Обл=Макет.ПолучитьОбласть("СтрокаПроживающие");
		конецесли;
		
		Если КлДР.Регистратор.Клиент2<>Справочники.Клиенты.ПустаяСсылка() тогда
			Клиент2Наименование = КлДР.Регистратор.Клиент2.Наименование;
			Если День(КлДР.Регистратор.Клиент2.ДатаРождения)=День(ТекущаяДата()) и Месяц(КлДР.Регистратор.Клиент2.ДатаРождения)=Месяц(ТекущаяДата()) тогда
				Обл=Макет.ПолучитьОбласть("СтрокаПроживающиеДР");
				Клиент2Наименование = Клиент2Наименование + " (ДР)";	
			конецесли;		
		КонецЕсли;
		
		ЗапросКолВаПроживаний.УстановитьПараметр("Клиент",КлДР.Клиент);	
		ТЗПрож=ЗапросКолВаПроживаний.Выполнить().Выгрузить();
		Обл.Параметры.КП=ТЗПрож[0].КолВо;
		
		ФИО = КлДР.Клиент.Наименование + ?(КлиентДР, " (ДР)", "");
		Если Клиент2Наименование <> "" Тогда 
			ФИО = ФИО + ", " + Клиент2Наименование;
		КонецЕсли;
		Обл.Параметры.ФИО=ФИО;
		
		Обл.Параметры.Автомобиль = КлДР.Клиент.Автомобиль;

		Обл.Параметры.Номер=КлДР.Номер.наименование;
		Обл.Параметры.примечание=КлДР.Регистратор.примечание;
		Обл.Параметры.Выезж=Формат(КлДР.Регистратор.РезервПо, "ДФ=dd.MM.yy")+" "+Формат(КлДР.Регистратор.ВремяВыездаТочное, "ДФ=HH:mm");
		Если НачалоДня(КлДР.Регистратор.РезервПо)=НачалоДня(ТекущаяДата()) тогда
			Обл.Область(0,0,0,5).ЦветФона=Новый Цвет(248, 0, 0);	
		конецесли;
		Если (КлДР.Регистратор.БезЗавтрака) тогда
			Обл.Область(0,3,0,3).ЦветФона=Новый Цвет(0, 248, 0);	
		конецесли;
		
		Обл.Параметры.Заезд=Формат(КлДР.Регистратор.РезервС, "ДФ=dd.MM.yy")+" "+Формат(КлДР.Регистратор.ВремяЗаездаТочное, "ДФ=HH:mm");
		
		Обл.Параметры.Долг = ДокументыСервер.РасчитатьДолг(КлДР.Регистратор);
		
		Обл.Параметры.Уборка=?(НачалоДня(КлДР.Регистратор.РезервПо)=НачалоДня(ТекущаяДата()),"Г","Т");
		Обл.Параметры.Чел=КлДР.Регистратор.КолВоЧеловек;
		Обл.Параметры.РК=КлДР.РК;
		Баллы=ОбщееСервер.ПолучитьБаллы(КлДР.Клиент);
		Обл.Параметры.Баллы=Баллы;
		
		РезультатСкидкаКлиента = ДокументыСервер.СкидкаКлиента(КлДР.Регистратор);
		СкидкаКлиента = РезультатСкидкаКлиента.Скидка;
		Обл.Параметры.СкидкаКлиента = СкидкаКлиента;
		Если (СкидкаКлиента <> 0) тогда
			Обл.Область(0,11,0,11).ЦветФона=Новый Цвет(225, 200, 150);	 
			Обл.Область(0,1,0,1).ЦветФона=Новый Цвет(255, 200, 200);	 
		конецесли;
		
		сч=сч+1;
		
		ПолеОтчета.Вывести(Обл);
	КонецЦикла; 
	
	ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	ЗанятостьНомеров.Клиент КАК Клиент,
	                               |	ЗанятостьНомеров.Номер КАК Номер,
	                               |	ЗанятостьНомеров.Регистратор КАК Регистратор,
	                               |	ЗанятостьНомеров.Регистратор.РаздельныеКровати КАК РК
	                               |ИЗ
	                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                               |ГДЕ
	                               |	ЗанятостьНомеров.Регистратор.РезервС МЕЖДУ &ДН И &ДК
	                               |	И ЗанятостьНомеров.Регистратор.Статус = &Статус
	                               |	И ЗанятостьНомеров.Регистратор.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
	                               |
	                               |УПОРЯДОЧИТЬ ПО
	                               |	ЗанятостьНомеров.Номер.Наименование");
	ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);			 								   
	ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
	ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));
	СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
	
	Макет = Отчеты.ОтчетПроживающие.ПолучитьМакет("Макет");
	
	Обл=Макет.ПолучитьОбласть("ШапкаЗаезжают");
	
	ПолеОтчета.Вывести(Обл);
	
	сч=1;
	Для каждого КлДР Из СписокПроживающих Цикл
		Обл=Макет.ПолучитьОбласть("СтрокаПроживающие");
		
		ЗапросКолВаПроживаний.УстановитьПараметр("Клиент",КлДР.Клиент);	
		ТЗПрож=ЗапросКолВаПроживаний.Выполнить().Выгрузить();
		Обл.Параметры.КП=ТЗПрож[0].КолВо;
		
		Обл.Параметры.ФИО=КлДР.Клиент.Наименование;
		
		Обл.Параметры.Автомобиль = КлДР.Клиент.Автомобиль;
		
		Обл.Параметры.Номер=КлДР.Номер.наименование;
		Обл.Параметры.Выезж=Формат(КлДР.Регистратор.РезервПо, "ДФ=dd.MM.yy")+" "+Формат(КлДР.Регистратор.ВремяВыездаТочное, "ДФ=HH:mm");
		Обл.Параметры.Заезд=Формат(КлДР.Регистратор.РезервС, "ДФ=dd.MM.yy")+" "+Формат(КлДР.Регистратор.ВремяЗаездаТочное, "ДФ=HH:mm");
		Если НачалоДня(КлДР.Регистратор.РезервПо)=НачалоДня(ТекущаяДата()) тогда
			Обл.Область(0,0,0,5).ЦветФона=Новый Цвет(248, 0, 0);	
		конецесли;
		Если (КлДР.Регистратор.БезЗавтрака) тогда
			Обл.Область(0,3,0,3).ЦветФона=Новый Цвет(0, 248, 0);	
		конецесли;
		
		Обл.Параметры.Долг = ДокументыСервер.РасчитатьДолг(КлДР.Регистратор);
		
		Обл.Параметры.Уборка=?(НачалоДня(КлДР.Регистратор.РезервПо)=НачалоДня(ТекущаяДата()),"Г","Т");
		Обл.Параметры.Чел=КлДР.Регистратор.КолВоЧеловек;
		Обл.Параметры.РК=КлДР.РК;
		Обл.Параметры.примечание=КлДР.Регистратор.примечание;
		Обл.Параметры.Баллы=ОбщееСервер.ПолучитьБаллы(КлДР.Клиент);
		
		РезультатСкидкаКлиента = ДокументыСервер.СкидкаКлиента(КлДР.Регистратор);
		СкидкаКлиента = РезультатСкидкаКлиента.Скидка;
		Обл.Параметры.СкидкаКлиента = СкидкаКлиента;
		Если (СкидкаКлиента <> 0) тогда
			Обл.Область(0,11,0,11).ЦветФона=Новый Цвет(225, 200, 150);	 
			Обл.Область(0,1,0,1).ЦветФона=Новый Цвет(255, 200, 200);	 
		конецесли;
			
		сч=сч+1;
		
		ПолеОтчета.Вывести(Обл);
		
		Если КлДР.Регистратор.Клиент2<>Справочники.Клиенты.ПустаяСсылка() тогда
			ЗапросКолВаПроживаний.УстановитьПараметр("Клиент",КлДР.Регистратор.Клиент2);	
			ТЗПрож=ЗапросКолВаПроживаний.Выполнить().Выгрузить();
			Обл.Параметры.КП=ТЗПрож[0].КолВо;
			
			Обл.Параметры.ФИО=КлДР.Регистратор.Клиент2.Наименование;
			
			Обл.Параметры.Автомобиль = КлДР.Регистратор.Клиент2.Автомобиль;
			
			Обл.Параметры.Номер=КлДР.Номер.наименование;
			Обл.Параметры.Выезж=Формат(КлДР.Регистратор.РезервПо, "ДФ=dd.MM.yy")+" "+Формат(КлДР.Регистратор.ВремяВыездаТочное, "ДФ=HH:mm");
			Обл.Параметры.Заезд=Формат(КлДР.Регистратор.РезервС, "ДФ=dd.MM.yy")+" "+Формат(КлДР.Регистратор.ВремяЗаездаТочное, "ДФ=HH:mm");
			Если НачалоДня(КлДР.Регистратор.РезервПо)=НачалоДня(ТекущаяДата()) тогда
				Обл.Область(0,0,0,5).ЦветФона=Новый Цвет(248, 0, 0);	
			конецесли;

			Обл.Параметры.Долг = ДокументыСервер.РасчитатьДолг(КлДР.Регистратор);
			
			Обл.Параметры.Уборка=?(НачалоДня(КлДР.Регистратор.РезервПо)=НачалоДня(ТекущаяДата()),"Г","Т");
			Обл.Параметры.Чел=КлДР.Регистратор.КолВоЧеловек;
			Обл.Параметры.примечание=КлДР.Регистратор.примечание;
			Обл.Параметры.Баллы=ОбщееСервер.ПолучитьБаллы(КлДР.Клиент);
			Обл.Параметры.РК=КлДР.РК;
			
		
			сч=сч+1;
			
			ПолеОтчета.Вывести(Обл);
			
		конецесли;
		
	КонецЦикла; 
	
	ПолеОтчета.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ПолеОтчета.ПолеСлева=1.5;
	ПолеОтчета.ПолеСправа=0;
	ПолеОтчета.МасштабПечати=80;

КонецФункции

&НаКлиенте
Процедура СформироватьТолькоБонусные(Команда)
Отчет(Истина);
КонецПроцедуры

//
&НаКлиенте
Процедура ПолеОтчетаВыбор___(Элемент, Область, СтандартнаяОбработка)
	//Если Область.Лево<=7 тогда
	//	СтандартнаяОбработка=ложь;
	//конецесли;
	//
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаВыбор(Элемент, Область, СтандартнаяОбработка)
	Если Область.Лево <= 7 тогда
		СтандартнаяОбработка=ложь;
	конецесли;
КонецПроцедуры
//
