
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Дата = ТекущаяДата();	
КонецПроцедуры



&НаКлиенте
Процедура Вывести(Команда)
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		ПоказатьПРедупреждение(,"Заполните дату");
		
		Возврат;
	КонецЕсли;
	
	ВывестиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВывестиНаСервере()
Макет = Обработки.ПолитикаЛояльности.ПолучитьМакет("Макет");
ТабДок = Новый ТабличныйДокумент;

Шапка = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Шапка);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	РезервСМаксимум.Клиент КАК Клиент,
                      |	РезервСМаксимум.Клиент.Телефон КАК КлиентТелефон,
                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
                      |	ЗаявкаНаБронирование.СкидкаКлиента КАК СкидкаКлиента,
                      |	ЗаявкаНаБронирование.УровеньСкидкиКлиента КАК УровеньСкидкиКлиента
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронирование.Клиент КАК Клиент,
                      |			МАКСИМУМ(ЗаявкаНаБронирование.РезервС) КАК РезервС
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		ГДЕ
                      |			ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |			И ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
                      |			И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                      |					ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает))
                      |			И ЗаявкаНаБронирование.СкидкаКлиента <> 0
					  //|			И НЕ ЗаявкаНаБронирование.Клиент.Наименование ПОДОБНО ""%Бон Шанс%""
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронирование.Клиент) КАК РезервСМаксимум
                      |		ПО ЗаявкаНаБронирование.Клиент = РезервСМаксимум.Клиент
                      |			И ЗаявкаНаБронирование.РезервС = РезервСМаксимум.РезервС
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.СкидкаКлиента <> 0
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	РезервС,
                      |	Клиент");

ЗапросИсторияПроживаний = Новый Запрос("ВЫБРАТЬ
                                       |	ЗаявкаНаБронирование.Ссылка КАК Заявка
                                       |ИЗ
                                       |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                                       |ГДЕ
                                       |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                                       |	И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                                       |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает))
                                       |	И ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
                                       |	И ЗаявкаНаБронирование.Клиент = &Клиент
                                       |
                                       |УПОРЯДОЧИТЬ ПО
                                       |	ЗаявкаНаБронирование.РезервС");

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	СтрокаОтчета = Макет.ПолучитьОбласть("Строка");
	СтрокаОтчета.Параметры.Гость = Строка.Клиент;
	СтрокаОтчета.Параметры.Телефон = Строка.КлиентТелефон;
	СтрокаОтчета.Параметры.Уровень = Строка.СкидкаКлиента;
	СтрокаОтчета.Параметры.Скидка = Строка.УровеньСкидкиКлиента;
	СтрокаОтчета.Параметры.ДатаПоследнегоЗаезда = Формат(Строка.РезервС, "ДФ=dd.MM.yyyy");
	СтрокаОтчета.Параметры.ДатаПоследнегоВыезда = Формат(Строка.РезервПо, "ДФ=dd.MM.yyyy");
	
	ЗапросИсторияПроживаний.УстановитьПараметр("Клиент", Строка.Клиент);
	ТЗ = ЗапросИсторияПроживаний.Выполнить().Выгрузить();
	
	ИсторияПроживаний = "";
	Для Каждого СтрокаИсторияПроживаний Из ТЗ Цикл
		ИсторияПроживаний = ИсторияПроживаний + Символы.ПС 
			+ "Заявка № " + СтрокаИсторияПроживаний.Заявка.Номер + " от " + Формат(СтрокаИсторияПроживаний.Заявка.Дата, "ДФ=dd.MM.yy")
			+ " , Резерв С " + Формат(СтрокаИсторияПроживаний.Заявка.РезервС, "ДФ=dd.MM.yy") 
			+ " , Резерв По " + Формат(СтрокаИсторияПроживаний.Заявка.РезервПо, "ДФ=dd.MM.yy") 
	КонецЦикла;
	Если ИсторияПроживаний <> "" Тогда	
		ИсторияПроживаний = Сред(ИсторияПроживаний, 2);
	КонецЕсли;
	
	СтрокаОтчета.Параметры.ИсторияПроживаний = ИсторияПроживаний;
	
	
	ТабДок.Вывести( СтрокаОтчета);
КонецЦикла;

ПолеОтчета = ТабДок;
Возврат;
//
СтрокаОтчета = Макет.ПолучитьОбласть("Проживают");
ТабДок.Вывести(СтрокаОтчета);

ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
                               |	ЗанятостьНомеров.Клиент КАК Клиент,
                               |	ЗанятостьНомеров.Номер КАК Номер,
                               |	ЗанятостьНомеров.Регистратор КАК Регистратор,
                               |	ЗанятостьНомеров.Регистратор.РаздельныеКровати КАК РК
                               |ИЗ
                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                               |ГДЕ
                               |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
                               |	И ЗанятостьНомеров.Регистратор.Статус = &Статус
                               |	И ЗанятостьНомеров.Регистратор.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
                               |
                               |УПОРЯДОЧИТЬ ПО
                               |	ЗанятостьНомеров.Номер.Наименование");
ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(Дата));			 
ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(Дата));

СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();

ЗапросИсторияПроживаний = Новый Запрос("ВЫБРАТЬ
                                       |	ЗаявкаНаБронирование.Ссылка КАК Заявка
                                       |ИЗ
                                       |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                                       |ГДЕ
                                       |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                                       |	И ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                                       |	И ЗаявкаНаБронирование.РезервС <= &Дата
                                       |	И ЗаявкаНаБронирование.Клиент = &Клиент
                                       |
                                       |УПОРЯДОЧИТЬ ПО
                                       |	ЗаявкаНаБронирование.РезервС");

ЗапросИсторияПроживаний.УстановитьПараметр("Дата", НачалоДня(Дата));

Для Каждого Строка Из СписокПроживающих Цикл
	СтрокаОтчета = Макет.ПолучитьОбласть("Строка");
	СтрокаОтчета.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	
	Результат = ДокументыСервер.СкидкаКлиента(Строка.Регистратор);
	СкидкаКлиента = Результат.Скидка;
	Если СкидкаКлиента = 0 Тогда Продолжить; КонецЕсли;
	
	СтрокаОтчета.Параметры.Скидка = СкидкаКлиента;
	СтрокаОтчета.Параметры.Уровень = СкидкаКлиента;
	
	СтрокаОтчета.Параметры.Гость = Строка.Клиент;
	СтрокаОтчета.Параметры.Телефон = Строка.Клиент.Телефон;

	ЗапросИсторияПроживаний.УстановитьПараметр("Клиент", Строка.Клиент);
	ТЗ = ЗапросИсторияПроживаний.Выполнить().Выгрузить();
	
	ИсторияПроживаний = "";
	Для Каждого СтрокаИсторияПроживаний Из ТЗ Цикл
		ИсторияПроживаний = ИсторияПроживаний + Символы.ПС 
			+ "Заявка № " + СтрокаИсторияПроживаний.Заявка.Номер + " от " + Формат(СтрокаИсторияПроживаний.Заявка.Дата, "ДФ=dd.MM.yy")
			+ " , Резерв С " + Формат(СтрокаИсторияПроживаний.Заявка.РезервС, "ДФ=dd.MM.yy") 
			+ " , Резерв По " + Формат(СтрокаИсторияПроживаний.Заявка.РезервПо, "ДФ=dd.MM.yy") 
	КонецЦикла;
	Если ИсторияПроживаний <> "" Тогда	
		ИсторияПроживаний = Сред(ИсторияПроживаний, 2);
	КонецЕсли;
	
	СтрокаОтчета.Параметры.ИсторияПроживаний = ИсторияПроживаний;
	
	ТабДок.Вывести( СтрокаОтчета);
КонецЦикла;
//

//
СтрокаОтчета = Макет.ПолучитьОбласть("Заезжают");
ТабДок.Вывести(СтрокаОтчета);

ЗапросЗаезжающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
                               |	ЗанятостьНомеров.Клиент КАК Клиент,
                               |	ЗанятостьНомеров.Номер КАК Номер,
                               |	ЗанятостьНомеров.Регистратор КАК Регистратор,
                               |	ЗанятостьНомеров.Регистратор.РаздельныеКровати КАК РК
                               |ИЗ
                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                               |ГДЕ
                               |	ЗанятостьНомеров.Регистратор.РезервС МЕЖДУ &ДН И &ДК
                               |	И ЗанятостьНомеров.Регистратор.Статус = &Статус
                               |	И ЗанятостьНомеров.Регистратор.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
                               |
                               |УПОРЯДОЧИТЬ ПО
                               |	ЗанятостьНомеров.Номер.Наименование");
ЗапросЗаезжающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);			 								   
ЗапросЗаезжающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
ЗапросЗаезжающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));
ЗапросЗаезжающих=ЗапросПроживающих.Выполнить().Выгрузить();


Для Каждого Строка Из ЗапросЗаезжающих Цикл
	СтрокаОтчета = Макет.ПолучитьОбласть("Строка");
	СтрокаОтчета.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	
	Результат = ДокументыСервер.СкидкаКлиента(Строка.Регистратор);
	СкидкаКлиента = Результат.Скидка;
	Если СкидкаКлиента = 0 Тогда Продолжить; КонецЕсли;
	
	СтрокаОтчета.Параметры.Скидка = СкидкаКлиента;
	СтрокаОтчета.Параметры.Уровень = СкидкаКлиента;
	
	СтрокаОтчета.Параметры.Гость = Строка.Клиент;
	СтрокаОтчета.Параметры.Телефон = Строка.Клиент.Телефон;

	ЗапросИсторияПроживаний.УстановитьПараметр("Клиент", Строка.Клиент);
	ТЗ = ЗапросИсторияПроживаний.Выполнить().Выгрузить();
	
	ИсторияПроживаний = "";
	Для Каждого СтрокаИсторияПроживаний Из ТЗ Цикл
		ИсторияПроживаний = ИсторияПроживаний + Символы.ПС 
			+ "Заявка № " + СтрокаИсторияПроживаний.Заявка.Номер + " от " + Формат(СтрокаИсторияПроживаний.Заявка.Дата, "ДФ=dd.MM.yy")
			+ " , Резерв С " + Формат(СтрокаИсторияПроживаний.Заявка.РезервС, "ДФ=dd.MM.yy") 
			+ " , Резерв По " + Формат(СтрокаИсторияПроживаний.Заявка.РезервПо, "ДФ=dd.MM.yy") 
	КонецЦикла;
	Если ИсторияПроживаний <> "" Тогда	
		ИсторияПроживаний = Сред(ИсторияПроживаний, 2);
	КонецЕсли;
	
	СтрокаОтчета.Параметры.ИсторияПроживаний = ИсторияПроживаний;
	
	ТабДок.Вывести( СтрокаОтчета);
КонецЦикла;

ПолеОтчета = ТабДок;
КонецПроцедуры

