
//
Функция УзелОбменаТекущий()
Узел = ПланыОбмена.ВГ_ВыпискаГостиницы.НайтиПоКоду("БУХ");
Возврат Узел;
КонецФункции	

Функция ВыполнитьВыгрузкуУзла() Экспорт
Узел = УзелОбменаТекущий();
УзелОбмена = Узел.ПолучитьОбъект();

// Записать новое сообщение обмена.
Результат = УзелОбмена.ЗаписатьСообщениеПодтверждения();

Возврат Результат;
КонецФункции

Функция ВыполнитьЗагрузкуУзла() Экспорт
Узел = УзелОбменаТекущий();
УзелОбмена = Узел.ПолучитьОбъект();

// Прочитать новое сообщение обмена.
Результат = УзелОбмена.ПрочитатьСообщениеСИзменениями();

Возврат Результат;
КонецФункции

Функция ВыполнитьОбменДанными() Экспорт
Узел = УзелОбменаТекущий();
УзелОбмена = Узел.ПолучитьОбъект();

Результат = Новый Структура("РезультатЧтения, РезультатЗаписи", Неопределено, Неопределено); 

РезультатЧтения = УзелОбмена.ПрочитатьСообщениеСИзменениями();
Результат.РезультатЧтения = РезультатЧтения;

Если РезультатЧтения.Ошибка Тогда 
	Если НЕ (РезультатЧтения.КодОшибки = 1 ИЛИ РезультатЧтения.КодОшибки = 30) Тогда Возврат Результат; КонецЕсли;
КонецЕсли;
	
РезультатЗаписи = УзелОбмена.ЗаписатьСообщениеПодтверждения();
Результат.РезультатЗаписи = РезультатЗаписи;

Возврат Результат;
КонецФункции
//

//
Функция ВозможностьЧтенияДанных(ЧтениеXML) Экспорт
// Получить тип данных XML, который может быть считан в данный момент.
ТипXML = ПолучитьXMLТип(ЧтениеXML);

Если ТипXML = Неопределено Тогда
	Возврат Ложь;
КонецЕсли;

Если ТипXML.ИмяТипа = "DocumentObject.Выписка.Вручную" И ТипXML.URIПространстваИмен = "" Тогда
	Возврат Истина;
КонецЕсли;

Возврат ВозможностьЧтенияXML(ЧтениеXML);
КонецФункции

Функция ПрочитатьДанные(ЧтениеXML) Экспорт
ТипXML = ПолучитьXMLТип(ЧтениеXML);

Если ТипXML = Неопределено Тогда
	Возврат Неопределено;
КонецЕсли;

Если ТипXML.ИмяТипа = "DocumentObject.Выписка.Вручную" И ТипXML.URIПространстваИмен = "" Тогда
	Возврат ПрочитатьXMLВыписка(ЧтениеXML);
КонецЕсли;

// Прочитать значение из объекта ЧтениеXML стандартным образом.
//Возврат ПрочитатьXML(ЧтениеXML);
КонецФункции

Функция ПрочитатьXMLВыписка(ЧтениеXML) Экспорт
Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
	ВызватьИсключение "Ошибка чтения XML";
КонецЕсли;

// Прочитать следующий узел XML-документа.
ЧтениеXML.Прочитать();

Удаление = ПрочитатьXML(ЧтениеXML);

// Прочитать ссылку на элемент справочника Номенклатура.
ВыпискаСсылка = ПрочитатьXML(ЧтениеXML);
//Если ТипЗнч(ВыпискаСсылка) <> Тип("ДокументСсылка.Выписка") Тогда
//	ВызватьИсключение "Ошибка чтения XML";
//КонецЕсли;

РезультатВыписка = Новый Структура();

РезультатВыписка.Вставить("Удаление", Удаление); 
РезультатВыписка.Вставить("ВыпискаСсылка", ВыпискаСсылка); 

Если НЕ Удаление Тогда
	ПометкаУдаления = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("ПометкаУдаления", ПометкаУдаления); 
	
	ВыпискаДата = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("ДатаДокументаИсточника", ВыпискаДата); 

	ВыпискаНомер = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("НомерДокументаИсточника", ВыпискаНомер); 

	ВыпискаОрганизация = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("Организация", ВыпискаОрганизация); 

	ВыпискаОрганизацияИНН = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("ОрганизацияИНН", ВыпискаОрганизацияИНН); 

	ВыпискаОрганизацияКПП = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("ОрганизацияКПП", ВыпискаОрганизацияКПП); 
	
	ВыпискаСумма = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("Сумма", ВыпискаСумма); 

	КонтрагентНаименование = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("КонтрагентНаименование", КонтрагентНаименование); 
	
	КонтрагентИНН = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("КонтрагентИНН", КонтрагентИНН); 
	
	КонтрагентКПП = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("КонтрагентКПП", КонтрагентКПП); 
	
	ДатаОплаты = ПрочитатьXML(ЧтениеXML);
	// + Аудит
	//РезультатВыписка.Вставить("ДатаОплаты ", ДатаОплаты); 
	РезультатВыписка.Вставить("ДатаОплаты", ДатаОплаты); 
	// - Аудит
	
	ТекстПлатежа  = ПрочитатьXML(ЧтениеXML);
	РезультатВыписка.Вставить("ТекстПлатежа", ТекстПлатежа); 
КонецЕсли;

// Проверить, что текущим узлом является КонецЭлемента.
Если ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Тогда
	ВызватьИсключение "Ошибка чтения XML";
КонецЕсли;

// Прочитать следующий узел для завершение чтения элемента XML-документа.
ЧтениеXML.Прочитать();

Возврат РезультатВыписка;
КонецФункции  

Функция ЗаписатьПолученныеДанные(РезультатВыписка) Экспорт
ОтборСтроки = Новый Структура("ГУИДИсточникаСтрока", РезультатВыписка.ВыпискаСсылка);	
Выборка = РегистрыСведений.БезналЗагрузка.Выбрать(ОтборСтроки);

Если РезультатВыписка.Удаление Тогда 
	Если Выборка.Следующий() Тогда
		НаборЗаписей = РегистрыСведений.БезналЗагрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ГУИД.Установить(Выборка.ГУИД);
		НаборЗаписей.Прочитать();
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;

		НаборЗаписей.Очистить();
	КонецЕсли; 
	
	Возврат -1;
КонецЕсли;	

Если Выборка.Следующий() Тогда
	НаборЗаписей = РегистрыСведений.БезналЗагрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГУИД.Установить(Выборка.ГУИД);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Запись = НаборЗаписей[0];
	Запись.ДатаИзменения = ТекущаяДата();
	
	Изменение = 1;	
Иначе	
	НаборЗаписей = РегистрыСведений.БезналЗагрузка.СоздатьНаборЗаписей();
	ГУИД = Новый УникальныйИдентификатор(); 
	НаборЗаписей.Отбор.ГУИД.Установить(ГУИД);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;

	Запись = НаборЗаписей.Добавить(); 
	Запись.ГУИД = ГУИД;
	Запись.ГУИДИсточникаСтрока = РезультатВыписка.ВыпискаСсылка;
	Запись.ИсточникПлатежа = "БУХГАЛТЕРИЯ";
	
	Изменение = 0;
КонецЕсли;

Запись.ДатаЗагрузки = ТекущаяДата();

ЗаполнитьЗначенияСвойств(Запись, РезультатВыписка);

НаборЗаписей.Записать(Истина);

Возврат Изменение;
КонецФункции
//


// + ====== Шаблоны ======

Функция ПринятьИзменения(Отправитель, Данные) Экспорт
Прием = Истина;

//// Проверить зарегистрировано ли изменение данных для отправителя.
//Если ПланыОбмена.ИзменениеЗарегистрировано(Отправитель, Данные) Тогда
//	
//	// Разрешить получение данных только от главного узла.
//	Если Не Отправитель.Главный Тогда
//		Прием = Ложь;
//	КонецЕсли;
//КонецЕсли;

Возврат Прием;
КонецФункции

Функция НуженПереносДанных(Получатель, Данные) Экспорт
Перенос = Истина;

//Склад = Получатель.Склад;

//Если ТипЗнч(Данные) = Тип("ДокументОбъект.ПриходнаяНакладная")
//ИЛИ  ТипЗнч(Данные) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда

//	// Проверить, совпадает ли склад документов со складом узла обмена.
//	Если Не Склад.Пустая() И Данные.Склад <> Склад Тогда
//		Перенос = Ложь;
//	КонецЕсли;    

//КонецЕсли;

Возврат Перенос;
КонецФункции

Функция НуженПереносДанных_1(Получатель, Данные) Экспорт
Перенос = Истина;
Склад = Получатель.Склад;

Если ТипЗнч(Данные) = Тип("ДокументОбъект.ПриходнаяНакладная")
ИЛИ  ТипЗнч(Данные) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда

	// Проверить, совпадает ли склад документов со складом узла обмена.
	Если Не Склад.Пустая() И Данные.Склад <> Склад Тогда
		Перенос = Ложь;
	КонецЕсли;    

//ИначеЕсли ТипЗнч(Данные) = Тип("РегистрНакопленияНаборЗаписей.УчетНоменклатуры") Тогда
//	// Проверить, что у всех записей набора склад один и тот же.
//	СкладНабора = Неопределено;
//	Для Каждого Запись Из Данные Цикл
//		Если СкладНабора <> Неопределено И Запись.Склад <> СкладНабора Тогда
//			ВызватьИсключение "Склад должен быть одинаковый для всех записей";
//		КонецЕсли;
//		СкладНабора = Запись.Склад;
//	КонецЦикла;
//	
//	// Проверить, совпадает ли склад набора записей со складом узла обмена.
//	Если Не Склад.Пустая() И СкладНабора <> Склад Тогда
//		Перенос = Ложь;
//	КонецЕсли;    
КонецЕсли;

Возврат Перенос;
КонецФункции

Процедура УдалениеДанных(Данные) Экспорт
// Получить объект описания метаданного, соответствующий данным.
ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());

Если 
//	Метаданные.Справочники.Содержит(ОбъектМетаданных)
//ИЛИ 
Метаданные.Документы.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) 
Тогда
	// Записать удаление объекта для объектных данных.
	Данные = Новый УдалениеОбъекта(Данные.Ссылка);
КонецЕсли;    
КонецПроцедуры

Процедура УдалениеДанных_1(Данные) Экспорт
// Получить объект описания метаданного, соответствующий данным.
ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());

Если Метаданные.Справочники.Содержит(ОбъектМетаданных)
ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных)
ИЛИ Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных)
ИЛИ Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных)
ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
	// Записать удаление объекта для объектных данных.
	Данные = Новый УдалениеОбъекта(Данные.Ссылка);
	
//ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных.Родитель)
//ИЛИ Метаданные.Последовательности.Содержит(ОбъектМетаданных) Тогда
//	// Очистить данные.
//	Данные.Очистить();
КонецЕсли;    
КонецПроцедуры

Процедура ЗаписатьДанные(ЗаписьXML, Данные) Экспорт
//Удаление = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Истина, Ложь);

//// Получить объект описания метаданного, соответствующий данным.
//ОбъектМетаданных = ?(Удаление, Данные.Ссылка.Метаданные(), Данные.Метаданные());

//Если Не Удаление И ОбъектМетаданных = Метаданные.Справочники.Номенклатура Тогда
//	// Записать элемент справочника вручную.
//	ЗаписатьXMLНоменклатура(ЗаписьXML, Данные);
//Иначе
	// Записать данные с помощью стандартного метода.
	ЗаписатьXML(ЗаписьXML, Данные);
//КонецЕсли
КонецПроцедуры

Процедура ЗаписатьДанные_1(ЗаписьXML, Данные) Экспорт
Удаление = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Истина, Ложь);

// Получить объект описания метаданного, соответствующий данным.
ОбъектМетаданных = ?(Удаление, Данные.Ссылка.Метаданные(), Данные.Метаданные());

Если Не Удаление И ОбъектМетаданных = Метаданные.Справочники.Номенклатура Тогда
	// Записать элемент справочника вручную.
	ЗаписатьXMLНоменклатура(ЗаписьXML, Данные);
Иначе
	// Записать данные с помощью стандартного метода.
	ЗаписатьXML(ЗаписьXML, Данные);
КонецЕсли
КонецПроцедуры

Процедура ЗаписатьXMLНоменклатура(ЗаписьXML, Товар) Экспорт
// Записать начало элемента XML.
ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Номенклатура.Вручную");

// Ссылка
ЗаписатьXML(ЗаписьXML, Товар.Ссылка, "Ref", НазначениеТипаXML.Явное);

// ЭтоГруппа
ЗаписатьXML(ЗаписьXML, Товар.ЭтоГруппа, "IsFolder", НазначениеТипаXML.Явное);

// Родитель
ЗаписатьXML(ЗаписьXML, Товар.Родитель, "Parent", НазначениеТипаXML.Явное);

// Наименование
ЗаписатьXML(ЗаписьXML, Товар.Наименование, "Description", НазначениеТипаXML.Явное);

// Код
ЗаписатьXML(ЗаписьXML, Товар.Код, "Code", НазначениеТипаXML.Явное);

// Записать реквизиты, выгружаемые только для элемента справочника.
Если Не Товар.ЭтоГруппа Тогда
	// ЗакупочнаяЦена
	ЗаписатьXML(ЗаписьXML, Товар.ЗакупочнаяЦена, "ЗакупочнаяЦена", НазначениеТипаXML.Явное);

	//// ФайлКартинки
	//ЗаписатьXML(ЗаписьXML, Товар.ФайлКартинки, "ФайлКартинки", НазначениеТипаXML.Явное);

	//// Картинка
	//ЗаписатьXML(ЗаписьXML, Товар.Картинка, "Картинка", НазначениеТипаXML.Явное);
КонецЕсли;    

// Записать конец элемента.
ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры
// - ====== Шаблоны ======
