
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаС = НачалоМесяца(ТекущаяДата());
ДатаС_OldValue = ДатаС;

ДатаПо = НачалоДня(ТекущаяДата());

ВидЦеныДолгосрочный = Перечисления.КалендарьЦенВидЦены.ДолгосрочнаяЦена;
ВидЦеныТекущий = Перечисления.КалендарьЦенВидЦены.ТекущаяЦена;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
ВыполнитьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандаНаСервере()
	ПолеОтчетаПоИзменениям.Очистить();
	
	ДТН = ДатаС;
	ДТК = ДатаПо;
	
	ИмяОбработки = ОбщийФункционалКлиентСервер.ИмяОбработки(ЭтаФорма);
	Макет = Обработки[ИмяОбработки].ПолучитьМакет("ОтчетПоИзменениюЦен");
	
	ТабДок = Новый ТабличныйДокумент;
	
	Область = Макет.ПолучитьОбласть("Шапка|Лево");
	ТабДок.Вывести(Область);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КатегорииНомеров.Ссылка КАК КатегорияНомера,
	                      |	КатегорииНомеров.Базовый КАК Базовый,
	                      |	КатегорииНомеров.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
	                      |ГДЕ
	                      |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КатегорииНомеров.Номер_пп");
	
	ТЗ_Категории = Запрос.Выполнить().Выгрузить();
	ТЗ_Категории.Колонки.Добавить("ДоплатаЗаКатегорию");
	ТЗ_Категории.Колонки.Добавить("Автор");
	ТЗ_Категории.Колонки.Добавить("ДатаВремяИзменения");
	
	Для Каждого Строка Из ТЗ_Категории Цикл
		Область = Макет.ПолучитьОбласть("Шапка|КатегорияНомера");
		Область.Параметры.КатегорияНомера = Строка.Наименование;
		ТабДок.Присоединить(Область)		
	КонецЦикла;
	
	ДТ_С = ДТН;
	Пока ДТ_С <= ДТК цикл
		Результат = ПолучитьИзменения(ДТ_С, ТЗ_Категории, ВидЦеныДолгосрочный);
		Если Результат <> Неопределено Тогда 
			ВывестиСтрокуОтчета(ТабДок, Макет, ВидЦеныДолгосрочный, ДТ_С, Результат);
		КонецЕсли; 		
		
		Результат = ПолучитьИзменения(ДТ_С, ТЗ_Категории, ВидЦеныТекущий);
		Если Результат <> Неопределено Тогда 
			ВывестиСтрокуОтчета(ТабДок, Макет, ВидЦеныТекущий, ДТ_С, Результат);
		КонецЕсли; 		
		
~ПРОДОЛЖИТЬ:		
		ДТ_С = ДТ_С + 86400;	
	КонецЦикла;

	ПолеОтчетаПоИзменениям.Вывести(ТабДок);    
	
	Если НастройкиСервер.ЭтоЛайв() Тогда
		ПолеОтчетаПоИзменениям.Область(,6,,6).Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокуОтчета(ТабДок, Макет, ВидЦены, ДТ_С, Результат)       
Область = Макет.ПолучитьОбласть("Строка|Лево");

Область.Параметры.ДатаИзменения = Формат(ДТ_С, "ДФ=dd.MM.yy");
Область.Параметры.ВидЦены = ВидЦены;

ТЗ_Авторы = Новый ТаблицаЗначений;
ТЗ_Авторы.Колонки.Добавить("Автор");

Если Результат.БазоваяЦена <> Неопределено Тогда
	Область.Параметры.БазоваяЦена = Результат.БазоваяЦена.ЦенаДоплата;
	
	НовыйАвтор = ТЗ_Авторы.Добавить();
	НовыйАвтор.Автор =  Результат.БазоваяЦена.Автор; 
КонецЕсли;

АвторДоплатаЗаДвухместный = Справочники.Пользователи.ПустаяСсылка(); 
Если Результат.ДоплатаЗаДвухместный <> Неопределено Тогда
	Область.Параметры.ДоплатаЗаДвухместный = Результат.ДоплатаЗаДвухместный.ЦенаДоплата;
	
	НовыйАвтор = ТЗ_Авторы.Добавить();
	НовыйАвтор.Автор =  Результат.ДоплатаЗаДвухместный.Автор; 
КонецЕсли;
	
АвторДоплатаЗаЗавтрак = Справочники.Пользователи.ПустаяСсылка(); 
Если Результат.ДоплатаЗаЗавтрак <> Неопределено Тогда
	Область.Параметры.ДоплатаЗаЗавтрак = Результат.ДоплатаЗаЗавтрак.ЦенаДоплата;
	
	НовыйАвтор = ТЗ_Авторы.Добавить();
	НовыйАвтор.Автор =  Результат.ДоплатаЗаЗавтрак.Автор; 
КонецЕсли;
                                     
Для Каждого Строка Из Результат.Категории Цикл
	Если Строка.Автор = Неопределено Тогда Продолжить; КонецЕсли;
	
	НовыйАвтор = ТЗ_Авторы.Добавить();
	НовыйАвтор.Автор =  Строка.Автор; 			
КонецЦикла;

ТЗ_Авторы.Свернуть("Автор"); 
Если ТЗ_Авторы.Количество() = 1	Тогда	
	Область.Параметры.Автор = ТЗ_Авторы[0].Автор;
ИначеЕсли ТЗ_Авторы.Количество() > 1	Тогда	 
	Область.Параметры.Автор = "***";
КонецЕсли;	                                  
	
ТабДок.Вывести(Область);           

Для Каждого Строка Из Результат.Категории Цикл
	Область = Макет.ПолучитьОбласть("Строка|КатегорияНомера");
	Область.Параметры.ДоплатаЗаКатегорию = Строка.ДоплатаЗаКатегорию;
	ТабДок.Присоединить(Область)		
КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьИзменения(ДатаЦены, Категории, ВидЦены)
БазоваяЦена = ПолучитьЦенаТипЦены(ДатаЦены, Перечисления.КалендарьЦенТипЦены.БазоваяЦена, ВидЦены);
ДоплатаЗаДвухместный = ПолучитьЦенаТипЦены(ДатаЦены, Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный, ВидЦены);
ДоплатаЗаЗавтрак = ПолучитьЦенаТипЦены(ДатаЦены, Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак, ВидЦены);

НетДоплатаЗаКатегорию = Истина;
Для Каждого Строка Из Категории Цикл
	
	Результат = ПолучитьДоплатаЗаКатегорию(ДатаЦены, Строка.КатегорияНомера, ВидЦены);
	Если Результат <> Неопределено Тогда
	
		Строка.ДоплатаЗаКатегорию = Результат.ДоплатаЗаКатегорию;
		Строка.Автор = Результат.Автор;
	
		НетДоплатаЗаКатегорию = Ложь;
	КонецЕсли;
	
КонецЦикла;	

Если БазоваяЦена = Неопределено 
И ДоплатаЗаДвухместный = Неопределено 
И ДоплатаЗаЗавтрак = Неопределено 
И НетДоплатаЗаКатегорию  
Тогда Возврат Неопределено; КонецЕсли;

Результат = Новый Структура("БазоваяЦена, ДоплатаЗаДвухместный, ДоплатаЗаЗавтрак, Категории"
	, БазоваяЦена, ДоплатаЗаДвухместный, ДоплатаЗаЗавтрак, Категории);
	
Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьЦенаТипЦены(ДатаЦены, ТипЦены, ВидЦены)
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	КалендарьЦенБазовыйИстория.ДатаЦены КАК ДатаЦены,
                      |	КалендарьЦенБазовыйИстория.ТипЦены КАК ТипЦены,
                      |	КалендарьЦенБазовыйИстория.ДатаВремяИзменения КАК ДатаВремяИзменения,
                      |	КалендарьЦенБазовыйИстория.ЦенаДоплата КАК ЦенаДоплата,
                      |	КалендарьЦенБазовыйИстория.Автор КАК Автор
                      |ИЗ
                      |	РегистрСведений.КалендарьЦенБазовыйИстория КАК КалендарьЦенБазовыйИстория
                      |ГДЕ
                      |	КалендарьЦенБазовыйИстория.ДатаЦены = &ДатаЦены
                      |	И КалендарьЦенБазовыйИстория.ТипЦены = &ТипЦены
                      |	И КалендарьЦенБазовыйИстория.ВидЦены = &ВидЦены
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаВремяИзменения УБЫВ");

Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены); 
Запрос.УстановитьПараметр("ТипЦены", ТипЦены); 
Запрос.УстановитьПараметр("ВидЦены", ВидЦены); 

Выборка = Запрос.Выполнить().Выбрать();
Если НЕ Выборка.Следующий() Тогда 
	Возврат Неопределено;
КонецЕсли;

Результат = Новый Структура("ЦенаДоплата, Автор, ДатаВремяИзменения", Выборка.ЦенаДоплата, Выборка.Автор, Выборка.ДатаВремяИзменения);  
Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьДоплатаЗаКатегорию(ДатаЦены, КатегорияНомера, ВидЦены)
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	КалендарьЦенКатегорииИстория.ДатаЦены КАК ДатаЦены,
                      |	КалендарьЦенКатегорииИстория.КатегорияНомера КАК КатегорияНомера,
                      |	КалендарьЦенКатегорииИстория.ДатаВремяИзменения КАК ДатаВремяИзменения,
                      |	КалендарьЦенКатегорииИстория.ДоплатаЗаКатегорию КАК ДоплатаЗаКатегорию,
                      |	КалендарьЦенКатегорииИстория.Автор КАК Автор
                      |ИЗ
                      |	РегистрСведений.КалендарьЦенКатегорииИстория КАК КалендарьЦенКатегорииИстория
                      |ГДЕ
                      |	КалендарьЦенКатегорииИстория.ДатаЦены = &ДатаЦены
                      |	И КалендарьЦенКатегорииИстория.КатегорияНомера = &КатегорияНомера
                      |	И КалендарьЦенКатегорииИстория.ВидЦены = &ВидЦены
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаВремяИзменения УБЫВ");

Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены); 
Запрос.УстановитьПараметр("КатегорияНомера", КатегорияНомера); 
Запрос.УстановитьПараметр("ВидЦены", ВидЦены);

Выборка = Запрос.Выполнить().Выбрать();

Если НЕ Выборка.Следующий() Тогда 
	Возврат Неопределено;
КонецЕсли;

Результат = Новый Структура("ДоплатаЗаКатегорию, Автор, ДатаВремяИзменения", Выборка.ДоплатаЗаКатегорию, Выборка.Автор, Выборка.ДатаВремяИзменения);  
Возврат Результат;
КонецФункции

&НаСервере
Функция ВывестиИзмененияПоКатегории_НеИспользуется(ДТН, ДТК, КатегорияНомера, Макет, ВидЦены)
	БТ			= КатегорияНомера.БазовыйТарифБудни;
	БТ_Вых		= КатегорияНомера.БазовыйТарифВыходные;
	БТ_Двух		= КатегорияНомера.БазовыйТарифБудниДвух;
	БТ_Вых_Двух	= КатегорияНомера.БазовыйТарифВыходныеДвух;	
	
	ДатаЦеныНачалоГода = НачалоГода(ДТН);
	КалендарьЦен.ЗаполнитьТЗБазовыеЦены(ТЗБазовыеЦены, ДатаЦеныНачалоГода, КатегорияНомера, Ложь);
	
	Категория = КатегорияНомера.Наименование;
	
	ТабДок=Новый ТабличныйДокумент;	
	Обл=Макет.ПолучитьОбласть("Строка1|ШапкаВерх");	
	Обл.Параметры.Катагория=Категория;
	ТабДок.Присоединить(Обл);
	
	ДТ_С=ДТН;
	Пока ДТ_С <= ДТК цикл
		Обл=Макет.ПолучитьОбласть("Строка1|ДатаЦены");
		
		//Обл.Параметры.Цена = Формат(?(ДеньНедели(ДТ_С)<5,БТ,БТ_Вых), "ЧГ=");
		//Обл.Параметры.Цена2=Формат(?(ДеньНедели(ДТ_С)<5,БТ_Двух,БТ_Вых_Двух), "ЧГ=");
		
		Результат = КалендарьЦен.БазоваяЦенаДня(ДТ_С, ТЗБазовыеЦены, БТ, БТ_Вых, БТ_Двух, БТ_Вых_Двух);
		
		Обл.Параметры.Цена = Результат.БазоваяЦенаДняОдноместный;
		Обл.Параметры.Цена2 = Результат.БазоваяЦенаДняДвухместный;
		
		ТабДок.Присоединить(Обл);
		ДТ_С=ДТ_С + 86400;	
	КонецЦикла; 
	
	//ЭлементыФормы.ПолеОтчетаПоИзменениям.Вывести(ТабДок);
	ПолеОтчетаПоИзменениям.Вывести(ТабДок);
	
	ЗапросИзменений=Новый Запрос("ВЫБРАТЬ
	                             |	ИзменениеЦеныДатаЦены.Процент,
	                             |	ИзменениеЦеныДатаЦены.Ссылка.Дата КАК ДатаВремяИзменения,
	                             |	НАЧАЛОПЕРИОДА(ИзменениеЦеныДатаЦены.Ссылка.Дата, ДЕНЬ) КАК ДатаИзменения,
	                             |	ИзменениеЦеныДатаЦены.ДатаЦены,
	                             |	ИзменениеЦеныДатаЦены.Двухместный
	                             |ИЗ
	                             |	Документ.ИзменениеЦены.ДатаЦены КАК ИзменениеЦеныДатаЦены
	                             |ГДЕ
	                             |	ИзменениеЦеныДатаЦены.ДатаЦены МЕЖДУ &ДН И &ДК
	                             |	И ИзменениеЦеныДатаЦены.Категория = &Категория");	
	
	ЗапросИзменений.УстановитьПараметр("ДН",НачалоДня(ДТН));								 
	ЗапросИзменений.УстановитьПараметр("ДК",НачалоДня(ДТК));
	ЗапросИзменений.УстановитьПараметр("Категория",Справочники.КатегорииНомеров.НайтиПоНаименованию(Категория));
	ТЗИзм=ЗапросИзменений.Выполнить().Выгрузить();
	
	СписокДатИзм=ТЗИзм.Скопировать();
	СписокДатИзм.сортировать("ДатаВремяИзменения возр");
	СписокДатИзм.Свернуть("ДатаИзменения");
	
	Для каждого СтрИзм Из СписокДатИзм Цикл
		ТабДок=Новый ТабличныйДокумент;	
		
		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");	
		Обл.Параметры.Категория=Категория;
		Обл.Параметры.ДатаИзменения=Формат(СтрИзм.ДатаИзменения, "ДФ=dd.MM.yy");
		ТабДок.Присоединить(Обл);	
		
		ДТ_С=ДТН;
		Пока ДТ_С<=ДТК цикл
			ОтборСтр=Новый Структура("ДатаИзменения,ДатаЦены,Двухместный",СтрИзм.ДатаИзменения,ДТ_С,Ложь);
			ОтборСтр2=Новый Структура("ДатаИзменения,ДатаЦены,Двухместный",СтрИзм.ДатаИзменения,ДТ_С,Истина);
			ПоискСтрок=ТЗИзм.НайтиСтроки(ОтборСтр);
			ПоискСтрок2=ТЗИзм.НайтиСтроки(ОтборСтр2);
			
			Обл=Макет.ПолучитьОбласть("Строка|ДатаЦены");
			Если ПоискСтрок.Количество()>0 или ПоискСтрок2.Количество()>0 тогда
				Если ПоискСтрок.Количество()>0 тогда
					Крайняя=ПоискСтрок.Количество()-1;
					Изм1=ПоискСтрок[Крайняя].Процент;
				иначе
					Изм1=0;
				КонецЕсли;
				
				Если ПоискСтрок2.Количество()>0 тогда
					Крайняя=ПоискСтрок2.Количество()-1;
					Изм2=ПоискСтрок2[Крайняя].Процент;
				иначе
					Изм2=0;
				КонецЕсли;
				
				//ЦенаДня=?(ДеньНедели(ДТ_С)<5, ДокументыСервер.ОкруглитьЦену(БТ+Изм1)
				//	, ДокументыСервер.ОкруглитьЦену(БТ_Вых+Изм1));
				//ЦенаДня2=?(ДеньНедели(ДТ_С)<5, ДокументыСервер.ОкруглитьЦену(БТ_Двух+Изм2)
				//	,ДокументыСервер.ОкруглитьЦену(БТ_Вых_Двух+Изм2));
					
				ЦенаДня=?(ДеньНедели(ДТ_С)<5
					, (БТ+Изм1)
					, (БТ_Вых+Изм1));
				ЦенаДня2=?(ДеньНедели(ДТ_С)<5
					, (БТ_Двух+Изм2)
					, (БТ_Вых_Двух+Изм2));
				
				Обл.Параметры.Цена=Формат(Изм1, "ЧН=0");
				Обл.Параметры.Цена2=Формат(Изм2, "ЧН=0");
				
				Если Изм1>0 тогда
					Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(117, 253, 79);
				иначеЕсли Изм1<0 тогда
					Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(255, 208, 198);
				Иначе
					Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(255,255,255);
				КонецЕсли;
				
				//Формат(ЦенаДня, "ЧГ=")+" / "+ Формат(ЦенаДня2, "ЧГ=")+" ( "+Формат(ПоискСтрок[0].Процент, "ЧН=0")+")";
			КонецЕсли;
			ТабДок.Присоединить(Обл);
			ДТ_С=ДТ_С+86400;	
		КонецЦикла;
		
		//ЭлементыФормы.ПолеОтчетаПоИзменениям.Вывести(ТабДок);
		ПолеОтчетаПоИзменениям.Вывести(ТабДок);
	КонецЦикла; 
	
	ТабДок=Новый ТабличныйДокумент;	
	Обл=Макет.ПолучитьОбласть("Строка2|ШапкаВерх");	
	Обл.Параметры.Катагория=Категория;
	ТабДок.Присоединить(Обл);	
	
	ДТ_С=ДТН;
	ПоискЦен=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ИзменениеЦеныДатаЦены.Процент
	                      |ИЗ
	                      |	Документ.ИзменениеЦены.ДатаЦены КАК ИзменениеЦеныДатаЦены
	                      |ГДЕ
	                      |	ИзменениеЦеныДатаЦены.ДатаЦены = &ДатаЦены
	                      |	И ИзменениеЦеныДатаЦены.Категория = &Категория
	                      |	И ИзменениеЦеныДатаЦены.Двухместный = &Двухместный
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ИзменениеЦеныДатаЦены.Ссылка.Дата УБЫВ");
	ПоискЦен.УстановитьПараметр("Категория",Справочники.КатегорииНомеров.НайтиПоНаименованию(Категория));
	
	Пока ДТ_С<=ДТК цикл
		Обл=Макет.ПолучитьОбласть("Строка2|ДатаЦены");
		
		ПоискЦен.УстановитьПараметр("ДатаЦены",НачалоДня(ДТ_С));
		ПоискЦен.УстановитьПараметр("Двухместный",Ложь);
        ТЗЦ=ПоискЦен.Выполнить().Выгрузить();
		ПоискЦен.УстановитьПараметр("Двухместный",Ложь);
        ТЗЦ2=ПоискЦен.Выполнить().Выгрузить();

		Результат = КалендарьЦен.БазоваяЦенаДня(ДТ_С, ТЗБазовыеЦены, БТ, БТ_Вых, БТ_Двух, БТ_Вых_Двух);
		
		БЦО = Результат.БазоваяЦенаДняОдноместный;
		БЦД = Результат.БазоваяЦенаДняДвухместный;
		
		Изм1=?(ТЗЦ.Количество()=0,0,ТЗЦ[0].Процент);
		Изм2=?(ТЗЦ2.Количество()=0,0,ТЗЦ2[0].Процент);
		
		Если ТЗЦ.Количество()=0 И ТЗЦ2.Количество()=0 Тогда
			Обл.Параметры.Цена = БЦО;
			Обл.Параметры.Цена2 = БЦД;
		иначе
			Изм1=?(ТЗЦ.Количество()=0,0,ТЗЦ[0].Процент);
			Изм2=?(ТЗЦ2.Количество()=0,0,ТЗЦ2[0].Процент);
			
			//Обл.Параметры.Цена = Формат(?(ДеньНедели(ДТ_С)<5,БТ+Изм1,БТ_Вых+Изм1), "ЧГ=");
			//Обл.Параметры.Цена2 = Формат(?(ДеньНедели(ДТ_С)<5,БТ_Двух+Изм2,БТ_Вых_Двух+Изм2), "ЧГ=");
			Обл.Параметры.Цена = БЦО + Изм1;
			Обл.Параметры.Цена2 = БЦД + Изм2;
			
			Если ТЗЦ[0].Процент>0 тогда
					Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(117, 253, 79);
				иначеЕсли ТЗЦ[0].Процент<0 тогда
					Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(255, 208, 198);
				Иначе
					Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(255,255,255);
				КонецЕсли;
		КонецЕсли;
		
		
		//если ТЗЦ.Количество()=0 и ТЗЦ2.Количество()=0 тогда
		//	Обл.Параметры.Цена=Формат(?(ДеньНедели(ДТ_С)<5, БТ, БТ_Вых), "ЧГ=");
		//	Обл.Параметры.Цена2=Формат(?(ДеньНедели(ДТ_С)<5,БТ_Двух,БТ_Вых_Двух), "ЧГ=");
		//иначе
		//	Изм1=?(ТЗЦ.Количество()=0,0,ТЗЦ[0].Процент);
		//	Изм2=?(ТЗЦ2.Количество()=0,0,ТЗЦ2[0].Процент);
		//	Обл.Параметры.Цена=Формат(?(ДеньНедели(ДТ_С)<5,БТ+Изм1,БТ_Вых+Изм1), "ЧГ=");
		//	Обл.Параметры.Цена2=Формат(?(ДеньНедели(ДТ_С)<5,БТ_Двух+Изм2,БТ_Вых_Двух+Изм2), "ЧГ=");
		//	Если ТЗЦ[0].Процент>0 тогда
		//			Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(117, 253, 79);
		//		иначеЕсли ТЗЦ[0].Процент<0 тогда
		//			Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(255, 208, 198);
		//		Иначе
		//			Обл.Область(1,1,1,2).ЦветФона=Новый Цвет(255,255,255);
		//		КонецЕсли;
		//КонецЕсли;
		
		ТабДок.Присоединить(Обл);
		ДТ_С=ДТ_С+86400;	
	КонецЦикла;
	
	//ЭлементыФормы.ПолеОтчетаПоИзменениям.Вывести(ТабДок);
	ПолеОтчетаПоИзменениям.Вывести(ТабДок);
КонецФункции

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
Если ДатаС < ДокументыСервер.ДатаПереходаНаНовыйКалендарьЦен() Тогда
	Текст = "ВНИМАНИЕ ! Дата начала < Дата перехода на новый календарь цен.
		|
		|Расчет будет выполен по новым правилам."; 
	ПоказатьПредупреждение(, Текст);
КонецЕсли; 	
КонецПроцедуры

// +++++++++++++++++++++++++++++++++++++++++++



