//
Процедура КнопкаСформироватьНажатие__(Кнопка)
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//Макет=ПолучитьМакет("Макет");
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//ЗапросРаз=Новый Запрос("ВЫБРАТЬ
	//                       |	ВложенныйЗапрос.Клиент,
	//                       |	ВложенныйЗапрос.Ссылка,
	//                       |	ВложенныйЗапрос.Клиент КАК Клиент1,
	//                       |	ВложенныйЗапрос.Ссылка КАК Ссылка1
	//                       |ИЗ
	//                       |	(ВЫБРАТЬ
	//                       |		ЗаявкаНаБронирование.Клиент КАК Клиент,
	//                       |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК Ссылка
	//                       |	ИЗ
	//                       |		Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                       |	ГДЕ
	//                       |		ЗаявкаНаБронирование.Статус = &Статус
	//                       |	
	//                       |	СГРУППИРОВАТЬ ПО
	//                       |		ЗаявкаНаБронирование.Клиент) КАК ВложенныйЗапрос
	//                       |ГДЕ
	//                       |	ВложенныйЗапрос.Ссылка > 1");
	//					   
	//ЗапросРаз.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Выехал);					   
	//ТЗРаз=ЗапросРаз.Выполнить().Выгрузить();
	//
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//                    |	ЗаявкаНаБронирование.Ссылка,
	//                    |	РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Клиент.ДатаРождения, &ДатаТек, ГОД) КАК Возраст
	//                    |ИЗ
	//                    |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                    |ГДЕ
	//                    |	ЗаявкаНаБронирование.Ссылка В
	//                    |			(ВЫБРАТЬ
	//                    |				ЗанятостьНомеров.Регистратор
	//                    |			ИЗ
	//                    |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//                    |			ГДЕ
	//                    |				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//                    |				И ЗанятостьНомеров.Зарезервирован = ИСТИНА)
	//                    |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	//                    |	И ЗаявкаНаБронирование.Тариф <> &Тариф
	//                    |	И ЗаявкаНаБронирование.Тариф <> &Тариф2
	//                    |	И ЗаявкаНаБронирование.Тариф <> &Тариф3
	//                    |	И ЗаявкаНаБронирование.Тариф <> &Тариф4
	//                    |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
	//                    |
	//                    |УПОРЯДОЧИТЬ ПО
	//                    |	ЗаявкаНаБронирование.РезервС");
	//Запрос.УстановитьПараметр("ДН",НачалоДня(ДН));						
	//Запрос.УстановитьПараметр("ДК",КонецДня(ДК));
	//Запрос.УстановитьПараметр("ДатаТек",ТекущаяДата());

	//Запрос.УстановитьПараметр("Тариф",Справочники.Тариф.НайтиПоКоду("000000400"));
	//Запрос.УстановитьПараметр("Тариф2",Справочники.Тариф.НайтиПоКоду("000000323"));
	//Запрос.УстановитьПараметр("Тариф3",Справочники.Тариф.НайтиПоКоду("000000325"));
	//Запрос.УстановитьПараметр("Тариф4",Справочники.Тариф.НайтиПоКоду("000000324"));
	//Запрос.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));


	//
	//ТЗ=Запрос.Выполнить().Выгрузить();
	//сч=1;
	//Для каждого Стр Из ТЗ Цикл
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	//Но	ФИО	ДатаЗ	ДатаВ	Суток	Комент
	//	ПоискКол=ТЗРаз.Найти(Стр.Ссылка.Клиент,"Клиент");
	//	Обл.Параметры.Повт=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
	//    Обл.Параметры.НомерОтеля=Строка(Стр.Ссылка.НомерВРезерв);
	//	Обл.Параметры.Но=Строка(Сч);
	//	сч=сч+1;
	//	Обл.Параметры.ФИО=Строка(Стр.Ссылка.Клиент);
	//	Обл.Параметры.Бронирует=Строка(Стр.Ссылка.Бронирует);
	//	Обл.Параметры.Источник=Строка(Стр.Ссылка.Источник);
	//	Обл.Параметры.Канал=Строка(Стр.Ссылка.Бронирует.ВидКлиента);

	//	
	//	Обл.Параметры.ДатаР=Формат(Стр.Ссылка.Клиент.ДатаРождения, "ДФ=dd.MM.yy");
	//	Обл.Параметры.Возраст=Стр.Возраст;
	//	Обл.Параметры.Пол=Строка(Стр.Ссылка.Клиент.Пол);
	//	Обл.Параметры.Город=Строка(Стр.Ссылка.Клиент.СтранаПроживания + " " +Стр.Ссылка.Клиент.ГородПроживания);  
	//	Обл.Параметры.ДатаЗ=Формат(Стр.Ссылка.РезервС, "ДФ=dd.MM.yy");
	//	Обл.Параметры.ДатаВ=Формат(Стр.Ссылка.РезервПо, "ДФ=dd.MM.yy");
	//	//Политов
	////	КолвоДнейВПериоде=Мин(Стр.Ссылка.РезервПо,ДК)-Макс(Стр.Ссылка.РезервС,ДН);
	//	КолвоДнейВПериоде=Мин(КонецДня(Стр.Ссылка.РезервПо),КонецДня(ДК))-Макс(НачалоДня(Стр.Ссылка.РезервС),НачалоДня(ДН));
	//	///Политов
	//	КолвоДнейВПериоде=Окр(КолвоДнейВПериоде/86400);
	//	Если КонецДня(Стр.Ссылка.РезервПо)=КонецДня(ДН) тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Обл.Параметры.Суток=Строка(Мин(Стр.Ссылка.КолВо,КолвоДнейВПериоде));
	//	СтрКом="";
	//	Для каждого Комм Из Стр.Ссылка.ДопПожелания Цикл
	//		СтрКом=СтрКом+" "+Комм.Информация; 
	//	КонецЦикла; 
	//	Обл.Параметры.Комент=СокрЛП(СтрКом);
	//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//КонецЦикла; 
    
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	//Макет=ПолучитьМакет("Макет");
	Макет=Отчеты.СтатистикаПоНомерам_Исходная.ПолучитьМакет("Макет");
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	ЗапросРаз=Новый Запрос("ВЫБРАТЬ
	                       |	ВложенныйЗапрос.Клиент,
	                       |	ВложенныйЗапрос.Ссылка,
	                       |	ВложенныйЗапрос.Клиент КАК Клиент1,
	                       |	ВложенныйЗапрос.Ссылка КАК Ссылка1
	                       |ИЗ
	                       |	(ВЫБРАТЬ
	                       |		ЗаявкаНаБронирование.Клиент КАК Клиент,
	                       |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК Ссылка
	                       |	ИЗ
	                       |		Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                       |	ГДЕ
	                       |		ЗаявкаНаБронирование.Статус = &Статус
	                       |	
	                       |	СГРУППИРОВАТЬ ПО
	                       |		ЗаявкаНаБронирование.Клиент) КАК ВложенныйЗапрос
	                       |ГДЕ
	                       |	ВложенныйЗапрос.Ссылка > 1");
						   
	ЗапросРаз.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Выехал);					   
	ТЗРаз=ЗапросРаз.Выполнить().Выгрузить();
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗаявкаНаБронирование.Ссылка,
	                    |	РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Клиент.ДатаРождения, &ДатаТек, ГОД) КАК Возраст
	                    |ИЗ
	                    |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                    |ГДЕ
	                    |	ЗаявкаНаБронирование.Ссылка В
	                    |			(ВЫБРАТЬ
	                    |				ЗанятостьНомеров.Регистратор
	                    |			ИЗ
	                    |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |			ГДЕ
	                    |				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                    |				И ЗанятостьНомеров.Зарезервирован = ИСТИНА)
	                    |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	                    |	И ЗаявкаНаБронирование.Тариф_НеИспользуется <> &Тариф_НеИспользуется
	                    |	И ЗаявкаНаБронирование.Тариф_НеИспользуется <> &Тариф2
	                    |	И ЗаявкаНаБронирование.Тариф_НеИспользуется <> &Тариф3
	                    |	И ЗаявкаНаБронирование.Тариф_НеИспользуется <> &Тариф4
	                    |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ЗаявкаНаБронирование.РезервС");
	Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));						
	Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	Запрос.УстановитьПараметр("ДатаТек",ТекущаяДата());

	Запрос.УстановитьПараметр("Тариф_НеИспользуется",Справочники.Тариф_НеИспользуется.НайтиПоКоду("000000400"));
	Запрос.УстановитьПараметр("Тариф2",Справочники.Тариф_НеИспользуется.НайтиПоКоду("000000323"));
	Запрос.УстановитьПараметр("Тариф3",Справочники.Тариф_НеИспользуется.НайтиПоКоду("000000325"));
	Запрос.УстановитьПараметр("Тариф4",Справочники.Тариф_НеИспользуется.НайтиПоКоду("000000324"));
	Запрос.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));


	
	ТЗ=Запрос.Выполнить().Выгрузить();
	сч=1;
	Для каждого Стр Из ТЗ Цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		//Но	ФИО	ДатаЗ	ДатаВ	Суток	Комент
		ПоискКол=ТЗРаз.Найти(Стр.Ссылка.Клиент,"Клиент");
		Обл.Параметры.Повт=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
        Обл.Параметры.НомерОтеля=Строка(Стр.Ссылка.НомерВРезерв);
		Обл.Параметры.Но=Строка(Сч);
		сч=сч+1;
		Обл.Параметры.ФИО=Строка(Стр.Ссылка.Клиент);
		Обл.Параметры.Бронирует=Строка(Стр.Ссылка.Бронирует);
		Обл.Параметры.Источник=Строка(Стр.Ссылка.Источник);
		Обл.Параметры.Канал=Строка(Стр.Ссылка.Бронирует.ВидКлиента);

		
		Обл.Параметры.ДатаР=Формат(Стр.Ссылка.Клиент.ДатаРождения, "ДФ=dd.MM.yy");
		Обл.Параметры.Возраст=Стр.Возраст;
		Обл.Параметры.Пол=Строка(Стр.Ссылка.Клиент.Пол);
		Обл.Параметры.Город=Строка(Стр.Ссылка.Клиент.СтранаПроживания + " " +Стр.Ссылка.Клиент.ГородПроживания);  
		Обл.Параметры.ДатаЗ=Формат(Стр.Ссылка.РезервС, "ДФ=dd.MM.yy");
		Обл.Параметры.ДатаВ=Формат(Стр.Ссылка.РезервПо, "ДФ=dd.MM.yy");
		//Политов
	////	КолвоДнейВПериоде=Мин(Стр.Ссылка.РезервПо,ДК)-Макс(Стр.Ссылка.РезервС,ДН);
		КолвоДнейВПериоде=Мин(КонецДня(Стр.Ссылка.РезервПо),КонецДня(Отчет.ДК))-Макс(НачалоДня(Стр.Ссылка.РезервС),НачалоДня(Отчет.ДН));
		///Политов
		КолвоДнейВПериоде=Окр(КолвоДнейВПериоде/86400);
		Если КонецДня(Стр.Ссылка.РезервПо)=КонецДня(Отчет.ДН) тогда
			Продолжить;
		КонецЕсли;
		
		Обл.Параметры.Суток=Строка(Мин(Стр.Ссылка.КолВо,КолвоДнейВПериоде));
		СтрКом="";
		Для каждого Комм Из Стр.Ссылка.ДопПожелания Цикл
			СтрКом=СтрКом+" "+Комм.Информация; 
		КонецЦикла; 
		Обл.Параметры.Комент=СокрЛП(СтрКом);
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);

	КонецЦикла; 
    
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОсновныеДействияФормыСформироватьСтатистикуПоРаздельнымКроватям___(Кнопка)
	//ЗапросРК=Новый Запрос("ВЫБРАТЬ
	//                      |	ЗанятостьНомеров.Номер КАК Номер,
	//                      |	ЗанятостьНомеров.Регистратор.РаздельныеКровати КАК рк,
	//                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗанятостьНомеров.Регистратор) КАК Кол
	//                      |ИЗ
	//                      |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//                      |ГДЕ
	//                      |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//                      |	И ЗанятостьНомеров.Клиент.ВидКлиента.Наименование <> &Наименование
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ЗанятостьНомеров.Номер,
	//                      |	ЗанятостьНомеров.Регистратор.РаздельныеКровати
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	Номер,
	//                      |	рк");
	//ЗапросРК.УстановитьПараметр("ДН",ДН);						  
	//ЗапросРК.УстановитьПараметр("ДК",ДК);
	//ЗапросРК.УстановитьПараметр("Наименование","Исключить из отчетов");
	//ТЗ=ЗапросРК.Выполнить().Выгрузить();
	//Макет=ПолучитьМакет("МакетСтатистикаРК");
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//ТЗНом=Новый ТаблицаЗначений;
	//ТЗНом.Колонки.Добавить("НК");
	//ТЗНом.Колонки.Добавить("О");
	//ТЗНом.Колонки.Добавить("РК");
	//Для каждого Стр Из ТЗ Цикл
	//	Поиск=ТЗНом.Найти(Стр.Номер,"НК");
	//	Если Поиск=Неопределено тогда
	//		НовНом=ТЗНом.Добавить();
	//		НовНом.НК=Стр.номер;
	//		НовНом.О=0;
	//		НовНом.РК=0;
	//		Поиск=НовНом;
	//	конецесли;
	//	Если Стр.РК тогда
	//		Поиск.РК=Стр.Кол;
	//	иначе
	//		Поиск.О=Стр.Кол;
	//	Конецесли;
	//	
	//
	//	
	//
	//КонецЦикла; 
	//Для каждого Стр Из ТЗНом Цикл
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	Обл.Параметры.Заполнить(Стр);
	//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//КонецЦикла; 
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	Обл.Параметры.НК="ИТОГО";
	//	Обл.Параметры.РК=ТЗНом.Итог("РК");
	//	Обл.Параметры.О=ТЗНом.Итог("О");
	//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьСтатистикуПоРаздельнымКроватям(Команда)
	СформироватьСтатистикуПоРаздельнымКроватямНаСервере();
КонецПроцедуры


&НаСервере
Процедура СформироватьСтатистикуПоРаздельнымКроватямНаСервере()
	ЗапросРК=Новый Запрос("ВЫБРАТЬ
	                      |	ЗанятостьНомеров.Номер КАК Номер,
	                      |	ЗанятостьНомеров.Регистратор.РаздельныеКровати КАК рк,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗанятостьНомеров.Регистратор) КАК Кол
	                      |ИЗ
	                      |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                      |ГДЕ
	                      |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                      |	И ЗанятостьНомеров.Клиент.ВидКлиента.Наименование <> &Наименование
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗанятостьНомеров.Номер,
	                      |	ЗанятостьНомеров.Регистратор.РаздельныеКровати
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Номер,
	                      |	рк");
	ЗапросРК.УстановитьПараметр("ДН",Отчет.ДН);						  
	ЗапросРК.УстановитьПараметр("ДК",Отчет.ДК);
	ЗапросРК.УстановитьПараметр("Наименование","Исключить из отчетов");
	ТЗ=ЗапросРК.Выполнить().Выгрузить();
	
	//Макет=ПолучитьМакет("МакетСтатистикаРК");
	Макет=отчеты.СтатистикаПоНомерам_Исходная.ПолучитьМакет("МакетСтатистикаРК");
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	ТЗНом=Новый ТаблицаЗначений;
	ТЗНом.Колонки.Добавить("НК");
	ТЗНом.Колонки.Добавить("О");
	ТЗНом.Колонки.Добавить("РК");
	Для каждого Стр Из ТЗ Цикл
		Поиск=ТЗНом.Найти(Стр.Номер,"НК");
		Если Поиск=Неопределено тогда
			НовНом=ТЗНом.Добавить();
			НовНом.НК=Стр.номер;
			НовНом.О=0;
			НовНом.РК=0;
			Поиск=НовНом;
		конецесли;
		Если Стр.РК тогда
			Поиск.РК=Стр.Кол;
		иначе
			Поиск.О=Стр.Кол;
		Конецесли;
		
	
		
	
	КонецЦикла; 
	Для каждого Стр Из ТЗНом Цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(Стр);
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);
	КонецЦикла; 
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.НК="ИТОГО";
		Обл.Параметры.РК=ТЗНом.Итог("РК");
		Обл.Параметры.О=ТЗНом.Итог("О");
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);
КонецПроцедуры

//

