&НаКлиенте
Перем НаименованиеОтеляМассив;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаС = НачалоДня(ТекущаяДата());

ЗаполнитьЦеныКонкурентов();

ТрэвелЛайн = "Трэвел лайн";
УсловноеОформлениеУстановить();
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеУстановить() 
УО = ЭтаФорма.УсловноеОформление; 
УО.Элементы.Очистить(); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЦеныКонкурентовНаименованиеОтеля", "ЦеныКонкурентов.НаименованиеОтеля", ТрэвелЛайн
	, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры
 
&НаСервере
Процедура УсловноеОформлениеПолеДобавить(ЭлементУО, ИмяПоля, ИмяЛевогоЗначения, ПравоеЗначение, ВидСравнения) 
    
Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить(); 
Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
Оформляемоеполе.Использование = ИСТИНА;  

ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементУсловия.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных(ИмяЛевогоЗначения);
ЭлементУсловия.ПравоеЗначение = ПравоеЗначение;
ЭлементУсловия.ВидСравнения    = ВидСравнения;   
ЭлементУсловия.Использование   = Истина;    
        
КонецПроцедуры


&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
ЗаполнитьЦеныКонкурентов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныКонкурентов()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентов.Дата КАК Дата,
                      |	ЦеныКонкурентов.НаименованиеОтеля КАК НаименованиеОтеля,
                      |	ЦеныКонкурентов.Цена КАК Цена
                      |ИЗ
                      |	РегистрСведений.ЦеныКонкурентов КАК ЦеныКонкурентов
                      |ГДЕ
                      |	ЦеныКонкурентов.Дата >= &Дата");


Запрос.УстановитьПараметр("Дата", ДатаС);

ТЗ = Запрос.Выполнить().Выгрузить();

ЦеныКонкурентов.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ЦеныКонкурентов.Добавить();	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЦеныКонкурентовПередНачаломИзменения(Элемент, Отказ)
НаименованиеОтеляМассив = НаименованиеОтеляМассив();
КонецПроцедуры

&НаКлиенте
Процедура ЦеныКонкурентовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
НаименованиеОтеляМассив = НаименованиеОтеляМассив();
КонецПроцедуры

&НаКлиенте
Процедура ЦеныКонкурентовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
ТД = Элемент.ТекущиеДанные;

Если НЕ ЗначениеЗаполнено(ТД.Дата) Тогда
	ТД.Дата	= ТекущаяДата();
КонецЕсли;
КонецПроцедуры

//
&НаКлиенте
Процедура ЦеныКонкурентовНаименованиеОтеляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

СписокВыбора = Новый СписокЗначений;
//НаименованиеОтеляМассив = НаименованиеОтеляМассив();
Для Каждого Строка Из НаименованиеОтеляМассив Цикл
	СписокВыбора.Добавить(Строка);
КонецЦикла;

ДанныеВыбора = СписокВыбора;
КонецПроцедуры

&НаСервере
Функция НаименованиеОтеляМассив()
Массив = Новый СписокЗначений;	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентов.НаименованиеОтеля КАК НаименованиеОтеля
                      |ИЗ
                      |	РегистрСведений.ЦеныКонкурентов КАК ЦеныКонкурентов
                      |ГДЕ
                      |	ЦеныКонкурентов.НаименованиеОтеля <> """"
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЦеныКонкурентов.НаименованиеОтеля
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НаименованиеОтеля");

Выборка = Запрос.Выполнить().Выбрать();

Пока Выборка.Следующий() Цикл
	НоваяСтрока = Массив.Добавить(Выборка.НаименованиеОтеля);	
КонецЦикла;

Массив.Вставить(0, ТрэвелЛайн);

Возврат Массив; 
КонецФункции

&НаКлиенте
Асинх Процедура ЦеныКонкурентовНаименованиеОтеляПриИзменении(Элемент)
ТД = Элементы.ЦеныКонкурентов.ТекущиеДанные;

НаименованиеОтеляПоиск = НаименованиеОтеляМассив.НайтиПоЗначению(ТД.НаименованиеОтеля);
Если НаименованиеОтеляПоиск = Неопределено Тогда
	НовыйОтель = Истина;
Иначе 
	НовыйОтель = Ложь;
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЦеныКонкурентовНаименованиеОтеляАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

СписокВыбора = Новый СписокЗначений;

//НаименованиеОтеляМассив = НаименованиеОтеляМассив();
Если НЕ ЗначениеЗаполнено(Текст) Тогда 
	Для Каждого Элемент Из НаименованиеОтеляМассив Цикл
		СписокВыбора.Добавить(Элемент); 
	КонецЦикла;
КонецЕсли;

СписокВыбора = Новый СписокЗначений;
Для Каждого Элемент Из НаименованиеОтеляМассив Цикл
	Индекс = СтрНайти(Элемент, Текст); 	
	Если Индекс = 0 Тогда Продолжить; КонецЕсли;
		
	СписокВыбора.Добавить(Элемент); 
КонецЦикла;

ДанныеВыбора = СписокВыбора;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныКонкурентовНаименованиеОтеляОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//НовыйОтель = Ложь;
КонецПроцедуры
//

//
&НаКлиенте
Асинх Процедура ЦеныКонкурентовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
Если НоваяСтрока И ОтменаРедактирования Тогда Возврат; КонецЕсли;
	
ТД = Элемент.ТекущиеДанные;	

Если НовыйОтель Тогда
	ОтветАсинх = ВопросАсинх("Добавить новый отель '" + ТД.НаименованиеОтеля + "' ?", РежимДиалогаВопрос.ОКОтмена);
	Ответ = Ждать ОтветАсинх;
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		ТД.НаименованиеОтеля = "";
		
		НовыйОтель = Ложь;
		
		Отказ= Истина;
		Возврат;
	КонецЕсли; 	
КонецЕсли; 	

Если НЕ ЗначениеЗаполнено(ТД.НаименованиеОтеля) Тогда
	ПоказатьПредупреждение(," Наименование Отеля д. б. заполнено");
	Отказ= Истина;
	Возврат;
КонецЕсли;


//
Если НЕ ЗначениеЗаполнено(ТД.Дата) Тогда
	ПоказатьПредупреждение(," Дата д. б. заполнено");
	Отказ= Истина;
	Возврат;
КонецЕсли;

Если ТД.Цена = 0 Тогда
	ПоказатьПредупреждение(," Цена д. б. заполнена");
	Отказ= Истина;
	Возврат;
КонецЕсли;

//

	
ТС = Элемент.ТекущаяСтрока;
ОбновитьЗаписьЦеныКонкурентов(ТС);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписьЦеныКонкурентов(ТС)
ТД = ЦеныКонкурентов.НайтиПоИдентификатору(ТС);	
	
МенеджерЗаписи = РегистрыСведений.ЦеныКонкурентов.СоздатьМенеджерЗаписи();

МенеджерЗаписи.Дата = ТД.Дата;
МенеджерЗаписи.НаименованиеОтеля = ТД.НаименованиеОтеля;
МенеджерЗаписи.Цена = ТД.Цена;

МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЦеныКонкурентовПередУдалением(Элемент, Отказ)
ТС = Элемент.ТекущаяСтрока;
УдалитьЗаписьЦеныКонкурентов(ТС);
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьЦеныКонкурентов(ТС)
ТД = ЦеныКонкурентов.НайтиПоИдентификатору(ТС);	
	
Запись = РегистрыСведений.ЦеныКонкурентов.СоздатьМенеджерЗаписи();
Запись.Дата = ТД.Дата;
Запись.НаименованиеОтеля = ТД.НаименованиеОтеля;
Запись.Удалить();
КонецПроцедуры






