
//
&НаКлиенте
Процедура ОбновитьИНН(Команда)
	ОбновитьИНННаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИНННаСервере()
Выборка = Справочники.Клиенты.Выбрать();
Пока Выборка.Следующий() Цикл
	Если Выборка.ЭтоГруппа Тогда Продолжить; КонецЕсли;	
		
	Если Выборка.ИНН = "" Тогда Продолжить; КонецЕсли;	
	
	КлиентОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Если Выборка.ИНН = "0" Тогда 
		КлиентОбъект.ИНН = "";
	Иначе
		КлиентОбъект.ИНН = Выборка.ИНН;
		КлиентОбъект.ИНН = СтрЗаменить(КлиентОбъект.ИНН, Символы.НПП, "");
	КонецЕсли;
	
	Если Выборка.КПП = "0" Тогда 
		КлиентОбъект.КПП = "";
	Иначе
		КлиентОбъект.КПП = Выборка.КПП;
		КлиентОбъект.КПП = СтрЗаменить(КлиентОбъект.КПП, Символы.НПП, "");
	КонецЕсли;

	
	КлиентОбъект.Записать();
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьПроцентКомиссии(Команда)
	ОбновитьПроцентКомиссииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПроцентКомиссииНаСервере()
Выборка = Справочники.Клиенты.Выбрать();
Пока Выборка.Следующий() Цикл
	Если Выборка.ЭтоГруппа Тогда Продолжить; КонецЕсли;	
		
	Если НЕ Выборка.Турагентство Тогда Продолжить; КонецЕсли;	
	
	КлиентОбъект = Выборка.Ссылка.ПолучитьОбъект();
	КлиентОбъект.ПроцентКомиссии = КлиентОбъект.ПроцентАгент_OLD;

	КлиентОбъект.Записать();
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура УдалениеНесвязанныхСтрокСчета(Команда)
	УдалениеНесвязанныхСтрокСчетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалениеНесвязанныхСтрокСчетаНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого СтрокаТЗ Из ТЗ Цикл
	ЗаявкаОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
	
	МассивКУдаление = Новый Массив;
	Для Каждого Строка Из ЗаявкаОбъект.СчетаДетальноСтроки Цикл
		ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
		НайденныеСтроки = ЗаявкаОбъект.Счета.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтроки.Количество() > 0 Тогда Продолжить; КонецЕсли;
			
		МассивКУдаление.Добавить(Строка);	
	КонецЦикла;		
	
	Если МассивКУдаление.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Для Каждого Строка Из МассивКУдаление Цикл
		ЗаявкаОбъект.СчетаДетальноСтроки.Удалить(Строка);		
	КонецЦикла;
	
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;
	
КонецПроцедуры
//


//
&НаКлиенте
Процедура ЗаполнитьДолгиОплатаКассовыйДокумент(Команда)
ЗаполнитьДолгиОплатаКассовыйДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолгиОплатаКассовыйДокументНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
               |	КассовыйДокумент.Ссылка КАК ДокументОплаты
               |ИЗ
               |	Документ.КассовыйДокумент КАК КассовыйДокумент
               |ГДЕ
               |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ");
	
ТЗОплаты = Запрос.Выполнить().Выгрузить();

Для Каждого СтрокаТЗОплаты Из ТЗОплаты Цикл
	ДокументОплаты = СтрокаТЗОплаты.ДокументОплаты;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК ДокументДолг,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
	                      |	СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
	                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД
	                      |ГДЕ
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
	                      |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = &ДокументОплаты
	                      |	И ЗаявкаНаБронированиеСчета.ГрупповойСчет = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД");
	
	Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
	
	ТЗДолги = Запрос.Выполнить().Выгрузить();
	Если ТЗДолги.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
	ДокументОплатыОбъект.ДолгиОплата.Очистить();
	Для Каждого СтрокаТЗДолги Из ТЗДолги Цикл 
		СтрокаДолгиОплата = ДокументОплатыОбъект.ДолгиОплата.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДолгиОплата, СтрокаТЗДолги); 
		
		СтрокаДолгиОплата.Сумма = СтрокаТЗДолги.СуммаОплаты;		
	КонецЦикла;
	
	ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;

// Групповые Счета
Для Каждого СтрокаТЗОплаты Из ТЗОплаты Цикл
	ДокументОплаты = СтрокаТЗОплаты.ДокументОплаты;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ГрупповыеСчетаРаспределениеОплат.Ссылка.Ссылка КАК ДокументДолг,
	                      |	ГрупповыеСчетаРаспределениеОплат.Ссылка.СчетГУИД КАК СчетГУИД,
	                      |	СУММА(ГрупповыеСчетаРаспределениеОплат.СуммаОплаты) КАК СуммаОплаты
	                      |ИЗ
	                      |	Документ.ГрупповыеСчета.РаспределениеОплат КАК ГрупповыеСчетаРаспределениеОплат
	                      |ГДЕ
	                      |	ГрупповыеСчетаРаспределениеОплат.Ссылка.ПометкаУдаления = ЛОЖЬ
	                      |	И ГрупповыеСчетаРаспределениеОплат.ДокументОплаты = &ДокументОплаты
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ГрупповыеСчетаРаспределениеОплат.Ссылка.Ссылка,
	                      |	ГрупповыеСчетаРаспределениеОплат.Ссылка.СчетГУИД");
	
	Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
	
	ТЗДолги = Запрос.Выполнить().Выгрузить();
	Если ТЗДолги.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
	ДокументОплатыОбъект.ДолгиОплата.Очистить();
	Для Каждого СтрокаТЗДолги Из ТЗДолги Цикл 
		СтрокаДолгиОплата = ДокументОплатыОбъект.ДолгиОплата.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДолгиОплата, СтрокаТЗДолги); 
		
		СтрокаДолгиОплата.Сумма = СтрокаТЗДолги.СуммаОплаты;		
	КонецЦикла;
	
	ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;

КонецПроцедуры
//


//
&НаКлиенте
Процедура ОбновитьЗаявкиСРавноПо(Команда)
	ОбновитьЗаявкиСРавноПоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаявкиСРавноПоНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.РезервС = ЗаявкаНаБронирование.РезервПо
                      |	И ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Ссылка");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	Попытка 
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка записи. Номер: " + ЗаявкаОбъект.Номер + ", дата: " + ЗаявкаОбъект.Дата); 		
	КонецПопытки
	
КонецЦикла;
	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьПредварительныеГрупповыеСчета(Команда)
	ОбновитьПредварительныеГрупповыеСчетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредварительныеГрупповыеСчетаНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.Контрагент.Турагентство = ИСТИНА
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЗаявкаНаБронированиеСчета.Ссылка");

ТЗ = Запрос.Выполнить().Выгрузить();					  

Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	НеЗаписать = Истина;
	Для Каждого Счет Из ЗаявкаОбъект.Счета Цикл
		Если НЕ Счет.Контрагент.Турагентство Тогда Продолжить; КонецЕсли;
		Если Счет.ЭтоПредварительныйГрупповойСчет Тогда Продолжить; КонецЕсли;
		
		НеЗаписать = Ложь;
		
		Счет.ЭтоПредварительныйГрупповойСчет = Истина;
		
		ЭтоГрупповойСчет = ЗначениеЗаполнено(Счет.ГрупповойСчет);
		
		ОтборСтрокиДолги = Новый Структура("СчетГУИД", Счет.СчетГУИД); 
		НайденныеСчетаДетальноДолги = ЗаявкаОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтрокиДолги);
		Для Каждого СтрокаДолг Из НайденныеСчетаДетальноДолги Цикл
			СтрокаДолг.ГрупповойСчет = ЭтоГрупповойСчет;
		КонецЦикла;
	КонецЦикла;
	
	Если НеЗаписать Тогда Продолжить; КонецЕсли;
	
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредварительныеГрупповыеСчетаНаСервере_1()
Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет = ИСТИНА");

ТЗ = Запрос.Выполнить().Выгрузить();					  

Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	ОтборСтроки = Новый Структура("ЭтоПредварительныйГрупповойСчет", Истина);
	НайденныеСчета = ЗаявкаОбъект.Счета.НайтиСтроки(ОтборСтроки); 
	
	Для Каждого Счет Из НайденныеСчета Цикл
		ЭтоГрупповойСчет = ЗначениеЗаполнено(Счет.ГрупповойСчет);
		
		ОтборСтрокиДолги = Новый Структура("СчетГУИД", Счет.СчетГУИД); 
		НайденныеСчетаДетальноДолги = ЗаявкаОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтрокиДолги);
		Для Каждого СтрокаДолг Из НайденныеСчетаДетальноДолги Цикл
			СтрокаДолг.ГрупповойСчет = ЭтоГрупповойСчет;
		КонецЦикла;
	КонецЦикла;
			
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЭаполнитьЭтоЭквайрингВыписка(Команда)
	ЭаполнитьЭтоЭквайрингВыпискаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭаполнитьЭтоЭквайрингВыпискаНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
                      |		ПО ВыпискаБанка.ГУИДЗагрузка = БезналЗагрузка.ГУИД
                      |ГДЕ
                      |	БезналЗагрузка.КонтрагентИНН = &КонтрагентИНН");

Запрос.УстановитьПараметр("КонтрагентИНН", БезналРаспределениеСервер.ИННЭквайринг());
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ВыпискаБанкаОбъект = Строка.Ссылка.ПолучитьОбъект();	
	ВыпискаБанкаОбъект.ЭтоЭквайринг = Истина;
	ВыпискаБанкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;
	
КонецПроцедуры

//
&НаКлиенте
Процедура ЗаполнитьКомиссияГрупповойСчет(Команда)
ОткрытьФорму("Обработка.ОбновитьДанные.Форма.ФормаЗаполнитьГрупповойСчетКомиссияСчета",,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
//


//
&НаКлиенте
Процедура ЗаполнитьЗаявкиГорничные(Команда)
	ЗаполнитьЗаявкиГорничныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаявкиГорничныеНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронирование.Статус КАК Статус
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.РезервПо >= &РезервПо
                      |	И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает)
                      |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь))");

Запрос.УстановитьПараметр("РезервПо", НачалоДня(ТекущаяДата()));
	
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Если Строка.Статус = Перечисления.СтатусБрони.Бронь Тогда
		Событие = "Бронирование";
	ИначеЕсли Строка.Статус = Перечисления.СтатусБрони.Проживает Тогда
		 Событие = "Заезд";
	Иначе           
		Продолжить;
	КонецЕсли;
	
	//ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	//Если ЗаявкаОбъект.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр0 Тогда
	//	ЗаявкаОбъект.ГорничныеВремяЗаезда = 0;
	//ИначеЕсли ЗаявкаОбъект.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр6 Тогда
	//	ЗаявкаОбъект.ГорничныеВремяЗаезда = 6;
	//ИначеЕсли ЗаявкаОбъект.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр14 Тогда
	//		ЗаявкаОбъект.ГорничныеВремяЗаезда = 14;
	//ИначеЕсли ЗаявкаОбъект.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр18 Тогда
	//		ЗаявкаОбъект.ГорничныеВремяЗаезда = 18;
	//КонецЕсли;
	//	
	//ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ОбменГорничныеСервер.СоздатьЗаявку(Строка.Ссылка, Событие);	
КонецЦикла;

КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьИсторияКлиентаИДопПожелания(Команда)
ОбновитьИсторияКлиентаИДопПожеланияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИсторияКлиентаИДопПожеланияНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронирование.Клиент КАК Клиент,
                      |	ЗаявкаНаБронирование.Дата КАК Дата,
                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
                      |	ЗаявкаНаБронирование.НомерВРезерв.Наименование КАК НомерВРезервНаименование,
                      |	ЗаявкаНаБронирование.Статус КАК Статус,
                      |	ЗаявкаНаБронирование.ДопПожелания.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		Информация КАК Информация,
                      |		ВидИнформации КАК ВидИнформации,
                      |		ДатаРегистрации КАК ДатаРегистрации
                      |	) КАК ДопПожелания
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ЗаписатьИсторияКлиентаИДопПожелания(Строка);
КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИсторияКлиентаИДопПожелания(Строка)
//Заявка = Строка.Ссылка;

ЗаявкаГУИДСтрока = XMLСтрока(Строка.Ссылка);
ЗаявкаГУИД = Новый УникальныйИдентификатор(ЗаявкаГУИДСтрока);

Клиент = Строка.Клиент;

ИсторияКлиента = РегистрыСведений.ИсторияКлиента.СоздатьНаборЗаписей();
//ИсторияКлиента.Отбор.Клиент.Установить(Строка.Клиент);

//ИсторияКлиента.Отбор.Заявка.Установить(Заявка);
ИсторияКлиента.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);
Для Каждого Строка Из ИсторияКлиента Цикл
	ИсторияКлиента.Удалить(Строка);
КонецЦикла;

НоваяЗапись = ИсторияКлиента.Добавить();

НоваяЗапись.Клиент = Клиент;
//НоваяЗапись.Заявка = Заявка;
НоваяЗапись.ЗаявкаГУИД = ЗаявкаГУИД;

НоваяЗапись.ДатаЗаявки = Строка.Дата;
НоваяЗапись.РезервС = Строка.РезервС;
НоваяЗапись.РезервПо = Строка.РезервПо;
НоваяЗапись.НомерВрезерв = Строка.НомерВрезервНаименование;
НоваяЗапись.Статус = Строка.Статус; ;
	
ИсторияКлиента.Записать(Истина);

ИсторияКлиентаДопПожелания = РегистрыСведений.ИсторияКлиентаДопПожелания.СоздатьНаборЗаписей();
//ИсторияКлиентаДопПожелания.Отбор.Клиент.Установить(Строка.Клиент);

ИсторияКлиентаДопПожелания.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);
Для Каждого Строка Из ИсторияКлиентаДопПожелания Цикл
	ИсторияКлиента.Удалить(Строка);
КонецЦикла;

Индекс = 1;
Для Каждого СтрокаДопПожелания Из Строка.ДопПожелания Цикл
	НоваяЗапись = ИсторияКлиентаДопПожелания.Добавить();
	
	НоваяЗапись.Клиент = Клиент;
	//НоваяЗапись.Заявка = Заявка;
	НоваяЗапись.ЗаявкаГУИД = ЗаявкаГУИД;
	НоваяЗапись.ДопПожеланияИндекс = Индекс;
	
	Если ЗначениеЗаполнено(СтрокаДопПожелания.ДатаРегистрации) Тогда  
		НоваяЗапись.ДатаРегистрации = СтрокаДопПожелания.ДатаРегистрации;
	Иначе
		НоваяЗапись.ДатаРегистрации = Строка.РезервС;
	КонецЕсли;
	
	НоваяЗапись.РезервС = Строка.РезервС;
	НоваяЗапись.РезервПо = Строка.РезервПо;

	НоваяЗапись.ВидИнформации = СтрокаДопПожелания.ВидИнформации.Наименование;
	НоваяЗапись.Информация = СтрокаДопПожелания.Информация;
	
	Индекс = Индекс + 1;	
КонецЦикла;

ИсторияКлиентаДопПожелания.Записать(Истина);
КонецПроцедуры
//

//
&НаСервере
Процедура ПеренестиЗаявкиГорничныеНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронирование.Статус КАК Статус
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.РезервС >= &РезервС
                      |	И ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает)");

ДатаПереноса = '20221201';
Запрос.УстановитьПараметр("РезервС", ДатаПереноса);
	
ТЗ = Запрос.Выполнить().Выгрузить();

Событие = "Загрузка";
Для Каждого Строка Из ТЗ Цикл
	ОбменГорничныеСервер.СоздатьЗаявку(Строка.Ссылка, Событие);
КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗаявкиГорничные(Команда)
	ПеренестиЗаявкиГорничныеНаСервере();
КонецПроцедуры
//


//
&НаКлиенте
Процедура ПровестиЗаявкиКоворкинг(Команда)
	ПровестиЗаявкиКоворкингНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровестиЗаявкиКоворкингНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингЗаявка.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.КоворкингЗаявка КАК КоворкингЗаявка
                      |ГДЕ
                      |	КоворкингЗаявка.ПометкаУдаления = ЛОЖЬ");	

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	Попытка 
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка проведения: " + Строка.Ссылка); 		
	КонецПопытки;
	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПровестиСчетаКоворкинг(Команда)
	ПровестиСчетаКоворкингНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровестиСчетаКоворкингНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчета.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.КоворкингСчета КАК КоворкингСчета
                      |ГДЕ
                      |	КоворкингСчета.ПометкаУдаления = ЛОЖЬ");	

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	СчетОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	Попытка 
		СчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка проведения: " + Строка.Ссылка); 		
	КонецПопытки;
	
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьБонШанс(Команда)
	ОбновитьБонШансНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьБонШансНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.БонШанс = ИСТИНА");

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	Попытка 
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка: " + ЗаявкаОбъект.Номер + ". " + ОписаниеОшибки());
	КонецПопытки;
	
КонецЦикла;

КонецПроцедуры
//

//
&НаКлиенте
Процедура УстановитьДатаУслуги(Команда)
	УстановитьДатаУслугиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьДатаУслугиНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	Если ЗаявкаОбъект.ДопУслуги.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	ПровестиЗаявку = Ложь;
	Для Каждого СтрокаУслуги Из ЗаявкаОбъект.ДопУслуги Цикл
		Если ЗначениеЗаполнено(СтрокаУслуги.ДатаУслуги) Тогда
			Если СтрокаУслуги.ДатаУслуги >= ЗаявкаОбъект.РезервС И СтрокаУслуги.ДатаУслуги < ЗаявкаОбъект.РезервС
			Тогда Продолжить; КонецЕсли;
			
			Если СтрокаУслуги.ДатаУслуги >= ЗаявкаОбъект.РезервПо Тогда
				Если ЗаявкаОбъект.РезервС = ЗаявкаОбъект.РезервПо Тогда
					Если СтрокаУслуги.ДатаУслуги = ЗаявкаОбъект.РезервС Тогда Продолжить; КонецЕсли;
					
					СтрокаУслуги.ДатаУслуги = ЗаявкаОбъект.РезервС;
				Иначе
					СтрокаУслуги.ДатаУслуги = ЗаявкаОбъект.РезервПо - 24*60*60;
				КонецЕсли;
				
				ПровестиЗаявку = Истина;
				
				Сообщить("ДатаУслуги >= РезервПо. Заявка: " + ЗаявкаОбъект.Ссылка);
				
			ИначеЕсли СтрокаУслуги.ДатаУслуги < ЗаявкаОбъект.РезервС Тогда
				СтрокаУслуги.ДатаУслуги = ЗаявкаОбъект.РезервС;
				
				ПровестиЗаявку = Истина;
				Сообщить("ДатаУслуги < РезервС. Заявка: " + ЗаявкаОбъект.Ссылка);
			КонецЕсли;				
		Иначе	
			СтрокаУслуги.ДатаУслуги = ЗаявкаОбъект.РезервС;
			
			ПровестиЗаявку = Истина;

			Сообщить("ДатаУслуги пусто. Заявка: " + ЗаявкаОбъект.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Если ПровестиЗаявку Тогда
		Попытка
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Ошибка записи заявки: " + ЗаявкаОбъект.Ссылка + ". Описание ошибки: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
КонецЦикла;
	
	
КонецПроцедуры
//

//
&НаКлиенте
Процедура УстранитьОшибкиЗаменыКонтрагентов(Команда)
ЗаполнитьОшибкиЗаменыКонтрагентовНаСервере();

ПараметрыФормы = Новый Структура("Данные", ТЗ_Данные);
Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ОшибкиЗаменыКонтрагентов", ЭтаФорма);
ОткрытьФорму("Обработка.ОбновитьДанные.Форма.ОшибкиЗаменыКонтрагентов", ПараметрыФормы, ЭтаФорма
	,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

//Описание = Новый ОписаниеОповещения("ЗавершениеВопроса_Обновить", ЭтаФорма);	
//ПоказатьВопрос(Описание, "Обновить ?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры


&НаКлиенте
Процедура ЗавершениеФормы_ОшибкиЗаменыКонтрагентов(Результат, ДополнительныеПараметы) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли; 	

ТЗ_Данные.Очистить();
Для Каждого Строка Из Результат Цикл
	НоваяСтрока = ТЗ_Данные.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;
	
Описание = Новый ОписаниеОповещения("ЗавершениеВопроса_Обновить", ЭтаФорма);	
ПоказатьВопрос(Описание, "Обновить ?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры


&НаКлиенте
Процедура ЗавершениеВопроса_Обновить(Результат, ДополнительныеПараметы) Экспорт
Если Результат = КодВозвратаДиалога.Нет Тогда Возврат; КонецЕсли; 	

УстранитьОшибкиЗаменыКонтрагентовНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОшибкиЗаменыКонтрагентовНаСервере()
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронирование.Оплачивает КАК Оплачивает
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.Оплачивает.Турагентство = ИСТИНА");	
	
ТЗ = Запрос.Выполнить().Выгрузить();

Для каждого Строка Из ТЗ Цикл 
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	ТЗ_Счета = ЗаявкаОбъект.Счета;
	ЕстьСчет = Ложь;

	Для Каждого СтрокаСчет Из ТЗ_Счета Цикл
		Если СтрокаСчет.Контрагент = Строка.Оплачивает Тогда
			Если СтрокаСчет.ТолькоУслуги Тогда 
				ЕстьСчет = Истина;
				Сообщить("Счет " + Строка.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	ЕстьКассовыйДокумент = Ложь;				
	ТЗ_Оплаты = ЗаявкаОбъект.СчетаДетальноОплаты;
	Для Каждого СтрокаОплата Из ТЗ_Оплаты Цикл
		Если ТипЗнч(СтрокаОплата.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
			Если СтрокаОплата.ДокументОплаты.ОтКого = Строка.Оплачивает Тогда
				ЕстьКассовыйДокумент = Истина;				
				Сообщить("КассовыйДокумент " + Строка.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьСчет ИЛИ ЕстьКассовыйДокумент Тогда
		НоваяСтрока = ТЗ_Данные.Добавить();
		НоваяСтрока.Заявка = ЗаявкаОбъект.Ссылка;
		НоваяСтрока.Счет = ЕстьСчет;
		НоваяСтрока.КД = ЕстьКассовыйДокумент;
	КонецЕсли;
КонецЦикла;

КонецПроцедуры


&НаСервере
Функция УстранитьОшибкиЗаменыКонтрагентовНаСервере()

Для каждого Строка Из ТЗ_Данные Цикл 
	Если НЕ (Строка.Счет ИЛИ Строка.КД) Тогда Продолжить; КонецЕсли;
	
	ЗаявкаОбъект = Строка.Заявка.ПолучитьОбъект();
	
	ТЗ_Счета = ЗаявкаОбъект.Счета;
	ЗаписатьОбъект = Ложь;

	Для Каждого СтрокаСчет Из ТЗ_Счета Цикл
		Если СтрокаСчет.Контрагент = ЗаявкаОбъект.Оплачивает Тогда
			Если СтрокаСчет.ТолькоУслуги Тогда 
				Если Строка.Счет Тогда 
					СтрокаСчет.Контрагент = ЗаявкаОбъект.Клиент;	
					ЗаписатьОбъект = Истина;
				КонецЕсли;
				Сообщить("Счет " + ЗаявкаОбъект.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаписатьОбъект Тогда
		Попытка 
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Ошибка записи " + ЗаявкаОбъект.Ссылка + " Описание ошибки: " + ОписаниеОшибки()); 			
		КонецПопытки;
	КонецЕсли;	
		
	ТЗ_Оплаты = ЗаявкаОбъект.СчетаДетальноОплаты;
	
	Для Каждого СтрокаОплата Из ТЗ_Оплаты Цикл
		Если ТипЗнч(СтрокаОплата.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
			Если СтрокаОплата.ДокументОплаты.ОтКого = ЗаявкаОбъект.Оплачивает Тогда
				Если Строка.КД Тогда
					КассовыйДокументОбъект = СтрокаОплата.ДокументОплаты.Ссылка.ПолучитьОбъект();
					КассовыйДокументОбъект.ОтКого = ЗаявкаОбъект.Клиент;	
					Попытка 
						КассовыйДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Сообщить("Ошибка записи " + КассовыйДокументОбъект.Ссылка + " Описание ошибки: " + ОписаниеОшибки()); 			
					КонецПопытки;
				КонецЕсли;
				
				Сообщить("КассовыйДокумент " + КассовыйДокументОбъект.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецЦикла;

КонецФункции
//

//
&НаКлиенте
Процедура ЗаполнитьРаспределениеОплатКоворкинг(Команда)
	ЗаполнитьРаспределениеОплатКоворкингНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспределениеОплатКоворкингНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингСчета.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.КоворкингСчета КАК КоворкингСчета
                      |ГДЕ
                      |	КоворкингСчета.ПометкаУдаления = ЛОЖЬ");
					  
ТЗ = Запрос.Выполнить().Выгрузить();	

Для Каждого Строка Из Тз Цикл
	СчетОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	КоворкингСервер.ОбновитьОплатыКоворкинг(СчетОбъект);			
	
	Попытка 
		СчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка проведения " + СчетОбъект.Ссылка + ". Описание ошибки: " + ОписаниеОшибки()); 		
	КонецПопытки;
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗаполнитьТипОплатыСчетаТурагентства(Команда)
	ЗаполнитьТипОплатыСчетаТурагентстваНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипОплатыСчетаТурагентстваНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты
                      |ГДЕ
                      |	Клиенты.ПометкаУдаления = ЛОЖЬ
                      |	И Клиенты.Турагентство = ИСТИНА");

ТЗ =  Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	КлиентОбъект = Строка.Ссылка.ПолучитьОбъект(); 	
	
	Если КлиентОбъект.ГрупповыеСчетаТурагенства Тогда
		КлиентОбъект.ТипОплатыСчета = Перечисления.ТипОплатыСчета.Взаимозачет;
	ИначеЕсли КлиентОбъект.КомиссияСчета Тогда
		КлиентОбъект.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой;
	КонецЕсли;	
	
	КлиентОбъект.Записать(); 	
КонецЦикла;
	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗаполнитьЭтоПредварительныйГрупповойСчет(Команда)
	ЗаполнитьЭтоПредварительныйГрупповойСчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтоПредварительныйГрупповойСчетНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого СтрокаЗаявка Из ТЗ Цикл
	ЗаявкаОбъект = СтрокаЗаявка.Ссылка.ПолучитьОбъект();
	
	Записать = Ложь;	
	
	Счета = ЗаявкаОбъект.Счета;
	Для Каждого Счет Из Счета Цикл
		Если Счет.Контрагент.Турагентство
		И (Счет.Контрагент.ТипОплатыСчета = Перечисления.ТипОплатыСчета.Взаимозачет
			ИЛИ Счет.Контрагент.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой) 
		Тогда
			Если НЕ Счет.ЭтоПредварительныйГрупповойСчет Тогда
				Счет.ЭтоПредварительныйГрупповойСчет = Истина;
				
				Сообщить("Заявка: " + ЗаявкаОбъект.Номер + ", Номер счета: " + Счет.НомерСчета); 
				Записать = Истина;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Записать Тогда 
		Попытка 
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Исключение
			Сообщить("Ошибка проведения заявки: " + СтрокаЗаявка.Ссылка);			
		КонецПопытки;
	КонецЕсли;
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗаполнитьЦенаМинибар(Команда)
	ЗаполнитьЦенаМинибарНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦенаМинибарНаСервере()
ДатаНачала = '20230501';	
ДатаОкончания = НачалоДня(ТекущаяДата());

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеОбслуживаниеНомера.Ссылка КАК Ссылка,
                      |	ГорничныеОбслуживаниеНомера.Минибар.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		НоменклатураМинибара КАК НоменклатураМинибара,
                      |		НоменклатураМинибараКодВыгрузка КАК НоменклатураМинибараКодВыгрузка,
                      |		НоменклатураМинибараНаименованиеВыгрузка КАК НоменклатураМинибараНаименованиеВыгрузка,
                      |		Количество КАК Количество,
                      |		Цена КАК Цена
                      |	) КАК Минибар
                      |ИЗ
                      |	Документ.ГорничныеОбслуживаниеНомера КАК ГорничныеОбслуживаниеНомера
                      |ГДЕ
                      |	ГорничныеОбслуживаниеНомера.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеОбслуживаниеНомера.ДатаОбслуживания >= &ДатаНачала
                      |	И ГорничныеОбслуживаниеНомера.ДатаОбслуживания <= &ДатаОкончания");

Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);				 
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Если Строка.Минибар.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	ГорничныеОбслуживаниеНомераОбъект = Строка.Ссылка.ПолучитьОбъект();
	Для Каждого СтрокаМинибар Из Строка.Минибар Цикл
		СтрокаМинибар.Цена = СтрокаМинибар.НоменклатураМинибара.Цена;		
	КонецЦикла;
	
	Попытка 
		 ГорничныеОбслуживаниеНомераОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		 Сообщить("Ошибка проведения: " + ГорничныеОбслуживаниеНомераОбъект.Ссылка 
		 	+ ". " + ОписаниеОшибки() + ".");
	КонецПопытки;
КонецЦикла;

КонецПроцедуры
//


//
&НаКлиенте
Процедура ОбовитьКаналыБронированияКод(Команда)
	ОбовитьКаналыБронированияКодНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбовитьКаналыБронированияКодНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КаналыБронирования.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.КаналыБронирования КАК КаналыБронирования");

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Если Строка.Ссылка.Предопределенный Тогда Продолжить; КонецЕсли;
	
	КодЧисло = Число(Строка.Ссылка.Код);
	Если КодЧисло > 2000 Тогда Продолжить; КонецЕсли;
	
	КаналОбъект = Строка.Ссылка.ПолучитьОбъект();
	КодЧисло = КодЧисло + 1000;
	
	Код = Формат(КодЧисло, "ЧЦ=9; ЧВН=; ЧГ=0");
	КаналОбъект.Код = Код;
	КаналОбъект.Записать();
КонецЦикла;
КонецПроцедуры

//
&НаКлиенте
Процедура ОбновитьКаналыБронирования(Команда)
	ОбновитьКаналыБронированияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКаналыБронированияНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронирование.КаналБронирования.Наименование КАК КаналБронированияНаименование,
                      |	ЗаявкаНаБронирование.КаналБронирования.Предопределенный КАК КаналБронированияПредопределенный,
                      |	ЗаявкаНаБронирование.КаналБронирования КАК КаналБронирования
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Если НЕ ЗначениеЗаполнено(Строка.КаналБронированияНаименование) Тогда Продолжить; КонецЕсли;
	
	ЗаявкаОбъект = Строка.Ссылка.Получитьобъект();
	
	Если Строка.КаналБронированияНаименование = "Наш сайт" 
	И НЕ Строка.КаналБронированияПредопределенный 	
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.НашCайт;		
		
	ИначеЕсли Строка.КаналБронированияНаименование = "Сайт" 
	И НЕ Строка.КаналБронированияПредопределенный
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.НашCайт;		
		
	ИначеЕсли Строка.КаналБронированияНаименование = "Электронная почта" 
	И НЕ Строка.КаналБронированияПредопределенный
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.ЭлектроннаяПочта;		
		
	ИначеЕсли Строка.КаналБронированияНаименование = "Эл.почта" 
	И НЕ Строка.КаналБронированияПредопределенный
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.ЭлектроннаяПочта;		
		
	ИначеЕсли Строка.КаналБронированияНаименование = "Телефон" 
	И НЕ Строка.КаналБронированияПредопределенный
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.Телефон;		
		
	ИначеЕсли Строка.КаналБронированияНаименование = "Трэвеллайн" 
	И НЕ Строка.КаналБронированияПредопределенный 
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.Трэвеллайн;	
		
	ИначеЕсли Строка.КаналБронированияНаименование = "Трэвелайн" 
	И НЕ Строка.КаналБронированияПредопределенный 
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.Трэвеллайн;	
		
	ИначеЕсли Строка.КаналБронированияНаименование = "мобильное приложение" 
	И НЕ Строка.КаналБронированияПредопределенный 	
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.МобильноеПриложение;	
		
	ИначеЕсли Строка.КаналБронированияНаименование = "От стойки" 
	И НЕ Строка.КаналБронированияПредопределенный
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.ОтСтойки;	
		
	ИначеЕсли Строка.КаналБронированияНаименование = "WhatsApp" 
	И НЕ Строка.КаналБронированияПредопределенный 	
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.WhatsApp;
		
	ИначеЕсли Строка.КаналБронированияНаименование = "W/A" 
	И НЕ Строка.КаналБронированияПредопределенный 	
	Тогда
		ЗаявкаОбъект.КаналБронирования = Справочники.КаналыБронирования.WhatsApp;
			
	Иначе
		Если Строка.КаналБронирования.ПометкаУдаления Тогда
			ЗаявкаОбъект.КаналБронирования = Неопределено;
		Иначе	
			Продолжить;
		КонецЕсли;
	КонецЕсли;
	
	Попытка 
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьВидыКлиентовКод(Команда)
	ОбновитьВидыКлиентовКодНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидыКлиентовКодНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВидыКлиентов.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.ВидыКлиентов КАК ВидыКлиентов");

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	Если Строка.Ссылка.Предопределенный Тогда Продолжить; КонецЕсли;
	
	КодЧисло = Число(Строка.Ссылка.Код);
	Если КодЧисло > 2000 Тогда Продолжить; КонецЕсли;
	
	ВидыКлиентовОбъект = Строка.Ссылка.ПолучитьОбъект();
	КодЧисло = КодЧисло + 1000;
	
	Код = Формат(КодЧисло, "ЧЦ=9; ЧВН=; ЧГ=0");
	ВидыКлиентовОбъект.Код = Код;
	ВидыКлиентовОбъект.Записать();
КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьВидыКлиентов(Команда)
	ОбновитьВидыКлиентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидыКлиентовНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Ссылка,
                      |	Клиенты.ВидКлиента КАК ВидКлиента,
                      |	Клиенты.ВидКлиента.Наименование КАК ВидКлиентаНаименование,
                      |	Клиенты.ВидКлиента.Предопределенный КАК ВидКлиентаПредопределенный
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Если НЕ ЗначениеЗаполнено(Строка.ВидКлиентаНаименование) Тогда Продолжить; КонецЕсли;
	
	КлиентОбъект = Строка.Ссылка.Получитьобъект();
	
	Если Строка.ВидКлиентаНаименование = "Иные агентства" 
	И НЕ Строка.ВидКлиентаПредопределенный 	
	Тогда
		КлиентОбъект.ВидКлиента = Справочники.ВидыКлиентов.ИныеАгентства;		
		
	ИначеЕсли Строка.ВидКлиентаНаименование = "Корпоративные клиенты" 
	И НЕ Строка.ВидКлиентаПредопределенный 	
	Тогда
		КлиентОбъект.ВидКлиента = Справочники.ВидыКлиентов.КорпоративныеКлиенты;		
		
	ИначеЕсли Строка.ВидКлиентаНаименование = "Постоянные клиенты" 
	И НЕ Строка.ВидКлиентаПредопределенный 	
	Тогда
		КлиентОбъект.ВидКлиента = Справочники.ВидыКлиентов.Постоянные;		
		
	ИначеЕсли Строка.ВидКлиентаНаименование = "Частные брони" 
	И НЕ Строка.ВидКлиентаПредопределенный 	
	Тогда
		КлиентОбъект.ВидКлиента = Справочники.ВидыКлиентов.Частные;		
		
	ИначеЕсли Строка.ВидКлиентаНаименование = "Романтики" 
	И НЕ Строка.ВидКлиентаПредопределенный 	
	Тогда
		КлиентОбъект.ВидКлиента = Справочники.ВидыКлиентов.Романтики;
	Иначе
		Продолжить;
	КонецЕсли;
	
	КлиентОбъект.Записать();
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьПутьДоФото(Команда)
	ОбновитьПутьДоФотоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПутьДоФотоНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты");

ТЗ = Запрос.Выполнить().Выгрузить();

//Каталог = Константы.Папка_C_BASE.Получить() + "SCAN\";
Каталог = СлужебныеСервер.КаталогСканов();

Для Каждого Строка Из ТЗ Цикл
	КлиентОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	Сканы = КлиентОбъект.СканыДокументов;
	Если Сканы.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	МассивКУдалению = Новый Массив;
	Для Каждого Скан Из Сканы Цикл
		ИмяФайлаИсточника = Скан.ПутьДоФото; 
		
		Индекс = СтрНайти(Скан.ПутьДоФото, "\", НаправлениеПоиска.СКонца);
		ИмяФайла = Сред(ИмяФайлаИсточника, Индекс + 1); 
		ИмяФайлаИсточника = Каталог + ИмяФайла;
		
		ГУИДСтрока = Строка(Строка.Ссылка.УникальныйИдентификатор());
		Если Лев(ИмяФайла, 36) = ГУИДСтрока Тогда Продолжить; КонецЕсли;
		
		Скан.ПутьДоФото = ГУИДСтрока + "_" + ИмяФайла; 
		
		ИмяФайлаПриемника = Каталог + Скан.ПутьДоФото; 
		
		Попытка
			ПереместитьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника); 
		Исключение
			МассивКУдалению.Добавить(Скан);
		КонецПопытки;
	КонецЦикла;
	
	Для Каждого Элемент Из МассивКУдалению Цикл
		Сканы.Удалить(Элемент);		
	КонецЦикла;
	
	КлиентОбъект.Записать();	
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗаполнитьТелефонНормализованный(Команда)
	ЗаполнитьТелефонНормализованныйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТелефонНормализованныйНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Если НЕ ЗначениеЗаполнено(Строка.Ссылка.Телефон) Тогда Продолжить; КонецЕсли;	
	
	Объект_П = Строка.Ссылка.ПолучитьОбъект();
	
	Ответ = СлужебныеКлиентСервер.ПроверкаНомераТелефона(Объект_П.Телефон); 
	Если Ответ.КодОшибки = -1 Тогда 
		Объект_П.ТелефонНормализованный = "";
		
		Сообщить("Ошибка: " + Объект_П. Наименование + " " + Объект_П.Телефон);
	Иначе	
		Объект_П.ТелефонНормализованный = Ответ.ТелефонНомер;	
	КонецЕсли;

	Объект_П.Записать();
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗаполнитьАдминистраторыСправочник(Команда)
	ЗаполнитьАдминистраторыСправочникНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдминистраторыСправочникНаСервере()
//Запрос = Новый Запрос("ВЫБРАТЬ
//                      |	Администраторы.Ссылка КАК Ссылка
//                      |ИЗ
//                      |	Справочник.Администраторы КАК Администраторы");

//ТЗ = Запрос.Выполнить().Выгрузить();
//Для Каждого Строка Из ТЗ Цикл
//	Объект_П = Строка.Ссылка.ПолучитьОбъект();
//	Если Объект_П.Начисления.Количество() > 0 Тогда 
//		Сообщить("Администратор: " + Строка.Ссылка + " .Уже заполнен");
//		
//		Продолжить;
//	КонецЕсли;
//	
//	Начисления = Объект_П.Начисления;
//	
//	НоваяСтрока = Начисления.Добавить();
//	НоваяСтрока.ДатаУстановки = '20240101';
//	НоваяСтрока.СтавкаЗаСмену12 = Строка.Ссылка.СтавкаЗаСмену12_КУдалению;
//	НоваяСтрока.СтавкаЗаСмену24 = Строка.Ссылка.СтавкаЗаСмену24_КУдалению;
//	НоваяСтрока.СтавкаЗаПереработку = Строка.Ссылка.СтавкаЗаПереработку_КУдалению;
//	НоваяСтрока.НадбавкаЗаСтандарты = Строка.Ссылка.НадбавкаЗаСтандарты_КУдалению;
//	НоваяСтрока.НадбавкаЗаИнЯзыки = Строка.Ссылка.НадбавкаЗаИнЯзыки_КУдалению;
//	НоваяСтрока.СтавкаЗаЗаселение = Строка.Ссылка.СтавкаЗаЗаселения_КУдалению;
//	НоваяСтрока.СтавкаЗаОтпуск = Строка.Ссылка.СтавкаЗаОтпуск_КУдалению;
//	НоваяСтрока.СтавкаЗавтракиЧехов = Строка.Ссылка.СтавкаЗавтракиЧехов_КУдалению;
//	НоваяСтрока.СтавкаЗавтракиДомСоветов = Строка.Ссылка.СтавкаЗавтракиДомСоветов_КУдалению;
//	НоваяСтрока.СтавкаЗавтракиЛайв = Строка.Ссылка.СтавкаЗавтракиЛайв_КУдалению;
//	НоваяСтрока.СуммаОклад = Строка.Ссылка.СуммаОклад_КУдалению;
//	НоваяСтрока.НадбавкаЗаПроживающих = Строка.Ссылка.НадбавкаЗаПроживающих_КУдалению;
//	
//	Объект_П.Записать();
//КонецЦикла;
	
КонецПроцедуры


//
&НаКлиенте
Процедура ОбновитьСтавкиНДС(Команда)
	ОбновитьСтавкиНДСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтавкиНДСНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ЭтоГруппа = ЛОЖЬ");

ТЗ =  Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	УслугиОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	Если УслугиОбъект.ПрограммныйКод <> Перечисления.ПрограммныйКодУслуги.ПРОЖИВАНИЕ_УСЛУГИ Тогда
		УслугиОбъект.ЕстьНДС = Истина;
	КонецЕсли;
	
	УслугиОбъект.Записать();
КонецЦикла
КонецПроцедуры

//

&НаКлиенте
Процедура ЗаполнитьПрограммныйКодУслуги(Команда)
	ЗаполнитьПрограммныйКодУслугиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПрограммныйКодУслугиНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.РезервС >= &РезервС");

Запрос.УстановитьПараметр("РезервС", '20240101');
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Объект_П = Строка.Ссылка.ПолучитьОбъект();
	СчетаДетальноДолги = Объект_П.СчетаДетальноДолги;
	ДопУслуги = Объект_П.ДопУслуги;
	
	Для Каждого СтрокаДолги Из СчетаДетальноДолги Цикл
		Если НЕ СтрокаДолги.Услуга Тогда Продолжить; КонецЕсли;
		
		ОтборСтроки = Новый Структура("ГУИД", СтрокаДолги.ДолгиГУИД);
		НайденныеСтроки = ДопУслуги.НайтиСтроки(ОтборСтроки); 
		Если НайденныеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		Услуга = НайденныеСтроки[0].Услуга;
		СтрокаДолги.ПрограммныйКодУслуги = Услуга.ПрограммныйКод; 
		
		СтрокаДолги.НазваниеДляЧека = Услуга.НазваниеДляЧека;
	КонецЦикла;
	
	Попытка
		Объект_П.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Ошибка проведения " + Строка.Ссылка + " Описание ошибки: " + ОписаниеОшибки());
	КонецПопытки;
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьГрупповыеСчета(Команда)
	ОбновитьГрупповыеСчетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьГрупповыеСчетаНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГрупповыеСчета.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |ГДЕ
                      |	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ");

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Объект_П = Строка.Ссылка.ПолучитьОбъект();
	Объект_П.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;

КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗаполнитьГрупповыеСчетаРаспределениеОплатСчетГУИД(Команда)
	ЗаполнитьГрупповыеСчетаРаспределениеОплатСчетГУИДНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрупповыеСчетаРаспределениеОплатСчетГУИДНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГрупповыеСчета.Ссылка КАК ГрупповойСчет
                      |ИЗ
                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета");

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	ГрупповойСчетОбъект = Строка.ГрупповойСчет.ПолучитьОбъект();
	
	РаспределениеОплат = ГрупповойСчетОбъект.РаспределениеОплат;
	РаспределениеОплат.Очистить();
	
	Для Каждого СтрокаОплаты Из ГрупповойСчетОбъект.ДокументыОплаты Цикл
		Для Каждого СтрокаДолги Из ГрупповойСчетОбъект.ДокументыДолги Цикл
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
			                      |ИЗ
			                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
			                      |ГДЕ
			                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = &Ссылка
			                      |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД = &СчетГУИД
			                      |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = &ДокументОплаты
			                      |
			                      |СГРУППИРОВАТЬ ПО
			                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
			                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД,
			                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты");
			
			Запрос.УстановитьПараметр("Ссылка", СтрокаДолги.ДокументДолг);
			Запрос.УстановитьПараметр("СчетГУИД", СтрокаДолги.СчетГУИД);
			Запрос.УстановитьПараметр("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				СуммаОплаты = Выборка.СуммаОплаты; 
			Иначе
				СуммаОплаты = 0;
			КонецЕсли;
			
			СтрокаРаспределениеОплат = РаспределениеОплат.Добавить();
			
			СтрокаРаспределениеОплат.ДокументОплаты = СтрокаОплаты.ДокументОплаты;
			СтрокаРаспределениеОплат.ДокументДолг = СтрокаДолги.ДокументДолг;
			СтрокаРаспределениеОплат.СчетГУИД = СтрокаДолги.СчетГУИД;
			
			СтрокаРаспределениеОплат.СуммаОплаты = СуммаОплаты;
		КонецЦикла;
	КонецЦикла;
	
	Попытка 
		ГрупповойСчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("" + ГрупповойСчетОбъект.Ссылка + " Описание ошибки " + ОписаниеОшибки());
	КонецПопытки;
КонецЦикла;

	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьЗаявкаДатаИзменения(Команда)
	ОбновитьЗаявкаДатаИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаявкаДатаИзмененияНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.Дата >= &Дата");

Запрос.УстановитьПараметр("Дата", '20250101');

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Объект_П = Строка.Ссылка.ПолучитьОбъект();
	
	Объект_П.ДатаИзменения = Объект_П.Дата; 
	Объект_П.ДатаСоздания = Объект_П.Дата; 
	
	Объект_П.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;
	
КонецПроцедуры
//

//

&НаКлиенте
Процедура ЗаполнитьАдминистраторыВерсия(Команда)
	ЗаполнитьАдминистраторыВерсияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдминистраторыВерсияНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Администраторы_Версия.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.Администраторы_Версия КАК Администраторы_Версия");

Пустой = Запрос.Выполнить().Пустой(); 
Если НЕ Пустой Тогда
	Сообщить("Справочник Администраторы_Версия НЕ пустой. ЗАГРУЗКА НЕ ВЫПОЛНЕНА");
	
	Перейти ~ПРОДОЛЖИТЬ_1;
КонецЕсли ;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Администраторы.Ссылка КАК Ссылка,
                      |	Администраторы.ПометкаУдаления КАК ПометкаУдаления,
                      |	Администраторы.Код КАК Код,
                      |	Администраторы.Наименование КАК Наименование,
                      |	Администраторы.Пользователь КАК Пользователь,
                      |	Администраторы.ДатаПриема КАК ДатаПриема,
                      |	Администраторы.НеНачислятьЗаСтаж КАК НеНачислятьЗаСтаж,
                      |	Администраторы.НеРаботает КАК НеРаботает,
                      |	Администраторы.Сортировка КАК Сортировка,
                      |	Администраторы.АдминистраторКодЛайв КАК АдминистраторКодЛайв,
                      |	Администраторы.АдминистраторКодДомСоветов КАК АдминистраторКодДомСоветов,
                      |	Администраторы.АдминистраторКодСтритАрт КАК АдминистраторКодСтритАрт,
                      |	Администраторы.Постоянный КАК Постоянный,
                      |	Администраторы.Должность КАК Должность,
                      |	Администраторы.Начисления.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		ДатаУстановки КАК ДатаУстановки,
                      |		СтавкаЗаСмену12 КАК СтавкаЗаСмену12,
                      |		СтавкаЗаСмену24 КАК СтавкаЗаСмену24,
                      |		СтавкаЗаПереработку КАК СтавкаЗаПереработку,
                      |		НадбавкаЗаСтандарты КАК НадбавкаЗаСтандарты,
                      |		НадбавкаЗаИнЯзыки КАК НадбавкаЗаИнЯзыки,
                      |		СтавкаЗаЗаселение КАК СтавкаЗаЗаселение,
                      |		СтавкаЗаОтпуск КАК СтавкаЗаОтпуск,
                      |		СтавкаЗавтракиЧехов КАК СтавкаЗавтракиЧехов,
                      |		СтавкаЗавтракиДомСоветов КАК СтавкаЗавтракиДомСоветов,
                      |		СтавкаЗавтракиЛайв КАК СтавкаЗавтракиЛайв,
                      |		СуммаОклад КАК СуммаОклад,
                      |		НадбавкаЗаПроживающих КАК НадбавкаЗаПроживающих
                      |	) КАК Начисления
                      |ИЗ
                      |	Справочник.Администраторы КАК Администраторы");

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл 
	Администраторы_ВерсияОбъект = Справочники.Администраторы_Версия.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(Администраторы_ВерсияОбъект, Строка, ,"Начисления");

	Начисления = Строка.Начисления;
	Для Каждого СтрокаНачисления Из Начисления Цикл
		НоваяСтрока = Администраторы_ВерсияОбъект.Начисления.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНачисления);
	КонецЦикла;
	
	Администраторы_ВерсияОбъект.Записать();
КонецЦикла;	

~ПРОДОЛЖИТЬ_1: 
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	АдминистраторыСуммаЗаПроживающих_Версия.ГУИД КАК ГУИД
                      |ИЗ
                      |	РегистрСведений.АдминистраторыСуммаЗаПроживающих_Версия КАК АдминистраторыСуммаЗаПроживающих_Версия");

Пустой = Запрос.Выполнить().Пустой(); 
Если НЕ Пустой Тогда
	Сообщить("РегистрСведений АдминистраторыСуммаЗаПроживающих_Версия НЕ пустой. ЗАГРУЗКА НЕ ВЫПОЛНЕНА");
	
	Перейти ~ПРОДОЛЖИТЬ_2;
КонецЕсли ;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	АдминистраторыСуммаЗаПроживающих.ДатаНазначения КАК ДатаНазначения,
                      |	АдминистраторыСуммаЗаПроживающих.КоличествоНомеровС КАК КоличествоНомеровС,
                      |	АдминистраторыСуммаЗаПроживающих.КоличествоНомеровПо КАК КоличествоНомеровПо,
                      |	АдминистраторыСуммаЗаПроживающих.Сумма_12 КАК Сумма_12,
                      |	АдминистраторыСуммаЗаПроживающих.Сумма_24 КАК Сумма_24
                      |ИЗ
                      |	РегистрСведений.АдминистраторыСуммаЗаПроживающих КАК АдминистраторыСуммаЗаПроживающих");

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл 
	МенеджерЗаписи = РегистрыСведений.АдминистраторыСуммаЗаПроживающих_Версия.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.ГУИД = Новый УникальныйИдентификатор();   

	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);   

	МенеджерЗаписи.Записать();
КонецЦикла;	

~ПРОДОЛЖИТЬ_2: 


КонецПроцедуры
//


