
Функция ПрошлыйПериодДопУслуги_ТекстЗапроса() Экспорт
ТекстЗапроса = "ВЫБРАТЬ
               |	ТЗ.ПрочиеОплатыДокументОплаты КАК ДокументОплаты,
               |	ТЗ.ПрочиеОплатыДокументДолг КАК ДокументДолг,
               |	ТЗ.Сумма КАК Сумма
               |ПОМЕСТИТЬ ТЗ
               |ИЗ
               |	&ТЗ КАК ТЗ
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	ПрочиеОплаты.Ссылка КАК ДокументОплаты,
               |	Долги.ДокументДолг КАК ДокументДолг,
               |	Долги.ДокументДолг.РезервПо КАК ДатаДолга,
               |	ЕСТЬNULL(Закрыто.СуммаЗакрыто, 0) КАК СуммаЗакрыто,
               |	ЕСТЬNULL(Долги.Сумма, 0) КАК СуммаДолга,
               |	ЕСТЬNULL(ТЗ.Сумма, 0) КАК СуммаТекущая,
               |	ЕСТЬNULL(Долги.Сумма, 0) - ЕСТЬNULL(Закрыто.СуммаЗакрыто, 0) - ЕСТЬNULL(ТЗ.Сумма, 0) КАК СуммаКЗакрытию
               |ИЗ
               |	Документ.ПрочиеОплаты КАК ПрочиеОплаты
               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ПрочиеОплатыДолгиОплата.Ссылка КАК Ссылка,
               |			ПрочиеОплатыДолгиОплата.ДокументДолг КАК ДокументДолг,
               |			СУММА(ПрочиеОплатыДолгиОплата.Сумма) КАК Сумма
               |		ИЗ
               |			Документ.ПрочиеОплаты.ДолгиОплата КАК ПрочиеОплатыДолгиОплата
               |		ГДЕ
               |			ТИПЗНАЧЕНИЯ(ПрочиеОплатыДолгиОплата.ДокументДолг) = ТИП(Документ.ЗаявкаНаБронирование)
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ПрочиеОплатыДолгиОплата.Ссылка,
               |			ПрочиеОплатыДолгиОплата.ДокументДолг) КАК Долги
               |		ПО ПрочиеОплаты.Ссылка = Долги.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ПрочиеОплатыДолгиЗакрыто.Ссылка КАК Ссылка,
               |			ПрочиеОплатыДолгиЗакрыто.ДокументДолг КАК ДокументДолг,
               |			СУММА(ПрочиеОплатыДолгиЗакрыто.СуммаЗакрыто) КАК СуммаЗакрыто
               |		ИЗ
               |			Документ.ПрочиеОплаты.ДолгиЗакрыто КАК ПрочиеОплатыДолгиЗакрыто
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ПрочиеОплатыДолгиЗакрыто.Ссылка,
               |			ПрочиеОплатыДолгиЗакрыто.ДокументДолг) КАК Закрыто
               |		ПО ПрочиеОплаты.Ссылка = Закрыто.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
               |		ПО ПрочиеОплаты.Ссылка = ТЗ.ДокументОплаты
               |ГДЕ
               |	ПрочиеОплаты.ПометкаУдаления = ЛОЖЬ
               |	И ПрочиеОплаты.Приход = ИСТИНА
               |	И ПрочиеОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)";
	
Возврат ТекстЗапроса;	
КонецФункции

//////// + Заявка на бронирование
Функция ТекущийСчетСтруктура(ТекущаяСтрока, Объект) Экспорт
Счет = Объект.Счета.НайтиПоИдентификатору(ТекущаяСтрока);
СчетСтруктура = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("ЗаявкаНаБронирование", "Счета");
ОбщийФункционалСервер.СкопироватьДанныеВСтруктуру(СчетСтруктура, Счет);

Возврат СчетСтруктура;
КонецФункции	
//
Процедура ОбновитьСчетИзСчетНаОплату(Счет, ДанныеСчета, Объект) Экспорт
СчетГУИД = Счет.СчетГУИД;

//// + Счета 
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД); 

НайденыСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);
Если НайденыСтроки.Количество() = 0 Тогда
	// Это новый счет
	СчетОбъекта = Объект.Счета.Добавить();
Иначе
	СчетОбъекта = НайденыСтроки[0];
КонецЕсли;	
ЗаполнитьЗначенияСвойств(СчетОбъекта, Счет); 
//// - Счета

// + Замена СчетаДетальноДолги, РаспределениеОплатДолги счета и СчетаДетальноОплаты из ДанныеСчета
СчетаДетальноДолги = ДанныеСчета.СчетаДетальноДолги;
РаспределениеОплатДолги = ДанныеСчета.РаспределениеОплатДолги;

СчетаДетальноДанныеСчета = ДанныеСчета.СчетаДетальноДолги;
СчетаДетальноРезультат = Объект.СчетаДетальноДолги;
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = СчетаДетальноРезультат.НайтиСтроки(ОтборСтроки);
ОбщийФункционалСервер.УдалитьСтроки(СчетаДетальноРезультат, НайденныеСтроки);
ОбщийФункционалСервер.ДобавитьСтроки(СчетаДетальноРезультат, СчетаДетальноДанныеСчета);

СчетаДетальноДанныеСчета = ДанныеСчета.РаспределениеОплатДолги; 
СчетаДетальноРезультат = Объект.РаспределениеОплатДолги;
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = СчетаДетальноРезультат.НайтиСтроки(ОтборСтроки);
ОбщийФункционалСервер.УдалитьСтроки(СчетаДетальноРезультат, НайденныеСтроки);
ОбщийФункционалСервер.ДобавитьСтроки(СчетаДетальноРезультат, СчетаДетальноДанныеСчета);

СчетаДетальноДанныеСчета = ДанныеСчета.СчетаДетальноОплаты; 
СчетаДетальноРезультат = Объект.СчетаДетальноОплаты;
Для Каждого Строка Из СчетаДетальноДанныеСчета Цикл
	ОтборСтроки = Новый Структура("ДокументОплаты", Строка.ДокументОплаты);   
	ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, СчетаДетальноРезультат);
	
	НоваяСтрока = СчетаДетальноРезультат.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;
// - Замена СчетаДетальноДолги, РаспределениеОплатДолги счета и СчетаДетальноОплаты из ДанныеСчета

// + Обновление ДокументОплатыДолгОплата из ДанныеСчета.СчетаДетальноОплаты 
Для Каждого СтрокаОплаты Из ДанныеСчета.СчетаДетальноОплаты Цикл
	ДокументОплаты = СтрокаОплаты.ДокументОплаты;
	
	ОтборСтроки = Новый Структура("ДокументОплаты, СчетГУИД", ДокументОплаты, СчетГУИД);
	ТЗ = Объект.РаспределениеОплатДолги.Выгрузить(ОтборСтроки, "СуммаОплаты");
	СуммаОплаты = ТЗ.Итог("СуммаОплаты");
	
	ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, Объект.Ссылка, СчетГУИД, СуммаОплаты, Истина);   
КонецЦикла;
// - Обновление ДокументОплатыДолгОплата из ДанныеСчета.СчетаДетальноОплаты 

// + Удаление УдаленныеОплаты 
Для Каждого Строка Из ДанныеСчета.УдаленныеОплаты Цикл
	ДокументОплаты = Строка.ДокументОплаты;
	
	ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);   
	ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, Объект.СчетаДетальноОплаты);
			
	ОплатыОбщееСервер.УдалитьДокументОплатыДолгОплатыИДокументОплаты(ДокументОплаты, Объект.Ссылка, СчетГУИД);   
КонецЦикла;
// - Удаление УдаленныеОплаты 

// + Удаление пустого счета 
Если ДанныеСчета.СчетаДетальноДолги.Количество() = 0 Тогда
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД); 
	НайденыСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);
	ОбщийФункционалСервер.УдалитьСтроки(Объект.Счета, НайденыСтроки); 
КонецЕсли;
// - Удаление пустого счета 

//Закрыт = ОбщийМодульОплатыСервер.СчетЗакрыт(Объект.СчетаДетальноДолги, СчетГУИД);
//СчетОбъекта.Закрыт = Закрыт;
КонецПроцедуры

Функция ОбновитьСчетЗаявка(Счет, ТекущийОбъект, ОбновитьСчет) Экспорт 
Результат = Ложь;

Если ОбновитьСчет Тогда
	ДополнительныеСтрокиДетальноДолги = ЗаявкаСервер.ДополнительныеСтрокиДетальноДолги(Ложь
		, ТекущийОбъект, Счет, ТекущийОбъект.СчетаДетальноДолги, Ложь);
		
	ОбщийФункционалСервер.ДобавитьСтроки(ТекущийОбъект.СчетаДетальноДолги, ДополнительныеСтрокиДетальноДолги); 
	
	Результат = (ДополнительныеСтрокиДетальноДолги.Количество() = 0); 
КонецЕсли;

// + Получить МассивОплат счета (СчетГУИД)
СчетГУИД = Счет.СчетГУИД;
ОтборОплаты = Новый Структура("СчетГУИД", СчетГУИД);
Оплаты = ТекущийОбъект.РаспределениеОплатДолги.Выгрузить(ОтборОплаты, "ДокументОплаты");
Оплаты.Свернуть("ДокументОплаты");

МассивОплат = Новый Массив;
Для Каждого Строка Из Оплаты Цикл
	ОтборСтроки = Новый Структура("ДокументОплаты", Строка.ДокументОплаты);
	НайденныеСтроки = ТекущийОбъект.СчетаДетальноОплаты.НайтиСтроки(ОтборСтроки);
	Для Каждого НайленнаяСтрока Из НайденныеСтроки Цикл
		МассивОплат.Добавить(НайленнаяСтрока);		
	КонецЦикла;
КонецЦикла;
// - Получить МассивОплат счета (СчетГУИД)

//// + Очистка СчетаДетальноДолги, Строки оплат Массива Оплат, 
РаспределениеОплатДолги = ТекущийОбъект.РаспределениеОплатДолги;
// + Очистка сумм СчетаДетальноДолги в части СчетГУИД
Для Каждого СтрокаОплаты Из МассивОплат Цикл
	ОтборСтрокиОплаты = Новый Структура("ДокументОплаты, СчетГУИД", СтрокаОплаты.ДокументОплаты, Счет.СчетГУИД);
	НайденыеСтрокиРаспределениеОплатДолги = РаспределениеОплатДолги.НайтиСтроки(ОтборСтрокиОплаты);

	Для Каждого НайденаяСтрокаРаспределениеОплатДолги Из НайденыеСтрокиРаспределениеОплатДолги Цикл
		ОтборСтрокиДолги = Новый Структура("ДолгиГУИД", НайденаяСтрокаРаспределениеОплатДолги.ДолгиГУИД);
		НайденныеСтрокиСчетаДетальноДолги = ТекущийОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтрокиДолги); 
		
		Для Каждого НайденаяСтрокаСчетаДетальноДолги Из НайденныеСтрокиСчетаДетальноДолги Цикл
			НайденаяСтрокаСчетаДетальноДолги.СуммаОплачено = НайденаяСтрокаСчетаДетальноДолги.СуммаОплачено 
				- НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
				
			НайденаяСтрокаСчетаДетальноДолги.СуммаКЗакрытию = НайденаяСтрокаСчетаДетальноДолги.СуммаКЗакрытию 
				+ НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
		КонецЦикла;
	КонецЦикла;
КонецЦикла;
// - Очистка СчетаДетальноДолги в части СчетГУИД

// + Очистка сумм МассивОплат в части СчетГУИД, удаление РаспределениеОплатДолги в части СчетГУИД 
Для Каждого СтрокаОплаты Из МассивОплат Цикл
	ОтборСтрокиОплаты = Новый Структура("ДокументОплаты, СчетГУИД", СтрокаОплаты.ДокументОплаты, Счет.СчетГУИД);
	ЗаявкаСервер.ОчиститьСтрокаОплатыОтборСтроки(ОтборСтрокиОплаты, РаспределениеОплатДолги, СтрокаОплаты); 
КонецЦикла;
// - Очистка сумм МассивОплат в части СчетГУИД, удаление РаспределениеОплатДолги в части СчетГУИД 
//// + Очистка СчетаДетальноДолги, Строки оплат Массива Оплат, 

// + Распределить МассивОплат счета (СчетГУИД) на СчетаДетальноДолги счета (СчетГУИД)
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
СчетаДетальноДолги = ТекущийОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки); 
Для Каждого СтрокаОплаты Из МассивОплат Цикл
	Если СтрокаОплаты.ГрупповаяОплата Тогда Продолжить; КонецЕсли;
	
	ДокументОплаты = СтрокаОплаты.ДокументОплаты;
	
	ОплатаОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(ДокументОплаты, ТекущийОбъект); 
	Если ОплатаОстатокКРаспределению = 0 Тогда Продолжить; КонецЕсли;

	СуммаКЗакрытию = 0;
	Для Каждого Строка из СчетаДетальноДолги Цикл
		СуммаКЗакрытию = СуммаКЗакрытию + Строка.СуммаКЗакрытию;
	КонецЦикла;
	
	//Если СуммаКЗакрытию = 0 Тогда Продолжить; КонецЕсли;
	
	Если ОплатаОстатокКРаспределению > СуммаКЗакрытию Тогда 
		СуммаОплаты = СуммаКЗакрытию;
	Иначе
		СуммаОплаты = ОплатаОстатокКРаспределению;
	КонецЕсли;

	ЗаявкаСервер.РаспределитьСтрокаОплатаСчетаДетальноДолги(СтрокаОплаты, СуммаОплаты, СчетаДетальноДолги
		, ТекущийОбъект.РаспределениеОплатДолги);
	
	Если СтрокаОплаты.СуммаРаспределено = 0 Тогда
		ОплатыОбщееСервер.УдалитьДокументОплатыДолгОплатыИДокументОплаты(ДокументОплаты, ТекущийОбъект.Ссылка, СчетГУИД);
	Иначе		
		ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ТекущийОбъект.Ссылка, СчетГУИД
			, СтрокаОплаты.СуммаРаспределено, Истина);
	КонецЕсли;	
КонецЦикла;
// - Распределить МассивОплат от контрагента счета (СчетГУИД) на СчетаДетальноДолги счета (СчетГУИД)

Если НЕ Счет.ТолькоУслуги Тогда 
	ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
	СчетаДетальноДолги = ТекущийОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки); 
	НайденныеСтроки = ТекущийОбъект.Счета.НайтиСтроки(ОтборСтроки);
	ТекущийОбъектСчет = НайденныеСтроки[0];
	ЗаявкаСервер.ДатаСДатаПо(ТекущийОбъектСчет.ДатаС, ТекущийОбъектСчет.ДатаПо, СчетаДетальноДолги);	
КонецЕсли;

Возврат Результат;
КонецФункции
//

//////

//
Процедура ОбновитьИсториюКлиента(ЭтотОбъект) Экспорт 
Клиент = ЭтотОбъект.Клиент;	
//Заявка = ЭтотОбъект.Ссылка;	
ЗаявкаГУИД = ЭтотОбъект.Ссылка.УникальныйИдентификатор();
	
ИсторияКлиента = РегистрыСведений.ИсторияКлиента.СоздатьНаборЗаписей();

//ИсторияКлиента.Отбор.Клиент.Установить(Клиент);
//ИсторияКлиента.Отбор.Заявка.Установить(Заявка);
//ИсторияКлиента.Отбор.ЗаявкаГУИД.Установить(ГУИД);

ИсторияКлиента.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);
Для Каждого Строка Из ИсторияКлиента Цикл
	ИсторияКлиента.Удалить(Строка);
КонецЦикла;
	
НоваяЗапись = ИсторияКлиента.Добавить();

НоваяЗапись.Клиент = Клиент;
//НоваяЗапись.Заявка = Заявка;
НоваяЗапись.ЗаявкаГУИД = ЗаявкаГУИД;

НоваяЗапись.ДатаЗаявки = ЭтотОбъект.Дата;
НоваяЗапись.РезервС = ЭтотОбъект.РезервС;
НоваяЗапись.РезервПо = ЭтотОбъект.РезервПо;
НоваяЗапись.НомерВрезерв = ЭтотОбъект.НомерВрезерв.Наименование;

НоваяЗапись.Статус = ЭтотОбъект.Статус;
	
ИсторияКлиента.Записать(Истина);
	
ИсторияКлиентаДопПожелания = РегистрыСведений.ИсторияКлиентаДопПожелания.СоздатьНаборЗаписей();
//ИсторияКлиентаДопПожелания.Отбор.Клиент.Установить(Клиент);
//ИсторияКлиентаДопПожелания.Отбор.Заявка.Установить(Заявка);
//ИсторияКлиентаДопПожелания.Отбор.ЗаявкаГУИД.Установить(ГУИД);

ИсторияКлиентаДопПожелания.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);
Для Каждого Строка Из ИсторияКлиентаДопПожелания Цикл
	ИсторияКлиентаДопПожелания.Удалить(Строка);
КонецЦикла;

Индекс = 0;
Для Каждого Строка Из ЭтотОбъект.ДопПожелания Цикл
	НоваяЗапись = ИсторияКлиентаДопПожелания.Добавить();
	
	НоваяЗапись.Клиент = Клиент;
	//НоваяЗапись.Заявка = Заявка;
	НоваяЗапись.ЗаявкаГУИД = ЗаявкаГУИД;
	НоваяЗапись.ДопПожеланияИндекс = Строка.НомерСтроки;

	НоваяЗапись.ДатаРегистрации = Строка.ДатаРегистрации;
	НоваяЗапись.РезервС = ЭтотОбъект.РезервС;
	НоваяЗапись.РезервПо = ЭтотОбъект.РезервПо;
	
	НоваяЗапись.ВидИнформации = Строка.ВидИнформации.Наименование;
	НоваяЗапись.Информация = Строка.Информация;
	
	Индекс = Индекс + 1;	
КонецЦикла;

ИсторияКлиентаДопПожелания.Записать(Истина);
КонецПроцедуры	

Процедура УдалитьИсториюКлиента(ЭтотОбъект) Экспорт 
Клиент = ЭтотОбъект.Клиент;	
ЗаявкаГУИД = ЭтотОбъект.Ссылка.УникальныйИдентификатор();	
	
ИсторияКлиента = РегистрыСведений.ИсторияКлиента.СоздатьНаборЗаписей();
//ГУИД = Заявка.УникальныйИдентификатор();

ИсторияКлиента.Отбор.Клиент.Установить(Клиент);
//ИсторияКлиента.Отбор.Заявка.Установить(Заявка);
ИсторияКлиента.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);

ИсторияКлиента.Очистить();
ИсторияКлиента.Записать(Истина);

ИсторияКлиентаДопПожелания = РегистрыСведений.ИсторияКлиентаДопПожелания.СоздатьНаборЗаписей();
//ГУИД = ЭтотОбъект.Ссылка.УникальныйИдентификатор();
ИсторияКлиентаДопПожелания.Отбор.Клиент.Установить(Клиент);
//ИсторияКлиентаДопПожелания.Отбор.Заявка.Установить(Заявка);
ИсторияКлиентаДопПожелания.Отбор.ЗаявкаГУИД.Установить(ЗаявкаГУИД);

ИсторияКлиентаДопПожелания.Очистить();
ИсторияКлиентаДопПожелания.Записать(Истина);
КонецПроцедуры	
//

Функция ПроверкаСоседей(Номер,ДН,ДК) Экспорт
	ЗапросСоседей=Новый Запрос("ВЫБРАТЬ
	                           |	ЗанятостьНомеров.Регистратор
	                           |ИЗ
	                           |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                           |ГДЕ
	                           |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                           |	И ЗанятостьНомеров.Номер В(ВЫБРАТЬ
							   |	НомернойФондСоседи.СоседнийНомер
							   |ИЗ
							   |	Справочник.НомернойФонд.Соседи КАК НомернойФондСоседи
							   |ГДЕ
							   |	НомернойФондСоседи.Ссылка = &Ссылка)");	
	ЗапросСоседей.УстановитьПараметр("Ссылка",Номер);
	ЗапросСоседей.УстановитьПараметр("ДН",ДН);
	ЗапросСоседей.УстановитьПараметр("ДК",ДК);
	
	ТЗС=ЗапросСоседей.Выполнить().Выгрузить();
	
	Если ТЗС.Количество()>0 тогда
		Возврат Истина;
	иначе
		Возврат Ложь;
	конецесли;
	
							   
КонецФункции

// + Добавить СчетаДетальноДолги
Функция ДобавитьСчетаДетальноДолги(СчетаДетальноДолги, ИсходнаяСтрока, Услуга, СчетГУИД
			, РазделитьСчет, ЮрЛицо, ЕстьКлиент2, НеПервый) Экспорт
	
Если Услуга Тогда
	Если НЕ ИсходнаяСтрока.ВСчет Тогда Возврат Неопределено; КонецЕсли;  				
	
	Если РазделитьСчет И ЕстьКлиент2 Тогда 
		Если НЕ (ИсходнаяСтрока.НеПервый = НеПервый) Тогда Возврат Неопределено; КонецЕсли;
	КонецЕсли;
КонецЕсли;

НоваяСтрока = СчетаДетальноДолги.Добавить();
ЗаполнитьСтрокаДолги(НоваяСтрока, ИсходнаяСтрока, СчетГУИД, Услуга);

Если НЕ Услуга Тогда
	УстановитьЦенаСуммаСчетаДетальноДолгиДляРазделитьСчет(НоваяСтрока, РазделитьСчет, ЮрЛицо, ЕстьКлиент2, НеПервый);
КонецЕсли;

Возврат НоваяСтрока; 
КонецФункции

Процедура УстановитьЦенаСуммаСчетаДетальноДолгиДляРазделитьСчет(Строка, РазделитьСчет, ЮрЛицо, ЕстьКлиент2, НеПервый) Экспорт
Если РазделитьСчет Тогда
	//Если НЕ ЮрЛицо Тогда
		Если ЕстьКлиент2 Тогда
			Если НеПервый Тогда 
				Строка.Цена = (Строка.Цена - Строка.Цена / 2 - 0.001); 			
				Строка.СуммаДолг = (Строка.СуммаДолг - Строка.СуммаДолг / 2 - 0.001); 			
				Строка.СуммаКЗакрытию = (Строка.СуммаКЗакрытию - Строка.СуммаКЗакрытию / 2 - 0.001); 			
			Иначе
				Строка.Цена = Строка.Цена / 2 + 0.001;
				Строка.СуммаДолг = Строка.СуммаДолг / 2 + 0.001; 			
				Строка.СуммаКЗакрытию = Строка.СуммаКЗакрытию / 2 + 0.001; 			
			КонецЕсли;	
		КонецЕсли;	
	//КонецЕсли;	
КонецЕсли;
КонецПроцедуры

Процедура УстановитьЦенаСуммаСчетаДетальноДолгиДляРазделитьСчет_1(Строка, РазделитьСчет, ЮрЛицо, ЕстьКлиент2, НеПервый) Экспорт
Если РазделитьСчет Тогда
	Если НЕ ЮрЛицо Тогда
		Если ЕстьКлиент2 Тогда
			Если НеПервый Тогда 
				Строка.Цена = (Строка.Цена - Строка.Цена / 2 - 0.001); 			
				Строка.СуммаДолг = (Строка.СуммаДолг - Строка.СуммаДолг / 2 - 0.001); 			
				Строка.СуммаКЗакрытию = (Строка.СуммаКЗакрытию - Строка.СуммаКЗакрытию / 2 - 0.001); 			
			Иначе
				Строка.Цена = Строка.Цена / 2 + 0.001;
				Строка.СуммаДолг = Строка.СуммаДолг / 2 + 0.001; 			
				Строка.СуммаКЗакрытию = Строка.СуммаКЗакрытию / 2 + 0.001; 			
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецЕсли;
КонецПроцедуры

// - Добавить СчетаДетальноДолги

// + Используется в Модуле объекта Заявка на бронирование
Процедура УстановитьЦенаСуммаДляРазделитьСчет(Строка, РазделитьСчет, ЮрЛицо, ЕстьКлиент2, НеПервый) Экспорт
Если РазделитьСчет Тогда
	//Если НЕ ЮрЛицо Тогда
		Если ЕстьКлиент2 Тогда
			Если НеПервый Тогда 
				Строка.Цена = (Строка.Цена - Строка.Цена / 2 - 0.001); 			
				Строка.Сумма = (Строка.Сумма - Строка.Сумма / 2 - 0.001); 			
			Иначе
				Строка.Цена = Строка.Цена / 2 + 0.001;
				Строка.Сумма = Строка.Сумма / 2 + 0.001; 			
			КонецЕсли;	
		КонецЕсли;	
	//КонецЕсли;	
КонецЕсли;
КонецПроцедуры
// - Используется в Модуле объекта Заявка на бронирование


// + ЗаполнитьСтрокаДолги
Процедура ЗаполнитьСтрокаДолги(Строка, ИсходнаяСтрока, СчетГУИД, Услуга) Экспорт
Строка.СчетГУИД = СчетГУИД;

Строка.Услуга = Услуга;
Строка.ДолгиГУИД = ИсходнаяСтрока.ГУИД;
Строка.Количество = ИсходнаяСтрока.Количество;
Строка.Цена = ИсходнаяСтрока.Цена;

Строка.НаименованиеДолг = НаименованиеДолг(ИсходнаяСтрока, Услуга);
Строка.ДатаДолг = ДатаДолг(ИсходнаяСтрока, Услуга);
Строка.СуммаДолг = СуммаДолг(ИсходнаяСтрока, Услуга);

Строка.СуммаОплачено = 0;
Строка.СуммаКЗакрытию = Строка.СуммаДолг;

Если Услуга Тогда
	Строка.ЕстьНДС = ИсходнаяСтрока.Услуга.ЕстьНДС;
	Строка.НазваниеДляЧека = НазваниеДляЧека(ИсходнаяСтрока, Услуга);
	Строка.ПрограммныйКодУслуги = ИсходнаяСтрока.Услуга.ПрограммныйКод;
КонецЕсли;
КонецПроцедуры

Функция НаименованиеДолг(Строка, Услуга) Экспорт 
Если Услуга Тогда
	НаименованиеДолг = Строка.Услуга.Наименование;   			
Иначе
	НаименованиеДолг = "Проживание";   			
КонецЕсли;

Возврат НаименованиеДолг;
КонецФункции	

Функция НазваниеДляЧека(Строка, Услуга) Экспорт 
Если Услуга Тогда
	НазваниеДляЧека = ?(ЗначениеЗаполнено(Строка.Услуга.НазваниеДляЧека)
			, Строка.Услуга.НазваниеДляЧека, Строка.Услуга.Наименование);   			
Иначе
	НазваниеДляЧека = "";   			
КонецЕсли;

Возврат НазваниеДляЧека;
КонецФункции	

Функция ДатаДолг(Строка, Услуга)
Если Услуга Тогда
	ДатаДолг = Строка.ДатаУслуги;   			
Иначе
	ДатаДолг =Строка.ДеньПроживания;   			
КонецЕсли;

Возврат ДатаДолг;
КонецФункции	

Функция СуммаДолг(Строка, Услуга) Экспорт
Если Услуга Тогда
	СуммаДолг = Строка.Количество * Строка.Цена ;   			
Иначе
	СуммаДолг =Строка.Сумма;   			
КонецЕсли;

Возврат СуммаДолг;
КонецФункции	
// - ЗаполнитьСтрокаДолги
//////



//// + Счета

//
Функция ЕстьОплатыСчета(СчетГУИД, РаспределениеОплатДолги) Экспорт
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
Возврат (НайденныеСтроки.Количество() > 0);  
КонецФункции	
//

// + Дополнить Счет
Функция ДополнительныеСтрокиДетальноДолги(ОтборПроживаниеУслугиВключено, ДокументДолгОбъект, Счет, СчетаДетальноДолги
	, ВызовИзСчетНаоплату) Экспорт
ДополнительныеСтрокиДетальноДолги = ОбщийФункционалСервер.ТаблицаЗначенийИзТабличнаяЧастьДокумента("ЗаявкаНаБронирование", "СчетаДетальноДолги");

СчетГУИД = Счет.СчетГУИД;
Контрагент = Счет.Контрагент;

РазделитьСчет = Счет.РазделитьСчет;
ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Счет.Контрагент);
ЕстьКлиент2 = ЗначениеЗаполнено(ДокументДолгОбъект.Клиент2);
НеПервый = (Счет.Контрагент = ДокументДолгОбъект.Клиент2);

Если (НЕ Счет.ТолькоУслуги) 
ИЛИ ВызовИзСчетНаоплату	
Тогда
	Услуга = Ложь;
	Для Каждого СтрокаИсходная Из ДокументДолгОбъект.Проживание Цикл 
		
		Если ЕстьВСчетаДетальноДолги(СтрокаИсходная.ГУИД, СчетаДетальноДолги) Тогда Продолжить;	КонецЕсли;	 
		Если СтрокаПроживаниеУслугиКонтрагентЕстьВДругомСчете(СтрокаИсходная.ГУИД, ДокументДолгОбъект, Счет.СчетГУИД, Контрагент)
		Тогда Продолжить; КонецЕсли;	 
		
		Если ОтборПроживаниеУслугиВключено Тогда 
			Если СтрокаПроживаниеОтбор(СтрокаИсходная, Счет) Тогда Продолжить; КонецЕсли;	 
		КонецЕсли;	
		
		Если СтрокаИсходная.Сумма = 0 Тогда Продолжить; КонецЕсли; 
			
		ДобавитьСчетаДетальноДолги(ДополнительныеСтрокиДетальноДолги, СтрокаИсходная, Услуга, СчетГУИД
					, РазделитьСчет, ЮрЛицо, ЕстьКлиент2, НеПервый);
	КонецЦикла;	
КонецЕсли;
	
Если (НЕ Счет.ТолькоПроживание) 
ИЛИ ВызовИзСчетНаоплату	
Тогда 
	Услуга = Истина;
	Для Каждого СтрокаИсходная Из ДокументДолгОбъект.ДопУслуги Цикл 
		
		Если ЕстьВСчетаДетальноДолги(СтрокаИсходная.ГУИД, СчетаДетальноДолги) Тогда Продолжить;	КонецЕсли;	 
		Если СтрокаПроживаниеУслугиКонтрагентЕстьВДругомСчете(СтрокаИсходная.ГУИД, ДокументДолгОбъект, Счет.СчетГУИД, Контрагент)
		Тогда Продолжить; КонецЕсли;	 
		
		Если ОтборПроживаниеУслугиВключено Тогда 
			Если СтрокаУслугиОтбор(СтрокаИсходная, Счет) Тогда Продолжить;	КонецЕсли;	 
		КонецЕсли;	
		
		Если СтрокаИсходная.Цена * СтрокаИсходная.Количество = 0 Тогда Продолжить; КонецЕсли; 
		
		ДобавитьСчетаДетальноДолги(ДополнительныеСтрокиДетальноДолги, СтрокаИсходная, Услуга, СчетГУИД
					, РазделитьСчет, ЮрЛицо, ЕстьКлиент2, НеПервый);
	КонецЦикла;	
КонецЕсли;

Возврат ДополнительныеСтрокиДетальноДолги;	
КонецФункции	

Функция ЕстьВСчетаДетальноДолги(ДолгиГУИД, СчетаДетальноДолги)
ОтборСтроки = Новый Структура("ДолгиГУИД", ДолгиГУИД);
НайденныеСтроки = СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
Возврат (НайденныеСтроки.Количество() > 0);  
КонецФункции	

Функция СтрокаПроживаниеУслугиКонтрагентЕстьВДругомСчете(ДолгиГУИД, ДокументДолгОбъект, СчетГУИД, Контрагент) Экспорт
ОтборСтроки = Новый Структура("ДолгиГУИД", ДолгиГУИД);	
НайденыеСтрокиСчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
Для Каждого НайденаяСтрокаСчетаДетальноДолги Из НайденыеСтрокиСчетаДетальноДолги Цикл
	Если НайденаяСтрокаСчетаДетальноДолги.СчетГУИД = СчетГУИД Тогда Продолжить; КонецЕсли;
	
	Если ДокументДолгОбъект.РазделитьСчет И ЗначениеЗаполнено(ДокументДолгОбъект.Клиент2) Тогда
		ОтборСтрокиСчета = Новый Структура("СчетГУИД", НайденаяСтрокаСчетаДетальноДолги.СчетГУИД);
		НайденныеСтрокиСчета = ДокументДолгОбъект.Счета.НайтиСтроки(ОтборСтрокиСчета); 
		Если НайденныеСтрокиСчета.Количество() = 0 Тогда Продолжить; КонецЕсли;   
		
		НайденаяСтрокаСчет =  НайденныеСтрокиСчета[0];
		Если НайденаяСтрокаСчет.Контрагент = Контрагент Тогда Возврат Истина; КонецЕсли;	
		
	Иначе
		Возврат Истина;		
	КонецЕсли;	
КонецЦикла;	

Возврат Ложь;	
КонецФункции

Функция СтрокаПроживаниеОтбор(Строка, Счет)
Если Строка.ДеньПроживания < Счет.ДатаС Тогда Возврат Истина; КонецЕсли;	
Если Строка.ДеньПроживания > Счет.ДатаПо Тогда Возврат Истина; КонецЕсли;	

Возврат Ложь;
КонецФункции	

Функция СтрокаУслугиОтбор(Строка, Счет)
Если Строка.ДатаУслуги < Счет.ДатаС Тогда Возврат Истина; КонецЕсли;	
Если Строка.ДатаУслуги > Счет.ДатаПо Тогда Возврат Истина; КонецЕсли;	

Возврат Ложь;
КонецФункции
// - Дополнить Счет

//
Процедура ОбновитьСчетаСтроки(СчетаДетальноСтроки, Счета, СчетаДетальноДолги, РаспределениеОплатДолги, СчетГУИД) Экспорт
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, СчетаДетальноСтроки); 
	
НайденныеСчета = Счета.НайтиСтроки(ОтборСтроки);	
Если НайденныеСчета.Количество() = 0 Тогда Возврат; КонецЕсли; 
 
Счет = НайденныеСчета[0]; 
СчетаДетальноДолги_П = СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
СчетаДетальноСтроки_П = СчетаДетальноСтроки.Выгрузить(Новый Массив);
КоличествоСуток = ЗаявкаСервер.КоличествоСуток(Счет.ДатаС, Счет.ДатаПо, СчетаДетальноДолги_П);

ЗаявкаСервер.ЗаполнитьСчетаДетальноСтроки(Счет, КоличествоСуток 
	, СчетаДетальноСтроки_П, СчетаДетальноДолги_П, РаспределениеОплатДолги);
	
ОбщийФункционалСервер.ДобавитьСтроки(СчетаДетальноСтроки, СчетаДетальноСтроки_П);
КонецПроцедуры
//

//
Функция СчетЗакрыт(СчетаДетальноДолги, СчетГУИД) Экспорт
ОтборСтроки =Новый Структура("СчетГУИД", СчетГУИД);	
СчетаДетальноДолги_П = СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);	

СчетЗакрыт = СчетЗакрытСчетаДетальноДолги(СчетаДетальноДолги_П); 

Возврат СчетЗакрыт;	
КонецФункции	
 
Функция СчетЗакрытСчетаДетальноДолги(СчетаДетальноДолги) Экспорт
Для Каждого Строка Из СчетаДетальноДолги Цикл
	Если Строка.СуммаКЗакрытию > 0 Тогда Возврат Ложь; КонецЕсли;
КонецЦикла;

Возврат Истина;	
КонецФункции	
//

//
Процедура УдалитьДанныеСчета(СчетГУИД, Объект) Экспорт
ОтборСтрокиГУИД = Новый Структура("СчетГУИД", СчетГУИД);

ДокументыОплаты = Объект.РаспределениеОплатДолги.Выгрузить(ОтборСтрокиГУИД, "ДокументОплаты");
ДокументыОплаты.Свернуть("ДокументОплаты");

Для Каждого Строка Из ДокументыОплаты Цикл
	ДокументОплаты = Строка.ДокументОплаты;
	
	ОтборСтрокиДокументОплаты = Новый Структура("ДокументОплаты", ДокументОплаты);
	НайденныеСтрокиСчетаДетальноОплаты = Объект.СчетаДетальноОплаты.НайтиСтроки(ОтборСтрокиДокументОплаты);
	Если НайденныеСтрокиСчетаДетальноОплаты.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	СтрокаОплаты = НайденныеСтрокиСчетаДетальноОплаты[0];
	
	ОтборСтроки = Новый Структура("ДокументОплаты, СчетГУИД", ДокументОплаты, СчетГУИД);
	ЗаявкаСервер.ОчиститьСтрокаОплатыОтборСтроки(ОтборСтроки, Объект.РаспределениеОплатДолги, СтрокаОплаты); 
	
	ОплатыОбщееСервер.УдалитьДокументОплатыДолгОплатыИДокументОплаты(ДокументОплаты, Объект.Ссылка, СчетГУИД);
	
	Если СтрокаОплаты.СуммаРаспределено = 0 Тогда
		Объект.СчетаДетальноОплаты.Удалить(СтрокаОплаты);        
	КонецЕсли;		
КонецЦикла;

ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтрокиГУИД, Объект.СчетаДетальноДолги);
КонецПроцедуры
//

//
Функция СчетСтруктура(СчетГУИД, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги, РазделитьСчет, СвернутьВСчете, Закрыт
	,  ДатаС, ДатаПо, НомерСчета, ДатаСчета, ГрупповойСчет, ЭтоПредварительныйГрупповойСчет = Ложь) Экспорт
Счет = Новый Структура();

Счет.Вставить("СчетГУИД", СчетГУИД);
Счет.Вставить("Контрагент", Контрагент);
Счет.Вставить("Клиент", Клиент);
Счет.Вставить("НомерСчета", НомерСчета);
Счет.Вставить("ДатаСчета", ДатаСчета);
Счет.Вставить("ТолькоПроживание", ТолькоПроживание);
Счет.Вставить("ТолькоУслуги", ТолькоУслуги);
Счет.Вставить("СвернутьВСчете", СвернутьВСчете);
Счет.Вставить("РазделитьСчет", РазделитьСчет);
Счет.Вставить("ДатаС", ДатаС);
Счет.Вставить("ДатаПо", ДатаПо) ;
Счет.Вставить("Закрыт", Закрыт) ;

Счет.Вставить("ГрупповойСчет", ГрупповойСчет);
Счет.Вставить("ЭтоПредварительныйГрупповойСчет", ЭтоПредварительныйГрупповойСчет);

Возврат Счет;
КонецФункции
//

// + ЗаполнитьНовыйСчетДанные
Функция ЗаполнитьНовыйСчетДанные(Счет, Счета, СчетаДетальноДолги, РаспределениеОплатДолги) Экспорт
Счет.СчетГУИД = Новый УникальныйИдентификатор;
Счет.НомерСчета = СледующийНомерСчета(Счета);

СчетГУИД = Счет.СчетГУИД;

СчетГУИД_Предыдущий = ОбщийФункционалСервер.УникальныйИдентификаторПустой();
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД_Предыдущий); 
НайденыСтроки = СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
Для Каждого НайденаСтрока Из НайденыСтроки Цикл
	НайденаСтрока.СчетГУИД = СчетГУИД;	
КонецЦикла;	

НайденыСтроки = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
Для Каждого НайденаСтрока Из НайденыСтроки Цикл
	НайденаСтрока.СчетГУИД = СчетГУИД;	
КонецЦикла;	

Возврат Счет;
КонецФункции	

Функция СледующийНомерСчета(Счета) 
МаксНомер = 0;
Для Каждого Строка Из Счета Цикл
	МаксНомер = Макс(Строка.НомерСчета, МаксНомер); 	
КонецЦикла;

Возврат МаксНомер + 1; 	
КонецФункции
// - ЗаполнитьНовыйСчетДанные

// + ЗаполнитьСчетаДетальноСтроки
Процедура ЗаполнитьСчетаДетальноСтроки(Счет, КоличествоСуток, СчетаДетальноСтроки, СчетаДетальноДолги, РаспределениеОплатДолги) Экспорт 
СчетГУИД = Счет.СчетГУИД;

//ДатаУчета = Счет.Ссылка.РезервПо;
ДатаУчета = Счет.ДатаПо;
УчитыватьНДС = ДокументыСервер.УчитыватьНДС(ДатаУчета);

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ТекущаяОрганизация.СтавкаНДС; ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчета);

Если Счет.СвернутьВсчете Тогда 
	СуммаИтого = 0;
	СуммаОплаченоИтого = 0;
	СуммаИтогоДляНДС = 0;
	КоличествоИтогоДляНДС = 0;
	СуммаОплаченоИтогоДляНДС = 0;                 
	
	Для Каждого Строка Из СчетаДетальноДолги Цикл
		ОтборСтроки = Новый Структура();
		ОтборСтроки.Вставить("СчетГУИД", Счет.СчетГУИД);
		ОтборСтроки.Вставить("ДолгиГУИД", Строка.ДолгиГУИД);

		Если УчитыватьНДС Тогда
			Если Строка.ЕстьНДС Тогда
				СуммаОплаченоИтогоДляНДС = СуммаОплаченоИтогоДляНДС + ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, РаспределениеОплатДолги);
				
				КоличествоИтогоДляНДС = КоличествоИтогоДляНДС + Строка.Количество;
				СуммаИтогоДляНДС = СуммаИтогоДляНДС + Строка.СуммаДолг;
			Иначе	
				СуммаОплаченоИтого = СуммаОплаченоИтого + ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, РаспределениеОплатДолги);
				СуммаИтого = СуммаИтого + Строка.СуммаДолг;
			КонецЕсли;		
		Иначе
			СуммаОплаченоИтого = СуммаОплаченоИтого + ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, РаспределениеОплатДолги);
			СуммаИтого = СуммаИтого + Строка.СуммаДолг;
		КонецЕсли;		
	КонецЦикла;	
	
	Если СуммаИтого <> 0 Тогда
		НоваяСтрока = СчетаДетальноСтроки.Добавить();
		НоваяСтрока.СчетГУИД = СчетГУИД;
		
		НоваяСтрока.НаименованиеДляСчета = "Проживание с " + Формат(Счет.ДатаС,"ДФ=dd.MM.yy") 
			+ " по " + Формат(Счет.ДатаПо,"ДФ=dd.MM.yy");
		НоваяСтрока.ЕдиницаИзмерения = "сутки";
			
		НоваяСтрока.Сумма = СуммаИтого;
		НоваяСтрока.Количество = КоличествоСуток;
		НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / НоваяСтрока.Количество);
		
		НоваяСтрока.СуммаОплачено = СуммаОплаченоИтого;
	КонецЕсли;
	
	Если СуммаИтогоДляНДС <> 0 Тогда
		НоваяСтрока = СчетаДетальноСтроки.Добавить();
		НоваяСтрока.СчетГУИД = СчетГУИД;
		
		НоваяСтрока.НаименованиеДляСчета = "Услуги с НДС " + СтавкаНДС + " с " + Формат(Счет.ДатаС,"ДФ=dd.MM.yy") 
			+ " по " + Формат(Счет.ДатаПо,"ДФ=dd.MM.yy");
	
		НоваяСтрока.ЕдиницаИзмерения = "шт.";
			
		НоваяСтрока.Сумма = СуммаИтогоДляНДС;
		НоваяСтрока.Количество = КоличествоИтогоДляНДС;
		НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / НоваяСтрока.Количество);
		
		НоваяСтрока.СуммаОплачено = СуммаОплаченоИтогоДляНДС;
		НоваяСтрока.ЕстьНДС = Истина;
	КонецЕсли;
Иначе
	Для Каждого Строка Из СчетаДетальноДолги Цикл
		НоваяСтрока = СчетаДетальноСтроки.Добавить();
		НоваяСтрока.СчетГУИД = СчетГУИД;
		
		НоваяСтрока.ДатаСтрока = Строка.ДатаДолг;
		НоваяСтрока.Услуга = Строка.Услуга;
		
		НоваяСтрока.НаименованиеДляСчета = Строка.НаименованиеДолг;
		НоваяСтрока.НазваниеДляЧека = Строка.НазваниеДляЧека;
		Если Строка.Услуга Тогда
			НоваяСтрока.ЕдиницаИзмерения = "шт.";
		Иначе	
			НоваяСтрока.ЕдиницаИзмерения = "сутки";
		КонецЕсли;
		
		НоваяСтрока.Сумма = Строка.СуммаДолг;
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / НоваяСтрока.Количество);
		
		ОтборСтроки = Новый Структура();
		ОтборСтроки.Вставить("СчетГУИД", Счет.СчетГУИД);
		ОтборСтроки.Вставить("ДолгиГУИД", Строка.ДолгиГУИД);
		НоваяСтрока.СуммаОплачено = ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, РаспределениеОплатДолги);
		
		НоваяСтрока.ЕстьНДС = Строка.ЕстьНДС;
	КонецЦикла;	
КонецЕсли;	
КонецПроцедуры

Функция КоличествоСуток(ДатаС, ДатаПо, СчетаДолгиДетально) Экспорт
КоличествоСуток = 0;	
Для Каждого Строка Из СчетаДолгиДетально Цикл
	Если Строка.Услуга Тогда Продолжить; КонецЕсли; 	
	Если Строка.ДатаДолг < ДатаС Тогда Продолжить; КонецЕсли; 	
	Если Строка.ДатаДолг > ДатаПо Тогда Продолжить; КонецЕсли; 	
	
	КоличествоСуток = КоличествоСуток + Строка.Количество; 
КонецЦикла;

// Только Услуги
Если КоличествоСуток = 0 Тогда 
	КоличествоСуток = (НачалоДня(ДатаПо) - НачалоДня(ДатаС)) / (60 * 60 * 24);
	
	Если КоличествоСуток = 0 Тогда КоличествоСуток = 1; КонецЕсли;
КонецЕсли;

Возврат КоличествоСуток;	
КонецФункции	

Процедура ДатаСДатаПо(ДатаС, ДатаПо, СчетаДетальноДолги) Экспорт
ДатаС_П = '30010101';
ДатаПо_П = '00010101';

НетСтрок = Истина;
Для Каждого Строка Из СчетаДетальноДолги Цикл
	Если Строка.Услуга Тогда Продолжить; КонецЕсли;
	
	ДатаС_П = Мин(Строка.ДатаДолг ,ДатаС_П);
	ДатаПо_П = Макс(Строка.ДатаДолг ,ДатаПо_П);
	
	НетСтрок = Ложь;
КонецЦикла;

Если НетСтрок Тогда Возврат; КонецЕсли;

Если ДатаС <> ДатаПо Тогда
	ДатаПо_П = ДатаПо_П + 86400;
КонецЕсли;

ДатаС = ДатаС_П;
ДатаПо = ДатаПо_П;
КонецПроцедуры	

Процедура ДатыСПоКоличество(ДатаМин, ДатаМакс, КоличествоСуток, СчетаДетальноДолги) Экспорт
ДатаМин_П = '30010101';
ДатаМакс_П = '00010101';

КоличествоСуток = 0;	
Для Каждого Строка Из СчетаДетальноДолги Цикл
	Если Строка.Услуга Тогда Продолжить; КонецЕсли;
	
	ДатаМин_П = Мин(Строка.ДатаДолг ,ДатаМин_П);
	ДатаМакс_П = Макс(Строка.ДатаДолг ,ДатаМакс_П);
		
	КоличествоСуток = КоличествоСуток + Строка.Количество; 
КонецЦикла;

Если КоличествоСуток = 0 Тогда 
	КоличествоСуток = (НачалоДня(ДатаМакс) - НачалоДня(ДатаМин)) / (60 * 60 * 24);
	
	Если КоличествоСуток = 0 Тогда КоличествоСуток = 1; КонецЕсли;
	
	Возврат; 
КонецЕсли;

Если ДатаМин <> ДатаМакс Тогда
	ДатаМакс_П = ДатаМакс_П + 86400;
КонецЕсли;
	
ДатаМин = ДатаМин_П;
ДатаМакс = ДатаМакс_П;
КонецПроцедуры	
// - ЗаполнитьСчетаДетальноСтроки
//// - Счета


//// + Оплата

Процедура РаспределитьСтрокаОплатыСчетаДетальноДолги(СтрокаОплаты, ОстатокКРаспределению, ДокументДолгОбъект, Услуга) Экспорт 
ОтборСтроки = Новый Структура("Услуга, ГрупповойСчет", Услуга, Ложь); 

СчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(СтрокаОплаты
	, ОстатокКРаспределению, СчетаДетальноДолги, ДокументДолгОбъект.РаспределениеОплатДолги);  

СчетаСчетГУИД = ДокументДолгОбъект.СчетаДетальноДолги.Выгрузить(ОтборСтроки, "СчетГУИД");	
СчетаСчетГУИД.Свернуть("СчетГУИД");

Для Каждого Строка Из СчетаСчетГУИД Цикл
	ОтборСтроки = Новый Структура("ДокументОплаты, СчетГУИД", СтрокаОплаты.ДокументОплаты, Строка.СчетГУИД);
	СуммаОплаты = ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, ДокументДолгОбъект.РаспределениеОплатДолги);

	Если СуммаОплаты <> 0 Тогда
		ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(СтрокаОплаты.ДокументОплаты, ДокументДолгОбъект.Ссылка, Строка.СчетГУИД
			, СуммаОплаты, Истина);   
	КонецЕсли;
КонецЦикла;
КонецПроцедуры

// Убрать из вызова СуммаОплаты
Функция ДобавитьОплатаСчетаДетальноОплаты(СчетаДетальноОплаты, ДокументОплаты, ГрупповаяОплата) Экспорт
ОтборСтроки = Новый Структура("ДокументОплаты, ГрупповаяОплата", ДокументОплаты, ГрупповаяОплата);	
НайденныеСтроки = СчетаДетальноОплаты.НайтиСтроки(ОтборСтроки);

Если НайденныеСтроки.Количество() = 0 Тогда 
	СтрокаОплаты = СчетаДетальноОплаты.Добавить();	

	СтрокаОплаты.ГрупповаяОплата = ГрупповаяОплата; 
	СтрокаОплаты.ДокументОплаты = ДокументОплаты; 
	СтрокаОплаты.ДатаДокумента = ДокументОплаты.Дата; 
	СтрокаОплаты.ДатаОплаты = ДокументОплаты.ДатаОплаты; 

Иначе
	СтрокаОплаты = НайденныеСтроки[0];
КонецЕсли;

Возврат СтрокаОплаты;
КонецФункции
//


//
Функция МассивОплатКонтрагента(Контрагент, СчетаДетальноОплаты) Экспорт
МассивОплатКонтрагента = Новый Массив;
Для Каждого Строка Из СчетаДетальноОплаты Цикл
	Если Строка.ДокументОплаты.ОтКого <> Контрагент Тогда Продолжить; КонецЕсли;
	
	МассивОплатКонтрагента.Добавить(Строка);
КонецЦикла;

Возврат МассивОплатКонтрагента;
КонецФункции

Функция МассивОплатСчета(СчетГУИД, ДанныеОбъект) Экспорт
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);	
ТаблицаДокументыОплаты = ДанныеОбъект.РаспределениеОплатДолги.Выгрузить(ОтборСтроки,"ДокументОплаты");
ТаблицаДокументыОплаты.Свернуть("ДокументОплаты");

МассивОплатСчета = Новый Массив;
Для Каждого Строка Из ТаблицаДокументыОплаты Цикл
	ОтборСтрокиДокументОплаты = Новый Структура("ДокументОплаты", Строка.ДокументОплаты);
	НайденныеСтроки = ДанныеОбъект.СчетаДетальноОплаты.НайтиСтроки(ОтборСтрокиДокументОплаты);
	Если НайденныеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивОплатСчета.Добавить(НайденнаяСтрока);
	КонецЦикла;
КонецЦикла;

Возврат МассивОплатСчета;
КонецФункции
//

//
Функция СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, РаспределениеОплатДолги) Экспорт 
НайденныеСтроки = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);

СуммаОплаты = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	СуммаОплаты = СуммаОплаты + Строка.СуммаОплаты; 		
КонецЦикла;

Возврат СуммаОплаты;
КонецФункции
//

//
Процедура ДобавитьДокументОплатаЗаявкаНаБронирование(ДокументОплаты, ДокументДолгОбъектДанныеСсылка, Счет
	, ЭтоЧекНаАванс, ЭтоАванс) Экспорт  
	
	НачатьТранзакцию();
	
	ДокументДолгОбъект = ДокументДолгОбъектДанныеСсылка.ПолучитьОбъект();
	
	СчетаДетальноОплаты = ДокументДолгОбъект.СчетаДетальноОплаты;
	
	НоваяОплата = СчетаДетальноОплаты.Добавить();
	НоваяОплата.ДокументОплаты = ДокументОплаты;
	
	НоваяОплата.ДатаДокумента = ДокументОплаты.Дата;
	
	НоваяОплата.ДатаОплаты = ТекущаяДата();

	НоваяОплата.Аванс = ЭтоАванс;
	
	СуммаДокументОплаты = ДокументОплаты.Сумма;
	РаспределениеОплатДолги = ДокументДолгОбъект.РаспределениеОплатДолги;
	Счета = ДокументДолгОбъект.Счета; 
	СчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги;  
	Если ЭтоЧекНаАванс Тогда
		ЗаявкаОбщееКлиентСервер.РаспределитьСтрокаОплатаНаСчета(НоваяОплата, СуммаДокументОплаты
			, Счета, СчетаДетальноДолги, РаспределениеОплатДолги);  
	Иначе
		СчетГУИД = Счет.СчетГУИД;
		ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
		СчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);	
		ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(НоваяОплата
			, СуммаДокументОплаты, СчетаДетальноДолги, РаспределениеОплатДолги);
		
		Счет.Закрыт = ЗаявкаСервер.СчетЗакрыт(ДокументДолгОбъект.СчетаДетальноДолги, СчетГУИД);	
	КонецЕсли;
	
	ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ОплатыОбщееСервер.ЗаполнитьДокументОплатыДолгОплатаДляЗаявкаНаБронирование(ДокументОплаты
		, РаспределениеОплатДолги, ДокументДолгОбъектДанныеСсылка);	
		
	ЗафиксироватьТранзакцию();	
Конецпроцедуры
//

//
Процедура ОбновитьСчетаСтрокаОплаты(СтрокаОплаты, ТекущийОбъект) Экспорт
СтрокаОплатыШаблон = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("ЗаявкаНаБронирование", "СчетаДетальноОплаты");

ДокументОплаты = СтрокаОплаты.ДокументОплаты;	
ЗаполнитьЗначенияСвойств(СтрокаОплатыШаблон, СтрокаОплаты); 

Контрагент = ДокументОплаты.ОтКого;

ОтборСтроки = Новый Структура("Контрагент", Контрагент);
МассивСчета = ТекущийОбъект.Счета.НайтиСтроки(ОтборСтроки);

ОплатаОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(ДокументОплаты, ТекущийОбъект); 
Если ОплатаОстатокКРаспределению <= 0 Тогда Возврат; КонецЕсли;

РаспределениеОплатДолги = ТекущийОбъект.РаспределениеОплатДолги;

Для Каждого Счет Из МассивСчета Цикл
	Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;
	Если Счет.ЭтоПредварительныйГрупповойСчет Тогда Продолжить; КонецЕсли;
	
	СчетГУИД = Счет.СчетГУИД;

	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
	СчетаДетальноДолги = ТекущийОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки); 

	СуммаКЗакрытию = 0;
	Для Каждого Строка из СчетаДетальноДолги Цикл
		СуммаКЗакрытию = СуммаКЗакрытию + Строка.СуммаКЗакрытию;
	КонецЦикла;
	
	Если СуммаКЗакрытию = 0 Тогда Продолжить; КонецЕсли;
	
	Если ОплатаОстатокКРаспределению > СуммаКЗакрытию Тогда 
		СуммаОплаты = СуммаКЗакрытию;
	Иначе
		СуммаОплаты = ОплатаОстатокКРаспределению;
	КонецЕсли;
	СуммаОплаты_П = СуммаОплаты;

	СтрокаОплатыШаблон.СуммаРаспределено = 0; 
	ЗаявкаСервер.РаспределитьСтрокаОплатаСчетаДетальноДолги(СтрокаОплатыШаблон, СуммаОплаты, СчетаДетальноДолги, РаспределениеОплатДолги);
	
	ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ТекущийОбъект.Ссылка, СчетГУИД
		, СуммаОплаты_П, Истина);
	
	ОплатаОстатокКРаспределению = ОплатаОстатокКРаспределению - СтрокаОплатыШаблон.СуммаРаспределено;	
	СтрокаОплаты.СуммаРаспределено = СтрокаОплаты.СуммаРаспределено + СтрокаОплатыШаблон.СуммаРаспределено;	
	Если ОплатаОстатокКРаспределению = 0 Тогда Прервать; КонецЕсли;	
КонецЦикла;
КонецПроцедуры
//

//
Процедура УдалитьСтрокаОплатыНаСервере(СтрокаОплаты, Объект) Экспорт
	
ДокументОплаты = СтрокаОплаты.ДокументОплаты; 	

// + Удаление оплаты 
УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты, Объект.Ссылка);
УдалитьДокументОплатыДокументДолгДокументОплаты(ДокументОплаты);

ЗаявкаСервер.ОчиститьСчетаДетальноДолгиДокументОплаты(ДокументОплаты
	, Объект.РаспределениеОплатДолги, Объект.СчетаДетальноДолги); 	
	
Объект.СчетаДетальноОплаты.Удалить(СтрокаОплаты);
// - Удаление оплаты 

// + Перераспределение остатков оплат 
МассивОплатКонтрагента = ЗаявкаСервер.МассивОплатКонтрагента(ДокументОплаты.ОтКого, Объект.СчетаДетальноОплаты); 

Для Каждого СтрокаОплаты Из МассивОплатКонтрагента Цикл
	ДокументОплаты_П = СтрокаОплаты.ДокументОплаты;
	
	ОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(ДокументОплаты_П, Объект);
	Если ОстатокКРаспределению = 0 Тогда Продолжить; КонецЕсли; 
			
	Для Каждого Счет Из Объект.Счета Цикл
		Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;
		Если Счет.ЭтоПредварительныйГрупповойСчет Тогда Продолжить; КонецЕсли;
		
		ЗаявкаСервер.РаспределитьСтрокаОплатыНаСчет(СтрокаОплаты, ОстатокКРаспределению, Счет.СчетГУИД, Объект);
	
		Если ОстатокКРаспределению = 0 Тогда Прервать; КонецЕсли; 
	КонецЦикла;		
КонецЦикла;		
// - Перераспределение остатков оплат
КонецПроцедуры

Процедура УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты, ДокументДолг) Экспорт
ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();	
Если ДокументОплатыОбъект = Неопределено Тогда Возврат; КонецЕсли; 

ОтборСтроки = Новый Структура("ДокументДолг", ДокументДолг); 
НайденныеСроки = ДокументОплатыОбъект.ДолгиОплата.НайтиСтроки(ОтборСтроки);

ОбщийФункционалСервер.УдалитьСтроки(ДокументОплатыОбъект.ДолгиОплата, НайденныеСроки);

ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

Процедура УдалитьДокументОплатыДокументДолгДокументОплаты(ДокументОплаты) Экспорт

Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
	ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();	
	
	Если ДокументОплатыОбъект.ДолгиОплата.Количество() = 0 Тогда
		ДокументОплатыОбъект.Удалить();
	КонецЕсли;
	
ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда 
	
	Если ДокументОплаты.ЭтоЭквайринг Тогда
		ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
		
		Если ДокументОплатыОбъект.ДолгиОплата.Количество() = 0 Тогда
			ДокументОплатыОбъект.Удалить();
		КонецЕсли;
	КонецЕсли;		
КонецЕсли;	

КонецПроцедуры
//

//
Процедура УдалитьДокументОплаты(ДокументОплаты, ДокументОбъект) Экспорт 
СчетаДетальноДолги = ДокументОбъект.СчетаДетальноДолги;
РаспределениеОплатДолги = ДокументОбъект.РаспределениеОплатДолги;
СчетаДетальноОплаты =  ДокументОбъект.СчетаДетальноОплаты;

ЗаявкаСервер.ОчиститьСчетаДетальноДолгиДокументОплаты(ДокументОплаты, РаспределениеОплатДолги, СчетаДетальноДолги);

ОборСтрокиДокументОплаты = Новый Структура("ДокументОплаты", ДокументОплаты); 
НайденныеСтрокиСчетаДетальноОплаты = СчетаДетальноОплаты.НайтиСтроки(ОборСтрокиДокументОплаты);	
ОбщийФункционалСервер.УдалитьСтроки(СчетаДетальноОплаты, НайденныеСтрокиСчетаДетальноОплаты); 
Конецпроцедуры
//

//
Функция УменьшитьОплатыЗаявкаСуммаВозврата(ДокументОплаты, ДокументДолг, СуммаВозврата, ДокументВозврата) Экспорт
ДокументДолгОбъект = ДокументДолг.ПолучитьОбъект();
Если ДокументДолгОбъект = Неопределено Тогда Возврат 0; КонецЕсли;

СчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги; 

ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);
РаспределениеОплатДолги = ДокументДолгОбъект.РаспределениеОплатДолги;
СчетаДокументаОплаты = РаспределениеОплатДолги.Выгрузить(ОтборСтроки, "СчетГУИД");
СчетаДокументаОплаты.Свернуть( "СчетГУИД");

СчетаДетальноОплаты = ДокументДолгОбъект.СчетаДетальноОплаты;
НайденныеСтроки = СчетаДетальноОплаты.НайтиСтроки(ОтборСтроки);
СтрокаСчетаДетальноОплаты = НайденныеСтроки[0];
ОстатокКРаспределению = СтрокаСчетаДетальноОплаты.СуммаРаспределено - СуммаВозврата;

Если ОстатокКРаспределению >= 0 Тогда
	ОстатокКРаспределению_П = ОстатокКРаспределению;
	
	ОстатокСуммаВозврата = 0;
Иначе	
	ОстатокКРаспределению_П = 0;
	
	// + Аудит
	//	ОстатокСуммаВозврата = - ОстатокКРаспределению_П;
	ОстатокСуммаВозврата = - ОстатокКРаспределению;
	// - Аудит
КонецЕсли;

НачатьТранзакцию();

Для Каждого Счет Из СчетаДокументаОплаты Цикл
	ОплатыОбщееСервер.УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты, ДокументДолг, Счет.СчетГУИД);
КонецЦикла;

//ЗаявкаСервер.УдалитьДокументОплаты(ДокументОплаты, ДокументДолгОбъект); 
СчетаДетальноОплаты.Удалить(СтрокаСчетаДетальноОплаты);

Если ОстатокКРаспределению_П > 0 Тогда 
	СтрокаОплаты = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(СчетаДетальноОплаты
		, ДокументОплаты, Ложь);
		
	СуммаВозврата_П = СуммаВозврата;
	Для Каждого Счет Из СчетаДокументаОплаты Цикл
		//СуммаРаспределениеОплатДолги = СуммаРаспределениеОплатДолги(ДокументДолгОбъект, Счет.СчетГУИД);
		ОчиститьСчетРаспределениеОплатДетальноДолги(РаспределениеОплатДолги, СчетаДетальноДолги, Счет.СчетГУИД);
		
		Если ОстатокКРаспределению_П = 0 Тогда 
			
			//СуммаВозврата_П = СуммаРаспределениеОплатДолги; 
			//ДобавитьИсторияВозвратов(ДокументДолг, Счет.СчетГУИД, СуммаВозврата_П, ДокументВозврата);
			
		Иначе
			ЗаявкаСервер.РаспределитьСтрокаОплатыНаСчет(СтрокаОплаты, ОстатокКРаспределению_П, Счет.СчетГУИД, ДокументДолгОбъект);  	
			
			//СуммаВозврата_П = СуммаВозврата_П - ОстатокКРаспределению_П; 
			//ДобавитьИсторияВозвратов(ДокументДолг, Счет.СчетГУИД, СуммаВозврата_П, ДокументВозврата);
		
		КонецЕсли;
	КонецЦикла;
Иначе
	Для Каждого Счет Из СчетаДокументаОплаты Цикл

		//СуммаРаспределениеОплатДолги = СуммаРаспределениеОплатДолги(ДокументДолгОбъект, Счет.СчетГУИД);
		//СуммаВозврата_П = СуммаРаспределениеОплатДолги; 
		//ДобавитьИсторияВозвратов(ДокументДолг, Счет.СчетГУИД, СуммаВозврата_П, ДокументВозврата);
		
		ОчиститьСчетРаспределениеОплатДетальноДолги(РаспределениеОплатДолги, СчетаДетальноДолги, Счет.СчетГУИД);
	КонецЦикла;
КонецЕсли;

ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);

ЗафиксироватьТранзакцию();

Возврат ОстатокСуммаВозврата;
КонецФункции	

Функция УменьшитьОплатыЗаявкаСуммаВозврата_1(ДокументОплаты, ДокументДолг, СуммаВозврата, ДокументВозврата) Экспорт
ДокументДолгОбъект = ДокументДолг.ПолучитьОбъект();
Если ДокументДолгОбъект = Неопределено Тогда Возврат 0; КонецЕсли;

СчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги; 

ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);
РаспределениеОплатДолги = ДокументДолгОбъект.РаспределениеОплатДолги;
СчетаДокументаОплаты = РаспределениеОплатДолги.Выгрузить(ОтборСтроки, "СчетГУИД");
СчетаДокументаОплаты.Свернуть( "СчетГУИД");

СчетаДетальноОплаты = ДокументДолгОбъект.СчетаДетальноОплаты;
НайденныеСтроки = СчетаДетальноОплаты.НайтиСтроки(ОтборСтроки);
СтрокаСчетаДетальноОплаты = НайденныеСтроки[0];
ОстатокКРаспределению = СтрокаСчетаДетальноОплаты.СуммаРаспределено - СуммаВозврата;

Если ОстатокКРаспределению >= 0 Тогда
	ОстатокКРаспределению_П = ОстатокКРаспределению;
	
	ОстатокСуммаВозврата = 0;
Иначе	
	ОстатокКРаспределению_П = 0;
	
	ОстатокСуммаВозврата = - ОстатокКРаспределению_П;
КонецЕсли;

НачатьТранзакцию();

Для Каждого Счет Из СчетаДокументаОплаты Цикл
	ОплатыОбщееСервер.УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты, ДокументДолг, Счет.СчетГУИД);
КонецЦикла;

//ЗаявкаСервер.УдалитьДокументОплаты(ДокументОплаты, ДокументДолгОбъект); 
СчетаДетальноОплаты.Удалить(СтрокаСчетаДетальноОплаты);

Если ОстатокКРаспределению_П > 0 Тогда 
	СтрокаОплаты = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(СчетаДетальноОплаты
		, ДокументОплаты, Ложь);
		
	СуммаВозврата_П = СуммаВозврата;
	Для Каждого Счет Из СчетаДокументаОплаты Цикл
		//СуммаРаспределениеОплатДолги = СуммаРаспределениеОплатДолги(ДокументДолгОбъект, Счет.СчетГУИД);
		ОчиститьСчетРаспределениеОплатДетальноДолги(РаспределениеОплатДолги, СчетаДетальноДолги, Счет.СчетГУИД);
		
		Если ОстатокКРаспределению_П = 0 Тогда 
			
			//СуммаВозврата_П = СуммаРаспределениеОплатДолги; 
			//ДобавитьИсторияВозвратов(ДокументДолг, Счет.СчетГУИД, СуммаВозврата_П, ДокументВозврата);
			
		Иначе
			ЗаявкаСервер.РаспределитьСтрокаОплатыНаСчет(СтрокаОплаты, ОстатокКРаспределению_П, Счет.СчетГУИД, ДокументДолгОбъект);  	
			
			//СуммаВозврата_П = СуммаВозврата_П - ОстатокКРаспределению_П; 
			//ДобавитьИсторияВозвратов(ДокументДолг, Счет.СчетГУИД, СуммаВозврата_П, ДокументВозврата);
		
		КонецЕсли;
	КонецЦикла;
Иначе
	Для Каждого Счет Из СчетаДокументаОплаты Цикл

		//СуммаРаспределениеОплатДолги = СуммаРаспределениеОплатДолги(ДокументДолгОбъект, Счет.СчетГУИД);
		//СуммаВозврата_П = СуммаРаспределениеОплатДолги; 
		//ДобавитьИсторияВозвратов(ДокументДолг, Счет.СчетГУИД, СуммаВозврата_П, ДокументВозврата);
		
		ОчиститьСчетРаспределениеОплатДетальноДолги(РаспределениеОплатДолги, СчетаДетальноДолги, Счет.СчетГУИД);
	КонецЦикла;
КонецЕсли;

ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);

ЗафиксироватьТранзакцию();

Возврат ОстатокСуммаВозврата;
КонецФункции	

Процедура ДобавитьИсторияВозвратов_НеИспользуется(ДокументДолг, СчетГУИД, СуммаВозврата, ДокументВозврата)
МенеджерЗаписей = РегистрыСведений.ИсторияВозвратов_КУдалению.СоздатьМенеджерЗаписи();

МенеджерЗаписей.ДатаВозврата = ДокументВозврата.ДатаОплаты;
МенеджерЗаписей.ДокументДолг = ДокументДолг;
МенеджерЗаписей.СчетГУИД = СчетГУИД;
МенеджерЗаписей.ДокументВозврата = ДокументВозврата;
МенеджерЗаписей.Прочитать();

Если МенеджерЗаписей.Выбран() Тогда
	МенеджерЗаписей.СуммаВозврата = МенеджерЗаписей.СуммаВозврата + СуммаВозврата;
Иначе
	МенеджерЗаписей.СуммаВозврата = СуммаВозврата;
КонецЕсли;

МенеджерЗаписей.Записать();
КонецПроцедуры

Функция СуммаРаспределениеОплатДолги(ДокументДолгОбъект, СчетГУИД)
РаспределениеОплатДолги = ДокументДолгОбъект.РаспределениеОплатДолги;
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
ТЗ = РаспределениеОплатДолги.Выгрузить(ОтборСтроки, "СуммаОплаты");
СуммаРаспределениеОплатДолги = ТЗ.Итог("СуммаОплаты"); 
	
Возврат СуммаРаспределениеОплатДолги;
КонецФункции
	
Процедура ОчиститьСчетРаспределениеОплатДетальноДолги(РаспределениеОплатДолги, СчетаДетальноДолги, СчетГУИД)
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтрокиРаспределениеОплат = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);

Для Каждого НайденнаяСтрокаРаспределениеОплат Из НайденныеСтрокиРаспределениеОплат Цикл
	ОтборСтрокиСчетаДетальноДолги = Новый Структура("ДолгиГУИД, СчетГУИД"
		, НайденнаяСтрокаРаспределениеОплат.ДолгиГУИД, НайденнаяСтрокаРаспределениеОплат.СчетГУИД);
	
	НайденныеСтроки = СчетаДетальноДолги.НайтиСтроки(ОтборСтрокиСчетаДетальноДолги);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НайденнаяСтрока.СуммаОплачено = НайденнаяСтрока.СуммаОплачено - НайденнаяСтрокаРаспределениеОплат.СуммаОплаты;
		НайденнаяСтрока.СуммаКЗакрытию = НайденнаяСтрока.СуммаКЗакрытию + НайденнаяСтрокаРаспределениеОплат.СуммаОплаты;
	КонецЦикла;	
КонецЦикла;

ОбщийФункционалСервер.УдалитьСтроки(РаспределениеОплатДолги, НайденныеСтрокиРаспределениеОплат);
КонецПроцедуры
//

//
Процедура РаспределитьСтрокаОплатыНаСчет(СтрокаОплаты, ОстатокКРаспределению, СчетГУИД, Объект) Экспорт
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД); 
СчетаДетальноДолги = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
ЗаявкаОбщееКлиентСервер.РаспределитьОплатаНаСчетаДетальноДолги(СтрокаОплаты
	, ОстатокКРаспределению, СчетаДетальноДолги, Объект.РаспределениеОплатДолги);  

ОтборСтроки = Новый Структура("ДокументОплаты, СчетГУИД", СтрокаОплаты.ДокументОплаты, СчетГУИД);
СуммаОплаты = ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, Объект.РаспределениеОплатДолги);

ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(СтрокаОплаты.ДокументОплаты, Объект.Ссылка, СчетГУИД, СуммаОплаты, Истина);   
КонецПроцедуры
//


//
Процедура РаспределитьОплатыНаСчетПоСчетГУИД_НеИспользуется(СчетГУИД, Объект) Экспорт
МассивОплатСчета = ЗаявкаСервер.МассивОплатСчета(СчетГУИД, Объект);

ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

РаспределитьСчетаДетальноОплатыСчетаДетальноДолги(НайденныеСтроки, МассивОплатСчета, Объект.РаспределениеОплатДолги, Объект);
КонецПроцедуры

Процедура РаспределитьОплатыНаСчетПоСчетГУИДКонтрагент_НеИспользуется(СчетГУИД, Контрагент, Объект) Экспорт
МассивОплатКонтрагента = ЗаявкаСервер.МассивОплатКонтрагента(Контрагент, Объект.СчетаДетальноОплаты);

ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

РаспределитьСчетаДетальноОплатыСчетаДетальноДолги(НайденныеСтроки, МассивОплатКонтрагента
	, Объект.РаспределениеОплатДолги, Объект);
КонецПроцедуры
//

//
Функция РаспределитьСчетаДетальноОплатыСчетаДетальноДолги(СчетаДетальноДолги, СчетаДетальноОплаты
	, РаспределениеОплатДолги, Объект) Экспорт

Для Каждого ОплатыСтрока Из СчетаДетальноОплаты Цикл
	ОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(ОплатыСтрока.ДокументОплаты, Объект);	
		
	Если ОстатокКРаспределению = 0 Тогда Продолжить; КонецЕсли;

	ЗаявкаСервер.РаспределитьСтрокаОплатаСчетаДетальноДолги(ОплатыСтрока
		, ОстатокКРаспределению, СчетаДетальноДолги, РаспределениеОплатДолги);
КонецЦикла;
КонецФункции

Функция РаспределитьСчетаДетальноОплатыДолгСтрока(ДолгСтрока, РаспределениеОплатДолги, СчетаДетальноОплаты, ДокументДолгОбъект) Экспорт
Для Каждого ОплатыСтрока Из СчетаДетальноОплаты Цикл
	ОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(ОплатыСтрока.ДокументОплаты, ДокументДолгОбъект);
	Если ОстатокКРаспределению = 0 Тогда Продолжить; КонецЕсли;
	
	Ответ = ЗаявкаОбщееКлиентСервер.РаспределитьОплатаСтрокаДолгСтрока(ОплатыСтрока, ОстатокКРаспределению, ДолгСтрока, РаспределениеОплатДолги);
	
	Если ДолгСтрока.СуммаКЗакрытию = 0 Тогда Прервать; КонецЕсли
КонецЦикла;
КонецФункции

Функция РаспределитьСтрокаОплатаСчетаДетальноДолги(ОплатыСтрока, ОстатокКРаспределению, СчетаДетальноДолги, РаспределениеОплатДолги) Экспорт
Если ОстатокКРаспределению = 0 Тогда Возврат Неопределено; КонецЕсли;
	
Для Каждого ДолгиСтрока Из СчетаДетальноДолги Цикл
	Ответ = ЗаявкаОбщееКлиентСервер.РаспределитьОплатаСтрокаДолгСтрока(ОплатыСтрока, ОстатокКРаспределению, ДолгиСтрока, РаспределениеОплатДолги);
	
	Если ОстатокКРаспределению = 0 Тогда Прервать; КонецЕсли;
КонецЦикла;
КонецФункции
//

// 
Функция ОчиститьСтрокаОплатыОтборСтроки(ОтборСтроки, РаспределениеОплатДолги, СтрокаОплаты) Экспорт
НайденыеСтрокиРаспределениеОплатДолги = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);

Для Каждого НайденаяСтрокаРаспределениеОплатДолги Из НайденыеСтрокиРаспределениеОплатДолги Цикл
	СтрокаОплаты.СуммаРаспределено = СтрокаОплаты.СуммаРаспределено 
		- НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
КонецЦикла;

ОбщийФункционалСервер.УдалитьСтроки(РаспределениеОплатДолги, НайденыеСтрокиРаспределениеОплатДолги);
КонецФункции	

Функция ОчиститьСчетаДетальноОплатыОтборСтроки(ОтборСтроки, РаспределениеОплатДолги, СчетаДетальноОплаты) Экспорт
НайденыеСтрокиРаспределениеОплатДолги = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
Для Каждого НайденаяСтрокаРаспределениеОплатДолги Из НайденыеСтрокиРаспределениеОплатДолги Цикл
	
	ОтборСтрокиСчетаДетальноОплаты = Новый Структура("ДокументОплаты", НайденаяСтрокаРаспределениеОплатДолги.ДокументОплаты);
	НайденыеСтрокиСчетаДетальноОплаты = СчетаДетальноОплаты.НайтиСтроки(ОтборСтрокиСчетаДетальноОплаты);
	
	Если НайденыеСтрокиСчетаДетальноОплаты.Количество() > 0 Тогда 
		НайденаяСтрокаСчетаДетальноОплаты = НайденыеСтрокиСчетаДетальноОплаты[0];
		
		НайденаяСтрокаСчетаДетальноОплаты.СуммаРаспределено = НайденаяСтрокаСчетаДетальноОплаты.СуммаРаспределено 
			- НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
		//НайденаяСтрокаСчетаДетальноОплаты.ОстатокКРаспределению = НайденаяСтрокаСчетаДетальноОплаты.ОстатокКРаспределению 
		//	+ НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
	КонецЕсли;		
КонецЦикла;

ОбщийФункционалСервер.УдалитьСтроки(РаспределениеОплатДолги, НайденыеСтрокиРаспределениеОплатДолги);
КонецФункции	

Процедура ОчиститьСчетаДетальноДолгиДокументОплаты(ДокументОплаты, РаспределениеОплатДолги, СчетаДетальноДолги) Экспорт
ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);
НайденныеСтрокиРаспределениеОплат = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
Для Каждого НайденнаяСтрокаРаспределениеОплат Из НайденныеСтрокиРаспределениеОплат Цикл
	ОтборСтрокиСчетаДетальноДолги = Новый Структура("ДолгиГУИД, СчетГУИД"
		, НайденнаяСтрокаРаспределениеОплат.ДолгиГУИД, НайденнаяСтрокаРаспределениеОплат.СчетГУИД);
	
	НайденныеСтроки = СчетаДетальноДолги.НайтиСтроки(ОтборСтрокиСчетаДетальноДолги);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НайденнаяСтрока.СуммаОплачено = НайденнаяСтрока.СуммаОплачено - НайденнаяСтрокаРаспределениеОплат.СуммаОплаты;
		НайденнаяСтрока.СуммаКЗакрытию = НайденнаяСтрока.СуммаКЗакрытию + НайденнаяСтрокаРаспределениеОплат.СуммаОплаты;
	КонецЦикла;	
КонецЦикла;

ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, РаспределениеОплатДолги);
КонецПроцедуры

Функция ОчиститьДанныеСтрокаОплаты(СтрокаОплаты, РаспределениеОплатДолги, СчетаДетальноДолги) Экспорт
ОтборСтроки = Новый Структура("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
НайденыеСтрокиРаспределениеОплатДолги = РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);

Для Каждого НайденаяСтрокаРаспределениеОплатДолги Из НайденыеСтрокиРаспределениеОплатДолги Цикл
	СтрокаОплаты.СуммаРаспределено = СтрокаОплаты.СуммаРаспределено 
		- НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
	
	ОтборСтрокиСчетаДетальноДолги = Новый Структура("ДолгиГУИД, СчетГУИД"
		, НайденаяСтрокаРаспределениеОплатДолги.ДолгиГУИД, НайденаяСтрокаРаспределениеОплатДолги.СчетГУИД);
	НайденныеСтроки = СчетаДетальноДолги.НайтиСтроки(ОтборСтрокиСчетаДетальноДолги);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НайденнаяСтрока.СуммаОплачено = НайденнаяСтрока.СуммаОплачено - НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
		НайденнаяСтрока.СуммаКЗакрытию = НайденнаяСтрока.СуммаКЗакрытию + НайденаяСтрокаРаспределениеОплатДолги.СуммаОплаты;
	КонецЦикла;	
КонецЦикла;

ОбщийФункционалСервер.УдалитьСтроки(РаспределениеОплатДолги, НайденыеСтрокиРаспределениеОплатДолги);
КонецФункции	
// 

//// - Оплата

//////// + Заявка на бронирование


//
Функция БлокироватьЗаявки(МассивЗаявок) Экспорт
МассивОшибок = Новый Массив;
Для Каждого Элемент Из МассивЗаявок Цикл
	ЗаявкаОбъект = Элемент.ПолучитьОбъект();   
	Ответ = ОбщийФункционалСервер.БлокироватьОбъект(ЗаявкаОбъект);
	Если Ответ.Ошибка Тогда 
		ТекстОшибки = Ответ.ТекстОшибки;
		ТекстОшибки = "Заявка на бронирование " + ЗаявкаОбъект + " заблокирована (открыта), " + ТекстОшибки;  
		МассивОшибок.Добавить(ТекстОшибки);		
	КонецЕсли;	
КонецЦикла;		

Возврат МассивОшибок;
КонецФункции
//

// ===================================================
Функция Тест(СчетаДетальноДолги) Экспорт
//ОбъектЗначение = ДанныеФормыВЗначение(СчетаДетальноДолги, Тип("ДокументТабличнаяЧасть.ЗаявкаНаБронирование.СчетаДетальноДолги"));	

//ОбъектЗначение = ДанныеФормыВЗначение(СчетаДетальноДолги, Тип("ДанныеФормыКоллекция"));	
ОбъектЗначение = ДанныеФормыВЗначение(СчетаДетальноДолги, Тип("ДокументОбъект.ЗаявкаНаБронирование"));	

КонецФункции

// ++++++++++++++++++++++++++++++++++++++


