
Функция ПолучитьДанныеБронирования(Знач АдресСервера, Знач НачальнаяДата = Неопределено, Знач КонечнаяДата = Неопределено)  Экспорт    
    Перем Соединение, ОбъектJSON;
    
    Попытка
        Если КонечнаяДата = Неопределено Тогда
            КонечнаяДата = ТекущаяДата();
        КонецЕсли;
        Если НачальнаяДата = Неопределено Тогда
            НачальнаяДата = КонечнаяДата - 60 * 60 * 24 * 90;
        КонецЕсли;
        ПроверитьПараметр("СайтБронирования.ПолучитьДанные", "АдресСервера", АдресСервера, Тип("Строка"));
        
        Соединение = Новый Структура("АдресСервера,Порт,SSL", АдресСервера, 443, Истина);  
        
        Путь = "/test/manager/index.php?r=reservation/export&startDate="+Формат(НачальнаяДата, "ДФ=дд-ММ-гггг")+"&endDate="+Формат(КонечнаяДата, "ДФ=дд-ММ-гггг");
        
        Данные = ВыполнитьЗапрос(Соединение, Путь);
    
        Возврат Новый Структура("ДанныеJSON,Ошибка,Описание", Данные, Ложь, "");
    Исключение
        Возврат Новый Структура("ДанныеJSON,Ошибка,Описание", Новый Массив(), Истина, ОписаниеОшибки());
    КонецПопытки;
    
КонецФункции
 
Функция СтрВДату(Знач сДата) Экспорт
    
    Перем п_мТЕМП; // массив временных переменных
    
//-----для локализации ------------------------------
    Перем п_мФорматы;
    п_мФорматы = Новый Массив(4);
    п_мФорматы[0] = "г";    // знак года
    п_мФорматы[1] = "ЧЦ=2; ЧН=; ЧВН=";
    п_мФорматы[2] = "ЧГ=0";    
    п_мФорматы[3] = "ДФ=МММ";
//---------------------------------------------------
 
    Если ПустаяСтрока(сДата) Тогда
        п_мТЕМП[6] =Дата("00010101000000");
        Возврат п_мТЕМП[6];
    КонецЕсли;
    
    сДата = Формат(сДата, п_мФорматы[2]);        //на случай если в формате 1с числом: 20150320220315. (+локализация)
 
 //Если использовать конструкцию "Если Найти(сДата,..." , то перебор букв строки будет происходить 2а раза: Найти и СтрЗаменить //Использование Найти в данном случае бессмысленно
    // можно добавить любой разделитель - @, #, %, и тд, неважно. Главное, заменить их на "."
    сДата = СтрЗаменить(сДата, "«", "");             //«1 Фев 05 г.»
    сДата = СтрЗаменить(сДата, "»", "");            //«1 Фев 05 г.»
     сДата = СтрЗаменить(сДата, п_мФорматы[0] + ".", "");   //1 Фев 05 г. 17:20:00 //просто "г" нельзя из-за "авГуст", например. Но в далее,после парсинга месяца, любое "г" в строке,  удаляется
    сДата = СтрЗаменить(сДата, "/", ".");            // 1/2/5
    сДата = СтрЗаменить(сДата, "\", ".");            // 1\02\05
    сДата = СтрЗаменить(сДата, "-", ".");            // 1-02-05
    сДата = СтрЗаменить(сДата, Символы.Таб, ".");        // 01.02.2005    17:20:00    
    сДата = СтрЗаменить(сДата, " ", ".");            // 1/02 2005 17:20:00
    сДата = СтрЗаменить(сДата, "..",  ".");            //Возможны, появление двойных точек из за "янв." в "янв" или из-за " г. ".    
    сДата = НРег(СокрЛП(сДата));                 // строку в нижний регистр, чтоб проще было с Янв Январь янв и тд
    
    п_мТЕМП = Новый массив(7);//массив для временных переменных    
    
    п_мТЕМП[0] = Найти(сДата,".");
    
    Если п_мТЕМП[0] = 0 Тогда
        //если точек нет
        
        Если Найти(сДата,":") Тогда
                //только время (или ошибка)
                сДата = "01.01.0001." + сДата;
                п_мТЕМП[0] = Найти(сДата,".");
        иначе            
                //похоже на формат 1с. Можно добавить "попытку"...
                п_мТЕМП[6] = дата(сДата);
                Возврат п_мТЕМП[6];
 
        КонецЕсли;    
        
        
    //иначеЕсли п_мТЕМП[0] = 1 Тогда
    //        //например, месяц и год
    КонецЕсли;
    
 
    // ----- ДНИ -------------------------------------
    п_мТЕМП[0] = Лев(сДата, п_мТЕМП[0] - 1);//дни
    п_мТЕМП[4] = Прав(сДата, СтрДлина(сДата) - СтрДлина(п_мТЕМП[0])-1);// месяц и все что справа
    п_мТЕМП[0] = Формат(Число(п_мТЕМП[0]),п_мФорматы[1]);//дни в формат двух чисел
    // ----- Месяц -----------------------------------
    п_мТЕМП[1] = Лев(п_мТЕМП[4], найти(п_мТЕМП[4],".") - 1);// месяц
    п_мТЕМП[4] = Прав(п_мТЕМП[4], СтрДлина(п_мТЕМП[4]) - СтрДлина(п_мТЕМП[1])-1);// год и все что справа
    //Возможны варианты месяца "янв" "янв." "январь" "января"
    Если СтрДлина(п_мТЕМП[1]) > 2 Тогда // месяц в виде янв или январь
        
        п_мТЕМП[2] = 0;
        Пока п_мТЕМП[2] < 12 Цикл
            
            п_мТЕМП[2] = п_мТЕМП[2]+1;
            // берем из "янв." только "янв"
            п_мТЕМП[3] = СтрЗаменить(Формат(Дата("2001" + Формат(п_мТЕМП[2],п_мФорматы[1]) + "01"), п_мФорматы[3]),".","");// + локализация
            
            п_мТЕМП[3] = найти(п_мТЕМП[1], п_мТЕМП[3]);
            
            Если п_мТЕМП[3] > 0 тогда
                п_мТЕМП[1] = Формат(п_мТЕМП[2],п_мФорматы[1]);
                прервать;
            КонецЕсли;
        КонецЦикла;    
    Иначе
        п_мТЕМП[1] = Формат(Число(п_мТЕМП[1]),п_мФорматы[1]);
    КонецЕсли;
    // ----- ГОД -----------------------------------
    //Если в строке было "г" без точки("г.")
    п_мТЕМП[4] = СтрЗаменить(п_мТЕМП[4], п_мФорматы[0], "");
    //ищем год. Дата может быть без времени, т.е. год последний в строке
    п_мТЕМП[2] = Найти(п_мТЕМП[4],".");
    
    Если п_мТЕМП[2]>0 Тогда
        п_мТЕМП[2] =  Лев(п_мТЕМП[4], п_мТЕМП[2] - 1);// год
        п_мТЕМП[4] = Прав(п_мТЕМП[4], СтрДлина(п_мТЕМП[4]) - СтрДлина(п_мТЕМП[2])-1);//время и все что справа
    Иначе
        п_мТЕМП[2] = п_мТЕМП[4];
        п_мТЕМП[4] = "";
    КонецЕсли;    
    
    //проверяем год
    п_мТЕМП[3] = СтрДлина(п_мТЕМП[2]);
    //если год из двух цыфр
    Если п_мТЕМП[3] = 2 или п_мТЕМП[3] = 1 Тогда
        п_мТЕМП[3] = Число(п_мТЕМП[2]);// год как число
        
        //что означает 15 в "20.03.15"? это 2015г или 1915г? (Настраиваем под себя или выдаём ошибку)
        // в моем варианте если  < 50 то это 2000г. иначе 1900г.
        Если п_мТЕМП[3] < 50 Тогда
            п_мТЕМП[2] = "20" + Формат(п_мТЕМП[3],п_мФорматы[1]);
        Иначе
            п_мТЕМП[2] = "19" + Формат(п_мТЕМП[3],п_мФорматы[1]);
        КонецЕсли;    
        
    КонецЕсли;
 
    // =======================  Форматируем время ==============================
    п_мТЕМП[6] = СтрЗаменить(п_мТЕМП[4],":", ".");// если дата была, например: 17-30-10, то сейчас 17.30.10
    //"попытка" на преобразование даты, по времени, занимает столько же, а по ресурсам больше, чем сам парсинг времени.
    //поэтому, убиваем двух зайцев перебором часы/мин/сек сразу
    Если СтрДлина(п_мТЕМП[6]) > 0 Тогда
        
        п_мТЕМП[5] = найти(п_мТЕМП[6],".");
        Если п_мТЕМП[5] > 0 Тогда
            // ========= часы    =================
            п_мТЕМП[3] = Лев(п_мТЕМП[6], найти(п_мТЕМП[6],".") - 1);//часы
            п_мТЕМП[6] = Прав(п_мТЕМП[6], СтрДлина(п_мТЕМП[6]) - СтрДлина(п_мТЕМП[3])-1);// минуты и все что справа
            
            Если п_мТЕМП[3] = "" тогда
                п_мТЕМП[3] = "00";        
            Иначе
                //при переводе в дату лидирующий 0 у часов удаляется. Т.е. след. строка бесполезна
                //п_мТЕМП[3] = Формат(Число(п_мТЕМП[3]),п_мФорматы[1]);//часы в формат двух чисел     
            КонецЕсли;        
            
            п_мТЕМП[5] = найти(п_мТЕМП[6],".");
            Если п_мТЕМП[5] > 0 Тогда
                // ========= минуты    =================
                п_мТЕМП[4] = Лев(п_мТЕМП[6], найти(п_мТЕМП[6],".") - 1);
                п_мТЕМП[6] = Прав(п_мТЕМП[6], СтрДлина(п_мТЕМП[6]) - СтрДлина(п_мТЕМП[4])-1);// секунды и все что справа
                Если п_мТЕМП[4] = "" тогда
                    п_мТЕМП[4] = "00";        
                Иначе
                    п_мТЕМП[4] = Формат(Число(п_мТЕМП[4]),п_мФорматы[1]);//минуты в формат двух чисел     
                КонецЕсли;
                
                // ========= секунды    =================
                Если СтрДлина(п_мТЕМП[6]) = 0 Тогда
                    п_мТЕМП[5] = "00";        
                Иначе
                    п_мТЕМП[5] = Формат(Число(п_мТЕМП[6]),п_мФорматы[1]);//секунды в формат двух чисел     
                КонецЕсли;
                
            Иначе
                п_мТЕМП[4] = Формат(Число(п_мТЕМП[6]),п_мФорматы[1]);    
                п_мТЕМП[5] = "00";            
            КонецЕсли;     
        Иначе
            п_мТЕМП[3] = Формат(Число(п_мТЕМП[6]),п_мФорматы[1]);        
            п_мТЕМП[4] = "00";
            п_мТЕМП[5] = "00";
        КонецЕсли;
        
    Иначе
        п_мТЕМП[3] = "00";        
        п_мТЕМП[4] = "00";
        п_мТЕМП[5] = "00";            
    КонецЕсли;
    
    п_мТЕМП[6] = п_мТЕМП[0] + "." + п_мТЕМП[1] + "." + п_мТЕМП[2] + " " + п_мТЕМП[3] + ":" + п_мТЕМП[4] + ":" + п_мТЕМП[5];
    п_мТЕМП[6] = дата(п_мТЕМП[6]);
    
    Возврат п_мТЕМП[6];
    
    
КонецФункции
 
Функция ПолучитьСтрокуJSON(Объект)
    ЗаписьJSON = Новый ЗаписьJSON();
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Объект);
    Возврат ЗаписьJSON.Закрыть();
КонецФункции
 
// Вызывает исключение, если тип значения параметра ИмяПараметра процедуры или функции ИмяПроцедурыИлиФункции
// отличается от ожидаемого.
// Для быстрой диагностики типов параметров, передаваемых в процедуры и функции программного интерфейса.
//
// В связи с особенностью реализации ОписанияТипов всегда включает в себя тип <Неопределено>.
// если требуется жесткая проверка типа, используйте в параметре ОжидаемыеТипы
// конкретный тип, массив или соответствие типов.
//
// Параметры:
//   ИмяПроцедурыИлиФункции - Строка - имя процедуры или функции, параметр которой проверяется.
//   ИмяПараметра - Строка - имя проверяемого параметра процедуры или функции.
//   ЗначениеПараметра - Произвольный - фактическое значение параметра.
//   ОжидаемыеТипы - ОписаниеТипов, Тип, Массив, ФиксированныйМассив, Соответствие, ФиксированноеСоответствие - тип(ы)
//       параметра процедуры или функции.
//   ОжидаемыеТипыСвойств - Структура - если ожидаемый тип - структура, то
//       в этом параметре можно указать типы ее свойств.
//
Процедура ПроверитьПараметр(Знач ИмяПроцедурыИлиФункции, Знач ИмяПараметра, Знач ЗначениеПараметра,
    Знач ОжидаемыеТипы, Знач ОжидаемыеТипыСвойств = Неопределено, Знач ОжидаемыйШаблон = Неопределено)
    
    Контекст = "ОбщегоНазначенияКлиентСервер.ПроверитьПараметр";
    
    Проверить(
        ТипЗнч(ИмяПроцедурыИлиФункции) = Тип("Строка"),
        НСтр("ru = 'Недопустимое значение параметра ИмяПроцедурыИлиФункции'"),
        Контекст);
    
    Проверить(
        ТипЗнч(ИмяПараметра) = Тип("Строка"),
        НСтр("ru = 'Недопустимое значение параметра ИмяПараметра'"),
        Контекст);
    
    ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеПараметра, ОжидаемыеТипы);
    
    Проверить(
        ЭтоКорректныйТип <> Неопределено,
        НСтр("ru = 'Недопустимое значение параметра ОжидаемыеТипы'"),
        Контекст);
    
    Проверить(
        ЭтоКорректныйТип,
        ПодставитьПараметрыВСтроку(
            НСтр("ru = 'Недопустимое значение параметра %1 в %2.
                       |Ожидалось: %3; передано значение: %4 (тип %5).'"),
            ИмяПараметра,
            ИмяПроцедурыИлиФункции,
            ПредставлениеТипов(ОжидаемыеТипы),
            ?(ЗначениеПараметра <> Неопределено,
                ЗначениеПараметра,
                НСтр("ru = 'Неопределено'")),
        ТипЗнч(ЗначениеПараметра)));
    
    Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") И ОжидаемыйШаблон <> Неопределено Тогда
        RegExp = Новый COMОбъект("VBScript.RegExp");
        RegExp.Pattern = Строка(ОжидаемыйШаблон);
        Если Не RegExp.Test(ЗначениеПараметра) Тогда
            ТекстИсключения = ПодставитьПараметрыВСтроку(
                НСтр("ru = 'Недопустимое значение параметра %1 в %2.
                       |Ожидалось строка, соответствующая шаблону: %3; передано значение: %4.'"),
                ИмяПараметра,
                ИмяПроцедурыИлиФункции,
                Строка(ОжидаемыйШаблон),
                ЗначениеПараметра);
            ВызватьИсключение ТекстИсключения;
        КонецЕсли;
        RegExp = Неопределено;
    КонецЕсли;
    
    Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") И ОжидаемыеТипыСвойств <> Неопределено Тогда
        
        Проверить(
            ТипЗнч(ОжидаемыеТипыСвойств) = Тип("Структура"),
            НСтр("ru = 'Недопустимое значение параметра ИмяПроцедурыИлиФункции'"),
            Контекст);
        
        Для каждого Свойство Из ОжидаемыеТипыСвойств Цикл
            
            ОжидаемоеИмяСвойства = Свойство.Ключ;
            ОжидаемыйТипСвойства = Свойство.Значение;
            ЗначениеСвойства = Неопределено;
            
            Проверить(
                ЗначениеПараметра.Свойство(ОжидаемоеИмяСвойства, ЗначениеСвойства),
                ПодставитьПараметрыВСтроку(
                    НСтр("ru = 'Недопустимое значение параметра %1 (Структура) в %2.
                               |В структуре ожидалось свойство %3 (тип %4).'"),
                    ИмяПараметра,
                    ИмяПроцедурыИлиФункции,
                    ОжидаемоеИмяСвойства,
                    ОжидаемыйТипСвойства));
            
            ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеСвойства, ОжидаемыйТипСвойства);
            
            Проверить(
                ЭтоКорректныйТип,
                ПодставитьПараметрыВСтроку(
                    НСтр("ru = 'Недопустимое значение свойства %1 в параметре %2 (Структура) в %3.
                               |Ожидалось: %4; передано значение: %5 (тип %6).'"),
                    ОжидаемоеИмяСвойства,
                    ИмяПараметра,
                    ИмяПроцедурыИлиФункции,
                    ПредставлениеТипов(ОжидаемыеТипы),
                    ?(ЗначениеСвойства <> Неопределено,
                        ЗначениеСвойства,
                        НСтр("ru = 'Неопределено'")),
                ТипЗнч(ЗначениеСвойства)));
            
        КонецЦикла;
    КонецЕсли;
    
КонецПроцедуры
 
// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   Условие - Булево - если не равно Истина, то вызывается исключение.
//   КонтекстПроверки - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//   Сообщение - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по умолчанию.
//
Процедура Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "")
    
    Если Условие <> Истина Тогда
        
        Если ПустаяСтрока(Сообщение) Тогда
            ТекстИсключения = НСтр("ru = 'Недопустимая операция'"); // Assertion failed
        Иначе
            ТекстИсключения = Сообщение;
        КонецЕсли;
        
        Если Не ПустаяСтрока(КонтекстПроверки) Тогда
            ТекстИсключения = ПодставитьПараметрыВСтроку(
                НСтр("ru = '%1 в %2'"),
                ТекстИсключения,
                КонтекстПроверки);
        КонецЕсли;
        
        ВызватьИсключение ТекстИсключения;
        
    КонецЕсли;
    
КонецПроцедуры
 
Функция ЗначениеОжидаемогоТипа(Значение, ОжидаемыеТипы)
    
    ТипЗначения = ТипЗнч(Значение);
    
    Если ТипЗнч(ОжидаемыеТипы) = Тип("ОписаниеТипов") Тогда
        
        Возврат ОжидаемыеТипы.СодержитТип(ТипЗначения);
        
    ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Тип") Тогда
        
        Возврат ТипЗначения = ОжидаемыеТипы;
        
    ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Массив")
        Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив") Тогда
        
        Возврат ОжидаемыеТипы.Найти(ТипЗначения) <> Неопределено;
        
    ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
        Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
        
        Возврат ОжидаемыеТипы.Получить(ТипЗначения) <> Неопределено;
        
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции
 
Функция ПредставлениеТипов(ОжидаемыеТипы)
    
    Если ТипЗнч(ОжидаемыеТипы) = Тип("Массив")
        Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив")
        Или ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
        Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
        
        Результат = "";
        Индекс = 0;
        Для Каждого Элемент Из ОжидаемыеТипы Цикл
            
            Если ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
                Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
                
                Тип = Элемент.Ключ;
            Иначе
                Тип = Элемент;
            КонецЕсли;
            
            Если Не ПустаяСтрока(Результат) Тогда
                Результат = Результат + ", ";
            КонецЕсли;
            
            Результат = Результат + ПредставлениеТипа(Тип);
            Индекс = Индекс + 1;
            Если Индекс > 10 Тогда
                Результат = ПодставитьПараметрыВСтроку(
                    НСтр("ru='%1,... (всего %2 типов)'"),
                    Результат,
                    ОжидаемыеТипы.Количество());
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Возврат Результат;
        
    Иначе
        Возврат ПредставлениеТипа(ОжидаемыеТипы);
    КонецЕсли;
    
КонецФункции
 
Функция ПредставлениеТипа(Тип)
    
    Если Тип = Неопределено Тогда
        
        Возврат "Неопределено";
        
    ИначеЕсли ТипЗнч(Тип) = Тип("ОписаниеТипов") Тогда
        
        ТипСтрокой = Строка(Тип);
        Возврат
            ?(СтрДлина(ТипСтрокой) > 150,
                ПодставитьПараметрыВСтроку(
                    НСтр("ru='%1,... (всего %2 типов)'"),
                    Лев(ТипСтрокой, 150),
                    Тип.Типы().Количество()),
                ТипСтрокой);
        
    Иначе
        
        ТипСтрокой = Строка(Тип);
        Возврат
            ?(СтрДлина(ТипСтрокой) > 150,
                Лев(ТипСтрокой, 150) + "...",
                ТипСтрокой);
        
    КонецЕсли;
    
КонецФункции
 
// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  ШаблонСтроки  - Строка - шаблон строки с параметрами (вхождениями вида "%<номер параметра>",
//                           например "%1 пошел в %2");
//  Параметр<n>   - Строка - значение подставляемого параметра.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел
//  в Зоопарк".
//
Функция ПодставитьПараметрыВСтроку(Знач ШаблонСтроки,
    Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
    Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
    Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
    
    ЕстьПараметрыСПроцентом = СтрНайти(Параметр1, "%")
        Или СтрНайти(Параметр2, "%")
        Или СтрНайти(Параметр3, "%")
        Или СтрНайти(Параметр4, "%")
        Или СтрНайти(Параметр5, "%")
        Или СтрНайти(Параметр6, "%")
        Или СтрНайти(Параметр7, "%")
        Или СтрНайти(Параметр8, "%")
        Или СтрНайти(Параметр9, "%");
        
    Если ЕстьПараметрыСПроцентом Тогда
        Возврат ПодставитьПараметрыСПроцентом(ШаблонСтроки, Параметр1,
            Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
    КонецЕсли;
    
    ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
    ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%2", Параметр2);
    ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%3", Параметр3);
    ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%4", Параметр4);
    ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%5", Параметр5);
    ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%6", Параметр6);
    ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%7", Параметр7);
    ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%8", Параметр8);
    ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%9", Параметр9);
    Возврат ШаблонСтроки;
    
КонецФункции
 
Функция РазвернутьВСтроку(Массив, Префикс = "")
    Рез = "";
    Для Каждого Элемент Из Массив Цикл
        Рез = Рез + Префикс + Строка(Элемент);
    КонецЦикла;
    Возврат Рез;
КонецФункции
 
// Вставляет параметры в строку, учитывая, что в параметрах могут использоваться подстановочные слова %1, %2 и т.д.
Функция ПодставитьПараметрыСПроцентом(Знач СтрокаПодстановки,
    Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
    Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
    Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
    
    Результат = "";
    Позиция = СтрНайти(СтрокаПодстановки, "%");
    Пока Позиция > 0 Цикл
        Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
        СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
        ПодставляемыйПараметр = Неопределено;
        Если СимволПослеПроцента = "1" Тогда
            ПодставляемыйПараметр = Параметр1;
        ИначеЕсли СимволПослеПроцента = "2" Тогда
            ПодставляемыйПараметр = Параметр2;
        ИначеЕсли СимволПослеПроцента = "3" Тогда
            ПодставляемыйПараметр = Параметр3;
        ИначеЕсли СимволПослеПроцента = "4" Тогда
            ПодставляемыйПараметр = Параметр4;
        ИначеЕсли СимволПослеПроцента = "5" Тогда
            ПодставляемыйПараметр = Параметр5;
        ИначеЕсли СимволПослеПроцента = "6" Тогда
            ПодставляемыйПараметр = Параметр6;
        ИначеЕсли СимволПослеПроцента = "7" Тогда
            ПодставляемыйПараметр = Параметр7
        ИначеЕсли СимволПослеПроцента = "8" Тогда
            ПодставляемыйПараметр = Параметр8;
        ИначеЕсли СимволПослеПроцента = "9" Тогда
            ПодставляемыйПараметр = Параметр9;
        КонецЕсли;
        Если ПодставляемыйПараметр = Неопределено Тогда
            Результат = Результат + "%";
            СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
        Иначе
            Результат = Результат + ПодставляемыйПараметр;
            СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
        КонецЕсли;
        Позиция = СтрНайти(СтрокаПодстановки, "%");
    КонецЦикла;
    Результат = Результат + СтрокаПодстановки;
    
    Возврат Результат;
КонецФункции
 
Функция ВыполнитьЗапрос(Соединение, Путь)
    HTTP = Новый HTTPСоединение(
                                    Соединение.АдресСервера,
                                    Соединение.Порт,
                                    ,
                                    ,
                                    ,
                                    ,
                                    ?(Соединение.SSL, Новый ЗащищенноеСоединениеOpenSSL(), 0)
    );
    Заголовки = Новый Соответствие;
    ЗапросHTTP = Новый HTTPЗапрос(Путь, Заголовки);
    Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
    ОтветHTTP = HTTP.Получить(ЗапросHTTP);
    Стр = ОтветHTTP.ПолучитьТелоКакСтроку();
    ЧтениеJSON = Новый ЧтениеJSON();
    ЧтениеJSON.УстановитьСтроку(Стр);
    Результат = ПрочитатьJSON(ЧтениеJSON);
    ЧтениеJSON.Закрыть();
    HTTP = Неопределено;
    Возврат Результат;
КонецФункции
