
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.ДатаС = ТекущаяДата();
Отчет.ДатаПо = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
//

//
&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
ОбменГорничныеСервер.ЗагрузитьСмены(Отчет.ДатаС, Отчет.ДатаПо);	

СформироватьОбщийСтраница();
КонецПроцедуры
//

////
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	СформироватьТекущий();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекущий()
	Имя=Элементы.Страницы.ТекущаяСтраница.Имя;
	Выполнить("Сформировать"+Имя+"()");
	
	ПолеОтчета.ФиксацияСверху = 1;
КонецПроцедуры

&НаСервере
Процедура СформироватьОбщийСтраница()
ЗапросТекст = "ВЫБРАТЬ
              |	ГорничныеСмены.Ссылка КАК Ссылка,
              |	ГорничныеСмены.Горничная КАК Горничная,
              |	ГорничныеСмены.ДатаСмены КАК ДатаСмены,
              |	ГорничныеСмены.ВремяОткрытияСмены КАК ВремяОткрытияСмены,
              |	ГорничныеСмены.ВремяЗакрытияСмены КАК ВремяЗакрытияСмены
              |ИЗ
              |	Документ.ГорничныеСмены КАК ГорничныеСмены
              |ГДЕ
              |	ГорничныеСмены.ПометкаУдаления = ЛОЖЬ
              |	И ГорничныеСмены.ДатаСмены МЕЖДУ &ДН И &ДК
              |
              |УПОРЯДОЧИТЬ ПО
              |	ГорничныеСмены.ВремяОткрытияСмены,
              |	ГорничныеСмены.ВремяЗакрытияСмены,
              |	Горничная";


Запрос = Новый Запрос;
Запрос.Текст = ЗапросТекст;

Запрос.УстановитьПараметр("ДН",Отчет.ДатаС);
Запрос.УстановитьПараметр("Дк",КонецДня(Отчет.ДатаПо));

ТЗ=Запрос.Выполнить().Выгрузить();
   
ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
Макет = ОтчетОбъект.ПолучитьМакет("МакетОбщий");  

ПолеОтчета.Очистить();
ПолеОтчета.ФиксацияСверху = 1;

Шапка=Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(Шапка);

Для каждого Стр Из ТЗ Цикл
	
	Область=Макет.ПолучитьОбласть("Строка");
	               
	Область.Параметры.Дата = Формат(Стр.ВремяЗакрытияСмены, "ДФ=dd.MM.yy");
	Область.Параметры.Горничная = Стр.Горничная;
	Область.Параметры.ДатаСмены = Формат(Стр.ДатаСмены, "ДФ=dd.MM.yy");
	Область.Параметры.ВремяОткрытияСмены = Стр.ВремяОткрытияСмены;
	Область.Параметры.ВремяЗакрытияСмены = Стр.ВремяЗакрытияСмены;
	                           
	ПолеОтчета.Вывести(Область);     
КонецЦикла;

ПолеОтчета.ФиксацияСверху = 1;
КонецПроцедуры
////













