
Функция ТаблицаЗначенийВМассивСтруктур(Знач ТаблицаЗначений) Экспорт
Массив = Новый Массив;
Если ТаблицаЗначений.Количество() = 0 Тогда
	Возврат Массив;	
КонецЕсли;	

//Структура = Новый Структура;
//Для каждого Колонка из ТаблицаЗначений.Колонки Цикл
//	Имя = Колонка.Имя;
//	Структура.Вставить(Имя); 
//КонецЦикла;

Для Каждого Строка Из ТаблицаЗначений Цикл
	Структура = Новый Структура;
	Для каждого Колонка из ТаблицаЗначений.Колонки Цикл
		Имя = Колонка.Имя;
		Структура.Вставить(Имя); 
		Структура[Имя] = Строка[Имя];	
	КонецЦикла;
	Массив.Добавить(Структура);
КонецЦикла;

Возврат Массив; 	
КонецФункции

Функция ТабличнаяЧастьДокументаВМассивСтруктур(ДокументСсылка, ИмяТабличнойЧасти) Экспорт
ДанныеТабличнойЧасти = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ДокументСсылка, ИмяТабличнойЧасти);
ИмяДокумента = ДокументСсылка.Метаданные().Имя;
Массив = ОбщийФункционалСервер.МассивСтруктурТабличнаяЧастьДокумента(ДанныеТабличнойЧасти, ИмяДокумента, ИмяТабличнойЧасти);   
Возврат Массив; 	
КонецФункции

Функция МассивСтруктурТабличнаяЧастьДокумента(ИсходныеДанные, ИмяДокумента, ИмяТабличнойЧасти) Экспорт
Массив = Новый Массив;
Если ИсходныеДанные.Количество() = 0 Тогда
	Возврат Массив;	
КонецЕсли;	

СтруктураШаблон = СтруктураИзТабличнаяЧастьДокумента(ИмяДокумента, ИмяТабличнойЧасти); 
Для Каждого Строка Из ИсходныеДанные Цикл
	НоваяСтруктура = СкопироватьСтруктуру(СтруктураШаблон);
	ЗаполнитьЗначенияСвойств(НоваяСтруктура, Строка);	
	Массив.Добавить(НоваяСтруктура);
КонецЦикла;

Возврат Массив; 	
КонецФункции

Функция ПолучитьЗначениеРеквизитаНаСервере(ОбъектСсылка, ИмяРеквизита) Экспорт
Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда Возврат Неопределено; КонецЕсли;

Возврат ОбъектСсылка[ИмяРеквизита];

//Объект_ = ОбъектСсылка.ПолучитьОбъект();
//Реквизит = Объект_[ИмяРеквизита];

//Возврат Реквизит;
КонецФункции

Функция ЗначениеРеквизитаНаСервере(ОбъектСсылка, ИмяРеквизита) Экспорт
//Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда Возврат Неопределено; КонецЕсли;
Если ОбъектСсылка = Неопределено Тогда Возврат Неопределено; КонецЕсли;

Возврат ОбъектСсылка[ИмяРеквизита];
КонецФункции

Функция СправочникНайтиПоРеквизитуНаСервере(ИмяСправочника, ИмяРеквизита, ЗначениеРеквизита) Экспорт
Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда Возврат Справочники[ИмяСправочника].ПустаяСсылка(); КонецЕсли;

Если ИмяРеквизита = "Наименование" Тогда
	Результат = Справочники[ИмяСправочника].НайтиПоНаименованию(ЗначениеРеквизита);
ИначеЕсли ИмяРеквизита = "Код" Тогда
	Результат = Справочники[ИмяСправочника].НайтиПоКоду(ЗначениеРеквизита);
Иначе
	Результат = Справочники[ИмяСправочника].НайтиПоРеквизиту(ИмяРеквизита, ЗначениеРеквизита);
КонецЕсли;

Возврат Результат;
КонецФункции

Функция ДокументНайтиПоРеквизитуНаСервере(ИмяДокумента, ИмяРеквизита, ЗначениеРеквизита) Экспорт
Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда Возврат Документы[ИмяДокумента].ПустаяСсылка(); КонецЕсли;

Если ИмяРеквизита = "Наименование" Тогда
	Результат = Документы[ИмяДокумента].НайтиПоНаименованию(ЗначениеРеквизита);
ИначеЕсли ИмяРеквизита = "Код" Тогда
	Результат = Документы[ИмяДокумента].НайтиПоКоду(ЗначениеРеквизита);
Иначе
	Результат = Документы[ИмяДокумента].НайтиПоРеквизиту(ИмяРеквизита, ЗначениеРеквизита);
КонецЕсли;

Возврат Результат;
КонецФункции

Функция ПолучитьАбсолютныйЦвет(ИсходныйЦвет) Экспорт

    Если ИсходныйЦвет.Вид = ВидЦвета.Абсолютный Тогда
        Возврат ИсходныйЦвет;
    КонецЕсли;

    ТабДок = Новый ТабличныйДокумент;
    ТабДок.Область("R1C1").ЦветФона = ИсходныйЦвет;
    ВФ = ПолучитьИмяВременногоФайла("mxl");
    ТабДок.Записать(ВФ, ТипФайлаТабличногоДокумента.MXL7);
    ТабДок.Прочитать(ВФ);

    АЦвет = ТабДок.Область("R1C1").ЦветФона;
    ТабДок = Неопределено;
    УдалитьФайлы(ВФ);

    Возврат АЦвет;

КонецФункции

Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт

Возврат Константы[ИмяКонстанты].Получить();

КонецФункции

Функция ПолучитьЗначениеПараметраСеанса(ИмяПараметра) Экспорт
Реквизит = ПараметрыСеанса[ИмяПараметра];
Возврат Реквизит;
КонецФункции

Процедура ЗаполнитьПараметрСеанса(ИмяПараметра, ЗначениеПараметра) Экспорт
ПараметрыСеанса[ИмяПараметра] = ЗначениеПараметра;	
КонецПроцедуры


Функция ПолучитьЦветТекстаПоЦветуФона(ЦветФона) Экспорт
////	
//Темные цвета если все три значения меньше 0.5,
//а чтобы считались светлыми, достаточно, хотябы 1 из 3х цветов был болье 0.5 
//т.е. RGB(255/2+1, 126, 126) - уже светлый, а RGB(126, 126,126) - темный. Исходя из этого можно сделать мини функцию которая определяет light or dark		

//Если НовЦвет.Зеленый < 126 И НовЦвет.Красный < 126  И НовЦвет.Синий < 126 Тогда
//	Темный = Истина;
//Иначе	
//	Темный = Ложь;
//КонецЕсли;
////

//GrayScale = 0.299 * Red + 0.587 * Green + 0.114 * Blue;
//Если
//GrayScale > 127, то фон - светлый
//Если
//GrayScale <= 127, то фон - темный

GrayScale = 0.299 * ЦветФона.Красный + 0.587 * ЦветФона.Зеленый + 0.114 * ЦветФона.Синий;

Если GrayScale > 127 ТОгда 	// то фон - светлый
	ЦветТекста = WebЦвета.Черный;
Иначе 						// то фон - темный
	ЦветТекста = WebЦвета.Белый;
КонецЕсли;
	
Возврат ЦветТекста;	
КонецФункции	

Процедура ЗащититьФорму(Форма, Защитить) Экспорт
Форма.ТолькоПросмотр = Защитить;

//Доступность = НЕ Защитить;
//ТолькоПросмотр = Защитить;
//Для каждого ЭФ Из Форма.Элементы Цикл
//	Если ТипЗнч(ЭФ) = Тип("КнопкаФормы") Тогда
//		ЭФ.Доступность = Доступность;			
//	ИначеЕсли ТипЗнч(ЭФ) = Тип("ПолеФормы") Тогда
//		ЭФ.ТолькоПросмотр = ТолькоПросмотр;			
//	КонецЕсли;		
//КонецЦикла;
Конецпроцедуры	

Функция ТаблицаЗначенийИзТабличнаяЧасть(Ссылка, ИмяТабличнойЧасти) Экспорт
ТЗ = Новый ТаблицаЗначений;

ДокументОбъект = Ссылка.ПолучитьОбъект();
ТабличнаяЧасть = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти];
Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
	ТЗ.Колонки.Добавить(РеквизитТЧ.Имя, РеквизитТЧ.Тип);
КонецЦикла;

Для Каждого Строка Из ДокументОбъект[ИмяТабличнойЧасти] Цикл 
	НоваяСтрока = ТЗ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

Возврат ТЗ;
КонецФункции

Функция МассивЗначенийИзТабличнаяЧасть(Ссылка, ИмяТабличнойЧасти) Экспорт
ТЗ = ТаблицаЗначенийИзТабличнаяЧасть(Ссылка, ИмяТабличнойЧасти);
МассивЗначений = ТаблицаЗначенийВМассивСтруктур(ТЗ);
Возврат МассивЗначений;
КонецФункции


Функция ТаблицаЗначенийИзТабличнаяЧастьДокумента(ИмяДокумента, ИмяТабличнойЧасти) Экспорт
ТЗ = Новый ТаблицаЗначений;

ТабличнаяЧасть = Метаданные.Документы[ИмяДокумента].ТабличныеЧасти[ИмяТабличнойЧасти];
Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
	ТЗ.Колонки.Добавить(РеквизитТЧ.Имя, РеквизитТЧ.Тип);
КонецЦикла;

Возврат ТЗ;
КонецФункции

Функция РеквизитыИзТабличнаяЧастьДокумента(ИмяДокумента, ИмяТабличнойЧасти) Экспорт
ТабличнаяЧасть = Метаданные.Документы[ИмяДокумента].ТабличныеЧасти[ИмяТабличнойЧасти];
Реквизиты = ТабличнаяЧасть.Реквизиты;

Возврат Реквизиты;
КонецФункции


Функция СтруктураИзТабличнаяЧастьДокумента(ИмяДокумента, ИмяТабличнойЧасти) Экспорт
Структура = Новый Структура;

ТабличнаяЧасть = Метаданные.Документы[ИмяДокумента].ТабличныеЧасти[ИмяТабличнойЧасти];

Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
	Структура.Вставить(РеквизитТЧ.Имя);
КонецЦикла;

Возврат Структура;
КонецФункции

Функция СтруктураИзТабличнаяЧасть(Ссылка, ИмяТабличнойЧасти) Экспорт
Структура = Новый Структура;

ДокументОбъект = Ссылка.ПолучитьОбъект();
ТабличнаяЧасть = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти];
Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
	Структура.Вставить(РеквизитТЧ.Имя);
КонецЦикла;

Возврат Структура;
КонецФункции

Функция СтруктураИзТаблицы(Таблица) Экспорт
Структура = Новый Структура;

Для Каждого Реквизит Из Таблица.Колонки Цикл
	Структура.Вставить(Реквизит.Имя);
КонецЦикла;

Возврат Структура;
КонецФункции



Функция СкопироватьСтруктуру(ИсходнаяСтруктура) Экспорт
КопияСтруктуры = Новый Структура;
Для Каждого ЭлементСтруктуры Из ИсходнаяСтруктура Цикл
  КопияСтруктуры.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
КонецЦикла;
Возврат КопияСтруктуры; 
КонецФункции
 
Процедура СкопироватьДанныеВСтруктуру(ИсходнаяСтруктура, Данные) Экспорт
Для Каждого ЭлементСтруктуры Из ИсходнаяСтруктура Цикл
	Ключ = ЭлементСтруктуры.Ключ;
	Значение = Неопределено;
	Если НЕ Данные.Свойство(Ключ, Значение) Тогда Продолжить; КонецЕсли; 
	
	ИсходнаяСтруктура[Ключ] = Значение; 
КонецЦикла;
КонецПроцедуры

//
Функция ИдентификаторСтрокиТабличнаяЧасть(Знач ТабличнаяЧасть, ИмяКлюча, ЗначениеКлюча ) Экспорт 
ОтборСтроки = Новый Структура(ИмяКлюча, ЗначениеКлюча); 	
НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли;

НайденнаяСтрока = НайденныеСтроки[0];
Идентификатор = НайденнаяСтрока.ПолучитьИдентификатор();

Возврат Идентификатор;
КонецФункции	

Процедура УдалитьТекущуюСтрокуТаблицыДокумента(Элемент, Таблица) Экспорт
ТекущаяСтрока = Элемент.ТекущаяСтрока;
ТекущиеДанные = Таблица.НайтиПоИдентификатору(ТекущаяСтрока);
Таблица.Удалить(ТекущиеДанные);	
КонецПроцедуры
//

//
Функция  БлокироватьОбъект(ОбъектДляБлокировки) Экспорт
Ответ = Новый Структура("Ошибка, ТекстОшибки", Ложь, "");	
	
Попытка 
	ОбъектДляБлокировки.Заблокировать();
	Возврат Ответ;
Исключение
	Ответ.Ошибка = Истина;
	
	ОписаниеОшибки = ОписаниеОшибки();
	Индекс = СтрНайти(ОписаниеОшибки, "Объект уже заблокирован");  
	//12345678901234567890123
	//Объект уже заблокирован
	Если Индекс = 0 Тогда 
		Ответ.ТекстОшибки = ОписаниеОшибки;
		Возврат Ответ;
	КонецЕсли;
	
	ТекстОшибки = Сред(ОписаниеОшибки, Индекс + 25);
	//, приложение
	Индекс = СтрНайти(ТекстОшибки, ", приложение"); 
	Если Индекс = 0 Тогда 
		Ответ.ТекстОшибки = ТекстОшибки;
		Возврат Ответ;
	КонецЕсли;
	
	Ответ.ТекстОшибки = Лев(ТекстОшибки, Индекс -1);		
	Возврат Ответ;		
КонецПопытки;	
		
КонецФункции

Функция ПроверкаБлокировкиСообщение(МассивОбъектов, ТекстОшибки) Экспорт
МассивОшибок = ЗаявкаСервер.БлокироватьЗаявки(МассивОбъектов);	
Если МассивОшибок.Количество() = 0  Тогда Возврат Ложь; КонецЕсли;

Сообщить(ТекстОшибки + " Есть открытые (заблокированные) Заявки. ЗАКРОЙТЕ ОТКРЫТЫЕ ЗАЯВКИ И ПОВТОРИТЕ ОПЕРАЦИЮ ...");
Для Каждого Элемент Из МассивОшибок Цикл
	Сообщить(Элемент);					 
КонецЦикла;		

Возврат Истина;
КонецФункции	
//

Процедура УсловноеОформлениеДобавитьПоле(УсловноеОформление, 
	ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета) Экспорт	
    
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();

    ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыТабНаФормеИмя);

    ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
    ОтборЭлемента.ВидСравнения = Вид_Сравнения;
	ОтборЭлемента.ПравоеЗначение = ПравоеЗначение;
	ОтборЭлемента.Использование  = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Web_Цвета);
	ЭлементОформления.Использование = Истина;
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", ТолькоПросмотр);	

КонецПроцедуры

Процедура ПолнаяПапкаРодитель(Ссылка, ТекущийРодитель) Экспорт
Если Ссылка = Справочники.Клиенты.ПустаяСсылка() Тогда Возврат; КонецЕсли;

Если Ссылка.ЭтоГруппа Тогда 
	НаименованиеГруппы = Ссылка.Наименование;
	ПолнаяПапкаРодительУстановить(Ссылка, ТекущийРодитель);
	ТекущийРодитель = ТекущийРодитель + НаименованиеГруппы + "\";
Иначе	
	ПолнаяПапкаРодительУстановить(Ссылка, ТекущийРодитель);
КонецЕсли;
КонецПроцедуры	

Процедура ПолнаяПапкаРодительУстановить(Ссылка, ТекущийРодитель) 
Если Ссылка = Справочники.Клиенты.ПустаяСсылка() Тогда Возврат; КонецЕсли;

Родитель = Ссылка.Родитель;	

ТекущийРодитель =  Родитель.Наименование + "\" + ТекущийРодитель;	

ПолнаяПапкаРодительУстановить(Родитель, ТекущийРодитель)
КонецПроцедуры	

Функция Флажок(Значение) Экспорт
	Если Значение Тогда
		Возврат Символ(118); 
	Иначе
		Возврат ""; 
	КонецЕсли;	
КонецФункции

Функция ТекущийПользовательНаименование() Экспорт
Возврат ПараметрыСеанса.ТекущийПользователь.Наименование; 	
	
КонецФункции

Процедура ВерхняяПапка(Ссылка, Результат) Экспорт
Если НЕ ЗначениеЗаполнено(Ссылка) Тогда Возврат; КонецЕсли;	
Если НЕ ЗначениеЗаполнено(Ссылка.Родитель) Тогда Возврат; КонецЕсли;

Ссылка = Ссылка.Родитель;
Результат = Ссылка;

ВерхняяПапка(Ссылка, Результат);
КонецПроцедуры

Функция ВСписке(Значение, Имя, Список) Экспорт
ВСписке = Ложь;	
Для Каждого Строка Из Список Цикл
	Если Строка[Имя] = Значение Тогда 
		ВСписке = Истина;	
		Прервать;
	КонецЕсли;
КонецЦикла;

Возврат ВСписке;
КонецФункции

//
Процедура УдалитьСтрокиОтборСтроки(ОтборСтроки, Строки) Экспорт
НайденыеСтроки = Строки.НайтиСтроки(ОтборСтроки);
Если НайденыеСтроки.Количество() > 0 Тогда
	МассивКУдалению = Новый Массив;
	Для Каждого Строка Из НайденыеСтроки Цикл
		МассивКУдалению.Добавить(Строка);		
	КонецЦикла;	
	
	Для Каждого Элемент Из МассивКУдалению Цикл
		Строки.Удалить(Элемент);		
	КонецЦикла;	
КонецЕсли;	
КонецПроцедуры	

Процедура УдалитьСтроки(СтрокиРезультат, СтрокиКУдалению) Экспорт
Для Каждого Строка Из СтрокиКУдалению Цикл
	СтрокиРезультат.Удалить(Строка);
КонецЦикла;
КонецПроцедуры

Процедура ДобавитьСтроки(СтрокиРезультат, СтрокиКДобавлению) Экспорт
Для Каждого Строка Из СтрокиКДобавлению Цикл
	НоваяСтрока = СтрокиРезультат.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;
КонецПроцедуры

Процедура ЗаменитьСтрокиОтборСтроки(СтрокиРезультат, СтрокиКЗамене, ОтборСтроки) Экспорт
ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, СтрокиРезультат);
ОбщийФункционалСервер.ДобавитьСтроки(СтрокиРезультат, СтрокиКЗамене);
КонецПроцедуры
//

Процедура КонтекстноеМенюВставитьКнопку(Элементы, ИмяКнопки, ИмяКоманды, ИмяКартинки, Элементы_ДокументыКСписаниюКонтекстноеМеню
	, КонтекстноеМеню_ПодчиненныеЭлементы, ИндексКнопкиПеред) Экспорт
Если ИндексКнопкиПеред = Неопределено Тогда	
	ЭлементПеред = Неопределено; 
Иначе	
	ЭлементПеред = КонтекстноеМеню_ПодчиненныеЭлементы.Получить(ИндексКнопкиПеред); 
КонецЕсли;

НовЭлемент = Элементы.Вставить(ИмяКнопки, Тип("КнопкаФормы"), Элементы_ДокументыКСписаниюКонтекстноеМеню, ЭлементПеред);

Если ЗначениеЗаполнено(ИмяКартинки) Тогда
	НоваяКартинка = БиблиотекаКартинок[ИмяКартинки]; 
	НовЭлемент.Картинка = НоваяКартинка;
КонецЕсли;

НовЭлемент.ИмяКоманды = ИмяКоманды; 
КонецПроцедуры

 Процедура ВставитьТабличныйДокумент(ИсходныйДокумент, ВставляемыйДокумент) Экспорт
   
    Для НомерСтроки = 1 По ВставляемыйДокумент.ВысотаТаблицы Цикл
        
        НачалоНовогоФорматаСтрок = ИсходныйДокумент.ВысотаТаблицы + 1;
        
        ОбластьПрямоугольная = ВставляемыйДокумент.Область(НомерСтроки, ,НомерСтроки);
        ИсходныйДокумент.ВставитьОбласть(ОбластьПрямоугольная, ИсходныйДокумент.Область(НачалоНовогоФорматаСтрок, 1));
        ИсходныйДокумент.Область(НачалоНовогоФорматаСтрок, ,НачалоНовогоФорматаСтрок).СоздатьФорматСтрок();
        
        СтрокаРезультатата = ВставляемыйДокумент.ПолучитьОбласть(НомерСтроки,,НомерСтроки);
        
        Если СтрокаРезультатата.ШиринаТаблицы = 0 Тогда
            СтрокаРезультатата = ВставляемыйДокумент.ПолучитьОбласть(НомерСтроки,1,НомерСтроки,1);
            ИсходныйДокумент.Область(НачалоНовогоФорматаСтрок,1).Текст = " ";
        КонецЕсли;
        
        Для Счетчик = 1 По Макс(СтрокаРезультатата.ШиринаТаблицы,1) Цикл
            ИсходныйДокумент.Область(НачалоНовогоФорматаСтрок, Счетчик).РастягиватьПоГоризонтали = СтрокаРезультатата.Область(1, Счетчик).РастягиватьПоГоризонтали;
            ИсходныйДокумент.Область(НачалоНовогоФорматаСтрок, Счетчик).ШиринаКолонки = СтрокаРезультатата.Область(1, Счетчик).ШиринаКолонки;
        КонецЦикла;
        
    КонецЦикла;
    
КонецПроцедуры                                          


Функция Сравнить_Две_Таблицы_Значений(ТЗn1, ТЗn2, КлючСортировки) Экспорт

   // Данный метод программно сравнивает две таблицы значений по всем признакам
  Если ТипЗнч(ТЗn1) <> Тип("ТаблицаЗначений")  Тогда
       Сообщить("Параметр N1 не является Таблицой значений");
       Возврат Ложь;
   КонецЕсли;

   Если ТипЗнч(ТЗn2) <> Тип("ТаблицаЗначений") Тогда
       Сообщить("Параметр N2 не является Таблицой значений");
       Возврат Ложь;
   КонецЕсли;

   Если ТЗn1.Количество() <> ТЗn2.Количество() Тогда
       Сообщить("Количество строк у таблиц значений различное");
       Возврат Ложь;
   КонецЕсли;

   Если ТЗn1.Колонки.Количество() <> ТЗn2.Колонки.Количество() Тогда
       Сообщить("Количество колонок у таблиц значений различное");
       Возврат Ложь;
   КонецЕсли;

   // Предварительно сортируем обе таблицы по одному и тому же уникальному ключу
  //ТЗn1.Сортировать("КатегорияНомера Возр");   // прим. УникКлюч - свой идентиф.
  //ТЗn2.Сортировать("КатегорияНомера Возр");
  ТЗn1.Сортировать(КлючСортировки + " Возр");   // прим. УникКлюч - свой идентиф.
  ТЗn2.Сортировать(КлючСортировки + " Возр");

   // Преобразуем
   СтрВнутрТЗn1 = ЗначениеВСтрокуВнутр(ТЗn1.Скопировать());
   СтрВнутрТЗn2 = ЗначениеВСтрокуВнутр(ТЗn2.Скопировать());

   Если СтрВнутрТЗn1 <> СтрВнутрТЗn2 Тогда
       Возврат Ложь;
   Иначе
       Возврат Истина;
   КонецЕсли;

КонецФункции

Функция УникальныйИдентификаторПустой() Экспорт
ГУИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
Возврат ГУИД;
КонецФункции
// ++++++++


