
Процедура ПриЗаписи(Отказ)
ОбновитьДопУслуги(ЭтотОбъект);	

Если ЭтотОбъект.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;

ОбновитьНоменклатураМиниБараГорничные(ЭтотОбъект);
КонецПроцедуры

Процедура ОбновитьДопУслуги(ТекущийОбъект)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.НоменклатураМинибара = &НоменклатураМинибара");	
Запрос.УстановитьПараметр("НоменклатураМинибара", ТекущийОбъект.Ссылка); 
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	ДопУслугиОбъект = Справочники.ДопУслуги.СоздатьЭлемент();
	
	ДопУслугиОбъект.НоменклатураМинибара = ТекущийОбъект.Ссылка;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДопУслуги.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ДопУслуги КАК ДопУслуги
	                      |ГДЕ
	                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
	                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
	                      |	И ДопУслуги.ПрограммныйКод = ЗНАЧЕНИЕ(Перечисление.ПрограммныйКодУслуги.Минибар)");	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Родитель_П = Выборка.Ссылка;
	Иначе
		Родитель_П = Неопределено;
	КонецЕсли;	
	ДопУслугиОбъект.Родитель = Родитель_П;
	
	ДопУслугиОбъект.Наименование = ТекущийОбъект.Наименование;
	ДопУслугиОбъект.Цена = ТекущийОбъект.Цена;
	ДопУслугиОбъект.НазваниеДляЧека = "---";

Иначе
	ДопУслугиОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
	
	ДопУслугиОбъект.Наименование = ТекущийОбъект.Наименование;
	ДопУслугиОбъект.Цена = ТекущийОбъект.Цена;
КонецЕсли;

ДопУслугиОбъект.ПометкаУдаления = ТекущийОбъект.ПометкаУдаления;

ДопУслугиОбъект.Записать();
КонецПроцедуры

Процедура ОбновитьНоменклатураМиниБараГорничные(ТекущийОбъект)
ОбменСГорничными = Константы.ОбменСГорничными.Получить();	
Если НЕ ОбменСГорничными Тогда Возврат; КонецЕсли; 
	
Соединение = ОбменГорничныеСервер.Соединение();
Если Соединение = Неопределено Тогда Возврат; КонецЕсли;

НоменклатураМиниБараДанные = Новый Структура;
НоменклатураМиниБараДанные.Вставить("Код", ТекущийОбъект.Код);
НоменклатураМиниБараДанные.Вставить("Наименование", ТекущийОбъект.Наименование);
НоменклатураМиниБараДанные.Вставить("ПометкаУдаления", ТекущийОбъект.ПометкаУдаления);
НоменклатураМиниБараДанные.Вставить("НеИспользуется", ТекущийОбъект.НеИспользуется);
//НоменклатураМиниБараДанные.Вставить("Сортировка", ТекущийОбъект.Сортировка);

Попытка 
	Соединение.ОбменГорничныеСервер.ОбновитьНоменклатураМиниБараГорничные(НоменклатураМиниБараДанные);
Исключение
	Сообщить("Ошибка записи в БД Горничные. ОбновитьНоменклатураМиниБараГорничные. " + ОписаниеОшибки());   	
КонецПопытки;

КонецПроцедуры

