//
Процедура КнопкаСформироватьНажатие__(Кнопка)
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//Макет=ПолучитьМакет("Макет");
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//ЗапросРаз=Новый Запрос("ВЫБРАТЬ
	//                       |	ВложенныйЗапрос.Клиент,
	//                       |	ВложенныйЗапрос.Ссылка,
	//                       |	ВложенныйЗапрос.Клиент КАК Клиент1,
	//                       |	ВложенныйЗапрос.Ссылка КАК Ссылка1
	//                       |ИЗ
	//                       |	(ВЫБРАТЬ
	//                       |		ЗаявкаНаБронирование.Клиент КАК Клиент,
	//                       |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК Ссылка
	//                       |	ИЗ
	//                       |		Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                       |	ГДЕ
	//                       |		ЗаявкаНаБронирование.Статус = &Статус
	//                       |	
	//                       |	СГРУППИРОВАТЬ ПО
	//                       |		ЗаявкаНаБронирование.Клиент) КАК ВложенныйЗапрос
	//                       |ГДЕ
	//                       |	ВложенныйЗапрос.Ссылка > 1");
	//					   
	//ЗапросРаз.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Выехал);					   
	//ТЗРаз=ЗапросРаз.Выполнить().Выгрузить();
	//
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//                    |	ЗаявкаНаБронирование.Ссылка,
	//                    |	РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Клиент.ДатаРождения, &ДатаТек, ГОД) КАК Возраст
	//                    |ИЗ
	//                    |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                    |ГДЕ
	//                    |	ЗаявкаНаБронирование.Ссылка В
	//                    |			(ВЫБРАТЬ
	//                    |				ЗанятостьНомеров.Регистратор
	//                    |			ИЗ
	//                    |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//                    |			ГДЕ
	//                    |				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//                    |				И ЗанятостьНомеров.Зарезервирован = ИСТИНА)
	//                    |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	//                    |	И ЗаявкаНаБронирование.Тариф <> &Тариф
	//                    |	И ЗаявкаНаБронирование.Тариф <> &Тариф2
	//                    |	И ЗаявкаНаБронирование.Тариф <> &Тариф3
	//                    |	И ЗаявкаНаБронирование.Тариф <> &Тариф4
	//                    |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
	//                    |
	//                    |УПОРЯДОЧИТЬ ПО
	//                    |	ЗаявкаНаБронирование.РезервС");
	//Запрос.УстановитьПараметр("ДН",НачалоДня(ДН));						
	//Запрос.УстановитьПараметр("ДК",КонецДня(ДК));
	//Запрос.УстановитьПараметр("ДатаТек",ТекущаяДата());

	//Запрос.УстановитьПараметр("Тариф",Справочники.Тариф.НайтиПоКоду("000000400"));
	//Запрос.УстановитьПараметр("Тариф2",Справочники.Тариф.НайтиПоКоду("000000323"));
	//Запрос.УстановитьПараметр("Тариф3",Справочники.Тариф.НайтиПоКоду("000000325"));
	//Запрос.УстановитьПараметр("Тариф4",Справочники.Тариф.НайтиПоКоду("000000324"));
	//Запрос.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));


	//
	//ТЗ=Запрос.Выполнить().Выгрузить();
	//сч=1;
	//Для каждого Стр Из ТЗ Цикл
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	//Но	ФИО	ДатаЗ	ДатаВ	Суток	Комент
	//	ПоискКол=ТЗРаз.Найти(Стр.Ссылка.Клиент,"Клиент");
	//	Обл.Параметры.Повт=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
	//    Обл.Параметры.НомерОтеля=Строка(Стр.Ссылка.НомерВРезерв);
	//	Обл.Параметры.Но=Строка(Сч);
	//	сч=сч+1;
	//	Обл.Параметры.ФИО=Строка(Стр.Ссылка.Клиент);
	//	Обл.Параметры.Бронирует=Строка(Стр.Ссылка.Бронирует);
	//	Обл.Параметры.Источник=Строка(Стр.Ссылка.Источник);
	//	Обл.Параметры.Канал=Строка(Стр.Ссылка.Бронирует.ВидКлиента);

	//	
	//	Обл.Параметры.ДатаР=Формат(Стр.Ссылка.Клиент.ДатаРождения, "ДФ=dd.MM.yy");
	//	Обл.Параметры.Возраст=Стр.Возраст;
	//	Обл.Параметры.Пол=Строка(Стр.Ссылка.Клиент.Пол);
	//	Обл.Параметры.Город=Строка(Стр.Ссылка.Клиент.СтранаПроживания + " " +Стр.Ссылка.Клиент.ГородПроживания);  
	//	Обл.Параметры.ДатаЗ=Формат(Стр.Ссылка.РезервС, "ДФ=dd.MM.yy");
	//	Обл.Параметры.ДатаВ=Формат(Стр.Ссылка.РезервПо, "ДФ=dd.MM.yy");
	//	//Политов
	////	КолвоДнейВПериоде=Мин(Стр.Ссылка.РезервПо,ДК)-Макс(Стр.Ссылка.РезервС,ДН);
	//	КолвоДнейВПериоде=Мин(КонецДня(Стр.Ссылка.РезервПо),КонецДня(ДК))-Макс(НачалоДня(Стр.Ссылка.РезервС),НачалоДня(ДН));
	//	///Политов
	//	КолвоДнейВПериоде=Окр(КолвоДнейВПериоде/86400);
	//	Если КонецДня(Стр.Ссылка.РезервПо)=КонецДня(ДН) тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Обл.Параметры.Суток=Строка(Мин(Стр.Ссылка.КолВо,КолвоДнейВПериоде));
	//	СтрКом="";
	//	Для каждого Комм Из Стр.Ссылка.ДопПожелания Цикл
	//		СтрКом=СтрКом+" "+Комм.Информация; 
	//	КонецЦикла; 
	//	Обл.Параметры.Комент=СокрЛП(СтрКом);
	//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//КонецЦикла; 
    
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
ПолеОтчета.Очистить();

ОтчетОбъект = РеквизитФормыВЗначение("Отчет");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.ТипБронирования <> &ТипРемонт
                      |	И ЗаявкаНаБронирование.Ссылка В
                      |			(ВЫБРАТЬ
                      |				ЗанятостьНомеров.Регистратор
                      |			ИЗ
                      |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                      |			ГДЕ
                      |				ЗанятостьНомеров.ПериодРезерва > &ДН
                      |				И ЗанятостьНомеров.ПериодРезерва < &ДК
                      |				И ЗанятостьНомеров.Зарезервирован = ИСТИНА)
                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
                      |	И ЗаявкаНаБронирование.Клиент.ВидКлиента <> &ВидКлиента
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ЗаявкаНаБронирование.ВремяЗаездаТочное");

					  //|				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК

Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));						
Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
Запрос.УстановитьПараметр("ДатаТек",НачалоДня(ТекущаяДата()));
Запрос.УстановитьПараметр("ВидКлиента",Справочники.ВидыКлиентов.НайтиПоНаименованию("Исключить из отчетов"));
Запрос.УстановитьПараметр("ТипРемонт", Справочники.ТипБронирования.Ремонт);						

ТЗ_Данные = Запрос.Выполнить().Выгрузить();

ЗаполнитьКаналыБронирования();

ЗаполнитьИсточникиБронирования();

КоличествоПроживанийИтого = 0;
КоличествоСутокВПериодеИтого = 0;
КоличествоЧеловекНочейИтого = 0;

Для Каждого Строка Из ТЗ_Данные Цикл
	
	КоличествоСутокВПериоде = 0;
	Для каждого СтрокаПроживание Из Строка.Ссылка.Проживание Цикл
		Если СтрокаПроживание.ДеньПроживания < Отчет.ДН ИЛИ СтрокаПроживание.ДеньПроживания > Отчет.ДК
		Тогда Продолжить; КонецЕсли;
		
		КоличествоСутокВПериоде = КоличествоСутокВПериоде + СтрокаПроживание.Количество; 
	КонецЦикла;
	КоличествоСутокВПериодеИтого = КоличествоСутокВПериодеИтого + КоличествоСутокВПериоде; 
	Если КоличествоСутокВПериоде > 0 Тогда КоличествоПроживанийИтого = КоличествоПроживанийИтого + 1; КонецЕсли;
	
	КоличествоЧеловекНочей = Строка.Ссылка.КолВоЧеловек * КоличествоСутокВПериоде;  
	КоличествоЧеловекНочейИтого = КоличествоЧеловекНочейИтого + КоличествоЧеловекНочей;  
//
	Если КоличествоСутокВПериоде > 0 Тогда
		
		ОтборСтроки = Новый Структура("КаналБронирования", Строка.Ссылка.КаналБронирования);
		НайденныеСтроки = КаналыБронирования.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			НайденнаяСтрока = НайденныеСтроки[0]; 			
			
			НайденнаяСтрока.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний + 1;		
			НайденнаяСтрока.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей + КоличествоСутокВПериоде;		
		КонецЕсли;		
		
		ОтборСтроки = Новый Структура("ИсточникБронирования", Строка.Ссылка.ТипБронирования);
		НайденныеСтроки = ИсточникиБронирования.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			НайденнаяСтрока = НайденныеСтроки[0]; 			
			
			НайденнаяСтрока.КоличествоПроживаний = НайденнаяСтрока.КоличествоПроживаний + 1;		
			НайденнаяСтрока.КоличествоНомеровНочей = НайденнаяСтрока.КоличествоНомеровНочей + КоличествоСутокВПериоде;		
		КонецЕсли;		
	КонецЕсли;		
КонецЦикла;

//МассивКУдалению = Новый Массив;
//Для Каждого Строка Из КаналыБронирования Цикл
//	Если Строка.КоличествоПроживаний = 0 Тогда
//		МассивКУдалению.Добавить(Строка);
//	КонецЕсли;
//КонецЦикла;

//Для Каждого Строка Из МассивКУдалению Цикл
//	КаналыБронирования.Удалить(Строка);
//КонецЦикла;

//МассивКУдалению = Новый Массив;
//Для Каждого Строка Из ИсточникиБронирования Цикл
//	Если Строка.КоличествоПроживаний = 0 Тогда
//		МассивКУдалению.Добавить(Строка);
//	КонецЕсли;
//КонецЦикла;

//Для Каждого Строка Из МассивКУдалению Цикл
//	ИсточникиБронирования.Удалить(Строка);
//КонецЦикла;


//
МакетИмя = "МакетОсновной";
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

ОбластьШапка = Макет.ПолучитьОбласть("ИсточникШапка");
ПолеОтчета.Вывести(ОбластьШапка);
Для Каждого СтрокаИсточникиБронирования Из ИсточникиБронирования Цикл
	Обл=Макет.ПолучитьОбласть("ИсточникСтрока");
	Обл.Параметры.ИсточникБронирования = СтрокаИсточникиБронирования.ИсточникБронирования;
	Обл.Параметры.КоличествоПроживанийИсточник = СтрокаИсточникиБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейИсточник= СтрокаИсточникиБронирования.КоличествоНомеровНочей;

	Обл.Параметры.Процент = Окр((СтрокаИсточникиБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	
	ПолеОтчета.Вывести(Обл);
КонецЦикла;

ОбластьШапка = Макет.ПолучитьОбласть("КаналШапка");
ПолеОтчета.Вывести(ОбластьШапка);
Для Каждого СтрокаКаналыБронирования Из КаналыБронирования Цикл
	Обл=Макет.ПолучитьОбласть("КаналСтрока");
	Обл.Параметры.КаналБронирования = СтрокаКаналыБронирования.КаналБронирования;
	Обл.Параметры.КоличествоПроживанийКанал = СтрокаКаналыБронирования.КоличествоПроживаний;
	Обл.Параметры.КоличествоНомеровНочейКанал = СтрокаКаналыБронирования.КоличествоНомеровНочей;

	Обл.Параметры.Процент = Окр((СтрокаКаналыБронирования.КоличествоПроживаний / КоличествоПроживанийИтого) * 100);
	
	ПолеОтчета.Вывести(Обл);
КонецЦикла;		

КонецПроцедуры

&НаСервере
Функция ЗаполнитьКаналыБронирования()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КаналыБронирования.Ссылка КАК КаналБронирования
                      |ИЗ
                      |	Справочник.КаналыБронирования КАК КаналыБронирования
                      |ГДЕ
                      |	КаналыБронирования.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КаналыБронирования.СортировкаОтчет,
                      |	КаналыБронирования.Наименование");	

ТЗ = Запрос.Выполнить().Выгрузить();

КаналыБронирования.Очистить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = КаналыБронирования.Добавить();
	НоваяСтрока.КаналБронирования = Строка.КаналБронирования;
КонецЦикла;
КонецФункции

&НаСервере
Функция ЗаполнитьИсточникиБронирования()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ТипБронирования.Ссылка КАК ТипБронированияСсылка,
                      |	ТипБронирования.Наименование КАК Наименование
                      |ИЗ
                      |	Справочник.ТипБронирования КАК ТипБронирования
                      |ГДЕ
                      |	ТипБронирования.ПометкаУдаления = ЛОЖЬ
                      |	И ТипБронирования.Ссылка <> &ТипРемонт
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ТипБронирования.Номер_пп,
                      |	ТипБронирования.Наименование");	

Запрос.УстановитьПараметр("ТипРемонт", Справочники.ТипБронирования.Ремонт);

ТЗ = Запрос.Выполнить().Выгрузить();

ИсточникиБронирования.Очистить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ИсточникиБронирования.Добавить();
	НоваяСтрока.ИсточникБронирования = Строка.ТипБронированияСсылка;
	НоваяСтрока.Наименование = Строка.Наименование;
КонецЦикла;

КонецФункции





