
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр(); 
	
ЗапрещенныеПоля = Новый Массив;
ЗапрещенныеПоля.Добавить("ПолнаяПапка");
	
Список.УстановитьОграниченияИспользованияВГруппировке(ЗапрещенныеПоля);
Список.УстановитьОграниченияИспользованияВОтборе(ЗапрещенныеПоля);
Список.УстановитьОграниченияИспользованияВПорядке(ЗапрещенныеПоля);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
МассивСтрок = Строки.ПолучитьКлючи();
Для Каждого КлючСтроки Из МассивСтрок Цикл
	СтрокаДинСписка = Строки[КлючСтроки];   
	
	ТекущийРодитель = "";
	ОбщийФункционалСервер.ПолнаяПапкаРодитель(СтрокаДинСписка.Данные.Ссылка, ТекущийРодитель);
	ПолнаяПапкаРодитель = ТекущийРодитель;
	СтрокаДинСписка.Данные["ПолнаяПапка"] = ПолнаяПапкаРодитель;
	
КонецЦикла;
КонецПроцедуры

