// Создаёт новое Cоединение c сервером ККМ
//
// Параметры:
//	Соединение - Структура - Возвращаемое соединение с сервером ККМ
//	Адрес - Строка - Адрес сервера ККМ, например: 10.1.3.56
//	ИмяПользователя - Строка - Имя пользователя, например: admin
//	ПарольПользователя - Строка - Пароль пользователя, например: puPW0Mag2QmMXk7w
Функция СоздатьСоединение(Знач Адрес, Знач Порт = 4398, Знач ИдУстройства = Неопределено, Знач ИмяПользователя = "Admin", Знач ПарольПользователя = "Admin") Экспорт  
	Попытка
		ПроверитьПараметр("СерверККМ.СоздатьСоединение", "Адрес", Адрес, Тип("Строка")); 
		ПроверитьПараметр("СерверККМ.СоздатьСоединение", "Порт", Порт, Тип("Число")); 
		ПроверитьПараметр("СерверККМ.СоздатьСоединение", "ИдУстройства", ИдУстройства, Тип("Строка")); 
		ПроверитьПараметр("СерверККМ.СоздатьСоединение", "ИмяПользователя", ИмяПользователя, Тип("Строка")); 
		ПроверитьПараметр("СерверККМ.СоздатьСоединение", "ПарольПользователя", ПарольПользователя, Тип("Строка")); 
		Параметры = Новый Структура("Адрес,Порт,ИдУстройства,ИмяПользователя,ПарольПользователя", 
									 Адрес,Порт,ИдУстройства,ИмяПользователя,ПарольПользователя);
		Возврат Новый Структура("Параметры,Токен,Ошибка,Описание", Параметры, Новый Структура("Идентификатор,ВремяИстечения", Неопределено, Неопределено), Ложь, "");
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// Возвращает структуру параметров ДанныеККМ
// https://docs.rbsoft.ru/serverkkm/razrab/JSON_API/article.html#getdatakkt-%D0%BF%D0%BE%D0%BB%D1%83%D1%87%D0%B5%D0%BD%D0%B8%D0%B5-%D0%BF%D0%B0%D1%80%D0%B0%D0%BC%D0%B5%D1%82%D1%80%D0%BE%D0%B2-%D0%BA%D0%BA%D0%BC
//
// Параметры:
//	Соединение - Структура - данные соединения; 
//	ДанныеККМ - Структура - Возвращаемые данные ККМ; 
Функция ПолучитьДанныеККМ(Соединение)  Экспорт	

	Попытка
		Если ТипЗнч(Соединение) <> Тип("Структура") ИЛИ НЕ Соединение.Свойство("Токен") ИЛИ НЕ Соединение.Свойство("Параметры") Тогда
			ВызватьИсключение "Ошибка параметра функции Соединение: Отсутствуют данные соединения";
		КонецЕсли;
		
		ОбновитьТокен(Соединение);
		
		r = ВыполнитьЗапрос(Соединение, "GetDataKKT", Новый Структура("Token,DeviceName", Соединение.Токен.Идентификатор, Соединение.Параметры.ИдУстройства));
		Если r.Code = 0 Тогда
			Возврат Новый Структура("ДанныеККМ,Ошибка,Описание", r.Result, Ложь, "");
		Иначе
			ВызватьИсключение "Ошибка запроса: " + r.Description;
		КонецЕсли;
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

// Возвращает структуру описания текущего состояния смены ДанныеСмены
// Поля структуры
//    SessionState: целое, (1 - смена закрыта, 2 - смена открыта, 3 - смена истекла)
//	  SessionNumber: целое, номер смены
// https://docs.rbsoft.ru/serverkkm/razrab/JSON_API/article.html#getcurrentstatus-%D0%BF%D0%BE%D0%BB%D1%83%D1%87%D0%B5%D0%BD%D0%B8%D0%B5-%D1%82%D0%B5%D0%BA%D1%83%D1%89%D0%B5%D0%B3%D0%BE-%D1%81%D0%BE%D1%81%D1%82%D0%BE%D1%8F%D0%BD%D0%B8%D1%8F-%D0%BA%D0%BA%D0%BC
//
// Параметры:
//	Соединение - Структура - данные соединения; 
//	ДанныеСмены - Структура - Возвращаемые данные смены; 
Функция ПолучитьДанныеСмены(Соединение) Экспорт	

	Попытка
		Если ТипЗнч(Соединение) <> Тип("Структура") ИЛИ НЕ Соединение.Свойство("Токен") ИЛИ НЕ Соединение.Свойство("Параметры") Тогда
			ВызватьИсключение "Ошибка параметра функции Соединение: Отсутствуют данные соединения";
		КонецЕсли;
		
		ОбновитьТокен(Соединение);
		
		r = ВыполнитьЗапрос(Соединение, "GetCurrentStatus", Новый Структура("Token,DeviceName", Соединение.Токен.Идентификатор, Соединение.Параметры.ИдУстройства));
		Если r.Code = 0 Тогда
			Возврат Новый Структура("ДанныеСмены,Ошибка,Описание", r.Result, Ложь, "");
		Иначе
			ВызватьИсключение "Ошибка запроса: " + r.Description;
		КонецЕсли;
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции


// Открывает смену ККМ, возвращает код ошибки 0, 
// в случае успеха возвращает ДанныеОткрытияСмены, содержащую детальную информацию
// https://docs.rbsoft.ru/serverkkm/razrab/JSON_API/article.html#openshift-%D0%BE%D1%82%D0%BA%D1%80%D1%8B%D1%82%D0%B8%D0%B5-%D1%81%D0%BC%D0%B5%D0%BD%D1%8B
//
// Параметры:
//	Соединение - Структура - данные соединения; 
//	ДанныеСмены - Структурв - (опцинно) Возвращаемые данные смены; 
Функция ОткрытьСмену(Соединение)  Экспорт	

	Попытка
		Если ТипЗнч(Соединение) <> Тип("Структура") ИЛИ НЕ Соединение.Свойство("Токен") ИЛИ НЕ Соединение.Свойство("Параметры") Тогда
			ВызватьИсключение "Ошибка параметра функции Соединение: Отсутствуют данные соединения";
		КонецЕсли;
		
		ОбновитьТокен(Соединение);
		
		r = ВыполнитьЗапрос(Соединение, "OpenShift", Новый Структура("Token,DeviceName", Соединение.Токен.Идентификатор, Соединение.Параметры.ИдУстройства));
		Если r.Code = 0 Тогда
			Возврат Новый Структура("ДанныеоткрытияСмены,Ошибка,Описание", r.Result, Ложь, "");
		Иначе
			ВызватьИсключение "Ошибка запроса: " + r.Description;
		КонецЕсли;
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

// Закрывает смену ККМ, возвращает код ошибки 0, 
// в случае успеха возвращает структуру ДанныеЗакрытияСмены, содержащую детальную информацию
// https://docs.rbsoft.ru/serverkkm/razrab/JSON_API/article.html#closeshift-%D0%B7%D0%B0%D0%BA%D1%80%D1%8B%D1%82%D0%B8%D0%B5-%D0%BA%D0%B0%D1%81%D1%81%D0%BE%D0%B2%D0%BE%D0%B9-%D1%81%D0%BC%D0%B5%D0%BD%D1%8B
//
// Параметры:
//	Соединение - Структура - данные соединения; 
//	ДанныеСмены - Структурв - (опцинно) Возвращаемые данные смены; 
Функция ЗакрытьСмену(Соединение)  Экспорт	

	Попытка
		Если ТипЗнч(Соединение) <> Тип("Структура") ИЛИ НЕ Соединение.Свойство("Токен") ИЛИ НЕ Соединение.Свойство("Параметры") Тогда
			ВызватьИсключение "Ошибка параметра функции Соединение: Отсутствуют данные соединения";
		КонецЕсли;
		
		ОбновитьТокен(Соединение);
		
		r = ВыполнитьЗапрос(Соединение, "CloseShift", Новый Структура("Token,DeviceName", Соединение.Токен.Идентификатор, Соединение.Параметры.ИдУстройства));
		Если r.Code = 0 Тогда
			Возврат Новый Структура("ДанныеЗакрытияСмены,Ошибка,Описание", r.Result, Ложь, "");
		Иначе
			ВызватьИсключение "Ошибка запроса: " + r.Description;
		КонецЕсли;
	Исключение
		Возврат Новый Структура("Ошибка,Описание", Истина, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьЗапрос(Соединение, ИмяМетода, Параметры)
	HTTP = Новый HTTPСоединение(Соединение.Параметры.Адрес, Соединение.Параметры.Порт);
	Заголовки = Новый Соответствие;
	ЗапросHTTP = Новый HTTPЗапрос("/PrintService/api/v2/" + ИмяМетода, Заголовки);
    СтрокаJSON = ПолучитьСтрокуJSON(Параметры);
	Заголовки.Вставить("Content-Type", "application/json");
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON);
	ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP);
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ОтветHTTP.ПолучитьТелоКакСтроку());
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	HTTP = Неопределено;
	Возврат Результат;
КонецФункции

Процедура ОбновитьТокен(Соединение)
	Если Соединение.Токен.Идентификатор = Неопределено ИЛИ Соединение.Токен.ВремяИстечения < ТекущаяДата() Тогда
		r = ВыполнитьЗапрос(Соединение, "GetToken", Новый Структура("login,password", Соединение.Параметры.ИмяПользователя, Соединение.Параметры.ПарольПользователя));
		Если r.Code = 0 Тогда
			Соединение.Токен.Идентификатор = r.Result.tokenId;
			Соединение.Токен.ВремяИстечения = Дата(r.Result.expire);
		Иначе
			ВызватьИсключение "Ошибка запроса: " + r.Description;
		КонецЕсли;
	КонецЕсли
КонецПроцедуры

Функция ПолучитьСтрокуJSON(Объект)
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Объект);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

// Вызывает исключение, если тип значения параметра ИмяПараметра процедуры или функции ИмяПроцедурыИлиФункции
// отличается от ожидаемого.
// Для быстрой диагностики типов параметров, передаваемых в процедуры и функции программного интерфейса.
//
// В связи с особенностью реализации ОписанияТипов всегда включает в себя тип <Неопределено>.
// если требуется жесткая проверка типа, используйте в параметре ОжидаемыеТипы 
// конкретный тип, массив или соответствие типов.
//
// Параметры:
//   ИмяПроцедурыИлиФункции - Строка - имя процедуры или функции, параметр которой проверяется.
//   ИмяПараметра - Строка - имя проверяемого параметра процедуры или функции.
//   ЗначениеПараметра - Произвольный - фактическое значение параметра.
//   ОжидаемыеТипы - ОписаниеТипов, Тип, Массив, ФиксированныйМассив, Соответствие, ФиксированноеСоответствие - тип(ы)
//       параметра процедуры или функции.
//   ОжидаемыеТипыСвойств - Структура - если ожидаемый тип - структура, то 
//       в этом параметре можно указать типы ее свойств.
//
Процедура ПроверитьПараметр(Знач ИмяПроцедурыИлиФункции, Знач ИмяПараметра, Знач ЗначениеПараметра, 
	Знач ОжидаемыеТипы, Знач ОжидаемыеТипыСвойств = Неопределено, Знач ОжидаемыйШаблон = Неопределено) 
	
	Контекст = "ОбщегоНазначенияКлиентСервер.ПроверитьПараметр";
	
	Проверить(
		ТипЗнч(ИмяПроцедурыИлиФункции) = Тип("Строка"), 
		НСтр("ru = 'Недопустимое значение параметра ИмяПроцедурыИлиФункции'"), 
		Контекст);
	
	Проверить(
		ТипЗнч(ИмяПараметра) = Тип("Строка"), 
		НСтр("ru = 'Недопустимое значение параметра ИмяПараметра'"), 
		Контекст);
	
	ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеПараметра, ОжидаемыеТипы);
	
	Проверить(
		ЭтоКорректныйТип <> Неопределено, 
		НСтр("ru = 'Недопустимое значение параметра ОжидаемыеТипы'"), 
		Контекст);
	
	Проверить(
		ЭтоКорректныйТип,
		ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недопустимое значение параметра %1 в %2. 
			           |Ожидалось: %3; передано значение: %4 (тип %5).'"),
			ИмяПараметра,
			ИмяПроцедурыИлиФункции,
			ПредставлениеТипов(ОжидаемыеТипы), 
			?(ЗначениеПараметра <> Неопределено, 
				ЗначениеПараметра, 
				НСтр("ru = 'Неопределено'")),
		ТипЗнч(ЗначениеПараметра)));
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") И ОжидаемыйШаблон <> Неопределено Тогда
		RegExp = Новый COMОбъект("VBScript.RegExp");
		RegExp.Pattern = Строка(ОжидаемыйШаблон);
		Если Не RegExp.Test(ЗначениеПараметра) Тогда
			ТекстИсключения = ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недопустимое значение параметра %1 в %2. 
			           |Ожидалось строка, соответствующая шаблону: %3; передано значение: %4.'"),
				ИмяПараметра,
				ИмяПроцедурыИлиФункции,
				Строка(ОжидаемыйШаблон), 
				ЗначениеПараметра);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		RegExp = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") И ОжидаемыеТипыСвойств <> Неопределено Тогда
		
		Проверить(
			ТипЗнч(ОжидаемыеТипыСвойств) = Тип("Структура"), 
			НСтр("ru = 'Недопустимое значение параметра ИмяПроцедурыИлиФункции'"), 
			Контекст);
		
		Для каждого Свойство Из ОжидаемыеТипыСвойств Цикл
			
			ОжидаемоеИмяСвойства = Свойство.Ключ;
			ОжидаемыйТипСвойства = Свойство.Значение;
			ЗначениеСвойства = Неопределено;
			
			Проверить(
				ЗначениеПараметра.Свойство(ОжидаемоеИмяСвойства, ЗначениеСвойства), 
				ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимое значение параметра %1 (Структура) в %2. 
					           |В структуре ожидалось свойство %3 (тип %4).'"), 
					ИмяПараметра, 
					ИмяПроцедурыИлиФункции, 
					ОжидаемоеИмяСвойства, 
					ОжидаемыйТипСвойства));
			
			ЭтоКорректныйТип = ЗначениеОжидаемогоТипа(ЗначениеСвойства, ОжидаемыйТипСвойства);
			
			Проверить(
				ЭтоКорректныйТип, 
				ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Недопустимое значение свойства %1 в параметре %2 (Структура) в %3. 
					           |Ожидалось: %4; передано значение: %5 (тип %6).'"), 
					ОжидаемоеИмяСвойства,
					ИмяПараметра,
					ИмяПроцедурыИлиФункции,
					ПредставлениеТипов(ОжидаемыеТипы), 
					?(ЗначениеСвойства <> Неопределено, 
						ЗначениеСвойства, 
						НСтр("ru = 'Неопределено'")),
				ТипЗнч(ЗначениеСвойства)));
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   Условие - Булево - если не равно Истина, то вызывается исключение.
//   КонтекстПроверки - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//   Сообщение - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по умолчанию.
//
Процедура Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "")
	
	Если Условие <> Истина Тогда
		
		Если ПустаяСтрока(Сообщение) Тогда
			ТекстИсключения = НСтр("ru = 'Недопустимая операция'"); // Assertion failed
		Иначе
			ТекстИсключения = Сообщение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(КонтекстПроверки) Тогда
			ТекстИсключения = ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 в %2'"), 
				ТекстИсключения, 
				КонтекстПроверки);
		КонецЕсли;
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеОжидаемогоТипа(Значение, ОжидаемыеТипы)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗнч(ОжидаемыеТипы) = Тип("ОписаниеТипов") Тогда
		
		Возврат ОжидаемыеТипы.СодержитТип(ТипЗначения);
		
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Тип") Тогда
		
		Возврат ТипЗначения = ОжидаемыеТипы;
		
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Массив") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив") Тогда
		
		Возврат ОжидаемыеТипы.Найти(ТипЗначения) <> Неопределено;
		
	ИначеЕсли ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие") 
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		
		Возврат ОжидаемыеТипы.Получить(ТипЗначения) <> Неопределено;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеТипов(ОжидаемыеТипы)
	
	Если ТипЗнч(ОжидаемыеТипы) = Тип("Массив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированныйМассив")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
		Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда
		
		Результат = "";
		Индекс = 0;
		Для Каждого Элемент Из ОжидаемыеТипы Цикл
			
			Если ТипЗнч(ОжидаемыеТипы) = Тип("Соответствие")
				Или ТипЗнч(ОжидаемыеТипы) = Тип("ФиксированноеСоответствие") Тогда 
				
				Тип = Элемент.Ключ;
			Иначе 
				Тип = Элемент;
			КонецЕсли;
			
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + ", ";
			КонецЕсли;
			
			Результат = Результат + ПредставлениеТипа(Тип);
			Индекс = Индекс + 1;
			Если Индекс > 10 Тогда
				Результат = ПодставитьПараметрыВСтроку(
					НСтр("ru='%1,... (всего %2 типов)'"), 
					Результат, 
					ОжидаемыеТипы.Количество());
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Результат;
		
	Иначе 
		Возврат ПредставлениеТипа(ОжидаемыеТипы);
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеТипа(Тип)
	
	Если Тип = Неопределено Тогда
		
		Возврат "Неопределено";
		
	ИначеЕсли ТипЗнч(Тип) = Тип("ОписаниеТипов") Тогда
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				ПодставитьПараметрыВСтроку(
					НСтр("ru='%1,... (всего %2 типов)'"),
					Лев(ТипСтрокой, 150),
					Тип.Типы().Количество()), 
				ТипСтрокой);
		
	Иначе
		
		ТипСтрокой = Строка(Тип);
		Возврат 
			?(СтрДлина(ТипСтрокой) > 150, 
				Лев(ТипСтрокой, 150) + "...", 
				ТипСтрокой);
		
	КонецЕсли;
	
КонецФункции

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  ШаблонСтроки  - Строка - шаблон строки с параметрами (вхождениями вида "%<номер параметра>", 
//                           например "%1 пошел в %2");
//  Параметр<n>   - Строка - значение подставляемого параметра.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел
//  в Зоопарк".
//
Функция ПодставитьПараметрыВСтроку(Знач ШаблонСтроки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) 
	
	ЕстьПараметрыСПроцентом = СтрНайти(Параметр1, "%")
		Или СтрНайти(Параметр2, "%")
		Или СтрНайти(Параметр3, "%")
		Или СтрНайти(Параметр4, "%")
		Или СтрНайти(Параметр5, "%")
		Или СтрНайти(Параметр6, "%")
		Или СтрНайти(Параметр7, "%")
		Или СтрНайти(Параметр8, "%")
		Или СтрНайти(Параметр9, "%");
		
	Если ЕстьПараметрыСПроцентом Тогда
		Возврат ПодставитьПараметрыСПроцентом(ШаблонСтроки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	КонецЕсли;
	
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%2", Параметр2);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%3", Параметр3);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%4", Параметр4);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%5", Параметр5);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%6", Параметр6);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%7", Параметр7);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%8", Параметр8);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%9", Параметр9);
	Возврат ШаблонСтроки;
	
КонецФункции

// Вставляет параметры в строку, учитывая, что в параметрах могут использоваться подстановочные слова %1, %2 и т.д.
Функция ПодставитьПараметрыСПроцентом(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = СтрНайти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = Неопределено;
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр = Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр = Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр = Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр = Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр = Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр = Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр = Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр = Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр = Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = Неопределено Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = СтрНайти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
КонецФункции


