
Функция ЗаявкаКЗакрытию(ЗаявкаОбъект, ВызовИзЗаявки) Экспорт
Результат = Новый Структура("ЗаявкаКЗакрытию", Истина);
Результат.Вставить("ОшибкаОписание", "");
		
СуммаПроживание = ЗаявкаОбъект.Проживание.Итог("Сумма"); 

СуммаДопУслуги = 0;
Для Каждого СтрокаДопУслуги Из ЗаявкаОбъект.ДопУслуги Цикл
	Если НЕ СтрокаДопУслуги.ВСчет Тогда Продолжить; КонецЕсли;
	
	СуммаДопУслуги = СуммаДопУслуги + СтрокаДопУслуги.Цена * СтрокаДопУслуги.Количество;
КонецЦикла;

ИтогоДолг = СуммаПроживание + СуммаДопУслуги;

ИтогоОплаты = ЗаявкаОбъект.СчетаДетальноОплаты.Итог("СуммаРаспределено"); 

ОшибочныйДокументОплаты = Ложь;
Для Каждого Строка Из ЗаявкаОбъект.СчетаДетальноОплаты Цикл
	ОплатаОбъект = Строка.ДокументОплаты.ПолучитьОбъект();
	Если ОплатаОбъект = Неопределено Тогда
		ОшибочныйДокументОплаты = Истина;		
		
		Прервать;
	КонецЕсли;
КонецЦикла;

ИтогоОплатыНеРавноИтогоДолг = (ИтогоОплаты <> ИтогоДолг);

Если ВызовИзЗаявки Тогда
	Разделитель = " ";
Иначе	
	Разделитель = Символы.ПС;
КонецЕсли;

Текст = "";
Если ИтогоОплатыНеРавноИтогоДолг Тогда 
	Текст = ОбщийФункционалКлиентСервер.ДобавитьТекст(
		Текст, "ВНИМАНИЕ ! Сумма за проживание и услуги <> Сумме оплат.", Разделитель); 
КонецЕсли;		

Если ОшибочныйДокументОплаты Тогда 
	Текст = ОбщийФункционалКлиентСервер.ДобавитьТекст(
		Текст, "ВНИМАНИЕ ! Есть ошибочный документ оплаты.", Разделитель); 
КонецЕсли;	

Если ОшибочныйДокументОплаты 
ИЛИ ИтогоОплатыНеРавноИтогоДолг 
Тогда
	Результат.ЗаявкаКЗакрытию = Ложь;
	
	Результат.ОшибкаОписание = Текст;
КонецЕсли;

Возврат Результат;	
КонецФункции

Функция ГрупповойСчетКЗакрытию(ГрупповойСчетОбъект) Экспорт
ИтогоДокументыДолгиСуммаДолг = 0;
ИтогоДокументыДолгиСуммаОплачено = 0;
ОбновитьИтогиДокументыДолги(ИтогоДокументыДолгиСуммаДолг, ИтогоДокументыДолгиСуммаОплачено, ГрупповойСчетОбъект);

//ИтогоКомиссияСуммаКомиссииКонтрагент = 0;
//ОбновитьИтогиКомиссияДокументыДолги(ИтогоКомиссияСуммаКомиссииКонтрагент);

ИтогоКомиссияПлатежиОплачено = 0;
ОбновитьИтогиПлатежиКонтрагенту(ИтогоКомиссияПлатежиОплачено, ГрупповойСчетОбъект);
	
СуммаЗачетаОплачено = 0;
Для Каждого Строка Из ГрупповойСчетОбъект.ДокументыОплаты Цикл
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
		Если Строка.ДокументОплаты.ВидОперации = Справочники.ВидыОпераций.Взаимозачет Тогда 
			СуммаЗачетаОплачено = СуммаЗачетаОплачено + Строка.СуммаРаспределено;
		КонецЕсли;
	КонецЕсли;
КонецЦикла;
	
ИтогоДолг = ИтогоДокументыДолгиСуммаДолг;
ИтогоКомиссия = ГрупповойСчетОбъект.СуммаКомиссииКонтрагента;

Если ГрупповойСчетОбъект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ТурагентствоВзаимозачет") Тогда
	НащДолгКонтрагенту = ИтогоКомиссия + ГрупповойСчетОбъект.СуммаОстатокВзаимозачета;
	
	Если НащДолгКонтрагенту <= ИтогоДолг Тогда  
		ИтогоДолгКОплате = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
		ИтогоДолгКЗачету = 0;
		
		ИтогоКомиссияКЗачету = НащДолгКонтрагенту - СуммаЗачетаОплачено;
		ИтогоКомиссияПлатежиКОплате = 0;

		ИтогоКОплате = ИтогоДолгКОплате;	
	Иначе
		ИтогоДолгКОплате = 0;
		ИтогоДолгКЗачету = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
		
		ИтогоКомиссияПлатежиКОплате = НащДолгКонтрагенту - ИтогоКомиссияПлатежиОплачено - ИтогоДолгКЗачету - СуммаЗачетаОплачено;
		ИтогоКомиссияКЗачету = 0;	
		
		ИтогоКОплате = ИтогоКомиссияПлатежиКОплате;	
	КонецЕсли;
	
ИначеЕсли ГрупповойСчетОбъект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ТурагентствоДолги") Тогда
	
	НащДолгКонтрагенту = ИтогоКомиссия + ГрупповойСчетОбъект.СуммаОстатокВзаимозачета;
	
	ИтогоДолгКОплате = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
	ИтогоДолгКЗачету = 0;
	
	ИтогоКомиссияПлатежиКОплате = НащДолгКонтрагенту - СуммаЗачетаОплачено - ИтогоКомиссияПлатежиОплачено;
	ИтогоКомиссияКЗачету = 0;	
	
	//ИтогоКОплате = ИтогоДолгКОплате;	

ИначеЕсли ГрупповойСчетОбъект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ГруппаЗаявок") Тогда
	
	НащДолгКонтрагенту = ИтогоКомиссия + ГрупповойСчетОбъект.СуммаОстатокВзаимозачета;
	
	ИтогоДолгКОплате = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
	ИтогоДолгКЗачету = 0;
	
	ИтогоКомиссияПлатежиКОплате = НащДолгКонтрагенту - СуммаЗачетаОплачено - ИтогоКомиссияПлатежиОплачено;
	ИтогоКомиссияКЗачету = 0;	
	
	ИтогоКОплате = ИтогоДолгКОплате;
	
Иначе
	ИтогоДолгКОплате = 0;
	ИтогоДолгКЗачету = 0;
	
	ИтогоКомиссияПлатежиКОплате = 0;
	ИтогоКомиссияКЗачету = 0;	
	
	ИтогоКОплате = 0;
	
КонецЕсли;

Результат = Новый Структура("ГрупповойСчетКЗакрытию, ДолгКОплате, КомиссияПлатежиКОплате");   
Результат.ДолгКОплате = (ИтогоДолгКОплате <> 0);
Результат.КомиссияПлатежиКОплате = (ИтогоКомиссияПлатежиКОплате <> 0);
Результат.ГрупповойСчетКЗакрытию = НЕ (Результат.ДолгКОплате ИЛИ Результат.КомиссияПлатежиКОплате); 

Возврат Результат;
КонецФункции

Процедура ОбновитьИтогиДокументыДолги(ИтогоДокументыДолгиСуммаДолг, ИтогоДокументыДолгиСуммаОплачено
		, ГрупповойСчетОбъект) Экспорт
ИтогоДокументыДолгиСуммаДолг = 0;
ИтогоДокументыДолгиСуммаОплачено = 0;

Если ГрупповойСчетОбъект.ДокументыДолги.Количество() = 0 Тогда Возврат; КонецЕсли; 

Для Каждого Строка Из ГрупповойСчетОбъект.ДокументыДолги Цикл
	ДокументДолгОбъект = Строка.ДокументДолг.ПолучитьОбъект();
	
	//ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	//СчетаДетальноДолги = ДокументДолгОбъект.СчетаДетальноДолги.Выгрузить(ОтборСтроки);
	
	СуммаДолг = ДокументДолгОбъект.СчетаДетальноДолги.Итог("СуммаДолг");
   	СуммаОплачено = ДокументДолгОбъект.СчетаДетальноДолги.Итог("СуммаОплачено");
	
	ИтогоДокументыДолгиСуммаДолг = ИтогоДокументыДолгиСуммаДолг + СуммаДолг;
	ИтогоДокументыДолгиСуммаОплачено = ИтогоДокументыДолгиСуммаОплачено + СуммаОплачено;
КонецЦикла;
КонецПроцедуры

Процедура ОбновитьИтогиПлатежиКонтрагенту(ИтогоКомиссияПлатежиОплачено, ГрупповойСчетОбъект) Экспорт
ИтогоКомиссияПлатежиОплачено = 0;	
Для Каждого Строка Из ГрупповойСчетОбъект.ДокументыПлатежиКонтрагенту Цикл
	ДокументПлатежа = Строка.ДокументПлатежа;
	
	ИтогоКомиссияПлатежиОплачено = ИтогоКомиссияПлатежиОплачено + ДокументПлатежа.Сумма;
КонецЦикла;	
КонецПроцедуры

