
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЗаполнитьНастройки();

Если ЗначениеЗаполнено(Объект.МесяцРасчета) Тогда
	ЗаполнитьКвиткиНаСервере();
КонецЕсли;
	
УсловноеОформлениеЗагрузить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
Настройки.Очистить();

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "КоличествоСмен";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = 0;
НоваяСтрока.СуммаТолькоПросмотр = Истина;
НоваяСтрока.КоличествоТолькоПросмотр = Ложь;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Количество смен";
НоваяСтрока.ИмяЗаполненияКоличество = "КоличествоСмен_Э";
НоваяСтрока.ИмяЗаполненияСумма = "";
	
НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "Генеральные";
НоваяСтрока.РасчетСуммы = Истина;
НоваяСтрока.ЦенаИмя = "Г_Цена";
НоваяСтрока.СуммаТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Генеральные";
НоваяСтрока.КоличествоТолькоПросмотр = Ложь;
НоваяСтрока.ИмяЗаполненияКоличество = "Г_Количество_Э";
НоваяСтрока.ИмяЗаполненияСумма = "Г_Сумма";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "Текущие";
НоваяСтрока.РасчетСуммы = Истина;
НоваяСтрока.ЦенаИмя = "Т_Цена";
НоваяСтрока.СуммаТолькоПросмотр = Истина;
НоваяСтрока.КоличествоТолькоПросмотр = Ложь;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Текущие";
НоваяСтрока.ИмяЗаполненияКоличество = "Т_Количество_Э";
НоваяСтрока.ИмяЗаполненияСумма = "Т_Сумма";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "ТекущиеСоСменой";
НоваяСтрока.РасчетСуммы = Истина;
НоваяСтрока.ЦенаИмя = "ТС_Цена";
НоваяСтрока.СуммаТолькоПросмотр = Истина;
НоваяСтрока.КоличествоТолькоПросмотр = Ложь;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Текущие со сменой";
НоваяСтрока.ИмяЗаполненияКоличество = "ТС_Количество_Э";
НоваяСтрока.ИмяЗаполненияСумма = "ТС_Сумма";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "МК";
НоваяСтрока.РасчетСуммы = Истина;
НоваяСтрока.ЦенаИмя = "МК_Цена";
НоваяСтрока.СуммаТолькоПросмотр = Истина;
НоваяСтрока.КоличествоТолькоПросмотр = Ложь;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "МК";
НоваяСтрока.ИмяЗаполненияКоличество = "МК_Количество_Э";
НоваяСтрока.ИмяЗаполненияСумма = "МК_Сумма";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "МДМ";
НоваяСтрока.РасчетСуммы = Истина;
НоваяСтрока.ЦенаИмя = "МДМ_Цена";
НоваяСтрока.СуммаТолькоПросмотр = Истина;
НоваяСтрока.КоличествоТолькоПросмотр = Ложь;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "МДМ";
НоваяСтрока.ИмяЗаполненияКоличество = "МДМ_Количество_Э";   
// + Аудит
//НоваяСтрока.ИмяЗаполненияСумма = "МДМ_Количество_Э";
НоваяСтрока.ИмяЗаполненияСумма = "МДМ_Сумма";
// - Аудит


НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "Оклад";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Оклад";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "Оклад_Э";
	
НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "Отпуск";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Отпуск";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "Отпуск_Э";
	
НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "НадбавкаЗаСтаж";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Надбавка за стаж";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "НадбавкаЗаСтаж_Э";
	
НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "НадбавкаЗаСтандарты";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Надбавка за стандарты";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "НадбавкаЗаСтандарты_Э";
	
НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "Больничный";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Больничный";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "Больничный";
	
НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "Премия";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Премия";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "Премия";
	
НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "ДопРаботы";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = 1;
НоваяСтрока.Наименование = "Доп. работы";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "ДопРаботы";
//

//
НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "АвансКК";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = -1;
НоваяСтрока.Наименование = "Аванс к/к";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "НЕТ";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "АвансНал";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = -1;
НоваяСтрока.Наименование = "Аванс нал";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "НЕТ";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "ЗарплатаКК";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = -1;
НоваяСтрока.Наименование = "Зарплата к/к";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "НЕТ";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "ОтпускКК";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = -1;
НоваяСтрока.Наименование = "Отпуск к/к";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "НЕТ";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "ОтпускНал";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = -1;
НоваяСтрока.Наименование = "Отпуск нал";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "НЕТ";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "СдельноНал";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = -1;
НоваяСтрока.Наименование = "Сдельно нал";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "НЕТ";

НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = "ИныеВыплатыНал";
НоваяСтрока.РасчетСуммы = Ложь;
НоваяСтрока.ЦенаИмя = "";
НоваяСтрока.СуммаТолькоПросмотр = Ложь;
НоваяСтрока.КоличествоТолькоПросмотр = Истина;
НоваяСтрока.ТипСтроки = -1;
НоваяСтрока.Наименование = "Иные выплаты нал";
НоваяСтрока.ИмяЗаполненияКоличество = "";
НоваяСтрока.ИмяЗаполненияСумма = "НЕТ";

КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройку(КодЗаполнения, РасчетСуммы, ЦенаИмя, СуммаТолькоПросмотр)
НоваяСтрока = Настройки.Добавить();
НоваяСтрока.КодЗаполнения = КодЗаполнения;
НоваяСтрока.РасчетСуммы = РасчетСуммы;
НоваяСтрока.ЦенаИмя = ЦенаИмя;
НоваяСтрока.СуммаТолькоПросмотр = СуммаТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРасчетаПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(Объект.МесяцРасчета) Тогда
	ПоказатьПредупреждение(,"Необходимо заполнить месяц расчета");
	
	Возврат;
КонецЕсли;
		
Объект.МесяцРасчета = НачалоМесяца(Объект.МесяцРасчета);
ЗаполнитьКвиткиНаСервере();
КонецПроцедуры
//

&НаСервере
Процедура УсловноеОформлениеЗагрузить()
УсловноеОформление.Элементы.Очистить();

//
ЭлементОформления = УсловноеОформление.Элементы.Добавить();
ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	
ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квиток.КодЗаполнения");
ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеПодобно;
ОтборЭлемента.ПравоеЗначение = "Пусто_%";
ОтборЭлемента.Использование  = Истина;

ЭлементОформления.Использование = Истина;

ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КвитокНаименование.Имя);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лазурный);
//

//
ЭлементОформления = УсловноеОформление.Элементы.Добавить();
ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	
ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квиток.Количество_Есть");
ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
ОтборЭлемента.ПравоеЗначение = Истина;
ОтборЭлемента.Использование  = Истина;

ЭлементОформления.Использование = Истина;

ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КвитокКоличество_Э.Имя);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
//

//
ЭлементОформления = УсловноеОформление.Элементы.Добавить();
ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	
ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квиток.Сумма_Есть");
ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
ОтборЭлемента.ПравоеЗначение = Истина;
ОтборЭлемента.Использование  = Истина;

ЭлементОформления.Использование = Истина;

ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КвитокСумма_Э.Имя);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
//

////
ЭлементОформления = УсловноеОформление.Элементы.Добавить();
ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	
ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квиток.КодЗаполнения");
ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;

ОтборСтроки = Новый Структура("СуммаТолькоПросмотр", Истина);
НайденныеСтроки = Настройки.НайтиСтроки(ОтборСтроки);
СписокСумма = Новый СписокЗначений;
Для Каждого Строка Из НайденныеСтроки Цикл
	СписокСумма.Добавить(Строка.КодЗаполнения);	
КонецЦикла;	

ОтборЭлемента.ПравоеЗначение = СписокСумма;
ОтборЭлемента.Использование  = Истина;

ЭлементОформления.Использование = Истина;

ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КвитокСумма_Э.Имя);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
//

ЭлементОформления = УсловноеОформление.Элементы.Добавить();
ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	
ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квиток.КодЗаполнения");
ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Подобно;
ОтборЭлемента.ПравоеЗначение = "Помещение_%";
ОтборЭлемента.Использование  = Истина;

ЭлементОформления.Использование = Истина;

ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КвитокСумма_Э.Имя);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
//

////

//
ЭлементОформления = УсловноеОформление.Элементы.Добавить();
ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	
ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квиток.КодЗаполнения");
ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;

ОтборСтроки = Новый Структура("КоличествоТолькоПросмотр", Истина);
НайденныеСтроки = Настройки.НайтиСтроки(ОтборСтроки);
СписокКоличество = Новый СписокЗначений;
Для Каждого Строка Из НайденныеСтроки Цикл
	СписокКоличество.Добавить(Строка.КодЗаполнения);	
КонецЦикла;	

ОтборЭлемента.ПравоеЗначение = СписокКоличество;
ОтборЭлемента.Использование  = Истина;

ЭлементОформления.Использование = Истина;

ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КвитокКоличество_Э.Имя);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
//

ЭлементОформления = УсловноеОформление.Элементы.Добавить();
ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	
ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Квиток.КодЗаполнения");
ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;

СписокКоличество = Новый СписокЗначений;
СписокКоличество.Добавить("ИтогоНачисления");
СписокКоличество.Добавить("ОстатокКВыплате");

ОтборЭлемента.ПравоеЗначение = СписокКоличество;
ОтборЭлемента.Использование  = Истина;

ЭлементОформления.Использование = Истина;

ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Квиток.Имя);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));

////

КонецПроцедуры

//
&НаКлиенте
Процедура ЗаполнитьКвитки(Команда)
ЗаполнитьКвиткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКвиткиНаСервере()
//	
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	ГорничныеЗарплата.Г_Цена КАК Г_Цена,
                      |	ГорничныеЗарплата.Т_Цена КАК Т_Цена,
                      |	ГорничныеЗарплата.ТС_Цена КАК ТС_Цена,
                      |	ГорничныеЗарплата.РК_Цена КАК РК_Цена,
                      |	ГорничныеЗарплата.МК_Цена КАК МК_Цена,
                      |	ГорничныеЗарплата.МДМ_Цена КАК МДМ_Цена,
                      |	ГорничныеЗарплата.Зарплата.(
                      |		НомерСтроки КАК НомерСтроки,
                      |		Горничная КАК Горничная,
                      |		Оклад КАК Оклад,
                      |		Оклад_Р КАК Оклад_Р,
                      |		Оклад_Есть КАК Оклад_Есть,
                      |		ВЫБОР
                      |			КОГДА ГорничныеЗарплата.Зарплата.Оклад_Есть
                      |				ТОГДА ГорничныеЗарплата.Зарплата.Оклад_Р
                      |			ИНАЧЕ ГорничныеЗарплата.Зарплата.Оклад
                      |		КОНЕЦ КАК Оклад_Э,
                      |		Отпуск КАК Отпуск,
                      |		Отпуск_Р КАК Отпуск_Р,
                      |		Отпуск_Есть КАК Отпуск_Есть,
                      |		ВЫБОР
                      |			КОГДА ГорничныеЗарплата.Зарплата.Отпуск_Есть
                      |				ТОГДА ГорничныеЗарплата.Зарплата.Отпуск_Р
                      |			ИНАЧЕ ГорничныеЗарплата.Зарплата.Отпуск
                      |		КОНЕЦ КАК Отпуск_Э,
                      |		НадбавкаЗаСтаж КАК НадбавкаЗаСтаж,
                      |		НадбавкаЗаСтаж_Р КАК НадбавкаЗаСтаж_Р,
                      |		НадбавкаЗаСтаж_Есть КАК НадбавкаЗаСтаж_Есть,
                      |		ВЫБОР
                      |			КОГДА ГорничныеЗарплата.Зарплата.НадбавкаЗаСтаж_Есть
                      |				ТОГДА ГорничныеЗарплата.Зарплата.НадбавкаЗаСтаж_Р
                      |			ИНАЧЕ ГорничныеЗарплата.Зарплата.НадбавкаЗаСтаж
                      |		КОНЕЦ КАК НадбавкаЗаСтаж_Э,
                      |		НадбавкаЗаСтандарты КАК НадбавкаЗаСтандарты,
                      |		НадбавкаЗаСтандарты_Р КАК НадбавкаЗаСтандарты_Р,
                      |		НадбавкаЗаСтандарты_Есть КАК НадбавкаЗаСтандарты_Есть,
                      |		ВЫБОР
                      |			КОГДА ГорничныеЗарплата.Зарплата.НадбавкаЗаСтандарты_Есть
                      |				ТОГДА ГорничныеЗарплата.Зарплата.НадбавкаЗаСтандарты_Р
                      |			ИНАЧЕ ГорничныеЗарплата.Зарплата.НадбавкаЗаСтандарты
                      |		КОНЕЦ КАК НадбавкаЗаСтандарты_Э,
                      |		Больничный КАК Больничный,
                      |		Премия КАК Премия,
                      |		ДопРаботы КАК ДопРаботы,
                      |		Сдельно КАК Сдельно,
                      |		Г_Количество КАК Г_Количество,
                      |		Г_Количество_Р КАК Г_Количество_Р,
                      |		ГорничныеЗарплата.Зарплата.Г_Количество + ГорничныеЗарплата.Зарплата.Г_Количество_Р КАК Г_Количество_Э,
                      |		Г_Сумма КАК Г_Сумма,
                      |		Т_Количество КАК Т_Количество,
                      |		Т_Количество_Р КАК Т_Количество_Р,
                      |		ГорничныеЗарплата.Зарплата.Т_Количество + ГорничныеЗарплата.Зарплата.Т_Количество_Р КАК Т_Количество_Э,
                      |		Т_Сумма КАК Т_Сумма,
                      |		ТС_Количество КАК ТС_Количество,
                      |		ТС_Количество_Р КАК ТС_Количество_Р,
                      |		ГорничныеЗарплата.Зарплата.ТС_Количество + ГорничныеЗарплата.Зарплата.ТС_Количество_Р КАК ТС_Количество_Э,
                      |		ТС_Сумма КАК ТС_Сумма,
                      |		РК_Количество КАК РК_Количество,
                      |		РК_Количество_Р КАК РК_Количество_Р,
                      |		РК_Сумма КАК РК_Сумма,
                      |		МК_Количество КАК МК_Количество,
                      |		МК_Количество_Р КАК МК_Количество_Р,
                      |		ГорничныеЗарплата.Зарплата.МК_Количество + ГорничныеЗарплата.Зарплата.МК_Количество_Р КАК МК_Количество_Э,
                      |		МК_Сумма КАК МК_Сумма,
                      |		МДМ_Количество КАК МДМ_Количество,
                      |		МДМ_Количество_Р КАК МДМ_Количество_Р,
                      |		ГорничныеЗарплата.Зарплата.МДМ_Количество + ГорничныеЗарплата.Зарплата.МДМ_Количество_Р КАК МДМ_Количество_Э,
                      |		МДМ_Сумма КАК МДМ_Сумма,
                      |		СуммаПрачечная КАК СуммаПрачечная,
                      |		СуммаПрачечная_Р КАК СуммаПрачечная_Р,
                      |		СуммаПрачечная_Есть КАК СуммаПрачечная_Есть,
                      |		ВЫБОР
                      |			КОГДА ГорничныеЗарплата.Зарплата.СуммаПрачечная_Есть
                      |				ТОГДА ГорничныеЗарплата.Зарплата.СуммаПрачечная_Р
                      |			ИНАЧЕ ГорничныеЗарплата.Зарплата.СуммаПрачечная
                      |		КОНЕЦ КАК СуммаПрачечная_Э,
                      |		КоличествоСмен КАК КоличествоСмен,
                      |		КоличествоСмен_Р КАК КоличествоСмен_Р,
                      |		КоличествоСмен_Есть КАК КоличествоСмен_Есть,
                      |		ВЫБОР
                      |			КОГДА ГорничныеЗарплата.Зарплата.КоличествоСмен_Есть
                      |				ТОГДА ГорничныеЗарплата.Зарплата.КоличествоСмен_Р
                      |			ИНАЧЕ ГорничныеЗарплата.Зарплата.КоличествоСмен
                      |		КОНЕЦ КАК КоличествоСмен_Э,
                      |		КорректировкаДопНачислено КАК КорректировкаДопНачислено,
                      |		Аванс_кк КАК Аванс_кк,
                      |		Аванс_нал КАК Аванс_нал,
                      |		Зарплата_кк КАК Зарплата_кк,
                      |		Отпуск_кк КАК Отпуск_кк,
                      |		Отпуск_нал КАК Отпуск_нал,
                      |		Сдельно_нал КАК Сдельно_нал,
                      |		ИныеВыплаты_нал КАК ИныеВыплаты_нал
                      |	) КАК Зарплата,
                      |	ГорничныеЗарплата.ЗарплатаПомещения.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		Горничная КАК Горничная,
                      |		Помещение КАК Помещение,
                      |		Количество КАК Количество,
                      |		Количество_Р КАК Количество_Р,
                      |		ГорничныеЗарплата.ЗарплатаПомещения.Количество + ГорничныеЗарплата.ЗарплатаПомещения.Количество_Р КАК Количество_Э
                      |	) КАК ЗарплатаПомещения,
                      |	ГорничныеЗарплата.ПомещенияЦены.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		Помещение КАК Помещение,
                      |		Цена КАК Цена
                      |	) КАК ПомещенияЦены
                      |ИЗ
                      |	Документ.ГорничныеЗарплата КАК ГорничныеЗарплата
                      |ГДЕ
                      |	ГорничныеЗарплата.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеЗарплата.МесяцРасчета = &МесяцРасчета
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ГорничныеЗарплата.Ссылка УБЫВ");

//// + Аудит
//					  //|ГДЕ
//					  //|	ГорничныеЗарплата.МесяцРасчета = &МесяцРасчета
//                      |ГДЕ
//                      |	ГорничныеЗарплата.ПометкаУдаления = ЛОЖЬ
//                      |	И ГорничныеЗарплата.МесяцРасчета = &МесяцРасчета
//// - Аудит
Запрос.УстановитьПараметр("МесяцРасчета", Объект.МесяцРасчета);

ТЗ =  Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	Сообщить("Расчет зарплаты за " + Формат(Объект.МесяцРасчета, "MM.yyyy") + " отстуствует");
	
	Возврат;
КонецЕсли;

СтрокаДанные = ТЗ[0];

Г_Цена = СтрокаДанные.Г_Цена;
Т_Цена = СтрокаДанные.Т_Цена;
ТС_Цена = СтрокаДанные.ТС_Цена;
МК_Цена = СтрокаДанные.МК_Цена;
МДМ_Цена = СтрокаДанные.МДМ_Цена;

Горничные.Очистить();
Для Каждого Строка_П Из СтрокаДанные.Зарплата Цикл
	НоваяСтрока = Горничные.Добавить();
	
	НоваяСтрока.Горничная = Строка_П.Горничная;
КонецЦикла;

Для Каждого Строка_П Из СтрокаДанные.ПомещенияЦены Цикл
	НоваяСтрока = ПомещенияЦены.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка_П);	
КонецЦикла;
//

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеОбщийКвитокКвитокСтроки.Ссылка КАК Ссылка,
                      |	ГорничныеОбщийКвитокКвитокСтроки.НомерСтроки КАК НомерСтроки,
                      |	ГорничныеОбщийКвитокКвитокСтроки.Горничная КАК Горничная,
                      |	ГорничныеОбщийКвитокКвитокСтроки.ТипСтроки КАК ТипСтроки,
                      |	ГорничныеОбщийКвитокКвитокСтроки.КодЗаполнения КАК КодЗаполнения,
                      |	ГорничныеОбщийКвитокКвитокСтроки.Наименование КАК Наименование,
                      |	ГорничныеОбщийКвитокКвитокСтроки.Количество КАК Количество,
                      |	ГорничныеОбщийКвитокКвитокСтроки.Количество_Р КАК Количество_Р,
                      |	ГорничныеОбщийКвитокКвитокСтроки.Количество_Есть КАК Количество_Есть,
                      |	ГорничныеОбщийКвитокКвитокСтроки.Сумма КАК Сумма,
                      |	ГорничныеОбщийКвитокКвитокСтроки.Сумма_Р КАК Сумма_Р,
                      |	ГорничныеОбщийКвитокКвитокСтроки.Сумма_Есть КАК Сумма_Есть
                      |ИЗ
                      |	Документ.ГорничныеОбщийКвиток.КвитокСтроки КАК ГорничныеОбщийКвитокКвитокСтроки
                      |ГДЕ
                      |	ГорничныеОбщийКвитокКвитокСтроки.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеОбщийКвитокКвитокСтроки.Ссылка = &Ссылка");

Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

ТЗ_КвиткиДокумент = Запрос.Выполнить().Выгрузить();

Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Для Каждого Строка Из ТЗ_КвиткиДокумент Цикл
		НоваяСтрока = ТЗ_Квитки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
Иначе
	Для Каждого Строка Из Горничные Цикл
		ОтборСтроки = Новый Структура("ТипСтроки", 1);
		НайденныеСтрокиНастройка = Настройки.НайтиСтроки(ОтборСтроки);
		
		Для Каждого СтрокаНастройка Из НайденныеСтрокиНастройка Цикл
			НоваяСтрока = ТЗ_Квитки.Добавить();
			НоваяСтрока.Горничная = Строка.Горничная;
			НоваяСтрока.КодЗаполнения = СтрокаНастройка.КодЗаполнения;
			НоваяСтрока.Наименование = СтрокаНастройка.Наименование;
			НоваяСтрока.ТипСтроки = СтрокаНастройка.ТипСтроки;
			
			Если ЗначениеЗаполнено(СтрокаНастройка.ИмяЗаполненияКоличество) Тогда
				ЗаполнитьСтрокаТЗ_Квитки(НоваяСтрока, СтрокаДанные.Зарплата, ТЗ_КвиткиДокумент, СтрокаНастройка.ИмяЗаполненияКоличество
					, Истина, НоваяСтрока.Горничная, НоваяСтрока.КодЗаполнения);
			КонецЕсли;	
			Если ЗначениеЗаполнено(СтрокаНастройка.ИмяЗаполненияСумма) Тогда
				ЗаполнитьСтрокаТЗ_Квитки(НоваяСтрока, СтрокаДанные.Зарплата, ТЗ_КвиткиДокумент, СтрокаНастройка.ИмяЗаполненияСумма
					, Ложь, НоваяСтрока.Горничная, НоваяСтрока.КодЗаполнения);
			КонецЕсли;	
		КонецЦикла;
		
		ОтборСтроки = Новый Структура("Горничная", Строка.Горничная);
		ГорничнаяПомещенияСтроки = СтрокаДанные.ЗарплатаПомещения.Скопировать(ОтборСтроки);
		Для Каждого СтрокаПомещения Из ГорничнаяПомещенияСтроки Цикл
			НоваяСтрока = ТЗ_Квитки.Добавить();
			НоваяСтрока.Горничная = Строка.Горничная;
			НоваяСтрока.КодЗаполнения = "Помещение_" + СтрокаПомещения.Помещение.Наименование + "_" + Строка(СтрокаПомещения.НомерСтроки);;
			НоваяСтрока.Наименование = СтрокаПомещения.Помещение.Наименование;
			НоваяСтрока.ТипСтроки = 1;
			ЗаполнитьСтрокаТЗ_Квитки(НоваяСтрока, ГорничнаяПомещенияСтроки, ТЗ_КвиткиДокумент, "Количество", Истина, НоваяСтрока.Горничная, НоваяСтрока.КодЗаполнения);
			
			ОтборСтроки = Новый Структура("Помещение", СтрокаПомещения.Помещение);
			НайденныеСтроки = ПомещенияЦены.НайтиСтроки(ОтборСтроки);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НоваяСтрока.Цена = НайденныеСтроки[0].Цена;						
			КонецЕсли;
		КонецЦикла;
		
	//
		НоваяСтрока = ТЗ_Квитки.Добавить();
		НоваяСтрока.Горничная = Строка.Горничная;
		НоваяСтрока.КодЗаполнения = "ИтогоНачисления";
		НоваяСтрока.Наименование = "Итого начисления";
		НоваяСтрока.ТипСтроки = 0;
		
	//	
		ОтборСтроки = Новый Структура("ТипСтроки", -1);
		НайденныеСтрокиНастройка = Настройки.НайтиСтроки(ОтборСтроки);
		
		Для Каждого СтрокаНастройка Из НайденныеСтрокиНастройка Цикл
			НоваяСтрока = ТЗ_Квитки.Добавить();
			НоваяСтрока.Горничная = Строка.Горничная;
			НоваяСтрока.КодЗаполнения = СтрокаНастройка.КодЗаполнения;
			НоваяСтрока.Наименование = СтрокаНастройка.Наименование;
			НоваяСтрока.ТипСтроки = СтрокаНастройка.ТипСтроки;
			
			Если ЗначениеЗаполнено(СтрокаНастройка.ИмяЗаполненияКоличество) Тогда
				ЗаполнитьСтрокаТЗ_Квитки(НоваяСтрока, СтрокаДанные.Зарплата, ТЗ_КвиткиДокумент, СтрокаНастройка.ИмяЗаполненияКоличество
					, Истина, НоваяСтрока.Горничная, НоваяСтрока.КодЗаполнения);
			КонецЕсли;	
			Если ЗначениеЗаполнено(СтрокаНастройка.ИмяЗаполненияСумма) Тогда
				ЗаполнитьСтрокаТЗ_Квитки(НоваяСтрока, СтрокаДанные.Зарплата, ТЗ_КвиткиДокумент, СтрокаНастройка.ИмяЗаполненияСумма
					, Ложь, НоваяСтрока.Горничная, НоваяСтрока.КодЗаполнения);
			КонецЕсли;	
		КонецЦикла;

	//
		НоваяСтрока = ТЗ_Квитки.Добавить();
		НоваяСтрока.Горничная = Строка.Горничная;
		НоваяСтрока.КодЗаполнения = "ОстатокКВыплате";
		НоваяСтрока.Наименование = "Остаток к выплате";
		НоваяСтрока.ТипСтроки = 0;
		
		КонецЦикла;
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокаТЗ_Квитки(СтрокаКЗаполнению, ТЗ_Зарплата, ТЗ_КвиткиДокумент, Имя, ЭтоКоличество, Горничная, КодЗаполнения)
ОтборСтроки = Новый Структура("Горничная", Горничная);
НайденныеСтроки = ТЗ_Зарплата.НайтиСтроки(ОтборСтроки);
СтрокаЗарплата = НайденныеСтроки[0];	
	
ОтборСтроки = Новый Структура("Горничная, КодЗаполнения", Горничная, КодЗаполнения);
НайденныеСтроки = ТЗ_КвиткиДокумент.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда
	СтрокаКвитокСтроки = НайденныеСтроки[0];
	
	Если ЭтоКоличество Тогда 
		Если СтрокаКвитокСтроки.Количество_Есть Тогда
			СтрокаКЗаполнению.Количество_Р = СтрокаКвитокСтроки.Количество_Р;
			СтрокаКЗаполнению.Количество_Есть = СтрокаКвитокСтроки.Количество_Есть;
		Иначе
			СтрокаКЗаполнению.Количество_Р = 0;
			СтрокаКЗаполнению.Количество_Есть = Ложь;
		КонецЕсли;
		СтрокаКЗаполнению.Количество = СтрокаЗарплата[Имя];
	Иначе			
		Если СтрокаКвитокСтроки.Сумма_Есть Тогда
			СтрокаКЗаполнению.Сумма_Р = СтрокаКвитокСтроки.Сумма_Р;
			СтрокаКЗаполнению.Сумма_Есть = СтрокаКвитокСтроки.Сумма_Есть;
		Иначе
			СтрокаКЗаполнению.Сумма_Р = 0;
			СтрокаКЗаполнению.Сумма_Есть = Ложь;
		КонецЕсли;
		
		Если Имя <> "НЕТ" Тогда
			СтрокаКЗаполнению.Сумма = СтрокаЗарплата[Имя];
		КонецЕсли;
	КонецЕсли;	
Иначе
	Если ЭтоКоличество Тогда 
		СтрокаКЗаполнению.Количество_Р = 0;
		СтрокаКЗаполнению.Количество_Есть = Ложь;
		СтрокаКЗаполнению.Количество = СтрокаЗарплата[Имя];
	Иначе			
		СтрокаКЗаполнению.Сумма_Р = 0;
		СтрокаКЗаполнению.Сумма_Есть = Ложь;
		Если Имя <> "НЕТ" Тогда
			СтрокаКЗаполнению.Сумма = СтрокаЗарплата[Имя];
		КонецЕсли;
	КонецЕсли;
КонецЕсли;
КонецПроцедуры
//



//
&НаКлиенте
Процедура ГорничныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеПередНачаломИзменения(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГорничныеПриАктивизацииСтроки(Элемент)
ТД = Элемент.ТекущиеДанные;
Квиток.Очистить();
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ОтборСтроки = Новый Структура("Горничная", ТД.Горничная);
НайденныеСтроки = ТЗ_Квитки.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() = 0 Тогда Возврат; КонецЕсли;

СуммаНачисления = 0;
СуммаВыплаты = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	НоваяСтрока = Квиток.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если Строка.Количество_Есть Тогда
		НоваяСтрока.Количество_Э = Строка.Количество_Р; 
	Иначе
		НоваяСтрока.Количество_Э = Строка.Количество; 
	КонецЕсли;	
	
	Если Строка.Сумма_Есть Тогда
		НоваяСтрока.Сумма_Э = Строка.Сумма_Р; 
	Иначе
		НоваяСтрока.Сумма_Э = Строка.Сумма; 
	КонецЕсли;	
	
	Если СтрНайти(НоваяСтрока.КодЗаполнения, "Помещение_") > 0 Тогда
		НоваяСтрока.Сумма_Э = НоваяСтрока.Количество_Э * НоваяСтрока.Цена;
	КонецЕсли;
	
	Если Строка.ТипСтроки = 1 Тогда
		СуммаНачисления = СуммаНачисления + НоваяСтрока.Сумма_Э;
	КонецЕсли;	
	
	Если Строка.ТипСтроки = -1 Тогда
		СуммаВыплаты = СуммаВыплаты + НоваяСтрока.Сумма_Э;
	КонецЕсли;	
КонецЦикла;

ОтборСтроки = Новый Структура("КодЗаполнения", "ИтогоНачисления");
НайденныеСтроки = Квиток.НайтиСтроки(ОтборСтроки);
НайденныеСтроки[0].Сумма_Э = СуммаНачисления;

ОтборСтроки = Новый Структура("КодЗаполнения", "ОстатокКВыплате");
НайденныеСтроки = Квиток.НайтиСтроки(ОтборСтроки);
НайденныеСтроки[0].Сумма_Э = СуммаНачисления - СуммаВыплаты;

КонецПроцедуры
//

&НаКлиенте
Функция КвитокИтоги()
СуммаНачисления = 0;
СуммаВыплаты = 0;
Для Каждого Строка Из Квиток Цикл
	Если Строка.ТипСтроки = 1 Тогда
		СуммаНачисления = СуммаНачисления + Строка.Сумма_Э;
	КонецЕсли;
		
	Если Строка.ТипСтроки = -1 Тогда
		СуммаВыплаты = СуммаВыплаты + Строка.Сумма_Э;
	КонецЕсли;
КонецЦикла;

ОстатокКВыплате = СуммаНачисления - СуммаВыплаты; 

КвитокИтоги = Новый Структура("ИтогоНачисления, ОстатокКВыплате", СуммаНачисления, ОстатокКВыплате);
Возврат КвитокИтоги;
КонецФункции	

//
&НаКлиенте
Процедура КвитокКоличество_ЭПриИзменении(Элемент)
ТД = Элемент.Родитель.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ТД.Количество_Есть = Истина;
ТД.Количество_Р = ТД.Количество_Э;

Если СтрНайти(ТД.КодЗаполнения, "Помещение_") > 0 Тогда
	ТД.Сумма_Э = ТД.Количество_Э * ТД.Цена;
Иначе
	ТД.Сумма_Э = КвитокСумма(ТД);
КонецЕсли;

ТД.Сумма_Есть = Истина;
ТД.Сумма_Р = ТД.Сумма_Э;
КонецПроцедуры

&НаКлиенте
Функция КвитокСумма(ТД)
ОтборСтроки = Новый Структура("РасчетСуммы, КодЗаполнения", Истина, ТД.КодЗаполнения);
НайденныеСтроки = Настройки.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() = 0 Тогда Возврат 0; КонецЕсли;

ЦенаИмя = НайденныеСтроки[0].ЦенаИмя;
КвитокСумма = ТД.Количество_Э * ЭтаФорма[ЦенаИмя];
Возврат КвитокСумма; 	
КонецФункции

&НаКлиенте
Процедура КвитокКоличество_ЭОчистка(Элемент, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ТД = Элемент.Родитель.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ТД.Количество_Есть = Ложь;
ТД.Количество_Р = 0;

ТД.Количество_Э = ТД.Количество;

Если СтрНайти(ТД.КодЗаполнения, "Помещение_") > 0 Тогда
	ТД.Сумма_Э = ТД.Количество_Э * ТД.Цена;
Иначе
	ТД.Сумма_Э = КвитокСумма(ТД);
КонецЕсли;

ТД.Сумма_Есть = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КвитокСумма_ЭПриИзменении(Элемент)
ТД = Элемент.Родитель.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ТД.Сумма_Есть = Истина;
ТД.Сумма_Р = ТД.Сумма_Э;
КонецПроцедуры

&НаКлиенте
Процедура КвитокСумма_ЭОчистка(Элемент, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ТД = Элемент.Родитель.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ТД.Сумма_Есть = Ложь;
ТД.Сумма_Р = 0;

ТД.Сумма_Э = ТД.Сумма;
КонецПроцедуры

&НаКлиенте
Процедура КвитокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ТД = Элемент.ТекущиеДанные;

ОтборСтроки = Новый Структура("Горничная, КодЗаполнения", ТД.Горничная, ТД.КодЗаполнения); 	
НайденныеСтроки = ТЗ_Квитки.НайтиСтроки(ОтборСтроки);	

Если СтрНайти(ТД.КодЗаполнения, "Пусто_") > 0  Тогда  
	НайденныеСтроки[0].Наименование = ТД.Наименование;	
КонецЕсли;

НайденныеСтроки[0].Количество_Р = ТД.Количество_Р;	
НайденныеСтроки[0].Количество_Есть = ТД.Количество_Есть;		

НайденныеСтроки[0].Сумма_Р = ТД.Сумма_Р;	
НайденныеСтроки[0].Сумма_Есть = ТД.Сумма_Есть;	

КвитокИтоги = КвитокИтоги();
ОтборСтроки = Новый Структура("КодЗаполнения", "ИтогоНачисления");
НайденныеСтроки = Квиток.НайтиСтроки(ОтборСтроки);
НайденныеСтроки[0].Сумма_Э = КвитокИтоги.ИтогоНачисления;

ОтборСтроки = Новый Структура("КодЗаполнения", "ОстатокКВыплате");
НайденныеСтроки = Квиток.НайтиСтроки(ОтборСтроки);
НайденныеСтроки[0].Сумма_Э = КвитокИтоги.ОстатокКВыплате;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
ТС = Элементы.Квиток.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ТСНоваяСтрока  = ДобавитьСтрокуНаСервере(ТС);
Если ТСНоваяСтрока = Неопределено Тогда Возврат; КонецЕсли;

Элементы.Квиток.ТекущаяСтрока = ТСНоваяСтрока;	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуНаСервере(ТС)
СтрокаКвиток = Квиток.НайтиПоИдентификатору(ТС);	

Если СтрокаКвиток.ТипСтроки = 1 ИЛИ СтрокаКвиток.КодЗаполнения = "ИтогоНачисления" Тогда
	ТипСтроки = 1;
ИначеЕсли СтрокаКвиток.ТипСтроки = -1 ИЛИ СтрокаКвиток.КодЗаполнения = "ОстатокКВыплате" Тогда
	ТипСтроки = -1;
Иначе
	Возврат Неопределено;	
КонецЕсли;

Индекс = Квиток.Индекс(СтрокаКвиток);

НоваяСтрокаКвиток = Квиток.Вставить(Индекс);	
НоваяСтрокаКвиток.Горничная= СтрокаКвиток.Горничная;

Объект.НомерСтрокиНачисления = Объект.НомерСтрокиНачисления + 1; 
НоваяСтрокаКвиток.КодЗаполнения = "Пусто_" + Строка(Объект.НомерСтрокиНачисления);

НоваяСтрокаКвиток.ТипСтроки = ТипСтроки;
	
//	
ТС = НоваяСтрокаКвиток.ПолучитьИдентификатор();

ОтборСтроки = Новый Структура("Горничная, КодЗаполнения", СтрокаКвиток.Горничная, СтрокаКвиток.КодЗаполнения); 	
НайденныеСтроки = ТЗ_Квитки.НайтиСтроки(ОтборСтроки);
СтрокаТЗ_Квитки = НайденныеСтроки[0];
Индекс = ТЗ_Квитки.Индекс(СтрокаТЗ_Квитки);

НоваяСтрокаТЗ_Квитки = ТЗ_Квитки.Вставить(Индекс);	
НоваяСтрокаТЗ_Квитки.Горничная= СтрокаТЗ_Квитки.Горничная;

НоваяСтрокаТЗ_Квитки.КодЗаполнения = НоваяСтрокаКвиток.КодЗаполнения;

НоваяСтрокаТЗ_Квитки.ТипСтроки = НоваяСтрокаКвиток.ТипСтроки;

Возврат ТС;
КонецФункции

&НаКлиенте
Процедура КвитокПередУдалением(Элемент, Отказ)
ТД = Элемент.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

Если СтрНайти(ТД.КодЗаполнения, "Пусто_") = 0  Тогда  
	Отказ = Истина;
	
	Возврат;
КонецЕсли;
	
ОтборСтроки = Новый Структура("Горничная, КодЗаполнения", ТД.Горничная, ТД.КодЗаполнения); 	
НайденныеСтроки = ТЗ_Квитки.НайтиСтроки(ОтборСтроки);
СтрокаТЗ_Квитки = НайденныеСтроки[0];

ТЗ_Квитки.Удалить(СтрокаТЗ_Квитки);
КонецПроцедуры

&НаКлиенте
Процедура КвитокПослеУдаления(Элемент)
КвитокИтоги = КвитокИтоги();
ОтборСтроки = Новый Структура("КодЗаполнения", "ИтогоНачисления");
НайденныеСтроки = Квиток.НайтиСтроки(ОтборСтроки);
НайденныеСтроки[0].Сумма_Э = КвитокИтоги.ИтогоНачисления;

ОтборСтроки = Новый Структура("КодЗаполнения", "ОстатокКВыплате");
НайденныеСтроки = Квиток.НайтиСтроки(ОтборСтроки);
НайденныеСтроки[0].Сумма_Э = КвитокИтоги.ОстатокКВыплате;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Если НЕ ЗначениеЗаполнено(Объект.МесяцРасчета) Тогда 
	ПоказатьПредупреждение(, "Необходимо заполнить месяц расчета ...");	
	Отказ = Истина;
	
	Возврат;
КонецЕсли;

ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;

КвитокСтроки = Объект.КвитокСтроки;

КвитокСтроки.Очистить();
Для Каждого Строка Из ТЗ_Квитки Цикл
	НоваяСтрока = КвитокСтроки.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

КонецПроцедуры
//

&НаКлиенте
Процедура КвитокПечать(Команда)
ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 	
	
ТД = Элементы.Горничные.ТекущиеДанные;	
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ТС = Элементы.Горничные.ТекущаяСтрока;	

ТабДок = КвитокПечатьНаСервере(ТС);

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Квиток " + ТД.Горничная); 
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ,Истина);
КонецПроцедуры

&НаСервере
Функция КвитокПечатьНаСервере(ТС)
ТабДок = Новый ТабличныйДокумент;
	
ТД = Горничные.НайтиПоИдентификатору(ТС);

Макет = Документы.ГорничныеОбщийКвиток.ПолучитьМакет("МакетКвиток");

Область = Макет.ПолучитьОбласть("Шапка");
Область.Параметры.Горничная = ТД.Горничная;
ТабДок.Вывести(Область);

Для Каждого Строка Из Квиток Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.Наименование = Строка.Наименование;
	Область.Параметры.Количество  = Строка.Количество_Э;
	Область.Параметры.Сумма  = Строка.Сумма_Э;
	
	Если Строка.КодЗаполнения = "ИтогоНачисления" 
	ИЛИ Строка.КодЗаполнения = "ОстатокКВыплате" 
	Тогда
		Область.Область(1,1,1,3).Шрифт = Новый Шрифт(, , Истина, Истина);
		Область.Область(1,1,1, 3).ЦветФона = Новый Цвет(240, 240, 240);
	КонецЕсли;
	
	ТабДок.Вывести(Область);
КонецЦикла;

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Количество смен";
//Область.Параметры.Количество  = ТД.КоличествоСмен_Э;
////Область.Параметры.Сумма  = ТД.
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Генеральные";
//Область.Параметры.Количество  = ТД.Г_Количество_Э;
//Область.Параметры.Сумма  = ТД.Г_Сумма;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Текущие";
//Область.Параметры.Количество  = ТД.Т_Количество_Э;
//Область.Параметры.Сумма  = ТД.Т_Сумма;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Текущие со сменой";
//Область.Параметры.Количество  = ТД.ТС_Количество_Э;
//Область.Параметры.Сумма  = ТД.ТС_Сумма;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "МК";
//Область.Параметры.Количество  = ТД.МК_Количество_Э;
//Область.Параметры.Сумма  = ТД.МК_Сумма;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "МДМ";
//Область.Параметры.Количество  = ТД.МДМ_Количество_Э;
//Область.Параметры.Сумма  = ТД.МДМ_Сумма;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Оклад";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Оклад_Э;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Отпуск";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Отпуск_Э;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Стаж";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.НадбавкаЗаСтаж_Э;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Стандарты";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.НадбавкаЗаСтандарты_Э;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Больничный";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Больничный;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Премия";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Премия;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Доп. работы";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.ДопРаботы;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//ТабДок.Вывести(Область);                                

//ОтборСтроки = Новый Структура("Горничная", ТД.Горничная); 
//НайденныеСтроки = Объект.ЗарплатаПомещения.НайтиСтроки(ОтборСтроки);

//Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
//	Область = Макет.ПолучитьОбласть("Строка");
//	Область.Параметры.Наименование = НайденнаяСтрока.Помещение;
//	
//	Количество_П = НайденнаяСтрока.Количество + НайденнаяСтрока.Количество_Р;
//	Область.Параметры.Количество  = Количество_П;
//	
//	ОтборСтрокиПомещенияЦена = Новый Структура("Помещение", НайденнаяСтрока.Помещение); 
//	НайденныеСтрокиПомещенияЦена = ПомещенияЦены.НайтиСтроки(ОтборСтрокиПомещенияЦена);
//	Если НайденныеСтрокиПомещенияЦена.Количество() > 0 Тогда
//		Сумма = Количество_П * НайденныеСтрокиПомещенияЦена[0].Цена; 
//		Область.Параметры.Сумма  = Сумма;
//	КонецЕсли;
//	ТабДок.Вывести(Область);
//КонецЦикла;

//Область = Макет.ПолучитьОбласть("Строка");
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Сдельно";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Сдельно;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Прачечная";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.СуммаПрачечная_Э;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Корректировка доп. начисл.";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.КорректировкаДопНачислено;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "СУММА ИТОГО";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.ЗарплатаИтого;
//Область.Область(1,1,1,3).Шрифт = Новый Шрифт(, 12, Истина);
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Аванс кк";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Аванс_кк;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Аванс нал";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Аванс_нал;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Зарплата кк";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Зарплата_кк;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Отпуск кк";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Отпуск_кк;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Отпуск нал";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Отпуск_нал;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Сдельно нал";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.Сдельно_нал;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "Иные выплаты нал";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.ИныеВыплаты_нал;
//ТабДок.Вывести(Область);

//Область = Макет.ПолучитьОбласть("Строка");
//Область.Параметры.Наименование = "ОСТАТОК К ВЫДАЧЕ";
////Область.Параметры.Количество  = ТД.;
//Область.Параметры.Сумма  = ТД.ОстатокКВыдаче;
//Область.Область(1,1,1,3).Шрифт = Новый Шрифт(, 12, Истина);
//ТабДок.Вывести(Область);

Возврат ТабДок;
КонецФункции

