//Перем ПредНомер, Цвет, Перерисовать;

//
&НаКлиенте
Процедура ДанныеПоМинибаруПриВыводеСтроки___(Элемент, ОформлениеСтроки, ДанныеСтроки)
	//// Вставить содержимое обработчика.
	//Если Перерисовать тогда
	//	Если ДанныеСтроки.НомерКомнаты<>ПредНомер тогда
	//		Цвет=Не Цвет;
	//		ПредНомер=ДанныеСтроки.НомерКомнаты;		
	//	конецесли;
	//	ДанныеСтроки.Цвет=Цвет;

	//конецесли;
	//Если ДанныеСтроки.Цвет тогда
	//	ОформлениеСтроки.ЦветФона=Новый Цвет(209,209,209);
	//конецесли;
	//
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
УсловноеОформлениеЗаполнить();
КонецПроцедуры

&НаСервере
Процедура  УсловноеОформлениеЗаполнить()
ЭлементОформления = УсловноеОформление.Элементы.Добавить();
 
// Зададим отбор (условия при которых будет выполнено оформление)
ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("ТЗ.Реквизит1");
ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("Объект.ДанныеПоМинибару.Цвет");
ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.Равно;
ЭлементОтбора.ПравоеЗначение    = Истина;
ЭлементОтбора.Использование     = Истина;
 
//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(209,209,209));
 
// Укажем какие поля (колонки) оформлять
ПолеОформления      = ЭлементОформления.Поля.Элементы.Добавить();
ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеПоМинибару");
ПолеОформления.Использование = Истина; 
 
ЭлементОформления.Использование = Истина;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДатаУборкиПриИзменении__(Элемент)
	//Если ДанныеПоМинибару.Итог("Принять")>0 тогда
	//	Если Вопрос("Есть не сохраненные данные - перезаполнить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
	//		ЗаполнитьТаблицу();	
	//		
	//	конецесли;
	//иначе
	//	ЗаполнитьТаблицу();	
	//конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаУборкиПриИзменении(Элемент)
	//Если Объект.ДанныеПоМинибару.Итог("Принять") > 0 тогда
	Если ДанныеПоМинибаруИтогПринять() тогда
		Оповещение = Новый ОписаниеОповещения("ЗавершитьВопросЕстьНеСохраненныеДанные", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Есть не сохраненные данные - перезаполнить?", РежимДиалогаВопрос.ДаНет); 
		Возврат;
		//Если Вопрос("Есть не сохраненные данные - перезаполнить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
		//	ЗаполнитьТаблицу();	
		//	
		//конецесли;
	иначе
		ЗаполнитьТаблицу();	
	конецесли;
		
КонецПроцедуры

&НаКлиенте
Функция ДанныеПоМинибаруИтогПринять()
Для Каждого Строка Из Объект.ДанныеПоМинибару Цикл
	Если Строка.Принять Тогда Возврат Истина; КонецЕсли;
КонецЦикла;
Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ЗавершитьВопросЕстьНеСохраненныеДанные(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Да тогда
	ЗаполнитьТаблицу();	
конецесли;
КонецПроцедуры
//

//

&НаКлиенте
Функция ЗаполнитьТаблицу____()
 //   Перерисовать=Истина;
 //   		//Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
 //   		//				|	ЗанятостьНомеров.Номер КАК НомерКомнаты,
 //   		//				|	ЗанятостьНомеров.Клиент КАК Гость,
 //   		//				|	УборкиНомеров.Горничная,
 //   		//				|	УборкиНомеров.Минибар КАК МиниБарОтГорничной,
 //   		//				|	ЗанятостьНомеров.Регистратор КАК Бронь,
 //   		//				|	УборкиНомеров.ВремяУброки КАК ВремяУборки
 //   		//				|ИЗ
 //   		//				|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
 //   		//				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
 //   		//				|		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
 //   		//				|			И (НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ))
 //   		//				|ГДЕ
 //   		//				|	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
 //   		//				|	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
 //   		//				|	И УборкиНомеров.Минибар <> """"
 //   		//				|	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	

 //   	Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
 //   	                    |	ЗанятостьНомеров.Номер КАК НомерКомнаты,
 //   	                    |	ЗанятостьНомеров.Клиент КАК Гость,
 //   	                    |	УборкиНомеров.Горничная,
 //   	                    |	УборкиНомеров.Минибар КАК МиниБарОтГорничной,
 //   	                    |	ЗанятостьНомеров.Регистратор КАК Бронь,
 //   	                    |	УборкиНомеров.ВремяУброки КАК ВремяУборки
 //   	                    |ИЗ
 //   	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
 //   	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
 //   	                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
 //   	                    |ГДЕ
 //   	                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
 //   	                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
 //   	                    |	И УборкиНомеров.Минибар <> """"
 //   	                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)
 //   	                    |
 //   	                    |ОБЪЕДИНИТЬ
 //   	                    |
 //   	                    |ВЫБРАТЬ РАЗЛИЧНЫЕ
 //   	                    |	ЗанятостьНомеров.Номер,
 //   	                    |	ЗанятостьНомеров.Клиент,
 //   	                    |	УборкиНомеров.Горничная,
 //   	                    |	УборкиНомеров.Минибар,
 //   	                    |	ЗанятостьНомеров.Регистратор,
 //   	                    |	УборкиНомеров.ВремяУброки
 //   	                    |ИЗ
 //   	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
 //   	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
 //   	                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
 //   	                    |ГДЕ
 //   	                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
 //   	                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период2
 //   	                    |	И УборкиНомеров.Минибар <> """"
 //   	                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	
 //   Запрос.УстановитьПараметр("Период",НачалоДня(ДатаУборки));
 //   Запрос.УстановитьПараметр("Период2",НачалоДня(ДатаУборки-86400));

 //   Запрос.УстановитьПараметр("КомментарийАдминистрации","%<Минибар зафиксирован>%");

 //   ТЗ=Запрос.Выполнить().Выгрузить();
 //   ДанныеПоМинибару.Очистить();	
 //   Для каждого СтрМБ Из ТЗ Цикл
 //   
 //   	НовД=ДанныеПоМинибару.Добавить();
 //   	НовД.Бронь=СтрМБ.Бронь;
 //   	Новд.ВремяУборки=СтрМБ.ВремяУборки;
 //   	НовД.Горничная=СтрМБ.Горничная;
 //   	НовД.Гость=СтрМБ.Гость;
 //   	НовД.МиниБарОтГорничной=СтрМБ.МиниБарОтГорничной;
 //   	НовД.НомерКомнаты=СтрМБ.НомерКомнаты;
 //   
 //   КонецЦикла;
 //   ЭлементыФормы.ДанныеПоМинибару.ОбновитьСтроки();
 //   Перерисовать=Ложь;
 //   Для каждого ТекСтр Из ДанныеПоМинибару Цикл
 //       ПоискСтр=Новый Структура("НомерКомнаты,ВремяУборки",ТекСтр.НомерКомнаты,ТекСтр.ВремяУборки);
 //   ТЗ=ДанныеПоМинибару.НайтиСтроки(ПоискСтр);
 //   Если ТЗ.Количество()=1 тогда
 //   	ТекСтр.Принять=Истина;
 //   конецесли;

 //   	
 //   
 //   КонецЦикла; 
 //
КонецФункции


&НаКлиенте
 Функция ЗаполнитьТаблицу()
ЗаполнитьТаблицуНаСервере();
ЗаполнитьДанныеПоМинибаруНаКлиенте();
КонецФункции
    
&НаСервере
Функция ЗаполнитьТаблицуНаСервере()
	//Перерисовать=Истина;
	
	////Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	////				|	ЗанятостьНомеров.Номер КАК НомерКомнаты,
	////				|	ЗанятостьНомеров.Клиент КАК Гость,
	////				|	УборкиНомеров.Горничная,
	////				|	УборкиНомеров.Минибар КАК МиниБарОтГорничной,
	////				|	ЗанятостьНомеров.Регистратор КАК Бронь,
	////				|	УборкиНомеров.ВремяУброки КАК ВремяУборки
	////				|ИЗ
	////				|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	////				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
	////				|		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
	////				|			И (НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ))
	////				|ГДЕ
	////				|	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
	////				|	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
	////				|	И УборкиНомеров.Минибар <> """"
	////				|	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	

	Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	ЗанятостьНомеров.Номер КАК НомерКомнаты,
	                    |	ЗанятостьНомеров.Клиент КАК Гость,
	                    |	УборкиНомеров.Горничная,
	                    |	УборкиНомеров.Минибар КАК МиниБарОтГорничной,
	                    |	ЗанятостьНомеров.Регистратор КАК Бронь,
	                    |	УборкиНомеров.ВремяУброки КАК ВремяУборки
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
	                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
	                    |ГДЕ
	                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
	                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
	                    |	И УборкиНомеров.Минибар <> """"
	                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)
	                    |
	                    |ОБЪЕДИНИТЬ
	                    |
	                    |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	ЗанятостьНомеров.Номер,
	                    |	ЗанятостьНомеров.Клиент,
	                    |	УборкиНомеров.Горничная,
	                    |	УборкиНомеров.Минибар,
	                    |	ЗанятостьНомеров.Регистратор,
	                    |	УборкиНомеров.ВремяУброки
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
	                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
	                    |ГДЕ
	                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
	                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период2
	                    |	И УборкиНомеров.Минибар <> """"
	                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	
	Запрос.УстановитьПараметр("Период",НачалоДня(Объект.ДатаУборки));
	Запрос.УстановитьПараметр("Период2",НачалоДня(Объект.ДатаУборки-86400));

	Запрос.УстановитьПараметр("КомментарийАдминистрации","%<Минибар зафиксирован>%");

	ТЗ=Запрос.Выполнить().Выгрузить();
	
	Объект.ДанныеПоМинибару.Очистить();
	
	// + ПСН
	ПредНомер = Справочники.НомернойФонд.ПустаяСсылка();
	Цвет = Ложь;
	// - ПСН
	
	Для каждого СтрМБ Из ТЗ Цикл  
	
		НовД=Объект.ДанныеПоМинибару.Добавить();
		НовД.Бронь=СтрМБ.Бронь;
		Новд.ВремяУборки=СтрМБ.ВремяУборки;
		НовД.Горничная=СтрМБ.Горничная;
		НовД.Гость=СтрМБ.Гость;
		НовД.МиниБарОтГорничной=СтрМБ.МиниБарОтГорничной;
		НовД.НомерКомнаты=СтрМБ.НомерКомнаты;
		
		// + ПСН
		//Если Перерисовать тогда
			Если НовД.НомерКомнаты<>ПредНомер тогда
				Цвет=Не Цвет;
				ПредНомер=НовД.НомерКомнаты;		
			конецесли;
			НовД.Цвет=Цвет;
		//КонецЕсли;		
		// - ПСН
		
	
	КонецЦикла;
	
	
//   //ЭлементыФормы.ДанныеПоМинибару.ОбновитьСтроки();
 //   Элементы.ДанныеПоМинибару.ЗакончитьРедактированиеСтроки(Ложь);
 //   
 //   Перерисовать=Ложь;
 //   Для каждого ТекСтр Из Объект.ДанныеПоМинибару Цикл
 //       ПоискСтр=Новый Структура("НомерКомнаты,ВремяУборки",ТекСтр.НомерКомнаты,ТекСтр.ВремяУборки);
 //   ТЗ= Объект.ДанныеПоМинибару.НайтиСтроки(ПоискСтр);
 //   Если ТЗ.Количество()=1 тогда
 //   	ТекСтр.Принять=Истина;
 //   конецесли;

 //   	
 //   
 //   КонецЦикла; 
 //
КонецФункции
         
&НаКлиенте
Функция ЗаполнитьДанныеПоМинибаруНаКлиенте()
	//Перерисовать=Истина;
	//		////Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//		////				|	ЗанятостьНомеров.Номер КАК НомерКомнаты,
	//		////				|	ЗанятостьНомеров.Клиент КАК Гость,
	//		////				|	УборкиНомеров.Горничная,
	//		////				|	УборкиНомеров.Минибар КАК МиниБарОтГорничной,
	//		////				|	ЗанятостьНомеров.Регистратор КАК Бронь,
	//		////				|	УборкиНомеров.ВремяУброки КАК ВремяУборки
	//		////				|ИЗ
	//		////				|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//		////				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
	//		////				|		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
	//		////				|			И (НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ))
	//		////				|ГДЕ
	//		////				|	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
	//		////				|	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
	//		////				|	И УборкиНомеров.Минибар <> """"
	//		////				|	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	

	//	Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	                    |	ЗанятостьНомеров.Номер КАК НомерКомнаты,
	//	                    |	ЗанятостьНомеров.Клиент КАК Гость,
	//	                    |	УборкиНомеров.Горничная,
	//	                    |	УборкиНомеров.Минибар КАК МиниБарОтГорничной,
	//	                    |	ЗанятостьНомеров.Регистратор КАК Бронь,
	//	                    |	УборкиНомеров.ВремяУброки КАК ВремяУборки
	//	                    |ИЗ
	//	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
	//	                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
	//	                    |ГДЕ
	//	                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
	//	                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
	//	                    |	И УборкиНомеров.Минибар <> """"
	//	                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)
	//	                    |
	//	                    |ОБЪЕДИНИТЬ
	//	                    |
	//	                    |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	                    |	ЗанятостьНомеров.Номер,
	//	                    |	ЗанятостьНомеров.Клиент,
	//	                    |	УборкиНомеров.Горничная,
	//	                    |	УборкиНомеров.Минибар,
	//	                    |	ЗанятостьНомеров.Регистратор,
	//	                    |	УборкиНомеров.ВремяУброки
	//	                    |ИЗ
	//	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
	//	                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
	//	                    |ГДЕ
	//	                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
	//	                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период2
	//	                    |	И УборкиНомеров.Минибар <> """"
	//	                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	
	//Запрос.УстановитьПараметр("Период",НачалоДня(Объект.ДатаУборки));
	//Запрос.УстановитьПараметр("Период2",НачалоДня(Объект.ДатаУборки-86400));

	//Запрос.УстановитьПараметр("КомментарийАдминистрации","%<Минибар зафиксирован>%");

	//ТЗ=Запрос.Выполнить().Выгрузить();
	//Объект.ДанныеПоМинибару.Очистить();	
	//Для каждого СтрМБ Из ТЗ Цикл  
	//
	//	НовД=Объект.ДанныеПоМинибару.Добавить();
	//	НовД.Бронь=СтрМБ.Бронь;
	//	Новд.ВремяУборки=СтрМБ.ВремяУборки;
	//	НовД.Горничная=СтрМБ.Горничная;
	//	НовД.Гость=СтрМБ.Гость;
	//	НовД.МиниБарОтГорничной=СтрМБ.МиниБарОтГорничной;
	//	НовД.НомерКомнаты=СтрМБ.НомерКомнаты;
	//
	//КонецЦикла;
	//
	
	//ЭлементыФормы.ДанныеПоМинибару.ОбновитьСтроки();
	Элементы.ДанныеПоМинибару.Обновить();
	
	//Перерисовать=Ложь;
	
	Для каждого ТекСтр Из Объект.ДанныеПоМинибару Цикл
	    ПоискСтр=Новый Структура("НомерКомнаты,ВремяУборки",ТекСтр.НомерКомнаты,ТекСтр.ВремяУборки);
		ТЗ= Объект.ДанныеПоМинибару.НайтиСтроки(ПоискСтр);
		Если ТЗ.Количество()=1 тогда
			ТекСтр.Принять=Истина;
		конецесли;
	
	КонецЦикла; 
 
КонецФункции
//

//
&НаКлиенте
Процедура КнопкаВыполнитьНажатие___(Кнопка)
//Для каждого СтрТаб Из ДанныеПоМинибару Цикл
//	Если СтрТаб.Принять тогда
//		ОбДок=СтрТаб.Бронь.ПолучитьОбъект();
//		СпрТов=Справочники.Товары.Выбрать();
//		Пока СпрТов.Следующий() цикл
//			
//			КолВо=СтрЧислоВхождений(СтрТаб.МиниБарОтГорничной,СпрТов.НазваниеУГорничной);
//			Если КолВо>0 тогда
//				ПоискУсл=Справочники.ДопУслуги.НайтиПоРеквизиту("Товар",СпрТов.Ссылка);
//				Если НЕ ПоискУсл.Пустая() тогда
//				НовТов=ОбДок.ДопУслуги.Добавить();
//				НовТов.ВремяУборки=СтрТаб.ВремяУборки;
//				НовТов.ДатаУслуги=ДатаУборки;
//				НовТов.КолВо=КолВо;
//				НовТов.ОтГорничной=Истина;
//				НовТов.Услуга=ПоискУсл.Ссылка;
//				НовТов.Цена=ПоискУсл.Цена;
//				конецесли;
//			конецесли;
//			
//		КонецЦикла;
//		 ОбДок.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
//		 НЗ=РегистрыСведений.УборкиНомеров.СоздатьНаборЗаписей();
//		 НЗ.Отбор.ВремяУброки.Установить(СтрТаб.ВремяУборки);
//		 НЗ.Отбор.Комната.Установить(СтрТаб.НомерКомнаты);
//		 НЗ.Прочитать();
//		 Для каждого Стр Из НЗ Цикл			 
//			 Стр.КомментарийАдминистрации=Стр.КомментарийАдминистрации+"<Минибар зафиксирован>";
//		 КонецЦикла;      
//		 НЗ.Записать();
//		 
//	 конецесли;
//	
//		
//	

// КонецЦикла; 
// ЗаполнитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
ВыполнитьКомандаНаСервере();

ЗаполнитьДанныеПоМинибаруНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандаНаСервере()  
Для каждого СтрТаб Из Объект.ДанныеПоМинибару Цикл
	Если СтрТаб.Принять тогда
		ОбДок=СтрТаб.Бронь.ПолучитьОбъект();
		СпрТов=Справочники.Товары.Выбрать();
		Пока СпрТов.Следующий() цикл
			
			КолВо=СтрЧислоВхождений(СтрТаб.МиниБарОтГорничной,СпрТов.НазваниеУГорничной);
			Если КолВо>0 тогда
				ПоискУсл=Справочники.ДопУслуги.НайтиПоРеквизиту("Товар",СпрТов.Ссылка);
				Если НЕ ПоискУсл.Пустая() тогда
				НовТов=ОбДок.ДопУслуги.Добавить();
				НовТов.ВремяУборки=СтрТаб.ВремяУборки;
				НовТов.ДатаУслуги= Объект.ДатаУборки;  
				НовТов.КолВо=КолВо;
				НовТов.ОтГорничной=Истина;
				НовТов.Услуга=ПоискУсл.Ссылка;
				НовТов.Цена=ПоискУсл.Цена;
				конецесли;
			конецесли;
			
		КонецЦикла;
		 ОбДок.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		 НЗ=РегистрыСведений.УборкиНомеров.СоздатьНаборЗаписей();
		 НЗ.Отбор.ВремяУброки.Установить(СтрТаб.ВремяУборки);
		 НЗ.Отбор.Комната.Установить(СтрТаб.НомерКомнаты);
		 НЗ.Прочитать();
		 Для каждого Стр Из НЗ Цикл			 
			 Стр.КомментарийАдминистрации=Стр.КомментарийАдминистрации+"<Минибар зафиксирован>";
		 КонецЦикла;      
		 НЗ.Записать();
		 
	 конецесли;
	
		
	

 КонецЦикла; 
 
 ЗаполнитьТаблицуНаСервере();
 
КонецПроцедуры


//
&НаКлиенте
Процедура ДанныеПоМинибаруВыбор___(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	//Если Колонка.имя="Бронь" тогда
	//	Об=ВыбраннаяСтрока.Бронь.получитьОбъект();
	//	Об.ПолучитьФорму().открыть();
	//конецесли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПоМинибаруВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если Поле.имя="ДанныеПоМинибаруБронь" тогда
	//Об=ВыбраннаяСтрока.Бронь.получитьОбъект();
	//Об.ПолучитьФорму().открыть();
	
	Бронь =  Элемент.ТекущиеДанные.Бронь;
	ПарамФормы = Новый Структура("Ключ", Бронь);
	ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПарамФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

конецесли;
КонецПроцедуры

//
&НаКлиенте
Процедура ДанныеПоМинибаруПередУдалением___(Элемент, Отказ)
	//Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоМинибаруПередУдалением(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДанныеПоМинибаруПриОкончанииРедактирования___(Элемент, НоваяСтрока, ОтменаРедактирования)
//	ТекСтр=ЭлементыФормы.ДанныеПоМинибару.ТекущаяСтрока;
//	ПоискСтр=Новый Структура("НомерКомнаты,ВремяУборки",ТекСтр.НомерКомнаты,ТекСтр.ВремяУборки);
//	ТЗ=ДанныеПоМинибару.НайтиСтроки(ПоискСтр);
//	Если ТЗ.Количество()>1 тогда
//		Для каждого Стр Из ТЗ Цикл
//		
//			Если Стр.Бронь=ТекСтр.бронь тогда
//				Продолжить;
//			иначе
//				Стр.Принять=ложь;
//			конецесли;
//			
//		
//		КонецЦикла; 	
//	конецесли;
//ПредНомер=Справочники.НомернойФонд.ПустаяСсылка();
//Цвет=Ложь;
//Перерисовать=Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоМинибаруПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//ТекСтр=Элементы.ДанныеПоМинибару.ТекущаяСтрока;
	ТекСтр=Элементы.ДанныеПоМинибару.ТекущиеДанные;
	
	ПоискСтр=Новый Структура("НомерКомнаты,ВремяУборки",ТекСтр.НомерКомнаты,ТекСтр.ВремяУборки);
	ТЗ= Объект.ДанныеПоМинибару.НайтиСтроки(ПоискСтр);
	Если ТЗ.Количество()>1 тогда
		Для каждого Стр Из ТЗ Цикл
		
			Если Стр.Бронь=ТекСтр.бронь тогда
				Продолжить;
			иначе
				Стр.Принять=ложь;
			конецесли;
			
		
		КонецЦикла; 	
	конецесли;
	
//ПредНомер=ПредопределенноеЗначение("Справочник.НомернойФонд.ПустаяСсылка");
//Цвет=Ложь;
//Перерисовать=Ложь;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДанныеПоМинибаруПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
//

// + ПСН
&НаКлиенте
Процедура ДанныеПоМинибаруПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
// - ПСН



////////////
//ПредНомер= ПредопределенноеЗначение("Справочник.НомернойФонд.ПустаяСсылка");
//Цвет=Ложь;
//Перерисовать=истина;


