//
&НаКлиенте
Процедура ПриОткрытии___()
	//
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Гость поздно выселен из программы");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Тарификация за пол суток как с 6 утра");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Оплата согласно брони");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Аннуляционный сбор");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Комплементарный заезд-выезд");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Ошибка выставления тарифа");
	//ЭлементыФормы.ПроданныеНомера.Колонки.Комментарий.ЭлементУправления.СписокВыбора.Добавить("Дополнительное место");
	//
	//Если ЭтоНовый() тогда
	//	Автор=ТекПол;
	//	ЗаполнитьТаб();
	//конецесли;
	//Если  ПроданныеНомера.Количество()=0 тогда
	//	ЗаполнитьТаб();
	//	Записать(РежимЗаписиДокумента.Запись);
	//иначе
	//	
	//	если ТекПол.Админ тогда
	//		ЭлементыФормы.Проверка.Доступность=Истина;
	//	иначе
	//		ЭлементыФормы.Проверка.Доступность=Ложь;
	//	конецесли;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЗаполнитьКомментарийСвойства(Элементы.ПроданныеНомераКомментарий);	

ДобавитьПроданныеНомераОтклонения();

ТекПол = ПараметрыСеанса["ТекущийПользователь"];
//Если ЭтоНовый() тогда
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
	//ТекПол = ОбщиеСервер.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
	Автор=ТекПол;
	
	// + ПСН
	Объект.Дата = ТекущаяДата();
	Объект.ДатаОтбора = ТекущаяДата();
	// - ПСН
	
	ЗаполнитьТаб();
конецесли;
   
//Если  Объект.ПроданныеНомера.Количество() = 0 тогда
//	ЗаполнитьТаб();
//	ЗаполнитьПроданныеНомераОтклонения();

//	//Записать(РежимЗаписиДокумента.Запись);
//	//ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
//	ЭтотОбъект.Записать();
//иначе
//	
//	если ТекПол.Админ тогда
//		Элементы.Проверка.Доступность=Истина;
//	иначе
//		Элементы.Проверка.Доступность=Ложь;
//	конецесли;
//КонецЕсли;

ЗаполнитьПроданныеНомераОтклонения();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомментарийСвойства(ЭлементКомментарий)
ЭлементКомментарий.КнопкаВыпадающегоСписка = Истина;
ЭлементКомментарий.КнопкаОчистки = Истина;

ЭлементКомментарий.СписокВыбора.Добавить("Гость поздно выселен из программы");
ЭлементКомментарий.СписокВыбора.Добавить("Тарификация за пол суток как с 6 утра");
ЭлементКомментарий.СписокВыбора.Добавить("Оплата согласно брони");
ЭлементКомментарий.СписокВыбора.Добавить("Аннуляционный сбор");
ЭлементКомментарий.СписокВыбора.Добавить("Комплементарный заезд-выезд");
ЭлементКомментарий.СписокВыбора.Добавить("Ошибка выставления тарифа");
ЭлементКомментарий.СписокВыбора.Добавить("Дополнительное место");
КонецПроцедуры

&НаСервере
Процедура ДобавитьПроданныеНомераОтклонения()
ТЗРеквизиты = ОбщийФункционалСервер.РеквизитыИзТабличнаяЧастьДокумента("ЕжедневныйАудит", "ПроданныеНомера");	

ИмяРеквизитаФормы = "ПроданныеНомераОтклонения";

МассивТипа = Новый Массив;
МассивТипа.Добавить(Тип("ТаблицаЗначений"));
ОписаниеТипа = Новый ОписаниеТипов(МассивТипа);
МассивРеквизитов = Новый Массив;
МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаФормы, ОписаниеТипа, ""));

Для Каждого Строка Из ТЗРеквизиты Цикл
	МассивРеквизитов.Добавить(Новый РеквизитФормы(Строка.Имя, Строка.Тип, ИмяРеквизитаФормы, Строка.Синоним));
КонецЦикла;

МассивТипа = Новый Массив;
МассивТипа.Добавить(Тип("Число"));
ОписаниеТипа = Новый ОписаниеТипов(МассивТипа, Новый КвалификаторыЧисла(4));
МассивРеквизитов.Добавить(Новый РеквизитФормы("НомерСтроки", ОписаниеТипа, ИмяРеквизитаФормы));

ИзменитьРеквизиты(МассивРеквизитов); 

ГруппаПроданныеНомераОтклонения = Элементы.ГруппаПроданныеНомераОтклонения;
ЭлементПроданныеНомераОтклонения = Элементы.Добавить(ИмяРеквизитаФормы, Тип("ТаблицаФормы"), ГруппаПроданныеНомераОтклонения);
ЭлементПроданныеНомераОтклонения.ПутьКДанным = ИмяРеквизитаФормы;
ЭлементПроданныеНомераОтклонения.Отображение = ОтображениеТаблицы.Список;

ЭлементПроданныеНомераОтклонения.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_ПроданныеНомераОтклоненияПередНачаломДобавления");
ЭлементПроданныеНомераОтклонения.УстановитьДействие("ПередУдалением", "Подключаемый_ПроданныеНомераОтклоненияПередУдалением");

//ЭлементПроданныеНомераОтклонения.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;  

//123456789012345
//ПроданныеНомера
//12345678901234567890123
//Объект.ПроданныеНомера
Для Каждого Элемент Из Элементы.ПроданныеНомера.ПодчиненныеЭлементы Цикл
	
	Если ТипЗнч(Элемент.Вид) = Тип("ВидГруппыФормы") Тогда 
		Имя = Сред(Элемент.Имя, 16); 
		НоваяГруппа = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ЭлементПроданныеНомераОтклонения);  
		НоваяГруппа.Заголовок = Элемент.Заголовок;
		НоваяГруппа.Видимость = Элемент.Видимость;
		Для Каждого ЭлементГруппы Из Элемент.ПодчиненныеЭлементы Цикл
			ДобавитьЭлемент(ЭлементГруппы, ИмяРеквизитаФормы, НоваяГруппа);
		КонецЦикла
	Иначе
		ДобавитьЭлемент(Элемент, ИмяРеквизитаФормы, ЭлементПроданныеНомераОтклонения);
	КонецЕсли;    
КонецЦикла;
ЭлементКомментарий = ЭлементПроданныеНомераОтклонения.ПодчиненныеЭлементы.Найти(ИмяРеквизитаФормы + "Комментарий");
ЗаполнитьКомментарийСвойства(ЭлементКомментарий);

ЭлементКомментарий.УстановитьДействие("ПриИзменении", "ПроданныеНомераОтклоненияКомментарийПриИзменении");
КонецПроцедуры

&НаСервере
Процедура ДобавитьПроданныеНомераОтклонения_1()
ТЗРеквизиты = ОбщийФункционалСервер.РеквизитыИзТабличнаяЧастьДокумента("ЕжедневныйАудит", "ПроданныеНомера");	

ИмяРеквизитаФормы = "ПроданныеНомераОтклонения";

МассивТипа = Новый Массив;
МассивТипа.Добавить(Тип("ТаблицаЗначений"));
ОписаниеТипа = Новый ОписаниеТипов(МассивТипа);
МассивРеквизитов = Новый Массив;
МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаФормы, ОписаниеТипа, ""));

Для Каждого Строка Из ТЗРеквизиты Цикл
	МассивРеквизитов.Добавить(Новый РеквизитФормы(Строка.Имя, Строка.Тип, ИмяРеквизитаФормы, Строка.Синоним));
КонецЦикла;

МассивТипа = Новый Массив;
МассивТипа.Добавить(Тип("Число"));
ОписаниеТипа = Новый ОписаниеТипов(МассивТипа, Новый КвалификаторыЧисла(4));
МассивРеквизитов.Добавить(Новый РеквизитФормы("НомерСтроки", ОписаниеТипа, ИмяРеквизитаФормы));

ИзменитьРеквизиты(МассивРеквизитов); 

ГруппаПроданныеНомераОтклонения = Элементы.ГруппаПроданныеНомераОтклонения;
ЭлементПроданныеНомераОтклонения = Элементы.Добавить(ИмяРеквизитаФормы, Тип("ТаблицаФормы"), ГруппаПроданныеНомераОтклонения);
ЭлементПроданныеНомераОтклонения.ПутьКДанным = ИмяРеквизитаФормы;
ЭлементПроданныеНомераОтклонения.Отображение = ОтображениеТаблицы.Список;

ЭлементПроданныеНомераОтклонения.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_ПроданныеНомераОтклоненияПередНачаломДобавления");
ЭлементПроданныеНомераОтклонения.УстановитьДействие("ПередУдалением", "Подключаемый_ПроданныеНомераОтклоненияПередУдалением");

//ЭлементПроданныеНомераОтклонения.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;  

//123456789012345
//ПроданныеНомера
//12345678901234567890123
//Объект.ПроданныеНомера
Для Каждого Элемент Из Элементы.ПроданныеНомера.ПодчиненныеЭлементы Цикл
	
	Если ТипЗнч(Элемент.Вид) = Тип("ВидГруппыФормы") Тогда 
		Имя = Сред(Элемент.Имя, 16); 
		НоваяГруппа = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ЭлементПроданныеНомераОтклонения);  
		НоваяГруппа.Заголовок = Элемент.Заголовок;
		НоваяГруппа.Видимость = Элемент.Видимость;
		Для Каждого ЭлементГруппы Из Элемент.ПодчиненныеЭлементы Цикл
			ДобавитьЭлемент(ЭлементГруппы, ИмяРеквизитаФормы, НоваяГруппа);
		КонецЦикла
	Иначе
		ДобавитьЭлемент(Элемент, ИмяРеквизитаФормы, ЭлементПроданныеНомераОтклонения);
	КонецЕсли;    
КонецЦикла;
ЭлементКомментарий = ЭлементПроданныеНомераОтклонения.ПодчиненныеЭлементы.Найти(ИмяРеквизитаФормы + "Комментарий");
ЗаполнитьКомментарийСвойства(ЭлементКомментарий);

ЭлементКомментарий.УстановитьДействие("ПриИзменении", "ПроданныеНомераОтклоненияКомментарийПриИзменении");
КонецПроцедуры


&НаСервере                                
Процедура ДобавитьЭлемент(ИсходныйЭлемент, ИмяРеквизитаФормы, ЭлементРодитель)
Имя = Сред(ИсходныйЭлемент.Имя, 16);
Имя = ИмяРеквизитаФормы + Имя;
НовыйЭлемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), ЭлементРодитель);  

НовыйЭлемент.Вид = ИсходныйЭлемент.Вид;  
ПутьКДанным = Сред(ИсходныйЭлемент.ПутьКДанным, 24);
НовыйЭлемент.ПутьКДанным = ИмяРеквизитаФормы + "." + ПутьКДанным;

НовыйЭлемент.Заголовок = ИсходныйЭлемент.Заголовок;  

НовыйЭлемент.Видимость = ИсходныйЭлемент.Видимость;

НовыйЭлемент.ТолькоПросмотр = ИсходныйЭлемент.ТолькоПросмотр;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроданныеНомераОтклонения()
ЭтаФорма["ПроданныеНомераОтклонения"].Очистить();

Для Каждого Строка Из Объект.ПроданныеНомера Цикл
	Если Строка.СуммаЗаПроживаниеОтклонение = 0 
	И Строка.СуммаЗаПроживаниеОтклонениеЧасы = 0
	И Строка.СуммаОплатыИтого = Строка.СуммаЗаПроживаниеФактЧасы
	Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = ЭтаФорма["ПроданныеНомераОтклонения"].Добавить();	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//
КП = Элементы.ПроданныеНомераОтклоненияКоманднаяПанель.ПодчиненныеЭлементы;
Кнопка = КП.Найти("ПроданныеНомераОтклоненияДобавить");
Кнопка.Видимость = Ложь;
Кнопка = КП.Найти("ПроданныеНомераОтклоненияУдалить");
Кнопка.Видимость = Ложь;
Кнопка = КП.Найти("ПроданныеНомераОтклоненияСкопировать");
Кнопка.Видимость = Ложь;

КПКМ = Элементы.ПроданныеНомераОтклоненияКонтекстноеМеню.ПодчиненныеЭлементы;
Кнопка = КПКМ.Найти("ПроданныеНомераОтклоненияКонтекстноеМенюДобавить");
Кнопка.Видимость = Ложь;
Кнопка = КПКМ.Найти("ПроданныеНомераОтклоненияКонтекстноеМенюУдалить");
Кнопка.Видимость = Ложь;
Кнопка = КПКМ.Найти("ПроданныеНомераОтклоненияКонтекстноеМенюСкопировать");
Кнопка.Видимость = Ложь;
//
КонецПроцедуры

&НаСервере                                
Функция ЗаполнитьТаб__()
	//ПроданныеНомера.Очистить();
	//Незаезды.Очистить();
	//Аннуляции.Очистить();
	//ЗапросПроживающих=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗанятостьНомеров.Регистратор,
	//|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	//|	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф,
	//|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	//|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд,
	//|	ЗанятостьНомеров.Регистратор.Бронирует  КАК Бронирует
	//|ИЗ
	//|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//|ГДЕ
	//|	(ЗанятостьНомеров.Регистратор.Статус = &Статус
	//|			ИЛИ ЗанятостьНомеров.Регистратор.Статус = &Статус2)
	//|	И (ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//|			ИЛИ ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН2 И &ДК2)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗанятостьНомеров.Номер.Наименование");
	//ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);								   
	//ЗапросПроживающих.УстановитьПараметр("Статус2",Перечисления.СтатусБрони.Выехал);	
	//ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(Дата)+11*60*60);								   
	//ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(Дата));	
	//ЗапросПроживающих.УстановитьПараметр("ДН2",НачалоДня(Дата)+11*60*60);//КонецДня(Дата));								   
	//ЗапросПроживающих.УстановитьПараметр("ДК2",КонецДня(Дата)+9*60*60);	
	//ЗапросПроживающих.УстановитьПараметр("ДН3",НачалоДня(Дата));								   
	//ЗапросПроживающих.УстановитьПараметр("ДК3",НачалоДня(Дата)+8*60*60);	
	//////|	И (НЕ(ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН3 И &ДК3))
	//ТЗ=ЗапросПроживающих.Выполнить().Выгрузить();
	//Для каждого Стр Из ТЗ Цикл
	//	Если Стр.Заезд>Дата(2000,1,1) и Стр.Заезд>КонецДня(Дата)+9*60*60 тогда
	//		Продолжить;
	//	конецесли;
	//	
	//	//Если Стр.Заезд>Дата(2000,1,1) и Стр.Заезд>КонецДня(Дата)+8*86400 тогда
	//	//	Продолжить;
	//	//конецесли;
	//	
	//	Если Стр.Выезд>Дата(2000,1,1) и Стр.Выезд<НачалоДня(Дата) тогда
	//		Продолжить;
	//	конецесли;
	//	
	//	Если Стр.Тариф.Код="000000400" тогда // романик
	//		Если Стр.Заезд>Дата(2000,1,1) и Стр.Выезд>Дата(2000,1,1) тогда
	//			Если НачалоДня(Стр.Заезд)<>НачалоДня(Стр.Выезд) тогда
	//				если Стр.Заезд<НачалоДня(Дата) тогда //вчерашний романтик
	//					Продолжить;	
	//				конецесли;
	//				
	//			конецесли;				
	//		конецесли;
	//	конецесли;
	//	
	//	
	//	Нов=ПроданныеНомера.Добавить();
	//	Нов.Бронь=Стр.Регистратор;
	//	Нов.Клиент=Стр.Клиент;
	//	Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
	//	Нов.Заезд=Стр.Заезд;
	//	Нов.ЗаездКоррекция=Стр.Заезд;
	//	Нов.Выезд=Стр.Выезд;
	//	Нов.ВыездКоррекция=Стр.Выезд;
	//	Нов.Тариф=ТарифНаДату(Нов.Бронь,НАчалоДня(Дата));
	//	Нов.ТарифКоррекция=Нов.Тариф;
	//	//Политов
	//	Нов.Бронирует=Стр.Бронирует;  
	//	///Политов
	//	Для каждого СтрУ из Нов.Бронь.ДопУслуги цикл
	//		Если СтрУ.Услуга.Наименование="Ужин" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Дата) тогда 	
	//			//Нов.СуммаПолупансион=Нов.СуммаПолупансион+СтрУ.Цена*СтрУ.КолВо;
	//		иначеесли  СтрУ.Услуга.Родитель.Код="000000796" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Дата) тогда
	//			Нов.СуммаДопМесто=Нов.СуммаДопМесто+СтрУ.Цена*СтрУ.КолВо;
	//		иначеесли  СтрУ.Услуга.Родитель.Код="000000284" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Дата) тогда
	//			Нов.СуммаКоррекция=Нов.СуммаКоррекция+СтрУ.Цена*СтрУ.КолВо;
	//		конецесли;
	//		
	//	КонецЦикла;
	//	
	//	Нов.СуммаЗаПроживание=РасчитатьСтоимостьФакт(Нов)+Нов.СуммаДопМесто;
	//	Нов.СуммаЗаПроживаниеПлан=РасчитатьСтоимостьПлан(Нов);//+Нов.СуммаДопМесто;
	//	
	//	
	//КонецЦикла; 
	//Нов=ПроданныеНомера.Добавить();
	//
	//// Незаезды
	//
	//ЗапросНезаездов=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗанятостьНомеров.Регистратор,
	//|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	//|	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф,
	//|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	//|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд
	//|ИЗ
	//|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//|ГДЕ
	//|	ЗанятостьНомеров.Регистратор.Статус = &Статус
	//|	
	//|	И (ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//|)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗанятостьНомеров.Номер.Наименование");
	//
	//ЗапросНезаездов.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);								   
	//ЗапросНезаездов.УстановитьПараметр("ДН",НачалоДня(Дата));								   
	//ЗапросНезаездов.УстановитьПараметр("ДК",КонецДня(Дата));	
	//ЗапросНезаездов.УстановитьПараметр("ДН2",КонецДня(Дата));								   
	//ЗапросНезаездов.УстановитьПараметр("ДК2",КонецДня(Дата)+8*60*60);	
	//ЗапросНезаездов.УстановитьПараметр("ДН3",НачалоДня(Дата));								   
	//ЗапросНезаездов.УстановитьПараметр("ДК3",НачалоДня(Дата)+8*60*60);	
	//ТЗ=ЗапросНезаездов.Выполнить().Выгрузить();
	//
	//Для каждого Стр Из ТЗ Цикл
	//	
	//	
	//	Нов=Незаезды.Добавить();
	//	Нов.Бронь=Стр.Регистратор;
	//	Нов.Клиент=Стр.Клиент;
	//	Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
	//	
	//	
	//КонецЦикла; 
	//
	//
	//ЗапросАннул=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗанятостьНомеров.Регистратор,
	//|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	//|	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф,
	//|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	//|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд
	//|ИЗ
	//|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//|ГДЕ
	//|	ЗанятостьНомеров.Регистратор.Статус = &Статус
	//|	И ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗанятостьНомеров.Номер.Наименование");
	//ЗапросАннул=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗаявкаНаБронирование.Ссылка КАК Регистратор,
	//|	ЗаявкаНаБронирование.Клиент,
	//|	ЗаявкаНаБронирование.Тариф
	//|ИЗ
	//|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//|ГДЕ
	//|	ЗаявкаНаБронирование.Ссылка.ДатаАннуляции МЕЖДУ &ДН И &ДК
	//|	И ЗаявкаНаБронирование.Статус = &Статус");
	//
	//ЗапросАннул.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);								   
	//ЗапросАннул.УстановитьПараметр("ДН",НачалоДня(Дата));								   
	//ЗапросАннул.УстановитьПараметр("ДК",КонецДня(Дата+86400));	
	//ТЗ=ЗапросАннул.Выполнить().Выгрузить();
	//
	//Для каждого Стр Из ТЗ Цикл
	//	
	//	
	//	Нов=Аннуляции.Добавить();
	//	Нов.Бронь=Стр.Регистратор;
	//	Нов.Клиент=Стр.Клиент;
	//	Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
	//	
	//	
	//КонецЦикла; 
	//
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаб()
	Объект.ПроданныеНомера.Очистить();
	Объект.Незаезды.Очистить();
	Объект.Аннуляции.Очистить();
	
	//ЗапросПроживающих=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//   |	ЗанятостьНомеров.Регистратор КАК Регистратор,
	//   |	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	//   |	ЗанятостьНомеров.Регистратор.Тариф КАК Тариф,
	//   |	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	//   |	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд,
	//   |	ЗанятостьНомеров.Регистратор.Бронирует КАК Бронирует,
	//   |	ЗанятостьНомеров.Номер.Наименование КАК НомерНаименование
	//   |ИЗ
	//   |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	//   |ГДЕ
	//   |	(ЗанятостьНомеров.Регистратор.Статус = &Статус
	//   |			ИЛИ ЗанятостьНомеров.Регистратор.Статус = &Статус2)
	//   |	И (ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	//   |			ИЛИ ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН2 И &ДК2
	//   |			ИЛИ ЗанятостьНомеров.Регистратор.ВремяВыездаТочное МЕЖДУ &ДНВыезд И &ДКВыезд)
	//   |
	//   |УПОРЯДОЧИТЬ ПО
	//   |	НомерНаименование");

	ЗапросПроживающих=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	ЗанятостьНомеров.Регистратор КАК Регистратор,
	                               |	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	                               |	ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется КАК Тариф_НеИспользуется,
	                               |	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	                               |	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд,
	                               |	ЗанятостьНомеров.Регистратор.Бронирует КАК Бронирует,
	                               |	ЗанятостьНомеров.НомерНаименование КАК НомерНаименование,
	                               |	Оплачено.СуммаОплатыКарта КАК СуммаОплатыКарта,
	                               |	Оплачено.СуммаОплатыНаличные КАК СуммаОплатыНаличные,
	                               |	Оплачено.СуммаОплатыБезнал КАК СуммаОплатыБезнал
	                               |ИЗ
	                               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |		ЗанятостьНомеров.Регистратор КАК Регистратор,
	                               |		ЗанятостьНомеров.Номер.Наименование КАК НомерНаименование
	                               |	ИЗ
	                               |		РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                               |	ГДЕ
	                               |		(ЗанятостьНомеров.Регистратор.Статус = &Статус
	                               |				ИЛИ ЗанятостьНомеров.Регистратор.Статус = &Статус2)
	                               |		И (ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                               |				ИЛИ ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН2 И &ДК2
	                               |				ИЛИ ЗанятостьНомеров.Регистратор.ВремяВыездаТочное МЕЖДУ &ДНВыезд И &ДКВыезд)) КАК ЗанятостьНомеров
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	                               |			СУММА(ОплатыКарта.СуммаОплаты) КАК СуммаОплатыКарта,
	                               |			СУММА(ОплатыНал.СуммаОплаты) КАК СуммаОплатыНаличные,
	                               |			СУММА(ОплатыБезнал.СуммаОплаты) КАК СуммаОплатыБезнал
	                               |		ИЗ
	                               |			(ВЫБРАТЬ
	                               |				ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	                               |				ЗаявкаНаБронированиеПроживание.ГУИД КАК ГУИД
	                               |			ИЗ
	                               |				Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                               |			ГДЕ
	                               |				ЗаявкаНаБронированиеПроживание.ДеньПроживания = &ДеньПроживания
	                               |			
	                               |			ОБЪЕДИНИТЬ
	                               |			
	                               |			ВЫБРАТЬ
	                               |				ЗаявкаНаБронированиеДопУслуги.Ссылка,
	                               |				ЗаявкаНаБронированиеДопУслуги.ГУИД
	                               |			ИЗ
	                               |				Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
	                               |			ГДЕ
	                               |				ЗаявкаНаБронированиеДопУслуги.Услуга.ПрограммныйКод = ""ДополнительноеМесто""
	                               |				И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги = &ДеньПроживания) КАК ЗаявкаНаБронированиеПроживание
	                               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
	                               |					СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
	                               |				ИЗ
	                               |					Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
	                               |						ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты
	                               |				ГДЕ
	                               |					ВЫБОР
	                               |							КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
	                               |								ТОГДА ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты.КредитнаяКарта = ИСТИНА
	                               |							ИНАЧЕ ЛОЖЬ
	                               |						КОНЕЦ
	                               |				
	                               |				СГРУППИРОВАТЬ ПО
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК ОплатыКарта
	                               |				ПО ЗаявкаНаБронированиеПроживание.ГУИД = ОплатыКарта.ДолгиГУИД
	                               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
	                               |					СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
	                               |				ИЗ
	                               |					Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
	                               |						ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты
	                               |				ГДЕ
	                               |					ВЫБОР
	                               |							КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
	                               |								ТОГДА ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты.КредитнаяКарта = ЛОЖЬ
	                               |							ИНАЧЕ ЛОЖЬ
	                               |						КОНЕЦ
	                               |				
	                               |				СГРУППИРОВАТЬ ПО
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК ОплатыНал
	                               |				ПО ЗаявкаНаБронированиеПроживание.ГУИД = ОплатыНал.ДолгиГУИД
	                               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
	                               |					СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
	                               |				ИЗ
	                               |					Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
	                               |						ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты
	                               |				ГДЕ
	                               |					ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
	                               |				
	                               |				СГРУППИРОВАТЬ ПО
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
	                               |					ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД) КАК ОплатыБезнал
	                               |				ПО ЗаявкаНаБронированиеПроживание.ГУИД = ОплатыБезнал.ДолгиГУИД
	                               |		
	                               |		СГРУППИРОВАТЬ ПО
	                               |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК Оплачено
	                               |		ПО ЗанятостьНомеров.Регистратор = Оплачено.Ссылка");
	
	
	ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);								   
	ЗапросПроживающих.УстановитьПараметр("Статус2",Перечисления.СтатусБрони.Выехал);	
	
	// + ПСН
	//ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(Объект.Дата)+11*60*60);								   
	//ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(Объект.Дата));	
	//ЗапросПроживающих.УстановитьПараметр("ДН2",НачалоДня(Объект.Дата)+11*60*60);//КонецДня(Дата));								   
	//ЗапросПроживающих.УстановитьПараметр("ДК2",КонецДня(Объект.Дата)+9*60*60);	
	ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(Объект.ДатаОтбора));								   
	ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(Объект.ДатаОтбора));	
	ЗапросПроживающих.УстановитьПараметр("ДН2",НачалоДня(Объект.ДатаОтбора));//КонецДня(Дата));								   
	ЗапросПроживающих.УстановитьПараметр("ДК2",КонецДня(Объект.ДатаОтбора));		
	
	ЗапросПроживающих.УстановитьПараметр("ДНВыезд",НачалоДня(Объект.ДатаОтбора));//КонецДня(Дата));								   
	ЗапросПроживающих.УстановитьПараметр("ДКВыезд",КонецДня(Объект.ДатаОтбора));		
	
	ЗапросПроживающих.УстановитьПараметр("ДеньПроживания",НачалоДня(Объект.ДатаОтбора));		
	// - ПСН
	
	// + ПСН
	//ЗапросПроживающих.УстановитьПараметр("ДН3",НачалоДня(Объект.Дата));								   
	//ЗапросПроживающих.УстановитьПараметр("ДК3",НачалоДня(Объект.Дата)+8*60*60);	
	//////|	И (НЕ(ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное МЕЖДУ &ДН3 И &ДК3))
	// - ПСН
	ТЗ=ЗапросПроживающих.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		// + ПСН
		//Если Стр.Заезд>Дата(2000,1,1) и Стр.Заезд>КонецДня(Объект.Дата)+9*60*60 тогда
		//	Продолжить;
		//конецесли;
		// - ПСН
		
		////Если Стр.Заезд>Дата(2000,1,1) и Стр.Заезд>КонецДня(Дата)+8*86400 тогда
		////	Продолжить;
		////конецесли;
		
		// + ПСН
		//Если Стр.Выезд>Дата(2000,1,1) и Стр.Выезд < НачалоДня(Объект.Дата) тогда
		//	Продолжить;
		//конецесли;
		Если Стр.Выезд > Дата(2000,1,1) и Стр.Выезд < НачалоДня(Объект.ДатаОтбора) + 14*60*60 тогда
			Продолжить;
		конецесли;
		// - ПСН
		
		// + ПСН
		//// + Тариф Бон Шанс
		//Если Стр.Тариф.Код="000000400" тогда // романик
		//	Если Стр.Заезд>Дата(2000,1,1) и Стр.Выезд>Дата(2000,1,1) тогда
		//		Если НачалоДня(Стр.Заезд)<>НачалоДня(Стр.Выезд) тогда
		//			если Стр.Заезд<НачалоДня(Объект.Дата) тогда //вчерашний романтик
		//				Продолжить;	
		//			конецесли;
		//			
		//		конецесли;				
		//	конецесли;
		//конецесли;
		//// - Тариф Бон Шанс
		// - ПСН
		
////////////////////////////////	

		ДанныеЗаявка =  Стр.Регистратор;
		ДеньПроживания = НачалоДня(Объект.ДатаОтбора);
		СтрокаПроживание = СтрокаПроживание(ДеньПроживания, ДанныеЗаявка) ;
		Двухместный = ДокументыСервер.ДвухМестный(ДанныеЗаявка);
		
		Результат = ПроживаниеОтклонение(Стр, СтрокаПроживание, ДанныеЗаявка, Двухместный);
		Если СтрокаПроживание = Неопределено 
		И Результат.СуммаЗаПроживаниеОтклонение = 0 	
		И Результат.СуммаЗаПроживаниеОтклонениеЧасы = 0 	
		Тогда Продолжить; КонецЕсли; 
		
		Нов=Объект.ПроданныеНомера.Добавить();
		
		Нов.ЦенаНаДеньЗаявка = Результат.ЦенаНаДень; 
		Нов.КоличествоОтклонениеЧасы = Результат.КоличествоОтклонениеЧасы; 
		Нов.СуммаЗаПроживаниеОтклонение = Результат.СуммаЗаПроживаниеОтклонение; 
		Нов.ЦенаЗаЧасЗаявка = Результат.ЦенаЗаЧас; 
		Нов.СуммаЗаПроживаниеОтклонениеЧасы = Результат.СуммаЗаПроживаниеОтклонениеЧасы; 
		
		Нов.Бронь=Стр.Регистратор;
		Нов.Клиент=Стр.Клиент;
		Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
		
		Нов.Заезд=Стр.Заезд;
		Нов.ЗаездКоррекция=Стр.Заезд;
		
		Нов.Выезд=Стр.Выезд;
		Нов.ВыездКоррекция=Стр.Выезд;
		
		// + ПСН
		//Нов.Тариф=ТарифНаДату(Нов.Бронь,НАчалоДня(Объект.Дата));
		//Нов.ТарифКоррекция=Нов.Тариф;
		// - ПСН
		
		//Политов
		Нов.Бронирует=Стр.Бронирует;  
		
		// + ПСН
		/////Политов
		//Для каждого СтрУ из Нов.Бронь.ДопУслуги цикл
		//	Если СтрУ.Услуга.Наименование="Ужин" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Объект.Дата) тогда 	
		//		////Нов.СуммаПолупансион=Нов.СуммаПолупансион+СтрУ.Цена*СтрУ.КолВо;
		//	// Дополнительное место	
		//	иначеесли  СтрУ.Услуга.Родитель.Код="000000796" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Объект.Дата) тогда
		//		Нов.СуммаДопМесто=Нов.СуммаДопМесто+СтрУ.Цена*СтрУ.КолВо;
		//	// Сумма Коррекция за проживание 	
		//	иначеесли  СтрУ.Услуга.Родитель.Код="000000284" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Объект.Дата) тогда
		//		Нов.СуммаКоррекция=Нов.СуммаКоррекция+СтрУ.Цена*СтрУ.КолВо;
		//	конецесли;
		//	
		//КонецЦикла;
		
		Для каждого СтрУ из Нов.Бронь.ДопУслуги цикл
			Если НЕ СтрУ.ВСчет тогда Продолжить; КонецЕсли;
			
			// Дополнительное место	
			//Если  СтрУ.Услуга.Родитель.Код="000000796" и НачалоДня(СтрУ.ДатаУслуги)=НачалоДня(Объект.Дата) тогда
			Если  СтрУ.Услуга.ПрограммныйКод = "ДополнительноеМесто" 
			И НачалоДня(СтрУ.ДатаУслуги) = НачалоДня(Объект.ДатаОтбора) 
			Тогда
				Нов.СуммаДопМесто=Нов.СуммаДопМесто + СтрУ.Цена*СтрУ.Количество;     
			конецесли;
		КонецЦикла;
		// - ПСН
		
		Если СтрокаПроживание <> Неопределено Тогда 
			Двухместный = ДокументыСервер.ДвухМестный(Стр.Регистратор);
			
			СтрокаПроживаниеЦеноваяПолитика = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента(
												"ЗаявкаНаБронирование", "Проживание");
			СтрокаПроживаниеЦеноваяПолитика.ДеньПроживания = ДеньПроживания;
			СтрокаПроживаниеЦеноваяПолитика.Количество = СтрокаПроживание.Количество;
			
			// + ПСН 29.05.25
			//ДокументыСервер.ЗаполнитьЦенаСуммыСтрокаПроживание(СтрокаПроживаниеЦеноваяПолитика, ДанныеЗаявка, Двухместный);
			ПроцентСкидки = ДокументыСервер.ИтогоСкидкаКлиент(Стр.Регистратор, Истина);
			ДокументыСервер.ЗаполнитьЦенаСуммыСтрокаПроживание(СтрокаПроживаниеЦеноваяПолитика, ДанныеЗаявка, Двухместный, ПроцентСкидки);
			// - ПСН 29.05.25
			
			Нов.ЦенаЦеноваяПолитика = СтрокаПроживаниеЦеноваяПолитика.Цена;
			//Нов.СуммаЦеноваяПолитикаБезСкидки = СтрокаПроживаниеЦеноваяПолитика.СуммаБезСкидки;
			Нов.СкидкаЦеноваяПолитика = СтрокаПроживаниеЦеноваяПолитика.ПроцентСкидкиКлиента;
			Нов.СуммаЦеноваяПолитика = СтрокаПроживаниеЦеноваяПолитика.Сумма;
			
			Нов.КоличествоДеньЗаявка = СтрокаПроживание.Количество;  
			Нов.СкидкаЗаявка = СтрокаПроживание.ПроцентСкидкиКлиента;  
			
			Нов.СуммаЗаПроживаниеЗаявка = СтрокаПроживание.Сумма + Нов.СуммаДопМесто;
		КонецЕсли;
		
		Нов.СуммаЗаПроживаниеФакт = Нов.СуммаЗаПроживаниеЗаявка + Нов.СуммаЗаПроживаниеОтклонение;
		Нов.СуммаЗаПроживаниеФактЧасы = Нов.СуммаЗаПроживаниеЗаявка + Нов.СуммаЗаПроживаниеОтклонениеЧасы;
		
		Нов.ГУИД = Новый УникальныйИдентификатор();
		
		Нов.СуммаОплатыКарта = Стр.СуммаОплатыКарта;  
		Нов.СуммаОплатыНаличные = Стр.СуммаОплатыНаличные;  
		Нов.СуммаОплатыБезнал = Стр.СуммаОплатыБезнал;  
		
		Нов.СуммаОплатыИтого = Нов.СуммаОплатыКарта + Нов.СуммаОплатыНаличные + Нов.СуммаОплатыБезнал;  
		
		//ОснРеквизит = Объект;
		//Нов.СуммаЗаПроживание=РасчитатьСтоимостьФакт(ОснРеквизит, Нов)+Нов.СуммаДопМесто;
		//Нов.СуммаЗаПроживаниеПлан=РасчитатьСтоимостьПлан(Нов);//+Нов.СуммаДопМесто;
////////////////////////////////		
		
	КонецЦикла; 
	//Нов=Объект.ПроданныеНомера.Добавить();
	
////// + Незаезды
	
	ЗапросНезаездов=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                             |	ЗанятостьНомеров.Регистратор КАК Регистратор,
	                             |	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	                             |	ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется КАК Тариф_НеИспользуется,
	                             |	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	                             |	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд,
	                             |	ЗанятостьНомеров.Номер.Наименование КАК НомерНаименование
	                             |ИЗ
	                             |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                             |ГДЕ
	                             |	ЗанятостьНомеров.Регистратор.Статус = &Статус
	                             |	И ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                             |
	                             |УПОРЯДОЧИТЬ ПО
	                             |	НомерНаименование");
	
	
	ЗапросНезаездов.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);								   
	ЗапросНезаездов.УстановитьПараметр("ДН",НачалоДня(Объект.Дата));								   
	ЗапросНезаездов.УстановитьПараметр("ДК",КонецДня(Объект.Дата));	
	ЗапросНезаездов.УстановитьПараметр("ДН2",КонецДня(Объект.Дата));								   
	ЗапросНезаездов.УстановитьПараметр("ДК2",КонецДня(Объект.Дата)+8*60*60);	
	ЗапросНезаездов.УстановитьПараметр("ДН3",НачалоДня(Объект.Дата));								   
	ЗапросНезаездов.УстановитьПараметр("ДК3",НачалоДня(Объект.Дата)+8*60*60);	
	ТЗ=ЗапросНезаездов.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		Нов=Объект.Незаезды.Добавить();
		Нов.Бронь=Стр.Регистратор;
		Нов.Клиент=Стр.Клиент;
		Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
	КонецЦикла; 
////// - Незаезды
	
////// + Анулированы
	ЗапросАннул=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗанятостьНомеров.Регистратор,
	|	ЗанятостьНомеров.Регистратор.Клиент КАК Клиент,
	|	ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется КАК Тариф_НеИспользуется,
	|	ЗанятостьНомеров.Регистратор.ВремяЗаездаТочное КАК Заезд,
	|	ЗанятостьНомеров.Регистратор.ВремяВыездаТочное КАК Выезд
	|ИЗ
	|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	|ГДЕ
	|	ЗанятостьНомеров.Регистратор.Статус = &Статус
	|	И ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗанятостьНомеров.Номер.Наименование");
	ЗапросАннул=Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаБронирование.Ссылка КАК Регистратор,
	|	ЗаявкаНаБронирование.Клиент,
	|	ЗаявкаНаБронирование.Тариф_НеИспользуется
	|ИЗ
	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	|ГДЕ
	|	ЗаявкаНаБронирование.Ссылка.ДатаАннуляции МЕЖДУ &ДН И &ДК
	|	И ЗаявкаНаБронирование.Статус = &Статус");
	
	ЗапросАннул.УстановитьПараметр("Статус",Перечисления.СтатусБрони.ОтменаБронирования);								   
	ЗапросАннул.УстановитьПараметр("ДН",НачалоДня(Объект.Дата));								   
	ЗапросАннул.УстановитьПараметр("ДК",КонецДня(Объект.Дата+86400));	
	ТЗ=ЗапросАннул.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		Нов=Объект.Аннуляции.Добавить();
		Нов.Бронь=Стр.Регистратор;
		Нов.Клиент=Стр.Клиент;
		Нов.НомерВРезерв=Стр.Регистратор.НомерВРезерв;
	КонецЦикла; 
////// - Анулированы
КонецФункции

&НаСервере
Функция СтрокаПроживание(ДеньПроживания, Заявка) 
СтрокаПроживание = Заявка.Проживание.Найти(ДеньПроживания,"ДеньПроживания");
Возврат СтрокаПроживание;
КонецФункции

&НаСервере
Функция СуммаЗаПроживаниеОтклонение(СтрокаДанные, СтрокаПроживание, ДанныеЗаявка, Двухместный) 
СуммаЗаПроживаниеОтклонение = 0;

//ЦенаНаДеньБезЗавтрака = ДокументыСервер.ЦенаНаДень(СтрокаПроживание.ДеньПроживания, ДанныеЗаявка.КатегорияНомера, Истина, Двухместный); 
//ЦенаНаДеньБезЗавтрака = ДокументыСервер.СуммаСоСкидкойСкидка(ЦенаНаДеньБезЗавтрака, СтрокаПроживание.ПроцентСкидкиКлиента); 
//ЦенаНаДеньСЗавтраком = ДокументыСервер.ЦенаНаДень(СтрокаПроживание.ДеньПроживания, ДанныеЗаявка.КатегорияНомера, Ложь, Двухместный); 
//СтоимостьЗавтрака = ЦенаНаДеньСЗавтраком - ЦенаНаДеньБезЗавтрака; 

ЦенаНаДень = Окр(СтрокаПроживание.Сумма / СтрокаПроживание.Количество, 2);
ЦенаЗаЧас = Окр(ЦенаНаДень / 24, 2);

Заезд = СтрокаДанные.Заезд;
Если НачалоДня(Заезд) = Объект.ДатаОтбора Тогда
	Если ДанныеЗаявка.РезервС = Объект.ДатаОтбора Тогда  	
		Если Час(Заезд) < 6 Тогда	
			Если ДанныеЗаявка.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр6 
			ИЛИ СтрокаПроживание.Количество = 1.5 
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень * 0.5;
				//СуммаЗаПроживаниеОтклонение = ЦенаНаДеньБезЗавтрака * 0.5;
			ИначеЕсли ДанныеЗаявка.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр14 
			ИЛИ СтрокаПроживание.Количество = 1 
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень;
				//СуммаЗаПроживаниеОтклонение = ЦенаНаДеньБезЗавтрака;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецЕсли;

Выезд = СтрокаДанные.Выезд;
Если НачалоДня(Выезд) = Объект.ДатаОтбора Тогда
	Если ДанныеЗаявка.РезервПо = Объект.ДатаОтбора Тогда 	
		
		ЧасВыезд = Час(Выезд);
		Если ЧасВыезд > 14 И ЧасВыезд < 18 Тогда
			Если ДанныеЗаявка.ВремяВыезда = Перечисления.ВремяВыезда.Вр12 
			ИЛИ СтрокаПроживание.Количество = 1
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень * 0.5;
			КонецЕсли;
		ИначеЕсли ЧасВыезд >= 18 И ЧасВыезд < 23 Тогда	
			Если ДанныеЗаявка.ВремяВыезда = Перечисления.ВремяВыезда.Вр12
			ИЛИ СтрокаПроживание.Количество = 1
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень * 0.5;
			КонецЕсли;
		ИначеЕсли ЧасВыезд = 23 Тогда
			Если ДанныеЗаявка.ВремяВыезда = Перечисления.ВремяВыезда.Вр12
			ИЛИ СтрокаПроживание.Количество = 2
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень;
			ИначеЕсли ДанныеЗаявка.ВремяВыезда = Перечисления.ВремяВыезда.Вр18
			ИЛИ СтрокаПроживание.Количество = 1.5
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень * 0.5;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецЕсли;

Возврат СуммаЗаПроживаниеОтклонение;	
КонецФункции

&НаСервере
Функция ПроживаниеОтклонение(СтрокаДанные, СтрокаПроживание, ДанныеЗаявка, Двухместный)
Результат = Новый Структура("СуммаЗаПроживаниеОтклонение, ЦенаНаДень, КоличествоОтклонениеЧасы, СуммаЗаПроживаниеОтклонениеЧасы, ЦенаЗаЧас");	

СуммаЗаПроживаниеОтклонение = 0;
КоличествоОтклонениеЧасы = 0;
СуммаЗаПроживаниеОтклонениеЧасы = 0;

//ЦенаНаДеньБезЗавтрака = ДокументыСервер.ЦенаНаДень(СтрокаПроживание.ДеньПроживания, ДанныеЗаявка.КатегорияНомера, Истина, Двухместный); 
//ЦенаНаДеньБезЗавтрака = ДокументыСервер.СуммаСоСкидкойСкидка(ЦенаНаДеньБезЗавтрака, СтрокаПроживание.ПроцентСкидкиКлиента); 
//ЦенаНаДеньСЗавтраком = ДокументыСервер.ЦенаНаДень(СтрокаПроживание.ДеньПроживания, ДанныеЗаявка.КатегорияНомера, Ложь, Двухместный); 
//СтоимостьЗавтрака = ЦенаНаДеньСЗавтраком - ЦенаНаДеньБезЗавтрака; 

Если СтрокаПроживание = Неопределено Тогда
	БезЗавтрака = ДанныеЗаявка.БезЗавтрака;
	ЦенаНаДень = ДокументыСервер.ЦенаНаДень(Объект.ДатаОтбора, ДанныеЗаявка.КатегорияНомера, БезЗавтрака, Двухместный); 
Иначе
	ЦенаНаДень = Окр(СтрокаПроживание.Сумма / СтрокаПроживание.Количество, 2);
КонецЕсли;

ЦенаЗаЧас = Окр(ЦенаНаДень / 24, 2);
СтрокаПроживаниеКоличество = ?(СтрокаПроживание = Неопределено, 1, СтрокаПроживание.Количество);

Заезд = СтрокаДанные.Заезд;
ЗаездНачалоДня = НачалоДня(Заезд);
Если ЗаездНачалоДня = Объект.ДатаОтбора Тогда
	ЧасЗаезд = Час(Заезд);
	
	Если ДанныеЗаявка.РезервС = ЗаездНачалоДня Тогда  	
		Если ЧасЗаезд < 6 Тогда	
			Если ДанныеЗаявка.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр6 
			ИЛИ СтрокаПроживаниеКоличество = 1.5 
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень * 0.5;
				//СуммаЗаПроживаниеОтклонение = ЦенаНаДеньБезЗавтрака * 0.5;
				
				КоличествоОтклонениеЧасы = 6 - ЧасЗаезд;
				СуммаЗаПроживаниеОтклонениеЧасы = ЦенаЗаЧас * КоличествоОтклонениеЧасы; 
				
			ИначеЕсли ДанныеЗаявка.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр14 
			ИЛИ СтрокаПроживаниеКоличество = 1 
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень;
				//СуммаЗаПроживаниеОтклонение = ЦенаНаДеньБезЗавтрака;
				
				КоличествоОтклонениеЧасы = 14 - ЧасЗаезд;
				СуммаЗаПроживаниеОтклонениеЧасы = ЦенаЗаЧас * КоличествоОтклонениеЧасы; 
				
			КонецЕсли;
		КонецЕсли;
		
	//ИначеЕсли ДанныеЗаявка.РезервС > ЗаездНачалоДня Тогда  	
	//	КоличествоДнейОтклонение = (ДанныеЗаявка.РезервС - ЗаездНачалоДня) / 24*60*60 ;
	//	СуммаЗаПроживаниеОтклонение = ЦенаНаДень * КоличествоДнейОтклонение;
	//	
	//	Если ЧасЗаезд < 6 Тогда	
	//		КоличествоОтклонениеЧасы = 6 - ЧасЗаезд;
	//		СуммаЗаПроживаниеОтклонениеЧасы = ЦенаЗаЧас * (КоличествоДнейОтклонение*24 + КоличествоОтклонениеЧасы); 			
	//	КонецЕсли;
		
	КонецЕсли;
КонецЕсли;

Выезд = СтрокаДанные.Выезд;
ВыездНачалоДня = НачалоДня(Выезд);
Если ВыездНачалоДня = Объект.ДатаОтбора Тогда
	
	ЧасВыезд = Час(Выезд);
	Если ДанныеЗаявка.РезервПо = ВыездНачалоДня Тогда 	
		
		Если ЧасВыезд > 13 И ЧасВыезд < 18 Тогда
			Если ДанныеЗаявка.ВремяВыезда = Перечисления.ВремяВыезда.Вр12 
			ИЛИ СтрокаПроживаниеКоличество = 1
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень * 0.5;
				
				КоличествоОтклонениеЧасы = ЧасВыезд - 13;
				СуммаЗаПроживаниеОтклонениеЧасы = ЦенаЗаЧас * КоличествоОтклонениеЧасы; 
			КонецЕсли;
			
		ИначеЕсли ЧасВыезд > 17 И ЧасВыезд < 23 Тогда	
			Если ДанныеЗаявка.ВремяВыезда = Перечисления.ВремяВыезда.Вр12
			ИЛИ СтрокаПроживаниеКоличество = 1
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень * 0.5;
				
				КоличествоОтклонениеЧасы = ЧасВыезд - 17;
				СуммаЗаПроживаниеОтклонениеЧасы = ЦенаЗаЧас * КоличествоОтклонениеЧасы; 
			КонецЕсли;
			
		ИначеЕсли ЧасВыезд = 23 Тогда
			Если ДанныеЗаявка.ВремяВыезда = Перечисления.ВремяВыезда.Вр12
			ИЛИ СтрокаПроживаниеКоличество = 2
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень;
				
				КоличествоОтклонениеЧасы = ЧасВыезд - 13;
				СуммаЗаПроживаниеОтклонениеЧасы = ЦенаЗаЧас * КоличествоОтклонениеЧасы; 
				
			ИначеЕсли ДанныеЗаявка.ВремяВыезда = Перечисления.ВремяВыезда.Вр18
			ИЛИ СтрокаПроживаниеКоличество = 1.5
			Тогда
				СуммаЗаПроживаниеОтклонение = ЦенаНаДень * 0.5;
				
				КоличествоОтклонениеЧасы = ЧасВыезд - 17;
				СуммаЗаПроживаниеОтклонениеЧасы = ЦенаЗаЧас * КоличествоОтклонениеЧасы; 
			КонецЕсли;
			
		КонецЕсли;
		
	//ИначеЕсли ДанныеЗаявка.РезервПо < ВыездНачалоДня Тогда 	
	//	КоличествоДнейОтклонение = (ВыездНачалоДня - ДанныеЗаявка.РезервПо) / 24*60*60;  		
	//	СуммаЗаПроживаниеОтклонение = ЦенаНаДень * КоличествоДнейОтклонение;
	//	
	//	Если ЧасВыезд > 13 И ЧасВыезд < 18 Тогда
	//		СуммаЗаПроживаниеОтклонение = СуммаЗаПроживаниеОтклонение + ЦенаНаДень * 0.5;
	//	ИначеЕсли ЧасВыезд >= 18 Тогда	
	//		СуммаЗаПроживаниеОтклонение = СуммаЗаПроживаниеОтклонение + ЦенаНаДень;
	//	КонецЕсли;
	//	
	//	КоличествоОтклонениеЧасы = ЧасВыезд - 13;
	//	СуммаЗаПроживаниеОтклонениеЧасы = ЦенаЗаЧас * (КоличествоДнейОтклонение*24 + КоличествоОтклонениеЧасы); 
		
	КонецЕсли;
КонецЕсли;

Результат.СуммаЗаПроживаниеОтклонение = СуммаЗаПроживаниеОтклонение;
Результат.КоличествоОтклонениеЧасы = КоличествоОтклонениеЧасы;
Результат.СуммаЗаПроживаниеОтклонениеЧасы = СуммаЗаПроживаниеОтклонениеЧасы;
Результат.ЦенаНаДень = ЦенаНаДень;
Результат.ЦенаЗаЧас = ЦенаЗаЧас;

Возврат Результат;	
КонецФункции
//

//
&НаКлиенте
Процедура ЗаполнитьОтклонения(Команда)
ЗаполнитьПроданныеНомераОтклонения();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьПроданныеНомера(Команда)
Если Объект.ПроданныеНомера.Количество() > 0 Тогда
	Ответ = Ждать ВопросАсинх("Подтвердите очистку проданных номеров ...", РежимДиалогаВопрос.ОКОтмена); 	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
КонецЕсли;

ЗаполнитьТаб();
ЗаполнитьПроданныеНомераОтклонения();
КонецПроцедуры
//

// + Не Используется
&НаСервере
Функция ТарифНаДату(Бронь,ДТ)
	Поиск=Бронь.Исключения.Найти(ДТ,"ДеньПроживания");
	Если Поиск=Неопределено тогда
		Возврат Бронь.Тариф_НеИспользуется;
	иначе
		Возврат Поиск.Тариф_НеИспользуется;
	конецесли;
	
КонецФункции

&НаСервере
Функция РасчитатьСтоимостьПлан(СтрокаТЗ)
	
	//Стоимость=?(СтрокаТЗ.Бронь.НовыйРассчет, ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(Объект.Дата))
	//	, СтрокаТЗ.Тариф.Цена*?(СтрокаТЗ.Бронь.Оплачивает.Категория.Пустая(),1,1-СтрокаТЗ.Бронь.Оплачивает.Категория.Скидка/100));
		
	Стоимость = ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(Объект.Дата));
	
	Коэф=1;
	Если СтрокаТЗ.Тариф_НеИспользуется.Код="000000001" или Найти(СтрокаТЗ.Тариф_НеИспользуется.Наименование,"Бон Шанс")>0 тогда
		
		Если (СтрокаТЗ.Заезд-НачалоДня(СтрокаТЗ.Заезд))<6*60*60  и НачалоДня(СтрокаТЗ.Заезд)=НачалоДня(Объект.Дата) тогда // прошлые сутки
			Коэф=0;
			Возврат 0;			
		иначе
			ВремяВНомере=СтрокаТЗ.Выезд-СтрокаТЗ.Заезд;
			СуммаСверх=?(ВремяВНомере>(3600*4-1),(Цел(ВремяВНомере/3600)-3)*200,0);
			Возврат (Стоимость)+СуммаСверх;
		конецесли;
	конецесли;
	Если (СтрокаТЗ.Выезд-СтрокаТЗ.Заезд)<86400 и (СтрокаТЗ.Выезд-СтрокаТЗ.Заезд)>0 и НАчалоДня(СтрокаТЗ.Выезд)=НачалоДня(Объект.Дата) и НАчалоДня(СтрокаТЗ.Заезд)=НачалоДня(Объект.Дата) тогда // нет суток
		Если НАчалоДня(СтрокаТЗ.Заезд)=НачалоДня(Объект.Дата) тогда // сегодня ночью заехал
			Если (СтрокаТЗ.Заезд-НачалоДня(СтрокаТЗ.Заезд))<6*60*60 тогда // прошлые сутки
				Коэф=0;
				Возврат 0;			
			конецесли;
		конецесли;
		Возврат (Стоимость);
	конецесли;
	//Если (СтрокаТЗ.Выезд-СтрокаТЗ.Заезд)<86400 и (СтрокаТЗ.Выезд-СтрокаТЗ.Заезд)>0 и НАчалоДня(СтрокаТЗ.Выезд)=НачалоДня(Дата) тогда // нет суток
	//	Возврат 0;	
	//конецесли;
	//СтрокаТЗ=ПроданныеНомера.Добавить();
	Сумма=(Стоимость);
	РезервС=?(СтрокаТЗ.Заезд<Дата(2000,1,1),СтрокаТЗ.Бронь.РезервС,СтрокаТЗ.Заезд);	
	РезервПО=?(СтрокаТЗ.Выезд<Дата(2000,1,1),СтрокаТЗ.Бронь.РезервПо,СтрокаТЗ.Выезд);	
	
	
	//Если НАчалоДня(РезервС)=НачалоДня(Дата) тогда //сегодня заехал.
	Если НАчалоДня(СтрокаТЗ.Заезд)=НачалоДня(Объект.Дата+86400) тогда //"Завтра" заехал.
		//Если НАчалоДня(РезервС)=НачалоДня(СтрокаТЗ.Заезд) тогда
		//Если Час(СтрокаТЗ.Заезд)<6 тогда // двойной тариф (+прошлые сутки)
		//	Сумма=Сумма;
		//иначеесли Час(СтрокаТЗ.Заезд)>=6 и Час(СтрокаТЗ.Заезд)<=8 тогда // 1,5 тариф (+половина прошлые сутки)
		//	Сумма=Сумма*0.5;	
		//конецесли;
			Если СтрокаТЗ.Бронь.НовыйРассчет и Сумма=0 Тогда 
				Сумма=ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(Объект.Дата+86400));
			КонецЕсли;
		Если (СтрокаТЗ.Заезд-НачалоДня(СтрокаТЗ.Заезд))<6*60*60 тогда // двойной тариф (+прошлые сутки)
			Сумма=Сумма*1;
			Коэф=Коэф*1;
		иначеесли (СтрокаТЗ.Заезд-НачалоДня(СтрокаТЗ.Заезд))>=6*60*60-40 и (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<=9*60*60 тогда // 1,5 тариф (+половина прошлые сутки)
			Сумма=Сумма*0.5;	
			Коэф=Коэф*0.5;
		конецесли;		
		//конецесли;
	конецесли;
	Если Найти(СтрокаТЗ.Тариф_НеИспользуется.Наименование,"Свадебный")>0 тогда // можно до 6 выезжать
		Если НАчалоДня(РезервПо)=НачалоДня(Объект.Дата) тогда //сегодня выехал.
			Если (Час(СтрокаТЗ.Выезд)-12)<=6 тогда // можно до 6 выезжать
				Сумма=0;
			иначеесли (Час(СтрокаТЗ.Выезд)-12)>0 тогда
				Сумма=Сумма;	
				СтрокаТЗ.Коэф=1;
			иначе
				Сумма=0;
			конецесли;
		конецесли;
	иначе
		
		Если НАчалоДня(РезервПо)=НачалоДня(Объект.Дата) тогда //сегодня выехал.
			Если СтрокаТЗ.Бронь.НовыйРассчет и Сумма=0 Тогда 
				Сумма=ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(Объект.Дата-86400));
			КонецЕсли;
			Если (Час(СтрокаТЗ.Выезд)-12)<5 и (Час(СтрокаТЗ.Выезд)-12)>2 тогда // почасовая прибавка
				Сумма=Сумма*((Час(СтрокаТЗ.Выезд)+?(Минута(СтрокаТЗ.Выезд)>30,1,0)-12)/24);
				Коэф=((Час(СтрокаТЗ.Выезд)+?(Минута(СтрокаТЗ.Выезд)>30,1,0)-12)/24);
			иначеесли (Час(СтрокаТЗ.Выезд)-12)<=12 и (Час(СтрокаТЗ.Выезд)-12)>2 тогда // 1,5 тариф (+половина след. сутки)
				Сумма=Сумма*0.5;
				Коэф=Коэф*0.5;
			иначеесли (Час(СтрокаТЗ.Выезд)-12)>2 тогда
				Сумма=Сумма;	
				Коэф=СтрокаТЗ.Коэф*1;
			иначе
				Сумма=0;
			конецесли;
		конецесли;
	конецесли;
	СтрокаТЗ.Скидка=(?(СтрокаТЗ.Тариф_НеИспользуется.БазовыйТариф.Пустая(),0,СтрокаТЗ.Тариф_НеИспользуется.БазовыйТариф.Цена-Стоимость)+(Стоимость))*Коэф;
	Если Сумма=0 тогда
		СтрокаТЗ.Скидка=0;
	конецесли;
	
	Возврат Сумма;
	
КонецФункции


&НаСервереБезКонтекста
Функция РасчитатьСтоимостьФакт(ОснРеквизит, СтрокаТЗ)
	ОбъектЗначение = ДанныеФормыВЗначение(ОснРеквизит, Тип("ДокументОбъект.ЕжедневныйАудит"));
	
	Стоимость=?(СтрокаТЗ.Бронь.НовыйРассчет,ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(ОбъектЗначение.Дата)),СтрокаТЗ.Тариф_НеИспользуется.Цена*?(СтрокаТЗ.Бронь.Оплачивает.Категория.Пустая(),1,1-СтрокаТЗ.Бронь.Оплачивает.Категория.Скидка/100));
	СтоимостьФакт=?(СтрокаТЗ.Бронь.НовыйРассчет,ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(ОбъектЗначение.Дата)),СтрокаТЗ.ТарифКоррекция.Цена*?(СтрокаТЗ.Бронь.Оплачивает.Категория.Пустая(),1,1-СтрокаТЗ.Бронь.Оплачивает.Категория.Скидка/100));
	
	СтрокаТЗ.Коэф=1;
	Если СтрокаТЗ.ТарифКоррекция.Код="000000001" или Найти(СтрокаТЗ.ТарифКоррекция.Наименование,"Бон Шанс")>0 тогда
		Если (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<6*60*60  и НачалоДня(СтрокаТЗ.ЗаездКоррекция)=НачалоДня(ОбъектЗначение.Дата)  тогда // прошлые сутки
			СтрокаТЗ.Коэф=0;
			Возврат 0;			
		иначе			
			ВремяВНомере=СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция;
			СуммаСверх=?(ВремяВНомере>(3600*4-1),(Цел(ВремяВНомере/3600)-3)*200,0);
			Возврат (Стоимость)+СуммаСверх+СтрокаТЗ.СуммаКоррекция;
		КонецЕсли;
	конецесли;
	
	
	Если (СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция)<86400 и (СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция)>0 и НАчалоДня(СтрокаТЗ.ВыездКоррекция)=НачалоДня(ОбъектЗначение.Дата) и НАчалоДня(СтрокаТЗ.ЗаездКоррекция)=НачалоДня(ОбъектЗначение.Дата) тогда // нет суток
		Если НАчалоДня(СтрокаТЗ.ЗаездКоррекция)=НачалоДня(ОбъектЗначение.Дата) тогда // сегодня ночью заехал
			Если (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<6*60*60 тогда // прошлые сутки
				СтрокаТЗ.Коэф=0;
				Возврат 0;			
			конецесли;
		конецесли;
		//	
		СтрокаТЗ.Коэф=1;
		Возврат (СтоимостьФакт)+СтрокаТЗ.СуммаКоррекция;	
	конецесли;
	
	//
	//Если (СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция)<86400 и (СтрокаТЗ.ВыездКоррекция-СтрокаТЗ.ЗаездКоррекция)>0 и НАчалоДня(СтрокаТЗ.ВыездКоррекция)=НачалоДня(Дата) тогда // нет суток
	//	СтрокаТЗ.Коэф=0;
	//	Возврат 0;	
	//конецесли;
	
	РезервС=?(СтрокаТЗ.ЗаездКоррекция<Дата(2000,1,1),СтрокаТЗ.Бронь.РезервС,СтрокаТЗ.ЗаездКоррекция);	
	РезервПО=?(СтрокаТЗ.ВыездКоррекция<Дата(2000,1,1),СтрокаТЗ.Бронь.РезервПо,СтрокаТЗ.ВыездКоррекция);	
	
	Сумма=(СтоимостьФакт);
	Если НАчалоДня(СтрокаТЗ.ЗаездКоррекция)=НачалоДня(ОбъектЗначение.Дата+86400) тогда //"Завтра" заехал.
		Если СтрокаТЗ.Бронь.НовыйРассчет и Сумма=0 Тогда 
				Сумма=ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(ОбъектЗначение.Дата+86400));
			КонецЕсли;
		//Если НАчалоДня(РезервС)=НачалоДня(СтрокаТЗ.ЗаездКоррекция) тогда
		Если (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<6*60*60 тогда // двойной тариф (+прошлые сутки)
			Сумма=Сумма*1;
			СтрокаТЗ.Коэф=СтрокаТЗ.Коэф*1;
		иначеесли (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))>=6*60*60-40 и (СтрокаТЗ.ЗаездКоррекция-НачалоДня(СтрокаТЗ.ЗаездКоррекция))<=9*60*60 тогда // 1,5 тариф (+половина прошлые сутки)
			Сумма=Сумма*0.5;	
			СтрокаТЗ.Коэф=СтрокаТЗ.Коэф*0.5;
		конецесли;			
		//Конецесли;
	конецесли;
	Если Найти(СтрокаТЗ.ТарифКоррекция.Наименование,"Свадебный")>0 тогда // можно до 6 выезжать
		Если НАчалоДня(РезервПо)=НачалоДня(ОбъектЗначение.Дата) тогда //сегодня выехал.
			Если (Час(СтрокаТЗ.ВыездКоррекция)-12)<=6 тогда // можно до 6 выезжать
				Сумма=0;
			иначеесли (Час(СтрокаТЗ.ВыездКоррекция)-12)>0 тогда
				Сумма=Сумма;	
				СтрокаТЗ.Коэф=1;
			иначе
				Сумма=0;
			конецесли;
		конецесли;
	иначе
		Если НАчалоДня(РезервПо)=НачалоДня(ОбъектЗначение.Дата) тогда //сегодня выехал.
			Если СтрокаТЗ.Бронь.НовыйРассчет и Сумма=0 Тогда 
				Сумма=ПолучитьСтоимостьНовыйРасчет(СтрокаТЗ.Бронь,НачалоДня(ОбъектЗначение.Дата-86400));
			КонецЕсли;
			
			
			
			Если (Час(СтрокаТЗ.ВыездКоррекция)-12)<5 и (Час(СтрокаТЗ.ВыездКоррекция)-12)>2 тогда // почасовая прибавка
				Сумма=Сумма*((Час(СтрокаТЗ.ВыездКоррекция)+?(Минута(СтрокаТЗ.ВыездКоррекция)>30,1,0)-12)/24);
				СтрокаТЗ.Коэф=(Час(СтрокаТЗ.ВыездКоррекция)+?(Минута(СтрокаТЗ.ВыездКоррекция)>30,1,0)-12)/24;
				
			иначеесли (Час(СтрокаТЗ.ВыездКоррекция)-12)<=12 и (Час(СтрокаТЗ.ВыездКоррекция)-12)>2 тогда // 1,5 тариф (+половина след. сутки)
				Сумма=Сумма*0.5;
				СтрокаТЗ.Коэф=0.5;
			иначеесли (Час(СтрокаТЗ.ВыездКоррекция)-12)>2 тогда
				Сумма=Сумма;	
				СтрокаТЗ.Коэф=1;
			иначе
				Сумма=0;
			конецесли;
		конецесли;
	конецесли;
	
	СтрокаТЗ.СкидкаКоррекция=(?(СтрокаТЗ.ТарифКоррекция.БазовыйТариф.Пустая(),0,СтрокаТЗ.ТарифКоррекция.БазовыйТариф.Цена-СтоимостьФакт) + (СтоимостьФакт))*СтрокаТЗ.Коэф;
	Если Сумма=0 тогда
		СтрокаТЗ.СкидкаКоррекция=0;
	конецесли;
	Возврат Сумма+СтрокаТЗ.СуммаКоррекция;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьНовыйРасчет(Бронь,ДатаЦены)
	ПоискЦены=Бронь.Исключения.Найти(ДатаЦены,"ДеньПроживания");
	Если ПоискЦены=Неопределено Тогда 
		Возврат 0;
	Иначе 
		Возврат ПоискЦены.Сумма;
	КонецЕсли;
	
КонецФункции
// - Не Используется

////////////

// + Не Используется
&НаКлиенте
Процедура ПроданныеНомераПриОкончанииРедактирования__(Элемент, НоваяСтрока, ОтменаРедактирования)
	//ЭлементыФормы.ПроданныеНомера.ТекущаяСтрока.СуммаЗаПроживание=РасчитатьСтоимостьФакт(ЭлементыФормы.ПроданныеНомера.ТекущаяСтрока)+ЭлементыФормы.ПроданныеНомера.ТекущаяСтрока.СуммаДопМесто;
	////РасчитатьСтоимостьПлан(ЭлементыФормы.ПроданныеНомера.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПроданныеНомераПриОкончанииРедактирования_1(Элемент, НоваяСтрока, ОтменаРедактирования)
ОснРеквизит = Объект;
ИД = Элементы.ПроданныеНомера.ТекущиеДанные.ПолучитьИдентификатор();

СтоимостьФакт = ПроданныеНомераПриОкончанииРедактированияНаСервере(ОснРеквизит, ИД);

Элементы.ПроданныеНомера.ТекущиеДанные.СуммаЗаПроживание = СтоимостьФакт 
	+ Элементы.ПроданныеНомера.ТекущиеДанные.СуммаДопМесто;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроданныеНомераПриОкончанииРедактированияНаСервере(ОснРеквизит, ИД)
ТекущиеДанные = ОснРеквизит.ПроданныеНомера[ИД];	
СтоимостьФакт=РасчитатьСтоимостьФакт(ОснРеквизит, ТекущиеДанные);

Возврат СтоимостьФакт;
КонецФункции
// - Не Используется

//
&НаКлиенте
Процедура ПроданныеНомераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроданныеНомераПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроданныеНомераКомментарийПриИзменении(Элемент)
КомментарийИзменение(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПроданныеНомераОтклоненияКомментарийПриИзменении(Элемент)
//ТекущаяСтрока = Элементы["ПроданныеНомераОтклонения"].ТекущаяСтрока;

//ТекущиеДанные = ЭтаФорма["ПроданныеНомераОтклонения"].НайтиПоИдентификатору(ТекущаяСтрока);
//ГУИД = ТекущиеДанные.ГУИД;

//ОтборСтроки = Новый Структура("ГУИД", ГУИД); 
//НайденныеСтроки = Объект.ПроданныеНомера.НайтиСтроки(ОтборСтроки);
//Если НайденныеСтроки.Количество() = 0 Тогда Возврат; КонецЕсли;

//НайденнаяСтрока = НайденныеСтроки[0];
//НайденнаяСтрока.Комментарий = ТекущиеДанные.Комментарий;

//КомментарийИзменение("ПроданныеНомераОтклонения", "ПроданныеНомера", Ложь)
КомментарийИзменение(Истина); 
КонецПроцедуры

&НаКлиенте
Процедура КомментарийИзменение(ЭтоОтклонения)
Если ЭтоОтклонения Тогда
	Источник = "ПроданныеНомераОтклонения";	
	Получатель = "ПроданныеНомера"
Иначе
	Источник = "ПроданныеНомера";		
	Получатель = "ПроданныеНомераОтклонения"
КонецЕсли;	
	
ТекущаяСтрока = Элементы[Источник].ТекущаяСтрока;

Если ЭтоОтклонения Тогда
	ТекущиеДанные = ЭтаФорма[Источник].НайтиПоИдентификатору(ТекущаяСтрока);
Иначе
	ТекущиеДанные = Объект[Источник].НайтиПоИдентификатору(ТекущаяСтрока);
КонецЕсли;	
ГУИД = ТекущиеДанные.ГУИД;

ОтборСтроки = Новый Структура("ГУИД", ГУИД); 

Если ЭтоОтклонения Тогда
	НайденныеСтроки = Объект[Получатель].НайтиСтроки(ОтборСтроки);
Иначе 
	НайденныеСтроки = ЭтаФорма[Получатель].НайтиСтроки(ОтборСтроки);
КонецЕсли;
	
Если НайденныеСтроки.Количество() = 0 Тогда Возврат; КонецЕсли;

НайденнаяСтрока = НайденныеСтроки[0];
НайденнаяСтрока.Комментарий = ТекущиеДанные.Комментарий;
КонецПроцедуры
//

//
&НаКлиенте
Процедура Подключаемый_ПроданныеНомераОтклоненияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроданныеНомераОтклоненияПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры
//

// ++++++++++++++++++++++++++

&НаКлиенте
Процедура Тест(Команда)
ф = Элементы.ПроданныеНомераКоманднаяПанель.ПодчиненныеЭлементы;
фв = Элементы.ПроданныеНомераКлиентКонтекстноеМеню.ПодчиненныеЭлементы;

ф1 = Элементы.ПроданныеНомераОтклоненияКоманднаяПанель.ПодчиненныеЭлементы;
Кнопка = ф1.Найти("ПроданныеНомераОтклоненияДобавить");
Кнопка.Доступность = Ложь;
Кнопка = ф1.Найти("ПроданныеНомераОтклоненияУдалить");
Кнопка.Доступность = Ложь;
Кнопка = ф1.Найти("ПроданныеНомераОтклоненияСкопировать");
Кнопка.Доступность = Ложь;

фв1 = Элементы.ПроданныеНомераОтклоненияКонтекстноеМеню.ПодчиненныеЭлементы;
Кнопка = фв1.Найти("ПроданныеНомераОтклоненияКонтекстноеМенюДобавить");
Кнопка.Доступность = Ложь;
Кнопка = фв1.Найти("ПроданныеНомераОтклоненияКонтекстноеМенюУдалить");
Кнопка.Доступность = Ложь;
Кнопка = фв1.Найти("ПроданныеНомераОтклоненияКонтекстноеМенюСкопировать");
Кнопка.Доступность = Ложь;

//ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере()
ДобавитьПроданныеНомераОтклонения();
КонецПроцедуры











