//Перем ПеретН,ПеретК,ТекКоорд,ТЗШахм,Ошибка,ТекДатаШахматки;
Перем ПеретН,ПеретК,ТекКоорд,Ошибка,ТекДатаШахматки;

&НаКлиенте
Процедура ПриОткрытии__()

//	Если Не Аудит тогда
//	КнопкаСформироватьНажатие(ЭтаФорма);
//	ОтчетЗаГод();
//	Закрыть();
//иначе
//	ДТ=НачалоДня(ТекущаяДата()-86400);
//	ОтчетАудит(ДТ);	
//	конецесли;
	КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если Параметры.Свойство("ЗавершитьРаботу") Тогда	
	 ЗавершитьРаботу = Параметры.ЗавершитьРаботу;
Иначе
	 ЗавершитьРаботу = Ложь;
КонецЕсли;	 

Если Параметры.Свойство("Аудит") Тогда	
	 Отчет.Аудит = Параметры.Аудит;
Иначе
	 Отчет.Аудит = Ложь;
КонецЕсли;
 
КонецПроцедуры
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)

Если Не Отчет.Аудит тогда
	//КнопкаСформироватьНажатие(ЭтаФорма);
	Сформировать(Неопределено);
	ОтчетЗаГод();
	Закрыть();
иначе
	ДТ=НачалоДня(ТекущаяДата()-86400);
	ОтчетАудит(ДТ);	
конецесли;

Если ЗавершитьРаботу Тогда
	Отказ = Истина;	
КонецЕсли;	
КонецПроцедуры

//
&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
   // //	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
   // //	Диалог.Каталог = "C:\";
   // //	
   // //	Диалог.Заголовок = "Выберите файл";
   // //	Если Диалог.Выбрать() Тогда
   // //		ФайлИмя = Диалог.ПолноеИмяФайла;
   // //	КонецЕсли;
   // Макет=ПолучитьМакет("Макет1");
   //ЗапросРаз=Новый Запрос("ВЫБРАТЬ
   //                        |	ВложенныйЗапрос.Клиент,
   //                        |	ВложенныйЗапрос.Ссылка
   //                        |ИЗ
   //                        |	(ВЫБРАТЬ
   //                        |		ЗаявкаНаБронирование.Клиент КАК Клиент,
   //                        |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК Ссылка
   //                        |	ИЗ
   //                        |		Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
   //                        |	
   //                        |	СГРУППИРОВАТЬ ПО
   //                        |		ЗаявкаНаБронирование.Клиент) КАК ВложенныйЗапрос
   //                        |ГДЕ
   //                        |	ВложенныйЗапрос.Ссылка > 1");
   // 					   
   // 					   
   // ТЗРаз=ЗапросРаз.Выполнить().Выгрузить();	
   // //Обл=Макет.ПолучитьОбласть("Шапка");
   // //Обл.Параметры.заголовок="Шахматка";
   // //ЭлементыФормы.ПолеОтчета.Вывести(Обл);
   // ВывестиШахматку(НачалоНедели(ТекущаяДата()),КонецНедели(ТекущаяДата()),"Час");
   // ЭлементыФормы.ПолеОтчета.Записать("C:\BASE\REP\Chess.xls",ТипФайлаТабличногоДокумента.XLS97);
   // 
   // ЭлементыФормы.ПолеОтчета.Очистить();
   // 
   // Обл=Макет.ПолучитьОбласть("Шапка");
   // Обл.Параметры.заголовок="Проживающие на "+ Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
   // ЭлементыФормы.ПолеОтчета.Вывести(Обл);
   // ТаблДок=Новый ТабличныйДокумент;
   // 
   // Обл=Макет.ПолучитьОбласть("Шапка2|ШапкаВерх");
   // 
   // ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
   //                         |	КлиентыПрочаяИнформация.ВидИнформации
   //                         |ИЗ
   //                         |	Справочник.Клиенты.ПрочаяИнформация КАК КлиентыПрочаяИнформация
   //                         |ГДЕ
   //                         |	КлиентыПрочаяИнформация.Ссылка В
   //                         |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
   //                         |				ЗанятостьНомеров.Клиент
   //                         |			ИЗ
   //                         |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
   //                         |			ГДЕ
   //                         |				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
   //                         |				И ЗанятостьНомеров.Регистратор.Статус = &Статус)
   //                         |	И КлиентыПрочаяИнформация.ВидИнформации.Наименование <> ""Возраст""");
   // ЗапросВиды.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
   // ЗапросВиды.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
   // ЗапросВиды.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));

   // ТЗИнфПоКл=ЗапросВиды.Выполнить().Выгрузить();
   // 
   // 
   // ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
   //                         |	ЗаявкаНаБронированиеДопПожелания.ВидИнформации
   //                         |ИЗ
   //                         |	Документ.ЗаявкаНаБронирование.ДопПожелания КАК ЗаявкаНаБронированиеДопПожелания
   //                         |ГДЕ
   //                         |	ЗаявкаНаБронированиеДопПожелания.Ссылка.Клиент В
   //                         |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
   //                         |				ЗанятостьНомеров.Клиент
   //                         |			ИЗ
   //                         |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
   //                         |			ГДЕ
   //                         |				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
   //                         |				И ЗанятостьНомеров.Регистратор.Статус = &Статус)
   //                         |	И ЗаявкаНаБронированиеДопПожелания.ВидИнформации.Наименование <> ""Возраст""");
   // ЗапросВиды.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
   // ЗапросВиды.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
   // ЗапросВиды.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));

   // ТЗИнфПоПос=ЗапросВиды.Выполнить().Выгрузить();
   // ТаблДок.Присоединить(Обл);
   // Обл=Макет.ПолучитьОбласть("Шапка2|Инф");
   // Обл.Параметры.Инф="Возраст";
   // 	ТаблДок.Присоединить(Обл);
   // 	Обл.Параметры.Инф="Город";
   // 	ТаблДок.Присоединить(Обл);
   // 	Обл.Параметры.Инф="Страна";
   // 	ТаблДок.Присоединить(Обл);
   // 	Обл.Параметры.Инф="Скидка";
   // 	ТаблДок.Присоединить(Обл);

   // Для каждого Стр Из ТЗИнфПоКл Цикл
   // 	Если Стр.ВидИнформации.Наименование="" тогда
   // 		Продолжить;
   // 	конецесли;
   // 	Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Город/Страна",Стр.ВидИнформации.Наименование);
   // 	ТаблДок.Присоединить(Обл);		
   // КонецЦикла; 
   // Для каждого Стр Из ТЗИнфПоПос Цикл
   // 	Если Стр.ВидИнформации.Наименование="" тогда
   // 		Продолжить;
   // 	конецесли;
   // 	
   // 	Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Администратор",Стр.ВидИнформации.Наименование);
   // 	ТаблДок.Присоединить(Обл);		
   // КонецЦикла; 	
   // ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
   // 
   // ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
   //                                |	ЗанятостьНомеров.Клиент,
   //                                |	ЗанятостьНомеров.Номер КАК Номер,
   //                                |	ЗанятостьНомеров.Регистратор
   //                                |ИЗ
   //                                |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
   //                                |ГДЕ
   //                                |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
   //                                |	И ЗанятостьНомеров.Регистратор.Статус = &Статус
   //                                |
   //                                |УПОРЯДОЧИТЬ ПО
   //                                |	ЗанятостьНомеров.Номер.Наименование");
   // ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
   // ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
   // ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));
   // СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
   // 
   // Для каждого Прож Из СписокПроживающих Цикл
   // 	ТаблДок=Новый ТабличныйДокумент;

   // 	Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
   // 	//Проживает	Бронирует	Оплачивает	Дата заезда	Дата выезда	Номер  ДатаЗаезда	ДатаВыезда
   // 	Обл.Параметры.Проживает=Прож.Клиент.Наименование;
   // 	//Обл.Параметры.Бронирует=Прож.Регистратор.бронирует.Наименование;
   // 	//Обл.Параметры.Оплачивает=Прож.Регистратор.Оплачивает.Наименование;
   // 	ПоискКол=ТЗРаз.Найти(Прож.Клиент,"Клиент");
   // 	Обл.Параметры.Раз=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
   // 	Обл.Параметры.ДатаЗаезда=Формат(Прож.Регистратор.РезервС, "ДФ=dd.MM.yy");
   // 	Обл.Параметры.ДатаВыезда=Формат(Прож.Регистратор.РезервПо, "ДФ=dd.MM.yy");
   // 	Обл.Параметры.Номер=Прож.Регистратор.НомерВРезерв.Наименование;
   // 	ТаблДок.Присоединить(Обл);
   // 	Обл=Макет.ПолучитьОбласть("Строка|Инф");
   // 	Возраст=Окр(((ТекущаяДата()-Прож.Клиент.ДатаРождения)/86400)/365);
   // 	Обл.Параметры.Инф=?(Возраст>100,"--",Возраст);
   // 	ТаблДок.Присоединить(Обл);
   // 	Обл.Параметры.Инф=Прож.Клиент.Город.Наименование;
   // 	ТаблДок.Присоединить(Обл);
   // 	Обл.Параметры.Инф=Прож.Клиент.Страна.Наименование;
   // 	ТаблДок.Присоединить(Обл);
   // 	Обл.Параметры.Инф=?(Прож.Клиент.Категория.Пустая(),"0",Строка(Прож.Клиент.Категория.Скидка));
   // 	ТаблДок.Присоединить(Обл);

   // 			Для каждого Стр Из ТЗИнфПоКл Цикл
   // 		Если Стр.ВидИнформации.Наименование="" тогда
   // 			Продолжить;
   // 		конецесли;
   // 		Поиск=Прож.Клиент.ПрочаяИнформация.найти(Стр.ВидИнформации,"ВидИнформации");
   // 		Если Поиск=Неопределено тогда
   // 			Обл.Параметры.Инф="";	
   // 		иначе
   // 			Обл.Параметры.Инф=Поиск.Информация;
   // 		конецесли;		
   // 		ТаблДок.Присоединить(Обл);		
   // 	КонецЦикла; 
   // 	Для каждого Стр Из ТЗИнфПоПос Цикл
   // 		Если Стр.ВидИнформации.Наименование="" тогда
   // 			Продолжить;
   // 		конецесли;
   // 		Поиск=Прож.Регистратор.ДопПожелания.найти(Стр.ВидИнформации,"ВидИнформации");
   // 		Если Поиск=Неопределено тогда
   // 			Обл.Параметры.Инф="";	
   // 		иначе
   // 			Обл.Параметры.Инф=Поиск.Информация;
   // 		конецесли;		
   // 		ТаблДок.Присоединить(Обл);	
   // 	КонецЦикла; 	
   // 	ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
   // 	
   // КонецЦикла; 
   // 
   // 
   // // забронированные сегодня
   // 
   // Обл=Макет.ПолучитьОбласть("Шапка");
   // Обл.Параметры.заголовок="Забронированные сегодня";
   // ЭлементыФормы.ПолеОтчета.Вывести(Обл);
   // ТаблДок=Новый ТабличныйДокумент;
   // 
   // Обл=Макет.ПолучитьОбласть("Шапка2|ШапкаВерх");
   // 
   // ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
   // |	КлиентыПрочаяИнформация.ВидИнформации
   // |ИЗ
   // |	Справочник.Клиенты.ПрочаяИнформация КАК КлиентыПрочаяИнформация");
   // ТЗИнфПоКл=ЗапросВиды.Выполнить().Выгрузить();
   // 
   // ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
   // |	ЗаявкаНаБронированиеДопПожелания.ВидИнформации
   // |ИЗ
   // |	Документ.ЗаявкаНаБронирование.ДопПожелания КАК ЗаявкаНаБронированиеДопПожелания");
   // ТЗИнфПоПос=ЗапросВиды.Выполнить().Выгрузить();
   // ТаблДок.Присоединить(Обл);
   // Обл=Макет.ПолучитьОбласть("Шапка2|Инф");
   // Для каждого Стр Из ТЗИнфПоКл Цикл
   // 	Если Стр.ВидИнформации.Наименование="" тогда
   // 		Продолжить;
   // 	конецесли;
   // 	Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Город/Страна",Стр.ВидИнформации.Наименование);
   // 	ТаблДок.Присоединить(Обл);		
   // КонецЦикла; 
   // Для каждого Стр Из ТЗИнфПоПос Цикл
   // 	Если Стр.ВидИнформации.Наименование="" тогда
   // 		Продолжить;
   // 	конецесли;
   // 	
   // 	Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Администратор",Стр.ВидИнформации.Наименование);
   // 	ТаблДок.Присоединить(Обл);		
   // КонецЦикла; 	
   // ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
   // 
   // ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
   //                                |	ЗанятостьНомеров.Клиент,
   //                                |	ЗанятостьНомеров.Номер КАК Номер,
   //                                |	ЗанятостьНомеров.Регистратор
   //                                |ИЗ
   //                                |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
   //                                |ГДЕ
   //                                |	ЗанятостьНомеров.Регистратор.Статус <> &Статус
   //                                |	И ЗанятостьНомеров.Регистратор.Дата  МЕЖДУ &ДН И &ДК
   //                                |
   //                                |УПОРЯДОЧИТЬ ПО
   //                                |	Номер");
   // ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
   // ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
   // ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));
   // СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
   // 
   // Для каждого Прож Из СписокПроживающих Цикл
   // 	ТаблДок=Новый ТабличныйДокумент;

   // 	Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
   // 	//Проживает	Бронирует	Оплачивает	Дата заезда	Дата выезда	Номер  ДатаЗаезда	ДатаВыезда
   // 	Обл.Параметры.Проживает=Прож.Клиент.Наименование;
   // 	//Обл.Параметры.Бронирует=Прож.Регистратор.бронирует.Наименование;
   // 	//Обл.Параметры.Оплачивает=Прож.Регистратор.Оплачивает.Наименование;
   // 	Обл.Параметры.ДатаЗаезда=Формат(Прож.Регистратор.РезервС, "ДФ=dd.MM.yy");
   // 	Обл.Параметры.ДатаВыезда=Формат(Прож.Регистратор.РезервПо, "ДФ=dd.MM.yy");
   // 	Обл.Параметры.Номер=Прож.Регистратор.НомерВРезерв.Наименование;
   // 	ПоискКол=ТЗРаз.Найти(Прож.Клиент,"Клиент");
   // 	Обл.Параметры.Раз=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
   // 	ТаблДок.Присоединить(Обл);
   // 	Обл=Макет.ПолучитьОбласть("Строка|Инф");
   // 	
   // 	Для каждого Стр Из ТЗИнфПоКл Цикл
   // 		Если Стр.ВидИнформации.Наименование="" тогда
   // 			Продолжить;
   // 		конецесли;
   // 		Поиск=Прож.Клиент.ПрочаяИнформация.найти(Стр.ВидИнформации,"ВидИнформации");
   // 		Если Поиск=Неопределено тогда
   // 			Обл.Параметры.Инф="";	
   // 		иначе
   // 			Обл.Параметры.Инф=Поиск.Информация;
   // 		конецесли;		
   // 		ТаблДок.Присоединить(Обл);		
   // 	КонецЦикла; 
   // 	Для каждого Стр Из ТЗИнфПоПос Цикл
   // 		Если Стр.ВидИнформации.Наименование="" тогда
   // 			Продолжить;
   // 		конецесли;
   // 		Поиск=Прож.Регистратор.ДопПожелания.найти(Стр.ВидИнформации,"ВидИнформации");
   // 		Если Поиск=Неопределено тогда
   // 			Обл.Параметры.Инф="";	
   // 		иначе
   // 			Обл.Параметры.Инф=Поиск.Информация;
   // 		конецесли;		
   // 		ТаблДок.Присоединить(Обл);	
   // 	КонецЦикла; 	
   // 	ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
   // 	
   // КонецЦикла; 
   // 
   // 
   // // заезжают на неделе
   // 
   // Обл=Макет.ПолучитьОбласть("Шапка");
   // Обл.Параметры.заголовок="Заезжают в течении недели";
   // ЭлементыФормы.ПолеОтчета.Вывести(Обл);
   // ТаблДок=Новый ТабличныйДокумент;
   // 
   // Обл=Макет.ПолучитьОбласть("Шапка2|ШапкаВерх");
   // 
   // ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
   // |	КлиентыПрочаяИнформация.ВидИнформации
   // |ИЗ
   // |	Справочник.Клиенты.ПрочаяИнформация КАК КлиентыПрочаяИнформация");
   // ТЗИнфПоКл=ЗапросВиды.Выполнить().Выгрузить();
   // 
   // ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
   // |	ЗаявкаНаБронированиеДопПожелания.ВидИнформации
   // |ИЗ
   // |	Документ.ЗаявкаНаБронирование.ДопПожелания КАК ЗаявкаНаБронированиеДопПожелания");
   // ТЗИнфПоПос=ЗапросВиды.Выполнить().Выгрузить();
   // ТаблДок.Присоединить(Обл);
   // Обл=Макет.ПолучитьОбласть("Шапка2|Инф");
   // 
   // Для каждого Стр Из ТЗИнфПоКл Цикл
   // 	Если Стр.ВидИнформации.Наименование="" тогда
   // 		Продолжить;
   // 	конецесли;
   // 	Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Город/Страна",Стр.ВидИнформации.Наименование);
   // 	ТаблДок.Присоединить(Обл);		
   // КонецЦикла; 
   // Для каждого Стр Из ТЗИнфПоПос Цикл
   // 	Если Стр.ВидИнформации.Наименование="" тогда
   // 		Продолжить;
   // 	конецесли;
   // 	
   // 	Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Администратор",Стр.ВидИнформации.Наименование);
   // 	ТаблДок.Присоединить(Обл);		
   // КонецЦикла; 	
   // ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
   // 
   // ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
   //                                |	ЗанятостьНомеров.Клиент,
   //                                |	ЗанятостьНомеров.Номер КАК Номер,
   //                                |	ЗанятостьНомеров.Регистратор
   //                                |ИЗ
   //                                |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
   //                                |ГДЕ
   //                                |	ЗанятостьНомеров.Регистратор.Статус <> &Статус
   //                                |	И ЗанятостьНомеров.Регистратор.РезервС МЕЖДУ &ДН И &ДК
   //                                |
   //                                |УПОРЯДОЧИТЬ ПО
   //                                |	Номер");
   // ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
   // ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
   // ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()+7*86400));
   // СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
   // 
   // Для каждого Прож Из СписокПроживающих Цикл
   // 	ТаблДок=Новый ТабличныйДокумент;

   // 	Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
   // 	//Проживает	Бронирует	Оплачивает	Дата заезда	Дата выезда	Номер  ДатаЗаезда	ДатаВыезда
   // 	Обл.Параметры.Проживает=Прож.Клиент.Наименование;
   // 	//Обл.Параметры.Бронирует=Прож.Регистратор.бронирует.Наименование;
   // 	//Обл.Параметры.Оплачивает=Прож.Регистратор.Оплачивает.Наименование;
   // 	Обл.Параметры.ДатаЗаезда=Формат(Прож.Регистратор.РезервС, "ДФ=dd.MM.yy");
   // 	Обл.Параметры.ДатаВыезда=Формат(Прож.Регистратор.РезервПо, "ДФ=dd.MM.yy");
   // 	Обл.Параметры.Номер=Прож.Регистратор.НомерВРезерв.Наименование;
   // 	ПоискКол=ТЗРаз.Найти(Прож.Клиент,"Клиент");
   // 	Обл.Параметры.Раз=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
   // 	ТаблДок.Присоединить(Обл);
   // 	Обл=Макет.ПолучитьОбласть("Строка|Инф");
   // 	
   // 	Для каждого Стр Из ТЗИнфПоКл Цикл
   // 		Если Стр.ВидИнформации.Наименование="" тогда
   // 			Продолжить;
   // 		конецесли;
   // 		Поиск=Прож.Клиент.ПрочаяИнформация.найти(Стр.ВидИнформации,"ВидИнформации");
   // 		Если Поиск=Неопределено тогда
   // 			Обл.Параметры.Инф="";	
   // 		иначе
   // 			Обл.Параметры.Инф=Поиск.Информация;
   // 		конецесли;		
   // 		ТаблДок.Присоединить(Обл);		
   // 	КонецЦикла; 
   // 	Для каждого Стр Из ТЗИнфПоПос Цикл
   // 		Если Стр.ВидИнформации.Наименование="" тогда
   // 			Продолжить;
   // 		конецесли;
   // 		Поиск=Прож.Регистратор.ДопПожелания.найти(Стр.ВидИнформации,"ВидИнформации");
   // 		Если Поиск=Неопределено тогда
   // 			Обл.Параметры.Инф="";	
   // 		иначе
   // 			Обл.Параметры.Инф=Поиск.Информация;
   // 		конецесли;		
   // 		ТаблДок.Присоединить(Обл);	
   // 	КонецЦикла; 	
   // 	ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
   // 	
   // КонецЦикла; 
   // ЭлементыФормы.ПолеОтчета.Записать("C:\BASE\REP\Rep.xls",ТипФайлаТабличногоДокумента.XLS97);
   // ЭлементыФормы.ПолеОтчета.Очистить();
   // 
   //	
   // ОтправитьМылом("Ежедневная рассылка","C:\BASE\REP\Rep.xls","C:\BASE\REP\Chess.xls","guz@5sreda.ru");
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
Ответ = СформироватьНаСервере();

//ОтправитьМылом(Ответ.Тема, Ответ.Файл1, Ответ.Файл2, Ответ.Получатель); 

Тема =  Ответ.Тема;

Получатели = Новый СписокЗначений;
Получатели.Добавить("postnikov_sn@invina.ru");

//	//ПочтовоеСообщение.Получатели.Добавить(Получатель);
//	ПочтовоеСообщение.Получатели.Добавить("Kantorov_EE@invina.ru");
////	ПочтовоеСообщение.Получатели.Добавить("Kantorova_JA@invina.ru");
//	ПочтовоеСообщение.Получатели.Добавить("isaeva_js@invina.ru");
//  //  ПочтовоеСообщение.Получатели.Добавить("arestova_ov@invina.ru");
//  ПочтовоеСообщение.Получатели.Добавить("mokrenko_an@invina.ru");

//ПочтовоеСообщение.Получатели.Добавить("guz@agent5.ru");

Файлы = Новый СписокЗначений;
Файлы.Добавить(Ответ.Файл1);
Файлы.Добавить(Ответ.Файл2);

СлужебныеСервер.ОтправитьМейлом(Тема, файлы, Получатели); 
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере() 
	////	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	////	Диалог.Каталог = "C:\";
	////	
	////	Диалог.Заголовок = "Выберите файл";
	////	Если Диалог.Выбрать() Тогда
	////		ФайлИмя = Диалог.ПолноеИмяФайла;
	////	КонецЕсли;
	
	//Макет=ПолучитьМакет("Макет1");
	Макет = Отчеты.ОтчетПоКлиентам.ПолучитьМакет("Макет1");
	
	ЗапросРаз=Новый Запрос("ВЫБРАТЬ
	                       |	ВложенныйЗапрос.Клиент,
	                       |	ВложенныйЗапрос.Ссылка
	                       |ИЗ
	                       |	(ВЫБРАТЬ
	                       |		ЗаявкаНаБронирование.Клиент КАК Клиент,
	                       |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК Ссылка
	                       |	ИЗ
	                       |		Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                       |	
	                       |	СГРУППИРОВАТЬ ПО
	                       |		ЗаявкаНаБронирование.Клиент) КАК ВложенныйЗапрос
	                       |ГДЕ
	                       |	ВложенныйЗапрос.Ссылка > 1");
						   
						   
	ТЗРаз=ЗапросРаз.Выполнить().Выгрузить();	
	////Обл=Макет.ПолучитьОбласть("Шапка");
	////Обл.Параметры.заголовок="Шахматка";
	////ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	
	ВывестиШахматку(НачалоНедели(ТекущаяДата()),КонецНедели(ТекущаяДата()),"Час");
	
	ИмяФайла_Chess = Константы.Папка_C_BASE.Получить();
	ИмяФайла_Chess = ИмяФайла_Chess + "REP\Chess.xls"; 
	//ЭлементыФормы.ПолеОтчета.Записать("C:\BASE\REP\Chess.xls",ТипФайлаТабличногоДокумента.XLS97);
	ПолеОтчета.Записать(ИмяФайла_Chess,ТипФайлаТабличногоДокумента.XLS97);
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.заголовок="Проживающие на "+ Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	ТаблДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Шапка2|ШапкаВерх");
	
	ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	КлиентыПрочаяИнформация.ВидИнформации
	                        |ИЗ
	                        |	Справочник.Клиенты.ПрочаяИнформация КАК КлиентыПрочаяИнформация
	                        |ГДЕ
	                        |	КлиентыПрочаяИнформация.Ссылка В
	                        |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |				ЗанятостьНомеров.Клиент
	                        |			ИЗ
	                        |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                        |			ГДЕ
	                        |				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                        |				И ЗанятостьНомеров.Регистратор.Статус = &Статус)
	                        |	И КлиентыПрочаяИнформация.ВидИнформации.Наименование <> ""Возраст""");
	ЗапросВиды.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
	ЗапросВиды.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
	ЗапросВиды.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));

	ТЗИнфПоКл=ЗапросВиды.Выполнить().Выгрузить();
	
	
	ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	ЗаявкаНаБронированиеДопПожелания.ВидИнформации
	                        |ИЗ
	                        |	Документ.ЗаявкаНаБронирование.ДопПожелания КАК ЗаявкаНаБронированиеДопПожелания
	                        |ГДЕ
	                        |	ЗаявкаНаБронированиеДопПожелания.Ссылка.Клиент В
	                        |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |				ЗанятостьНомеров.Клиент
	                        |			ИЗ
	                        |				РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                        |			ГДЕ
	                        |				ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                        |				И ЗанятостьНомеров.Регистратор.Статус = &Статус)
	                        |	И ЗаявкаНаБронированиеДопПожелания.ВидИнформации.Наименование <> ""Возраст""");
	ЗапросВиды.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
	ЗапросВиды.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
	ЗапросВиды.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));

	ТЗИнфПоПос=ЗапросВиды.Выполнить().Выгрузить();
	ТаблДок.Присоединить(Обл);
	Обл=Макет.ПолучитьОбласть("Шапка2|Инф");
	Обл.Параметры.Инф="Возраст";
		ТаблДок.Присоединить(Обл);
		Обл.Параметры.Инф="Город";
		ТаблДок.Присоединить(Обл);
		Обл.Параметры.Инф="Страна";
		ТаблДок.Присоединить(Обл);
		Обл.Параметры.Инф="Скидка";
		ТаблДок.Присоединить(Обл);

	Для каждого Стр Из ТЗИнфПоКл Цикл
		Если Стр.ВидИнформации.Наименование="" тогда
			Продолжить;
		конецесли;
		Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Город/Страна",Стр.ВидИнформации.Наименование);
		ТаблДок.Присоединить(Обл);		
	КонецЦикла; 
	Для каждого Стр Из ТЗИнфПоПос Цикл
		Если Стр.ВидИнформации.Наименование="" тогда
			Продолжить;
		конецесли;
		
		Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Администратор",Стр.ВидИнформации.Наименование);
		ТаблДок.Присоединить(Обл);		
	КонецЦикла; 	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	ПолеОтчета.Вывести(ТаблДок);
	
	ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	ЗанятостьНомеров.Клиент,
	                               |	ЗанятостьНомеров.Номер КАК Номер,
	                               |	ЗанятостьНомеров.Регистратор
	                               |ИЗ
	                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                               |ГДЕ
	                               |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                               |	И ЗанятостьНомеров.Регистратор.Статус = &Статус
	                               |
	                               |УПОРЯДОЧИТЬ ПО
	                               |	ЗанятостьНомеров.Номер.Наименование");
	ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
	ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
	ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));
	СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
	
	Для каждого Прож Из СписокПроживающих Цикл
		ТаблДок=Новый ТабличныйДокумент;

		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
		//Проживает	Бронирует	Оплачивает	Дата заезда	Дата выезда	Номер  ДатаЗаезда	ДатаВыезда
		Обл.Параметры.Проживает=Прож.Клиент.Наименование;
		//Обл.Параметры.Бронирует=Прож.Регистратор.бронирует.Наименование;
		//Обл.Параметры.Оплачивает=Прож.Регистратор.Оплачивает.Наименование;
		ПоискКол=ТЗРаз.Найти(Прож.Клиент,"Клиент");
		Обл.Параметры.Раз=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
		Обл.Параметры.ДатаЗаезда=Формат(Прож.Регистратор.РезервС, "ДФ=dd.MM.yy");
		Обл.Параметры.ДатаВыезда=Формат(Прож.Регистратор.РезервПо, "ДФ=dd.MM.yy");
		Обл.Параметры.Номер=Прож.Регистратор.НомерВРезерв.Наименование;
		ТаблДок.Присоединить(Обл);
		Обл=Макет.ПолучитьОбласть("Строка|Инф");
		Возраст=Окр(((ТекущаяДата()-Прож.Клиент.ДатаРождения)/86400)/365);
		Обл.Параметры.Инф=?(Возраст>100,"--",Возраст);
		ТаблДок.Присоединить(Обл);
		Обл.Параметры.Инф=Прож.Клиент.Город.Наименование;
		ТаблДок.Присоединить(Обл);
		Обл.Параметры.Инф=Прож.Клиент.Страна.Наименование;
		ТаблДок.Присоединить(Обл);
		Обл.Параметры.Инф=?(Прож.Клиент.Категория.Пустая(),"0",Строка(Прож.Клиент.Категория.Скидка));
		ТаблДок.Присоединить(Обл);

				Для каждого Стр Из ТЗИнфПоКл Цикл
			Если Стр.ВидИнформации.Наименование="" тогда
				Продолжить;
			конецесли;
			Поиск=Прож.Клиент.ПрочаяИнформация.найти(Стр.ВидИнформации,"ВидИнформации");
			Если Поиск=Неопределено тогда
				Обл.Параметры.Инф="";	
			иначе
				Обл.Параметры.Инф=Поиск.Информация;
			конецесли;		
			ТаблДок.Присоединить(Обл);		
		КонецЦикла; 
		Для каждого Стр Из ТЗИнфПоПос Цикл
			Если Стр.ВидИнформации.Наименование="" тогда
				Продолжить;
			конецесли;
			Поиск=Прож.Регистратор.ДопПожелания.найти(Стр.ВидИнформации,"ВидИнформации");
			Если Поиск=Неопределено тогда
				Обл.Параметры.Инф="";	
			иначе
				Обл.Параметры.Инф=Поиск.Информация;
			конецесли;		
			ТаблДок.Присоединить(Обл);	
		КонецЦикла; 	
		//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
		ПолеОтчета.Вывести(ТаблДок);
		
	КонецЦикла; 
	
	
	// забронированные сегодня
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.заголовок="Забронированные сегодня";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	ТаблДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Шапка2|ШапкаВерх");
	
	ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлиентыПрочаяИнформация.ВидИнформации
	|ИЗ
	|	Справочник.Клиенты.ПрочаяИнформация КАК КлиентыПрочаяИнформация");
	ТЗИнфПоКл=ЗапросВиды.Выполнить().Выгрузить();
	
	ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаБронированиеДопПожелания.ВидИнформации
	|ИЗ
	|	Документ.ЗаявкаНаБронирование.ДопПожелания КАК ЗаявкаНаБронированиеДопПожелания");
	ТЗИнфПоПос=ЗапросВиды.Выполнить().Выгрузить();
	ТаблДок.Присоединить(Обл);
	Обл=Макет.ПолучитьОбласть("Шапка2|Инф");
	Для каждого Стр Из ТЗИнфПоКл Цикл
		Если Стр.ВидИнформации.Наименование="" тогда
			Продолжить;
		конецесли;
		Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Город/Страна",Стр.ВидИнформации.Наименование);
		ТаблДок.Присоединить(Обл);		
	КонецЦикла; 
	Для каждого Стр Из ТЗИнфПоПос Цикл
		Если Стр.ВидИнформации.Наименование="" тогда
			Продолжить;
		конецесли;
		
		Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Администратор",Стр.ВидИнформации.Наименование);
		ТаблДок.Присоединить(Обл);		
	КонецЦикла; 	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	ПолеОтчета.Вывести(ТаблДок);
	
	ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	ЗанятостьНомеров.Клиент,
	                               |	ЗанятостьНомеров.Номер КАК Номер,
	                               |	ЗанятостьНомеров.Регистратор
	                               |ИЗ
	                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                               |ГДЕ
	                               |	ЗанятостьНомеров.Регистратор.Статус <> &Статус
	                               |	И ЗанятостьНомеров.Регистратор.Дата  МЕЖДУ &ДН И &ДК
	                               |
	                               |УПОРЯДОЧИТЬ ПО
	                               |	Номер");
	ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
	ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
	ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));
	СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
	
	Для каждого Прож Из СписокПроживающих Цикл
		ТаблДок=Новый ТабличныйДокумент;

		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
		//Проживает	Бронирует	Оплачивает	Дата заезда	Дата выезда	Номер  ДатаЗаезда	ДатаВыезда
		Обл.Параметры.Проживает=Прож.Клиент.Наименование;
		//Обл.Параметры.Бронирует=Прож.Регистратор.бронирует.Наименование;
		//Обл.Параметры.Оплачивает=Прож.Регистратор.Оплачивает.Наименование;
		Обл.Параметры.ДатаЗаезда=Формат(Прож.Регистратор.РезервС, "ДФ=dd.MM.yy");
		Обл.Параметры.ДатаВыезда=Формат(Прож.Регистратор.РезервПо, "ДФ=dd.MM.yy");
		Обл.Параметры.Номер=Прож.Регистратор.НомерВРезерв.Наименование;
		ПоискКол=ТЗРаз.Найти(Прож.Клиент,"Клиент");
		Обл.Параметры.Раз=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
		ТаблДок.Присоединить(Обл);
		Обл=Макет.ПолучитьОбласть("Строка|Инф");
		
		Для каждого Стр Из ТЗИнфПоКл Цикл
			Если Стр.ВидИнформации.Наименование="" тогда
				Продолжить;
			конецесли;
			Поиск=Прож.Клиент.ПрочаяИнформация.найти(Стр.ВидИнформации,"ВидИнформации");
			Если Поиск=Неопределено тогда
				Обл.Параметры.Инф="";	
			иначе
				Обл.Параметры.Инф=Поиск.Информация;
			конецесли;		
			ТаблДок.Присоединить(Обл);		
		КонецЦикла; 
		Для каждого Стр Из ТЗИнфПоПос Цикл
			Если Стр.ВидИнформации.Наименование="" тогда
				Продолжить;
			конецесли;
			Поиск=Прож.Регистратор.ДопПожелания.найти(Стр.ВидИнформации,"ВидИнформации");
			Если Поиск=Неопределено тогда
				Обл.Параметры.Инф="";	
			иначе
				Обл.Параметры.Инф=Поиск.Информация;
			конецесли;		
			ТаблДок.Присоединить(Обл);	
		КонецЦикла; 	
		//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
		ПолеОтчета.Вывести(ТаблДок);
		
	КонецЦикла; 
	
	
	// заезжают на неделе
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.заголовок="Заезжают в течении недели";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	ТаблДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Шапка2|ШапкаВерх");
	
	ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлиентыПрочаяИнформация.ВидИнформации
	|ИЗ
	|	Справочник.Клиенты.ПрочаяИнформация КАК КлиентыПрочаяИнформация");
	ТЗИнфПоКл=ЗапросВиды.Выполнить().Выгрузить();
	
	ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаБронированиеДопПожелания.ВидИнформации
	|ИЗ
	|	Документ.ЗаявкаНаБронирование.ДопПожелания КАК ЗаявкаНаБронированиеДопПожелания");
	ТЗИнфПоПос=ЗапросВиды.Выполнить().Выгрузить();
	ТаблДок.Присоединить(Обл);
	Обл=Макет.ПолучитьОбласть("Шапка2|Инф");
	
	Для каждого Стр Из ТЗИнфПоКл Цикл
		Если Стр.ВидИнформации.Наименование="" тогда
			Продолжить;
		конецесли;
		Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Город/Страна",Стр.ВидИнформации.Наименование);
		ТаблДок.Присоединить(Обл);		
	КонецЦикла; 
	Для каждого Стр Из ТЗИнфПоПос Цикл
		Если Стр.ВидИнформации.Наименование="" тогда
			Продолжить;
		конецесли;
		
		Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Администратор",Стр.ВидИнформации.Наименование);
		ТаблДок.Присоединить(Обл);		
	КонецЦикла; 	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	ПолеОтчета.Вывести(ТаблДок);
	
	ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	ЗанятостьНомеров.Клиент,
	                               |	ЗанятостьНомеров.Номер КАК Номер,
	                               |	ЗанятостьНомеров.Регистратор
	                               |ИЗ
	                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                               |ГДЕ
	                               |	ЗанятостьНомеров.Регистратор.Статус <> &Статус
	                               |	И ЗанятостьНомеров.Регистратор.РезервС МЕЖДУ &ДН И &ДК
	                               |
	                               |УПОРЯДОЧИТЬ ПО
	                               |	Номер");
	ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
	ЗапросПроживающих.УстановитьПараметр("ДН",НачалоДня(ТекущаяДата()));			 
	ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()+7*86400));
	СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
	
	Для каждого Прож Из СписокПроживающих Цикл
		ТаблДок=Новый ТабличныйДокумент;

		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
		//Проживает	Бронирует	Оплачивает	Дата заезда	Дата выезда	Номер  ДатаЗаезда	ДатаВыезда
		Обл.Параметры.Проживает=Прож.Клиент.Наименование;
		//Обл.Параметры.Бронирует=Прож.Регистратор.бронирует.Наименование;
		//Обл.Параметры.Оплачивает=Прож.Регистратор.Оплачивает.Наименование;
		Обл.Параметры.ДатаЗаезда=Формат(Прож.Регистратор.РезервС, "ДФ=dd.MM.yy");
		Обл.Параметры.ДатаВыезда=Формат(Прож.Регистратор.РезервПо, "ДФ=dd.MM.yy");
		Обл.Параметры.Номер=Прож.Регистратор.НомерВРезерв.Наименование;
		ПоискКол=ТЗРаз.Найти(Прож.Клиент,"Клиент");
		Обл.Параметры.Раз=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
		ТаблДок.Присоединить(Обл);
		Обл=Макет.ПолучитьОбласть("Строка|Инф");
		
		Для каждого Стр Из ТЗИнфПоКл Цикл
			Если Стр.ВидИнформации.Наименование="" тогда
				Продолжить;
			конецесли;
			Поиск=Прож.Клиент.ПрочаяИнформация.найти(Стр.ВидИнформации,"ВидИнформации");
			Если Поиск=Неопределено тогда
				Обл.Параметры.Инф="";	
			иначе
				Обл.Параметры.Инф=Поиск.Информация;
			конецесли;		
			ТаблДок.Присоединить(Обл);		
		КонецЦикла; 
		Для каждого Стр Из ТЗИнфПоПос Цикл
			Если Стр.ВидИнформации.Наименование="" тогда
				Продолжить;
			конецесли;
			Поиск=Прож.Регистратор.ДопПожелания.найти(Стр.ВидИнформации,"ВидИнформации");
			Если Поиск=Неопределено тогда
				Обл.Параметры.Инф="";	
			иначе
				Обл.Параметры.Инф=Поиск.Информация;
			конецесли;		
			ТаблДок.Присоединить(Обл);	
		КонецЦикла; 	
		//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
		ПолеОтчета.Вывести(ТаблДок);
		
	КонецЦикла; 
	
	ИмяФайла_Rep = Константы.Папка_C_BASE.Получить();
	ИмяФайла_Rep = ИмяФайла_Rep + "REP\Rep.xls";  
	
	//ЭлементыФормы.ПолеОтчета.Записать("C:\BASE\REP\Rep.xls",ТипФайлаТабличногоДокумента.XLS97);
	ПолеОтчета.Записать(ИмяФайла_Rep,ТипФайлаТабличногоДокумента.XLS97);
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
   	
	//ОтправитьМылом("Ежедневная рассылка","C:\BASE\REP\Rep.xls","C:\BASE\REP\Chess.xls","guz@5sreda.ru");
	
	// + ПСН Перенесено в Сформировать()
	//ОтправитьМылом("Ежедневная рассылка", ИмяФайла_Rep, ИмяФайла_Chess, "postnikov_sn@invina.ru");
	// - ПСН Перенесено в Сформировать()
	
	Ответ = Новый Структура;
	Ответ.Вставить("Тема", "Ежедневная рассылка");  
	Ответ.Вставить("Файл1", ИмяФайла_Rep);  
	Ответ.Вставить("Файл2", ИмяФайла_Chess);  
	//Ответ.Вставить("Получатель", "postnikov_sn@invina.ru");  
	
	Возврат Ответ;
КонецФункции
//

&НаСервере
Функция ВывестиШахматку2_НеИспользуется(ДатаС,ДатаПо,Детализация)
//	ТЗШахм=Новый ТаблицаЗначений;
//ТЗШахм.Колонки.Добавить("Х");
//ТЗШахм.Колонки.Добавить("У");
//ТЗШахм.Колонки.Добавить("Клиент");
//ТЗШахм.Колонки.Добавить("Номер");
//ТЗШахм.Колонки.Добавить("Период");
//ТЗШахм.Колонки.Добавить("Документ");

// + ПСН
ТЗШахм.Очистить();
// - ПСН

	ДатаС=?(Детализация="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗанятостьНомеров.Клиент,
	                    |	ЗанятостьНомеров.Регистратор.Статус КАК Статус
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
	
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
	ТЗКлиентов=Запрос.Выполнить().Выгрузить();
	ТЗКлиентов.Колонки.Добавить("Цвет");
	Сч=0;
	//СписокЦветов=Новый СписокЗначений;
	Для каждого Клиент Из ТЗКлиентов Цикл	
		Если Клиент.Статус=Перечисления.СтатусБрони.Проживает тогда
			Клиент.Цвет=Новый Цвет(255,255,255);
		иначеесли Клиент.Статус=Перечисления.СтатусБрони.Выехал тогда
			Клиент.Цвет=Новый Цвет(231, 227, 217);
		иначе
			
		Случай=Новый ГенераторСлучайныхЧисел();
		СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
		СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
		СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
		НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
		Если ТЗКлиентов.Найти(НовЦвет,"Цвет")<>Неопределено тогда
			Случай=Новый ГенераторСлучайныхЧисел();
			СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
			СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
			СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
			НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
		КонецЕсли;
		Клиент.Цвет=НовЦвет;
		конецесли;
	КонецЦикла; 
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗанятостьНомеров.Номер,
	                    |	ЗанятостьНомеров.Клиент,
	                    |	ЗанятостьНомеров.ПериодРезерва,
	                    |	ЗанятостьНомеров.Регистратор
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	                    |	И ЗанятостьНомеров.Номер = &Номер
	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
	
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
	//	ТЗЗапроса=Запрос.Выполнить().Выгрузить();
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ТемпС=ДатаС;
	ТемпПо=ДатаПо;
	
	//Макет=ПолучитьМакет("МакетШахматки");
	Макет = Отчеты.ОтчетПоКлиентам.ПолучитьМакет("МакетШахматки");
	
	ТабДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
	ТабДок.Присоединить(Обл);
	ТЗОбъеденения=Новый ТаблицаЗначений();
	ТЗОбъеденения.Колонки.Добавить("КолонкаС");
	ТЗОбъеденения.Колонки.Добавить("КолонкаПо");
	ТЗОбъеденения.Колонки.Добавить("ДТ");
	
	Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");
	ТемпДень=НачалоДня(ТемпС);
	Нов=ТЗОбъеденения.Добавить();
	Нов.КолонкаС=1;
	Нов.КолонкаПо=1;
	Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");
	ТекКол=1;
	Пока ТемпС<=ТемпПо цикл
		Если НачалоДня(ТемпС)>ТемпДень тогда
			// новый день
			Нов.КолонкаПо=ТекКол-1;
			Нов=ТЗОбъеденения.Добавить();
			Нов.КолонкаС=ТекКол;
			Нов.КолонкаПо=ТекКол+1;
			ТемпДень=НачалоДня(ТемпС);
			Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");	
		конецесли;
		
		
		Обл.Параметры.Период=Формат(ТемпС, ?(Детализация="День","ДФ='dd.MM'","ДФ='HH:mm'"));
		ТабДок.Присоединить(Обл);
		ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
		ТекКол=ТекКол+1;
	КонецЦикла;
	Нов.КолонкаПо=ТекКол-1;
	Для каждого Об Из ТЗОбъеденения Цикл
		ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаС+1).Текст=Об.ДТ;
		
		ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаПо+1).Объединить();
		
	КонецЦикла; 
	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТабДок);
	ПолеОтчета.Вывести(ТабДок);
	
	
	СпрНомеров=Справочники.НомернойФонд.Выбрать();
	Х=0;
	У=0;
	
	Пока СпрНомеров.Следующий() цикл
		
		У=У+1;
		
		ТабДок=Новый ТабличныйДокумент;
		ТемпС=ДатаС;
		ТемпПо=ДатаПо;
		
		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
		Обл.Параметры.Номер=СпрНомеров.Наименование;
		ТабДок.Присоединить(Обл);
		ТемпКл=Справочники.Клиенты.ПустаяСсылка();
		СписОб=Новый СписокЗначений;
		Сч=1;
		НачИ=2;	
		Х=0;

		Пока ТемпС<=ТемпПо цикл
			Х=Х+1;			
			ПС=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			ПК=?(Детализация="День",КонецДня(ТемпС),КонецЧаса(ТемпС));
			Запрос.УстановитьПараметр("ДатаС",ПС);						
			Запрос.УстановитьПараметр("ДатаПо",ПК);
			Запрос.УстановитьПараметр("Номер",СпрНомеров.Ссылка);
			ТЗЗапроса=Запрос.Выполнить().Выгрузить();
			Обл=Макет.ПолучитьОбласть("Строка|СтрПериод");
			
			Если ТЗЗапроса.Количество()<>0 тогда
				Цв=ТЗКлиентов.Найти(ТЗЗапроса[0].Клиент,"Клиент").Цвет;
				ТекКл=ТЗЗапроса[0].Клиент;
				Обл.Область(1,1,1,1).ЦветФона=Цв;
				Обл.Параметры.Период=ТекКл.Наименование;
				НовШ=ТЗШахм.Добавить();
				НовШ.Х=Х;
				НовШ.У=У;
				НовШ.Клиент=ТекКл;
				НовШ.Номер=СпрНомеров.Ссылка;
				НовШ.Документ=ТЗЗапроса[0].Регистратор;
				НовШ.Период=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			иначе
				ТекКл=Справочники.Клиенты.ПустаяСсылка();			
			конецесли;
			
			Если ТекКл<>ТемпКл тогда
				
				НовОб=новый Структура("Нач,Кон",НачИ,сч);
				СписОб.Добавить(НовОб);
				ТемпКл=ТекКл;
				НачИ=Сч+1;
				
			конецесли;
			
			ТабДок.Присоединить(Обл);
			ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
			сч=сч+1;
		КонецЦикла;
		НовОб=новый Структура("Нач,Кон",НачИ,сч);
		СписОб.Добавить(НовОб);
		
		Первый=Истина;
		Для каждого Об Из СписОб Цикл
			если Первый Тогда
				Первый=Ложь;
				Продолжить;
				
			конецесли;
			
			ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
		КонецЦикла; 
		//ЭлементыФормы.ПолеОтчета.Вывести(ТабДок);
		ПолеОтчета.Вывести(ТабДок);
		
	КонецЦикла;
	
	
	
	//ЭлементыФормы.ПолеОтчета.ФиксацияСлева=1;
	ПолеОтчета.ФиксацияСлева=1;
	////ТЗЗапроса
КонецФункции

&НаСервере
Функция ВывестиШахматку(ДатаС,ДатаПо,Детализация)
	ТЗШахм.Очистить();
	ДатаС=?(Детализация="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗанятостьНомеров.Клиент,
	                    |	ЗанятостьНомеров.Регистратор.Статус КАК Статус
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
	
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
	ТЗКлиентов=Запрос.Выполнить().Выгрузить();
	ТЗКлиентов.Колонки.Добавить("Цвет");
	ТЗКлиентов.Колонки.Добавить("ЦветТекста");
	Сч=0;
	//СписокЦветов=Новый СписокЗначений;
	Для каждого Клиент Из ТЗКлиентов Цикл	
		Если Клиент.Статус=Перечисления.СтатусБрони.Проживает тогда
			Клиент.Цвет = Новый Цвет(255,255,255);
			
			Клиент.ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Клиент.Цвет);
		иначеесли Клиент.Статус=Перечисления.СтатусБрони.Выехал тогда
			Клиент.Цвет=Новый Цвет(231, 227, 217);
			
			Клиент.ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Клиент.Цвет);
		иначе
			
			Случай=Новый ГенераторСлучайныхЧисел();
			СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
			СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
			СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
			НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
			Если ТЗКлиентов.Найти(НовЦвет,"Цвет")<>Неопределено тогда
				Случай=Новый ГенераторСлучайныхЧисел();
				СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
				СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
				СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
				НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
			КонецЕсли;
			Клиент.Цвет=НовЦвет;
			
			Клиент.ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Клиент.Цвет);

		конецесли;
	КонецЦикла; 
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗанятостьНомеров.Номер,
	                    |	ЗанятостьНомеров.Клиент,
	                    |	ЗанятостьНомеров.ПериодРезерва,
	                    |	ЗанятостьНомеров.Регистратор
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	                    |	И ЗанятостьНомеров.Номер = &Номер
	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЗанятостьНомеров.Номер,
	                    |	ЗанятостьНомеров.Клиент,
	                    |	ЗанятостьНомеров.ПериодРезерва,
	                    |	ЗанятостьНомеров.Регистратор
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	                    |	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
	ТЗЗапроса=Запрос.Выполнить().Выгрузить();
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	ТемпС=ДатаС;
	ТемпПо=ДатаПо;
	
	//Макет=ПолучитьМакет("МакетШахматки");
	Макет = Отчеты.ОтчетПоКлиентам.ПолучитьМакет("МакетШахматки");
	
	ТабДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
	ТабДок.Присоединить(Обл);
	ТЗОбъеденения=Новый ТаблицаЗначений();
	ТЗОбъеденения.Колонки.Добавить("КолонкаС");
	ТЗОбъеденения.Колонки.Добавить("КолонкаПо");
	ТЗОбъеденения.Колонки.Добавить("ДТ");
	
	Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");
	ТемпДень=НачалоДня(ТемпС);
	Нов=ТЗОбъеденения.Добавить();
	Нов.КолонкаС=1;
	Нов.КолонкаПо=1;
	Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");
	ТекКол=1;
	Пока ТемпС<=ТемпПо цикл
		Если НачалоДня(ТемпС)>ТемпДень тогда
			// новый день
			Нов.КолонкаПо=ТекКол-1;
			Нов=ТЗОбъеденения.Добавить();
			Нов.КолонкаС=ТекКол;
			Нов.КолонкаПо=ТекКол+1;
			ТемпДень=НачалоДня(ТемпС);
			Нов.ДТ=Формат(ТемпДень, "ДФ=dd.MM");	
		конецесли;
		
		
		Обл.Параметры.Период=Формат(ТемпС, ?(Детализация="День","ДФ='dd.MM'","ДФ='HH:mm'"));
		ТабДок.Присоединить(Обл);
		ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
		ТекКол=ТекКол+1;
	КонецЦикла;
	Нов.КолонкаПо=ТекКол-1;
	Для каждого Об Из ТЗОбъеденения Цикл
		ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаС+1).Текст=Об.ДТ;
		
		ТабДок.Область(2,Об.КолонкаС+1,2,Об.КолонкаПо+1).Объединить();
		
	КонецЦикла; 
	
//	ЭлементыФормы.ПолеОтчета.Вывести(ТабДок);
	ПолеОтчета.Вывести(ТабДок);
	
	
	СпрНомеров=Справочники.НомернойФонд.Выбрать();
	Х=0;
	У=0;
	
	Пока СпрНомеров.Следующий() цикл
		
		У=У+1;
		
		ТабДок=Новый ТабличныйДокумент;
		ТемпС=ДатаС;
		ТемпПо=ДатаПо;
		
		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
		Обл.Параметры.Номер=СпрНомеров.Наименование;
		ТабДок.Присоединить(Обл);
		ТемпКл=Справочники.Клиенты.ПустаяСсылка();
		СписОб=Новый СписокЗначений;
		Сч=1;
		НачИ=2;	
		Х=0;

		Пока ТемпС<=ТемпПо цикл
			Х=Х+1;			
			ПС=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			ПК=?(Детализация="День",КонецДня(ТемпС),КонецЧаса(ТемпС));
			Отбор=Новый Структура("ПериодРезерва,Номер",ПС,СпрНомеров.Ссылка);
			СтрокиНом=ТЗЗапроса.НайтиСтроки(Отбор);
		//	//Запрос.УстановитьПараметр("ДатаС",ПС);						
		//	//Запрос.УстановитьПараметр("ДатаПо",ПК);
		////	Запрос.УстановитьПараметр("Номер",СпрНомеров.Ссылка);
		////	ТЗЗапроса=Запрос.Выполнить().Выгрузить();
			Обл=Макет.ПолучитьОбласть("Строка|СтрПериод");
			
			////Если ТЗЗапроса.Количество()<>0 тогда
			Если СтрокиНом.Количество()<>0 тогда
			////	КлСтат=ТЗКлиентов.Найти(ТЗЗапроса[0].Клиент,"Клиент");
				КлСтат=ТЗКлиентов.Найти(СтрокиНом[0].Клиент,"Клиент");
				Цв=КлСтат.Цвет;
				
				ЦвТекста=КлСтат.ЦветТекста;
				
				////ТекКл=ТЗЗапроса[0].Клиент;
				ТекКл=СтрокиНом[0].Клиент;
				Обл.Область(1,1,1,1).ЦветФона=Цв;
				
				Обл.Область(1,1,1,1).ЦветТекста = ЦвТекста;
				
				Если КлСтат.Статус=Перечисления.СтатусБрони.Проживает тогда
					
					Обл.Область(1,1,1,1).Шрифт=Новый Шрифт(Обл.Область(1,1,1,1).Шрифт,,,Истина);
				КонецЕсли;
				
				Обл.Параметры.Период=ТекКл.Наименование;
				НовШ=ТЗШахм.Добавить();
				НовШ.Х=Х;
				НовШ.У=У;
				НовШ.Клиент=ТекКл;
				НовШ.Номер=СпрНомеров.Ссылка;
				////НовШ.Документ=ТЗЗапроса[0].Регистратор;
				НовШ.Документ=СтрокиНом[0].Регистратор;
				НовШ.Период=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			иначе
				ТекКл=Справочники.Клиенты.ПустаяСсылка();			
			конецесли;
			
			Если ТекКл<>ТемпКл тогда
				
				НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
				СписОб.Добавить(НовОб);
				ТемпКл=ТекКл;
				НачИ=Сч+1;
				
			конецесли;
			
			ТабДок.Присоединить(Обл);
			ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
			сч=сч+1;
		КонецЦикла;
		НовОб=новый Структура("Нач,Кон,ТекКл",НачИ,сч,ТемпКл);
		СписОб.Добавить(НовОб);
		
		Первый=Истина;
		Для каждого Об Из СписОб Цикл
			если Первый Тогда
				Первый=Ложь;
				Продолжить;
				
			конецесли;
			Если Об.Значение.ТекКл=Справочники.Клиенты.ПустаяСсылка() тогда
				Продолжить;
			конецесли;
			
			ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
		КонецЦикла; 
		
		//ЭлементыФормы.ПолеОтчета.Вывести(ТабДок);
		ПолеОтчета.Вывести(ТабДок);
	КонецЦикла;
	
	//ЭлементыФормы.ПолеОтчета.ФиксацияСлева=1;
	//ЭлементыФормы.ПолеОтчета.ФиксацияСверху=3;
	ПолеОтчета.ФиксацияСлева=1;
	ПолеОтчета.ФиксацияСверху=3;
	
	////ТЗЗапроса
КонецФункции

//
&НаКлиенте
Процедура ОтчетЗаГод()
Ответ = ОтчетЗаГодНаСервере();

//ОтправитьМылом(Ответ.Тема,Ответ.Файл1,"",Ответ.Получатель);

Тема =  Ответ.Тема;

Получатели = Новый СписокЗначений;
Получатели.Добавить("postnikov_sn@invina.ru");
//	//ПочтовоеСообщение.Получатели.Добавить(Получатель);
//	ПочтовоеСообщение.Получатели.Добавить("Kantorov_EE@invina.ru");
////	ПочтовоеСообщение.Получатели.Добавить("Kantorova_JA@invina.ru");
//	ПочтовоеСообщение.Получатели.Добавить("isaeva_js@invina.ru");
//  //  ПочтовоеСообщение.Получатели.Добавить("arestova_ov@invina.ru");
//  ПочтовоеСообщение.Получатели.Добавить("mokrenko_an@invina.ru");

	 //ПочтовоеСообщение.Получатели.Добавить("guz@agent5.ru");

Файлы = Новый СписокЗначений;
Файлы.Добавить(Ответ.Файл1);

СлужебныеСервер.ОтправитьМейлом(Тема, файлы, Получатели); 
КонецПроцедуры

&НаСервере
Функция ОтчетЗаГодНаСервере()
	////	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	////	Диалог.Каталог = "C:\";
	////	
	////	Диалог.Заголовок = "Выберите файл";
	////	Если Диалог.Выбрать() Тогда
	////		ФайлИмя = Диалог.ПолноеИмяФайла;
	////	КонецЕсли;
	
	//Макет=ПолучитьМакет("Макет");
	Макет= Отчеты.ОтчетПоКлиентам.ПолучитьМакет("Макет");

	////Обл=Макет.ПолучитьОбласть("Шапка");
	////Обл.Параметры.заголовок="Шахматка";
	////ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	
	
	 ЗапросВсего=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ЗанятостьНомеров.Клиент
	 |ИЗ
	 |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	 |ГДЕ
	 |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК");
	 
	 ЗапросВсего.УстановитьПараметр("ДН",НачалоМесяца(ТекущаяДата()));
	 ЗапросВсего.УстановитьПараметр("ДК",КонецМесяца(ТекущаяДата()));
	 ТЗВсего=ЗапросВсего.Выполнить().Выгрузить();
	 
	 ЗапросОпрошенн=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                             |	ЗаявкаНаБронированиеДопПожелания.Ссылка.Клиент
	                             |ИЗ
	                             |	Документ.ЗаявкаНаБронирование.ДопПожелания КАК ЗаявкаНаБронированиеДопПожелания
	                             |ГДЕ
	                             |	ЗаявкаНаБронированиеДопПожелания.Ссылка.РезервС МЕЖДУ &ДН И &ДК
	                             |	И ЗаявкаНаБронированиеДопПожелания.Информация <> &Инфо");
								 
 		ЗапросОпрошенн.УстановитьПараметр("ДН",НачалоМесяца(ТекущаяДата()));
	 ЗапросОпрошенн.УстановитьПараметр("ДК",КонецМесяца(ТекущаяДата()));
	 ЗапросОпрошенн.УстановитьПараметр("Инфо","");
	 ТЗОпр=ЗапросОпрошенн.Выполнить().Выгрузить();
								 
	 ПроцентОпроса=?(ТЗВсего.Количество()=0,0,(ТЗОпр.Количество()/ТЗВсего.Количество())*100);
	Обл=Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.заголовок="Отчет за текущий месяц, опрошенно "+Формат(ПроцентОпроса, "ЧДЦ=2; ЧГ=")+"% клиентов";
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	ТаблДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Шапка2|ШапкаВерх");
	
	ЗапросРаз=Новый Запрос("ВЫБРАТЬ
	                       |	ВложенныйЗапрос.Клиент,
	                       |	ВложенныйЗапрос.Ссылка
	                       |ИЗ
	                       |	(ВЫБРАТЬ
	                       |		ЗаявкаНаБронирование.Клиент КАК Клиент,
	                       |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК Ссылка
	                       |	ИЗ
	                       |		Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                       |	
	                       |	СГРУППИРОВАТЬ ПО
	                       |		ЗаявкаНаБронирование.Клиент) КАК ВложенныйЗапрос
	                       |ГДЕ
	                       |	ВложенныйЗапрос.Ссылка > 1");
						   
						   
	ТЗРаз=ЗапросРаз.Выполнить().Выгрузить();						   
	
	ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлиентыПрочаяИнформация.ВидИнформации
	|ИЗ
	|	Справочник.Клиенты.ПрочаяИнформация КАК КлиентыПрочаяИнформация");
	ТЗИнфПоКл=ЗапросВиды.Выполнить().Выгрузить();
	
	ЗапросВиды=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаБронированиеДопПожелания.ВидИнформации
	|ИЗ
	|	Документ.ЗаявкаНаБронирование.ДопПожелания КАК ЗаявкаНаБронированиеДопПожелания");
	ТЗИнфПоПос=ЗапросВиды.Выполнить().Выгрузить();
	ТаблДок.Присоединить(Обл);
	Обл=Макет.ПолучитьОбласть("Шапка2|Инф");
	Обл.Параметры.Инф="Возраст";
	
	ТаблДок.Присоединить(Обл);	
	Обл.Параметры.Инф="Город";
	ТаблДок.Присоединить(Обл);
	Обл.Параметры.Инф="Страна";
	ТаблДок.Присоединить(Обл);
    Обл.Параметры.Инф="Скидка";
	ТаблДок.Присоединить(Обл);

	Для каждого Стр Из ТЗИнфПоКл Цикл
		Если Стр.ВидИнформации.Наименование="" тогда
			Продолжить;
		конецесли;
		Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Город/Страна",Стр.ВидИнформации.Наименование);
		ТаблДок.Присоединить(Обл);		
	КонецЦикла; 
	Для каждого Стр Из ТЗИнфПоПос Цикл
		Если Стр.ВидИнформации.Наименование="" тогда
			Продолжить;
		конецесли;
		
		Обл.Параметры.Инф=?(Стр.ВидИнформации.Наименование="","Администратор",Стр.ВидИнформации.Наименование);
		ТаблДок.Присоединить(Обл);		
	КонецЦикла; 	
	//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
	ПолеОтчета.Вывести(ТаблДок);
	
	ЗапросПроживающих=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	ЗанятостьНомеров.Клиент,
	                               |	ЗанятостьНомеров.Номер КАК Номер,
	                               |	ЗанятостьНомеров.Регистратор,
	                               |	НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) КАК ПериодРезерва
	                               |ИЗ
	                               |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                               |ГДЕ
	                               |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                               |
	                               |УПОРЯДОЧИТЬ ПО
	                               |	ПериодРезерва УБЫВ,
	                               |	ЗанятостьНомеров.Номер.Наименование");
	//ЗапросПроживающих.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Проживает);			 								   
	//ЗапросПроживающих.УстановитьПараметр("ДН",НачалоГода(ТекущаяДата()));			 
	ЗапросПроживающих.УстановитьПараметр("ДН",НачалоГода(ТекущаяДата()));			 
	ЗапросПроживающих.УстановитьПараметр("ДК",КонецДня(ТекущаяДата()));
	СписокПроживающих=ЗапросПроживающих.Выполнить().Выгрузить();
	
	Для каждого Прож Из СписокПроживающих Цикл
		ТаблДок=Новый ТабличныйДокумент;

		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
		//Проживает	Бронирует	Оплачивает	Дата заезда	Дата выезда	Номер  ДатаЗаезда	ДатаВыезда
		Обл.Параметры.Проживает=Прож.Клиент.Наименование;
		ПоискКол=ТЗРаз.Найти(Прож.Клиент,"Клиент");
		Обл.Параметры.Раз=?(ПоискКол=Неопределено,"1",ПоискКол.Ссылка);
		Обл.Параметры.Бронирует=Прож.Регистратор.бронирует.Наименование;
		Обл.Параметры.Оплачивает=Прож.Регистратор.Оплачивает.Наименование;
		Обл.Параметры.ДатаЗаезда=Формат(Прож.Регистратор.РезервС, "ДФ=dd.MM.yy");
		Обл.Параметры.ДатаВыезда=Формат(Прож.Регистратор.РезервПо, "ДФ=dd.MM.yy");
		Обл.Параметры.Номер=Прож.Регистратор.НомерВРезерв.Наименование;
		Обл.Параметры.ДП=Формат(Прож.ПериодРезерва, "ДФ=dd.MM.yy");
		ТаблДок.Присоединить(Обл);
		Обл=Макет.ПолучитьОбласть("Строка|Инф");
	
		Возраст=Окр(((ТекущаяДата()-Прож.Клиент.ДатаРождения)/86400)/365);
		Обл.Параметры.Инф=?(Возраст>100,"--",Возраст);
		ТаблДок.Присоединить(Обл);
		Обл.Параметры.Инф=Прож.Клиент.Город.Наименование;
		ТаблДок.Присоединить(Обл);
		Обл.Параметры.Инф=Прож.Клиент.Страна.Наименование;
		ТаблДок.Присоединить(Обл);
		
        Обл.Параметры.Инф=?(Прож.Клиент.Категория.Пустая(),"0",Строка(Прож.Клиент.Категория.Скидка));
		ТаблДок.Присоединить(Обл);

		Для каждого Стр Из ТЗИнфПоКл Цикл
			Если Стр.ВидИнформации.Наименование="" тогда
				Продолжить;
			конецесли;
			Поиск=Прож.Клиент.ПрочаяИнформация.найти(Стр.ВидИнформации,"ВидИнформации");
			Если Поиск=Неопределено тогда
				Обл.Параметры.Инф="";	
			иначе
				Обл.Параметры.Инф=Поиск.Информация;
			конецесли;		
			ТаблДок.Присоединить(Обл);		
		КонецЦикла; 
		Для каждого Стр Из ТЗИнфПоПос Цикл
			Если Стр.ВидИнформации.Наименование="" тогда
				Продолжить;
			конецесли;
			Поиск=Прож.Регистратор.ДопПожелания.найти(Стр.ВидИнформации,"ВидИнформации");
			Если Поиск=Неопределено тогда
				Обл.Параметры.Инф="";	
			иначе
				Обл.Параметры.Инф=Поиск.Информация;
			конецесли;		
			ТаблДок.Присоединить(Обл);	
		КонецЦикла; 	
		//ЭлементыФормы.ПолеОтчета.Вывести(ТаблДок);
		ПолеОтчета.Вывести(ТаблДок);
		
	КонецЦикла; 
	
	ИмяФайла = Константы.Папка_C_BASE.Получить();
	ИмяФайла = ИмяФайла + "REP\Rep_year.xls";  
	
	//ЭлементыФормы.ПолеОтчета.Записать("C:\BASE\REP\Rep_year.xls",ТипФайлаТабличногоДокумента.XLS97);
	ПолеОтчета.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS97);
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	// + ПСН Перенесено в ОтчетЗаГод
	//ОтправитьМылом("Отчет за год","C:\BASE\REP\Rep_year.xls","","guz@5sreda.ru");
	// - ПСН Перенесено в ОтчетЗаГод
	
	Ответ = Новый Структура;
	Ответ.Вставить("Тема", "Отчет за год");  
	Ответ.Вставить("Файл1", ИмяФайла);  
	//Ответ.Вставить("Файл2", "");  
	//Ответ.Вставить("Получатель", "postnikov_sn@invina.ru");  
	
	Возврат Ответ;

КонецФункции
//

&НаКлиенте
Процедура ОсновныеДействияФормыАудит___(Кнопка)
	//ДТ=ТекущаяДата();
	//ВвестиДату(ДТ);
	//ОтчетАудит(ДТ);	
КонецПроцедуры

//
&НаКлиенте
Процедура Аудит(Команда)
	ДТ=ТекущаяДата();
	//ВвестиДату(ДТ);
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВводДатыДТ", ЭтаФорма);
	ПоказатьВводДаты(Оповещение, ДТ);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводДатыДТ(Результат, ДополнительныеПараметры) Экспорт 
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

ДТ = Результат;
ОтчетАудит(ДТ);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетАудит(ДТ)
Ответ = ОтчетАудитНаСервере(ДТ);

//ОтправитьМыломАудит(Ответ.Тема, Ответ.Файл1,"",Ответ.Получатель);
	
Тема =  Ответ.Тема;

Получатели = Новый СписокЗначений;
Получатели.Добавить("postnikov_sn@invina.ru");
	////ПочтовоеСообщение.Получатели.Добавить("Kantorov_EE@invina.ru");
	//ПочтовоеСообщение.Получатели.Добавить("isaeva_js@invina.ru");
	//ПочтовоеСообщение.Получатели.Добавить("mokrenko_an@invina.ru");
	//ПочтовоеСообщение.Получатели.Добавить("Streltsova_EN@invina.ru ");
	// 
	// ПочтовоеСообщение.Получатели.Добавить("guz@agent5.ru");

Файлы = Новый СписокЗначений;
Файлы.Добавить(Ответ.Файл1);

СлужебныеСервер.ОтправитьМейлом(Тема, файлы, Получатели); 
КонецПроцедуры

&НаСервере
Функция ОтчетАудитНаСервере(ДТ)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ЕжедневныйАудитПроданныеНомера.Ссылка,
	                    |	ЕжедневныйАудитПроданныеНомера.НомерСтроки КАК НомерСтроки,
	                    |	ЕжедневныйАудитПроданныеНомера.Бронь,
	                    |	ЕжедневныйАудитПроданныеНомера.Клиент,
	                    |	ЕжедневныйАудитПроданныеНомера.НомерВРезерв,
	                    |	ЕжедневныйАудитПроданныеНомера.Коэф,
	                    |	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживание,
	                    |	ЕжедневныйАудитПроданныеНомера.Заезд,
	                    |	ЕжедневныйАудитПроданныеНомера.ЗаездКоррекция,
	                    |	ЕжедневныйАудитПроданныеНомера.Выезд,
	                    |	ЕжедневныйАудитПроданныеНомера.ВыездКоррекция,
	                    |	ЕжедневныйАудитПроданныеНомера.Тариф_НеИспользуется,
	                    |	ЕжедневныйАудитПроданныеНомера.ТарифКоррекция,
	                    |	ЕжедневныйАудитПроданныеНомера.СуммаКоррекция,
	                    |	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживаниеПлан,
	                    |	ЕжедневныйАудитПроданныеНомера.Комментарий
	                    |ИЗ
	                    |	Документ.ЕжедневныйАудит.ПроданныеНомера КАК ЕжедневныйАудитПроданныеНомера
	                    |ГДЕ
	                    |	ЕжедневныйАудитПроданныеНомера.Ссылка.Дата МЕЖДУ &ДН И &ДК
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	НомерСтроки");	
	Запрос.УстановитьПараметр("ДН",НачалоДня(ДТ));
	Запрос.УстановитьПараметр("ДК",КонецДня(ДТ));
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	//Макет=ПолучитьМакет("МакетАудит");
	Макет = Отчеты.ОтчетПоКлиентам.ПолучитьМакет("МакетАудит");
	
	ТабДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Обл);
	
	Для каждого стр из ТЗ цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(стр);
		ТабДок.Вывести(Обл);
	КонецЦикла;
	
	////ТабДок.Показать();
	
	ИмяФайла = Константы.Папка_C_BASE.Получить();
	ИмяФайла = ИмяФайла + "REP\Audit_"+Формат(ДТ, "ДФ=ddMMyy")+".xls";  
	//ТабДок.Записать("C:\BASE\REP\Audit_"+Формат(ДТ, "ДФ=ddMMyy")+".xls",ТипФайлаТабличногоДокумента.XLS97);
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS97);
	
	// + ПСН Переносено в Аудит  
	//ОтправитьМыломАудит("Аудит за " + Формат(ДТ, "ДФ=dd.MM.yy"),"C:\BASE\REP\Audit_"+Формат(ДТ, "ДФ=ddMMyy")+".xls","","");
	// - ПСН Переносено в Аудит 
	
	Ответ = Новый Структура;
	Ответ.Вставить("Тема", "Аудит за " + Формат(ДТ, "ДФ=dd.MM.yy"));  
	Ответ.Вставить("Файл1", ИмяФайла);  
	//Ответ.Вставить("Файл2", "");  
	//Ответ.Вставить("Получатель", "");  
	
	Возврат Ответ;
КонецФункции
//

&НаКлиенте
Процедура ОтправитьМыломАудит_КУдаление(Тема,Файло1,Файло2,Получатель) Экспорт
	ЛогФайл = "Рассылка.log";
	
// + ПСН 
	//ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	//ПочтовыйПрофиль.АдресСервераSMTP   = "smtp.rambler.ru"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
	//Акк ="hotelchekhov@rambler.ru";
	//СтрПоз = Найти(Акк, "@");

	//Если СтрПоз > 0 Тогда
	//	смтпПользователь = Лев(Акк, СтрПоз-1);
	//Иначе
	//	Сообщить("Не заполнена константа ""Эл. адрес отправителя"". Рассылка невозможна.");
	//	//ВЛог("Не заполнена константа ""Эл. адрес отправителя"". Рассылка невозможна.",ЛогФайл,,Истина);
	//	Возврат;
	//КонецЕсли;
	//ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	//ПочтовыйПрофиль.ПарольSMTP         = "hotel123"; 
	//ПочтовыйПрофиль.Пароль = "hotel123";
	//ПочтовыйПрофиль.ВремяОжидания      = 15;                 
	//ПочтовыйПрофиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;
// - ПСН	
	Акк ="hotelchekhov@rambler.ru";

	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	ПочтовыйПрофиль.АдресСервераSMTP   = "srvex1.corp.invina.ru"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
	смтпПользователь="postnikov_sn";//Константы.АдресЭлПочтыОтправителя.Получить();
	
	ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	ПочтовыйПрофиль.ПарольSMTP         = "<HFNyjcjhju*14"; 

	
	Почта = Новый ИнтернетПочта(); 
	
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		Сообщить("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки());
		////ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки(),ЛогФайл, , Истина); 
		Возврат; 
	КонецПопытки; 
	ТелоСообщения = "
	|
	|-------------------------------------------------------------------------
	|Данное сообщение сгенерировано автоматически.
	|Отвечать на это письмо по адресу отправителя не имеет смысла.
	|С вопросами и предложениями, пожалуйста, обращайтесь в компанию ТЦ Пятая Среда. тел. 213-222-7
	|-------------------------------------------------------------------------";
	
	
	
	ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение; 
	
	ПочтовоеСообщение.Тема = Тема + " " + ТекущаяДата();
	ПочтовоеСообщение.Тексты.Добавить(ТелоСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);
	
	////ПочтовоеСообщение.Получатели.Добавить(Получатель);
	////ПочтовоеСообщение.Получатели.Добавить("Kantorov_EE@invina.ru");
	//ПочтовоеСообщение.Получатели.Добавить("isaeva_js@invina.ru");
	//ПочтовоеСообщение.Получатели.Добавить("mokrenko_an@invina.ru");
	//ПочтовоеСообщение.Получатели.Добавить("Streltsova_EN@invina.ru ");
	// 
	// ПочтовоеСообщение.Получатели.Добавить("guz@agent5.ru");

	ПочтовоеСообщение.Получатели.Добавить("postnikov_sn@invina.ru");

	ПочтовоеСообщение.Отправитель = Акк;
	ПочтовоеСообщение.ИмяОтправителя = "Уведомление Реноме";
	ПочтовоеСообщение.Вложения.Добавить(Файло1);
	Если Файло2<>"" тогда
		ПочтовоеСообщение.Вложения.Добавить(Файло2);
	КонецЕсли;
	
	Попытка
		Почта.Послать(ПочтовоеСообщение);
		////ВЛог(ТЕма +" отправлен",ЛогФайл);
	Исключение
		Сообщить(ОписаниеОшибки());
		////ВЛог(ОписаниеОшибки(),ЛогФайл,,Истина);
	КонецПопытки;
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьМылом_КУдалению(Тема,Файло1,Файло2,Получатель) Экспорт
	ЛогФайл = "Рассылка.log";
	
// + ПСН
	
	//ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	//ПочтовыйПрофиль.АдресСервераSMTP   = "smtp.rambler.ru"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
	//
	//Акк ="hotelchekhov@rambler.ru";
	//СтрПоз = Найти(Акк, "@");

	//Если СтрПоз > 0 Тогда
	//	смтпПользователь = Лев(Акк, СтрПоз-1);
	//Иначе
	//	Сообщить("Не заполнена константа ""Эл. адрес отправителя"". Рассылка невозможна.");
	//	//ВЛог("Не заполнена константа ""Эл. адрес отправителя"". Рассылка невозможна.",ЛогФайл,,Истина);
	//	Возврат;
	//КонецЕсли;
	//
	//ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	//ПочтовыйПрофиль.ПарольSMTP         = "hotel123"; 
	//ПочтовыйПрофиль.Пароль = "hotel123";
	//ПочтовыйПрофиль.ВремяОжидания      = 15;                 
	//ПочтовыйПрофиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;  
	
// - ПСН

	Акк ="hotelchekhov@rambler.ru";

	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	ПочтовыйПрофиль.АдресСервераSMTP   = "srvex1.corp.invina.ru"; 
	//ПочтовыйПрофиль.ПортSMTP           = 25; 
	смтпПользователь="postnikov_sn";//Константы.АдресЭлПочтыОтправителя.Получить();
	
	ПочтовыйПрофиль.ПользовательSMTP   = смтпПользователь; 
	ПочтовыйПрофиль.ПарольSMTP         = "<HFNyjcjhju*14"; 

	
	Почта = Новый ИнтернетПочта(); 
	
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		Сообщить("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки());
		////ВЛог("Рассылка: Ошибка при подключении к почтовому профилю. Рассылка невозможна. " + ОписаниеОшибки(),ЛогФайл, , Истина); 
		Возврат; 
	КонецПопытки; 
	ТелоСообщения = "
	|
	|-------------------------------------------------------------------------
	|Данное сообщение сгенерировано автоматически.
	|Отвечать на это письмо по адресу отправителя не имеет смысла.
	|С вопросами и предложениями, пожалуйста, обращайтесь в компанию ТЦ Пятая Среда. тел. 213-222-7
	|-------------------------------------------------------------------------";
	
	ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение; 
	
	ПочтовоеСообщение.Тема = Тема + " " + ТекущаяДата();
	ПочтовоеСообщение.Тексты.Добавить(ТелоСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);
	
//	//ПочтовоеСообщение.Получатели.Добавить(Получатель);
//	ПочтовоеСообщение.Получатели.Добавить("Kantorov_EE@invina.ru");
////	ПочтовоеСообщение.Получатели.Добавить("Kantorova_JA@invina.ru");
//	ПочтовоеСообщение.Получатели.Добавить("isaeva_js@invina.ru");
//  //  ПочтовоеСообщение.Получатели.Добавить("arestova_ov@invina.ru");
//  ПочтовоеСообщение.Получатели.Добавить("mokrenko_an@invina.ru");

	 //ПочтовоеСообщение.Получатели.Добавить("guz@agent5.ru");

	ПочтовоеСообщение.Получатели.Добавить("postnikov_sn@invina.ru");

	ПочтовоеСообщение.Отправитель = Акк;
	ПочтовоеСообщение.ИмяОтправителя = "Уведомление Реноме";
	ПочтовоеСообщение.Вложения.Добавить(Файло1);
	Если Файло2<>"" тогда
		ПочтовоеСообщение.Вложения.Добавить(Файло2);
	КонецЕсли;
	
	Попытка
		Почта.Послать(ПочтовоеСообщение);
		////ВЛог(ТЕма +" отправлен",ЛогФайл);
	Исключение
		Сообщить(ОписаниеОшибки());
		////ВЛог(ОписаниеОшибки(),ЛогФайл,,Истина);
	КонецПопытки;
КонецПроцедуры	







//   ТЗШахм=Новый ТаблицаЗначений;
//ТЗШахм.Колонки.Добавить("Х");
//ТЗШахм.Колонки.Добавить("У");
//ТЗШахм.Колонки.Добавить("Клиент");
//ТЗШахм.Колонки.Добавить("Номер");
//ТЗШахм.Колонки.Добавить("Период");
//ТЗШахм.Колонки.Добавить("Документ");
