
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если Проверка тогда
	Для Каждого ТекСтрокаПроданныеНомера Из ПроданныеНомера Цикл
		// регистр ПроданныеНомера 
		Движение = Движения.ПроданныеНомера.Добавить();
		Движение.ДатаПродажи = Дата;
		Движение.Бронь = ТекСтрокаПроданныеНомера.Бронь;
		Движение.Клиент = ТекСтрокаПроданныеНомера.Клиент;
		Движение.НомерВРезерв = ТекСтрокаПроданныеНомера.НомерВРезерв;
		Движение.СуммаЗаПроживаниеПлан = ТекСтрокаПроданныеНомера.СуммаЗаПроживаниеПлан;
		Движение.СуммаЗаПроживание = ТекСтрокаПроданныеНомера.СуммаЗаПроживание;
		Движение.Комментарий = ТекСтрокаПроданныеНомера.Комментарий;
		Движение.Тариф_НеИспользуется = ТекСтрокаПроданныеНомера.Тариф;
		Движение.ТарифКоррекция = ТекСтрокаПроданныеНомера.ТарифКоррекция;
		Движение.СуммаКоррекция = ТекСтрокаПроданныеНомера.СуммаКоррекция;
		Движение.Коэф = ТекСтрокаПроданныеНомера.Коэф;
	КонецЦикла;
	конецесли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
