
&НаСервере
Процедура ДобавитьДрайверНаСервере()
	Драйвер = Справочники.ДрайверыОборудования.СоздатьЭлемент();
	Драйвер.ИмяПредопределенныхДанных = "ДрайверАТОЛККТ54ФЗ10XФФД12X_ru";
	Драйвер.ОбменДанными.Загрузка = Истина;
	
	
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:ККТ с передачей данных в ОФД 10.x (ФФД 1.2) УСН НДС'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИдентификаторОбъекта = "ATOL_KKT_1C_V10X"; 
	Драйвер.ВерсияДрайвера = "10.10.6.0";
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзМакета;
	Драйвер.ИмяМакетаДрайвера = "ДрайверАТОЛККТ54ФЗ10XФФД12X_ru";
	//Драйвер.ЛокальныйРежим = 
	//Драйвер.СетевойРежим = 
	//Драйвер.СерверныйРежим = 
	//Драйвер.СнятСПоддержки = 
	Драйвер.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДрайвер(Команда)
	ДобавитьДрайверНаСервере();
КонецПроцедуры
