
Функция СформироватьОтчетНаСервере(Макет, Знач ДатаОтчетаС, Знач ДатаОтчетаПо, ТипДатаС, ТипДатаПо, БронируетОтбор
	, НеПоказыватьЗакрытыеНераспределенныеОплаты, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();

ТабДок = Новый ТабличныйДокумент;      

ПолеОтчета = Новый ТабличныйДокумент;      

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Папка,
                      |	ДопУслуги.НомерПП КАК НомерПП,
                      |	ДопУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.ДопУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;
Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Папка) Тогда		
		Если ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			ЗаголовокОтчета = Строка.ЗаголовокОтчеты;
		Иначе
			ЗаголовокОтчета = Строка.Папка;
		КонецЕсли;
		
		Область.Параметры.ШапкаДопУслуги = ЗаголовокОтчета;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область, 0);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

//Область = Макет.ПолучитьОбласть("Шапка|КолонкиПраво");
//ПолеОтчета.Присоединить(Область);

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

ПолеОтчета.ФиксацияСверху = 1;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

//
Итоги = Новый Структура();
Итоги.Вставить("КоличествоНочей", 0);
Итоги.Вставить("КоличествоСутокТариф", 0);
Итоги.Вставить("СуммаЦенаПроживание", 0);
Итоги.Вставить("СуммаПроживание", 0);
Итоги.Вставить("СуммаНомера", 0);
Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаЭквайринга", 0);

Итоги.Вставить("СуммаКомиссииИнформационно", 0);
Итоги.Вставить("СуммаКомиссииКВыплате", 0);
Итоги.Вставить("СуммаКомиссииОплата", 0);

Итоги.Вставить("КоличествоСтатус", 0);
Итоги.Вставить("КоличествоЗавтраки", 0);

Итоги.Вставить("КоличествоЧеловек", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);
//

//
ИтогиДень = Новый Структура();
ИтогиДень.Вставить("КоличествоНочей", 0);
ИтогиДень.Вставить("КоличествоСутокТариф", 0);
ИтогиДень.Вставить("СуммаЦенаПроживание", 0);
ИтогиДень.Вставить("СуммаПроживание", 0);
ИтогиДень.Вставить("СуммаНомера", 0);
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);

ИтогиДень.Вставить("СуммаКомиссииИнформационно", 0);
ИтогиДень.Вставить("СуммаКомиссииКВыплате", 0);
ИтогиДень.Вставить("СуммаКомиссииОплата", 0);

ИтогиДень.Вставить("КоличествоСтатус", 0);
ИтогиДень.Вставить("КоличествоЗавтраки", 0);

ИтогиДень.Вставить("КоличествоЧеловек", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);
//

КомиссияРаспределение = КомиссияРаспределение(ДатаОтчетаС, ДатаОтчетаПо);

Запрос =	Новый Запрос ("ВЫБРАТЬ
        	              |	НомернойФонд.Ссылка КАК НомерВРезерв,
        	              |	ЗаявкаДанные.Ссылка КАК Заявка,
        	              |	ЗаявкаДанные.Дата КАК Дата,
        	              |	ЗаявкаДанные.Бронирует КАК Бронирует,
        	              |	ЗаявкаДанные.Оплачивает КАК Оплачивает,
        	              |	ЗаявкаДанные.Статус КАК Статус,
        	              |	ЗаявкаДанные.КолВоЧеловек КАК КолВоЧеловек,
        	              |	ЗаявкаДанные.КоличествоСчетов КАК КоличествоСчетов,
        	              |	ЗаявкаДанные.Номер КАК ЗаявкаНомер,
        	              |	ЗаявкаДанные.Дата КАК ЗаявкаДата,
        	              |	ЗаявкаДанные.БезЗавтрака КАК БезЗавтрака,
        	              |	ЗаявкаДанные.БонШанс КАК БонШанс,
        	              |	ЗаявкаДанные.Ссылка.РезервС КАК РезервС,
        	              |	ЗаявкаДанные.ДеньПроживанияМинимум КАК ДеньПроживанияМинимум,
        	              |	ЗаявкаДанные.ДеньПроживанияМаксимум КАК ДеньПроживанияМаксимум,
        	              |	ЗаявкаДанные.ДатаУслугиМинимум КАК ДатаУслугиМинимум,
        	              |	ЗаявкаДанные.ДатаУслугиМаксимум КАК ДатаУслугиМаксимум
        	              |ИЗ
        	              |	Справочник.НомернойФонд КАК НомернойФонд
        	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |			ЗаявкаНаБронирование.Ссылка КАК Ссылка,
        	              |			ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
        	              |			ЗаявкаНаБронирование.Бронирует КАК Бронирует,
        	              |			ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
        	              |			ЗаявкаНаБронирование.Статус КАК Статус,
        	              |			ЗаявкаНаБронирование.КолВоЧеловек КАК КолВоЧеловек,
        	              |			СчетаКоличество.КоличествоСчетов КАК КоличествоСчетов,
        	              |			ЗаявкаНаБронирование.Номер КАК Номер,
        	              |			ЗаявкаНаБронирование.Дата КАК Дата,
        	              |			ЗаявкаНаБронирование.БезЗавтрака КАК БезЗавтрака,
        	              |			ЗаявкаНаБронирование.БонШанс КАК БонШанс,
        	              |			ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДеньПроживанияМинимум,
        	              |			ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДеньПроживанияМаксимум,
        	              |			ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМинимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУслугиМинимум,
        	              |			ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМаксимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУслугиМаксимум
        	              |		ИЗ
        	              |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
        	              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |					ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
        	              |					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронированиеСчета.СчетГУИД) КАК КоличествоСчетов
        	              |				ИЗ
        	              |					Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
        	              |				
        	              |				СГРУППИРОВАТЬ ПО
        	              |					ЗаявкаНаБронированиеСчета.Ссылка) КАК СчетаКоличество
        	              |				ПО ЗаявкаНаБронирование.Ссылка = СчетаКоличество.Ссылка
        	              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |					ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
        	              |					МИНИМУМ(ЗаявкаНаБронированиеПроживание.ДеньПроживания) КАК ДеньПроживанияМинимум,
        	              |					МАКСИМУМ(ЗаявкаНаБронированиеПроживание.ДеньПроживания) КАК ДеньПроживанияМаксимум
        	              |				ИЗ
        	              |					Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
        	              |				
        	              |				СГРУППИРОВАТЬ ПО
        	              |					ЗаявкаНаБронированиеПроживание.Ссылка) КАК Проживания
        	              |				ПО ЗаявкаНаБронирование.Ссылка = Проживания.Ссылка
        	              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |					ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
        	              |					МИНИМУМ(ЗаявкаНаБронированиеДопУслуги.ДатаУслуги) КАК ДатаУслугиМинимум,
        	              |					МАКСИМУМ(ЗаявкаНаБронированиеДопУслуги.ДатаУслуги) КАК ДатаУслугиМаксимум
        	              |				ИЗ
        	              |					Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
        	              |				ГДЕ
        	              |					ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
        	              |				
        	              |				СГРУППИРОВАТЬ ПО
        	              |					ЗаявкаНаБронированиеДопУслуги.Ссылка) КАК ТЧДопУслуги
        	              |				ПО ЗаявкаНаБронирование.Ссылка = ТЧДопУслуги.Ссылка
        	              |		ГДЕ
        	              |			ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
        	              |			И ВЫБОР
        	              |					КОГДА &ТипДатаС = ""ВсеЗаПериод""
        	              |							ИЛИ &ТипДатаПо = ""ВсеЗаПериод""
        	              |						ТОГДА ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |									И ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |								ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |									И ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |					ИНАЧЕ ВЫБОР
        	              |								КОГДА &ТипДатаС = ""ДатаВыезда""
        	              |									ТОГДА ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |											ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |								ИНАЧЕ ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |										ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМинимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |							КОНЕЦ
        	              |							И ВЫБОР
        	              |								КОГДА &ТипДатаПо = ""ДатаВыезда""
        	              |									ТОГДА ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |											ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМаксимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |								ИНАЧЕ ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |										ИЛИ ЕСТЬNULL(ТЧДопУслуги.ДатаУслугиМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |							КОНЕЦ
        	              |				КОНЕЦ
        	              |			И ВЫБОР
        	              |					КОГДА Проживания.ДеньПроживанияМаксимум ЕСТЬ NULL
        	              |						ТОГДА ИСТИНА
        	              |					ИНАЧЕ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
        	              |							ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает)
        	              |							ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
        	              |				КОНЕЦ
        	              |			И ВЫБОР
        	              |					КОГДА &БронируетОтбор = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
        	              |						ТОГДА ИСТИНА
        	              |					ИНАЧЕ ЗаявкаНаБронирование.Бронирует = &БронируетОтбор
        	              |				КОНЕЦ) КАК ЗаявкаДанные
        	              |		ПО НомернойФонд.Ссылка = ЗаявкаДанные.НомерВРезерв
        	              |ГДЕ
        	              |	НомернойФонд.ПометкаУдаления = ЛОЖЬ
        	              |
        	              |УПОРЯДОЧИТЬ ПО
        	              |	НомернойФонд.Наименование,
        	              |	Заявка");

Запрос.УстановитьПараметр("ДатаОтчетаС", ДатаОтчетаС);
Запрос.УстановитьПараметр("ДатаОтчетаПо", ДатаОтчетаПо);
Запрос.УстановитьПараметр("ТипДатаС", ТипДатаС);
Запрос.УстановитьПараметр("ТипДатаПо", ТипДатаПо);
Запрос.УстановитьПараметр("БронируетОтбор", БронируетОтбор);
ТЗ_Заявки = Запрос.Выполнить().Выгрузить();

Заявки = ТЗ_Заявки.ВыгрузитьКолонку("Заявка");
ТЗ_ПроживаниеЗаявки = ОтчетыСервер.ТЗ_ПроживаниеЗаявки(Заявки);
ТЗ_УслугиЗаявки = ОтчетыСервер.ТЗ_УслугиЗаявки(Заявки);
ТЗ_ОплатыЗаявки = ОтчетыСервер.ТЗ_ОплатыЗаявки(Заявки);

СписокКонтрагентыИИН_Эквайринг = БезналРаспределениеСервер.СписокИННЭквайринг();
ПолучательПлатежа = Константы.ПолучательПлатежаБезнал.Получить();

Дата_П = ДатаОтчетаС;
Пока Дата_П <= ДатаОтчетаПо Цикл
	
	Если ТЗ_Заявки.Количество() = 0 Тогда Перейти ~ПРОДОЛЖИТЬ_ДатаОтчетаПо; КонецЕсли;
	
	ИтогиДень.КоличествоСтатус = 0;;
	ИтогиДень.КоличествоНочей = 0;
	ИтогиДень.КоличествоСутокТариф = 0;
	ИтогиДень.СуммаЦенаПроживание = 0;
	ИтогиДень.СуммаПроживание = 0;
	ИтогиДень.СуммаНомера = 0;
	ИтогиДень.СуммаОплаты = 0;
	ИтогиДень.СуммаЭквайринга = 0;
	
	ИтогиДень.СуммаКомиссииИнформационно = 0;
	ИтогиДень.СуммаКомиссииКВыплате = 0;
	ИтогиДень.СуммаКомиссииОплата = 0;

	ИтогиДень.КоличествоСтатус = 0;;
	ИтогиДень.КоличествоЗавтраки = 0;;
	
	ИтогиДень.КоличествоЧеловек = 0;;
	
	УслугиДеньИтоги = ИтогиДень.УслугиДеньИтоги;
	Для Каждого Строка Из ИтогиДень.УслугиДеньИтоги Цикл
		Строка.СуммаУслуги = 0;	
	КонецЦикла;
	
	НетЗаголовокСтрока = Истина;
	Для Каждого СтрокаЗаявка Из ТЗ_Заявки Цикл
		КоличествоНочей = 0;
		КоличествоСутокТариф = 0;
		СуммаЦенаПроживание = 0;
		СуммаПроживание = 0;
		СуммаНомера = 0;
		СуммаОплаты = 0;
		СуммаЭквайринга = 0;
		СуммаКомиссии = 0;
		КоличествоЗавтраки = 0;
		
		СуммаКомиссииИнформационно = 0;
		СуммаКомиссииКВыплате = 0;
		СуммаКомиссииОплата = 0;
		
		КоличествоЧеловек = 0;;
		
		//Если СтрокаЗаявка.Заявка.НомерВРезерв.Наименование <> "Номер 508" Тогда Продолжить; КонецЕсли;
		//Если СтрокаЗаявка.Заявка.Номер <> "000015351" Тогда Продолжить; КонецЕсли;
		
		//Если НЕ (СтрокаЗаявка.Заявка.РезервС <= Дата_П И СтрокаЗаявка.Заявка.РезервПо >= Дата_П) Тогда 
		//	Продолжить; 
		//КонецЕсли;
		
		//Если НЕ (СтрокаЗаявка.ДеньПроживанияМинимум <= Дата_П И СтрокаЗаявка.ДеньПроживанияМаксимум >= Дата_П) Тогда 
		//	Продолжить; 
		//КонецЕсли; 
		ПроживаниеВне = НЕ (СтрокаЗаявка.ДеньПроживанияМинимум <= Дата_П И СтрокаЗаявка.ДеньПроживанияМаксимум >= Дата_П); 
		УслугиВне =  НЕ (СтрокаЗаявка.ДатаУслугиМинимум <= Дата_П И СтрокаЗаявка.ДатаУслугиМаксимум >= Дата_П); 
		Если ПроживаниеВне И УслугиВне Тогда Продолжить; КонецЕсли;
		
		//ТЗ_Проживание = ОтчетыСервер.ТЗ_ПроживаниеЗаявкаДеньПроживания_ЧерезЗапрос(СтрокаЗаявка.Заявка, Дата_П);
		ТЗ_Проживание = ОтчетыСервер.ТЗ_ПроживаниеЗаявкаДеньПроживания(ТЗ_ПроживаниеЗаявки, СтрокаЗаявка.Заявка, Дата_П);
		
		//ТЗ_Услуги = ОтчетыСервер.ТЗ_УслугиЗаявкаДеньПроживания_ЧерезЗапрос(СтрокаЗаявка.Заявка, Дата_П);
		ТЗ_Услуги = ОтчетыСервер.ТЗ_УслугиЗаявкаДеньПроживания(ТЗ_УслугиЗаявки, СтрокаЗаявка.Заявка, Дата_П);

		Если ТЗ_Проживание.Количество() = 0 И ТЗ_Услуги.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
		//ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка_ЧерезЗапрос(СтрокаЗаявка.Заявка);
		ТЗ_Оплаты = ОтчетыСервер.ТЗ_ОплатыЗаявка(ТЗ_ОплатыЗаявки, СтрокаЗаявка.Заявка);		
		
		Если НетЗаголовокСтрока Тогда 		
			Область = Макет.ПолучитьОбласть("ЗаголовокСтрока");
			Дата = Формат(Дата_П, "ДФ='дд.МММ гг'" );  
			Область.Параметры.Дата = Дата;	
			ПолеОтчета.Вывести(Область, 0);
			
			НетЗаголовокСтрока = Ложь;
		КонецЕсли;	
		
		Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");

		Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
		Область.Параметры.Дата = Дата;		

		Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
		Область.Параметры.Месяц = Месяц;		

		ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
		Область.Параметры.ДеньНедели = ДеньНедели;
			
		НомерНаименование = СтрокаЗаявка.НомерВРезерв.Наименование;
		Область.Параметры.Номер = НомерНаименование;
		Область.Параметры.РасшифровкаНомер = СтрокаЗаявка.Заявка;

		КатегорияНомера = СтрокаЗаявка.НомерВРезерв.КатегорияНомера;
		Область.Параметры.КатегорияНомера = КатегорияНомера;

		Область.Параметры.КоличествоЧеловек = СтрокаЗаявка.КолВоЧеловек;
		Область.Параметры.Статус = СтрокаЗаявка.Статус;
		
		КоличествоЗавтраки = 0;
		Если (НЕ СтрокаЗаявка.БезЗавтрака) И (НЕ СтрокаЗаявка.БонШанс) Тогда
			КоличествоЗавтраки = СтрокаЗаявка.КолВоЧеловек;
		КонецЕсли;
		Область.Параметры.КоличествоЗавтраки = КоличествоЗавтраки;
		
		ЗаявкаЗакрыта = СтрокаЗаявка.Заявка.Закрыто;
		Если ЗаявкаЗакрыта Тогда
			//Область.Параметры.ЗаявкаЗакрыта = ЗаявкаЗакрыта;
			Область.Параметры.ДатаЗакрытияЗаявки = Формат(СтрокаЗаявка.Заявка.ДатаЗакрытия, "ДФ=dd.MM.yy");
		КонецЕсли;
		
		Бронирует = СтрокаЗаявка.Бронирует;
		ЭтоЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Бронирует);
		Если ЭтоЮрЛицо Тогда
			//Область.Параметры.Бронирует = Бронирует;
			Область.Параметры.Бронирует = Бронирует.НаименованиеЮрЛица;
			Область.Параметры.РасшифровкаБронирует = Бронирует;
		КонецЕсли;
		
		Область.Параметры.БронируетИНН = Бронирует.ИНН;
		
		ТЗ_ПроживаниеКоличество = ТЗ_Проживание.Количество();
		Если ТЗ_ПроживаниеКоличество = 0 Тогда  		
			СтрокаПроживание = ОбщийФункционалСервер.СтруктураИзТаблицы(ТЗ_Проживание);
			
			СтрокаПроживание.Цена = 0;
			СтрокаПроживание.Количество = 0;
			СтрокаПроживание.СуммаБезСкидки = 0;
			СтрокаПроживание.Сумма = 0;
		Иначе		
			СтрокаПроживание = ТЗ_Проживание[0];
		КонецЕсли;
		
		ЦенаПроживание = СтрокаПроживание.Цена;
		Если ЦенаПроживание <> 0 Тогда Область.Параметры.ЦенаПроживание = ЦенаПроживание; КонецЕсли;
		
		КоличествоСутокТариф = СтрокаПроживание.Количество;
		Область.Параметры.КоличествоСутокТариф = КоличествоСутокТариф;
			
		ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(СтрокаЗаявка.Бронирует, СтрокаЗаявка.РезервС); //, СтрокаЗаявка.Заявка.В2В);
		
		СуммаКомиссии = ДокументыСервер.СуммаКомиссии(СтрокаЗаявка, СтрокаПроживание.СуммаБезСкидки
			, СтрокаЗаявка.Заявка.Счета, СтрокаЗаявка.Заявка.СчетаДетальноДолги, ТЗ_Услуги, ПроцентКомиссии);
		
		Если СтрокаЗаявка.Бронирует.Турагентство Тогда
			СуммаПроживание = СтрокаПроживание.СуммаБезСкидки;
			
			Если СтрокаЗаявка.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.Взаимозачет Тогда  
				Если СтрокаЗаявка.Бронирует = СтрокаЗаявка.Оплачивает Тогда  
					СуммаКомиссииИнформационно = СуммаКомиссии;
					СуммаКомиссииИКВыплате = 0;
				Иначе	
					СуммаКомиссииИнформационно = 0;
					СуммаКомиссииКВыплате = СуммаКомиссии;
				КонецЕсли;	
			ИначеЕсли СтрокаЗаявка.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой Тогда 
				Если СтрокаЗаявка.Бронирует = СтрокаЗаявка.Оплачивает Тогда  
					СуммаКомиссииИнформационно = СуммаКомиссии;
					СуммаКомиссииИКВыплате = 0;
				Иначе	
					СуммаКомиссииИнформационно = 0;
					СуммаКомиссииКВыплате = СуммаКомиссии;
				КонецЕсли;					
			ИначеЕсли СтрокаЗаявка.Бронирует.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ПолнаяОплатаТурагентствомСВозвратомКомиссии Тогда 
				СуммаКомиссииИнформационно = 0;
				СуммаКомиссииКВыплате = СуммаКомиссии;
			Иначе	
				СуммаКомиссииИнформационно = 0;
				СуммаКомиссииКВыплате = СуммаКомиссии;
			КонецЕсли;	
			
		Иначе	
			СуммаПроживание = СтрокаПроживание.Сумма;  
			
			СуммаКомиссии = 0;
			СуммаКомиссииИнформационно = 0; 
			СуммаКомиссииКВыплате = 0;
		КонецЕсли;	
		
		Если СуммаПроживание <> 0 Тогда Область.Параметры.СуммаПроживание = СуммаПроживание; КонецЕсли;
		
		Если СуммаКомиссииИнформационно > 0 Тогда Область.Параметры.СуммаКомиссииИнформационно = СуммаКомиссииИнформационно; КонецЕсли;
		Если СуммаКомиссииКВыплате <> 0 Тогда Область.Параметры.СуммаКомиссииКВыплате = СуммаКомиссииКВыплате; КонецЕсли;
		
		Если ПроцентКомиссии <> 0 Тогда Область.Параметры.ПроцентКомиссии = ПроцентКомиссии; КонецЕсли;

		СуммаКомиссииРаспределено = 0;
		КомиссияДатаОплаты = Неопределено;
		КомиссияТипОплаты = Неопределено;

		ОтборСтроки = Новый Структура("Заявка, Дата", СтрокаЗаявка.Заявка, СтрокаПроживание.ДеньПроживания); 
		Массив_Платежи = КомиссияРаспределение.НайтиСтроки(ОтборСтроки);
		Если Массив_Платежи.Количество() = 1 Тогда 
			СтрокаПлатежа = Массив_Платежи[0];
			
			СуммаКомиссииРаспределено = СтрокаПлатежа.СуммаРаспределено;
			
			КомиссияДатаОплаты = СтрокаПлатежа.ДокументПлатежа.ДатаОплаты;
			КомиссияТипОплаты = ОтчетыСервер.ТипПлатежаНаименование(СтрокаПлатежа.ДокументПлатежа);
			
			РасшифровкаКомиссияДокументПлатежа = СтрокаПлатежа.ДокументПлатежа;
		ИначеЕсли Массив_Платежи.Количество() > 1 Тогда 
			Для Каждого СтрокаПлатежа Из Массив_Платежи Цикл 
				СуммаКомиссииРаспределено = СуммаКомиссииРаспределено + СтрокаПлатежа.СуммаРаспределено;
			КонецЦикла;
		КонецЕсли;
		Если СуммаКомиссииРаспределено <> 0 Тогда Область.Параметры.СуммаКомиссииОплата = СуммаКомиссииРаспределено; КонецЕсли;
		Если ЗначениеЗаполнено(КомиссияДатаОплаты) Тогда 
			Область.Параметры.КомиссияДатаОплаты = Формат(КомиссияДатаОплаты, "ДФ=dd.MM.yy"); 
			
			Область.Параметры.РасшифровкаКомиссияДокументОплаты = РасшифровкаКомиссияДокументПлатежа; 
		КонецЕсли;
		Если ЗначениеЗаполнено(КомиссияТипОплаты) Тогда Область.Параметры.КомиссияТипОплаты = Формат(КомиссияТипОплаты, "ДФ=dd.MM.yy"); КонецЕсли;
		
		СуммаОплаты = 0;
		СуммаЭквайринга = 0;
		
		Массив_ОплатыЗаявка = Новый Массив;
		Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
			ВСписке = ОбщийФункционалСервер.ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Проживание);
			Если ВСписке Тогда   
				СуммаОплаты = СуммаОплаты + СтрокаОплаты.СуммаОплаты;		
				СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты) ;	
				
				Массив_ОплатыЗаявка.Добавить(СтрокаОплаты); 				
			КонецЕсли;
			
			ВСписке = ОбщийФункционалСервер.ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Услуги);
			Если ВСписке Тогда   
				СуммаОплаты = СуммаОплаты + СтрокаОплаты.СуммаОплаты;	
				СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты) ;					
				
				Массив_ОплатыЗаявка.Добавить(СтрокаОплаты); 				
			КонецЕсли;
		КонецЦикла;
		
		Если СуммаОплаты <> 0 Тогда Область.Параметры.СуммаОплаты = СуммаОплаты; КонецЕсли;
		Если СуммаЭквайринга <> 0 Тогда Область.Параметры.СуммаЭквайринга = СуммаЭквайринга; КонецЕсли;
		
		ЕстьОшибка = Ложь;
		Если Массив_ОплатыЗаявка.Количество() = 1 Тогда
			СтрокаОплатыЗаявка = Массив_ОплатыЗаявка[0];
			
			//Если ЗначениеЗаполнено(СтрокаОплатыЗаявка.ДокументОплаты.ДатаОплаты) Тогда
			Если ЗначениеЗаполнено(СтрокаОплатыЗаявка.ДокументОплаты) Тогда
				Область.Параметры.ДатаОплаты = Формат(СтрокаОплатыЗаявка.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
				
				Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплатыЗаявка.ТипОплаты);
				Область.Параметры.ГрупповаяОплата = ?(СтрокаОплатыЗаявка.ГрупповаяОплата, "V", "");
			
				Если ЗначениеЗаполнено(СтрокаОплатыЗаявка.ДатаСменыККМ) Тогда 
					Область.Параметры.ДатаОткрытияСмены = Формат(СтрокаОплатыЗаявка.ДатаСменыККМ, "ДФ=dd.MM.yy");
				КонецЕсли;
				
				Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплатыЗаявка.ДокументОплаты;
			Иначе
				Область.Параметры.ДатаОплаты = "Ошибка";
				Область.Параметры.РасшифровкаДокументОплаты = "Ошибочный документ оплаты";
				ЕстьОшибка = Истина;
			КонецЕсли;
			
			Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплатыЗаявка);
			
			Область.Параметры.ТипДокументаОплаты = СтрокаОплатыЗаявка.ТипДокументаОплаты;
			Область.Параметры.НомерДокументаОплаты = СтрокаОплатыЗаявка.НомерДокументаОплаты;
			Область.Параметры.ДатаДокументаОплаты = СтрокаОплатыЗаявка.ДатаДокументаОплаты;
			Область.Параметры.СуммаДокументаОплаты = СтрокаОплатыЗаявка.СуммаДокументаОплаты;
			Область.Параметры.СуммаВозвратаДокументаОплаты = СтрокаОплатыЗаявка.СуммаВозвратаДокументаОплаты;
			
		КонецЕсли;
		
		СуммаЭквайрингаПроживание = ОтчетыСервер.СуммаЭквайрингаПроживание(ТЗ_Проживание, ТЗ_Оплаты);
		СуммаНомера = СуммаПроживание - СуммаЭквайрингаПроживание - СуммаКомиссии;
		Если СуммаНомера <> 0 Тогда Область.Параметры.СуммаНомера = СуммаНомера; КонецЕсли;
		
		Область.Параметры.ЗаявкаНомер = СтрокаЗаявка.ЗаявкаНомер;
		Область.Параметры.ЗаявкаДата = СтрокаЗаявка.ЗаявкаДата;
		Область.Параметры.КоличествоСчетов = СтрокаЗаявка.КоличествоСчетов;
		
		Область.Параметры.РасшифровкаЗаявка = СтрокаЗаявка.Заявка;
		
		ОбластьВывода = ПолеОтчета.Вывести(Область, 1);		
			
~УСЛУГИ:
		ТЗ_УслугиИтого = ТЗ_Услуги.Скопировать();
		ТЗ_УслугиИтого.Колонки.Добавить("УслугаРодитель");
		Для Каждого Строка Из ТЗ_УслугиИтого Цикл 
			Результат = Справочники.ДопУслуги.ПустаяСсылка();
			Ссылка = Строка.Услуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
			
			Строка.УслугаРодитель = Результат;	
		КонецЦикла;	
		ТЗ_УслугиИтого.Свернуть("ДатаУслуги, УслугаРодитель", "Сумма");
		
		Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
			ЕстьСтрока = Ложь;
			Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
				Если СтрокаУслугиИтого.УслугаРодитель = СтрокаРодительУслуги.Папка Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
			КонецЦикла;
			
			ОбластьУслуги = Макет.ПолучитьОбласть("Строка|КолонкаУслуги");
			Если ЕстьСтрока Тогда
				Если СтрокаУслугиИтого.Сумма <> 0 Тогда
					ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.Сумма;
				КонецЕсли;	
			КонецЕсли;
			
			ОбластьВывода = ПолеОтчета.Присоединить(ОбластьУслуги, 1);
		КонецЦикла;
		
		ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);

//
		Если Массив_ОплатыЗаявка.Количество() = 1 ИЛИ ЕстьОшибка Тогда
			//Если Массив_ОплатыЗаявка[0].ОстатокДокументаОплаты > 0 Тогда 
			//	ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);
			//КонецЕсли;	
			Если ЕстьОшибка Тогда 
				ВыведеннаяОбласть.ЦветФона = Новый Цвет(220, 220, 220);
			КонецЕсли;	
		КонецЕсли;	

		СуммаУслуги_П = ТЗ_Услуги.Итог("Сумма");
		СуммаПроживание_П = СтрокаПроживание.Сумма; 
		
 		Если СуммаПроживание_П + СуммаУслуги_П <> СуммаОплаты Тогда
			//ШрифтСтроки = Новый Шрифт(ВыведеннаяОбласть.Шрифт, , , ,Истина);
			ШрифтСтроки = Новый Шрифт("Arial" ,8 ,Ложь  ,Истина, Ложь);
			
			ВыведеннаяОбласть.Шрифт = ШрифтСтроки;

			ЦветТекстаСтроки = Новый Цвет(255, 0, 0);
		Иначе
			Если СуммаКомиссииКВыплате <> СуммаКомиссииРаспределено Тогда  		
				ЦветТекстаСтроки = Новый Цвет(185, 30, 175);
			Иначе
				ЦветТекстаСтроки = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ЦветТекстаСтроки <> Неопределено Тогда
			ВыведеннаяОбласть.ЦветТекста = ЦветТекстаСтроки;
		КонецЕсли;
		
// Платежи
		Если Массив_Платежи.Количество() > 1 Тогда	
			Для Каждого СтрокаПлатежи Из Массив_Платежи Цикл
				ОбластьПлатежи = Макет.ПолучитьОбласть("СтрокаПлатежи|КолонкиЛево");
				
				ОбластьПлатежи.Параметры.Дата = ".";
				
				ОбластьПлатежи.Параметры.ЗаявкаНомер = СтрокаЗаявка.ЗаявкаНомер;
				ОбластьПлатежи.Параметры.ЗаявкаДата = СтрокаЗаявка.ЗаявкаДата;
	
				СуммаКомиссииРаспределено = СтрокаПлатежа.СуммаРаспределено;
				
				КомиссияДатаОплаты = СтрокаПлатежа.ДокументПлатежа.ДатаОплаты;
				КомиссияТипОплаты = ОтчетыСервер.ТипПлатежаНаименование(СтрокаПлатежа.ДокументПлатежа);
				
				РасшифровкаКомиссияДокументПлатежа = СтрокаПлатежа.ДокументПлатежа;
			
				Если СуммаКомиссииРаспределено <> 0 Тогда ОбластьПлатежи.Параметры.СуммаКомиссииОплата = СуммаКомиссииРаспределено; КонецЕсли;
				Если ЗначениеЗаполнено(КомиссияДатаОплаты) Тогда 
					ОбластьПлатежи.Параметры.КомиссияДатаОплаты = Формат(КомиссияДатаОплаты, "ДФ=dd.MM.yy"); 
					
					ОбластьПлатежи.Параметры.РасшифровкаКомиссияДокументОплаты = РасшифровкаКомиссияДокументПлатежа; 
				КонецЕсли;
				Если ЗначениеЗаполнено(КомиссияТипОплаты) Тогда ОбластьПлатежи.Параметры.КомиссияТипОплаты = Формат(КомиссияТипОплаты, "ДФ=dd.MM.yy"); КонецЕсли;
			КонецЦикла;
			
			ПолеОтчета.Вывести(ОбластьПлатежи, 1);
		КонецЕсли;
		
// ОПЛАТЫ
		Если Массив_ОплатыЗаявка.Количество() > 1 Тогда
			Для Каждого СтрокаОплаты Из Массив_ОплатыЗаявка Цикл
				ОбластьОплаты = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
				
				ОбластьОплаты.Параметры.Дата = ".";
				
				ОбластьОплаты.Параметры.ЗаявкаНомер = СтрокаЗаявка.ЗаявкаНомер;
				ОбластьОплаты.Параметры.ЗаявкаДата = СтрокаЗаявка.ЗаявкаДата;
				
				ЕстьОшибка = Ложь;
				Если ЗначениеЗаполнено(СтрокаОплаты.ДокументОплаты) Тогда
					ОбластьОплаты.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
					
					ОбластьОплаты.Параметры.ГрупповаяОплата = ?(СтрокаОплаты.ГрупповаяОплата, "V", "");
					Область.Параметры.ГрупповаяОплата = ?(СтрокаОплаты.ГрупповаяОплата, "V", "");
				
				Если ЗначениеЗаполнено(СтрокаОплаты.ДатаСменыККМ) Тогда 
						ОбластьОплаты.Параметры.ДатаОткрытияСмены = Формат(СтрокаОплаты.ДатаСменыККМ, "ДФ=dd.MM.yy");
					КонецЕсли;
					
					ОбластьОплаты.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
				Иначе
					ЕстьОшибка = Истина;
					ОбластьОплаты.Параметры.ДатаОплаты = "Ошибка";
					ОбластьОплаты.Параметры.РасшифровкаДокументОплаты = "Ошибочный документ оплаты";
				КонецЕсли;
				
				ОбластьОплаты.Параметры.СуммаОплаты = СтрокаОплаты.СуммаОплаты;
				
				ОбластьОплаты.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
				//Область.Параметры.ПроцентЭквайринга = СтрокаОплаты.ПроцентЭквайринга;
				
				ОбластьОплаты.Параметры.РасшифровкаЗаявка = СтрокаЗаявка.Заявка;
				
				ОбластьОплаты.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплаты);
				
				ОбластьОплаты.Параметры.ТипДокументаОплаты = СтрокаОплаты.ТипДокументаОплаты;
				ОбластьОплаты.Параметры.НомерДокументаОплаты = СтрокаОплаты.НомерДокументаОплаты;
				ОбластьОплаты.Параметры.ДатаДокументаОплаты = СтрокаОплаты.ДатаДокументаОплаты;
				ОбластьОплаты.Параметры.СуммаДокументаОплаты = СтрокаОплаты.СуммаДокументаОплаты;
				ОбластьОплаты.Параметры.СуммаВозвратаДокументаОплаты = СтрокаОплаты.СуммаВозвратаДокументаОплаты;
			
				Если СтрокаОплаты.Услуга Тогда
					
					Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
						ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ДолгиГУИД);
						НайденныеСтроки = ТЗ_Услуги.НайтиСтроки(ОтборСтроки);
						
						ЕстьСтрока = Ложь;
						Для Каждого Строка Из НайденныеСтроки Цикл
							Результат = Справочники.ДопУслуги.ПустаяСсылка();
							Ссылка = Строка.Услуга; 
							ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
							
							Если Результат = СтрокаРодительУслуги.Папка Тогда
								ЕстьСтрока = Истина;
								
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ЕстьСтрока Тогда Прервать;  КонецЕсли;
					КонецЦикла;	
					
					Если ЕстьСтрока Тогда  
						ПолеОтчета.Вывести(ОбластьОплаты, 1);
					КонецЕсли;
					
					Если ЕстьСтрока Тогда 
						Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
							ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ДолгиГУИД);
							НайденныеСтроки = ТЗ_Услуги.НайтиСтроки(ОтборСтроки);
							
							ЕстьСтрока = Ложь;
							Для Каждого Строка Из НайденныеСтроки Цикл
								Результат = Справочники.ДопУслуги.ПустаяСсылка();
								Ссылка = Строка.Услуга; 
								ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
								
								Если Результат = СтрокаРодительУслуги.Папка Тогда
									ЕстьСтрока = Истина;
									
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
							ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
							Если ЕстьСтрока Тогда
								ОбластьУслуги.Параметры.СуммаУслуги = СтрокаОплаты.СуммаОплаты;
							КонецЕсли;
							
							ОбластьВывода = ПолеОтчета.Присоединить(ОбластьУслуги, 1);
						КонецЦикла;
					КонецЕсли;
				Иначе
					ВСписке = ОбщийФункционалСервер.ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Проживание); 
					Если ВСписке Тогда 
						ОбластьОплаты.Параметры.СуммаПроживание = СтрокаОплаты.СуммаОплаты;
						ОбластьВывода = ПолеОтчета.Вывести(ОбластьОплаты, 1);
					КонецЕсли;
				КонецЕсли;
			
				ВыведеннаяОбласть = ПолеОтчета.Область(ОбластьВывода.Верх, , ОбластьВывода.Низ);
				
				Если ЕстьОшибка Тогда
					ВыведеннаяОбласть.ЦветФона = Новый Цвет(220, 220, 220);
				КонецЕсли;
				Если СтрокаОплаты.ОстатокДокументаОплаты > 0 Тогда
					ВыведеннаяОбласть.ЦветТекста = Новый Цвет(0, 128, 0);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
////
		ИтогиДень.КоличествоНочей = ИтогиДень.КоличествоНочей + 1;
		ИтогиДень.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф + КоличествоСутокТариф;
		
		ИтогиДень.СуммаЦенаПроживание = ИтогиДень.СуммаЦенаПроживание + ЦенаПроживание;
		ИтогиДень.СуммаПроживание = ИтогиДень.СуммаПроживание + СуммаПроживание;
		
		ИтогиДень.СуммаНомера = ИтогиДень.СуммаНомера + СуммаНомера;
		
		ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
		
		ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
		
		ИтогиДень.СуммаКомиссииИнформационно = ИтогиДень.СуммаКомиссииИнформационно + СуммаКомиссииИнформационно;
		ИтогиДень.СуммаКомиссииКВыплате = ИтогиДень.СуммаКомиссииКВыплате + СуммаКомиссииКВыплате;
		ИтогиДень.СуммаКомиссииОплата = ИтогиДень.СуммаКомиссииОплата + СуммаКомиссииРаспределено;
		
		Если НЕ (СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
		ИЛИ СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
		Тогда 
			ИтогиДень.КоличествоСтатус = ИтогиДень.КоличествоСтатус + 1;
		КонецЕсли;
		
		Если НЕ (СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
		ИЛИ СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
		Тогда 
			ИтогиДень.КоличествоЗавтраки = ИтогиДень.КоличествоЗавтраки + КоличествоЗавтраки;
		КонецЕсли;
		
		ИтогиДень.КоличествоЧеловек = ИтогиДень.КоличествоЧеловек + СтрокаЗаявка.КолВоЧеловек;
		
		Для Каждого СтрокаУслугиДеньИтого Из ИтогиДень.УслугиДеньИтоги Цикл 
			ЕстьСтрока = Ложь;
			Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
				Если СтрокаУслугиИтого.УслугаРодитель = СтрокаУслугиДеньИтого.УслугаРодитель Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
			КонецЦикла;
			
			Если ЕстьСтрока Тогда 
				Если СтрокаУслугиИтого.Сумма <> 0 Тогда
					СтрокаУслугиДеньИтого.СуммаУслуги = СтрокаУслугиДеньИтого.СуммаУслуги + СтрокаУслугиИтого.Сумма;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
//~ПРОДОЛЖИТЬ_НЕРАСПРЕДЕЛЕННЫЕ_ОПЛАТЫ:

	Если НетЗаголовокСтрока Тогда Перейти ~ПРОДОЛЖИТЬ_ДатаОтчетаПо; КонецЕсли; 	
		
	ОбластьИтогиДень = Макет.ПолучитьОбласть("ИтогиДень|КолонкиЛево");
	
	Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
	ОбластьИтогиДень.Параметры.Дата = Дата;		

	Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
	ОбластьИтогиДень.Параметры.Месяц = Месяц;		

	ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
	ОбластьИтогиДень.Параметры.ДеньНедели = ДеньНедели;

	ОбластьИтогиДень.Параметры.Номер = "Итого Ночей:";
	ОбластьИтогиДень.Параметры.КатегорияНомера = ИтогиДень.КоличествоНочей;
	ОбластьИтогиДень.Параметры.ЦенаПроживание = ИтогиДень.СуммаЦенаПроживание;
	ОбластьИтогиДень.Параметры.СуммаПроживание = ИтогиДень.СуммаПроживание;
	ОбластьИтогиДень.Параметры.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф;
	
	ОбластьИтогиДень.Параметры.СуммаКомиссииИнформационно = ИтогиДень.СуммаКомиссииИнформационно;
	ОбластьИтогиДень.Параметры.СуммаКомиссииКВыплате = ИтогиДень.СуммаКомиссииКВыплате;
	ОбластьИтогиДень.Параметры.СуммаКомиссииОплата = ИтогиДень.СуммаКомиссииОплата;
	
	ОбластьИтогиДень.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
	ОбластьИтогиДень.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
	ОбластьИтогиДень.Параметры.СуммаНомера = ИтогиДень.СуммаНомера;
	
	ОбластьИтогиДень.Параметры.КоличествоСтатус = ИтогиДень.КоличествоСтатус;
	ОбластьИтогиДень.Параметры.КоличествоЗавтраки = ИтогиДень.КоличествоЗавтраки;
	
	ОбластьИтогиДень.Параметры.КоличествоЧеловек = ИтогиДень.КоличествоЧеловек;

	ПолеОтчета.Вывести(ОбластьИтогиДень, 0);
	
	Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
		ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
		Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
			ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
		КонецЕсли;	
		ПолеОтчета.Присоединить(ОбластьУслуги, 0);
	КонецЦикла;

//
	Итоги.КоличествоНочей = Итоги.КоличествоНочей + ИтогиДень.КоличествоНочей;
	Итоги.КоличествоСутокТариф = Итоги.КоличествоСутокТариф + ИтогиДень.КоличествоСутокТариф;
	
	Итоги.СуммаЦенаПроживание = Итоги.СуммаЦенаПроживание + ИтогиДень.СуммаЦенаПроживание;
	Итоги.СуммаПроживание = Итоги.СуммаПроживание + ИтогиДень.СуммаПроживание;
	
	Итоги.СуммаНомера = Итоги.СуммаНомера + ИтогиДень.СуммаНомера;
	
	Итоги.СуммаОплаты = Итоги.СуммаОплаты + ИтогиДень.СуммаОплаты;
	
	Итоги.СуммаЭквайринга = Итоги.СуммаЭквайринга + ИтогиДень.СуммаЭквайринга;  
	
	Итоги.СуммаКомиссииИнформационно = Итоги.СуммаКомиссииИнформационно + ИтогиДень.СуммаКомиссииИнформационно;
	Итоги.СуммаКомиссииКВыплате = Итоги.СуммаКомиссииКВыплате + ИтогиДень.СуммаКомиссииКВыплате;
	Итоги.СуммаКомиссииОплата = Итоги.СуммаКомиссииОплата + ИтогиДень.СуммаКомиссииОплата;
	
	Итоги.КоличествоСтатус = Итоги.КоличествоСтатус + ИтогиДень.КоличествоСтатус;
	Итоги.КоличествоЗавтраки = Итоги.КоличествоЗавтраки + ИтогиДень.КоличествоЗавтраки;

	Итоги.КоличествоЧеловек = Итоги.КоличествоЧеловек + ИтогиДень.КоличествоЧеловек;
	
	Для Индекс = 0 По Итоги.УслугиИтоги.Количество() - 1 Цикл
		Итоги.УслугиИтоги[Индекс].СуммаУслуги = Итоги.УслугиИтоги[Индекс].СуммаУслуги 
			+ ИтогиДень.УслугиДеньИтоги[Индекс].СуммаУслуги;		
	КонецЦикла;

~ПРОДОЛЖИТЬ_ДатаОтчетаПо:	
	Дата_П = Дата_П + 60*60*24;	
КонецЦикла;	
ПолеОтчета.ЗакончитьАвтогруппировкуСтрок();

Область = Макет.ПолучитьОбласть("Итоги|КолонкиЛево");

Область.Параметры.ИтогиДаты = "Период с " + Формат(ДатаОтчетаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаОтчетаПо, "ДФ=dd.MM.yy");

Область.Параметры.Номер = "Итого Ночей:";
Область.Параметры.КатегорияНомера = Итоги.КоличествоНочей;
Область.Параметры.ЦенаПроживание = Итоги.СуммаЦенаПроживание;
Область.Параметры.СуммаПроживание = Итоги.СуммаПроживание;
Область.Параметры.КоличествоСутокТариф = Итоги.КоличествоСутокТариф;

Область.Параметры.СуммаКомиссииИнформационно = Итоги.СуммаКомиссииИнформационно;
Область.Параметры.СуммаКомиссииКВыплате = Итоги.СуммаКомиссииКВыплате;
Область.Параметры.СуммаКомиссииОплата = Итоги.СуммаКомиссииОплата;

Область.Параметры.СуммаОплаты = Итоги.СуммаОплаты;
Область.Параметры.СуммаЭквайринга = Итоги.СуммаЭквайринга;
Область.Параметры.СуммаНомера = Итоги.СуммаНомера;

Область.Параметры.КоличествоСтатус = Итоги.КоличествоСтатус;
Область.Параметры.КоличествоЗавтраки = Итоги.КоличествоЗавтраки;

Область.Параметры.КоличествоЧеловек = Итоги.КоличествоЧеловек;

ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из Итоги.УслугиИтоги Цикл
	Область = Макет.ПолучитьОбласть("Итоги|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		Область.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(Область, 0);
КонецЦикла;

ТабДок.Вывести(ПолеОтчета);


////////////////////////////////////////////////////////////////

//// + Нераспределенные оплаты
//НеПоказыватьЗакрытыеНераспределенныеОплаты = Истина;

ПолеОтчета = Новый ТабличныйДокумент;
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Заявка,
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	NULL КАК СчетГУИД,
                      |	NULL КАК Услуга,
                      |	NULL КАК ДолгиГУИД,
                      |	ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) КАК СуммаОплаты,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ЛОЖЬ КАК ЭтоЭквайринг,
                      |	""КД"" КАК ТипДокументаОплаты,
                      |	КассовыйДокумент.Номер КАК НомерДокументаОплаты,
                      |	КассовыйДокумент.Дата КАК ДатаДокументаОплаты,
                      |	Возвраты.Сумма КАК СуммаВозвратаДокументаОплаты,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	КассовыйДокумент.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА КассовыйДокумент.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ КассовыйДокумент.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ЕСТЬNULL(КассоваяСмена.НачалоКассовойСмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыККМ
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ДолгиОплата_КД
                      |		ПО КассовыйДокумент.Ссылка = ДолгиОплата_КД.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |			КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
                      |			МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
                      |				ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
                      |					И (ВЫБОР
                      |						КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
                      |							ТОГДА ИСТИНА
                      |						ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
                      |					КОНЕЦ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.Ссылка,
                      |			КассоваяСмена.НомерСменыККТ) КАК КассоваяСмена
                      |		ПО КассовыйДокумент.Ссылка = КассоваяСмена.ДокументОплаты
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Приход = ИСТИНА
                      |	И КассовыйДокумент.ЭтоПроизвольныйЧек = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА ДолгиОплата_КД.Ссылка ЕСТЬ NULL
                      |				ТОГДА ВЫБОР
                      |						КОГДА &НеПоказыватьЗакрытыеНераспределенныеОплаты
                      |							ТОГДА КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) <> 0
                      |						ИНАЧЕ ИСТИНА
                      |					КОНЕЦ
                      |			ИНАЧЕ КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) <> 0
                      |		КОНЕЦ
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаНачала
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОкончания");		

ДатаНачала = '20230101';

Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ТекущаяДата();
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);		

Запрос.УстановитьПараметр("НеПоказыватьЗакрытыеНераспределенныеОплаты", НеПоказыватьЗакрытыеНераспределенныеОплаты);		

ТЗ = Запрос.Выполнить().Выгрузить();	

ТЗ_НераспределенныеОплаты = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_НераспределенныеОплаты.Колонки.Найти("ДокументОплаты");
ТЗ_НераспределенныеОплаты.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_НераспределенныеОплаты.Колонки.Добавить("ДокументОплаты");

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Заявка,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	NULL КАК СчетГУИД,
                      |	NULL КАК Услуга,
                      |	ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) КАК СуммаОплаты,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументаОплатыКарта,
                      |	0 КАК СуммаДокументаОплатыНаличные,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВыпискаБанка.ЭтоЭквайринг КАК ЭтоЭквайринг,
                      |	""ВБ"" КАК ТипДокументаОплаты,
                      |	ВыпискаБанка.Номер КАК НомерДокументаОплаты,
                      |	ВыпискаБанка.Дата КАК ДатаДокументаОплаты,
                      |	Возвраты.Сумма КАК СуммаВозвратаДокументаОплаты,
                      |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                      |	ВыпискаБанка.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ДолгиОплата_ВБ
                      |		ПО ВыпискаБанка.Ссылка = ДолгиОплата_ВБ.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Приход = ИСТИНА
                      |	И ВЫБОР
                      |			КОГДА ДолгиОплата_ВБ.Ссылка ЕСТЬ NULL
                      |				ТОГДА ВЫБОР
                      |						КОГДА &НеПоказыватьЗакрытыеНераспределенныеОплаты
                      |							ТОГДА ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) <> 0
                      |						ИНАЧЕ ИСТИНА
                      |					КОНЕЦ
                      |			ИНАЧЕ ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) <> 0
                      |		КОНЕЦ
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаНачала
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаОкончания");		

//ДатаНачала = '20230101';

Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ТекущаяДата();
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);			

Запрос.УстановитьПараметр("НеПоказыватьЗакрытыеНераспределенныеОплаты", НеПоказыватьЗакрытыеНераспределенныеОплаты);			

ТЗ = Запрос.Выполнить().Выгрузить();
	
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
	|	NULL КАК Заявка,
	|	БезналЗагрузка.ГУИД КАК ДокументОплаты,
	|	NULL КАК СчетГУИД,
	|	NULL КАК Услуга,
	|	БезналЗагрузка.Сумма КАК СуммаДокументаОплаты,
	|	0 КАК СуммаДокументаОплатыКарта,
	|	0 КАК СуммаДокументаОплатыНаличные,
	|	NULL КАК ТипОплаты,
	|	ИСТИНА КАК ЭтоЭквайринг,
	|	""НО"" КАК ТипДокументаОплаты,
	|	NULL КАК НомерДокументаОплаты,
	|	NULL КАК ДатаДокументаОплаты,
	|	NULL КАК СуммаВозвратаДокументаОплаты,
	|	БезналЗагрузка.ДатаОплаты КАК ДатаОплаты,
	|	БезналЗагрузка.КонтрагентИНН КАК КонтрагентИНН,
	|	БезналЗагрузка.ТекстПлатежа КАК ТекстПлатежа,
	|	БезналЗагрузка.КонтрагентНаименование КАК КонтрагентНаименование,
	|	ЕСТЬNULL(ВыпискаБанка.Сумма, 0) КАК СуммаОплаты,
	|	БезналЗагрузка.Сумма - ЕСТЬNULL(ВыпискаБанка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано КАК ОстатокДокументаОплаты
	|ИЗ
	|	РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВыпискаБанкаОплата.ГУИДЗагрузка КАК ГУИДЗагрузка,
	|			СУММА(ВыпискаБанкаОплата.Сумма) КАК Сумма
	|		ИЗ
	|			Документ.ВыпискаБанка КАК ВыпискаБанкаОплата
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВыпискаБанкаОплата.ГУИДЗагрузка) КАК ВыпискаБанка
	|		ПО БезналЗагрузка.ГУИД = ВыпискаБанка.ГУИДЗагрузка
	|ГДЕ
	|	БезналЗагрузка.Отменено = ЛОЖЬ
	|	И БезналЗагрузка.Сумма - ЕСТЬNULL(ВыпискаБанка.Сумма, 0) - БезналЗагрузка.СуммаАннулировано <> 0
	|	И (БезналЗагрузка.ПолучательПлатежа = """"
	|			ИЛИ БезналЗагрузка.ПолучательПлатежа = &ПолучательПлатежа)
	|	И БезналЗагрузка.ДатаОплаты >= &ДатаНачала
	|	И БезналЗагрузка.ДатаОплаты <= &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОплаты");


Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
ДатаОкончания = ТекущаяДата();
Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);							  

//                      |	ВЫБОР
//                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
//                      |			ТОГДА ВЫБОР
//                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП%""
//                      |						ТОГДА 5
//                      |					ИНАЧЕ 4
//                      |				КОНЕЦ
//                      |		ИНАЧЕ 3
//                      |	КОНЕЦ КАК ТипОплаты,

Запрос.УстановитьПараметр("ПолучательПлатежа", ПолучательПлатежа);		
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	ЗначениеИНН = СписокКонтрагентыИИН_Эквайринг.НайтиПоЗначению(Строка.КонтрагентИНН);
	ЕстьВСписке = (ЗначениеИНН <> Неопределено);
	Если ЕстьВСписке Тогда
		Если СтрНайти(Строка.ТекстПлатежа,"СБП") > 0 Тогда
			НоваяСтрока.ТипОплаты = 5;
		Иначе	
			НоваяСтрока.ТипОплаты = 4;
		КонецЕсли;
	Иначе
		НоваяСтрока.ТипОплаты = 3;
	КонецЕсли;
КонецЦикла;

ТЗ_НераспределенныеОплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_НераспределенныеОплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_НераспределенныеОплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга <= &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	//Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);
	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;
// - Нераспределенные оплаты

ТЗ_НераспределенныеОплаты.Сортировать("ДатаОплаты");

// + Нераспределенные оплаты
Область = Макет.ПолучитьОбласть("ШапкаНераспределенныеОплатыДополнение|КолонкиЛево");
ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаНераспределенныеОплаты Из ТЗ_НераспределенныеОплаты Цикл
	Область = Макет.ПолучитьОбласть("СтрокаНераспределенныеОплатыДополнение|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаНераспределенныеОплаты.ТипОплаты);
	//Область.Параметры.ДатаОплаты = Формат(СтрокаНераспределенныеОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	Область.Параметры.ДатаОплаты = Формат(СтрокаНераспределенныеОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	Если ЗначениеЗаполнено(СтрокаНераспределенныеОплаты.ДатаСменыККМ) Тогда
		Область.Параметры.ДатаОткрытияСмены = Формат(СтрокаНераспределенныеОплаты.ДатаСменыККМ, "ДФ=dd.MM.yy");
	КонецЕсли;	
	
	Область.Параметры.СуммаОплаты = СтрокаНераспределенныеОплаты.СуммаОплаты;
	
	Область.Параметры.ТипДокументаОплаты = СтрокаНераспределенныеОплаты.ТипДокументаОплаты;
	Область.Параметры.НомерДокументаОплаты = СтрокаНераспределенныеОплаты.НомерДокументаОплаты;
	Область.Параметры.ДатаДокументаОплаты =СтрокаНераспределенныеОплаты.ДатаДокументаОплаты;
	Область.Параметры.СуммаДокументаОплаты = СтрокаНераспределенныеОплаты.СуммаДокументаОплаты;
	Область.Параметры.СуммаВозвратаДокументаОплаты = СтрокаНераспределенныеОплаты.СуммаВозвратаДокументаОплаты;
	
	Если ТипЗнч(СтрокаНераспределенныеОплаты.ДокументОплаты) = Тип("УникальныйИдентификатор") Тогда
		Область.Параметры.РасшифровкаДокументОплаты = "Нераспределенная выгрузка";
	Иначе	
		Область.Параметры.РасшифровкаДокументОплаты = СтрокаНераспределенныеОплаты.ДокументОплаты;
	КонецЕсли;
	
	//Область.Параметры.Оплатил = СтрокаНераспределенныеОплаты.ДокументОплаты.ОтКого;
	//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаНераспределенныеОплаты);
	Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаНераспределенныеОплаты);
	
	Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаНераспределенныеОплаты);
	
	ПолеОтчета.Вывести(Область, 0);
	
	Если ТипЗнч(СтрокаНераспределенныеОплаты.ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
		Запрос_Возврат = Новый Запрос( "ВЫБРАТЬ
		                       |	ВыпискаБанка.Ссылка КАК Ссылка,
		                       |	ВыпискаБанка.Сумма КАК Сумма
		                       |ИЗ
		                       |	Документ.ВыпискаБанка КАК ВыпискаБанка
		                       |ГДЕ
		                       |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
		                       |	И ВыпискаБанка.ВозвратДокумент = &ВозвратДокумент");
		
		ТипДокументаВозврат = "ВБ";
		
	ИначеЕсли ТипЗнч(СтрокаНераспределенныеОплаты.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		Запрос_Возврат = Новый Запрос( "ВЫБРАТЬ
		                       |	КассовыйДокумент.Ссылка КАК Ссылка,
		                       |	КассовыйДокумент.Сумма КАК Сумма
		                       |ИЗ
		                       |	Документ.КассовыйДокумент КАК КассовыйДокумент
		                       |ГДЕ
		                       |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
		                       |	И КассовыйДокумент.ВозвратДокумент = &ВозвратДокумент");
		
		ТипДокументаВозврат = "КД";
	Иначе
		Запрос_Возврат = Неопределено;
		
		ТипДокументаВозврат = "";
	КонецЕсли;
	
	Если Запрос_Возврат = Неопределено Тогда
		ТЗ_Возвраты = Новый ТаблицаЗначений;
	Иначе	
		Запрос_Возврат.УстановитьПараметр("ВозвратДокумент", СтрокаНераспределенныеОплаты.ДокументОплаты);
		ТЗ_Возвраты = Запрос_Возврат.Выполнить().Выгрузить();
	КонецЕсли;
	
	Для Каждого СтрокаВозврат Из ТЗ_Возвраты Цикл 
		Область_Возврат = Макет.ПолучитьОбласть("СтрокаВозвратНераспределенныеОплатыДополнение|КолонкиЛево");
		
		Область_Возврат.Параметры.ТипДокументаОплаты = ТипДокументаВозврат;
		Область_Возврат.Параметры.НомерДокументаОплаты = СтрокаВозврат.Ссылка.Номер;
		Область_Возврат.Параметры.ДатаДокументаОплаты = СтрокаВозврат.Ссылка.Дата;
		Область_Возврат.Параметры.СуммаДокументаОплаты = СтрокаВозврат.Сумма;
		
		ПолеОтчета.Вывести(Область_Возврат, 0);
		ПолеОтчета.Вывести(Область_Возврат, 0);
	КонецЦикла;
КонецЦикла;

Область = Макет.ПолучитьОбласть("ПодножиеНераспределенныеОплатыДополнение|КолонкиЛево");
ПолеОтчета.Вывести(Область, 0);
// - Нераспределенные оплаты
	
	ТабДок.Вывести(ПолеОтчета);

////

Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
КолонкаКоличествоСчетов = Область.ШиринаТаблицы;
ТабДок.Область(, КолонкаКоличествоСчетов, ,КолонкаКоличествоСчетов).Видимость = Ложь; 

Если ЭтоОтчет Тогда
	//Колонка_1 = Область.ШиринаТаблицы - 3;
	//Колонка_2 = Область.ШиринаТаблицы - 1;
	//ТабДок.Область(, Колонка_1, ,Колонка_2).Видимость = Ложь;   
Иначе	
	КолонкаЗавтракиЗаявка = Область.ШиринаТаблицы - 4;
	ТабДок.Область(, КолонкаЗавтракиЗаявка, ,КолонкаЗавтракиЗаявка).Видимость = Ложь;   
	
	КолонкаАвторскоеВознаграждениеОплата = Область.ШиринаТаблицы - 9;
	КолонкаАвторскоеВознаграждениеФормаОплаты = Область.ШиринаТаблицы - 7;
	ТабДок.Область(, КолонкаАвторскоеВознаграждениеОплата, ,КолонкаАвторскоеВознаграждениеФормаОплаты).Видимость = Ложь;   
	
	КолонкаОплатил = Область.ШиринаТаблицы - 12;
	ТабДок.Область(, КолонкаОплатил, ,КолонкаОплатил).Видимость = Ложь;   
КонецЕсли;

//
ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

//ОбластьШапка = ТабДок.Область("R1"); 
ОбластьШапка = ТабДок.Область(0,,0); 
ТабДок.ПовторятьПриПечатиСтроки = ОбластьШапка;

ТабДок.ФиксацияСверху = 1;
Возврат ТабДок;
КонецФункции

Функция СформироватьОтчетОплатыНаСервере(Макет, ДатаОплатыОтбор, ФормаОплатыОтбор, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();
ПолеОтчета = Новый ТабличныйДокумент;      

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Папка,
                      |	ДопУслуги.НомерПП КАК НомерПП,
                      |	ДопУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.ДопУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;
Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Папка) Тогда		
		//Область.Параметры.ШапкаДопУслуги = Строка.Папка;
		Если ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			ЗаголовокОтчета = Строка.ЗаголовокОтчеты;
		Иначе
			ЗаголовокОтчета = Строка.Папка;
		КонецЕсли;
		
		Область.Параметры.ШапкаДопУслуги = ЗаголовокОтчета;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область, 0);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

//Область = Макет.ПолучитьОбласть("Шапка|КолонкиПраво");
//ПолеОтчета.Присоединить(Область);

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

//Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");
//КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 2;  // - 2 расшифровки

//Область = Макет.ПолучитьОбласть("Строка|КолонкиПраво");
//КоличествоКолонок = КоличествоКолонок + Область.Параметры.Количество() - 1 ; // - 1 расшифровки

//КоличествоКолонок = КоличествоКолонок - 2;

ПолеОтчета.ФиксацияСверху = 1;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

//Для ш = 1 По 100 Цикл
//	Область = Макет.ПолучитьОбласть("Строка");	
//	Область.Параметры.Дата = ш;
//	
//	ПолеОтчета.Вывести(Область);
//КонецЦикла;

//
Итоги = Новый Структура();
Итоги.Вставить("КоличествоНочей", 0);
Итоги.Вставить("КоличествоСутокТариф", 0);
Итоги.Вставить("СуммаЦенаПроживание", 0);
Итоги.Вставить("СуммаПроживание", 0);
Итоги.Вставить("СуммаНомера", 0);
Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаЭквайринга", 0);
Итоги.Вставить("СуммаКомиссии", 0);
Итоги.Вставить("ПолнаяСуммаКомиссии", 0);

Итоги.Вставить("КоличествоСтатус", 0);
Итоги.Вставить("КоличествоЗавтраки", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);
//

//
ИтогиДень = Новый Структура();
ИтогиДень.Вставить("КоличествоНочей", 0);
ИтогиДень.Вставить("КоличествоСутокТариф", 0);
ИтогиДень.Вставить("СуммаЦенаПроживание", 0);
ИтогиДень.Вставить("СуммаПроживание", 0);
ИтогиДень.Вставить("СуммаНомера", 0);
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);
ИтогиДень.Вставить("СуммаКомиссии", 0);
ИтогиДень.Вставить("ПолнаяСуммаКомиссии", 0);

ИтогиДень.Вставить("КоличествоСтатус", 0);
ИтогиДень.Вставить("КоличествоЗавтраки", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);
//

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого КАК ДокументОплатыОтКого,
                      |	ВЫБОР
                      |		КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга КАК Услуга,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыНаличные,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта
                      |		ИНАЧЕ 0
                      |	КОНЕЦ КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
                      |			ТОГДА ВЫБОР
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Взаимозачет)
                      |						ТОГДА 9
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
                      |						ТОГДА 10
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг)
                      |						ТОГДА 11
                      |					КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
                      |						ТОГДА 12
                      |					ИНАЧЕ 10
                      |				КОНЕЦ
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |					ТОГДА ВЫБОР
                      |							КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |								ТОГДА 8
                      |							КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ЭтоЭквайринг
                      |								ТОГДА ВЫБОР
                      |										КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ТекстПлатежа ПОДОБНО ""%СБП%""
                      |											ТОГДА 5
                      |										ИНАЧЕ 4
                      |									КОНЕЦ
                      |							ИНАЧЕ 3
                      |						КОНЕЦ
                      |				ИНАЧЕ ВЫБОР
                      |						КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.оverbooking)
                      |							ТОГДА 8
                      |						КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные = 0
                      |								И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта > 0
                      |							ТОГДА 1
                      |						ИНАЧЕ ВЫБОР
                      |								КОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаНаличные > 0
                      |										И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.СуммаКарта = 0
                      |									ТОГДА 2
                      |								ИНАЧЕ 0
                      |							КОНЕЦ
                      |					КОНЕЦ
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВЫБОР
                      |		КОГДА ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
                      |			ТОГДА ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ЭтоЭквайринг
                      |		ИНАЧЕ ЛОЖЬ
                      |	КОНЕЦ КАК ЭтоЭквайринг,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.Сумма КАК СуммаДокументаОплаты,
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
                      |	ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК ДопУслугиУслуга,
                      |	ЕСТЬNULL(КассоваяСмена.НачалоКассовойСмены, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыККМ
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
                      |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
                      |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |			КассоваяСмена.НомерСменыККТ КАК НомерСменыККТ,
                      |			МАКСИМУМ(КассоваяСмена.НачалоКассовойСмены) КАК НачалоКассовойСмены
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
                      |				ПО КассовыйДокумент.НомерСменыККМ = КассоваяСмена.НомерСменыККТ
                      |					И (ВЫБОР
                      |						КОГДА КассоваяСмена.НачалоКассовойСмены ЕСТЬ NULL
                      |							ТОГДА ИСТИНА
                      |						ИНАЧЕ НАЧАЛОПЕРИОДА(КассоваяСмена.НачалоКассовойСмены, ГОД) = НАЧАЛОПЕРИОДА(КассовыйДокумент.ДатаОплаты, ГОД)
                      |					КОНЕЦ)
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.Ссылка,
                      |			КассоваяСмена.НомерСменыККТ) КАК КассоваяСмена
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = КассоваяСмена.ДокументОплаты
                      |ГДЕ
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты = &ДатаОплаты
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |	ДатаУслуги,
                      |	ДокументОплатыДатаОплаты,
                      |	ДокументОплаты");

Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплатыОтбор);
ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();	
Для Каждого Строка Из ТЗ_Оплаты Цикл
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ДокументОплатыОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_Оплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
	Строка.ПроцентЭквайрингаСБП = ПроцентЭквайрингаСБП;
КонецЦикла;

Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	Если ФормаОплатыОтбор <> "" Тогда
		Если ФормаОплатыОтбор <> ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты) 
		Тогда Продолжить; КонецЕсли;
	КонецЕсли;	
	
	Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
	
	//Область.Параметры.Дата = ".";
	
	НомерПредставление = "" + СтрокаОплаты.Заявка.НомерВРезерв + " / "
		 + ОбщийФункционалКлиентСервер.УбратьНезначащиеНули(СтрокаОплаты.Заявка.Номер) + " от " + Формат(СтрокаОплаты.Заявка.Дата, "ДФ=dd.MM.yy");
	Область.Параметры.Номер = НомерПредставление;
	Область.Параметры.РасшифровкаНомер = СтрокаОплаты.Заявка;
	
	Область.Параметры.ЗаявкаНомер = СтрокаОплаты.Заявка.Номер;
	Область.Параметры.ЗаявкаДата = СтрокаОплаты.Заявка.Дата;
	Область.Параметры.РасшифровкаЗаявка = СтрокаОплаты.Заявка;
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	Если ЗначениеЗаполнено(СтрокаОплаты.ДатаСменыККМ) Тогда
		Область.Параметры.ДатаОткрытияСмены = Формат(СтрокаОплаты.ДатаСменыККМ, "ДФ=dd.MM.yy");
	КонецЕсли;
	
	Область.Параметры.РасшифровкаДокументОплаты = СтрокаОплаты.ДокументОплаты;
	
	//Область.Параметры.Оплатил = СтрокаОплаты.ДокументОплаты.ОтКого;
	//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаОплаты);
	Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаОплаты);
	
	СуммаОплаты = СтрокаОплаты.СуммаОплаты;
	Область.Параметры.СуммаОплаты = СуммаОплаты;
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
	Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;
	
	Если СтрокаОплаты.Услуга Тогда
		Область.Параметры.Дата = Формат(СтрокаОплаты.ДатаУслуги, "ДФ=dd.MM.yy");
		ПолеОтчета.Вывести(Область, 0);
					
		Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
			
			Результат = Справочники.ДопУслуги.ПустаяСсылка();
			Ссылка = СтрокаОплаты.ДопУслугиУслуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
			
			ЕстьСтрока = Ложь;
			Если Результат = СтрокаРодительУслуги.Папка Тогда
				ЕстьСтрока = Истина;
			КонецЕсли;
			
			ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
			Если ЕстьСтрока Тогда
				ОбластьУслуги.Параметры.СуммаУслуги = СтрокаОплаты.СуммаОплаты;
			КонецЕсли;
			
			ПолеОтчета.Присоединить(ОбластьУслуги, 0);
		КонецЦикла;
	
	Иначе
		Область.Параметры.Дата = Формат(СтрокаОплаты.ДеньПроживания, "ДФ=dd.MM.yy");
		Область.Параметры.СуммаПроживание = СтрокаОплаты.СуммаОплаты;
		
		ПолеОтчета.Вывести(Область, 0);
	КонецЕсли;
	
	
////
	//ИтогиДень.КоличествоНочей = ИтогиДень.КоличествоНочей + 1;
	//ИтогиДень.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф + КоличествоСутокТариф;
	//
	//ИтогиДень.СуммаЦенаПроживание = ИтогиДень.СуммаЦенаПроживание + ЦенаПроживание;
	
	//ИтогиДень.СуммаНомера = ИтогиДень.СуммаНомера + СуммаНомера;
	
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
	
	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  
	
	//ИтогиДень.СуммаКомиссии = ИтогиДень.СуммаКомиссии + СуммаКомиссии;
	//ИтогиДень.ПолнаяСуммаКомиссии = ИтогиДень.ПолнаяСуммаКомиссии + ПолнаяСуммаКомиссии;
	
	//Если НЕ (СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
	//ИЛИ СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
	//Тогда 
	//	ИтогиДень.КоличествоСтатус = ИтогиДень.КоличествоСтатус + 1;
	//КонецЕсли;
	//
	//Если НЕ (СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтменаБронирования 
	//ИЛИ СтрокаЗаявка.Статус = Перечисления.СтатусБрони.ОтказОтБронирования) 
	//Тогда 
	//	ИтогиДень.КоличествоЗавтраки = КоличествоЗавтраки;
	//КонецЕсли;
		
	Если СтрокаОплаты.Услуга Тогда
		Результат = Справочники.ДопУслуги.ПустаяСсылка();
		Ссылка = СтрокаОплаты.ДопУслугиУслуга; 
		ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
		
		ОтборСтроки = Новый Структура("УслугаРодитель", Результат); 
		НайденныеСтроки = ИтогиДень.УслугиДеньИтоги.НайтиСтроки(ОтборСтроки);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.СуммаУслуги = НайденнаяСтрока.СуммаУслуги + СтрокаОплаты.СуммаОплаты;
		КонецЦикла;
	Иначе	
		ИтогиДень.СуммаПроживание = ИтогиДень.СуммаПроживание + СтрокаОплаты.СуммаОплаты;
	КонецЕсли;		
	
КонецЦикла;

// + Нераспределенные оплаты
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Заявка,
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассовыйДокумент.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА КассовыйДокумент.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ КассовыйДокумент.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	NULL КАК СчетГУИД,
                      |	NULL КАК Услуга,
                      |	NULL КАК ДолгиГУИД,
                      |	КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) КАК СуммаОплаты,
                      |	КассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаДокументаОплатыНаличные,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаДокументаОплатыКарта,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ 0
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ЛОЖЬ КАК ЭтоЭквайринг
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокументДолгиОплата.Ссылка) КАК ДолгиОплата_КД
                      |		ПО КассовыйДокумент.Ссылка = ДолгиОплата_КД.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_КД.Сумма, 0) <> 0
                      |	И КассовыйДокумент.Приход = ИСТИНА
                      |	И НЕ КассовыйДокумент.ЭтоПроизвольныйЧек
                      |	И КассовыйДокумент.ДатаОплаты = &ДатаОплаты");		

Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплатыОтбор);		
ТЗ = Запрос.Выполнить().Выгрузить();	

ТЗ_НераспределенныеОплаты = ТЗ.СкопироватьКолонки();
Колонка_ДокументОплаты = ТЗ_НераспределенныеОплаты.Колонки.Найти("ДокументОплаты");
ТЗ_НераспределенныеОплаты.Колонки.Удалить(Колонка_ДокументОплаты);
ТЗ_НераспределенныеОплаты.Колонки.Добавить("ДокументОплаты");

Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	NULL КАК Заявка,
                      |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
                      |	ВыпискаБанка.ОтКого КАК ОтКого,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ОтКого.ТипКлиента = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентов.ЮрЛицо)
                      |			ТОГДА ВыпискаБанка.ОтКого.НаименованиеЮрЛица
                      |		ИНАЧЕ ВыпискаБанка.ОтКого.Наименование
                      |	КОНЕЦ КАК КонтрагентНаименование,
                      |	NULL КАК СчетГУИД,
                      |	NULL КАК Услуга,
                      |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) КАК СуммаОплаты,
                      |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                      |	0 КАК СуммаДокументОплатыКарта,
                      |	0 КАК СуммаДокументОплатыНаличные,
                      |	ВЫБОР
                      |		КОГДА ВыпискаБанка.ЭтоЭквайринг
                      |			ТОГДА ВЫБОР
                      |					КОГДА ВыпискаБанка.ТекстПлатежа ПОДОБНО ""%СБП""
                      |						ТОГДА 5
                      |					ИНАЧЕ 4
                      |				КОНЕЦ
                      |		ИНАЧЕ 3
                      |	КОНЕЦ КАК ТипОплаты,
                      |	ВыпискаБанка.ЭтоЭквайринг КАК ЭтоЭквайринг
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                      |			СУММА(ВыпискаБанкаДолгиОплата.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанкаДолгиОплата.Ссылка) КАК ДолгиОплата_ВБ
                      |		ПО ВыпискаБанка.Ссылка = ДолгиОплата_ВБ.Ссылка
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		ГДЕ
                      |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
                      |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ДолгиОплата_ВБ.Сумма, 0) <> 0
                      |	И ВыпискаБанка.Приход = ИСТИНА
                      |	И ВыпискаБанка.ДатаОплаты = &ДатаОплаты");

Запрос.УстановитьПараметр("ДатаОплаты", ДатаОплатыОтбор);		
ТЗ = Запрос.Выполнить().Выгрузить();
	
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТЗ_НераспределенныеОплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	Если НЕ ЗначениеЗаполнено(Строка.КонтрагентНаименование) Тогда
		Строка.КонтрагентНаименование = Строка.ОтКого.Наименование;	
	КонецЕсли;
КонецЦикла;

ТЗ_НераспределенныеОплаты.Колонки.Добавить("ПроцентЭквайринга");
ТЗ_НераспределенныеОплаты.Колонки.Добавить("ПроцентЭквайрингаСБП");
Для Каждого Строка Из ТЗ_НераспределенныеОплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга,
	                      |	ПроцентыЭквайринга.ПроцентЭквайрингаСБП КАК ПроцентЭквайрингаСБП
	                      |ИЗ
	                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                      |ГДЕ
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	ПроцентЭквайрингаСБП = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайрингаСБП); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
КонецЦикла;

Для Каждого СтрокаНераспределенныеОплаты Из ТЗ_НераспределенныеОплаты Цикл
	Если ФормаОплатыОтбор <> "" Тогда
		Если ФормаОплатыОтбор <> ОтчетыСервер.ТипОплатыНаименование(СтрокаНераспределенныеОплаты.ТипОплаты) 
		Тогда Продолжить; КонецЕсли;
	КонецЕсли;	
	
	Область = Макет.ПолучитьОбласть("СтрокаНераспределенныеОплаты|КолонкиЛево");
	
	Область.Параметры.Дата = ".";
	
	Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаНераспределенныеОплаты.ТипОплаты);
	Область.Параметры.ДатаОплаты = Формат(СтрокаНераспределенныеОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	СуммаОплаты = СтрокаНераспределенныеОплаты.СуммаОплаты;
	Область.Параметры.СуммаОплаты = СуммаОплаты;
	Область.Параметры.РасшифровкаДокументОплаты = СтрокаНераспределенныеОплаты.ДокументОплаты;
	
	//Область.Параметры.Оплатил = СтрокаНераспределенныеОплаты.ДокументОплаты.ОтКого;
	//Область.Параметры.Оплатил = ОплатилНаименование(СтрокаНераспределенныеОплаты);
	Область.Параметры.Оплатил = ОтчетыСервер.ОплатилНаименование(СтрокаНераспределенныеОплаты);
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаНераспределенныеОплаты);
	Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;
	
	ПолеОтчета.Вывести(Область, 0);
	
	ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
	
	ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;  

КонецЦикла;

	// - Нераспределенные оплаты

Область = Макет.ПолучитьОбласть("ИтогиДень|КолонкиЛево");

//Дата = Формат(ДатаОплатыОтбор, "ДФ='д.МММ гг'" );  
//Область.Параметры.Дата = Дата;		
Область.Параметры.Дата = ".";		


//Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
//Область.Параметры.Месяц = Месяц;		

//ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
//Область.Параметры.ДеньНедели = ДеньНедели;

//Область.Параметры.Номер = "Итого Ночей:";
//Область.Параметры.КатегорияНомера = ИтогиДень.КоличествоНочей;
//Область.Параметры.ЦенаПроживание = ИтогиДень.СуммаЦенаПроживание;
Область.Параметры.СуммаПроживание = ИтогиДень.СуммаПроживание;
//Область.Параметры.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф;
//Область.Параметры.СуммаКомиссии = ИтогиДень.СуммаКомиссии;
//Область.Параметры.ПолнаяСуммаКомиссии = ИтогиДень.ПолнаяСуммаКомиссии;
Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
//Область.Параметры.СуммаНомера = ИтогиДень.СуммаНомера;

//Область.Параметры.КоличествоСтатус = ИтогиДень.КоличествоСтатус;
//Область.Параметры.КоличествоЗавтраки = ИтогиДень.КоличествоЗавтраки;
ПолеОтчета.Вывести(Область, 0);

Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
	ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
	Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
		ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
	КонецЕсли;	
	ПолеОтчета.Присоединить(ОбластьУслуги, 0);
КонецЦикла;

Возврат ПолеОтчета;
КонецФункции

Функция СформироватьОтчетРаспределениеОплатНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо, ЭтоОтчет) Экспорт
//ПолеОтчета.Очистить();
ПолеОтчета = Новый ТабличныйДокумент;      

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Папка,
                      |	ДопУслуги.НомерПП КАК НомерПП
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.ДопУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы; 

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

ПолеОтчета.ФиксацияСверху = 2;
ПолеОтчета.НачатьАвтогруппировкуСтрок();

//

ИтогиДень = Новый Структура();
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаНаличные", 0);
ИтогиДень.Вставить("СуммаКарта", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);

ИтогиДень.Вставить("СуммаОплатыЗатраты", 0);
ИтогиДень.Вставить("СуммаОплатыНераспределено", 0);

//
ОбластьВидОплаты = Макет.ПолучитьОбласть("ЗаголовокВидОплаты|КолонкиЛево"); 
ОбластьВидОплаты.Параметры.ВидОплаты = "Касса";
ПолеОтчета.Вывести(ОбластьВидОплаты, 0);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
                      |	КассовыйДокумент.Приход КАК Приход,
                      |	КассовыйДокумент.СуммаКарта КАК СуммаКарта,
                      |	КассовыйДокумент.СуммаНаличные КАК СуммаНаличные,
                      |	КассовыйДокумент.НомерСменыККМ КАК НомерСменыККМ,
                      |	КассовыйДокумент.НомерЧекаККМ КАК НомерЧекаККМ,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.Приход
                      |			ТОГДА КассовыйДокумент.Сумма
                      |		ИНАЧЕ -КассовыйДокумент.Сумма
                      |	КОНЕЦ КАК СуммаОплаты,
                      |	ЕСТЬNULL(Возвраты.Сумма, 0) КАК СуммаВозврат,
                      |	КассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
                      |	ВЫБОР
                      |		КОГДА КассовыйДокумент.СуммаНаличные = 0
                      |				И КассовыйДокумент.СуммаКарта > 0
                      |			ТОГДА 1
                      |		ИНАЧЕ ВЫБОР
                      |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                      |						И КассовыйДокумент.СуммаКарта = 0
                      |					ТОГДА 2
                      |				ИНАЧЕ -1
                      |			КОНЕЦ
                      |	КОНЕЦ КАК ТипОплаты
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |			И КассовыйДокумент.Приход = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаОплатыC
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаОплатыПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаОплаты,
                      |	НомерСменыККМ");

Запрос.УстановитьПараметр("ДатаОплатыC", ДатаОтчетаС );
Запрос.УстановитьПараметр("ДатаОплатыПо", ДатаОтчетаПо );
ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();	

ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайринга");
Для Каждого Строка Из ТЗ_Оплаты Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга
	                  |ИЗ
	                  |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	                  |ГДЕ
	                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

	ТЗ = Запрос.Выполнить().Выгрузить();
	ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
	
	Строка.ПроцентЭквайринга = ПроцентЭквайринга;
КонецЦикла;
	
Дата_П = '00010101';
Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
	Если НЕ СтрокаОплаты.ДатаОплаты = Дата_П Тогда
		Если Дата_П <> '00010101' Тогда
			ИтогиДеньОплатыВывод(ПолеОтчета, Макет, ИтогиДень, Дата_П);						
		КонецЕсли;		
			
		ОбластьДатаОплаты = Макет.ПолучитьОбласть("ЗаголовокДата|КолонкиЛево"); 
		ОбластьДатаОплаты.Параметры.Дата = Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
		ПолеОтчета.Вывести(ОбластьДатаОплаты, 1);
		
		Дата_П = СтрокаОплаты.ДатаОплаты;
		
		ИтогиДень.СуммаОплаты = 0;
		ИтогиДень.СуммаНаличные = 0;
		ИтогиДень.СуммаКарта = 0;
		ИтогиДень.СуммаЭквайринга = 0;

		ИтогиДень.СуммаОплатыЗатраты = 0;
		ИтогиДень.СуммаОплатыНераспределено = 0;
	КонецЕсли;
	
	ОбластьСтрокаОплаты = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево"); 
	ОбластьСтрокаОплаты.Параметры.Дата = Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	
	ДокументОплатыПредставление = "Кассовый документ " + СтрокаОплаты.ДокументОплаты.Номер + " от " + Формат(СтрокаОплаты.ДокументОплаты.Дата, "ДФ=dd.MM.yy");
	ОбластьСтрокаОплаты.Параметры.ДокументОплаты = ДокументОплатыПредставление;
	ОбластьСтрокаОплаты.Параметры.ДокументОплатыРасшифровка = СтрокаОплаты.ДокументОплаты;
	
	ОбластьСтрокаОплаты.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);

	ОбластьСтрокаОплаты.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
	ОбластьСтрокаОплаты.Параметры.НомерСменыККМ = СтрокаОплаты.НомерСменыККМ;
	
	ОбластьСтрокаОплаты.Параметры.СуммаОплаты = СтрокаОплаты.СуммаОплаты;
	ОбластьСтрокаОплаты.Параметры.СуммаКарта = СтрокаОплаты.СуммаКарта;
	ОбластьСтрокаОплаты.Параметры.СуммаНаличные = СтрокаОплаты.СуммаНаличные;
	ОбластьСтрокаОплаты.Параметры.СуммаВозврат = СтрокаОплаты.СуммаВозврат;
	
	СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);
	ОбластьСтрокаОплаты.Параметры.СуммаЭквайринга = СуммаЭквайринга;
	
	ВыведеннаяОласть = ПолеОтчета.Вывести(ОбластьСтрокаОплаты, 2);
	
	ИтогиДеньДобавить(ИтогиДень, СтрокаОплаты.СуммаОплаты, СтрокаОплаты.СуммаНаличные, СтрокаОплаты.СуммаКарта, СуммаЭквайринга
		, 0, 0);
	
//
	ЗапросПроживание = Новый Запрос("ВЫБРАТЬ
	                                |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Заявка,
	                                |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
	                                |	ЗаявкаНаБронированиеПроживание.ДеньПроживания КАК ДеньПроживания,
	                                |	ЗаявкаНаБронированиеПроживание.Цена КАК Цена,
	                                |	ЗаявкаНаБронированиеПроживание.Количество КАК Количество,
	                                |	ЗаявкаНаБронированиеПроживание.Сумма КАК Сумма,
	                                |	ЗаявкаНаБронированиеПроживание.СуммаБезСкидки КАК СуммаБезСкидки,
	                                |	ЗаявкаНаБронированиеПроживание.ПроцентСкидкиКлиента КАК ПроцентСкидкиКлиента
	                                |ИЗ
	                                |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                                |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
	                                |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеПроживание.ГУИД
	                                |ГДЕ
	                                |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
	                                |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = &ДокументОплаты
	                                |
	                                |УПОРЯДОЧИТЬ ПО
	                                |	Заявка,
	                                |	ДеньПроживания");

	ЗапросПроживание.УстановитьПараметр("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
	ТЗ_Проживание = ЗапросПроживание.Выполнить().Выгрузить();
	
	СуммаИтогоДокументОплатыЗатрат = 0;
	Для Каждого СтрокаПроживание Из ТЗ_Проживание Цикл
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ЗаявкаПредставление = " " + СтрокаПроживание.Заявка.НомерВРезерв + " / ";
		ЗаявкаПредставление = ЗаявкаПредставление + 
			"Заявка " + СтрокаПроживание.Заявка.Номер + " от " + Формат(СтрокаПроживание.Заявка.Дата, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатраты = ЗаявкаПредставление;
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатратыРасшифровка = СтрокаПроживание.Заявка;
		
		ОбластьСтрокаЗатраты.Параметры.ДатаЗатрат = Формат(СтрокаПроживание.ДеньПроживания, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = "Проживание";
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СтрокаПроживание.СуммаОплаты;
		
		ОбластьСтрокаЗатраты.Параметры.СуммаЗатрат = СтрокаПроживание.Сумма;
	
		ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
	КонецЦикла;
	
	СуммаИтогоДокументОплатыЗатрат = СуммаИтогоДокументОплатыЗатрат + ТЗ_Проживание.Итог("СуммаОплаты");
//

//
	ЗапросУслуги = Новый Запрос("ВЫБРАТЬ
	                            |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Заявка,
	                            |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты,
	                            |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
	                            |	ЗаявкаНаБронированиеДопУслуги.Цена КАК Цена,
	                            |	ЗаявкаНаБронированиеДопУслуги.Количество КАК Количество,
	                            |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
	                            |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК Сумма
	                            |ИЗ
	                            |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
	                            |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
	                            |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
	                            |ГДЕ
	                            |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
	                            |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = &ДокументОплаты
	                            |	И ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	Заявка");

	ЗапросУслуги.УстановитьПараметр("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
	ТЗ_Услуги = ЗапросУслуги.Выполнить().Выгрузить();
	
	Для Каждого СтрокаУслуги Из ТЗ_Услуги Цикл
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ЗаявкаПредставление = " " + СтрокаУслуги.Заявка.НомерВРезерв + " / ";
		ЗаявкаПредставление = ЗаявкаПредставление + 
			"Заявка " + СтрокаУслуги.Заявка.Номер + " от " + Формат(СтрокаУслуги.Заявка.Дата, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатраты = ЗаявкаПредставление;
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатратыРасшифровка = СтрокаУслуги.Заявка;
		
		ОбластьСтрокаЗатраты.Параметры.ДатаЗатрат = Формат(СтрокаУслуги.ДатаУслуги, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = СтрокаУслуги.Услуга;
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СтрокаУслуги.СуммаОплаты;
		
		ОбластьСтрокаЗатраты.Параметры.СуммаЗатрат = СтрокаУслуги.Сумма;
	
		ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
	КонецЦикла;

	СуммаИтогоДокументОплатыЗатрат = СуммаИтогоДокументОплатыЗатрат + ТЗ_Услуги.Итог("СуммаОплаты");
//
	
//
	ЗапросКоворкинг = Новый Запрос("ВЫБРАТЬ
	                               |	КоворкингСчетаДокументыОплаты.Ссылка КАК Ссылка,
	                               |	КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
	                               |	КоворкингСчетаДокументыОплаты.СуммаРаспределено КАК СуммаРаспределено,
	                               |	КоворкингСчетаДокументыОплаты.Ссылка.Сумма КАК СуммаЗатрат
	                               |ИЗ
	                               |	Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
	                               |ГДЕ
	                               |	КоворкингСчетаДокументыОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
	                               |	И КоворкингСчетаДокументыОплаты.ДокументОплаты = &ДокументОплаты");

	ЗапросКоворкинг.УстановитьПараметр("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
	ТЗ_Коворкинг = ЗапросКоворкинг.Выполнить().Выгрузить();
	
	Для Каждого СтрокаКоворкинг Из ТЗ_Коворкинг Цикл
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ДокументЗатратыПредставление = "Коворкинг " + СтрокаКоворкинг.Ссылка.Номер + " от " + Формат(СтрокаКоворкинг.Ссылка.Дата, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатраты = ДокументЗатратыПредставление;
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатратыРасшифровка = СтрокаКоворкинг.Ссылка;
		
		//ОбластьСтрокаЗатраты.Параметры.ДатаЗатрат = Формат(СтрокаУслуги.ДатаУслуги, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = "Коворкинг";
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СтрокаКоворкинг.СуммаРаспределено;
		
		ОбластьСтрокаЗатраты.Параметры.СуммаЗатрат = СтрокаКоворкинг.СуммаЗатрат;
	
		ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
	КонецЦикла;

	СуммаИтогоДокументОплатыЗатрат = СуммаИтогоДокументОплатыЗатрат + ТЗ_Коворкинг.Итог("СуммаРаспределено");
	
//
	ЗапросУслугиКоворкинг = Новый Запрос("ВЫБРАТЬ
	                                     |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка КАК Счет,
	                                     |	КоворкингСчетаРаспределениеОплатКоворкинг.СуммаОплаты КАК СуммаОплаты,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК Услуга,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.Цена КАК Цена,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.Количество КАК Количество,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
	                                     |	КоворкингСчетаДопУслугиКоворкинг.Сумма КАК Сумма
	                                     |ИЗ
	                                     |	Документ.КоворкингСчета.РаспределениеОплатКоворкинг КАК КоворкингСчетаРаспределениеОплатКоворкинг
	                                     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
	                                     |		ПО КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка = КоворкингСчетаДопУслугиКоворкинг.Ссылка
	                                     |			И КоворкингСчетаРаспределениеОплатКоворкинг.ГУИДДолги = КоворкингСчетаДопУслугиКоворкинг.ГУИД
	                                     |ГДЕ
	                                     |	КоворкингСчетаРаспределениеОплатКоворкинг.Ссылка.ПометкаУдаления = ЛОЖЬ
	                                     |	И КоворкингСчетаРаспределениеОплатКоворкинг.ЭтоУслуга = ИСТИНА
	                                     |	И КоворкингСчетаРаспределениеОплатКоворкинг.ДокументОплаты = &ДокументОплаты
	                                     |
	                                     |УПОРЯДОЧИТЬ ПО
	                                     |	Счет");

	ЗапросУслугиКоворкинг.УстановитьПараметр("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
	ТЗ_УслугиКоворкинг = ЗапросУслугиКоворкинг.Выполнить().Выгрузить();
	
	Для Каждого СтрокаУслуги Из ТЗ_УслугиКоворкинг Цикл
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ДокументЗатраты = " " + СтрокаУслуги.Счет.КоворкингЗаявка.КоворкингНомер + " / ";
		ДокументЗатраты = ДокументЗатраты + 
			"Счет " + СтрокаУслуги.Счет.Номер + " от " + Формат(СтрокаУслуги.Счет.Дата, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатраты = ДокументЗатраты;
		ОбластьСтрокаЗатраты.Параметры.ДокументЗатратыРасшифровка = СтрокаУслуги.Счет;
		
		ОбластьСтрокаЗатраты.Параметры.ДатаЗатрат = Формат(СтрокаУслуги.ДатаУслуги, "ДФ=dd.MM.yy");
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = СтрокаУслуги.Услуга;
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СтрокаУслуги.СуммаОплаты;
		
		ОбластьСтрокаЗатраты.Параметры.СуммаЗатрат = СтрокаУслуги.Сумма;
	
		ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
	КонецЦикла;

	СуммаИтогоДокументОплатыЗатрат = СуммаИтогоДокументОплатыЗатрат + ТЗ_Услуги.Итог("СуммаОплаты");
	//СуммаНеРаспределено = СтрокаОплаты.СуммаОплаты - СуммаИтогоДокументОплатыЗатрат;
	Если СтрокаОплаты.Приход Тогда
		СуммаНеРаспределено = СтрокаОплаты.СуммаОплаты - СтрокаОплаты.СуммаВозврат - СуммаИтогоДокументОплатыЗатрат;
	Иначе
		СуммаНеРаспределено = 0;
	КонецЕсли;
	
	Если СуммаНеРаспределено <> 0 Тогда 
		ОбластьСтрокаЗатраты = Макет.ПолучитьОбласть("СтрокаЗатраты|КолонкиЛево"); 
		
		ОбластьСтрокаЗатраты.Параметры.ТипЗатрат = "Не распределено";
		ОбластьСтрокаЗатраты.Параметры.СуммаОплаты = СуммаНеРаспределено;
		
		ВыведеннаяОбласть = ПолеОтчета.Вывести(ОбластьСтрокаЗатраты, 2);
		Для Индекс = 0 По КоличествоКолонок - 1 Цикл 
			ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).Шрифт 
			 //= Новый Шрифт(ОбластьОформления.Шрифт, ОбластьОформления.Шрифт.Размер, ,Истина);
			 	= Новый Шрифт("Arial", 8, ,Истина);
			ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).ЦветТекста = Новый Цвет(255, 0, 0);
		КонецЦикла;

	КонецЕсли;
	
	ИтогиДеньДобавить(ИтогиДень, 0, 0, 0, 0
		, СуммаИтогоДокументОплатыЗатрат, СуммаНеРаспределено);
КонецЦикла;

Если Дата_П <> '00010101' Тогда
	ИтогиДеньОплатыВывод(ПолеОтчета, Макет, ИтогиДень, Дата_П);						
КонецЕсли;	

Возврат ПолеОтчета;
КонецФункции

//
Процедура ИтогиДеньОплатыВывод(ПолеОтчета, Макет, ИтогиДень, Дата_П)
Область = Макет.ПолучитьОбласть("ИтогиДеньОплаты|КолонкиЛево");

Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
Область.Параметры.Дата = Дата;		

Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
Область.Параметры.СуммаНаличные = ИтогиДень.СуммаНаличные;
Область.Параметры.СуммаКарта = ИтогиДень.СуммаКарта;
Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
ПолеОтчета.Вывести(Область, 1);

Если ИтогиДень.СуммаОплатыЗатраты <> 0 Тогда
	Область = Макет.ПолучитьОбласть("ИтогиДеньЗатраты|КолонкиЛево");
	Область.Параметры.ТипЗатрат = "Затраты";
	Область.Параметры.СуммаОплатыЗатраты = ИтогиДень.СуммаОплатыЗатраты;
	ПолеОтчета.Вывести(Область, 1);
КонецЕсли;

Если ИтогиДень.СуммаОплатыНераспределено <> 0 Тогда
	Область = Макет.ПолучитьОбласть("ИтогиДеньЗатраты|КолонкиЛево");
	Область.Параметры.ТипЗатрат = "Не распределено";
	Область.Параметры.СуммаОплатыЗатраты = ИтогиДень.СуммаОплатыНераспределено;
	ВыведеннаяОбласть = ПолеОтчета.Вывести(Область, 1);

	КоличествоКолонок = Область.ШиринаТаблицы;
	Для Индекс = 0 По КоличествоКолонок - 1 Цикл 
		ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).Шрифт 
		 //= Новый Шрифт(ОбластьОформления.Шрифт, ОбластьОформления.Шрифт.Размер, ,Истина);
		 	= Новый Шрифт("Arial", 8, ,Истина);
		ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЦикла;
КонецЕсли;
КонецПроцедуры

Процедура ИтогиДеньДобавить(ИтогиДень, СуммаОплаты, СуммаНаличные, СуммаКарта, СуммаЭквайринга
		, СуммаОплатыЗатраты, СуммаОплатыНераспределено)

ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
ИтогиДень.СуммаНаличные = ИтогиДень.СуммаНаличные + СуммаНаличные ;
ИтогиДень.СуммаКарта = ИтогиДень.СуммаКарта + СуммаКарта ;
ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;

ИтогиДень.СуммаОплатыЗатраты = ИтогиДень.СуммаОплатыЗатраты + СуммаОплатыЗатраты;
ИтогиДень.СуммаОплатыНераспределено = ИтогиДень.СуммаОплатыНераспределено  + СуммаОплатыНераспределено ;
КонецПроцедуры
//

////
Функция КомиссияРаспределение(ДатаОтчетаС, ДатаОтчетаПо) Экспорт

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГрупповыеСчетаКомиссияДокументыДолги.Ссылка КАК ГрупповойСчет,
                      |	ГрупповыеСчетаКомиссияДокументыДолги.ДокументДолг КАК ДокументДолг,
                      |	ГрупповыеСчетаКомиссияДокументыДолги.СуммаКомиссииКонтрагент КАК СуммаКомиссииКонтрагент
					  |ИЗ
                      |	Документ.ГрупповыеСчета.КомиссияДокументыДолги КАК ГрупповыеСчетаКомиссияДокументыДолги
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК Клиенты
                      |		ПО ГрупповыеСчетаКомиссияДокументыДолги.Ссылка.Контрагент = Клиенты.Ссылка
                      |ГДЕ
                      |	ГрупповыеСчетаКомиссияДокументыДолги.ДокументДолг В
                      |			(ВЫБРАТЬ
                      |				ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |			ИЗ
                      |				Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |			ГДЕ
                      |				(ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |						И НЕ(ЗаявкаНаБронирование.РезервС < &ДатаС
                      |								И ЗаявкаНаБронирование.РезервПо < &ДатаС)
                      |					ИЛИ ЗаявкаНаБронирование.РезервС > &ДатаПо))
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ГрупповойСчет,
                      |	ДокументДолг");

Запрос.УстановитьПараметр("ДатаС", ДатаОтчетаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаОтчетаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

ТЗ_Комиссия = Новый ТаблицаЗначений;
ТЗ_Комиссия.Колонки.Добавить("ГрупповойСчет");
ТЗ_Комиссия.Колонки.Добавить("Заявка");
ТЗ_Комиссия.Колонки.Добавить("СуммаРаспределено");
ТЗ_Комиссия.Колонки.Добавить("ДокументПлатежа");

//ТЗ_Комиссия.Колонки.Добавить("ПроцентКомиссии");


ТЗ_ДокументыПлатежа = Новый ТаблицаЗначений;
ТЗ_ДокументыПлатежа.Колонки.Добавить("ДокументПлатежа");

СуммаОплаты = 0;
ОстатокОплаты = 0;
ГрупповойСчет_П = Неопределено;

Для Каждого Строка Из ТЗ Цикл
	Если Строка.ГрупповойСчет <> ГрупповойСчет_П Тогда  
		ГрупповойСчет_П = Строка.ГрупповойСчет;
		
		ТЗ_ДокументыПлатежа.Очистить();
		Для Каждого СтрокаОплаты Из ГрупповойСчет_П.ДокументыОплаты Цикл
			Если ТипЗнч(СтрокаОплаты.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда 
				НоваяСтрокаДокументыПлатежа = ТЗ_ДокументыПлатежа.Добавить();
				НоваяСтрокаДокументыПлатежа.ДокументПлатежа = СтрокаОплаты.ДокументОплаты;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаОплаты Из ГрупповойСчет_П.ДокументыПлатежиКонтрагенту Цикл
			НоваяСтрокаДокументыПлатежа = ТЗ_ДокументыПлатежа.Добавить();
			НоваяСтрокаДокументыПлатежа.ДокументПлатежа = СтрокаОплаты.ДокументПлатежа;
		КонецЦикла;
	КонецЕсли;
	
	Если Строка.СуммаКомиссииКонтрагент = 0 Тогда
		СуммаИтогоПроживание = Строка.ДокументДолг.Проживание.Итог("СуммаБезСкидки");
		
		//ПроцентКомиссии = Строка.ДокументДолг.Бронирует.ПроцентКомиссии;
		ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(Строка.ДокументДолг.Бронирует, Строка.ДокументДолг.РезервС); //, Строка.ДокументДолг.В2В);
		
		СуммаКомиссии = ДокументыСервер.СуммаКомиссии(Строка.ДокументДолг, СуммаИтогоПроживание
			, Строка.ДокументДолг.Счета, Строка.ДокументДолг.СчетаДетальноДолги, Строка.ДокументДолг.ДопУслуги, ПроцентКомиссии);
		
	Иначе
		СуммаКомиссии = Строка.СуммаКомиссииКонтрагент;
	КонецЕсли;		
	
	Для Каждого СтрокаДокументПлатежа Из ТЗ_ДокументыПлатежа Цикл
		ОстатокОплаты = СтрокаДокументПлатежа.ДокументПлатежа.Сумма;
		
		НоваяСтрока = ТЗ_Комиссия.Добавить();
		
		НоваяСтрока.ГрупповойСчет = Строка.ГрупповойСчет;
		НоваяСтрока.Заявка = Строка.ДокументДолг;
		НоваяСтрока.ДокументПлатежа = СтрокаДокументПлатежа.ДокументПлатежа;
		
		Если ОстатокОплаты >= СуммаКомиссии Тогда  
			НоваяСтрока.СуммаРаспределено = СуммаКомиссии;
			
			ОстатокОплаты = ОстатокОплаты - СуммаКомиссии;
			СуммаКомиссии = 0;
			
			Прервать;
		Иначе
			НоваяСтрока.СуммаРаспределено = ОстатокОплаты;
			СуммаКомиссии = СуммаКомиссии - ОстатокОплаты;
			
			ОстатокОплаты = 0;
		КонецЕсли;
	КонецЦикла;
КонецЦикла;

ТЗ_КомиссияРаспределение = Новый ТаблицаЗначений;
ТЗ_КомиссияРаспределение.Колонки.Добавить("ГрупповойСчет");
ТЗ_КомиссияРаспределение.Колонки.Добавить("Заявка");
ТЗ_КомиссияРаспределение.Колонки.Добавить("Дата");
ТЗ_КомиссияРаспределение.Колонки.Добавить("СуммаКомиссииКЗачету");
ТЗ_КомиссияРаспределение.Колонки.Добавить("СуммаРаспределено");
ТЗ_КомиссияРаспределение.Колонки.Добавить("ДокументПлатежа");

Для Каждого СтрокаКомиссия Из ТЗ_Комиссия Цикл
	
	ОстатокСуммаКомиссии = СтрокаКомиссия.СуммаРаспределено;
	
	Если СтрокаКомиссия.Заявка.Проживание.Количество() = 0 Тогда
		Для Каждого СтрокаУслуги Из СтрокаКомиссия.Заявка.ДопУслуги Цикл
			Если НЕ СтрокаУслуги.ВСчет Тогда Продолжить; КонецЕсли;      
			
			ОтборСтроки = Новый Структура("ДолгиГУИД", СтрокаУслуги.ГУИД);
			ЗаявкаСчетаДетальноДолги = СтрокаКомиссия.Заявка.СчетаДетальноДолги.Выгрузить(ОтборСтроки);
			ЗаявкаДопУслуги = СтрокаКомиссия.Заявка.ДопУслуги.Выгрузить(ОтборСтроки);
			
			//ПроцентКомиссии = СтрокаКомиссия.Заявка.Бронирует.ПроцентКомиссии;
			ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(СтрокаКомиссия.Заявка.Бронирует, СтрокаКомиссия.РезервС); //, СтрокаКомиссия.Заявка.В2В);
			
			СуммаКомиссии = ДокументыСервер.СуммаКомиссии(СтрокаКомиссия.Заявка, 0
				, СтрокаКомиссия.Заявка.Счета, ЗаявкаСчетаДетальноДолги, ЗаявкаДопУслуги, ПроцентКомиссии);
			
			Если СуммаКомиссии = 0 Тогда Продолжить; КонецЕсли;
					
			НоваяСтрока = ТЗ_КомиссияРаспределение.Добавить();
			
			НоваяСтрока.ГрупповойСчет = СтрокаКомиссия.ГрупповойСчет;
			НоваяСтрока.Заявка = СтрокаКомиссия.Заявка;
			НоваяСтрока.ДокументПлатежа = СтрокаКомиссия.ДокументПлатежа;
			
			НоваяСтрока.Дата = СтрокаУслуги.ДатаУслуги;
			
			СуммаРаспределено = СуммаКомиссии;
			
			Если ОстатокСуммаКомиссии >= СуммаРаспределено Тогда  
				НоваяСтрока.СуммаРаспределено = СуммаРаспределено;
				НоваяСтрока.СуммаКомиссииКЗачету = СуммаРаспределено;
				
				ОстатокСуммаКомиссии = ОстатокСуммаКомиссии - НоваяСтрока.СуммаРаспределено;
			Иначе
				НоваяСтрока.СуммаРаспределено = ОстатокСуммаКомиссии;
				НоваяСтрока.СуммаКомиссииКЗачету = ОстатокСуммаКомиссии;
				
				ОстатокСуммаКомиссии = 0;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе		
		
		Для Каждого СтрокаПроживание Из СтрокаКомиссия.Заявка.Проживание Цикл
			НоваяСтрока = ТЗ_КомиссияРаспределение.Добавить();
			
			НоваяСтрока.ГрупповойСчет = СтрокаКомиссия.ГрупповойСчет;
			НоваяСтрока.Заявка = СтрокаКомиссия.Заявка;

			НоваяСтрока.ДокументПлатежа = СтрокаКомиссия.ДокументПлатежа;
			
			НоваяСтрока.Дата = СтрокаПроживание.ДеньПроживания;
			
			ОтборСтроки = Новый Структура("ДатаДолг", СтрокаПроживание.ДеньПроживания);
			ЗаявкаСчетаДетальноДолги = СтрокаКомиссия.Заявка.СчетаДетальноДолги.Выгрузить(ОтборСтроки);
		
			ОтборСтроки = Новый Структура("ДатаУслуги", СтрокаПроживание.ДеньПроживания);
			ЗаявкаДопУслуги = СтрокаКомиссия.Заявка.ДопУслуги.Выгрузить(ОтборСтроки);
		
			//ПроцентКомиссии = СтрокаКомиссия.Заявка.Бронирует.ПроцентКомиссии;
			ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(СтрокаКомиссия.Заявка.Бронирует, СтрокаКомиссия.Заявка.РезервС); //, СтрокаКомиссия.Заявка.В2В);
			
			СуммаКомиссии = ДокументыСервер.СуммаКомиссии(СтрокаКомиссия.Заявка, СтрокаПроживание.СуммаБезСкидки
				, СтрокаКомиссия.Заявка.Счета, ЗаявкаСчетаДетальноДолги, ЗаявкаДопУслуги, ПроцентКомиссии);
			
			СуммаРаспределено = СуммаКомиссии;
			
			Если ОстатокСуммаКомиссии >= СуммаРаспределено Тогда  
				НоваяСтрока.СуммаРаспределено = СуммаРаспределено;
				НоваяСтрока.СуммаКомиссииКЗачету = СуммаРаспределено;
				
				ОстатокСуммаКомиссии = ОстатокСуммаКомиссии - НоваяСтрока.СуммаРаспределено;
			Иначе
				НоваяСтрока.СуммаРаспределено = ОстатокСуммаКомиссии;
				НоваяСтрока.СуммаКомиссииКЗачету = ОстатокСуммаКомиссии;
				
				ОстатокСуммаКомиссии = 0;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
КонецЦикла;

Возврат ТЗ_КомиссияРаспределение;	
КонецФункции

////

// +++++++++++++++++++++++++++++++++++++++++++++++++++



