
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если Замечания.Количество()=0 тогда
		Движение = Движения.ЗамечанияПоНомерам.Добавить();
		Движение.Комната = Комната;
		Движение.ВремяПроверки = Дата;
		Движение.Комментарий = Комментарий;
		Движение.Замечание = Справочники.Замечания.Нет;
		Движение.Супервайзер=ПостПроверка;

	иначе
		
	Для Каждого ТекСтрокаЗамечания Из Замечания Цикл
		// регистр ЗамечанияПоНомерам 
		Движение = Движения.ЗамечанияПоНомерам.Добавить();
		Движение.Комната = Комната;
		Движение.ВремяПроверки = Дата;
		Движение.Комментарий = Комментарий;
		Движение.Замечание = ТекСтрокаЗамечания.Замечание;
		Движение.Супервайзер=ПостПроверка;
	КонецЦикла;
конецесли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
