
Функция ВыгрузитьФинРезультат(ДатаОтчетаС, ДатаОтчетаПо, ИмяФайлаЛога, ИмяФайлОшибка, Тест = Ложь) Экспорт
	
Файл = Новый ЗаписьТекста(ИмяФайлаЛога,,, Истина);
ФайлОшибка = Новый ЗаписьТекста(ИмяФайлОшибка,,, Истина);

Файл.ЗаписатьСтроку("===============================");
Файл.ЗаписатьСтроку("Начало выгрузки фин. результат: " + ТекущаяДата());

Файл.ЗаписатьСтроку("Начало формирования фин. результат: " + ТекущаяДата());
Попытка	
	ТабДок = ВыгрузкаФинРезультатСервер.СформироватьФинРезультат(ДатаОтчетаС, ДатаОтчетаПо);
Исключение
	Файл.ЗаписатьСтроку("Ошибка формирования фин. результат: " + ТекущаяДата());
	Файл.Закрыть();
	
	ФайлОшибка.ЗаписатьСтроку("Ошибка формирования фин. результат: " + ТекущаяДата()
		+ ". Описание ошибки: " + ОписаниеОшибки());
	ФайлОшибка.Закрыть();
	
	Возврат Истина;	
КонецПопытки;
Файл.ЗаписатьСтроку("Окончание формирования фин. результат: " + ТекущаяДата());
	
ИмяТекущаяОрганизация = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
Источник = "C:\_Base1C\Обмен\" + ИмяТекущаяОрганизация + "_ФинРезультат.xls";

Файл.ЗаписатьСтроку("Начало сохранения в Exel фин. результат:" + ТекущаяДата());
Попытка 
	ТабДок.Записать(Источник, ТипФайлаТабличногоДокумента.XLS); 
Исключение
	Файл.ЗаписатьСтроку("Ошибка сохранения в Exel фин. результат: " + ТекущаяДата());
	Файл.Закрыть();
	
	ФайлОшибка.ЗаписатьСтроку("Ошибка сохранения в Exel фин. результат: " + ТекущаяДата()
		+ ". Описание ошибки: " + ОписаниеОшибки());
	ФайлОшибка.Закрыть();
	
	Возврат Истина;	
КонецПопытки;
Файл.ЗаписатьСтроку("Окончание сохранения в Exel фин. результат: " + ТекущаяДата());

Получатель = ИмяТекущаяОрганизация + "_ФинРезультат.xls";
Если Тест Тогда
	Получатель = ИмяТекущаяОрганизация + "_ФинРезультат_Тест.xls";
КонецЕсли;

КаталогФТП = "/Finance";
АдресФТП = "46.48.76.218";
ИмяПользователя = "ftpuser";
Пароль = "123321";

Файл.ЗаписатьСтроку("Начало записи в FTP фин. результат: " + ТекущаяДата());

Ответ = ФТПСервер.ЗаписатьФТПФайлВКаталог(Источник, Получатель, КаталогФТП, АдресФТП, ИмяПользователя, Пароль);
Если Ответ.Ошибка Тогда
	Файл.ЗаписатьСтроку("Ошибка записи в FTP фин. результат: " + ТекущаяДата() + ". " + Ответ.ОписаниеОшибки);
	Файл.Закрыть();
	
	ФайлОшибка.ЗаписатьСтроку("Ошибка записи в FTP фин. результат: " + ТекущаяДата()
		+ ". Описание ошибки: " + Ответ.ОписаниеОшибки);
	ФайлОшибка.Закрыть();
	
	Возврат Истина;	
КонецЕсли;

Файл.ЗаписатьСтроку("Окончание записи в FTP фин. результат: " + ТекущаяДата());
Файл.Закрыть();

Возврат Ложь;
КонецФункции

Функция СформироватьФинРезультат(ДатаОтчетаС, ДатаОтчетаПо) Экспорт
//ш = 1/0;	
	
Макет = Обработки.ФинансовыйРезультат.ПолучитьМакет("ФинансовыйРезультат");

ТабДок = Обработки.ФинансовыйРезультат.СформироватьОтчетНаСервере(
	Макет, ДатаОтчетаС, ДатаОтчетаПо, "ВсеЗаПериод", "ВсеЗаПериод", Справочники.Клиенты.ПустаяСсылка(), Ложь, Ложь);
Возврат ТабДок; 	
КонецФункции

Функция ВыгрузитьФинРезультатКоворкинг(ДатаОтчетаС, ДатаОтчетаПо, ИмяФайлаЛога, ИмяФайлОшибка, Тест = Ложь) Экспорт
Файл = Новый ЗаписьТекста(ИмяФайлаЛога,,, Истина);
ФайлОшибка = Новый ЗаписьТекста(ИмяФайлОшибка,,, Истина);

Файл.ЗаписатьСтроку("-------------------");
Файл.ЗаписатьСтроку("Начало выгрузки фин. результат Коворкинг:" + ТекущаяДата());

Файл.ЗаписатьСтроку("Начало формирования фин. результат Коворкинг: " + ТекущаяДата());
Попытка	
	ТабДок = ВыгрузкаФинРезультатСервер.СформироватьФинРезультатКоворкинг(ДатаОтчетаС, ДатаОтчетаПо);
Исключение
	Файл.ЗаписатьСтроку("Ошибка формирования фин. результат Коворкинг:" + ТекущаяДата());
	Файл.Закрыть();
	
	ФайлОшибка.ЗаписатьСтроку("Ошибка формирования фин. результат Коворкинг: " + ТекущаяДата()
		+ ". Описание ошибки: " + ОписаниеОшибки());
	ФайлОшибка.Закрыть();
	
	Возврат Истина;	
КонецПопытки;
Файл.ЗаписатьСтроку("Окончание формирования фин. результат Коворкинг: " + ТекущаяДата());
	
ИмяТекущаяОрганизация = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
Источник = "C:\_Base1C\Обмен\" + ИмяТекущаяОрганизация + "_ФинРезультатКоворкинг.xls";

Файл.ЗаписатьСтроку("Начало сохранения в Exel фин. результат Коворкинг:" + ТекущаяДата());
Попытка 
	ТабДок.Записать(Источник, ТипФайлаТабличногоДокумента.XLS); 
Исключение
	Файл.ЗаписатьСтроку("Ошибка сохранения в Exel фин. результат Коворкинг: " + ТекущаяДата());
	Файл.Закрыть();
	
	ФайлОшибка.ЗаписатьСтроку("Ошибка сохранения в Exel фин. результат Коворкинг: " + ТекущаяДата()
		+ ". Описание ошибки: " + ОписаниеОшибки());
	ФайлОшибка.Закрыть();
	
	Возврат Истина;	
КонецПопытки;
Файл.ЗаписатьСтроку("Окончание сохранения в Exel фин. результат Коворкинг: " + ТекущаяДата());

Получатель = ИмяТекущаяОрганизация + "_ФинРезультатКоворкинг.xls";
Если Тест Тогда
	Получатель = ИмяТекущаяОрганизация + "_ФинРезультатКоворкинг_Тест.xls";
КонецЕсли;

КаталогФТП = "/Finance";
АдресФТП = "46.48.76.218";
ИмяПользователя = "ftpuser";
Пароль = "123321";

Файл.ЗаписатьСтроку("Начало записи в FTP фин. результат Коворкинг: " + ТекущаяДата());
Ответ = ФТПСервер.ЗаписатьФТПФайлВКаталог(Источник, Получатель, КаталогФТП, АдресФТП, ИмяПользователя, Пароль);
Если Ответ.Ошибка Тогда
	Файл.ЗаписатьСтроку("Ошибка записи в FTP фин. результат Коворкинг: " + ТекущаяДата() + ". " + Ответ.ОписаниеОшибки);
	Файл.Закрыть();
	
	ФайлОшибка.ЗаписатьСтроку("Ошибка записи в FTP фин. результат Коворкинг: " + ТекущаяДата()
		+ ". Описание ошибки: " + Ответ.ОписаниеОшибки);
	ФайлОшибка.Закрыть();
	
	Возврат Истина;	
КонецЕсли;;

Файл.ЗаписатьСтроку("Окончание записи в FTP фин. результат Коворкинг: " + ТекущаяДата());
Файл.Закрыть();

Возврат Ложь;
КонецФункции

Функция СформироватьФинРезультатКоворкинг(ДатаОтчетаС, ДатаОтчетаПо) Экспорт
//ш = 1/0;	
	
Макет = Обработки.ФинансовыйРезультатКоворкинг.ПолучитьМакет("ФинансовыйРезультат");

ТабДок = Обработки.ФинансовыйРезультатКоворкинг.СформироватьОтчетНаСервере(
	Макет, ДатаОтчетаС, ДатаОтчетаПо, Ложь);
Возврат ТабДок; 	
КонецФункции
