
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Ложь);
	
Если Параметры.Свойство("Корректировка") Тогда
	Элементы.Код.ТолькоПросмотр = Истина;		
	Элементы.Наименование.ТолькоПросмотр = Истина;		
	Элементы.Стандартный.ТолькоПросмотр = Истина;		
	
	Элементы.Базовый.ТолькоПросмотр = Истина;	
	Элементы.ТолькоОдноместный.ТолькоПросмотр = Истина;	
КонецЕсли;	

//ПроцентСкидкиБезЗавтрака = ДокументыСервер.ПроцентСкидкиБезЗавтрака();
ОбновитьЦеныБезЗавтрака();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЦеныБезЗавтрака()
Если ПроцентСкидкиБезЗавтрака <> 0 Тогда
//	
	Цена = ДокументыСервер.ЦенаПроцентСкидкиБезЗавтрака(Объект.БазовыйТарифБудни, ПроцентСкидкиБезЗавтрака);
	Объект.БазовыйТарифБудниБезЗавтрака = Цена;
	Элементы.БазовыйТарифБудниБезЗавтрака.ТолькоПросмотр = Истина;
	
	Цена = ДокументыСервер.ЦенаПроцентСкидкиБезЗавтрака(Объект.БазовыйТарифВыходные, ПроцентСкидкиБезЗавтрака);
	Объект.БазовыйТарифВыходныеБезЗавтрака = Цена;
	Элементы.БазовыйТарифВыходныеБезЗавтрака.ТолькоПросмотр = Истина;
	
//
	Цена = ДокументыСервер.ЦенаПроцентСкидкиБезЗавтрака(Объект.БазовыйТарифБудниДвух, ПроцентСкидкиБезЗавтрака);
	Объект.БазовыйТарифБудниДвухБезЗавтрака = Цена;
	Элементы.БазовыйТарифБудниДвухБезЗавтрака.ТолькоПросмотр = Истина;
	
	Цена = ДокументыСервер.ЦенаПроцентСкидкиБезЗавтрака(Объект.БазовыйТарифВыходныеДвух, ПроцентСкидкиБезЗавтрака);
	Объект.БазовыйТарифВыходныеДвухБезЗавтрака = Цена;
	Элементы.БазовыйТарифВыходныеДвухБезЗавтрака.ТолькоПросмотр = Истина;
	
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
Если ТекущийОбъект.БазовыйТарифБудни = ТекущийОбъект.Ссылка.БазовыйТарифБудни	
И ТекущийОбъект.БазовыйТарифБудни = ТекущийОбъект.Ссылка.БазовыйТарифБудни	
И ТекущийОбъект.БазовыйТарифВыходные = ТекущийОбъект.Ссылка.БазовыйТарифВыходные	
И ТекущийОбъект.БазовыйТарифБудниБезЗавтрака = ТекущийОбъект.Ссылка.БазовыйТарифБудниБезЗавтрака	
И ТекущийОбъект.БазовыйТарифВыходныеБезЗавтрака = ТекущийОбъект.Ссылка.БазовыйТарифВыходныеБезЗавтрака	
И ТекущийОбъект.БазовыйТарифБудниДвух = ТекущийОбъект.Ссылка.БазовыйТарифБудниДвух	
И ТекущийОбъект.БазовыйТарифВыходныеДвух = ТекущийОбъект.Ссылка.БазовыйТарифВыходныеДвух	
И ТекущийОбъект.БазовыйТарифБудниДвухБезЗавтрака = ТекущийОбъект.Ссылка.БазовыйТарифБудниДвухБезЗавтрака	
И ТекущийОбъект.БазовыйТарифВыходныеДвухБезЗавтрака = ТекущийОбъект.Ссылка.БазовыйТарифВыходныеДвухБезЗавтрака	
Тогда Возврат; КонецЕсли;

ИзменениеБазовойЦеныОбъект = Документы.ИзменениеБазовойЦены.СоздатьДокумент();	
ИзменениеБазовойЦеныОбъект.Дата = ТекущаяДата();

ИзменениеБазовойЦеныОбъект.БазовыйТарифБудни = ТекущийОбъект.БазовыйТарифБудни;
ИзменениеБазовойЦеныОбъект.БазовыйТарифВыходные = ТекущийОбъект.БазовыйТарифВыходные;
ИзменениеБазовойЦеныОбъект.БазовыйТарифБудниБезЗавтрака = ТекущийОбъект.БазовыйТарифБудниБезЗавтрака;
ИзменениеБазовойЦеныОбъект.БазовыйТарифВыходныеБезЗавтрака = ТекущийОбъект.БазовыйТарифВыходныеБезЗавтрака;
ИзменениеБазовойЦеныОбъект.БазовыйТарифБудниДвух = ТекущийОбъект.БазовыйТарифБудниДвух;
ИзменениеБазовойЦеныОбъект.БазовыйТарифВыходныеДвух = ТекущийОбъект.БазовыйТарифВыходныеДвух;
ИзменениеБазовойЦеныОбъект.БазовыйТарифБудниДвухБезЗавтрака = ТекущийОбъект.БазовыйТарифБудниДвухБезЗавтрака;
ИзменениеБазовойЦеныОбъект.БазовыйТарифВыходныеДвухБезЗавтрака = ТекущийОбъект.БазовыйТарифВыходныеДвухБезЗавтрака;

ИзменениеБазовойЦеныОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура БазовыйТарифБудниПриИзменении(Элемент)
ОбновитьЦеныБезЗавтрака();
КонецПроцедуры

&НаКлиенте
Процедура БазовыйТарифВыходныеПриИзменении(Элемент)
ОбновитьЦеныБезЗавтрака();
КонецПроцедуры

&НаКлиенте
Процедура БазовыйТарифБудниДвухПриИзменении(Элемент)
ОбновитьЦеныБезЗавтрака();
КонецПроцедуры

&НаКлиенте
Процедура БазовыйТарифВыходныеДвухПриИзменении(Элемент)
ОбновитьЦеныБезЗавтрака();
КонецПроцедуры



