

&НаКлиенте
Процедура СформироватьОтчет(Команда)
СформироватьОтчетНаСервере();

//ТабДок = СформироватьОтчетНаСервере();
//ТабДок.Показать();	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка.НомерВРезерв КАК НомерВРезерв,
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК СуммаУслуги,
                      |	ЕСТЬNULL(Оплаты.СуммаОплаты, 0) КАК СуммаОплаты,
                      |	Оплаты.ДокументОплатыДатаОплаты КАК ДатаОплаты
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ДатаОплаты) КАК Оплаты
                      |		ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = Оплаты.Ссылка
                      |			И ЗаявкаНаБронированиеДопУслуги.ГУИД = Оплаты.ДолгиГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги >= &Дата_С
                      |	И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги <= &Дата_По
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги,
                      |	НомерВРезерв,
                      |	Заявка");

Запрос.УстановитьПараметр("Дата_С", Дата_С);
Запрос.УстановитьПараметр("Дата_По", Дата_По);

ТЗ = Запрос.Выполнить().Выгрузить();
ТЗ_Данные = ТЗ.СкопироватьКолонки();
Для Каждого Строка Из ТЗ Цикл
    ЕстьУслугаМинибар = Ложь;
	Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР Тогда
	    ЕстьУслугаМинибар = Истина;
	Иначе	
		ВерхняяПапка = Неопределено;
		ОбщийФункционалСервер.ВерхняяПапка(Строка.Услуга, ВерхняяПапка);
		Если ВерхняяПапка <> Неопределено Тогда
			Если ВерхняяПапка.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР Тогда
			    ЕстьУслугаМинибар = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ЕстьУслугаМинибар Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = ТЗ_Данные.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

ТЗ_Суммы = ТЗ_Данные.Скопировать();
ТЗ_Суммы.Свернуть("ДатаУслуги, НомерВРезерв, Заявка, ДатаОплаты", "СуммаУслуги, СуммаОплаты");
ТЗ_Суммы.Сортировать("ДатаУслуги, НомерВРезерв, Заявка, ДатаОплаты"); 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Заявка,
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка.НомерВРезерв КАК НомерВРезерв,
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги КАК ДатаУслуги,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                      |	ЕСТЬNULL(ГорничныеОбслуживаниеНомера.ТипУборкиПризнак, """") КАК ТипУборкиПризнак,
                      |	ГорничныеОбслуживаниеНомера.НомерОбслуживания_пп КАК НомерОбслуживания_пп
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГорничныеОбслуживаниеНомера КАК ГорничныеОбслуживаниеНомера
                      |		ПО ЗаявкаНаБронированиеДопУслуги.Ссылка.НомерВРезерв = ГорничныеОбслуживаниеНомера.НомерВРезерв
                      |			И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги = ГорничныеОбслуживаниеНомера.ДатаОбслуживания
                      |ГДЕ
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги >= &Дата_С
                      |	И ЗаявкаНаБронированиеДопУслуги.ДатаУслуги <= &Дата_По
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ЗаявкаНаБронированиеДопУслуги.ДатаУслуги,
                      |	НомерВРезерв,
                      |	Заявка,
                      |	НомерОбслуживания_пп");

Запрос.УстановитьПараметр("Дата_С", Дата_С);
Запрос.УстановитьПараметр("Дата_По", Дата_По);
ТЗ = Запрос.Выполнить().Выгрузить();

ТЗ_Данные = ТЗ.СкопироватьКолонки();
Для Каждого Строка Из ТЗ Цикл
    ЕстьУслугаМинибар = Ложь;
	Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР Тогда
	    ЕстьУслугаМинибар = Истина;
	Иначе	
		ВерхняяПапка = Неопределено;
		ОбщийФункционалСервер.ВерхняяПапка(Строка.Услуга, ВерхняяПапка);
		Если ВерхняяПапка <> Неопределено Тогда
			Если ВерхняяПапка.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР Тогда
			    ЕстьУслугаМинибар = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ЕстьУслугаМинибар Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = ТЗ_Данные.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

ТЗ_Обслуживание = ТЗ_Данные.Скопировать(); 
ТЗ_Обслуживание.Свернуть("ДатаУслуги, НомерВРезерв, Заявка, ТипУборкиПризнак, НомерОбслуживания_пп");
ТЗ_Обслуживание.Сортировать("ДатаУслуги, НомерВРезерв, Заявка, НомерОбслуживания_пп"); 

ТЗ_ДатаУслуги = ТЗ_Суммы.Скопировать(, "ДатаУслуги");
ТЗ_ДатаУслуги.Свернуть("ДатаУслуги");
ТЗ_ДатаУслуги.Сортировать("ДатаУслуги");

ТЗОтчет.Очистить();
Для Каждого Строка_ДатаУслуги Из ТЗ_ДатаУслуги Цикл
	ДатаУслуги = Строка_ДатаУслуги.ДатаУслуги;
	
	ОтборСтроки = Новый Структура("ДатаУслуги", Строка_ДатаУслуги.ДатаУслуги);
	ТЗ_НомерВРезерв = ТЗ_Суммы.Скопировать(ОтборСтроки, "НомерВРезерв");	
	
	ТЗ_НомерВРезерв.Свернуть("НомерВРезерв");
	ТЗ_НомерВРезерв.Сортировать("НомерВРезерв");
	
	Для Каждого Строка_НомерВРезерв Из ТЗ_НомерВРезерв Цикл
		НомерВРезерв = Строка_НомерВРезерв.НомерВРезерв;
		
		ОтборСтроки = Новый Структура("ДатаУслуги, НомерВРезерв", ДатаУслуги, НомерВРезерв);
		ТЗ_Заявка = ТЗ_Суммы.Скопировать(ОтборСтроки, "Заявка, СуммаУслуги");	
		
		ТЗ_Заявка.Свернуть("Заявка", "СуммаУслуги");
		ТЗ_Заявка.Сортировать("Заявка");
		
		СуммаУслуги = ТЗ_Заявка[0].СуммаУслуги;
		
		Для Каждого Строка_Заявка Из ТЗ_Заявка Цикл
			Заявка = Строка_Заявка.Заявка;
		
			ОтборСтроки = Новый Структура("ДатаУслуги, НомерВРезерв, Заявка", ДатаУслуги, НомерВРезерв, Заявка);
			ТЗ_ДатаОплаты_П = ТЗ_Суммы.Скопировать(ОтборСтроки, "ДатаОплаты, СуммаОплаты");
			
			ТЗ_ДатаОплаты = ТЗ_ДатаОплаты_П.СкопироватьКолонки();
			Для Каждого Строка Из ТЗ_ДатаОплаты_П Цикл
				Если Строка.СуммаОплаты = 0 Тогда Продолжить; КонецЕсли;
					
				НоваяСтрока = ТЗ_ДатаОплаты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;
			
			ТЗ_ДатаОплаты.Свернуть("ДатаОплаты", "СуммаОплаты");
			ТЗ_ДатаОплаты.Сортировать("ДатаОплаты");
			
			Если ТЗ_ДатаОплаты.Количество() > 0 Тогда
				СуммаОплаты = 0;
				
				ДатаОплаты = "";
				Для Каждого Строка_ДатаОплаты Из ТЗ_ДатаОплаты Цикл
					ДатаОплаты_П = Формат(Строка_ДатаОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
					ДатаОплаты = ОбщийФункционалКлиентСервер.ДобавитьТекст(ДатаОплаты, ДатаОплаты_П, ", "); 
					
					СуммаОплаты = СуммаОплаты + Строка_ДатаОплаты.СуммаОплаты;
				КонецЦикла;
			Иначе
				СуммаОплаты = 0;
				ДатаОплаты = "";
			КонецЕсли;
				
			ОтборСтроки = Новый Структура("ДатаУслуги, НомерВРезерв, Заявка", ДатаУслуги, НомерВРезерв, Заявка);
			ТЗ_ТипУборкиПризнак = ТЗ_Обслуживание.Скопировать(ОтборСтроки, "ТипУборкиПризнак, НомерОбслуживания_пп");
			ТЗ_ТипУборкиПризнак.Свернуть("ТипУборкиПризнак, НомерОбслуживания_пп");
			ТЗ_ТипУборкиПризнак.Сортировать("НомерОбслуживания_пп");
			
			ТипУборкиПризнак = "";
			Для Каждого Строка_Данные Из ТЗ_ТипУборкиПризнак Цикл
			   ТипУборкиПризнак = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТипУборкиПризнак, Строка_Данные.ТипУборкиПризнак, ", "); 
		   	КонецЦикла;
		
			НоваяСтрока = ТЗОтчет.Добавить();
			
			НоваяСтрока.ДатаУслуги = ДатаУслуги;
			НоваяСтрока.НомерВРезерв = НомерВРезерв;
			НоваяСтрока.Заявка = Заявка;
			НоваяСтрока.СуммаУслуги = СуммаУслуги;
			НоваяСтрока.СуммаОплаты = СуммаОплаты;
			НоваяСтрока.ДатаОплаты = ДатаОплаты;    
			НоваяСтрока.ТипУборкиПризнак = ТипУборкиПризнак;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецЦикла;

Макет = Отчеты.МинибарДолги.ПолучитьМакет("Макет");
ПолеОтчета.Очистить();

Область = Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(Область);

Для Каждого Строка Из ТЗОтчет Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Если ТолькоОтклонения Тогда
		Если Строка.СуммаУслуги = Строка.СуммаОплаты Тогда Продолжить; КонецЕсли;
	КонецЕсли;
	
	Область.Параметры.ДатаУслуги = Формат(Строка.ДатаУслуги, "ДФ=dd.MM.yy"); 
	Область.Параметры.НомерВРезерв = Строка.НомерВРезерв; 
	Область.Параметры.Заявка = Строка.Заявка; 
	Область.Параметры.СуммаУслуги = Строка.СуммаУслуги; 
	Область.Параметры.СуммаОплаты = Строка.СуммаОплаты; 
	Область.Параметры.ДатаОплаты = Строка.ДатаОплаты; 
	Область.Параметры.ТипУборкиПризнак = Строка.ТипУборкиПризнак; 
	
	Область.Параметры.ЗаявкаРасшифровка = Строка.Заявка;
	
	ПолеОтчета.Вывести(Область);	
КонецЦикла;

ОбластьШапка = ПолеОтчета.Область(0,,0); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

ПолеОтчета.ФиксацияСверху = 1;

//ТЗОтчет_П = ТЗОтчет.Выгрузить();
//ТабДок = ДанныеТаблицыЗначенийВТабличныйДокумент(ТЗОтчет_П); 

//Возврат ТабДок;	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеТаблицыЗначенийВТабличныйДокумент(ДанныеВТабличныйДокумент)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДанныеВТабличныйДокумент);       
	Построитель.Вывести(ТабличныйДокумент);
		
	Возврат ТабличныйДокумент;

КонецФункции 