
Функция ПолучитьДанныеОрганизацииДляФУ() Экспорт
Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Ответ = Новый Структура;
Если ЗначениеЗаполнено(Организация) Тогда
	Ответ.Вставить("Организация", Организация.Наименование);
	Ответ.Вставить("НаименованиеДляФУ", Организация.НаименованиеДляФУ);
	Ответ.Вставить("ИННДляФУ", Организация.ИНН);
	Ответ.Вставить("Кассир", Организация.Кассир);
	Ответ.Вставить("ТипСистемыНалогообложенияККТ", Организация.ТипСистемыНалогообложенияККТ);
	
	Если Организация.КоворкингОрганизацияЕсть Тогда	
		Ответ.Вставить("КоворкингНаименованиеДляФУ", Организация.КоворкингНаименованиеДляФУ);
		Ответ.Вставить("ИННДляФУКоворкинг", Организация.КоворкингИНН);
		Ответ.Вставить("КоворкингКассир", Организация.КоворкингКассир);
		Ответ.Вставить("ТипСистемыНалогообложенияККТКоворкинг", Организация.КоворкингТипСистемыНалогообложенияККТ);
	Иначе	
		Ответ.Вставить("КоворкингНаименованиеДляФУ", Организация.НаименованиеДляФУ);
		Ответ.Вставить("ИННДляФУКоворкинг", Организация.ИНН);
		Ответ.Вставить("КоворкингКассир", Организация.Кассир);
		Ответ.Вставить("ТипСистемыНалогообложенияККТКоворкинг", Организация.ТипСистемыНалогообложенияККТ);
	КонецЕсли;		
Иначе
	Ответ.Вставить("Организация", Организация.Пустая());
	Ответ.Вставить("НаименованиеДляФУ", "");
	Ответ.Вставить("ИННДляФУ", "");
	Ответ.Вставить("Кассир", "");
	Ответ.Вставить("ТипСистемыНалогообложенияККТ", Перечисления.ТипыСистемНалогообложенияККТ.ПустаяСсылка());
	                                            
	Ответ.Вставить("КоворкингНаименованиеДляФУ", "");
	Ответ.Вставить("ИННДляФУКоворкинг", "");
	Ответ.Вставить("КоворкингКассир", "");
	Ответ.Вставить("ТипСистемыНалогообложенияККТКоворкинг", Перечисления.ТипыСистемНалогообложенияККТ.ПустаяСсылка());
КонецЕсли;	

Возврат Ответ;
КонецФункции

Функция ПолучитьДанныеОрганизации(ЭтоКоворкинг) Экспорт
ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Ответ = Новый Структура;
Ответ.Вставить("НаименованииеОтеляДляДокументов", ТекущаяОрганизация.НаименованииеОтеляДляДокументов);
Если ЭтоКоворкинг И ТекущаяОрганизация.КоворкингОрганизацияЕсть Тогда
	Ответ.Вставить("ОрганизацияДляДокументов", ТекущаяОрганизация.КоворкингОрганизацияДляДокументов);
	Ответ.Вставить("АдресДляДокументов", ТекущаяОрганизация.КоворкингАдресДляДокументов);
	Ответ.Вставить("ИНН", ТекущаяОрганизация.КоворкингИНН);
	Ответ.Вставить("КПП", ТекущаяОрганизация.КоворкингКПП);
	Ответ.Вставить("ФИОРуководительДляДокументов", ТекущаяОрганизация.КоворкингФИОРуководительДляДокументов);
	Ответ.Вставить("ФИОБухгалтерДляДокументов", ТекущаяОрганизация.КоворкингФИОБухгалтерДляДокументов);
	Ответ.Вставить("ФИОБухгалтерДляСчетаФактуры", ТекущаяОрганизация.КоворкингФИОБухгалтерДляСчетаФактуры);
	
	Ответ.Вставить("СчетБанкПолучателя", ТекущаяОрганизация.КоворкингСчетБанкПолучателя);
	Ответ.Вставить("СчетБИКБанкаПолучателя", ТекущаяОрганизация.КоворкингСчетБИКБанкаПолучателя);
	Ответ.Вставить("СчетКорСчетБанкаПолучателя", ТекущаяОрганизация.КоворкингСчетКорСчетБанкаПолучателя);
	Ответ.Вставить("СчетСчетБанкаПолучателя", ТекущаяОрганизация.КоворкингСчетСчетБанкаПолучателя);
Иначе	
	Ответ.Вставить("ОрганизацияДляДокументов", ТекущаяОрганизация.ОрганизацияДляДокументов);
	Ответ.Вставить("АдресДляДокументов", ТекущаяОрганизация.ОрганизацияАдресДляДокументов);
	Ответ.Вставить("ИНН", ТекущаяОрганизация.ИНН);
	Ответ.Вставить("КПП", ТекущаяОрганизация.КПП);
	Ответ.Вставить("ФИОРуководительДляДокументов", ТекущаяОрганизация.ОрганизацияФИОРуководительДляДокументов);
	Ответ.Вставить("ФИОБухгалтерДляДокументов", ТекущаяОрганизация.ОрганизацияФИОБухгалтерДляДокументов);
	Ответ.Вставить("ФИОБухгалтерДляСчетаФактуры", ТекущаяОрганизация.ОрганизацияФИОБухгалтерДляСчетаФактуры);
	
	Ответ.Вставить("СчетБанкПолучателя", ТекущаяОрганизация.СчетЮрЛицоБанкПолучателя);
	Ответ.Вставить("СчетБИКБанкаПолучателя", ТекущаяОрганизация.СчетЮрЛицоБИКБанкаПолучателя);
	Ответ.Вставить("СчетКорСчетБанкаПолучателя", ТекущаяОрганизация.СчетЮрЛицоКорСчетБанкаПолучателя);
	Ответ.Вставить("СчетСчетБанкаПолучателя", ТекущаяОрганизация.СчетЮрЛицоСчетБанкаПолучателя);
КонецЕсли;	
Возврат Ответ;
КонецФункции

