
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = Истина;
	
Параметры.Свойство("СписокКонтрагентов", СписокКонтрагентов);
Параметры.Свойство("СуммаКОплате", СуммаКОплате);
Параметры.Свойство("ВсеЗаписи", ВсеЗаписи);
Параметры.Свойство("ОтмененныйДокументДолг", ОтмененныйДокументДолг);
ТипОтмененныйДокументДолг = ТипЗнч(ОтмененныйДокументДолг);
//Параметры.Свойство("ТипОтмененныйДокументДолг", ТипОтмененныйДокументДолг);

УстановитьНаименованиеЮрЛицаВидимость();

УстановитьПараметрыОтбора();
КонецПроцедуры

&НаСервере                       
Процедура УстановитьПараметрыОтбора()
Список.Параметры.УстановитьЗначениеПараметра("СписокКонтрагентов", СписокКонтрагентов);
Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаписи", ВсеЗаписи);
Список.Параметры.УстановитьЗначениеПараметра("ОтмененныйДокументДолг", ОтмененныйДокументДолг);
//Список.Параметры.УстановитьЗначениеПараметра("ТипОтмененныйДокументДолг", ТипОтмененныйДокументДолг);
КонецПроцедуры

&НаСервере                       
Процедура УстановитьНаименованиеЮрЛицаВидимость()
Если ВсеЗаписи Тогда 
	Элементы.ОтКогоНаименованиеЮрЛица.Видимость = Истина;
	
	Возврат;
КонецЕсли;
	
Видимость_П = Ложь;
Для Каждого Строка Из СписокКонтрагентов Цикл
	Если КлиентыСервер.ЭтоЮрЛицо(Строка.Значение) Тогда
		Видимость_П = Истина;
		
		Прервать;	
	КонецЕсли;
КонецЦикла;

Элементы.ОтКогоНаименованиеЮрЛица.Видимость = Видимость_П;
КонецПроцедуры


&НаКлиенте
Процедура ВсеЗаписиПриИзменении(Элемент)
УстановитьНаименованиеЮрЛицаВидимость();
	
УстановитьПараметрыОтбора();
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Результат = ВыбраннаяСтрока;	

Закрыть(Результат);
КонецПроцедуры

