
Функция ЗаполнитьОтчетДолгиНаСервере(ДатаС, ДатаПо, ДанныеДолги, НомерСтрокиШапкаДолги, НомерКомментарий_Долги) Экспорт  
ТабДок = Новый ТабличныйДокумент;

Запрос = Новый Запрос;

Запрос.Текст = ТекстЗапроса();

Запрос.Текст = Запрос.Текст + "
                      |	И ЕСТЬNULL(СчетаПроживание.СуммаКЗакрытию, 0) + ЕСТЬNULL(СчетаУслуги.СуммаКЗакрытию, 0) > 0
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	РезервС,
                      |	НомерВРезерв";

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

МакетОбработки = Обработки.ЗакрытиеФинансовогоПериода.ПолучитьМакет("МакетДолги");

Область = МакетОбработки.ПолучитьОбласть("Заголовок");
ОтельСсылка = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Отель = ОтельСсылка.Наименование;
Область.Параметры.Отель = Отель;
Область.Параметры.ДатаС = Формат(ДатаС, "ДФ=dd.MM.yy");
Область.Параметры.ДатаПо = Формат(ДатаПо, "ДФ=dd.MM.yy");
ТабДок.Вывести(Область);

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК КоличествоЗаявок,
                      |	СУММА(ДолгиКЗакрытию.СуммаДолг) КАК СуммаЗаявок
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК ДолгиКЗакрытию
                      |		ПО ЗаявкаНаБронирование.Ссылка = ДолгиКЗакрытию.Ссылка
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                      |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
                      |	И ЗаявкаНаБронирование.РезервПо <= &ДатаПо
                      |	И ЗаявкаНаБронирование.РезервПо >= &ДатаС
                      |	И ДолгиКЗакрытию.СуммаКЗакрытию = 0");

Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_ЗакрытоЗаявок = Запрос.Выполнить().Выгрузить();
Если ТЗ_ЗакрытоЗаявок.Количество() = 0 Тогда
	КоличествоЗаявок = 0; 	
	СуммаЗаявок = 0;
Иначе
	КоличествоЗаявок = ТЗ_ЗакрытоЗаявок[0].КоличествоЗаявок; 	
	СуммаЗаявок = ТЗ_ЗакрытоЗаявок[0].СуммаЗаявок;
КонецЕсли;
	
Область = МакетОбработки.ПолучитьОбласть("ЗакрытоЗаявок");
Область.Параметры.КоличествоЗаявок = Строка(КоличествоЗаявок);
Область.Параметры.СуммаЗаявок = Строка(СуммаЗаявок);
ТабДок.Вывести(Область);
//

//
Область = МакетОбработки.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

ДанныеДолги.Очистить();
НомерКомментарий_Долги = Область.ШиринаТаблицы;
НомерСтрокиШапкаДолги = ТабДок.ВысотаТаблицы;

НомерКолонкиСуммаПроживание = 10;
НомерКолонкиСуммаУслуги = 12;
Для Каждого Строка Из ТЗ Цикл
	Область = МакетОбработки.ПолучитьОбласть("Строка");
	
	Область.Параметры.Заполнить(Строка);
	Область.Параметры.РезервС = Формат(Строка.РезервС, "ДФ=dd.MM.yy");
	Область.Параметры.РезервПо = Формат(Строка.РезервПо, "ДФ=dd.MM.yy");
	
	Область.Параметры.Заявка = Строка.ЗаявкаНаБронирование.Номер + " от " + Формат(Строка.ЗаявкаНаБронирование.Дата, "ДФ=dd.MM.yy");
	Область.Параметры.ЗаявкаНаБронирование = Строка.ЗаявкаНаБронирование;
	
	Если Строка.СуммаПроживаниеСчета <> Строка.СуммаПроживание Тогда
		Область.Область(1, НомерКолонкиСуммаПроживание, 1, НомерКолонкиСуммаПроживание).ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	Если Строка.СуммаУслугиСчета <> Строка.СуммаУслуги Тогда
		Область.Область(1, НомерКолонкиСуммаУслуги, 1, НомерКолонкиСуммаУслуги).ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	ИмяОбласти = "R1C" + Строка(НомерКомментарий_Долги);
	Область.Область(ИмяОбласти).Значение = Строка.КомментарийОтветственного;
	ТабДок.Вывести(Область);
	
	НоваяСтрока = ДанныеДолги.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("Подножие");
//Область.Параметры.СуммаЗаявки = ТЗ.Итог("СуммаЗаявки");
//Область.Параметры.СуммаПроживаниеСчета = ТЗ.Итог("СуммаПроживаниеСчета");
//Область.Параметры.СуммаПроживание = ТЗ.Итог("СуммаПроживание");
//Область.Параметры.СуммаУслугиСчета = ТЗ.Итог("СуммаУслугиСчета");
//Область.Параметры.СуммаУслуги = ТЗ.Итог("СуммаУслуги");
Область.Параметры.СуммаДолга = ТЗ.Итог("СуммаДолга");
ТабДок.Вывести(Область) ;

//Область = МакетОбработки.ПолучитьОбласть("ПустаяОбласть");
//ТабДок.Вывести(Область) ;
//ТабДок.Вывести(Область) ;

//ТабДок.ФиксацияСверху = 1;
Возврат ТабДок;
КонецФункции

Функция ЗаполнитьОтчетСписаниеНаСервере(ДатаС, ДатаПо) Экспорт 
ТабДок = Новый ТабличныйДокумент;

//
ИмяОбъекта = "СписаниеДопУслуг";
УслугиРодительСправочник = Новый ТаблицаЗначений;
УслугиРодительСправочник.Колонки.Добавить("УслугаРодитель");
УслугиРодительСправочник.Колонки.Добавить("ЗаголовокОтчеты");
УслугиРодительСправочник.Колонки.Добавить("НомерПП");
УслугиРодительСправочник.Колонки.Добавить("Номер");
УслугиРодительСправочник.Колонки.Добавить("СуммаИтого");

Документы[ИмяОбъекта].ЗаполнитьУслугиРодительСправочник(УслугиРодительСправочник);

Для Каждого Строка Из УслугиРодительСправочник Цикл
	Строка.СуммаИтого = 0;	
КонецЦикла;
//

Запрос = Новый Запрос;

Запрос.Текст = ТекстЗапроса();
Запрос.Текст = Запрос.Текст + "
	|	И (ЕСТЬNULL(СписаниеПроживания.СуммаОплаты, 0) <> 0 
	| ИЛИ ЕСТЬNULL(СписаниеУслуги.СуммаОплаты, 0) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РезервС,
	|	НомерВРезерв";	
	
Запрос.УстановитьПараметр("ДатаС", ДатаС);	
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

МакетОбработки = Обработки.ЗакрытиеФинансовогоПериода.ПолучитьМакет("МакетСписание");

Область = МакетОбработки.ПолучитьОбласть("Заголовок");
ОтельСсылка = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Отель = ОтельСсылка.Наименование;
Область.Параметры.Отель = Отель;
Область.Параметры.ДатаС = Формат(ДатаС, "ДФ=dd.MM.yy");
Область.Параметры.ДатаПо = Формат(ДатаПо, "ДФ=dd.MM.yy");
ТабДок.Вывести(Область);

Область = МакетОбработки.ПолучитьОбласть("Шапка|Лево");
ТабДок.Вывести(Область);

Для Каждого Строка Из УслугиРодительСправочник Цикл
	ОбластьУслуги = МакетОбработки.ПолучитьОбласть("Шапка|Услуга");
	ОбластьУслуги.Параметры.ШапкаУслуга = Строка.ЗаголовокОтчеты;
	ТабДок.Присоединить(ОбластьУслуги);
КонецЦикла;

//Возврат ТабДок_1;

НомерСтрокиШапкаСписание = ТабДок.ВысотаТаблицы;     

//Данные.Очистить();
НомерКомментарий_Списание = Область.ШиринаТаблицы;
НомерСтрокиШапкаСписание = ТабДок.ВысотаТаблицы;

НомерКолонкиСуммаПроживание = 10;
НомерКолонкиСуммаУслуги = 12;

Для Каждого Строка Из ТЗ Цикл
	Область = МакетОбработки.ПолучитьОбласть("Строка|Лево");
	
	Область.Параметры.Заполнить(Строка);
	Область.Параметры.РезервС = Формат(Строка.РезервС, "ДФ=dd.MM.yy");
	Область.Параметры.РезервПо = Формат(Строка.РезервПо, "ДФ=dd.MM.yy");
	
	Область.Параметры.Заявка = Строка.ЗаявкаНаБронирование.Номер + " от " + Формат(Строка.ЗаявкаНаБронирование.Дата, "ДФ=dd.MM.yy");
	Область.Параметры.ЗаявкаНаБронирование = Строка.ЗаявкаНаБронирование;
	
	Если Строка.СуммаПроживаниеСчета <> Строка.СуммаПроживание Тогда
		Область.Область(1, НомерКолонкиСуммаПроживание, 1, НомерКолонкиСуммаПроживание).ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	Если Строка.СуммаУслугиСчета <> Строка.СуммаУслуги Тогда
		Область.Область(1, НомерКолонкиСуммаУслуги, 1, НомерКолонкиСуммаУслуги).ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	//
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
	                      |	СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации КАК ДокументОплатыВидОперации,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга КАК Услуга,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД КАК ДолгиГУИД
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                      |ГДЕ
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = &ДокументДолг
	                      |	И ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
	                      |	И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
	                      |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
	                      |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга,
	                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДокументОплатыВидОперации");

	Запрос.УстановитьПараметр("ДокументДолг", Строка.ДокументДолг); 

	ТЗ_СписанияДолгиГУИД = Запрос.Выполнить().Выгрузить();
	
	ТЗ_Списания = ТЗ_СписанияДолгиГУИД.Скопировать();
	ТЗ_Списания.Свернуть("Ссылка, ДокументОплатыВидОперации", "СуммаОплаты");  
	
	Если ТЗ_Списания.Количество() = 1 Тогда  
		Область.Параметры.ВидОперации = ТЗ_Списания[0].ДокументОплатыВидОперации;
	КонецЕсли;	
	//	
	
	//ИмяОбласти = "R1C" + Строка(НомерКомментарий_Списание);
	//Область.Область(ИмяОбласти).Значение = Строка.КомментарийОтветственного;
	ТабДок.Вывести(Область);
	
	//НоваяСтрока = ДанныеСписание.Добавить();        
	//ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	//	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронирование.Ссылка КАК ДокументДолг,
	                      |	ДопУслугиОплаты.Услуга КАК Услуга,
	                      |	ЕСТЬNULL(ДопУслугиОплаты.СуммаДолг, 0) КАК СуммаДолг,
	                      |	ЕСТЬNULL(ДопУслугиОплаты.СуммаОплаты, 0) КАК СуммаОплаты
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
	                      |			ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
	                      |			ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК СуммаДолг,
	                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты
	                      |		ИЗ
	                      |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
	                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
	                      |				ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка
	                      |					И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД
	                      |		ГДЕ
	                      |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
	                      |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
	                      |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
	                      |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))) КАК ДопУслугиОплаты
	                      |		ПО ЗаявкаНаБронирование.Ссылка = ДопУслугиОплаты.Ссылка
	                      |ГДЕ
	                      |	ЗаявкаНаБронирование.Ссылка = &ДокументДолг");

	Запрос.УстановитьПараметр("ДокументДолг", Строка.ДокументДолг); 
	ТЗ_Услуги = Запрос.Выполнить().Выгрузить();	
		
	ТЗ_УслугиРодитель = ТЗ_Услуги.Скопировать();
	ТЗ_УслугиРодитель.Колонки.Добавить("УслугаРодитель");
	Для Каждого СтрокаУслуга Из ТЗ_УслугиРодитель Цикл 
		Результат = Справочники.ДопУслуги.ПустаяСсылка();
		Ссылка = СтрокаУслуга.Услуга; 
		ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
		
		СтрокаУслуга.УслугаРодитель = Результат;	
	КонецЦикла;	
	ТЗ_УслугиРодитель.Свернуть("ДокументДолг, УслугаРодитель", "СуммаДолг, СуммаОплаты");

	Для каждого СтрокаУслугиСправочник Из УслугиРодительСправочник Цикл
		ОбластьУслуга = МакетОбработки.ПолучитьОбласть("Строка|Услуга");
		
		ОтборСтроки = Новый Структура("ДокументДолг, УслугаРодитель", Строка.ДокументДолг, СтрокаУслугиСправочник.УслугаРодитель);
		СтрокиУслугиРодитель = ТЗ_УслугиРодитель.НайтиСтроки(ОтборСтроки);
		Если СтрокиУслугиРодитель.Количество() > 0 Тогда 
			СтрокиУслугиРодитель = СтрокиУслугиРодитель[0]; 
			ОбластьУслуга.Параметры.СуммаУслуга = СтрокиУслугиРодитель.СуммаОплаты;
			
			СтрокаУслугиСправочник.СуммаИтого = СтрокаУслугиСправочник.СуммаИтого + СтрокиУслугиРодитель.СуммаОплаты; 
		КонецЕсли;
		
		ТабДок.Присоединить(ОбластьУслуга);
		
	КонецЦикла;
	
	Если ТЗ_Списания.Количество() > 1 Тогда
	
		Для Каждого СтрокаСписания Из ТЗ_Списания Цикл
			Область = МакетОбработки.ПолучитьОбласть("СтрокаДополнительно|Лево");
			Область.Параметры.ВидОперации = СтрокаСписания.ДокументОплатыВидОперации;  
			Область.Параметры.СуммаСписания = СтрокаСписания.СуммаОплаты;  
			
			ОтборСтроки = Новый Структура("Ссылка, ДокументОплатыВидОперации, Услуга"
				, СтрокаСписания.Ссылка, СтрокаСписания.ДокументОплатыВидОперации, Ложь);
			ТЗ_СписанияПроживания = ТЗ_СписанияДолгиГУИД.Скопировать(ОтборСтроки);
			ТЗ_СписанияПроживания.Свернуть( ,"СуммаОплаты");
			Если ТЗ_СписанияПроживания.Количество() > 0 Тогда
				СтрокаСписанияпроживание = ТЗ_СписанияПроживания[0]; 
				Область.Параметры.СуммаСписанияПроживание = СтрокаСписанияпроживание.СуммаОплаты;  
			КонецЕсли;		
			
			ТабДок.Вывести(Область);
			
			
			//	
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ЗаявкаНаБронирование.Ссылка КАК ДокументДолг,
			                      |	ДопУслугиОплаты.Услуга КАК Услуга,
			                      |	ЕСТЬNULL(ДопУслугиОплаты.СуммаДолг, 0) КАК СуммаДолг,
			                      |	ЕСТЬNULL(ДопУслугиОплаты.СуммаОплаты, 0) КАК СуммаОплаты
			                      |ИЗ
			                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			                      |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
			                      |			ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
			                      |			ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК СуммаДолг,
			                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты
			                      |		ИЗ
			                      |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
			                      |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
			                      |				ПО ЗаявкаНаБронированиеДопУслуги.Ссылка = ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка
			                      |					И ЗаявкаНаБронированиеДопУслуги.ГУИД = ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД
			                      |		ГДЕ
			                      |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
			                      |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
			                      |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
			                      |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))
			                      |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД В(&ДолгиГУИД)) КАК ДопУслугиОплаты
			                      |		ПО ЗаявкаНаБронирование.Ссылка = ДопУслугиОплаты.Ссылка
			                      |ГДЕ
			                      |	ЗаявкаНаБронирование.Ссылка = &ДокументДолг");

			Запрос.УстановитьПараметр("ДокументДолг", Строка.ДокументДолг); 
			
			ОтборСтроки = Новый Структура("Ссылка, ДокументОплатыВидОперации, Услуга"
				, СтрокаСписания.Ссылка, СтрокаСписания.ДокументОплатыВидОперации, Истина);
				
			ТЗ_СписанияУслуги = ТЗ_СписанияДолгиГУИД.Скопировать(ОтборСтроки);	
			ДолгиГУИД = ТЗ_СписанияУслуги.ВыгрузитьКолонку("ДолгиГУИД");		
			Запрос.УстановитьПараметр("ДолгиГУИД", ДолгиГУИД); 
			
			ТЗ_Услуги = Запрос.Выполнить().Выгрузить();	
				
			ТЗ_УслугиРодитель = ТЗ_Услуги.Скопировать();
			ТЗ_УслугиРодитель.Колонки.Добавить("УслугаРодитель");
			Для Каждого СтрокаУслуга Из ТЗ_УслугиРодитель Цикл 
				Результат = Справочники.ДопУслуги.ПустаяСсылка();
				Ссылка = СтрокаУслуга.Услуга; 
				ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
				
				СтрокаУслуга.УслугаРодитель = Результат;	
			КонецЦикла;	
			ТЗ_УслугиРодитель.Свернуть("ДокументДолг, УслугаРодитель", "СуммаДолг, СуммаОплаты");

			Для каждого СтрокаУслугиСправочник Из УслугиРодительСправочник Цикл
				ОбластьУслуга = МакетОбработки.ПолучитьОбласть("Строка|Услуга");
				
				ОтборСтроки = Новый Структура("ДокументДолг, УслугаРодитель", Строка.ДокументДолг, СтрокаУслугиСправочник.УслугаРодитель);
				СтрокиУслугиРодитель = ТЗ_УслугиРодитель.НайтиСтроки(ОтборСтроки);
				Если СтрокиУслугиРодитель.Количество() > 0 Тогда 
					СтрокиУслугиРодитель = СтрокиУслугиРодитель[0]; 
					ОбластьУслуга.Параметры.СуммаУслуга = СтрокиУслугиРодитель.СуммаОплаты;
				КонецЕсли;
				
				ТабДок.Присоединить(ОбластьУслуга);
				
			КонецЦикла;
		
		КонецЦикла;
	КонецЕсли;
	
КонецЦикла;

Область = МакетОбработки.ПолучитьОбласть("Подножие|Лево");
//Область.Параметры.СуммаЗаявки = ТЗ.Итог("СуммаЗаявки");
//Область.Параметры.СуммаПроживаниеСчета = ТЗ.Итог("СуммаПроживаниеСчета");
//Область.Параметры.СуммаПроживание = ТЗ.Итог("СуммаПроживание");
//Область.Параметры.СуммаУслугиСчета = ТЗ.Итог("СуммаУслугиСчета");
//Область.Параметры.СуммаУслуги = ТЗ.Итог("СуммаУслуги");
Область.Параметры.СуммаДолга = ТЗ.Итог("СуммаДолга");
СуммаСписанияПроживание = ТЗ.Итог("СуммаСписанияПроживание");
Область.Параметры.СуммаСписанияПроживание = СуммаСписанияПроживание;

СуммаСписанияУслуги = ТЗ.Итог("СуммаСписанияУслуги");
Область.Параметры.СуммаСписанияУслуги = СуммаСписанияУслуги;

СуммаСписания = ТЗ.Итог("СуммаСписания");
Область.Параметры.СуммаСписания = СуммаСписания;
ТабДок.Вывести(Область) ;

Для каждого СтрокаУслугиСправочник Из УслугиРодительСправочник Цикл
	ОбластьУслуга = МакетОбработки.ПолучитьОбласть("Подножие|Услуга");
	
	//ОтборСтроки = Новый Структура("ДокументДолг, УслугаРодитель", Строка.ДокументДолг, СтрокаУслугиСправочник.УслугаРодитель);
	//СтрокиУслугиРодитель = ТЗ_УслугиРодитель.НайтиСтроки(ОтборСтроки);
	//Если СтрокиУслугиРодитель.Количество() > 0 Тогда 
		//СтрокиУслугиРодитель = СтрокиУслугиРодитель[0]; 
		ОбластьУслуга.Параметры.СуммаУслуга = СтрокаУслугиСправочник.СуммаИтого;
	//КонецЕсли;
	
	ТабДок.Присоединить(ОбластьУслуга);
	
КонецЦикла;

////Сумма списания неоплаченных  доп.услуг - 11950, из них БАР/МИНИБАР - 11550, прачечная  - 400
//Запрос = Новый Запрос( "ВЫБРАТЬ
//                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
//                       |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
//                       |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты КАК СуммаОплаты
//                       |ИЗ
//                       |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
//                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
//                       |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеДопУслуги.Ссылка
//                       |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДолгиГУИД = ЗаявкаНаБронированиеДопУслуги.ГУИД
//                       |ГДЕ
//                       |	ЗаявкаНаБронированиеДопУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ
//                       |	И (ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
//                       |			ИЛИ ЗаявкаНаБронированиеДопУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
//                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо <= &ДатаПо
//                       |	И ЗаявкаНаБронированиеДопУслуги.Ссылка.РезервПо >= &ДатаС
//                       |	И ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
//                       |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ИСТИНА
//                       |	И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
//                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
//                       |			ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))");

//Запрос.УстановитьПараметр("ДатаС", ДатаС);	
//Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

//ТЗ_ДопУслуги = Запрос.Выполнить().Выгрузить();

//СуммаОплаты = 0;
//СуммаМинибар = 0;
//СуммаПрачечная = 0;
//Для Каждого Строка Из ТЗ_ДопУслуги Цикл
//		Результат = Справочники.ДопУслуги.ПустаяСсылка();
//		Ссылка = Строка.Услуга; 
//		ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
//		
//		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР 
//		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.МИНИБАР                 
//		Тогда
//			СуммаМинибар = СуммаМинибар + Строка.СуммаОплаты;
//		КонецЕсли;
//		
//		Если Строка.Услуга.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
//		ИЛИ Результат.ПрограммныйКод = Перечисления.ПрограммныйКодУслуги.ПРАЧЕЧНАЯ 
//		Тогда
//			СуммаПрачечная = СуммаПрачечная + Строка.СуммаОплаты;
//		КонецЕсли;
//		
//		СуммаОплаты = СуммаОплаты + Строка.СуммаОплаты;
//КонецЦикла;

//Область = МакетОбработки.ПолучитьОбласть("ИтогиУслуги");
//Область.Параметры.СуммаДопУслуг = СуммаОплаты; 
//Область.Параметры.СуммаМинибар = СуммаМинибар; 
//Область.Параметры.СуммаПрачечная = СуммаПрачечная; 
//ТабДок.Вывести(Область);

Область = МакетОбработки.ПолучитьОбласть("Итоги");
Область.Параметры.СуммаСписания = СуммаСписания; 
Область.Параметры.СуммаПроживание = СуммаСписанияПроживание; 
Область.Параметры.СуммаДопУслуг = СуммаСписанияУслуги; 
ТабДок.Вывести(Область);


//Область = МакетОбработки.ПолучитьОбласть("ПустаяОбласть");
//ТабДок_1.Вывести(Область);
//ТабДок_1.Вывести(Область);

//ТабДок_1.ФиксацияСверху = 1;
Возврат ТабДок;
КонецФункции

Функция ТекстЗапроса()
ТекстЗапроса = "ВЫБРАТЬ
               |	ЗаявкаНаБронирование.Ссылка КАК ЗаявкаНаБронирование,
               |	ЗаявкаНаБронирование.Ссылка КАК ДокументДолг,
               |	ЗаявкаНаБронирование.РезервС КАК РезервС,
               |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
               |	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
               |	ЗаявкаНаБронирование.Клиент КАК Клиент,
               |	ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
               |	ЗаявкаНаБронирование.Статус КАК Статус,
               |	ПроживаниеСумма.Сумма КАК СуммаПроживание,
               |	УслугиСумма.Сумма КАК СуммаУслуги,
               |	ЕСТЬNULL(ПроживаниеСумма.Сумма, 0) + ЕСТЬNULL(УслугиСумма.Сумма, 0) КАК СуммаЗаявки,
               |	ЕСТЬNULL(СчетаПроживание.СуммаДолг, 0) + ЕСТЬNULL(СчетаУслуги.СуммаДолг, 0) КАК СуммаЗаявкиСчета,
               |	СчетаПроживание.СуммаДолг КАК СуммаПроживаниеСчета,
               |	СчетаУслуги.СуммаДолг КАК СуммаУслугиСчета,
               |	СчетаПроживание.СуммаКЗакрытию КАК СуммаДолгаПроживание,
               |	СчетаУслуги.СуммаКЗакрытию КАК СуммаДолгаУслуги,
               |	СписаниеПроживания.СуммаОплаты КАК СуммаСписанияПроживание,
               |	СписаниеУслуги.СуммаОплаты КАК СуммаСписанияУслуги,
               |	ЕСТЬNULL(СписаниеПроживания.СуммаОплаты, 0) + ЕСТЬNULL(СписаниеУслуги.СуммаОплаты, 0) КАК СуммаСписания,
               |	ЕСТЬNULL(СчетаПроживание.СуммаКЗакрытию, 0) + ЕСТЬNULL(СчетаУслуги.СуммаКЗакрытию, 0) КАК СуммаДолга,
               |	ЗаявкаНаБронирование.КомментарийОтветственного КАК КомментарийОтветственного
               |ИЗ
               |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеПроживание.Ссылка) КАК ПроживаниеСумма
               |		ПО ЗаявкаНаБронирование.Ссылка = ПроживаниеСумма.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеДопУслуги.Количество * ЗаявкаНаБронированиеДопУслуги.Цена) КАК Сумма
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
               |		ГДЕ
               |			ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеДопУслуги.Ссылка) КАК УслугиСумма
               |		ПО ЗаявкаНаБронирование.Ссылка = УслугиСумма.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК СчетаПроживание
               |		ПО ЗаявкаНаБронирование.Ссылка = СчетаПроживание.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
               |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
               |		ГДЕ
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ИСТИНА
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК СчетаУслуги
               |		ПО ЗаявкаНаБронирование.Ссылка = СчетаУслуги.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
               |		ГДЕ
               |			ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
               |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ЛОЖЬ
               |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка) КАК СписаниеПроживания
               |		ПО ЗаявкаНаБронирование.Ссылка = СписаниеПроживания.Ссылка
               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
               |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
               |		ИЗ
               |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
               |		ГДЕ
               |			ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
               |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.Услуга = ИСТИНА
               |			И (ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Списание)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеЗачет)
               |					ИЛИ ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеДопУслуг))
               |		
               |		СГРУППИРОВАТЬ ПО
               |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка) КАК СписаниеУслуги
               |		ПО ЗаявкаНаБронирование.Ссылка = СписаниеУслуги.Ссылка
               |ГДЕ
               |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
               |	И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
               |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка))
               |	И ЗаявкаНаБронирование.РезервПо <= &ДатаПо
               |	И ЗаявкаНаБронирование.РезервПо >= &ДатаС";

Возврат ТекстЗапроса;
КонецФункции

Функция ПолныйОтчетНаСервере(ДатаС, ДатаПо, ДанныеДолги, НомерСтрокиШапкаДолги, НомерКомментарий_Долги) Экспорт
ТабДок = ЗаполнитьОтчетДолгиНаСервере(ДатаС, ДатаПо, ДанныеДолги, НомерСтрокиШапкаДолги, НомерКомментарий_Долги);

ТабДок1 = ЗаполнитьОтчетСписаниеНаСервере(ДатаС, ДатаПо);

ОбщийФункционалСервер.ВставитьТабличныйДокумент(ТабДок, ТабДок1);

Возврат ТабДок;
КонецФункции
