
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если Параметры.Свойство("ТекСообщение") Тогда	
	ТекСообщение = Параметры.ТекСообщение;
КонецЕсли;

Элементы.Надпись1.Заголовок=ТекСообщение.Текст;
КонецПроцедуры


&НаКлиенте
Процедура ОсновныеДействияФормыВыполнено___(Кнопка)
	//// Вставить содержимое обработчика.
	//Если ТекСообщение.Актуально тогда
	//ОбДок=ТекСообщение.ПолучитьОбъект();
	//ОбДок.Актуально=Ложь;
	//ОбДок.Выполнено=ТекущаяДата();
	//ОбДок.КтоВыполнил=ТекПол;
	//ОбДок.Записать(РежимЗаписиДокумента.Запись);
	//конецесли;
	//ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Выполнено(Команда)
ВыполненоНаСервере();

ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ВыполненоНаСервере()
Если ТекСообщение.Актуально тогда
	ОбДок=ТекСообщение.ПолучитьОбъект();
	ОбДок.Актуально=Ложь;
	ОбДок.Выполнено=ТекущаяДата();
	ОбДок.КтоВыполнил= ПараметрыСеанса.ТекущийПользователь;
	ОбДок.Записать(РежимЗаписиДокумента.Запись);
конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыЗакрыть___(Кнопка)
	//ОбДок=ТекСообщение.ПолучитьОбъект();
	//СтрКому=ОбДок.Кому.Найти(ТекПол,"Пользователь");
	//Если СтрКому<>Неопределено тогда
	//	СтрКому.ВремяСледующегоПоказа=ТекущаяДата()+ОбДок.Периодичность*60;
	//	ОбДок.Записать(РежимЗаписиДокумента.Запись);
	//конецесли;
	//ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьКоманда(Команда)
ЗакрытьКомандаНаСервере();

ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьКомандаНаСервере()
ОбДок=ТекСообщение.ПолучитьОбъект();

ТекПол = ПараметрыСеанса.ТекущийПользователь;

СтрКому=ОбДок.Кому.Найти(ТекПол,"Пользователь");
Если СтрКому<>Неопределено тогда
	СтрКому.ВремяСледующегоПоказа=ТекущаяДата()+ОбДок.Периодичность*60;
	ОбДок.Записать(РежимЗаписиДокумента.Запись);
конецесли;
КонецПроцедуры



