
Процедура ПередЗаписью(Отказ, Замещение) 
Если ЭтотОбъект.Количество() = 0 Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Тест.Измерение1 КАК Измерение1,
	                      |	Тест.Удалить КАК Удалить,
	                      |	Тест.Признак КАК Признак
	                      |ИЗ
	                      |	РегистрСведений.Тест КАК Тест
	                      |ГДЕ
	                      |	Тест.Измерение1 = &Измерение1");
	Запрос.УстановитьПараметр("Измерение1", Отбор.Измерение1.Значение);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	//ЭтотОбъект.ДополнительныеСвойства.Вставить("СтароеЗначение", Выборка.Измерение1);
	
	Признак_OldValue = Выборка.Признак;
	
	Если Выборка.Признак Тогда
		Узел = ПланыОбмена.ОбменТест.НайтиПоКоду("ТЕСТ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;	
Иначе
	//Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Измерение1") ТОгда
	//	Измерение1_OldValue = ЭтотОбъект.ДополнительныеСвойства.Измерение1;
	//КонецЕсли;	
	//Если ЭтотОбъект[0].ПолучательПлатежа = "ЧЕХОВ" Тогда	

	Если ЭтотОбъект[0].Признак Тогда
		Узел = ПланыОбмена.ОбменТест.НайтиПоКоду("ТЕСТ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;		//		
	//	Отказ = Истина;
	//КонецЕсли;	
	//ЭтотОбъект.ДополнительныеСвойства.Вставить("НовоеЗначение", ЭтотОбъект[0].Измерение1);
	
КонецЕсли;	
КонецПроцедуры

