
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТекущийПользватель = ПараметрыСеанса.ТекущийПользователь;
Если ТекущийПользватель.ТолькоПросмотр Тогда
	ЭтаФорма.ТолькоПросмотр = Истина;	
КонецЕсли;

Если Параметры.Свойство("ТолькоПочасоваяОплата") Тогда
	ТолькоПочасоваяОплата = Параметры.ТолькоПочасоваяОплата;	
КонецЕсли;

РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(Элементы.Заявки.КоманднаяПанель,"ЗаявкиУдалить");
РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(Элементы.Счета.КоманднаяПанель,"СчетаУдалить");

//ЗаполнитьНомерКоворкинг();
ЗаполнитьНомерКоворкингДерево();
	
Заявки.Параметры.УстановитьЗначениеПараметра("КоворкингНомер", Справочники.КоворкингНомера.ПустаяСсылка());
Счета.Параметры.УстановитьЗначениеПараметра("КоворкингЗаявка", Документы.КоворкингЗаявка.ПустаяСсылка());
Оплаты.Параметры.УстановитьЗначениеПараметра("КоворкингСчет", Документы.КоворкингСчета.ПустаяСсылка());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерКоворкинг()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК НомерКоворкинг,
                      |	КоворкингНомера.ПочасоваяОплата КАК ПочасоваяОплата
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА &ТолькоПочасоваяОплата
                      |				ТОГДА КоворкингНомера.ПочасоваяОплата = ИСТИНА
                      |			ИНАЧЕ ИСТИНА
                      |		КОНЕЦ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ПочасоваяОплата,
                      |	КоворкингНомера.Номер_пп");

Запрос.УстановитьПараметр("ТолькоПочасоваяОплата", ТолькоПочасоваяОплата);

ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = НомераКоворкинг.Добавить();
	НоваяСтрока.НомерКоворкинг = Строка.НомерКоворкинг; 
	НоваяСтрока.ПочасоваяОплата = Строка.ПочасоваяОплата; 
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерКоворкинг_1()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК НомерКоворкинг,
                      |	КоворкингНомера.ПочасоваяОплата КАК ПочасоваяОплата
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ПочасоваяОплата,
                      |	КоворкингНомера.Номер_пп");
                                    
ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = НомераКоворкинг.Добавить();
	НоваяСтрока.НомерКоворкинг = Строка.НомерКоворкинг; 
	НоваяСтрока.ПочасоваяОплата = Строка.ПочасоваяОплата; 
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерКоворкингДерево()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК НомерКоворкинг,
                      |	КоворкингНомера.Родитель КАК Родитель,
                      |	КоворкингНомера.ПочасоваяОплата КАК ПочасоваяОплата,
                      |	КоворкингНомера.Номер_пп КАК Номер_пп,
                      |	КоворкингНомера.ЭтоГруппа КАК ЭтоГруппа
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |	И ВЫБОР
                      |			КОГДА &ТолькоПочасоваяОплата
                      |				ТОГДА КоворкингНомера.ПочасоваяОплата = ИСТИНА
                      |			ИНАЧЕ ИСТИНА
                      |		КОНЕЦ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерКоворкинг ИЕРАРХИЯ");
                                    
Запрос.УстановитьПараметр("ТолькоПочасоваяОплата", ТолькоПочасоваяОплата);

ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией) ;
ЗначениеВРеквизитФормы(ТЗ, "НомерКоворкингДерево");

ДЗ = ДанныеФормыВЗначение(НомерКоворкингДерево,Тип("ДеревоЗначений"));
ДЗ.Строки.Сортировать("ПочасоваяОплата, Номер_пп");
ЗначениеВДанныеФормы(ДЗ, НомерКоворкингДерево);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерКоворкингДерево_1()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингНомера.Ссылка КАК НомерКоворкинг,
                      |	КоворкингНомера.Родитель КАК Родитель,
                      |	КоворкингНомера.ПочасоваяОплата КАК ПочасоваяОплата,
                      |	КоворкингНомера.Номер_пп КАК Номер_пп,
                      |	КоворкингНомера.ЭтоГруппа КАК ЭтоГруппа
                      |ИЗ
                      |	Справочник.КоворкингНомера КАК КоворкингНомера
                      |ГДЕ
                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерКоворкинг ИЕРАРХИЯ");
                                    
ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией) ;
ЗначениеВРеквизитФормы(ТЗ, "НомерКоворкингДерево");

ДЗ = ДанныеФормыВЗначение(НомерКоворкингДерево,Тип("ДеревоЗначений"));
ДЗ.Строки.Сортировать("ПочасоваяОплата, Номер_пп");
ЗначениеВДанныеФормы(ДЗ, НомерКоворкингДерево);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
УстановитьСчетаПользовательскиеНастройкиПорядок();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетаПользовательскиеНастройкиПорядок()
ЭлементыПользовательскихНастроек = Счета.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;

Для Каждого НастройкаСписка Из ЭлементыПользовательскихНастроек Цикл
    Если ТипЗнч(НастройкаСписка) = ТипЗнч(Счета.КомпоновщикНастроек.Настройки.Порядок) Тогда
        НастройкаСписка.Элементы.Очистить();
        УсловиеСортировкиДС = НастройкаСписка.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
        УсловиеСортировкиДС.Поле = Новый ПолеКомпоновкиДанных("ДатаС");
        УсловиеСортировкиДС.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
        УсловиеСортировкиДС.Использование = Истина;
    КонецЕсли;
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура НомераКоворкингВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Элементы.НомераКоворкинг.ТекущиеДанные;	
	
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
ПараметрыФормы.Вставить("Ключ", ТД.НомерКоворкинг);
	
ОткрытьФорму("Справочник.КоворкингНомера.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры
//

//
&НаКлиенте
Процедура НомерКоворкингДеревоПриАктивизацииСтроки(Элемент)
ТС = Элементы.НомерКоворкингДерево.ТекущаяСтрока;	
Если ТС = Неопределено Тогда 
	Заявки.Параметры.УстановитьЗначениеПараметра("КоворкингНомер", Неопределено);
	Счета.Параметры.УстановитьЗначениеПараметра("КоворкингЗаявка", Неопределено);
	Оплаты.Параметры.УстановитьЗначениеПараметра("КоворкингСчет", Неопределено);
	
	Возврат; 
КонецЕсли;

ТД = НомерКоворкингДерево.НайтиПоИдентификатору(ТС);
Если ТД.ЭтоГруппа Тогда 
	Заявки.Параметры.УстановитьЗначениеПараметра("КоворкингНомер", Неопределено);
	Счета.Параметры.УстановитьЗначениеПараметра("КоворкингЗаявка", Неопределено);
	Оплаты.Параметры.УстановитьЗначениеПараметра("КоворкингСчет", Неопределено);
	
	Возврат; 
КонецЕсли;

Заявки.Параметры.УстановитьЗначениеПараметра("КоворкингНомер", ТД.НомерКоворкинг);

Элементы.ЧасС.Видимость = ТД.ПочасоваяОплата;
Элементы.ЧасПо.Видимость = ТД.ПочасоваяОплата;
КонецПроцедуры
//

//
&НаКлиенте
Процедура НомераКоворкингПриАктивизацииСтроки(Элемент)
ТД = Элементы.НомераКоворкинг.ТекущиеДанные;
Если ТД = Неопределено Тогда 
	Заявки.Параметры.УстановитьЗначениеПараметра("КоворкингНомер", Неопределено);
	Счета.Параметры.УстановитьЗначениеПараметра("КоворкингЗаявка", Неопределено);
	Оплаты.Параметры.УстановитьЗначениеПараметра("КоворкингСчет", Неопределено);
	
	Возврат; 
КонецЕсли;
	
Заявки.Параметры.УстановитьЗначениеПараметра("КоворкингНомер", ТД.НомерКоворкинг);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗаявкиПриАктивизацииСтроки(Элемент)
ТД = Элементы.Заявки.ТекущиеДанные;
Если ТД = Неопределено Тогда 
	Счета.Параметры.УстановитьЗначениеПараметра("КоворкингЗаявка", Неопределено);
	Оплаты.Параметры.УстановитьЗначениеПараметра("КоворкингСчет", Неопределено);
	Возврат; 
КонецЕсли;
	
Счета.Параметры.УстановитьЗначениеПараметра("КоворкингЗаявка", ТД.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СчетаПриАктивизацииСтроки(Элемент)
ТД = Элементы.Счета.ТекущиеДанные;
Если ТД = Неопределено Тогда 
	Оплаты.Параметры.УстановитьЗначениеПараметра("КоворкингСчет", Неопределено);
	Возврат; 
КонецЕсли;
	
Оплаты.Параметры.УстановитьЗначениеПараметра("КоворкингСчет", ТД.Ссылка);
КонецПроцедуры
//

//// + Заявки
&НаКлиенте
Процедура ЗаявкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаявку(Команда)
ТС = Элементы.НомерКоворкингДерево.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ТД = НомерКоворкингДерево.НайтиПоИдентификатору(ТС);
НомерКоворкинг = ТД.НомерКоворкинг;

ЭтоГруппа = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(НомерКоворкинг, "ЭтоГруппа");
Если ЭтоГруппа Тогда Возврат; КонецЕсли;

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("КоворкингНомер", НомерКоворкинг);  

ОткрытьФорму("Документ.КоворкингЗаявка.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиПередУдалением(Элемент, Отказ)
ТД = Элементы.Заявки.ТекущиеДанные;
Заявка = ТД.Ссылка;

Отказ = КоворкингКлиент.ПроверкаУдаленияЗаявки(Заявка);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_ПодтвердитеУдаление(Результат, ДополнительныеПрарметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ТД = Элементы.Заявки.ТекущиеДанные;
Заявка = ТД.Ссылка;
УдалитьЗаявку(Заявка);
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаявку(Заявка) 
ЗаявкаОбъект = Заявка.ПолучитьОбъект();
ЗаявкаОбъект.Удалить();

Элементы.Заявки.Обновить();
КонецПроцедуры
// - Не используется
//// + Заявки


//// + Счета
&НаКлиенте
Процедура СчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ПараметрыФормы = Новый Структура;

КоворкингЗаявка = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ВыбраннаяСтрока, "КоворкингЗаявка");
ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока); 
ПараметрыФормы.Вставить("КоворкингЗаявка", КоворкингЗаявка); 

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_КоворкингСчета", ЭтаФорма);
ОткрытьФорму("Документ.КоворкингСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_КоворкингСчета(Результат, ДополнительныеПараметры) Экспорт
ОбновитьСчета();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСчета() Экспорт
Элементы.Счета.Обновить();	

Если ЗначениеЗаполнено(ТекущийСчет) Тогда 
	Элементы.Счета.ТекущаяСтрока = ТекущийСчет;
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьСчет(Команда)
ТД = Элементы.Заявки.ДанныеСтроки(Элементы.Заявки.ТекущаяСтрока);
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ПочасоваяОплата = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТД.Ссылка, "ПочасоваяОплата");
Если НЕ ПочасоваяОплата Тогда
	СледующийСчетДатаС = КоворкингСервер.СледующийСчетДатаС(ТД.Ссылка);

	Если СледующийСчетДатаС > ТД.ДатаПо Тогда
		Текст = "'Следующая 'Дата C' счета: " + Формат(СледующийСчетДатаС, "ДФ=dd.MM.yyyy")
			+ " БОЛЬШЕ 'Дата По' Заявки: " + Формат(ТД.ДатаПо, "ДФ=dd.MM.yyyy") + ".";
		ПоказатьПредупреждение(, Текст);
		
		Возврат;
		
		//Результат = Ждать ВопросАсинх("Дата счета: " + Формат(СледующийСчетДатаС, "ДФ=dd.MM.yyyy")
		//	+ " больше даты по Заявки: " + Формат(ТД.ДатаПо, "ДФ=dd.MM.yyyy") + "
		//	|
		//	|ПРОДОЛЖИТЬ ..."		
		//	, РежимДиалогаВопрос.ОКОтмена); 
		//Если Результат = КодВозвратаДиалога.Отмена Тогда СледующийСчетДатаС = Неопределено; Возврат; КонецЕсли;
	КонецЕсли;
КонецЕсли;

ДобавитьСчетНаСервере(ТД.Ссылка);
КонецПроцедуры

&НаСервере
Функция ЭтоПочасоваяОплата() Экспорт
	
КонецФункции

&НаСервере
Процедура ДобавитьСчетНаСервере(КоворкингЗаявка)
КоворкингЗаявкаОбъект = КоворкингЗаявка.ПолучитьОбъект();	

Если КоворкингЗаявкаОбъект.ПочасоваяОплата Тогда 
	ТекущийСчет = КоворкингСервер.ДобавитьСчетЧасы(КоворкингЗаявкаОбъект);
Иначе		
	ТекущийСчет = КоворкингСервер.ДобавитьСчетДни(КоворкингЗаявкаОбъект);
КонецЕсли;
Если ТекущийСчет = Неопределено Тогда Возврат; КонецЕсли; 

ОбновитьСчета();
КонецПроцедуры

//
&НаКлиенте
Процедура СчетаПередУдалением(Элемент, Отказ)
ТД = Элементы.Счета.ТекущиеДанные;
Счет = ТД.Ссылка;

Отказ = КоворкингКлиент.ПроверкаУдаленияСчета(Счет);
КонецПроцедуры
//
//// - Счета

//
&НаСервереБезКонтекста
Процедура ОплатыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
Для Каждого Строка Из Строки Цикл
	ДокументДолгОбъект = Строка.Значение.Данные.КоворкингСчет.ПолучитьОбъект();
		
	ОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(Строка.Значение.Данные.ДокументОплаты
		, ДокументДолгОбъект);	
	Строка.Значение.Данные.СуммаОстатокДокументаОплаты = ОстатокКРаспределению;  
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Элемент.ТекущиеДанные;	

ОплатыОбщееКлиент.ОткрытьДокументОплаты(ЭтаФорма, ТД.ДокументОплаты, Истина, Неопределено);
КонецПроцедуры

//


///////++++++++++++++++++++++++++++++++++++++++++++++++ 

//
&НаКлиенте
Процедура КонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ДанныеСтроки = Элементы.Контрагенты.ДанныеСтроки(ВыбраннаяСтрока);	
	
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("Ключ", ДанныеСтроки.Контрагент);
	
ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриАктивизацииСтроки(Элемент)
ТД = Элементы.Контрагенты.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	
Заявки.Параметры.УстановитьЗначениеПараметра("Контрагент", ТД.Контрагент);
КонецПроцедуры




//















