
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Вызов = Параметры.Свойство("Вызов");	
Если ЗаполнитьТаблицуДниРождения() И Вызов Тогда 
	Отказ = Истина;
	Возврат;
КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТаблицуДниРождения()
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
|	ЗаявкаНаБронирование.Клиент КАК Клиент,
|	ЗаявкаНаБронирование.РезервС КАК РезервС,
|	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
|	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
|	ЗаявкаНаБронирование.Клиент.ДатаРождения КАК КлиентДатаРождения
|ИЗ
|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК Клиенты
|		ПО ЗаявкаНаБронирование.Клиент = Клиенты.Ссылка
|ГДЕ
|	ЗаявкаНаБронирование.РезервС <= &ТекущаяДатаНачало
|	И ЗаявкаНаБронирование.РезервПо >= &ТекущаяДатаКонец
|	И ЗаявкаНаБронирование.Статус = &Статус";

ТекущаяДата = ТекущаяДата();
Запрос.УстановитьПараметр("ТекущаяДатаНачало", НачалоДня(ТекущаяДата));
Запрос.УстановитьПараметр("ТекущаяДатаКонец", КонецДня(ТекущаяДата));
Запрос.УстановитьПараметр("Статус", Перечисления.СтатусБрони.Проживает);
ТЗ = Запрос.Выполнить().Выгрузить();

ТЗКлиенты.Очистить();
Для каждого Строка Из ТЗ Цикл
	Если НЕ ЗначениеЗаполнено(Строка.РезервС) Тогда Продолжить; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Строка.РезервПо) Тогда Продолжить; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Строка.КлиентДатаРождения) Тогда Продолжить; КонецЕсли;
	
	Если Месяц(Строка.КлиентДатаРождения) >= Месяц(Строка.РезервС) 
	И 	День(Строка.КлиентДатаРождения) >= День(Строка.РезервС)
	И	Месяц(Строка.КлиентДатаРождения) <= Месяц(Строка.РезервПо) 
	И 	День(Строка.КлиентДатаРождения) <= День(Строка.РезервПо)
	Тогда
	   НоваяСтрока = ТЗКлиенты.Добавить();
	   НоваяСтрока.Клиент = Строка.Клиент;
	   НоваяСтрока.НомерВРезерв = Строка.НомерВРезерв;
	   НоваяСтрока.ДатаРождения = Строка.КлиентДатаРождения;
	КонецЕсли;
КонецЦикла;

Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
|	ЗаявкаНаБронирование.Клиент2 КАК Клиент2,
|	ЗаявкаНаБронирование.РезервС КАК РезервС,
|	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
|	ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
|	ЗаявкаНаБронирование.Клиент2.ДатаРождения КАК Клиент2ДатаРождения
|ИЗ
|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК Клиенты
|		ПО ЗаявкаНаБронирование.Клиент2 = Клиенты.Ссылка
|ГДЕ
|	ЗаявкаНаБронирование.РезервС <= &ТекущаяДатаНачало
|	И ЗаявкаНаБронирование.РезервПо >= &ТекущаяДатаКонец
|	И ЗаявкаНаБронирование.Статус = &Статус";

ТекущаяДата = ТекущаяДата();
Запрос.УстановитьПараметр("ТекущаяДатаНачало", НачалоДня(ТекущаяДата));
Запрос.УстановитьПараметр("ТекущаяДатаКонец", КонецДня(ТекущаяДата));
Запрос.УстановитьПараметр("Статус", Перечисления.СтатусБрони.Проживает);
ТЗ = Запрос.Выполнить().Выгрузить();

Для каждого Строка Из ТЗ Цикл
	Если НЕ ЗначениеЗаполнено(Строка.РезервС) Тогда Продолжить; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Строка.РезервПо) Тогда Продолжить; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Строка.Клиент2ДатаРождения) Тогда Продолжить; КонецЕсли;
	
	Если Месяц(Строка.Клиент2ДатаРождения) >= Месяц(Строка.РезервС) 
	И 	День(Строка.Клиент2ДатаРождения) >= День(Строка.РезервС)
	И	Месяц(Строка.Клиент2ДатаРождения) <= Месяц(Строка.РезервПо) 
	И 	День(Строка.Клиент2ДатаРождения) <= День(Строка.РезервПо)
	Тогда
	   НоваяСтрока = ТЗКлиенты.Добавить();
	   НоваяСтрока.Клиент = Строка.Клиент2;
   	   НоваяСтрока.НомерВРезерв = Строка.НомерВРезерв;
   	   НоваяСтрока.ДатаРождения = Строка.Клиент2ДатаРождения;
	КонецЕсли;
	
КонецЦикла;

Если ТЗКлиенты.Количество() = 0 Тогда Возврат Истина; КонецЕсли;

ТЗКлиенты.Сортировать("ДатаРождения, Клиент");

Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура Команда1(Команда)
////ЗаполнитьТаблицуДниРождения();
КонецПроцедуры
