//Перем ПредНомер,Цвет,Перерисовать;

//
&НаКлиенте
Процедура ДанныеПриВыводеСтроки___(Элемент, ОформлениеСтроки, ДанныеСтроки)
	//// Вставить содержимое обработчика.
	//Если Перерисовать тогда
	//Если ДанныеСтроки.НомерКомнаты<>ПредНомер тогда
	//	Цвет=Не Цвет;
	//	ПредНомер=ДанныеСтроки.НомерКомнаты;		
	//конецесли;
	//ДанныеСтроки.Цвет=Цвет;

	//конецесли;
	//Если ДанныеСтроки.Цвет тогда
	//	ОформлениеСтроки.ЦветФона=Новый Цвет(209,209,209);
	//конецесли;
	//
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
УсловноеОформлениеЗаполнить();
КонецПроцедуры

&НаСервере
Процедура  УсловноеОформлениеЗаполнить()
ЭлементОформления = УсловноеОформление.Элементы.Добавить();
 
// Зададим отбор (условия при которых будет выполнено оформление)
ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("ТЗ.Реквизит1");
ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("Объект.Данные.Цвет");
ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.Равно;
ЭлементОтбора.ПравоеЗначение    = Истина;
ЭлементОтбора.Использование     = Истина;
 
//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);
ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(209,209,209));
 
// Укажем какие поля (колонки) оформлять
ПолеОформления      = ЭлементОформления.Поля.Элементы.Добавить();
ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Данные");
ПолеОформления.Использование = Истина; 
 
ЭлементОформления.Использование = Истина;
КонецПроцедуры
//

&НаКлиенте
Процедура КнопкаВыполнитьНажатие___(Кнопка)
//Для каждого СтрТаб Из Данные Цикл
//	Если СтрТаб.Принять тогда
//		ОбДок=СтрТаб.Бронь.ПолучитьОбъект();
//		НовВ=ОбДок.ЗабытыеВещи.Добавить();
//		НовВ.ЗабытаяВещь=СтрТаб.ЗабытыеВещиОтГорничной;
//		 ОбДок.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
//		 НЗ=РегистрыСведений.УборкиНомеров.СоздатьНаборЗаписей();
//		 НЗ.Отбор.ВремяУброки.Установить(СтрТаб.ВремяУборки);
//		 НЗ.Отбор.Комната.Установить(СтрТаб.НомерКомнаты);
//		 НЗ.Прочитать();
//		 Для каждого Стр Из НЗ Цикл			 
//			 Стр.КомментарийАдминистрации=Стр.КомментарийАдминистрации+"<Забытые вещи>";
//		 КонецЦикла;      
//		 НЗ.Записать();
//		 
//	 конецесли;
//	
//		
//	

// КонецЦикла; 
// ЗаполнитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
ВыполнитьКомандаНаСервере();
ЗаполнитьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандаНаСервере()
Для каждого СтрТаб Из Объект.Данные Цикл
	Если СтрТаб.Принять тогда
		ОбДок=СтрТаб.Бронь.ПолучитьОбъект();
		НовВ=ОбДок.ЗабытыеВещи.Добавить();
		НовВ.ЗабытаяВещь=СтрТаб.ЗабытыеВещиОтГорничной;
		 ОбДок.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		 НЗ=РегистрыСведений.УборкиНомеров.СоздатьНаборЗаписей();
		 НЗ.Отбор.ВремяУброки.Установить(СтрТаб.ВремяУборки);
		 НЗ.Отбор.Комната.Установить(СтрТаб.НомерКомнаты);
		 НЗ.Прочитать();
		 Для каждого Стр Из НЗ Цикл			 
			 Стр.КомментарийАдминистрации=Стр.КомментарийАдминистрации+"<Забытые вещи>";
		 КонецЦикла;      
		 НЗ.Записать();    
		 
	 конецесли;
 КонецЦикла; 
 
 //ЗаполнитьТаблицу();
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьТаблицу____()
 //   Перерисовать=Истина;
 //   		//Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
 //   		//				|	ЗанятостьНомеров.Номер КАК НомерКомнаты,
 //   		//				|	ЗанятостьНомеров.Клиент КАК Гость,
 //   		//				|	УборкиНомеров.Горничная,
 //   		//				|	УборкиНомеров.Минибар КАК МиниБарОтГорничной,
 //   		//				|	ЗанятостьНомеров.Регистратор КАК Бронь,
 //   		//				|	УборкиНомеров.ВремяУброки КАК ВремяУборки
 //   		//				|ИЗ
 //   		//				|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
 //   		//				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
 //   		//				|		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
 //   		//				|			И (НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ))
 //   		//				|ГДЕ
 //   		//				|	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
 //   		//				|	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
 //   		//				|	И УборкиНомеров.Минибар <> """"
 //   		//				|	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	

 //   	Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
 //   	                    |	ЗанятостьНомеров.Номер КАК НомерКомнаты,
 //   	                    |	ЗанятостьНомеров.Клиент КАК Гость,
 //   	                    |	УборкиНомеров.Горничная,
 //   	                    |	УборкиНомеров.ЗабытыеВещи КАК МиниБарОтГорничной,
 //   	                    |	ЗанятостьНомеров.Регистратор КАК Бронь,
 //   	                    |	УборкиНомеров.ВремяУброки КАК ВремяУборки
 //   	                    |ИЗ
 //   	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
 //   	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
 //   	                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
 //   	                    |ГДЕ
 //   	                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
 //   	                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
 //   	                    |	И УборкиНомеров.ЗабытыеВещи <> """"
 //   	                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)
 //   	                    |
 //   	                    |ОБЪЕДИНИТЬ
 //   	                    |
 //   	                    |ВЫБРАТЬ РАЗЛИЧНЫЕ
 //   	                    |	ЗанятостьНомеров.Номер,
 //   	                    |	ЗанятостьНомеров.Клиент,
 //   	                    |	УборкиНомеров.Горничная,
 //   	                    |	УборкиНомеров.ЗабытыеВещи,
 //   	                    |	ЗанятостьНомеров.Регистратор,
 //   	                    |	УборкиНомеров.ВремяУброки
 //   	                    |ИЗ
 //   	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
 //   	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
 //   	                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
 //   	                    |ГДЕ
 //   	                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
 //   	                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период2
 //   	                    |	И УборкиНомеров.ЗабытыеВещи <> """"
 //   	                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	
 //   Запрос.УстановитьПараметр("Период",НачалоДня(ДатаУборки));
 //   Запрос.УстановитьПараметр("Период2",НачалоДня(ДатаУборки-86400));

 //   Запрос.УстановитьПараметр("КомментарийАдминистрации","%<Забытые вещи>%");

 //   ТЗ=Запрос.Выполнить().Выгрузить();
 //   Данные.Очистить();	
 //   Для каждого СтрМБ Из ТЗ Цикл
 //   
 //   	НовД=Данные.Добавить();
 //   	НовД.Бронь=СтрМБ.Бронь;
 //   	Новд.ВремяУборки=СтрМБ.ВремяУборки;
 //   	НовД.Горничная=СтрМБ.Горничная;
 //   	НовД.Гость=СтрМБ.Гость;
 //   	НовД.ЗабытыеВещиОтГорничной=СтрМБ.МиниБарОтГорничной;
 //   	НовД.НомерКомнаты=СтрМБ.НомерКомнаты;
 //   
 //   КонецЦикла;
 //   ЭлементыФормы.Данные.ОбновитьСтроки();
 //   Перерисовать=Ложь;
 //   Для каждого ТекСтр Из Данные Цикл
 //       ПоискСтр=Новый Структура("НомерКомнаты,ВремяУборки",ТекСтр.НомерКомнаты,ТекСтр.ВремяУборки);
 //   ТЗ=Данные.НайтиСтроки(ПоискСтр);
 //   Если ТЗ.Количество()=1 тогда
 //   	ТекСтр.Принять=Истина;
 //   конецесли;

 //   	
 //   
 //   КонецЦикла; 
 //
КонецФункции

&НаКлиенте
Функция ЗаполнитьТаблицу()
ЗаполнитьТаблицуНаСервере();
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуНаСервере()
	Перерисовать=Истина;
			////Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
			////				|	ЗанятостьНомеров.Номер КАК НомерКомнаты,
			////				|	ЗанятостьНомеров.Клиент КАК Гость,
			////				|	УборкиНомеров.Горничная,
			////				|	УборкиНомеров.Минибар КАК МиниБарОтГорничной,
			////				|	ЗанятостьНомеров.Регистратор КАК Бронь,
			////				|	УборкиНомеров.ВремяУброки КАК ВремяУборки
			////				|ИЗ
			////				|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
			////				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
			////				|		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
			////				|			И (НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ))
			////				|ГДЕ
			////				|	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
			////				|	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
			////				|	И УборкиНомеров.Минибар <> """"
			////				|	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	

	Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
                    |	ЗанятостьНомеров.Номер КАК НомерКомнаты,
                    |	ЗанятостьНомеров.Клиент КАК Гость,
                    |	УборкиНомеров.Горничная,
                    |	УборкиНомеров.ЗабытыеВещи КАК МиниБарОтГорничной,
                    |	ЗанятостьНомеров.Регистратор КАК Бронь,
                    |	УборкиНомеров.ВремяУброки КАК ВремяУборки
                    |ИЗ
                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
                    |ГДЕ
                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период
                    |	И УборкиНомеров.ЗабытыеВещи <> """"
                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)
                    |
                    |ОБЪЕДИНИТЬ
                    |
                    |ВЫБРАТЬ РАЗЛИЧНЫЕ
                    |	ЗанятостьНомеров.Номер,
                    |	ЗанятостьНомеров.Клиент,
                    |	УборкиНомеров.Горничная,
                    |	УборкиНомеров.ЗабытыеВещи,
                    |	ЗанятостьНомеров.Регистратор,
                    |	УборкиНомеров.ВремяУброки
                    |ИЗ
                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УборкиНомеров КАК УборкиНомеров
                    |		ПО ЗанятостьНомеров.Номер = УборкиНомеров.Комната
                    |ГДЕ
                    |	НАЧАЛОПЕРИОДА(УборкиНомеров.ВремяУброки, ДЕНЬ) = &Период
                    |	И НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) = &Период2
                    |	И УборкиНомеров.ЗабытыеВещи <> """"
	                    |	И (НЕ УборкиНомеров.КомментарийАдминистрации ПОДОБНО &КомментарийАдминистрации)");	
	Запрос.УстановитьПараметр("Период",НачалоДня(Объект.ДатаУборки));
	Запрос.УстановитьПараметр("Период2",НачалоДня(Объект.ДатаУборки-86400));

	Запрос.УстановитьПараметр("КомментарийАдминистрации","%<Забытые вещи>%");

	ТЗ=Запрос.Выполнить().Выгрузить();
	Объект.Данные.Очистить();
	
	// + ПСН
	ПредНомер=Справочники.НомернойФонд.ПустаяСсылка();
	Цвет=Ложь;	
	// + ПСН

	Для каждого СтрМБ Из ТЗ Цикл
	
		НовД=Объект.Данные.Добавить();
		НовД.Бронь=СтрМБ.Бронь;
		Новд.ВремяУборки=СтрМБ.ВремяУборки;
		НовД.Горничная=СтрМБ.Горничная;
		НовД.Гость=СтрМБ.Гость;
		НовД.ЗабытыеВещиОтГорничной=СтрМБ.МиниБарОтГорничной;
		НовД.НомерКомнаты=СтрМБ.НомерКомнаты;
	
			// + ПСН
		//Если Перерисовать тогда
			Если НовД.НомерКомнаты<>ПредНомер тогда
				Цвет=Не Цвет;
				ПредНомер=НовД.НомерКомнаты;		
			конецесли;
			НовД.Цвет=Цвет;
		//КонецЕсли;		
		// - ПСН
		
	КонецЦикла;
	
	//ЭлементыФормы.Данные.ОбновитьСтроки();
	Элементы.Данные.Обновить();
	
	
	Для каждого ТекСтр Из Объект.Данные Цикл
	    ПоискСтр=Новый Структура("НомерКомнаты,ВремяУборки",ТекСтр.НомерКомнаты,ТекСтр.ВремяУборки);
		ТЗ=Объект.Данные.НайтиСтроки(ПоискСтр);
		Если ТЗ.Количество()=1 тогда
			ТекСтр.Принять=Истина;
		конецесли;
		
	КонецЦикла; 
 
КонецФункции

//
&НаКлиенте
Процедура ДатаУборкиПриИзменении___(Элемент)
	//Если Данные.Итог("Принять")>0 тогда
	//	Если Вопрос("Есть не сохраненные данные - перезаполнить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
	//		ЗаполнитьТаблицу();	
	//		
	//	конецесли;
	//иначе
	//	ЗаполнитьТаблицу();	
	//конецесли;
	//
КонецПроцедуры

&НаКлиенте
Процедура ДатаУборкиПриИзменении(Элемент)
//Если Данные.Итог("Принять")>0 тогда
Если ДанныеИтогПринять() тогда
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаЕстьНеСохраненныеДанные", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Есть не сохраненные данные - перезаполнить?",  РежимДиалогаВопрос.ДаНет);
	
	Возврат;
	//Если Вопрос("Есть не сохраненные данные - перезаполнить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
	//	ЗаполнитьТаблицу();	
	//	
	//конецесли;
иначе
	ЗаполнитьТаблицу();	
конецесли;
	
КонецПроцедуры  

&НаКлиенте
Функция ДанныеИтогПринять()
Для Каждого Строка Из Объект.Данные Цикл
	Если Строка.Принять Тогда Возврат Истина; КонецЕсли; 
КонецЦикла;

Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ЗавершениеВопросаЕстьНеСохраненныеДанные(Результат, ДополнительныеПараметры) Экспорт
//Если Вопрос("Есть не сохраненные данные - перезаполнить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
Если Результат = КодВозвратаДиалога.Да тогда
	ЗаполнитьТаблицу();	
конецесли;
	
КонецПроцедуры
//

Процедура ДанныеВыбор__(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Если Колонка.имя="Бронь" тогда
		Об=ВыбраннаяСтрока.Бронь.получитьОбъект();
		Об.ПолучитьФорму().открыть();
	конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.имя="ДанныеБронь" тогда
		
		//Об=ВыбраннаяСтрока.Бронь.получитьОбъект();
		//Об.ПолучитьФорму().открыть();
		
		Бронь =  Элемент.ТекущиеДанные.Бронь;

		ПараметрыФормы = Новый Структура("Ключ", Бронь);   	
		ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	конецесли;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

// + ПСН
&НаКлиенте
Процедура ДанныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
// - ПСН

&НаКлиенте
Процедура ДанныеПриОкончанииРедактирования___(Элемент, НоваяСтрока, ОтменаРедактирования)
//	ТекСтр=ЭлементыФормы.Данные.ТекущаяСтрока;
//	ПоискСтр=Новый Структура("НомерКомнаты,ВремяУборки",ТекСтр.НомерКомнаты,ТекСтр.ВремяУборки);
//	ТЗ=Данные.НайтиСтроки(ПоискСтр);
//	Если ТЗ.Количество()>1 тогда
//		Для каждого Стр Из ТЗ Цикл
//		
//			Если Стр.Бронь=ТекСтр.бронь тогда
//				Продолжить;
//			иначе
//				Стр.Принять=ложь;
//			конецесли;
//			
//		
//		КонецЦикла; 	
//	конецесли;
//ПредНомер=Справочники.НомернойФонд.ПустаяСсылка();
//Цвет=Ложь;
//Перерисовать=Ложь;
//	
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//ТекСтр=ЭлементыФормы.Данные.ТекущаяСтрока;
	ТекСтр=Элемент.ТекущиеДанные;
	
	ПоискСтр=Новый Структура("НомерКомнаты,ВремяУборки",ТекСтр.НомерКомнаты,ТекСтр.ВремяУборки);
	ТЗ=Объект.Данные.НайтиСтроки(ПоискСтр);
	Если ТЗ.Количество()>1 тогда
		Для каждого Стр Из ТЗ Цикл
		
			Если Стр.Бронь=ТекСтр.бронь тогда
				Продолжить;
			иначе
				Стр.Принять=ложь;
			конецесли;
			
		
		КонецЦикла; 	
	конецесли;
	
//ПредНомер=Справочники.НомернойФонд.ПустаяСсылка();
//Цвет=Ложь;
//Перерисовать=Ложь;
	
КонецПроцедуры





//

//ПредНомер=Справочники.НомернойФонд.ПустаяСсылка();
//Цвет=Ложь;
//Перерисовать=истина;
