
//
Процедура ОбработкаПроведения___(Отказ, Режим)
	////{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//// регистр Долги Приход
	//СуммаЗаПроживание=0;
	//Если Оплата.Количество()=0 тогда
	//	Движение = Движения.Деньги.Добавить();
	//	Движение.ВидДвижения=?(Приход,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
	//	Движение.Период = Дата;
	//	Движение.ВидОплаты = Перечисления.ВидОплаты.Безнал;
	//	Движение.Контрагент = ОтКого;
	//	Движение.Сумма = Сумма;
	//	Движение.ВидОперации = ВидОперации;
	//	Движение.КредитнаяКарта = КредитнаяКарта;
	//	Движение.ДокументОплаты = ДокументОплаты;
	//	Движение.Оплата=ДокументОплаты;	
	//	СуммаЗаПроживание=Сумма;
	//иначе
	//	
	//	Для каждого СтрОпл Из Оплата Цикл
	//		
	//		
	//		Движение = Движения.Деньги.Добавить();
	//		Движение.ВидДвижения=?(Приход,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
	//		Движение.Период = Дата;
	//		Движение.ВидОплаты = Перечисления.ВидОплаты.Безнал;
	//		Движение.Контрагент = ОтКого;
	//		Движение.Сумма = СтрОпл.Сумма;
	//		Движение.ВидОперации = ВидОперации;
	//		Движение.КредитнаяКарта = КредитнаяКарта;
	//		Движение.ДокументОплаты = ДокументОплаты;
	//		Движение.Оплата=СтрОпл.Оплата;
	//		СуммаЗаПроживание=СуммаЗаПроживание+?(ТипЗнч(ДокументОплаты)=Тип("ДокументСсылка.ЗаявкаНаБронирование"),СтрОпл.Сумма,0);	
	//	КонецЦикла; 	
	//	
	//конецесли;
	//Движение = Движения.Долги.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//Движение.Период = Дата;
	//Движение.Контрагент = ОтКого;
	//Движение.ДокументОплаты = ДокументОплаты;
	//Движение.Сумма = Сумма;
	////выгрузка в бонусную базу
	//Попытка
	//	КолВоБаллов=Цел(СуммаЗаПроживание/1000);
	//	Если КолВоБаллов>0 тогда
	//		СтрокаПодключения  = "File = ""C:\BONUS""; Usr=""Admin""; Pwd=""123"";";
	//		Ком = Новый COMОбъект("V82.COMConnector");	
	//		База = Ком.Connect(СтрокаПодключения);
	//		Если ДокументОплаты.Пустая() тогда
	//			Рез=База.СоздатьНачислениеБаллов(ОтКого.Код,"Начисление по банковскому документу " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yy"),КолВоБаллов);
	//		иначе
	//			Рез=База.СоздатьНачислениеБаллов(ОтКого.Код,"За проживание в номере " + ДокументОплаты.НомерВРезерв.Наименование + " с " + Формат(ДокументОплаты.РезервС, "ДФ=dd.MM.yy") + " по " + Формат(ДокументОплаты.РезервПо, "ДФ=dd.MM.yy"),КолВоБаллов);
	//		конецесли;
	//	конецесли;
	//Исключение
	//	
	//КонецПопытки;
	////}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
Ответ = ТекстОшибки();
Если ЗначениеЗаполнено(Ответ) Тогда
	ТекстСообщение = Ответ.ТекстСообщение; 
	
	ТекстСообщение = "ОШИБОЧНЫЕ ДАННЫЕ: " + ТекстСообщение;	
	ТекстСообщение = ТекстСообщение + ". Документ НЕ сохранен.";	
	
	Сообщить(ТекстСообщение);
	
	Отказ = Истина;
	Возврат;
КонецЕсли;	

Движение = Движения.Взаиморасчеты.Добавить();
Движение.ВидДвижения=?(Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);

Движение.Период = ДатаОплаты;

Движение.Контрагент = ОтКого;
Движение.Сумма = Сумма;
//Движение.СуммаКомисииРасчет = СуммаКомиссияРасчет;

Возврат;

////////////////////////////////////////////////////
//
СуммаЗаПроживание=0;
// Деньги	
Если ДолгиОплата.Количество()=0 тогда
	Движение = Движения.Деньги.Добавить();
	Движение.ВидДвижения=?(Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
	
	// + ПСН
	//Движение.Период = Дата;
	Движение.Период = ДатаОплаты;
	// - ПСН
	
	Движение.ВидОплаты = Перечисления.ВидОплаты.Безнал;
	Движение.Контрагент = ОтКого;
	Движение.Сумма = Сумма;
	Движение.ВидОперации = ВидОперации;
	//Движение.ДокументОплаты = ДокументДолг_Удалить;
	//Движение.Оплата=ДокументДолг_Удалить;	
	
	СуммаЗаПроживание=Сумма;
иначе
	
	Для каждого СтрОпл Из ДолгиОплата Цикл
		Движение = Движения.Деньги.Добавить();
		Движение.ВидДвижения=?(Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		
		// + ПСН
		//Движение.Период = Дата;
		Движение.Период = ДатаОплаты;
		// - ПСН
		
		Движение.ВидОплаты = Перечисления.ВидОплаты.Безнал;
		Движение.Контрагент = ОтКого;
		Движение.Сумма = СтрОпл.Сумма;
		Движение.ВидОперации = ВидОперации;
		//Движение.ДокументОплаты = ДокументДолг_Удалить;
		Движение.Оплата=СтрОпл.ДокументДолг;
		
		//СуммаЗаПроживание=СуммаЗаПроживание+?(ТипЗнч(ДокументДолг_Удалить)=Тип("ДокументСсылка.ЗаявкаНаБронирование"), СтрОпл.Сумма, 0);	
		СуммаЗаПроживание=СуммаЗаПроживание+?(ТипЗнч(СтрОпл.ДокументДолг)=Тип("ДокументСсылка.ЗаявкаНаБронирование"), СтрОпл.Сумма, 0);	
	КонецЦикла; 	
КонецЕсли;


////+ Долги	

Движение = Движения.Долги.Добавить();

Движение.ВидДвижения = ВидДвиженияНакопления.Расход;

// + ПСН
//Движение.Период = Дата;
Движение.Период = ДатаОплаты;
// - ПСН

Движение.Контрагент = ОтКого;
//Движение.ДокументДолг = ДокументДолг_Удалить;
Движение.Сумма = Сумма;
//// - Долги

//выгрузка в бонусную базу
Попытка
	КолВоБаллов=Цел(СуммаЗаПроживание/1000);
	Если КолВоБаллов>0 тогда
		//СтрокаПодключения  = "File = ""C:\BONUS""; Usr=""Admin""; Pwd=""123"";";
		//Ком = Новый COMОбъект("V82.COMConnector");	
		
		База = СлужебныеСервер.ConnectБаза_BONUS();;
		
		//Если ДокументДолг_Удалить.Пустая() тогда
		//	Рез=База.СоздатьНачислениеБаллов(ОтКого.Код,"Начисление по банковскому документу " 
		//		+ Номер + " от " + Формат(Дата, "ДФ=dd.MM.yy"),КолВоБаллов);
		//иначе
		//	Рез=База.СоздатьНачислениеБаллов(ОтКого.Код,"За проживание в номере " + ДокументДолг_Удалить.НомерВРезерв.Наименование 
		//		+ " с " + Формат(ДокументДолг_Удалить.РезервС, "ДФ=dd.MM.yy") 
		//		+ " по " + Формат(ДокументДолг_Удалить.РезервПо, "ДФ=dd.MM.yy"), КолВоБаллов);
		//конецесли;
		
	конецесли;
Исключение
	
КонецПопытки;
КонецПроцедуры
//

Функция ТекстОшибки() Экспорт
ТекстПредупреждение = "";	
ТекстСообщение = "";	
//Если НЕ ЗначениеЗаполнено(ДатаОплаты) Тогда
Если НЕ ЗначениеЗаполнено(ДатаОплаты) Тогда
	Текст =  "Дата оплаты - пусто"; 
	ТекстПредупреждение = ТекстПредупреждение + Символы.ПС + Текст;	
	ТекстСообщение = ТекстСообщение +  Текст + ", ";	
КонецЕсли;	

//Если НЕ ЗначениеЗаполнено(Сумма) Тогда	
//	Текст = "Сумма = 0";	
//	ТекстПредупреждение = ТекстПредупреждение + Символы.ПС + Текст;	
//	ТекстСообщение = ТекстСообщение +  Текст + ", ";	
//КонецЕсли;	

Если НЕ ЗначениеЗаполнено(ОтКого) Тогда	
	Текст = "От кого - пусто";
	ТекстПредупреждение = ТекстПредупреждение + Символы.ПС + Текст;	
	ТекстСообщение = ТекстСообщение +  Текст + ", ";	
КонецЕсли;	

//Если НЕ ЗначениеЗаполнено(ДокументОплаты) Тогда	
//	Текст = "Документ оплаты - пусто";	
//	ТекстПредупреждение = ТекстПредупреждение + Символы.ПС + Текст;	
//	ТекстСообщение = ТекстСообщение +  Текст + ", ";	
//КонецЕсли;	

Если ЗначениеЗаполнено(ТекстПредупреждение) Тогда
	ТекстСообщение = Лев(ТекстСообщение, СтрДлина(ТекстСообщение) - 2);
	Ответ = Новый Структура("ТекстПредупреждение, ТекстСообщение", ТекстПредупреждение, ТекстСообщение);  
Иначе	
	Ответ = Неопределено;
КонецЕсли;	

Возврат Ответ;
КонецФункции	

