
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр(); 	

Параметры.Свойство("ТолькоЛистОжидания", ТолькоЛистОжидания);

Параметры.Свойство("ЛистОжидания", ЛистОжидания);
КнопкаЛистОжидания = ЛистОжидания;

Если ТолькоЛистОжидания Тогда 
	Элементы.КнопкаЛистОжидания.Видимость = Ложь; 
	
	ЭтаФорма.Заголовок = "Лист ожидания";
	
	РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(ЭтаФорма.КоманднаяПанель,"ФормаСоздать");
	РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(ЭтаФорма.КоманднаяПанель,"ФормаСкопировать");
	РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(ЭтаФорма.КоманднаяПанель,"ФормаСоздатьНаОсновании");
	
Иначе
	ЭтаФорма.Заголовок = "Заявки на бронирование";
КонецЕсли;

РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(ЭтаФорма.КоманднаяПанель,"ФормаУдалить");

УсловноеОформлениеЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
СброситьПользовательскийОтборДинамическогоСписка(Список, "ЛистОжидания");

Если ТолькоЛистОжидания Тогда 
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЛистОжидания");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Истина;   
Иначе
	Если ЛистОжидания Тогда
		УстановитьПользовательскийОтборДинамическогоСписка(Список, "ЛистОжидания", Истина
			, ВидСравненияКомпоновкиДанных.Равно, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	КонецЕсли;
КонецЕсли;
	
ЛистОжиданияЦветКнопки();	
КонецПроцедуры

//
&НаСервере
Процедура УсловноеОформлениеЗагрузить()
УсловноеОформление.Элементы.Очистить();

ЭлементыТабНаФормеИмя = Элементы.Список.Имя;

ПутьКПолюОтбора = "Список.Остаток";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Больше;
ПравоеЗначение = 0;
Web_Цвета = WebЦвета.БледноЗеленый;

УсловноеОформлениеДобавитьПоле(
ЭлементыТабНаФормеИмя,ПутьКПолюОтбора,Вид_Сравнения, ПравоеЗначение, Web_Цвета );

ПутьКПолюОтбора = "Список.Остаток";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Меньше;
ПравоеЗначение = 0;
Web_Цвета = WebЦвета.БледноКрасноФиолетовый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	,ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета );
	
ПутьКПолюОтбора = "Список.ПометкаУдаления";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;
ПравоеЗначение = Истина;
Web_Цвета = WebЦвета.СветлоСерый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление
	,ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета )	
КонецПроцедуры
	
&НаСервере
Процедура УсловноеОформлениеДобавитьПоле(
	ЭлементыТабНаФормеИмя, ПутьКПолюОтбора, Вид_Сравнения, ПравоеЗначение, Web_Цвета)	
    
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();

    ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыТабНаФормеИмя);

    ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
    ОтборЭлемента.ВидСравнения = Вид_Сравнения;
	ОтборЭлемента.ПравоеЗначение = ПравоеЗначение;
	ОтборЭлемента.Использование  = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Web_Цвета);
	ЭлементОформления.Использование = Истина;
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", ТолькоПросмотр);	

КонецПроцедуры
//

//
&НаКлиенте
Процедура ЛистОжидания(Команда)
КнопкаЛистОжидания = НЕ КнопкаЛистОжидания; 
Если КнопкаЛистОжидания Тогда 
	УстановитьПользовательскийОтборДинамическогоСписка(Список, "ЛистОжидания", Истина
		, ВидСравненияКомпоновкиДанных.Равно, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
Иначе 
	СброситьПользовательскийОтборДинамическогоСписка(Список, "ЛистОжидания");
КонецЕсли;

ЛистОжиданияЦветКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЛистОжиданияЦветКнопки()
Если КнопкаЛистОжидания Тогда 
	Элементы.КнопкаЛистОжидания.ЦветФона = WebЦвета.Оранжевый;
Иначе 
	Элементы.КнопкаЛистОжидания.ЦветФона = ЦветФонаКнопки();
КонецЕсли;
КонецПроцедуры
//

&НаКлиенте
Процедура УстановитьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля, Значение, ВидСравнения, РежимОтображения)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				 Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НовыйЭлементОтбора = Неопределено Тогда
			НовыйЭлементОтбора = ПользовательскийОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
	
		НовыйЭлементОтбора.ВидСравнения = ВидСравнения;
		НовыйЭлементОтбора.Использование = Истина;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		НовыйЭлементОтбора.РежимОтображения = РежимОтображения;
		НовыйЭлементОтбора.ПравоеЗначение = Значение;
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СброситьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				 Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НовыйЭлементОтбора = Неопределено Тогда Возврат; КонецЕсли;
		ПользовательскийОтбор.Удалить(НовыйЭлементОтбора);
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦветФонаКнопки()
Возврат ЦветаСтиля.ЦветФонаКнопки; 	
КонецФункции

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
Если Элемент.ТекущиеДанные = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли;	

Заявка = Элемент.ТекущаяСтрока;

ТекстПредупреждения = "";

Если ЕстьЗаявкаГрупповыеСчета(Заявка) Тогда
	ТекстПредупреждения = "Есть Групповые счета в Заявке";
КонецЕсли;

Если ЕстьЗаявкаОплаты(Заявка) Тогда
	ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения, "Есть оплаты Заявки", Символы.ПС);
КонецЕсли;

Если ТекстПредупреждения <> "" Тогда
	ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Символы.ПС + "УДАЛЕНИЕ НЕ РАЗРЕШЕНО ...";
	
	ПоказатьПредупреждение(, ТекстПредупреждения); 
	
	Отказ = Истина;
	Возврат;
КонецЕсли;

ВопросПередУдалением(Заявка);
Отказ = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьЗаявкаОплаты(ЗаявкаСсылка)
ЕстьЗаявкаОплаты = (ЗаявкаСсылка.СчетаДетальноОплаты.Количество() > 0);	
Возврат ЕстьЗаявкаОплаты;	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьЗаявкаГрупповыеСчета(ЗаявкаСсылка)
Для Каждого Строка Из ЗаявкаСсылка.Счета Цикл
	Если ЗначениеЗаполнено(Строка.ГрупповойСчет) Тогда Возврат Истина; КонецЕсли;
КонецЦикла;

Возврат Ложь;	
КонецФункции

&НаКлиенте
Процедура ВопросПередУдалением(ЗаявкаСсылка)
ДопПараметры = Новый Структура("ЗаявкаСсылка", ЗаявкаСсылка);	
Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдаление", ЭтаФорма, ДопПараметры);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ...", РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдаление(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ЗаявкаСсылка = ДополнительныеПараметры.ЗаявкаСсылка;
УдалитьЗаявкуНаБронированиеНаСервере(ЗаявкаСсылка);
Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаявкуНаБронированиеНаСервере(ЗаявкаСсылка) 
ЗавякаОбъект = ЗаявкаСсылка.ПолучитьОбъект();	
ЗавякаОбъект.Удалить();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения_НеИспользуется(ИмяСобытия, Параметр, Источник)
Если ИмяСобытия = "ОткрытьЗаявкаНаБронированиеФормаСписка" Тогда
	Элементы.Список.ТекущаяСтрока = Параметр;
	
	ЭтаФорма.Активизировать();
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Дата;
КонецЕсли;		
КонецПроцедуры






// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++



