
Функция ПрочитатьСообщениеСИзменениями() Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки, Удалено, Добавлено, Заменено", Ложь, 0, "", 0, 0, 0);	
	
ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(Ссылка.Код);
//КаталогОбменаFTP = Константы.КаталогОбменаFTP.Получить();
КаталогОбменаFTP = ДанныеУзлаОбмена.КаталогОбменаFTP;

ИмяФайла = ПолучитьИмяВременногоФайла("xml");
  
ИмяФайлаФТП = ФТПСервер.ПолучитьИмяФайлаОбменаФТП(Ссылка, ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), КаталогОбменаFTP) ;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Загрузка из " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();
Сообщение.Текст = " – Считывается файл " + ИмяФайлаФТП;
Сообщение.Сообщить();

Ответ = ФТПСервер.ПолучитьФТПФайл(ИмяФайлаФТП, ИмяФайла
	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя , ДанныеУзлаОбмена.Пароль); 

//Если Результат.КодОшибки < 0 Тогда 
//	Сообщить("Ошибка чтения файла обмена по FTP: " + Результат.ОписаниеОшибки + 
//	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
//			
//	Возврат Истина;
//ИначеЕсли Результат.КодОшибки > 0 Тогда 
//	Возврат Ложь;
//КонецЕсли;

Если Ответ.Ошибка Тогда
	Если Ответ.КодОшибки = 1 Тогда 
		Сообщить(Ответ.ОписаниеОшибки);
	Иначе
		Сообщить("Ошибка чтения файла обмена по FTP: " + Ответ.ОписаниеОшибки + 
		". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
	КонецЕсли;
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = Ответ.КодОшибки;
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;

	Возврат Результат;
КонецЕсли;

Файл = Новый Файл(ИмяФайла);

Если Не Файл.Существует() Тогда Возврат Истина; КонецЕсли;

// Попытаться открыть файл.
// *** Чтение документов XML.
ЧтениеXML = Новый ЧтениеXML;
Попытка
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
Исключение
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Невозможно открыть файл обмена данными.";
	Сообщение.Сообщить();
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -10;
	Результат.ОписаниеОшибки = "Невозможно открыть файл обмена данными: " + ОписаниеОшибки();  // Ответ.ОписаниеОшибки;  // + Аудит

	Возврат Результат;
КонецПопытки;


// Загрузить данные из найденного файла.
// *** Инфраструктура сообщений.
ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();

// Прочитать заголовок сообщения обмена данными – файла XML.
Попытка
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
Исключение
	ТекстСообщения = ОписаниеОшибки();
	Индекс = СтрНайти(ТекстСообщения, "Номер");
	Если Индекс > 0 Тогда
		ТекстСообщения = Сред(ТекстСообщения, Индекс) + ". ЗАГРУЗКА ОТМЕНЕНА";
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -20;
	
	Если Индекс > 0 Тогда
		ОписаниеОшибки = ТекстСообщения;
	Иначе 
		ОписаниеОшибки = ОписаниеОшибки();
	КонецЕсли;
	Результат.ОписаниеОшибки = ОписаниеОшибки;

	Возврат Результат
КонецПопытки;
// Проверить, что сообщение предназначено для этого узла.
Если ЧтениеСообщения.Отправитель <> Ссылка Тогда
	//ВызватьИсключение "Неверный узел";
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -20;
	Результат.ОписаниеОшибки = "Неверный узел.";
	
	Возврат Результат;
КонецЕсли;

// Удалить регистрацию изменений для узла-отправителя сообщения.
// *** Служба регистрации изменений.
ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);

// Прочитать данные из сообщения в цикле. *** XML-сериализация.
УдаленоКоличество = 0;
ЗамененоКоличество = 0;
ДобавленоКоличество = 0;
Пока ОбменВыписка.ВозможностьЧтенияДанных(ЧтениеXML) Цикл
	// Прочитать очередное значение.
	Данные = ОбменВыписка.ПрочитатьДанные(ЧтениеXML);

	//// Проверить, нужно ли принимать сообщение от узла-отправителя. Если нет, отклонить изменения.
	//Если Не ОбменВыписка.ПринятьИзменения(ЧтениеСообщения.Отправитель, Данные) Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = Строка(Данные.Метаданные()) + ": " + Строка(Данные) + " – Изменения отклонены";

	//	Сообщение.Сообщить();
	//	Продолжить;
	//КонецЕсли;

	// Записать полученные данные.
	// + ПСН
	//Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
	//Данные.ОбменДанными.Загрузка = Истина;
	//Данные.Записать();
	
	Ответ = ОбменВыписка.ЗаписатьПолученныеДанные(Данные);	
	Если Ответ = -1 Тогда
		УдаленоКоличество = УдаленоКоличество + 1; 		
	ИначеЕсли Ответ = 0 Тогда
		ДобавленоКоличество = ДобавленоКоличество + 1; 		
	ИначеЕсли Ответ = 1 Тогда
		ЗамененоКоличество = ЗамененоКоличество + 1; 		
	КонецЕсли;	
	// - ПСН
КонецЦикла;

ЧтениеСообщения.ЗакончитьЧтение();
ЧтениеXML.Закрыть();

УдалитьФайлы(ИмяФайла);

Ответ = ФТПСервер.УдалитьФТПФайл(ИмяФайлаФТП, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя , ДанныеУзлаОбмена.Пароль);
Если Ответ.Ошибка Тогда
	Сообщить("Ошибка удаления файла FTP: " + Ответ.ОписаниеОшибки);
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = Ответ.КодОшибки;  // Код 30
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
КонецЕсли;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец загрузки ------------";
Сообщение.Сообщить();

//Результат = Новый Структура("Удалено, Добавлено, Заменено"
//	, УдаленоКоличество, ДобавленоКоличество, ЗамененоКоличество);

Результат.Удалено = УдаленоКоличество; 
Результат.Добавлено = ДобавленоКоличество; 
Результат.Заменено = ЗамененоКоличество; 

Возврат Результат;
КонецФункции

Функция ЗаписатьСообщениеПодтверждения() Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Выгрузка в узел " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();

// Получить имя файла обмена.
//ИмяФайла = ОбменВыписка.ПолучитьИмяФайлаОбмена(ПланыОбмена.Выписка.ЭтотУзел(), Ссылка);
ИмяФайла = ПолучитьИмяВременногоФайла("xml"); 

// Создать объект записи XML.
// *** ЗаписьXML-документов.
ЗаписьXML = Новый ЗаписьXML;
ЗаписьXML.ОткрытьФайл(ИмяФайла);
ЗаписьXML.ЗаписатьОбъявлениеXML();

// *** Инфраструктура сообщений.
ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);

// Записать соответствие пространств имен для сокращения размера файла сообщения
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = " Номер сообщения: " + ЗаписьСообщения.НомерСообщения;
Сообщение.Сообщить();

ЗаписьСообщения.ЗакончитьЗапись();
ЗаписьXML.Закрыть();

// + ПСН 
// Получить имя файла обмена.
ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(Ссылка.Код);
//КаталогОбменаFTP = Константы.КаталогОбменаFTP.Получить();
КаталогОбменаFTP = ДанныеУзлаОбмена.КаталогОбменаFTP;

ИмяФайлаФТП = ФТПСервер.ПолучитьИмяФайлаОбменаФТП(ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), Ссылка, КаталогОбменаFTP);

Ответ = ФТПСервер.ЗаписатьФТПФайл(ИмяФайла, ИмяФайлаФТП
	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя , ДанныеУзлаОбмена.Пароль); 
	
Если Ответ.Ошибка Тогда   
// + Аудит		
	//Сообщить("Ошибка записи файла обмена по FTP: " + Результат.ОписаниеОшибки + 
	//". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
	Сообщить("Ошибка записи файла обмена по FTP: " + Ответ.ОписаниеОшибки + 
	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
// - Аудит		

	Результат.Ошибка = Истина;
	Результат.КодОшибки = Ответ.КодОшибки;  
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
КонецЕсли;

 ~ВЫХОД:
УдалитьФайлы(ИмяФайла);
// - ПСН 

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец выгрузки ------------";
Сообщение.Сообщить();

Возврат Результат;
КонецФункции

// +++++
Процедура ЗаписатьСообщениеСИзменениями_Шаблон() Экспорт
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Выгрузка в узел " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();

// Получить имя файла обмена.
//ИмяФайла = ОбменВыписка.ПолучитьИмяФайлаОбмена(ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), Ссылка);
ИмяФайла = ФТПСервер.ПолучитьИмяФайлаОбмена_Пример(ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), Ссылка);

// Создать объект записи XML.
// *** ЗаписьXML-документов.
ЗаписьXML = Новый ЗаписьXML;
ЗаписьXML.ОткрытьФайл(ИмяФайла);
ЗаписьXML.ЗаписатьОбъявлениеXML();

// *** Инфраструктура сообщений.
ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);

// Записать соответствие пространств имен для сокращения размера файла сообщения
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = " Номер сообщения: " + ЗаписьСообщения.НомерСообщения;
Сообщение.Сообщить();

// Получить выборку измененных данных.
// *** Механизм регистрации изменений.
////ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
////Пока ВыборкаИзменений.Следующий() Цикл
////	// Записать данные в сообщение *** XML-сериализация.
////	ЗаписатьXML(ЗаписьXML, ВыборкаИзменений.Получить());
////КонецЦикла;

ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
Пока ВыборкаИзменений.Следующий() Цикл
	Данные = ВыборкаИзменений.Получить();

	// Проверить, нужен ли перенос данных. Если нет, то записать удаление этих данных.
	Если Не ОбменВыписка.НуженПереносДанных(ЗаписьСообщения.Получатель, Данные) Тогда
		ОбменВыписка.УдалениеДанных(Данные);
	КонецЕсли;  

	//// Записать данные в сообщение *** XML-сериализация.
	//ЗаписатьXML(ЗаписьXML, Данные);
	
	// Записать данные в сообщение *** XML-сериализация.
	ОбменВыписка.ЗаписатьДанные(ЗаписьXML, Данные);	
КонецЦикла;

ЗаписьСообщения.ЗакончитьЗапись();
ЗаписьXML.Закрыть();

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец выгрузки ------------";
Сообщение.Сообщить();
КонецПроцедуры

