
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
ТекущаяСтрока = Элемент.ТекущаяСтрока;

ТаблицаРеквизит = ТаблицаДолгиОплата;
СписокПриАктивизацииСтрокиНаСервере(ТекущаяСтрока, ТаблицаРеквизит);
КопироватьДанныеФормы(ТаблицаРеквизит, ТаблицаДолгиОплата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриАктивизацииСтрокиНаСервере(ТекущаяСтрока, ТаблицаРеквизит)
Если ТекущаяСтрока = Неопределено Тогда Возврат; КонецЕсли;	
	
ТаблицаЗначение = ДанныеФормыВЗначение(ТаблицаРеквизит, Тип("ТаблицаЗначений"));	
	
ТекущийОбъект = ТекущаяСтрока.ПолучитьОбъект();
ТаблицаЗначение.Очистить();
Для Каждого Строка Из ТекущийОбъект.ДолгиОплата Цикл
	НоваяСтрока = ТаблицаЗначение.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

ЗначениеВДанныеФормы(ТаблицаЗначение, ТаблицаРеквизит);
КонецПроцедуры





