
#Если Клиент Тогда

// Функция - Вызвать асинхронно функцию
//
// Параметры:
//  ИмяФункции					 - Строка - Обязательный. Имя запускаемой функции
//									Варианты:
//									- Функция модуля менеджера, <ВидОбъекта>.<ИмяОбъекта>.<ИмяФункции>
//									- Функция неглобального серверного общего модуля, <ОбщийМодуль>.<ИмяФункции>
//									- Функция глобального серверного общего модуля, <ИмяФункции>
//  Параметры					 - Массив - Необязательный. Массив параметров передаваемый в запускаемую функцию 
//  Форма						 - Форма - Необязательный. Вызывающая форма, необходимо указывать если вы используете обработчик завершения
//									или обработчик хода выполнения
//  ИмяОбработчикаЗавершения	 - Строка - Необязательный. Имя экспортной процедуры модуля вызывающей формы
//									Параметры:
//									- АсинхронныйВызов (Структура) - структура содержащая описание асинхронного вызова
//									- Состояние (Строка) - состояние асинхронного вызова (Завершен,Отменен,ЗавершенСОшибкой)
//									- ВозвращенноеЗначение (Произвольный) - значение возвращенное запущенной функцией (Состояние=Завершен)
//									- ОписаниеОшибки (Строка) - описание произошедшей ошибки (Состояние=ЗавершенСОшибкой)									
//  ИмяОбработчикаХодаВыполнения - Строка - Необязательный. Имя экспортной процедуры модуля вызывающей формы
//									Параметры:
//									- АсинхронныйВызов (Структура) - структура содержащая описание асинхронного вызова
//									- ЗначениеХодаВыполнения (Произвольный) - новое значение хода выполнения
//									- СообщенияХодаВыполнения (Массив) - новые сообщения хода выполнения
//  Контекст					 - Произвольный - Необязательный. Произвольное значение сохраняемое в структуре асинхронного вызова в свойстве с именем Контекст
//  АвтоотменаЧерез				 - Число - Необязательный. Количество секунд после которого асинхронное выполение функции будет автоматически отменено
// Возвращаемое значение:
//  Структура - Структура содержащая описание асинхронного вызова
Функция ВызватьФункцию(ИмяФункции, Параметры = Неопределено, Форма = Неопределено, ИмяОбработчикаЗавершения = Неопределено, ИмяОбработчикаХодаВыполнения = Неопределено, Контекст = Неопределено, АвтоотменаЧерез = Неопределено) Экспорт
	
	Возврат АсинхронныеВызовыКлиент.ВызватьФункциюИлиПроцедуру(ИмяФункции, Истина, Параметры, Форма, ИмяОбработчикаЗавершения, ИмяОбработчикаХодаВыполнения, Контекст, АвтоотменаЧерез);
	
КонецФункции

// Функция - Вызвать асинхронно процедуру
//
// Параметры:
//  ИмяПроцедуры				 - Строка - Обязательный. Имя запускаемой процедуры
//									Варианты:
//									- Процедура модуля менеджера, <ВидОбъекта>.<ИмяОбъекта>.<ИмяПроцедуры>
//									- Процедура неглобального серверного общего модуля, <ОбщийМодуль>.<ИмяПроцедуры>
//									- Процедура глобального серверного общего модуля, <ИмяПроцедуры>
//  Параметры					 - Массив - Необязательный. Массив параметров передаваемый в запускаемую процедуру 
//  Форма						 - Форма - Необязательный. Вызывающая форма, необходимо указывать если вы используете обработчик завершения
//									или обработчик хода выполнения
//  ИмяОбработчикаЗавершения	 - Строка - Необязательный. Имя экспортной процедуры модуля вызывающей формы
//									Параметры:
//									- АсинхронныйВызов (Структура) - структура содержащая описание асинхронного вызова
//									- Состояние (Строка) - состояние асинхронного вызова (Завершен,Отменен,ЗавершенСОшибкой)
//									- ОписаниеОшибки (Строка) - описание произошедшей ошибки (Состояние=ЗавершенСОшибкой)									
//  ИмяОбработчикаХодаВыполнения - Строка - Необязательный. Имя экспортной процедуры модуля вызывающей формы
//									Параметры:
//									- АсинхронныйВызов (Структура) - структура содержащая описание асинхронного вызова
//									- ЗначениеХодаВыполнения (Произвольный) - новое значение хода выполнения
//									- СообщенияХодаВыполнения (Массив) - новые сообщения хода выполнения
//  Контекст					 - Произвольный - Необязательный. Произвольное значение сохраняемое в структуре асинхронного вызова в свойстве с именем Контекст
//  АвтоотменаЧерез				 - 	Число - Необязательный. Количество секунд после которого асинхронное выполение процедуры будет автоматически отменено
// Возвращаемое значение:
//  Структура - Структура содержащая описание асинхронного вызова
Функция ВызватьПроцедуру(ИмяПроцедуры, Параметры = Неопределено, Форма = Неопределено, ИмяОбработчикаЗавершения = Неопределено, ИмяОбработчикаХодаВыполнения = Неопределено, Контекст = Неопределено, АвтоотменаЧерез = Неопределено) Экспорт
	
	Возврат АсинхронныеВызовыКлиент.ВызватьФункциюИлиПроцедуру(ИмяПроцедуры, Ложь, Параметры, Форма, ИмяОбработчикаЗавершения, ИмяОбработчикаХодаВыполнения, Контекст, АвтоотменаЧерез);
	
КонецФункции

// Процедура - Асинхронно отменить один или несколько асинхронных вызовов.
//
// Параметры:
//  АсинхронныйВызов - Структура, УникальныйИдентификатор, Строка, Массив - Обязательный. В качестве параметра можно передать Структуру АсинхронныйВызов,
//						УникальныйИдентификатор вызова, Строку содержащую уникальный идентификатор вызова или Массив который может содержащать все ранее перечисленное						
Процедура Отменить(АсинхронныйВызовИлиМассив) Экспорт
	
	АсинхронныеВызовыКлиент.Отменить(АсинхронныйВызовИлиМассив);
	
КонецПроцедуры

// Процедура - Асинхронно оттменить все асинхронные вызовы.
Процедура ОтменитьВсе() Экспорт
	
	АсинхронныеВызовыКлиент.ОтменитьВсе();
	
КонецПроцедуры

#КонецЕсли

#Если Сервер Тогда
	
// Процедура - Обновить значение хода выполнения
//
// Параметры:
//  ЗначениеХодаВыполнения	 - Произвольный - Обязательный. Произвольное значение, последнее из которых, будет доступно в обработчике хода выполнения 
Процедура ОбновитьЗначениеХодаВыполнения(ЗначениеХодаВыполнения) Экспорт
		
	АсинхронныеВызовыСервер.ОбновитьЗначениеХодаВыполнения(ЗначениеХодаВыполнения);
	
КонецПроцедуры

// Процедура - Добавить сообщение хода выполнения
//
// Параметры:
//  Сообщение	 - Произвольный - Обязательный. Произвольное значение которое будет доступно в составе еще не обработанных сообщений в обработчике хода выполнения
Процедура ДобавитьСообщениеХодаВыполнения(Сообщение) Экспорт
	
	АсинхронныеВызовыСервер.ДобавитьСообщениеХодаВыполнения(Сообщение);
	
КонецПроцедуры

#КонецЕсли

