
&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
	//Макет=ПолучитьМакет("Макет");
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//ЗапросЗаездов=Новый Запрос("ВЫБРАТЬ
	//                           |	ЗаявкаНаБронирование.ВремяЗаездаТочное,
	//                           |	НАЧАЛОПЕРИОДА(ЗаявкаНаБронирование.ВремяЗаездаТочное, ДЕНЬ) КАК ДТ,
	//                           |	1 КАК КолВо
	//                           |ИЗ
	//                           |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                           |ГДЕ
	//                           |	ЗаявкаНаБронирование.ВремяЗаездаТочное МЕЖДУ &ДН И &ДК");
	//ЗапросЗаездов.УстановитьПараметр("ДН",НачалоДня(ДатаНачала));	
	//ЗапросЗаездов.УстановитьПараметр("ДК",КонецДня(ДатаОкончания));
	//ТЗЗаезд=ЗапросЗаездов.Выполнить().Выгрузить();
	//ТЗЗаезд.Колонки.Добавить("Категория");
	//ТЗЗаезд.Колонки.Добавить("ДеньНедели");
	//
	//Для Каждого СтрТЗ из ТЗЗаезд цикл
	////	Если Час(СтрТЗ.ВремяЗаездаТочное)<=5 тогда
	////		СтрТЗ.Категория=1;
	////	ИначеЕсли Час(СтрТЗ.ВремяЗаездаТочное)<=8 тогда
	////		СтрТЗ.Категория=2;
	////	ИначеЕсли Час(СтрТЗ.ВремяЗаездаТочное)<=12 тогда
	////		СтрТЗ.Категория=3;
	////	ИначеЕсли Час(СтрТЗ.ВремяЗаездаТочное)<=18 тогда
	////		СтрТЗ.Категория=4;
	////	ИначеЕсли Час(СтрТЗ.ВремяЗаездаТочное)<=21 тогда
	////		СтрТЗ.Категория=5;
	////
	////	Иначе
	////		СтрТЗ.Категория=6;
	////	КонецЕсли;
	//	СтрТЗ.Категория=Час(СтрТЗ.ВремяЗаездаТочное);
	//	СтрТЗ.ДеньНедели=СтрДеньН(ДеньНедели(СтрТЗ.ВремяЗаездаТочное));
	//КонецЦикла;
	//ТЗЗаезд.Свернуть("ДТ,ДеньНедели,Категория","КолВо");
	//ТЗЗаезд.Сортировать("ДТ,Категория");
	//Для каждого СтрТЗ из ТЗЗаезд цикл
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	//Дата	ДН	Категория	КолВо
	//	Обл.Параметры.Дата=Формат(СтрТЗ.ДТ, "ДФ=dd.MM.yy");
	//	Обл.Параметры.ДН=СтрТЗ.ДеньНедели;
	//	Обл.Параметры.Категория=СтрТЗ.Категория;
	//	Обл.Параметры.КолВо=СтрТЗ.КолВо;
	//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//КонецЦикла;
	//ТЗЗаезд.Свернуть("ДеньНедели,Категория","КолВо");
	//Обл=Макет.ПолучитьОбласть("Диаграмма");
	//Диаграмма=Обл.Рисунки.D1.Объект;

	//Диаграмма.ОбластьЗаголовка.Текст = "Статистика заездов";
	//
	//Диаграмма.КоличествоТочек=7;
	//Диаграмма.КоличествоСерий=24;
	//Для сч=0 по 23 цикл
	//	Диаграмма.Серии[сч].Текст="Категория "+ Формат(сч+1, "ЧГ=") + " (" + СтрКатегория(сч+1)+")";
	//КонецЦикла;
	//
	//Диаграмма.Точки[0].Текст="ПН";
	//ДН=0;
	//Для сч=0 по 23 цикл
	//	ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
	//	Если ПоискСтр.Количество()=0 тогда
	//		КолВо=0;
	//	Иначе
	//		КолВо=ПоискСтр[0].КолВо;
	//	КонецЕсли;
	//	
	//	Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	//КонецЦикла;
	//
	//Диаграмма.Точки[1].Текст="ВТ";
	//
	//ДН=1;
	//Для сч=0 по 23 цикл
	//	ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
	//	Если ПоискСтр.Количество()=0 тогда
	//		КолВо=0;
	//	Иначе
	//		КолВо=ПоискСтр[0].КолВо;
	//	КонецЕсли;
	//	
	//	Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	//КонецЦикла;

	//
	//Диаграмма.Точки[2].Текст="СР";
	//
	//ДН=2;
	//Для сч=0 по 23 цикл
	//	ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
	//	Если ПоискСтр.Количество()=0 тогда
	//		КолВо=0;
	//	Иначе
	//		КолВо=ПоискСтр[0].КолВо;
	//	КонецЕсли;
	//	
	//	Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	//КонецЦикла;

	//
	//Диаграмма.Точки[3].Текст="ЧТ";
	//
	//ДН=3;
	//Для сч=0 по 23 цикл
	//	ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
	//	Если ПоискСтр.Количество()=0 тогда
	//		КолВо=0;
	//	Иначе
	//		КолВо=ПоискСтр[0].КолВо;
	//	КонецЕсли;
	//	
	//	Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	//КонецЦикла;

	//Диаграмма.Точки[4].Текст="ПТ";
	//
	//ДН=4;
	//Для сч=0 по 23 цикл
	//	ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
	//	Если ПоискСтр.Количество()=0 тогда
	//		КолВо=0;
	//	Иначе
	//		КолВо=ПоискСтр[0].КолВо;
	//	КонецЕсли;
	//	
	//	Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	//КонецЦикла;

	//Диаграмма.Точки[5].Текст="СБ";
	//
	//ДН=5;
	//Для сч=0 по 23 цикл
	//	ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
	//	Если ПоискСтр.Количество()=0 тогда
	//		КолВо=0;
	//	Иначе
	//		КолВо=ПоискСтр[0].КолВо;
	//	КонецЕсли;
	//	
	//	Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	//КонецЦикла;

	//
	//Диаграмма.Точки[6].Текст="ВС";
	//
	//ДН=6;
	//Для сч=0 по 23 цикл
	//	ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
	//	Если ПоискСтр.Количество()=0 тогда
	//		КолВо=0;
	//	Иначе
	//		КолВо=ПоискСтр[0].КолВо;
	//	КонецЕсли;
	//	
	//	Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	//КонецЦикла;

	//
	//Диаграмма.Обновление=Истина;
	//ЭлементыФормы.ПолеДиаграмы.Очистить();
	//ЭлементыФормы.ПолеДиаграмы.Вывести(Обл);
	//
	//Макет=ПолучитьМакет("Макет1");
	//Обл=Макет.ПолучитьОбласть("расчет");
	//ТЗКат=ТЗЗаезд.Скопировать();
	//ТЗКат.свернуть("Категория","КолВо");
	//ТЗДН=ТЗЗаезд.Скопировать();
	//ТЗДН.свернуть("ДеньНедели","КолВо");

	//ОбщееКолВо=ТЗЗаезд.Итог("Колво");
	//Обл.Параметры.Колво=Формат(ОбщееКолВо, "ЧГ=");
	//
	//Если ОбщееКолВо>0 тогда
	//	Для сч=1 по 24 цикл
	//		ПоискКат=ТЗКат.Найти(сч-1,"Категория");
	//		Обл.Параметры["колво"+Строка(сч)]=?(ПоискКат=Неопределено,0,ПоискКат.КолВо);
	//		Обл.Параметры["проц"+Строка(сч)]=Формат(?(ПоискКат=Неопределено,0,ПоискКат.КолВо/ОбщееКолВо)*100, "ЧДЦ=0")+"%";
	//	КонецЦикла;
	//	ПоискДН=ТЗДН.Найти(СтрДеньН(1),"ДеньНедели");
	//	КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
	//	Обл.Параметры.пн="пн ("+ Формат(КолВоДН, "ЧГ=")+")";
	//	Если КолВоДН>0 тогда
	//		Для сч=1 по 24 цикл
	//			ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(1),сч-1));
	//			Обл.Параметры["пн"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
	//		КонецЦикла;

	//	КонецЕсли;
	//	
	//		ПоискДН=ТЗДН.Найти(СтрДеньН(2),"ДеньНедели");
	//	КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
	//	Обл.Параметры.вт="вт ("+ Формат(КолВоДН, "ЧГ=")+")";
	//	Если КолВоДН>0 тогда
	//		Для сч=1 по 24 цикл
	//			ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(2),сч-1));
	//			Обл.Параметры["вт"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
	//		КонецЦикла;

	//	КонецЕсли;

	//		ПоискДН=ТЗДН.Найти(СтрДеньН(3),"ДеньНедели");
	//	КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
	//	Обл.Параметры.ср="ср ("+ Формат(КолВоДН, "ЧГ=")+")";
	//	Если КолВоДН>0 тогда
	//		Для сч=1 по 24 цикл
	//			ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(3),сч-1));
	//			Обл.Параметры["ср"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
	//		КонецЦикла;
	//	КонецЕсли;

	//	
	//		ПоискДН=ТЗДН.Найти(СтрДеньН(4),"ДеньНедели");
	//	КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
	//	Обл.Параметры.чт="чт ("+ Формат(КолВоДН, "ЧГ=")+")";
	//	Если КолВоДН>0 тогда
	//		Для сч=1 по 24 цикл
	//			ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(4),сч-1));
	//			Обл.Параметры["чт"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
	//		КонецЦикла;
	//	КонецЕсли;

	//	
	//		ПоискДН=ТЗДН.Найти(СтрДеньН(5),"ДеньНедели");
	//	КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
	//	Обл.Параметры.пт="пт ("+ Формат(КолВоДН, "ЧГ=")+")";
	//	Если КолВоДН>0 тогда
	//		Для сч=1 по 24 цикл
	//			ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(5),сч-1));
	//			Обл.Параметры["пт"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
	//		КонецЦикла;

	//	КонецЕсли;

	//	
	//		ПоискДН=ТЗДН.Найти(СтрДеньН(6),"ДеньНедели");
	//	КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
	//	Обл.Параметры.сб="сб ("+ Формат(КолВоДН, "ЧГ=")+")";
	//	Если КолВоДН>0 тогда
	//        Для сч=1 по 24 цикл
	//			ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(6),сч-1));
	//			Обл.Параметры["сб"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
	//		КонецЦикла;

	//	КонецЕсли;

	//	
	//		ПоискДН=ТЗДН.Найти(СтрДеньН(7),"ДеньНедели");
	//	КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
	//	Обл.Параметры.вс="вс ("+ Формат(КолВоДН, "ЧГ=")+")";
	//	Если КолВоДН>0 тогда
	//		 Для сч=1 по 24 цикл
	//			ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(7),сч-1));
	//			Обл.Параметры["вс"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
	//		КонецЦикла;

	//	КонецЕсли;

	//	
	//	
	//			
	//конецесли;
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
	//Макет=ПолучитьМакет("Макет");
	Макет = Отчеты.ОтчетПоВремениЗаезда.ПолучитьМакет("Макет");
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	ЗапросЗаездов=Новый Запрос("ВЫБРАТЬ
	                           |	ЗаявкаНаБронирование.ВремяЗаездаТочное,
	                           |	НАЧАЛОПЕРИОДА(ЗаявкаНаБронирование.ВремяЗаездаТочное, ДЕНЬ) КАК ДТ,
	                           |	1 КАК КолВо
	                           |ИЗ
	                           |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                           |ГДЕ
	                           |	ЗаявкаНаБронирование.ВремяЗаездаТочное МЕЖДУ &ДН И &ДК");
	ЗапросЗаездов.УстановитьПараметр("ДН",НачалоДня(Отчет.ДатаНачала));	
	ЗапросЗаездов.УстановитьПараметр("ДК",КонецДня(Отчет.ДатаОкончания));
	ТЗЗаезд=ЗапросЗаездов.Выполнить().Выгрузить();
	ТЗЗаезд.Колонки.Добавить("Категория");
	ТЗЗаезд.Колонки.Добавить("ДеньНедели");
	
	Для Каждого СтрТЗ из ТЗЗаезд цикл
	//	Если Час(СтрТЗ.ВремяЗаездаТочное)<=5 тогда
	//		СтрТЗ.Категория=1;
	//	ИначеЕсли Час(СтрТЗ.ВремяЗаездаТочное)<=8 тогда
	//		СтрТЗ.Категория=2;
	//	ИначеЕсли Час(СтрТЗ.ВремяЗаездаТочное)<=12 тогда
	//		СтрТЗ.Категория=3;
	//	ИначеЕсли Час(СтрТЗ.ВремяЗаездаТочное)<=18 тогда
	//		СтрТЗ.Категория=4;
	//	ИначеЕсли Час(СтрТЗ.ВремяЗаездаТочное)<=21 тогда
	//		СтрТЗ.Категория=5;
	//
	//	Иначе
	//		СтрТЗ.Категория=6;
	//	КонецЕсли;
		СтрТЗ.Категория=Час(СтрТЗ.ВремяЗаездаТочное);
		СтрТЗ.ДеньНедели=СтрДеньН(ДеньНедели(СтрТЗ.ВремяЗаездаТочное));
	КонецЦикла;
	ТЗЗаезд.Свернуть("ДТ,ДеньНедели,Категория","КолВо");
	ТЗЗаезд.Сортировать("ДТ,Категория");
	Для каждого СтрТЗ из ТЗЗаезд цикл
		Обл=Макет.ПолучитьОбласть("Строка");
		//Дата	ДН	Категория	КолВо
		Обл.Параметры.Дата=Формат(СтрТЗ.ДТ, "ДФ=dd.MM.yy");
		Обл.Параметры.ДН=СтрТЗ.ДеньНедели;
		Обл.Параметры.Категория=СтрТЗ.Категория;
		Обл.Параметры.КолВо=СтрТЗ.КолВо;
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);
		
	КонецЦикла;
	ТЗЗаезд.Свернуть("ДеньНедели,Категория","КолВо");
    Обл=Макет.ПолучитьОбласть("Диаграмма");
	Диаграмма=Обл.Рисунки.D1.Объект;

	Диаграмма.ОбластьЗаголовка.Текст = "Статистика заездов";
	
	Диаграмма.КоличествоТочек=7;
	Диаграмма.КоличествоСерий=24;
	Для сч=0 по 23 цикл
		Диаграмма.Серии[сч].Текст="Категория "+ Формат(сч+1, "ЧГ=") + " (" + СтрКатегория(сч+1)+")";
	КонецЦикла;
	
	Диаграмма.Точки[0].Текст="ПН";
	ДН=0;
	Для сч=0 по 23 цикл
		ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
		Если ПоискСтр.Количество()=0 тогда
			КолВо=0;
		Иначе
			КолВо=ПоискСтр[0].КолВо;
		КонецЕсли;
		
		Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	КонецЦикла;
	
	Диаграмма.Точки[1].Текст="ВТ";
	
	ДН=1;
	Для сч=0 по 23 цикл
		ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
		Если ПоискСтр.Количество()=0 тогда
			КолВо=0;
		Иначе
			КолВо=ПоискСтр[0].КолВо;
		КонецЕсли;
		
		Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	КонецЦикла;

	
	Диаграмма.Точки[2].Текст="СР";
	
	ДН=2;
	Для сч=0 по 23 цикл
		ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
		Если ПоискСтр.Количество()=0 тогда
			КолВо=0;
		Иначе
			КолВо=ПоискСтр[0].КолВо;
		КонецЕсли;
		
		Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	КонецЦикла;

	
	Диаграмма.Точки[3].Текст="ЧТ";
	
	ДН=3;
	Для сч=0 по 23 цикл
		ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
		Если ПоискСтр.Количество()=0 тогда
			КолВо=0;
		Иначе
			КолВо=ПоискСтр[0].КолВо;
		КонецЕсли;
		
		Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	КонецЦикла;

	Диаграмма.Точки[4].Текст="ПТ";
	
	ДН=4;
	Для сч=0 по 23 цикл
		ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
		Если ПоискСтр.Количество()=0 тогда
			КолВо=0;
		Иначе
			КолВо=ПоискСтр[0].КолВо;
		КонецЕсли;
		
		Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	КонецЦикла;

	Диаграмма.Точки[5].Текст="СБ";
	
	ДН=5;
	Для сч=0 по 23 цикл
		ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
		Если ПоискСтр.Количество()=0 тогда
			КолВо=0;
		Иначе
			КолВо=ПоискСтр[0].КолВо;
		КонецЕсли;
		
		Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	КонецЦикла;

	
	Диаграмма.Точки[6].Текст="ВС";
	
	ДН=6;
	Для сч=0 по 23 цикл
		ПоискСтр=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(ДН+1),сч+1));
		Если ПоискСтр.Количество()=0 тогда
			КолВо=0;
		Иначе
			КолВо=ПоискСтр[0].КолВо;
		КонецЕсли;
		
		Диаграмма.УстановитьЗначение(ДН, сч,КолВо); 	
	КонецЦикла;

	
	Диаграмма.Обновление=Истина;
	                  
	//ЭлементыФормы.ПолеДиаграмы.Очистить();
	ПолеДиаграмы.Очистить();
	//ЭлементыФормы.ПолеДиаграмы.Вывести(Обл);
	ПолеДиаграмы.Вывести(Обл);
	
	//Макет=ПолучитьМакет("Макет1");
	Макет= Отчеты.ОтчетПоВремениЗаезда.ПолучитьМакет("Макет1");
	
	Обл=Макет.ПолучитьОбласть("расчет");
	ТЗКат=ТЗЗаезд.Скопировать();
	ТЗКат.свернуть("Категория","КолВо");
	ТЗДН=ТЗЗаезд.Скопировать();
	ТЗДН.свернуть("ДеньНедели","КолВо");

	ОбщееКолВо=ТЗЗаезд.Итог("Колво");
	Обл.Параметры.Колво=Формат(ОбщееКолВо, "ЧГ=");
	
	Если ОбщееКолВо>0 тогда
		Для сч=1 по 24 цикл
			ПоискКат=ТЗКат.Найти(сч-1,"Категория");
			Обл.Параметры["колво"+Строка(сч)]=?(ПоискКат=Неопределено,0,ПоискКат.КолВо);
			Обл.Параметры["проц"+Строка(сч)]=Формат(?(ПоискКат=Неопределено,0,ПоискКат.КолВо/ОбщееКолВо)*100, "ЧДЦ=0")+"%";
		КонецЦикла;
		ПоискДН=ТЗДН.Найти(СтрДеньН(1),"ДеньНедели");
		КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
		Обл.Параметры.пн="пн ("+ Формат(КолВоДН, "ЧГ=")+")";
		Если КолВоДН>0 тогда
			Для сч=1 по 24 цикл
				ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(1),сч-1));
				Обл.Параметры["пн"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
			КонецЦикла;

		КонецЕсли;
		
			ПоискДН=ТЗДН.Найти(СтрДеньН(2),"ДеньНедели");
		КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
		Обл.Параметры.вт="вт ("+ Формат(КолВоДН, "ЧГ=")+")";
		Если КолВоДН>0 тогда
			Для сч=1 по 24 цикл
				ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(2),сч-1));
				Обл.Параметры["вт"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
			КонецЦикла;

		КонецЕсли;

			ПоискДН=ТЗДН.Найти(СтрДеньН(3),"ДеньНедели");
		КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
		Обл.Параметры.ср="ср ("+ Формат(КолВоДН, "ЧГ=")+")";
		Если КолВоДН>0 тогда
			Для сч=1 по 24 цикл
				ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(3),сч-1));
				Обл.Параметры["ср"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
			КонецЦикла;
		КонецЕсли;

		
			ПоискДН=ТЗДН.Найти(СтрДеньН(4),"ДеньНедели");
		КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
		Обл.Параметры.чт="чт ("+ Формат(КолВоДН, "ЧГ=")+")";
		Если КолВоДН>0 тогда
			Для сч=1 по 24 цикл
				ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(4),сч-1));
				Обл.Параметры["чт"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
			КонецЦикла;
		КонецЕсли;

		
			ПоискДН=ТЗДН.Найти(СтрДеньН(5),"ДеньНедели");
		КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
		Обл.Параметры.пт="пт ("+ Формат(КолВоДН, "ЧГ=")+")";
		Если КолВоДН>0 тогда
			Для сч=1 по 24 цикл
				ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(5),сч-1));
				Обл.Параметры["пт"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
			КонецЦикла;

		КонецЕсли;

		
			ПоискДН=ТЗДН.Найти(СтрДеньН(6),"ДеньНедели");
		КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
		Обл.Параметры.сб="сб ("+ Формат(КолВоДН, "ЧГ=")+")";
		Если КолВоДН>0 тогда
            Для сч=1 по 24 цикл
				ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(6),сч-1));
				Обл.Параметры["сб"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
			КонецЦикла;

		КонецЕсли;

		
			ПоискДН=ТЗДН.Найти(СтрДеньН(7),"ДеньНедели");
		КолВоДН=?(ПоискДН=Неопределено,0,ПоискДН.КолВо);
		Обл.Параметры.вс="вс ("+ Формат(КолВоДН, "ЧГ=")+")";
		Если КолВоДН>0 тогда
			 Для сч=1 по 24 цикл
				ПоискДНКат=ТЗЗаезд.НайтиСтроки(Новый Структура("ДеньНедели,Категория",СтрДеньН(7),сч-1));
				Обл.Параметры["вс"+Строка(сч)]=Формат(?(ПоискДНКат.Количество()=0,0,ПоискДНКат[0].КолВо/КолВоДН)*100, "ЧДЦ=0")+"%";
			КонецЦикла;

		КонецЕсли;

		
		
				
	конецесли;
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл); 
	
	
КонецПроцедуры


&НаСервереБезКонтекста
ФункциЯ СтрКатегория(кат)
	Если Кат=1 тогда
		Возврат "00:00-01:00";
	ИначеЕсли Кат>=24 тогда
		Возврат "23:00-24:00";
	иначе
		Начало=?(Кат-1<10,"0"+Строка(Кат-1),Строка(Кат-1));
		Окончание=?(Кат<10,"0"+Строка(Кат),Строка(Кат));
		Возврат Начало+":00-"+Окончание+":00";
	КонецЕсли;
	
	//Если Кат=1 тогда
	//	Возврат "00:00-01:00";
	//ИначеЕсли Кат=2 тогда
	//	Возврат "06:00-08:00";
	//ИначеЕсли Кат=3 тогда
	//	Возврат "08:00-12:00";
	//ИначеЕсли Кат=4 тогда
	//	Возврат "12:00-18:00";
	//ИначеЕсли Кат=5 тогда
	//	Возврат "18:00-21:00";
	//Иначе
	//	Возврат "21:00-00:00";
	//КонецЕсли;	
КонецФункции

&НаСервереБезКонтекста
Функция СтрДеньН(ДН)
	Если ДН=1 тогда
		Возврат "пн";
	ИначеЕсли ДН=2 тогда
		Возврат "вт";
	ИначеЕсли ДН=3 тогда
		Возврат "ср";
	ИначеЕсли ДН=4 тогда
		Возврат "чт";
	ИначеЕсли ДН=5 тогда
		Возврат "пт";
	ИначеЕсли ДН=6 тогда
		Возврат "сб";
	ИначеЕсли ДН=7 тогда
		Возврат "вс";
	КонецЕсли;
КонецФункции

