
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаОтчетаС = ТекущаяДата();
ДатаОтчетаПо = ТекущаяДата();

СписокВыбора = ТипОплатыСписокВыбора();
ТипОплатыСписокВыбора = Элементы.ТипОплатыОтбор.СписокВыбора;
Для каждого Строка Из СписокВыбора Цикл
	ТипОплатыСписокВыбора.Добавить(Строка.Значение, Строка.Представление);
КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТипОплатыСписокВыбора() 
СписокВыбора = ОтчетыСервер.ТипОплатыСписокВыбора();
Возврат СписокВыбора;
КонецФункции

&НаСервере
Функция ТипОплатыСписокВыбора_1() 
СписокВыбора = Новый СписокЗначений;

СписокВыбора.Добавить("нал");
СписокВыбора.Добавить("к/к");
СписокВыбора.Добавить("смеш.");
СписокВыбора.Добавить("б/н");
СписокВыбора.Добавить("п/о");

Возврат СписокВыбора;
КонецФункции

&НаКлиенте
Процедура ДатаОтчетаСПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(ДатаОтчетаС) Тогда 
	ПоказатьПредупреждение(,"Заполните дату отчета С");
	
	Возврат;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ДатаОтчетаПо) Тогда ДатаОтчетаПо = ДатаОтчетаС; КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
ОтчетОбъект = РеквизитФормыВЗначение("Объект");

МакетИмя = "ФинансовыйРезультат";
//Макет = Обработки.ФинансовыйРезультат_Новый.ПолучитьМакет(МакетИмя);
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);
	
ИмяОбработки = ОтчетОбъект.Метаданные().Имя;

Если ЗначениеЗаполнено(ДатаОплатыОтбор) ИЛИ ЗначениеЗаполнено(ТипОплатыОтбор) Тогда
	ПолеОтчетаОтборОплат = Обработки[ИмяОбработки].СформироватьОтчетОплатыНаСервере(Макет, ДатаОплатыОтбор, ТипОплатыОтбор, Истина);

	Этаформа.ТекущийЭлемент = Этаформа.Элементы.ПолеОтчетаОтборОплат;
Иначе
	ТабДок = Обработки[ИмяОбработки].СформироватьОтчетНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо,  Истина);	
	//ТабДок = Новый ТабличныйДокумент;
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	Для Индекс = 1 По КоличествоСтрок Цикл
		ОбластьТекст = ТабДок.Область(Индекс, 1, Индекс, 1).Текст; 	
		Если ОбластьТекст = "" Тогда
			ОбластьКУдалению = ТабДок.Область(Индекс, , Индекс, ); 	

			ТабДок.УдалитьОбласть(ОбластьКУдалению, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
	КонецЦикла;
	
	ПолеОтчета = ТабДок;
	
	Этаформа.ТекущийЭлемент = Этаформа.Элементы.ПолеОтчета;
КонецЕсли;

//ТабДок = Обработки[ИмяОбработки].СформироватьОтчетНаСервере(Макет, ДатаОтчетаС, ДатаОтчетаПо, Истина);	

//ПолеОтчета = ТабДок;
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере_1()
ПолеОтчета.Очистить();

ПолеОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//ПолеОтчета.ОтображатьСетку = Истина;
//ПолеОтчета.ОтображатьЗаголовки = Истина;

МакетИмя = "ФинансовыйРезультат";
//Макет = Обработки.ФинансовыйРезультатКоворкинг.ПолучитьМакет(МакетИмя);
ОтчетОбъект = РеквизитФормыВЗначение("Объект");
Макет = ОтчетОбъект.ПолучитьМакет(МакетИмя);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КоворкингУслуги.Ссылка КАК Папка,
                      |	КоворкингУслуги.Номер_пп КАК Номер_пп
                      |ИЗ
                      |	Справочник.КоворкингУслуги КАК КоворкингУслуги
                      |ГДЕ
                      |	КоворкингУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингУслуги.ЭтоГруппа = ИСТИНА
                      |	И КоворкингУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.КоворкингУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Номер_пп");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("Номер_пп");

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.Папка = Справочники.ДопУслуги.ПустаяСсылка();

ОбластьЛево = Макет.ПолучитьОбласть("Шапка|КолонкиЛево");
ПолеОтчета.Вывести(ОбластьЛево, 0);

КоличествоКолонок = ОбластьЛево.ШиринаТаблицы;

Область = Макет.ПолучитьОбласть("Шапка|КолонкаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.Папка) Тогда		
		Область.Параметры.ШапкаДопУслуги = Строка.Папка;
	Иначе
		Область.Параметры.ШапкаДопУслуги = "Без папки";
	КонецЕсли;
	
	ПолеОтчета.Присоединить(Область, 0);
	
	КоличествоКолонок = КоличествоКолонок + 1;
КонецЦикла;

ОбластьШапка = ПолеОтчета.Область("R1"); 
ПолеОтчета.ПовторятьПриПечатиСтроки = ОбластьШапка;

ПолеОтчета.ФиксацияСверху = 1;

ПолеОтчета.НачатьАвтогруппировкуСтрок();

Итоги = Новый Структура();
Итоги.Вставить("Количество", 0);
//Итоги.Вставить("Цена", 0);
Итоги.Вставить("Сумма", 0);
Итоги.Вставить("СуммаЧистая", 0);
Итоги.Вставить("СуммаОплаты", 0);
Итоги.Вставить("СуммаЭквайринга", 0);

ДопУслугиИтоги = Новый ТаблицаЗначений;
ДопУслугиИтоги.Колонки.Добавить("УслугаРодитель");
ДопУслугиИтоги.Колонки.Добавить("СуммаУслуги");
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = ДопУслугиИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
Итоги.Вставить("УслугиИтоги", ДопУслугиИтоги);

ИтогиДень = Новый Структура();
ИтогиДень.Вставить("Количество", 0);
//ИтогиДень.Вставить("Цена", 0);
ИтогиДень.Вставить("Сумма", 0);
ИтогиДень.Вставить("СуммаЧистая", 0);
ИтогиДень.Вставить("СуммаОплаты", 0);
ИтогиДень.Вставить("СуммаЭквайринга", 0);

УслугиДеньИтоги = Новый ТаблицаЗначений;
УслугиДеньИтоги.Колонки.Добавить("УслугаРодитель");
УслугиДеньИтоги.Колонки.Добавить("СуммаУслуги");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиДеньИтоги.Добавить();
	НоваяСтрока.УслугаРодитель = Строка.Папка;	
	НоваяСтрока.СуммаУслуги = 0;	
КонецЦикла;
ИтогиДень.Вставить("УслугиДеньИтоги", УслугиДеньИтоги);

Дата_П = ДатаОтчетаС;
Пока Дата_П <= ДатаОтчетаПо Цикл
	//Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	//                      |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга
	//                      |ИЗ
	//                      |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
	//                      |ГДЕ
	//                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга <= &ДатаУстановкиПроцентаЭквайринга
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

	//Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Дата_П);

	//ТЗ = Запрос.Выполнить().Выгрузить();
	//ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга);  	
	//
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	КоворкингНомера.Ссылка КАК НомерКоворкинг,
	//                      |	КоворкингСчета.Ссылка КАК Счет,
	//                      |	ВЫБОР
	//                      |		КОГДА КоворкингСчета.ОплачиваетСчет = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
	//                      |			ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
	//                      |		ИНАЧЕ КоворкингСчета.ОплачиваетСчет
	//                      |	КОНЕЦ КАК Оплачивает,
	//                      |	ВЫБОР
	//                      |		КОГДА КоворкингСчета.КоличествоЕдиниц = 0
	//                      |			ТОГДА 0
	//                      |		ИНАЧЕ КоворкингСчета.Сумма / КоворкингСчета.КоличествоЕдиниц
	//                      |	КОНЕЦ КАК Сумма,
	//                      |	КоворкингСчета.Цена КАК Цена,
	//                      |	КоворкингСчета.Сумма КАК СуммаСчета,
	//                      |	КоворкингСчета.Количество КАК Количество,
	//                      |	КоворкингСчета.КоличествоЕдиниц КАК КоличествоЕдиниц,
	//                      |	КоворкингСчета.КоворкингЗаявка.ПериодАренды КАК ПериодАренды,
	//                      |	Оплаты.ДокументОплаты КАК ДокументОплаты,
	//                      |	Оплаты.ДокументОплатыДатаОплаты КАК ДокументОплатыДатаОплаты,
	//                      |	Оплаты.ТипОплаты КАК ТипОплаты,
	//                      |	Оплаты.ЭтоЭквайринг КАК ЭтоЭквайринг,
	//                      |	ЕСТЬNULL(Оплаты.СуммаОплаты, 0) КАК СуммаОплаты,
	//                      |	ЕСТЬNULL(Оплаты.СуммаНаличные, 0) КАК СуммаНаличные,
	//                      |	ЕСТЬNULL(Оплаты.СуммаКарта, 0) КАК СуммаКарта,
	//                      |	ЕСТЬNULL(Оплаты.СуммаДокументаОплаты, 0) КАК СуммаДокументаОплаты,
	//                      |	ЕСТЬNULL(Оплаты.СуммаРаспределено, 0) КАК СуммаРаспределено
	//                      |ИЗ
	//                      |	Справочник.КоворкингНомера КАК КоворкингНомера
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоворкингСчета КАК КоворкингСчета
	//                      |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//                      |				ВЫБОР
	//                      |					КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаДокументыОплаты.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
	//                      |						ТОГДА КоворкингСчетаДокументыОплаты.ДокументОплаты.Сумма
	//                      |					ИНАЧЕ 0
	//                      |				КОНЕЦ КАК СуммаДокументОплатыКасса,
	//                      |				ВЫБОР
	//                      |					КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаДокументыОплаты.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
	//                      |						ТОГДА КоворкингСчетаДокументыОплаты.ДокументОплаты.СуммаНаличные
	//                      |					ИНАЧЕ 0
	//                      |				КОНЕЦ КАК СуммаНаличные,
	//                      |				ВЫБОР
	//                      |					КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаДокументыОплаты.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
	//                      |						ТОГДА КоворкингСчетаДокументыОплаты.ДокументОплаты.СуммаКарта
	//                      |					ИНАЧЕ 0
	//                      |				КОНЕЦ КАК СуммаКарта,
	//                      |				ВЫБОР
	//                      |					КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаДокументыОплаты.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
	//                      |						ТОГДА 4
	//                      |					ИНАЧЕ ВЫБОР
	//                      |							КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаДокументыОплаты.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
	//                      |								ТОГДА 3
	//                      |							ИНАЧЕ ВЫБОР
	//                      |									КОГДА КоворкингСчетаДокументыОплаты.ДокументОплаты.СуммаНаличные = 0
	//                      |											И КоворкингСчетаДокументыОплаты.ДокументОплаты.СуммаКарта > 0
	//                      |										ТОГДА 1
	//                      |									ИНАЧЕ ВЫБОР
	//                      |											КОГДА КоворкингСчетаДокументыОплаты.ДокументОплаты.СуммаНаличные > 0
	//                      |													И КоворкингСчетаДокументыОплаты.ДокументОплаты.СуммаКарта = 0
	//                      |												ТОГДА 2
	//                      |											ИНАЧЕ 0
	//                      |										КОНЕЦ
	//                      |								КОНЕЦ
	//                      |						КОНЕЦ
	//                      |				КОНЕЦ КАК ТипОплаты,
	//                      |				КоворкингСчетаДокументыОплаты.Ссылка КАК Ссылка,
	//                      |				КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
	//                      |				КоворкингСчетаДокументыОплаты.СуммаРаспределено КАК СуммаРаспределено,
	//                      |				ВЫБОР
	//                      |					КОГДА КоворкингСчетаДокументыОплаты.Ссылка.КоворкингЗаявка.ПериодАренды = ""ЧАС""
	//                      |						ТОГДА КоворкингСчетаДокументыОплаты.СуммаРаспределено
	//                      |					ИНАЧЕ ВЫБОР
	//                      |							КОГДА КоворкингСчетаДокументыОплаты.Ссылка.КоличествоЕдиниц = 0
	//                      |								ТОГДА 0
	//                      |							ИНАЧЕ КоворкингСчетаДокументыОплаты.СуммаРаспределено / КоворкингСчетаДокументыОплаты.Ссылка.КоличествоЕдиниц
	//                      |						КОНЕЦ
	//                      |				КОНЕЦ КАК СуммаОплаты,
	//                      |				КоворкингСчетаДокументыОплаты.ДокументОплаты.Сумма КАК СуммаДокументаОплаты,
	//                      |				КоворкингСчетаДокументыОплаты.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты,
	//                      |				ВЫБОР
	//                      |					КОГДА ТИПЗНАЧЕНИЯ(КоворкингСчетаДокументыОплаты.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
	//                      |						ТОГДА КоворкингСчетаДокументыОплаты.ДокументОплаты.ЭтоЭквайринг
	//                      |					ИНАЧЕ ЛОЖЬ
	//                      |				КОНЕЦ КАК ЭтоЭквайринг
	//                      |			ИЗ
	//                      |				Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты) КАК Оплаты
	//                      |			ПО КоворкингСчета.Ссылка = Оплаты.Ссылка
	//                      |		ПО КоворкингНомера.Ссылка = КоворкингСчета.КоворкингЗаявка.КоворкингНомер
	//                      |ГДЕ
	//                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
	//                      |	И КоворкингСчета.ПометкаУдаления = ЛОЖЬ
	//                      |	И КоворкингСчета.ДатаС <= &Дата
	//                      |	И КоворкингСчета.ДатаПо >= &Дата
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	КоворкингНомера.Наименование");
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КоворкингНомера.Ссылка КАК НомерКоворкинг,
	                      |	КоворкингСчета.Ссылка КАК Счет,
	                      |	ВЫБОР
	                      |		КОГДА КоворкингСчета.ОплачиваетСчет = ЗНАЧЕНИЕ(Справочник.Клиенты.ПустаяСсылка)
	                      |			ТОГДА КоворкингСчета.КоворкингЗаявка.Клиент
	                      |		ИНАЧЕ КоворкингСчета.ОплачиваетСчет
	                      |	КОНЕЦ КАК Оплачивает,
	                      |	ВЫБОР
	                      |		КОГДА КоворкингСчета.КоличествоЕдиниц = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ КоворкингСчета.Сумма / КоворкингСчета.КоличествоЕдиниц
	                      |	КОНЕЦ КАК Сумма,
	                      |	КоворкингСчета.Цена КАК Цена,
	                      |	КоворкингСчета.Сумма КАК СуммаСчета,
	                      |	КоворкингСчета.Количество КАК Количество,
	                      |	КоворкингСчета.КоличествоЕдиниц КАК КоличествоЕдиниц,
	                      |	КоворкингСчета.КоворкингЗаявка.ПериодАренды КАК ПериодАренды
	                      |ИЗ
	                      |	Справочник.КоворкингНомера КАК КоворкингНомера
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоворкингСчета КАК КоворкингСчета
	                      |		ПО КоворкингНомера.Ссылка = КоворкингСчета.КоворкингЗаявка.КоворкингНомер
	                      |ГДЕ
	                      |	КоворкингНомера.ПометкаУдаления = ЛОЖЬ
	                      |	И КоворкингСчета.ПометкаУдаления = ЛОЖЬ
	                      |	И КоворкингСчета.ДатаС <= &Дата
	                      |	И КоворкингСчета.ДатаПо >= &Дата
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КоворкингНомера.Наименование");
	

	Запрос.УстановитьПараметр("Дата", Дата_П);
	ТЗ_Счета = Запрос.Выполнить().Выгрузить();

	Если ТЗ_Счета.Количество() = 0 Тогда Перейти ~ПРОДОЛЖИТЬ_ДатаОтчетаПо; КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ЗаголовокСтрока");
	Дата = Формат(Дата_П, "ДФ='дд.МММ гг'" );  
	Область.Параметры.Дата = Дата;	
	ПолеОтчета.Вывести(Область, 0);
	
	ИтогиДень.Количество = 0;
	//ИтогиДень.Вставить("Цена", 0);
	ИтогиДень.Сумма =  0;
	ИтогиДень.СуммаЧистая = 0;
	ИтогиДень.СуммаОплаты = 0;
	ИтогиДень.СуммаЭквайринга = 0;
	
	УслугиДеньИтоги = ИтогиДень.УслугиДеньИтоги;
	Для Каждого Строка Из ИтогиДень.УслугиДеньИтоги Цикл
		Строка.СуммаУслуги = 0;	
	КонецЦикла;

	Для Каждого СтрокаСчет Из ТЗ_Счета Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаСчет.Счет) Тогда Продолжить; КонецЕсли;
		
		//Если СтрокаЗаявка.Заявка.НомерВРезерв.Наименование <> "Номер 212 / Б" Тогда Продолжить; КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка КАК Счет,
		                      |	КоворкингСчетаДопУслугиКоворкинг.НомерСтроки КАК НомерСтроки,
		                      |	КоворкингСчетаДопУслугиКоворкинг.ГУИД КАК ГУИД,
		                      |	КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги КАК ДатаУслуги,
		                      |	КоворкингСчетаДопУслугиКоворкинг.Услуга КАК Услуга,
		                      |	КоворкингСчетаДопУслугиКоворкинг.Цена КАК Цена,
		                      |	КоворкингСчетаДопУслугиКоворкинг.Количество КАК Количество,
		                      |	КоворкингСчетаДопУслугиКоворкинг.Сумма КАК Сумма,
		                      |	КоворкингСчетаДопУслугиКоворкинг.СуммаОплачено КАК СуммаОплачено,
		                      |	КоворкингСчетаДопУслугиКоворкинг.Примечание КАК Примечание
		                      |ИЗ
		                      |	Документ.КоворкингСчета.ДопУслугиКоворкинг КАК КоворкингСчетаДопУслугиКоворкинг
		                      |ГДЕ
		                      |	КоворкингСчетаДопУслугиКоворкинг.Ссылка = &Счет
		                      |	И КоворкингСчетаДопУслугиКоворкинг.ДатаУслуги = &ДатаУслуги");
		
		Запрос.УстановитьПараметр("Счет", СтрокаСчет.Счет);
		Запрос.УстановитьПараметр("ДатаУслуги", Дата_П);
		ТЗ_Услуги = Запрос.Выполнить().Выгрузить(); 		
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	РаспределениеОплатКоворкинг.Ссылка КАК Ссылка,
		                      |	РаспределениеОплатКоворкинг.ДокументОплаты КАК ДокументОплаты,
		                      |	РаспределениеОплатКоворкинг.ЭтоУслуга КАК ЭтоУслуга,
		                      |	РаспределениеОплатКоворкинг.ГУИДДолги КАК ГУИДДолги,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
		                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.Сумма
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК СуммаДокументОплатыКасса,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
		                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК СуммаНаличные,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
		                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта
		                      |		ИНАЧЕ 0
		                      |	КОНЕЦ КАК СуммаКарта,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ПрочиеОплаты)
		                      |			ТОГДА 4
		                      |		ИНАЧЕ ВЫБОР
		                      |				КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
		                      |					ТОГДА 3
		                      |				ИНАЧЕ ВЫБОР
		                      |						КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные = 0
		                      |								И РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта > 0
		                      |							ТОГДА 1
		                      |						ИНАЧЕ ВЫБОР
		                      |								КОГДА РаспределениеОплатКоворкинг.ДокументОплаты.СуммаНаличные > 0
		                      |										И РаспределениеОплатКоворкинг.ДокументОплаты.СуммаКарта = 0
		                      |									ТОГДА 2
		                      |								ИНАЧЕ 0
		                      |							КОНЕЦ
		                      |					КОНЕЦ
		                      |			КОНЕЦ
		                      |	КОНЕЦ КАК ТипОплаты,
		                      |	ВЫБОР
		                      |		КОГДА РаспределениеОплатКоворкинг.Ссылка.КоворкингЗаявка.ПериодАренды = ""ЧАС""
		                      |			ТОГДА РаспределениеОплатКоворкинг.СуммаОплаты
		                      |		ИНАЧЕ ВЫБОР
		                      |				КОГДА РаспределениеОплатКоворкинг.Ссылка.КоличествоЕдиниц = 0
		                      |					ТОГДА 0
		                      |				ИНАЧЕ РаспределениеОплатКоворкинг.СуммаОплаты / РаспределениеОплатКоворкинг.Ссылка.КоличествоЕдиниц
		                      |			КОНЕЦ
		                      |	КОНЕЦ КАК СуммаОплаты,
		                      |	ВЫБОР
		                      |		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеОплатКоворкинг.ДокументОплаты) = ТИП(Документ.ВыпискаБанка)
		                      |			ТОГДА РаспределениеОплатКоворкинг.ДокументОплаты.ЭтоЭквайринг
		                      |		ИНАЧЕ ЛОЖЬ
		                      |	КОНЕЦ КАК ЭтоЭквайринг,
		                      |	РаспределениеОплатКоворкинг.ДокументОплаты.Сумма КАК СуммаДокументаОплаты,
		                      |	РаспределениеОплатКоворкинг.ДокументОплаты.ДатаОплаты КАК ДокументОплатыДатаОплаты
		                      |ИЗ
		                      |	Документ.КоворкингСчета.РаспределениеОплатКоворкинг КАК РаспределениеОплатКоворкинг
		                      |ГДЕ
		                      |	РаспределениеОплатКоворкинг.Ссылка = &Счет
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ДокументОплатыДатаОплаты,
		                      |	ДокументОплаты");
		
		
//                      |				ВЫБОР
	//                      |					КОГДА КоворкингСчетаДокументыОплаты.Ссылка.КоворкингЗаявка.ПериодАренды = ""ЧАС""
	//                      |						ТОГДА КоворкингСчетаДокументыОплаты.СуммаРаспределено
	//                      |					ИНАЧЕ ВЫБОР
	//                      |							КОГДА КоворкингСчетаДокументыОплаты.Ссылка.КоличествоЕдиниц = 0
	//                      |								ТОГДА 0
	//                      |							ИНАЧЕ КоворкингСчетаДокументыОплаты.СуммаРаспределено / КоворкингСчетаДокументыОплаты.Ссылка.КоличествоЕдиниц
	//                      |						КОНЕЦ
	//                      |				КОНЕЦ КАК СуммаОплаты,
		
		
		Запрос.УстановитьПараметр("Счет", СтрокаСчет.Счет);
		ТЗ_Оплаты = Запрос.Выполнить().Выгрузить();	
		
		ТЗ_Оплаты.Колонки.Добавить("ПроцентЭквайринга");
		Для Каждого Строка Из ТЗ_Оплаты Цикл
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			                  |	ПроцентыЭквайринга.ПроцентЭквайринга КАК ПроцентЭквайринга
			                  |ИЗ
			                  |	РегистрСведений.ПроцентыЭквайринга КАК ПроцентыЭквайринга
			                  |ГДЕ
			                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга < &ДатаУстановкиПроцентаЭквайринга
			                  |
			                  |УПОРЯДОЧИТЬ ПО
			                  |	ПроцентыЭквайринга.ДатаУстановкиПроцентаЭквайринга УБЫВ");

			Запрос.УстановитьПараметр("ДатаУстановкиПроцентаЭквайринга", Строка.ДокументОплаты.ДатаОплаты);

			ТЗ = Запрос.Выполнить().Выгрузить();
			ПроцентЭквайринга = ?(ТЗ.Количество() = 0, 0, ТЗ[0].ПроцентЭквайринга); 			
			
			Строка.ПроцентЭквайринга = ПроцентЭквайринга;
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Строка|КолонкиЛево");

		Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
		Область.Параметры.Дата = Дата;		

		Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
		Область.Параметры.Месяц = Месяц;		

		ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
		Область.Параметры.ДеньНедели = ДеньНедели;
			
		НомерНаименование = СтрокаСчет.НомерКоворкинг.Наименование;
		Область.Параметры.Номер = НомерНаименование;
		Область.Параметры.РасшифровкаНомер = СтрокаСчет.Счет;

		//Если СтрокаСчет.СуммаСчета = 0 Тогда Перейти ~УСЛУГИ; КонецЕсли;
		
		Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
		Область.Параметры.РасшифровкаСчет = СтрокаСчет.Счет;
		
		Область.Параметры.ПериодАренды = СтрокаСчет.ПериодАренды;
		
		Цена = СтрокаСчет.Цена;
		Если Цена <> 0 Тогда Область.Параметры.Цена = Цена; КонецЕсли;
		
		СуммаСчета = СтрокаСчет.СуммаСчета;
		Если СуммаСчета <> 0 Тогда Область.Параметры.СуммаСчета = СуммаСчета; КонецЕсли;

		Если СтрокаСчет.ПериодАренды = "ЧАС" Тогда 
			Количество = СтрокаСчет.Количество;
		Иначе
			Количество = 1;
		КонецЕсли;      
		Область.Параметры.Количество = Количество;

		Область.Параметры.КоличествоЕдиниц = СтрокаСчет.КоличествоЕдиниц;      

		Если СтрокаСчет.ПериодАренды = "ЧАС" Тогда 
			//СуммаЗаДень = ТекущийСчет.СуммаОплаты;
			СуммаЗаДень = СуммаСчета;
		Иначе
			СуммаЗаДень = Окр(СтрокаСчет.Сумма, 2);
		КонецЕсли;      
		//Область.Параметры.Сумма = СуммаЗаДень;
		Если СуммаЗаДень <> 0 Тогда Область.Параметры.Сумма = СуммаЗаДень; КонецЕсли;
		
		СуммаОплаты = 0;
		СуммаЭквайринга = 0;
		Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
			//ВСписке = ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИД", ТЗ_Проживание);
			Если СтрокаОплаты.ЭтоУслуга Тогда   
				ВСписке = ОбщийФункционалСервер.ВСписке(СтрокаОплаты.ДолгиГУИД, "ГУИДДолги", ТЗ_Услуги);
				Если ВСписке Тогда   
					СуммаОплаты = СуммаОплаты + Окр(СтрокаОплаты.СуммаОплаты, 2);	
					
					СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты) ;					
				КонецЕсли;
			Иначе				
				СуммаОплаты = СуммаОплаты + Окр(СтрокаОплаты.СуммаОплаты, 2);		
				
				СуммаЭквайринга = СуммаЭквайринга + ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты) ;					
			КонецЕсли;
		КонецЦикла;
		//Область.Параметры.СуммаОплаты = СуммаОплаты;
		Если СуммаОплаты <> 0 Тогда Область.Параметры.СуммаОплаты = СуммаОплаты; КонецЕсли;
		//Область.Параметры.СуммаЭквайринга = СуммаЭквайринга;
		Если СуммаЭквайринга <> 0 Тогда Область.Параметры.СуммаЭквайринга = СуммаЭквайринга; КонецЕсли;
		
		СуммаЧистая = СуммаЗаДень - СуммаЭквайринга;
		//Область.Параметры.СуммаЧистая = СуммаЧистая;
		Если СуммаЧистая <> 0 Тогда Область.Параметры.СуммаЧистая = СуммаЧистая; КонецЕсли;
		
		ВыведеннаяОбласть = ПолеОтчета.Вывести(Область, 1);		
			
~УСЛУГИ:
		ТЗ_УслугиИтого = ТЗ_Услуги.Скопировать();
		ТЗ_УслугиИтого.Колонки.Добавить("УслугаРодитель");
		Для Каждого Строка Из ТЗ_УслугиИтого Цикл 
			Результат = Справочники.КоворкингУслуги.ПустаяСсылка();
			Ссылка = Строка.Услуга; 
			ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
			
			Строка.УслугаРодитель = Результат;	
		КонецЦикла;	
		ТЗ_УслугиИтого.Свернуть("ДатаУслуги, УслугаРодитель", "Сумма");
		
		Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
			ЕстьСтрока = Ложь;
			Для Каждого СтрокаУслугиИтого Из ТЗ_УслугиИтого Цикл
				Если СтрокаУслугиИтого.УслугаРодитель = СтрокаРодительУслуги.Папка Тогда ЕстьСтрока = Истина; Прервать; КонецЕсли;
			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("Строка|КолонкаУслуги");
			Если ЕстьСтрока Тогда
				Если СтрокаУслугиИтого.Сумма <> 0 Тогда
					Область.Параметры.СуммаУслуги = СтрокаУслугиИтого.Сумма;
				КонецЕсли;	
			КонецЕсли;
			
			ВыведеннаяОбласть = ПолеОтчета.Присоединить(Область, 1);
		КонецЦикла;
		
		СуммаИтого_П = СуммаЗаДень + ТЗ_Услуги.Итог("Сумма");
		
		Если СуммаИтого_П <> СуммаОплаты Тогда 
			Для Индекс = 0 По КоличествоКолонок - 1 Цикл 
				ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).Шрифт 
				 //= Новый Шрифт(ОбластьОформления.Шрифт, ОбластьОформления.Шрифт.Размер, ,Истина);
				 	= Новый Шрифт("Arial", 8, ,Истина);
				ПолеОтчета.Область(ВыведеннаяОбласть.Верх, Индекс, ВыведеннаяОбласть.Низ, Индекс + 1).ЦветТекста = Новый Цвет(255, 0, 0);
			КонецЦикла;	
		КонецЕсли;

// ОПЛАТЫ
		Для Каждого СтрокаОплаты Из ТЗ_Оплаты Цикл
			Область = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкиЛево");
			
			Область.Параметры.Дата = ".";
			
			Область.Параметры.СчетСсылка = СтрокаСчет.Счет;
			
			Область.Параметры.ТипОплаты = ОтчетыСервер.ТипОплатыНаименование(СтрокаОплаты.ТипОплаты);
			Область.Параметры.ДатаОплаты = Формат(СтрокаОплаты.ДокументОплаты.ДатаОплаты, "ДФ=dd.MM.yy");
			СуммаОплатыСтрокаОплаты  = Окр(СтрокаОплаты.СуммаОплаты, 2);
			Область.Параметры.СуммаОплаты = СуммаОплатыСтрокаОплаты;
			
			Область.Параметры.СуммаЭквайринга = ОтчетыСервер.СуммаЭквайринга(СтрокаОплаты);

			Если СтрокаОплаты.ЭтоУслуга Тогда
				
				Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
					ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ДолгиГУИД);
					НайденныеСтроки = ТЗ_Услуги.НайтиСтроки(ОтборСтроки);
					
					ЕстьСтрока = Ложь;
					Для Каждого Строка Из НайденныеСтроки Цикл
						Результат = Справочники.ДопУслуги.ПустаяСсылка();
						Ссылка = Строка.Услуга; 
						ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
						
						//Если Строка.УслугаРодитель = СтрокаРодительУслуги.Родитель Тогда
						Если Результат = СтрокаРодительУслуги.Папка Тогда
							ЕстьСтрока = Истина;
							
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если ЕстьСтрока Тогда Прервать;  КонецЕсли;
				КонецЦикла;	
				
				Если ЕстьСтрока Тогда  
					ПолеОтчета.Вывести(Область, 1);
				КонецЕсли;
				
				Если ЕстьСтрока Тогда 
					Для Каждого СтрокаРодительУслуги Из ТЗ_РодительУслуги Цикл
						ОтборСтроки = Новый Структура("ГУИД", СтрокаОплаты.ДолгиГУИД);
						НайденныеСтроки = ТЗ_Услуги.НайтиСтроки(ОтборСтроки);
						
						ЕстьСтрока = Ложь;
						Для Каждого Строка Из НайденныеСтроки Цикл
							Результат = Справочники.ДопУслуги.ПустаяСсылка();
							Ссылка = Строка.Услуга; 
							ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);
							
							//Если Строка.УслугаРодитель = СтрокаРодительУслуги.Родитель Тогда
							Если Результат = СтрокаРодительУслуги.Папка Тогда
								ЕстьСтрока = Истина;
								
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						ОбластьУслуги = Макет.ПолучитьОбласть("СтрокаОплаты|КолонкаУслуги");
						Если ЕстьСтрока Тогда
							ОбластьУслуги.Параметры.СуммаУслуги = СуммаОплатыСтрокаОплаты;
						КонецЕсли;
						
						ПолеОтчета.Присоединить(ОбластьУслуги, 1);
					КонецЦикла;
				КонецЕсли;
			Иначе
				Область.Параметры.Сумма = СуммаОплатыСтрокаОплаты;
				ПолеОтчета.Вывести(Область, 1);
			КонецЕсли;
		КонецЦикла;
		
		//ИтогиДень.Количество = ИтогиДень.Количество + ;
		//ИтогиДень.Вставить("Цена", 0);
		ИтогиДень.Сумма =  ИтогиДень.Сумма + СуммаЗаДень;
		ИтогиДень.СуммаЧистая = ИтогиДень.СуммаЧистая + СуммаЧистая;
		ИтогиДень.СуммаОплаты = ИтогиДень.СуммаОплаты + СуммаОплаты;
		ИтогиДень.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга + СуммаЭквайринга;
		
		УслугиДеньИтоги = ИтогиДень.УслугиДеньИтоги;
		Для Каждого Строка Из ИтогиДень.УслугиДеньИтоги Цикл
			Строка.СуммаУслуги = Строка.СуммаУслуги + ТЗ_Услуги.Итог("Сумма");	
		КонецЦикла;
	КонецЦикла;		
		
	
	//Область = Макет.ПолучитьОбласть("ЗаголовокСтрока");
	//Дата = Формат(Дата_П, "ДФ='дд.МММ гг'" );  
	//Область.Параметры.Дата = Дата;		
	//ПолеОтчета.Вывести(Область, 1);
	//
	////
	//ИтогиДень = Новый Структура();
	//ИтогиДень.Вставить("Количество", 0);
	////ИтогиДень.Вставить("Цена", 0);
	//ИтогиДень.Вставить("Сумма", 0);
	//ИтогиДень.Вставить("СуммаЧистая", 0);
	//ИтогиДень.Вставить("СуммаОплаты", 0);
	//ИтогиДень.Вставить("СуммаЭквайринга", 0);
	//
	//НомерКоворкингТекущий = Неопределено;
	//СчетТекущий = Неопределено;
	//Первый = Ложь;
	//Для Каждого Строка Из ТЗ Цикл  
	//	Если ЗначениеЗаполнено(Строка.Счет) Тогда 
	//		Если СчетТекущий = Строка.Счет Тогда Продолжить; КонецЕсли;
	//	КонецЕсли;	
	//		
	//	НомерКоворкингТекущий = Строка.НомерКоворкинг;
	//	СчетТекущий = Строка.Счет;
	//	
	//	ОтборСтроки = Новый Структура("НомерКоворкинг, Счет", НомерКоворкингТекущий, СчетТекущий);  
	//	МассивСтрокиСчет = ТЗ.НайтиСтроки(ОтборСтроки);
	//	
	//	ПечатьСчета(Макет, ПроцентЭквайринга, Дата_П,  НомерКоворкингТекущий, МассивСтрокиСчет, ИтогиДень, Итоги, Первый);   
	//	Первый = Ложь;
	//КонецЦикла;
	//
	Область = Макет.ПолучитьОбласть("ИтогиДень");
	
	Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
	Область.Параметры.Дата = Дата;		

	Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
	Область.Параметры.Месяц = Месяц;		

	ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
	Область.Параметры.ДеньНедели = ДеньНедели;

	//Область.Параметры.Номер = "Итого: " + ИтогиДень.Количество;
	//Область.Параметры.Цена = ИтогиДень.Цена;
	Область.Параметры.Сумма = ИтогиДень.Сумма;
	Область.Параметры.Количество = ИтогиДень.Количество;
	Область.Параметры.СуммаОплаты = ИтогиДень.СуммаОплаты;
	Область.Параметры.СуммаЭквайринга = ИтогиДень.СуммаЭквайринга;
	Область.Параметры.СуммаЧистая = ИтогиДень.СуммаЧистая;
	
	ПолеОтчета.Вывести(Область, 1);
	
	Для Каждого СтрокаУслугиИтого Из ИтогиДень.УслугиДеньИтоги Цикл
		ОбластьУслуги = Макет.ПолучитьОбласть("ИтогиДень|КолонкаУслуги");
		Если СтрокаУслугиИтого.СуммаУслуги <> 0 Тогда
			ОбластьУслуги.Параметры.СуммаУслуги = СтрокаУслугиИтого.СуммаУслуги;
		КонецЕсли;	
		ПолеОтчета.Присоединить(ОбластьУслуги, 0);
	КонецЦикла;
	
	Итоги.Сумма =  Итоги.Сумма + ИтогиДень.Сумма;
	Итоги.СуммаЧистая = Итоги.СуммаЧистая + ИтогиДень.СуммаЧистая;
	Итоги.СуммаОплаты = Итоги.СуммаОплаты + ИтогиДень.СуммаОплаты;
	Итоги.СуммаЭквайринга = Итоги.СуммаЭквайринга + ИтогиДень.СуммаЭквайринга;
	
	Для Индекс = 0 По Итоги.УслугиИтоги.Количество() - 1 Цикл
		Итоги.УслугиИтоги[Индекс].СуммаУслуги = Итоги.УслугиИтоги[Индекс].СуммаУслуги 
			+ ИтогиДень.УслугиДеньИтоги[Индекс].СуммаУслуги;		
	КонецЦикла;
	
~ПРОДОЛЖИТЬ_ДатаОтчетаПо:	
	Дата_П = Дата_П + 60*60*24;	
КонецЦикла;	
ПолеОтчета.ЗакончитьАвтогруппировкуСтрок();

Область = Макет.ПолучитьОбласть("Итоги");

//Дата = Формат(Дата_П, "ДФ='д.МММ гг'" );  
//Область.Параметры.Дата = Дата;		

//Месяц = Формат(Дата_П, "ДФ='МММ гг'" );  
//Область.Параметры.Месяц = Месяц;		

//ДеньНедели = Формат(Дата_П, "ДФ=дддд");   
//Область.Параметры.ДеньНедели = ДеньНедели;

Область.Параметры.ИтогиДаты = "Период с " + Формат(ДатаОтчетаС, "ДФ=dd.MM.yy") + " по " + Формат(ДатаОтчетаПо, "ДФ=dd.MM.yy");

Область.Параметры.Сумма = Итоги.Сумма;
//Область.Параметры.Количество = Итоги.Количество;
Область.Параметры.СуммаОплаты = Итоги.СуммаОплаты;
Область.Параметры.СуммаЭквайринга = Итоги.СуммаЭквайринга;
Область.Параметры.СуммаЧистая = Итоги.СуммаЧистая;

ПолеОтчета.Вывести(Область, 1);

//ПолеОтчета.Область(, КоличествоКолонок, ,КоличествоКолонок + 2).Видимость = Ложь;
//ПолеОтчета.Область(, 0, ,1).Видимость = Ложь;
КонецПроцедуры


//// +++++++++++++++++++++++++

