

&НаКлиенте
Процедура ОбновитьНомераГорничные(Команда)
	ОбновитьНомераГорничныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНомераГорничныеНаСервере()
Выборка = Справочники.НомернойФонд.Выбрать();
Пока Выборка.Следующий() Цикл
	Если Выборка.ПометкаУдаления тогда Продолжить; КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Выборка.НомерГорничные) Тогда Продолжить; КонецЕсли;
	
	ГорничныеНомераСсылка = Справочники.ГорничныеНомера.НайтиПоРеквизиту("НомерГорничные", Выборка.НомерГорничные);
	Если ЗначениеЗаполнено(ГорничныеНомераСсылка) Тогда Продолжить; КонецЕсли;
	
	ГорничныеНомераОбъект = Справочники.ГорничныеНомера.СоздатьЭлемент();
	ГорничныеНомераОбъект.НомерГорничные = Выборка.НомерГорничные; 
	ГорничныеНомераОбъект.Записать();
КонецЦикла;

ТаблицаОбмена.Очистить();

Выборка = Справочники.ГорничныеНомера.Выбрать();
Пока Выборка.Следующий() Цикл
	Если Выборка.ПометкаУдаления Тогда Продолжить; КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Выборка.НомерГорничные) Тогда Продолжить; КонецЕсли;
	
	НомернойФондСсылка = Справочники.НомернойФонд.НайтиПоРеквизиту("НомерГорничные", Выборка.НомерГорничные);
	Если ЗначениеЗаполнено(НомернойФондСсылка) Тогда 
		НоваяСтрока = ТаблицаОбмена.Добавить();
	    НоваяСтрока.НомерГорничные = Выборка.НомерГорничные;
		
		Продолжить; 
	КонецЕсли;
	
	ГорничныеНомераСсылка = Справочники.ГорничныеНомера.НайтиПоРеквизиту("НомерГорничные", Выборка.НомерГорничные);
	ГорничныеНомераОбъект = ГорничныеНомераСсылка.ПолучитьОбъект();
	ГорничныеНомераОбъект.НомерГорничные = ""; 
	ГорничныеНомераОбъект.ПометкаУдаления = Истина; 
	ГорничныеНомераОбъект.Записать();
КонецЦикла;

Соединение = ОбменГорничныеСервер.Соединение();
Если Соединение = Неопределено Тогда 
	Сообщить("Нет связи с БД Горничные");
	
	Возврат;
КонецЕсли;

Соединение.ОбновитьНомераГорничныеИзТаблицыОбмена(ТаблицаОбмена);
КонецПроцедуры


