
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("Ключ", Клиент);
 
Элементы.ДекорацияИнформация.Заголовок = "Клиент: '" + Клиент + "' находится в архивной папке.
|
|ПЕРЕМЕСТИТЕ КЛИЕНТА В НУЖНУЮ ПАПКУ.
|
|ОБНОВИТЕ СКАН ДОКУМЕНТА КЛИЕНТА.
|";

ОбновитьИсходнаяПапка();

ОбновитьНоваяПапка();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИсходнаяПапка()
ТекущийРодитель = "";
ОбщийФункционалСервер.ПолнаяПапкаРодитель(Объект.Ссылка, ТекущийРодитель);
ИсходнаяПапка = ТекущийРодитель;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНоваяПапка()
ТекущийРодитель = "";
ОбщийФункционалСервер.ПолнаяПапкаРодитель(Объект.Родитель, ТекущийРодитель);
НоваяПапка = ТекущийРодитель;
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
ОбновитьНоваяПапка();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры
