
Функция КлиентПредставление(Клиент) Экспорт
Если Клиент.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда
	НаименованиеЮрЛица = Клиент.НаименованиеЮрЛица;	
	Если ЗначениеЗаполнено(НаименованиеЮрЛица) Тогда		
		КлиентПредставление = НаименованиеЮрЛица;	
	Иначе
		КлиентПредставление = Клиент.Наименование;	
	КонецЕсли;
Иначе	
	КлиентПредставление = Клиент.Наименование;	
КонецЕсли;

Возврат КлиентПредставление; 
КонецФункции

Функция ЭтоЮрЛицо(Контрагент) Экспорт
ЮрЛицо = (Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо) ;
Возврат ЮрЛицо; 
КонецФункции

Функция ПунктыВыдачиФМС(КодОргана, ДатаВыдачи) Экспорт
Результат = Новый Структура("ПунктыВыдачиФМС, СостояниеВыбора", Неопределено, "");	
	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ПунктыВыдачиФМС_NEW.Ссылка КАК Ссылка,
                      |	ПунктыВыдачиФМС_NEW.CODE_0 КАК CODE_0,
                      |	ПунктыВыдачиФМС_NEW.END_DATE КАК END_DATE,
                      |	ПунктыВыдачиФМС_NEW.КонечнаяДата КАК КонечнаяДата
                      |ИЗ
                      |	Справочник.ПунктыВыдачиФМС_NEW КАК ПунктыВыдачиФМС_NEW
                      |ГДЕ
                      |	ПунктыВыдачиФМС_NEW.CODE_0 = &КодОргана");	

Запрос.УстановитьПараметр("КодОргана", КодОргана);

ТЗ =  Запрос.Выполнить().Выгрузить();
ТЗ_Выбрано = ТЗ.СкопироватьКолонки();

Для Каждого Строка из ТЗ Цикл
	Если ЗначениеЗаполнено(Строка.END_DATE) Тогда
		// 1234567890
		// 01.01.1111
		Год = Сред(Строка.END_DATE, 7, 4);
		Месяц = Сред(Строка.END_DATE, 4, 2);
		День =  Сред(Строка.END_DATE, 1, 2);
		Строка.КонечнаяДата = Дата(Год, Месяц, День); 	
	Иначе 
		Строка.КонечнаяДата = НачалоДня(ТекущаяДата()); 
	КонецЕсли;
КонецЦикла;
	
ОтборСтроки = Новый Структура("CODE_0", КодОргана);
НайденныеСтроки = ТЗ.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() = 1 Тогда
	Результат.ПунктыВыдачиФМС = НайденныеСтроки[0].Ссылка;
ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
	ТЗ_Выбрано.Очистить();
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		НоваяСтрока = ТЗ_Выбрано.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
	КонецЦикла;				 
	
	ТЗ_Выбрано.Сортировать("КонечнаяДата УБЫВ");
	
	Если ЗначениеЗаполнено(ДатаВыдачи) Тогда

		СтрокаВыбрано_Предыдущая = Неопределено;
		Для Каждого СтрокаВыбрано Из ТЗ_Выбрано Цикл
			Если ДатаВыдачи >= СтрокаВыбрано.КонечнаяДата Тогда Прервать; КонецЕсли;
			
			СтрокаВыбрано_Предыдущая = СтрокаВыбрано;	
		КонецЦикла;
		
		Если СтрокаВыбрано_Предыдущая = Неопределено Тогда
			Результат.ПунктыВыдачиФМС = ТЗ_Выбрано[0].Ссылка;
			Результат.СостояниеВыбора = "НЕТ ДАННЫХ";
		Иначе					
			Результат.ПунктыВыдачиФМС = СтрокаВыбрано_Предыдущая.Ссылка;
			
		КонецЕсли;	
	Иначе
		Результат.ПунктыВыдачиФМС = ТЗ_Выбрано[0].Ссылка;
		Результат.СостояниеВыбора = "НЕТ ДАТЫ";
	КонецЕсли;	
КонецЕсли;

Возврат Результат; 
КонецФункции

Функция ПечатьАнкетыФМСЗаявкаНаБронированиеПараметры() Экспорт
Ответ = Новый Структура("Отель, АдресОтель", "", "");

Организация_П = НастройкиСервер.ПолучитьТекущуюОрганизацию();
Ответ.Отель = Организация_П.НаименованиеОтеляДляАнкетыФМС;
Ответ.АдресОтель = Организация_П.АдресОтельДляАнкетыФМС;

Возврат Ответ;
КонецФункции
