
&НаКлиенте
Перем ТекстSendКеуs, Shell;

&НаКлиенте
Процедура Ничего(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр(); 

ЭтоАдминистратор = (СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код) = "Администратор");
Элементы.ПрограммныйКод.Видимость = ЭтоАдминистратор;

КонецПроцедуры

&НаКлиенте
Процедура ДвойныеИНН(Команда)
ПараметрыФормы = Новый Структура();	
ПараметрыФормы.Вставить("СформироватьОтчет", Истина);

ОткрытьФорму("Обработка.КлиентыДвойныеИНН.Форма.Форма", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьКонтрагентов(Команда)
ПараметрыФормы = Новый Структура();	

ОткрытьФорму("Обработка.КлиентыОбъединиение.Форма.ФормаОбъединениеКонтрагентов", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

////
&НаКлиенте
Процедура ВывестиСимвол(Символ)
ТекстSendКеуs = "{END}" + Символ; 
ПодключитьОбработчикОжидания("Нажать", 0.0001, Истина);
КонецПроцедуры  

&НаКлиенте
Процедура Нажать()
Shell.SendKeys(ТекстSendКеуs);
ОтключитьОбработчикОжидания("Нажать"); 

ПодключитьОбработчикОжидания("ВернутьсяВПоле", 0.0001, Истина);
КонецПроцедуры  

 &НаКлиенте
Процедура ВернутьсяВПоле()
ТекущийЭлемент = Элементы.ПолеПоиска;
ТекстSendКеуs = "{END}";
Shell.SendKeys(ТекстSendКеуs);

ОтключитьОбработчикОжидания("ВернутьсяВПоле");     
КонецПроцедуры 

&НаКлиенте
Процедура ПолеПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
Символ = Текст;
ТекстSendКеуs = Символ;   

ЭтаФорма.ТекущийЭлемент = Элементы.ФормаНичего;
Shell.SendKeys("{TAB}");

ВывестиСимвол(Символ);
КонецПроцедуры



&НаКлиенте
Процедура Поле3ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
Символ = Текст;
ТекстSendКеуs = Символ;   

ЭтаФорма.ТекущийЭлемент = Элементы.Поле1; 
ВывестиСимвол(Символ);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
Shell = Новый COMОбъект("WScript.Shell");
КонецПроцедуры

