
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаДни Из Дни Цикл
		// регистр ЗакрытыеДни 
		Если ТекСтрокаДни.Закрыть тогда
			Движение = Движения.ЗакрытыеДни.Добавить();
			Движение.День = ТекСтрокаДни.День;
			Движение.Закрыт = ТекСтрокаДни.Закрыть;
		конецесли;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
