
&НаСервереБезКонтекста
Функция ПолучитьДоступностьПоУзлу(Узел)
ДоступностьКнопок = Ложь;
// Определить наличие установленного непредопределенного узла.
Если Узел <> ПланыОбмена.ВГ_ВыпискаГостиницы.ПустаяСсылка()
И Узел <> ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел()
И Узел.ПолучитьОбъект() <> Неопределено Тогда
	ДоступностьКнопок = Истина;
КонецЕсли;

Возврат ДоступностьКнопок;
КонецФункции

&НаКлиенте
Процедура УзелОбменаПриИзменении(Элемент)
ДоступностьКнопок = ПолучитьДоступностьПоУзлу(УзелОбмена);

// Установить доступность кнопок в зависимости от установленного узла обмена.
Элементы.ФормаЗагрузитьДанные.Доступность = ДоступностьКнопок;
Элементы.ФормаВыгрузитьДанные.Доступность = ДоступностьКнопок;
КонецПроцедуры

//
&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
//ВыполнитьВыгрузкуНаСервере(УзелОбмена);

Результат = ОбменВыписка.ВыполнитьВыгрузкуУзла();
КонецПроцедуры
//

//
&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
Результат = ОбменВыписка.ВыполнитьЗагрузкуУзла();
КонецПроцедуры
//


&НаКлиенте
Процедура ОбменДанными(Команда)
ОбменВыписка.ВыполнитьОбменДанными();
КонецПроцедуры




