
Функция УменьшитьОплатыКоворкингСчетаСуммаВозврата(ДокументОплаты, ДокументДолг, СуммаВозврата) Экспорт
Если ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.КассовыйДокумент") 
И ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.ВыпискаБанка") Тогда Возврат Неопределено; КонецЕсли;

ДокументДолгОбъект = ДокументДолг.ПолучитьОбъект();

ДокументыОплаты = ДокументДолгОбъект.ДокументыОплаты;
РаспределениеОплатКоворкинг = ДокументДолгОбъект.РаспределениеОплатКоворкинг;

НачатьТранзакцию();

ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты); 
НайденныеСтрокиДокументыОплаты = ДокументыОплаты.НайтиСтроки(ОтборСтроки);
НайденныеСтрокРаспределениеОплатКоворкинг = РаспределениеОплатКоворкинг.НайтиСтроки(ОтборСтроки);

ОстатокСуммаВозврата = СуммаВозврата;
СтрокаДокументыОплаты = НайденныеСтрокиДокументыОплаты[0]; 

Если СтрокаДокументыОплаты.СуммаРаспределено <= ОстатокСуммаВозврата Тогда
	ОбщийФункционалСервер.УдалитьСтроки(ДокументыОплаты, НайденныеСтрокиДокументыОплаты);
	
	// + Аудит
	//ОбщийФункционалСервер.УдалитьСтроки(ДокументыОплаты, НайденныеСтрокРаспределениеОплатКоворкинг);
	ОбщийФункционалСервер.УдалитьСтроки(РаспределениеОплатКоворкинг, НайденныеСтрокРаспределениеОплатКоворкинг);
	// - Аудит
	
	ОплатыОбщееСервер.УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты, ДокументДолг, ДокументДолг.СчетГУИД);
	
	// + Аудит
	//ОстатокСуммаВозврата = СуммаВозврата - СтрокаДокументыОплаты.СуммаРаспределено;
	ОстатокСуммаВозврата = ОстатокСуммаВозврата - СтрокаДокументыОплаты.СуммаРаспределено;
	// - Аудит
Иначе
	Для Каждого СтрокаРаспределениеОплат Из НайденныеСтрокРаспределениеОплатКоворкинг Цикл
		Если СтрокаРаспределениеОплат.СуммаОплаты <= ОстатокСуммаВозврата Тогда
			РаспределениеОплатКоворкинг.Удалить(СтрокаРаспределениеОплат);
			
			ОстатокСуммаВозврата = СуммаВозврата - СтрокаРаспределениеОплат.СуммаОплаты;
		Иначе	
			СтрокаРаспределениеОплат.СуммаОплаты = СтрокаРаспределениеОплат.СуммаОплаты - ОстатокСуммаВозврата;   
			
			ОстатокСуммаВозврата = 0;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаДокументыОплаты.СуммаРаспределено = СтрокаДокументыОплаты.СуммаРаспределено - СуммаВозврата;
КонецЕсли;	
	
РаспределениеОплатКоворкингТЗ = РаспределениеОплатКоворкинг.Выгрузить(ОтборСтроки, "СуммаОплаты");
СуммаОплаты = РаспределениеОплатКоворкингТЗ.Итог("СуммаОплаты");
ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ДокументДолг, ДокументДолг.СчетГУИД
	, СуммаОплаты, Истина);

ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);

ЗафиксироватьТранзакцию();
КонецФункции	

//
Функция ПроверкаЗанятостиКоворкинг(ДанныеОбъекта) Экспорт
Результат = Новый Структура("Ошибка, Сообщение", Ложь, Неопределено);	
	
ДокументРегистратор = ДанныеОбъекта.Ссылка;
ДатаС = ДанныеОбъекта.ДатаС; ДатаПо = ДанныеОбъекта.ДатаПо;
ЧасС = ДанныеОбъекта.ЧасС; ЧасПо = ДанныеОбъекта.ЧасПо;
Ответ = КоворкингСервер.ЗанятостьНомераКоворкингПроверить(ДатаС, ДатаПо, ЧасС, ЧасПо, ДокументРегистратор); 
//Ответ = Новый Структура("Результат, НачалоПериодаРезерва, КонецПериодаРезерва, Регистратор"
Если Ответ.Результат Тогда 
	Сообщение = Новый Массив;
	ТекстСообщения = "" + ДанныеОбъекта.Ссылка + ".";
	
	Сообщение.Добавить(ТекстСообщения);
	ТекстСообщения = "В период с " + Формат(Ответ.НачалоПериодаРезерва, "ДФ=дд.ММ.гг"); 
	Если ЧасС <> 0 Тогда 
		ТекстСообщения = ТекстСообщения + " " + Формат(Ответ.НачалоПериодаРезерва, "ДФ=ЧЧ") + ":00";
	КонецЕсли;
	ТекстСообщения = ТекстСообщения + " по " + Формат(Ответ.КонецПериодаРезерва, "ДФ=дд.ММ.гг"); 
	Если ЧасПо <> 0 Тогда 
		ТекстСообщения = ТекстСообщения + " " + Формат(Ответ.КонецПериодаРезерва, "ДФ=ЧЧ") + ":00";
	КонецЕсли;

	Если ТипЗнч(ДокументРегистратор) = Тип("ДокументСсылка.КоворкингЗаявка") Тогда 
		КоворкингНомер = ДокументРегистратор.КоворкингНомер; 
	ИначеЕсли ТипЗнч(ДокументРегистратор) = Тип("ДокументСсылка.КоворкингСчета") Тогда 
		КоворкингНомер = ДокументРегистратор.КоворкингЗаявка.КоворкингНомер; 
	Иначе
		КоворкингНомер = "";
	КонецЕсли;
	ТекстСообщения = ТекстСообщения + " номер " + КоворкингНомер + " занят: ";
	Сообщение.Добавить(ТекстСообщения);
	
	//Если ТипЗнч(Ответ.Регистратор) = Тип("ДокументСсылка.КоворкингЗаявка") Тогда 
	//	Регистратор = Ответ.Регистратор;
	//	ТекстСообщения = Регистратор;
	//	Сообщение.Добавить(ТекстСообщения);
	//	
	//ИначеЕсли ТипЗнч(Ответ.Регистратор) = Тип("ДокументСсылка.КоворкингСчета") Тогда 
	//	ТекстСообщения = "Счет: " + Ответ.Регистратор;
	//	Сообщение.Добавить(ТекстСообщения);
	//	
	//	ТекстСообщения = "Заявка: " + Ответ.Регистратор.КоворкингЗаявка ;
	//	Сообщение.Добавить(ТекстСообщения);	
	//КонецЕсли;
	Регистратор = Ответ.Регистратор;
	ТекстСообщения = Регистратор;
	Сообщение.Добавить(ТекстСообщения);
	
	Результат.Ошибка = Истина;
	Результат.Сообщение = Сообщение;
КонецЕсли;

Возврат Результат;
КонецФункции

Функция ЗанятостьНомераКоворкингПроверить(ДатаС, ДатаПо, ЧасС, ЧасПо, ДокументРегистратор)  Экспорт
НачалоПериодаРезерва = ДатаС + ЧасС * 60 * 60;
КонецПериодаРезерва = ДатаПо + ?(ЧасПо = 0, 0, ЧасПо * 60 * 60 - 1);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗанятостьНомеровКоворкинг.КоворкингНомер КАК КоворкингНомер,
                      |	МИНИМУМ(ЗанятостьНомеровКоворкинг.ПериодРезерва) КАК ПериодРезерваМинимум,
                      |	МАКСИМУМ(ЗанятостьНомеровКоворкинг.ПериодРезерва) КАК ПериодРезерваМаксимум,
                      |	ЗанятостьНомеровКоворкинг.Регистратор КАК Регистратор
                      |ИЗ
                      |	РегистрСведений.ЗанятостьНомеровКоворкинг КАК ЗанятостьНомеровКоворкинг
                      |ГДЕ
                      |	ЗанятостьНомеровКоворкинг.ПериодРезерва МЕЖДУ &ПериодН И &ПериодК
                      |	И ЗанятостьНомеровКоворкинг.КоворкингНомер = &Номер
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЗанятостьНомеровКоворкинг.КоворкингНомер,
                      |	ЗанятостьНомеровКоворкинг.Регистратор");

Запрос.УстановитьПараметр("ПериодН",НачалоПериодаРезерва);
Запрос.УстановитьПараметр("ПериодК",КонецПериодаРезерва);

ЭтоЗаявка = ТипЗнч(ДокументРегистратор) = Тип("ДокументСсылка.КоворкингЗаявка");
Если ЭтоЗаявка Тогда 
	НомерКуда = ДокументРегистратор.КоворкингНомер;
Иначе 
	НомерКуда = ДокументРегистратор.КоворкингЗаявка.КоворкингНомер;
КонецЕсли; 
Запрос.УстановитьПараметр("Номер", НомерКуда);

ТЗ_Занято = Запрос.Выполнить().Выгрузить(); 

Регистратор = Неопределено;
Для Каждого Строка Из ТЗ_Занято Цикл
	Если ТипЗнч(Строка.Регистратор) = Тип("ДокументСсылка.КоворкингЗаявка") Тогда Продолжить; КонецЕсли;

	Если ЭтоЗаявка Тогда 
		Если Строка.Регистратор.КоворкингЗаявка = ДокументРегистратор Тогда Продолжить; КонецЕсли;
	Иначе
		Если Строка.Регистратор = ДокументРегистратор Тогда Продолжить; КонецЕсли;
	КонецЕсли;
	
	Регистратор = Строка.Регистратор;
	Прервать;
КонецЦикла;		

Если Регистратор = Неопределено Тогда 
	Для Каждого Строка Из ТЗ_Занято Цикл
		Если ТипЗнч(Строка.Регистратор) = Тип("ДокументСсылка.КоворкингСчета") Тогда Продолжить; КонецЕсли;

		Если ЭтоЗаявка Тогда 
			Если Строка.Регистратор = ДокументРегистратор Тогда Продолжить; КонецЕсли;
		Иначе
			Если Строка.Регистратор = ДокументРегистратор.КоворкингЗаявка Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		
		Регистратор = Строка.Регистратор;
		Прервать;
	КонецЦикла;			
КонецЕсли;

Если ЧасПо <> 0 Тогда КонецПериодаРезерва = КонецПериодаРезерва + 1; КонецЕсли;

Результат = (Регистратор <> Неопределено); 
Ответ = Новый Структура("Результат, НачалоПериодаРезерва, КонецПериодаРезерва, Регистратор"
	, Результат, НачалоПериодаРезерва, КонецПериодаРезерва, Регистратор);
Возврат Ответ;
КонецФункции	
//

Функция ДополнениеТекстКоворкинг(ДокументДолгСсылка) Экспорт
//Организация = ОбщийМодульНастройки.ПолучитьТекущуюОрганизацию();
//ДополнениеТекст = " от " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") 
//	+ " Номер заявки " +  ДокументДолгСсылка.Номер + " от " + Формат(ДокументДолгСсылка.Дата, "ДФ=dd.MM.yyyy"); 	
	
ДополнениеТекст = "Номер Счета " +  ДокументДолгСсылка.Номер + " от " + Формат(ДокументДолгСсылка.Дата, "ДФ=dd.MM.yyyy"); 	
	
Возврат ДополнениеТекст;
КонецФункции

Функция ОплачиваетСчет(СчетСсылка) Экспорт
Если ЗначениеЗаполнено(СчетСсылка.ОплачиваетСчет) Тогда	
	Возврат СчетСсылка.ОплачиваетСчет;
Иначе
	Возврат СчетСсылка.КоворкингЗаявка.Клиент; 	
КонецЕсли;
КонецФункции

Функция НачальныйЧасКонечныйЧас() Экспорт
НачальныйЧас = Константы.КоворкингНачальныйЧас.Получить();	
КонечныйЧас = Константы.КоворкингКонечныйЧас.Получить();	

Возврат Новый Структура("НачальныйЧас, КонечныйЧас", НачальныйЧас, КонечныйЧас); 
КонецФункции


// + ПСН 
Функция ПроверкаЗаполненияКоворкингЗаявкаТекстСообщения(ДанныеОбъект, Разделитель) Экспорт
ТекстСообщения = "";

Если ДанныеОбъект.Клиент.Пустая() тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнен клиент.", Разделитель);
конецесли;

Если ДанныеОбъект.КоворкингНомер.Пустая() тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнен номер.", Разделитель);
конецесли;

Если НЕ ЗначениеЗаполнено(ДанныеОбъект.ПериодАренды) Тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнен период аренды.", Разделитель);
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ДанныеОбъект.ДатаС) тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнено Дата С.", Разделитель);
конецесли;

Если НЕ ЗначениеЗаполнено(ДанныеОбъект.ДатаПо) тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнено Дата По.", Разделитель);
конецесли;

Если ДанныеОбъект.ДатаС > ДанныеОбъект.ДатаПо Тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Дата С > Дата По.", Разделитель); 
конецесли;

Если ДанныеОбъект.ПочасоваяОплата Тогда 
	Если ДанныеОбъект.ЧасС = 0 Тогда
		ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Не заполнен Час С.", Разделитель); 
	КонецЕсли;
	
	Если ДанныеОбъект.ЧасПо = 0 Тогда
		ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Не заполнен Час По.", Разделитель); 
	КонецЕсли;
КонецЕсли;

//Если ДанныеОбъект.Цена = 0 Тогда
//	ТекстСообщения = ОбщийМодульОбщиеКлиентСервер.ДобавитьТекст(ТекстСообщения, "Не заполнена Цена.", Разделитель); 
//конецесли;

Возврат ТекстСообщения;
КонецФункции

Функция ПроверкаЗаполненияКоворкингСчетТекстСообщения(ДанныеОбъект, Разделитель) Экспорт
ТекстСообщения = "";

Если ДанныеОбъект.КоворкингЗаявка.Пустая() тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнена Заявка.", Разделитель);
конецесли;

//Если ДанныеОбъект.ОплачиваетСчет.Пустая() тогда
//	ТекстСообщения = ОбщийМодульОбщиеКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнен Оплачивает.", Разделитель);
//конецесли;

Если НЕ ЗначениеЗаполнено(ДанныеОбъект.ДатаС) тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнено Дата С.", Разделитель);
конецесли;

Если НЕ ЗначениеЗаполнено(ДанныеОбъект.ДатаПо) тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Незаполнено Дата По.", Разделитель);
конецесли;

Если ДанныеОбъект.ДатаС > ДанныеОбъект.ДатаПо Тогда
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Дата С > Дата По.", Разделитель); 
конецесли;

Если ДанныеОбъект.ПочасоваяОплата Тогда
	Если ДанныеОбъект.ЧасС = 0 Тогда
		ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Не заполнен Час С.", Разделитель); 
	КонецЕсли;
	
	Если ДанныеОбъект.ЧасПо = 0 Тогда
		ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Не заполнен Час По.", Разделитель); 
	КонецЕсли;
КонецЕсли;

//Если ДанныеОбъект.Цена = 0 Тогда
//	ТекстСообщения = ОбщийМодульОбщиеКлиентСервер.ДобавитьТекст(ТекстСообщения, "Не заполнена Цена.", Разделитель); 
//конецесли;		

Возврат ТекстСообщения;
КонецФункции
// - ПСН 


//// + Заявка
Функция ЕстьКоворкингСчета(Заявка) Экспорт 
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	КоворкингСчета.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.КоворкингСчета КАК КоворкингСчета
                      |ГДЕ
                      |	КоворкингСчета.КоворкингЗаявка = &КоворкингЗаявка");

Запрос.УстановитьПараметр("КоворкингЗаявка", Заявка); 

Результат = Запрос.Выполнить();
Возврат НЕ Результат.Пустой();
КонецФункции
//// - Заявка

Процедура ЗаполнитьЧасыСписокВыбора(ЧасССписокВыбора, ЧасПоСписокВыбора) Экспорт 
ЧасССписокВыбора.Очистить();	
ЧасПоСписокВыбора.Очистить();	

Индекс = Константы.КоворкингНачальныйЧас.Получить();
КоворкингКонечныйЧас = Константы.КоворкингКонечныйЧас.Получить();
Пока Истина Цикл
	ЧасССписокВыбора.Добавить(Индекс);
	ЧасПоСписокВыбора.Добавить(Индекс);
	
	Индекс = Индекс + 1;
	Если Индекс > КоворкингКонечныйЧас Тогда Прервать; КонецЕсли;
КонецЦикла;
КонецПроцедуры

//// + Счета
Функция СледующийСчетДатаС(ЗаявкаОбъект) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	МАКСИМУМ(КоворкингСчета.ДатаПо) КАК ДатаПо
                      |ИЗ
                      |	Документ.КоворкингСчета КАК КоворкингСчета
                      |ГДЕ
                      |	КоворкингСчета.ПометкаУдаления = ЛОЖЬ
                      |	И КоворкингСчета.КоворкингЗаявка = &КоворкингЗаявка");	
Запрос.УстановитьПараметр("КоворкингЗаявка", ЗаявкаОбъект.Ссылка);	
Выборка = Запрос.Выполнить().Выбрать();

Выборка.Следующий();
Если ЗначениеЗаполнено(Выборка.ДатаПо) Тогда
	ДатаС = Выборка.ДатаПо + 86400;
Иначе
	ДатаС = ЗаявкаОбъект.ДатаС;
КонецЕсли;

Возврат ДатаС;
КонецФункции



Функция ДобавитьСчетЧасы(КоворкингЗаявкаОбъект) Экспорт
СчетОбъект = Документы.КоворкингСчета.СоздатьДокумент();
СчетОбъект.СчетГУИД = Новый УникальныйИдентификатор();

СчетОбъект.Дата = ТекущаяДата();
СчетОбъект.КоворкингЗаявка = КоворкингЗаявкаОбъект.Ссылка;      

Если ЗначениеЗаполнено(КоворкингЗаявкаОбъект.Оплачивает) Тогда
	СчетОбъект.ОплачиваетСчет = КоворкингЗаявкаОбъект.Оплачивает; 
Иначе
	СчетОбъект.ОплачиваетСчет = КоворкингЗаявкаОбъект.Клиент; 
КонецЕсли;

СчетОбъект.ПочасоваяОплата = Истина;

СледующийСчетДатаС = КоворкингСервер.СледующийСчетДатаС(КоворкингЗаявкаОбъект.Ссылка);
СчетОбъект.ДатаС = СледующийСчетДатаС;
СчетОбъект.ДатаПо = СчетОбъект.ДатаС;

СчетОбъект.ЧасС = КоворкингЗаявкаОбъект.ЧасС;
СчетОбъект.ЧасПо = КоворкингЗаявкаОбъект.ЧасПо;

//СрокиАренды = СчетОбъект.СрокиАренды;
//ЗаполнитьСрокиАренды(СрокиАренды, ДатаС, ДатаПо, КоворкингЗаявкаОбъект.ВключатьВыходные);

//СчетОбъект.Количество = СрокиАренды.Количество();
СчетОбъект.КоличествоЕдиниц = КоворкингЗаявкаОбъект.ЧасПо - КоворкингЗаявкаОбъект.ЧасС;
СчетОбъект.Количество = СчетОбъект.КоличествоЕдиниц;

СчетОбъект.Цена = КоворкингЗаявкаОбъект.Цена;
СчетОбъект.Сумма = СчетОбъект.Цена * СчетОбъект.Количество;

//СчетОбъект.ВключатьВыходные = КоворкингЗаявкаОбъект.ВключатьВыходные;

СчетОбъект.Записать(РежимЗаписиДокумента.Проведение); 

Возврат СчетОбъект.Ссылка;
КонецФункции

Функция ДобавитьСчетДни(КоворкингЗаявкаОбъект) Экспорт
ДатаС = СледующийСчетДатаС(КоворкингЗаявкаОбъект); 

ДатаПо = СчетДатаПо(ДатаС, КоворкингЗаявкаОбъект.ПериодАренды);
Если ДатаПо = Неопределено Тогда Возврат Неопределено; КонецЕсли; 

//
СчетОбъект = Документы.КоворкингСчета.СоздатьДокумент();
СчетОбъект.СчетГУИД = Новый УникальныйИдентификатор();

СчетОбъект.Дата = ТекущаяДата();
СчетОбъект.КоворкингЗаявка = КоворкингЗаявкаОбъект.Ссылка;      

Если ЗначениеЗаполнено(КоворкингЗаявкаОбъект.Оплачивает) Тогда
	СчетОбъект.ОплачиваетСчет = КоворкингЗаявкаОбъект.Оплачивает; 
Иначе
	СчетОбъект.ОплачиваетСчет = КоворкингЗаявкаОбъект.Клиент; 
КонецЕсли;

СчетОбъект.ПочасоваяОплата = Ложь;

СчетОбъект.ДатаС = ДатаС;
СчетОбъект.ДатаПо = ДатаПо;

//СрокиАренды = СчетОбъект.СрокиАренды;
//ЗаполнитьСрокиАренды(СрокиАренды, ДатаС, ДатаПо, КоворкингЗаявкаОбъект.ВключатьВыходные);
//ЗаполнитьСрокиАренды(СрокиАренды, ДатаС, ДатаПо);
//СчетОбъект.КоличествоЕдиниц = СрокиАренды.Количество();

//РазницаВДнях = РазницаВДнях(СчетОбъект.ДатаС, СчетОбъект.ДатаПо, КоворкингЗаявкаОбъект.ВключатьВыходные);	
РазницаВДнях = (НачалоДня(СчетОбъект.ДатаПо) - НачалоДня(СчетОбъект.ДатаС)) / (60 * 60 * 24) + 1;	
СчетОбъект.КоличествоЕдиниц = РазницаВДнях;

СчетОбъект.Цена = КоворкингЗаявкаОбъект.Цена;

//РазницаВДнях = РазницаВДнях(СчетОбъект.ДатаС, СчетОбъект.ДатаПо, КоворкингЗаявкаОбъект.ВключатьВыходные);	
Если КоворкингЗаявкаОбъект.ПериодАренды = "МЕСЯЦ" Тогда
	//ДлинаМесяца = РазницаВДнях(НачалоДня(НачалоМесяца(СчетОбъект.ДатаПо)), НачалоДня(КонецМесяца(СчетОбъект.ДатаС))
	//	, КоворкингЗаявкаОбъект.ВключатьВыходные); 
	//
	//СчетОбъект.Количество = РазницаВДнях/ДлинаМесяца;
	
	СчетОбъект.Количество = 1;
ИначеЕсли КоворкингЗаявкаОбъект.ПериодАренды = "НЕДЕЛЯ" Тогда
	//Если КоворкингЗаявкаОбъект.ВключатьВыходные Тогда
	//	ДлинаНедели = 7;
	//Иначе
	//	ДлинаНедели = 5;
	//КонецЕсли;
	//СчетОбъект.Количество = РазницаВДнях / ДлинаНедели;

	СчетОбъект.Количество = 1;
ИначеЕсли КоворкингЗаявкаОбъект.ПериодАренды = "ДЕНЬ" Тогда
	СчетОбъект.Количество = 1;
Иначе
	Возврат Неопределено;
КонецЕсли;
СчетОбъект.Сумма = СчетОбъект.Цена * СчетОбъект.Количество;

//СчетОбъект.ВключатьВыходные = КоворкингЗаявкаОбъект.ВключатьВыходные;

СчетОбъект.Записать(РежимЗаписиДокумента.Проведение);

Возврат СчетОбъект.Ссылка;
КонецФункции


Функция СчетДатаПо(ДатаС, ПериодАренды) Экспорт
Если ПериодАренды = "МЕСЯЦ" Тогда
	День = День(ДатаС);
	
	Месяц = Месяц(ДатаС);
	Год = Год(ДатаС);
	
	Если День > 1 Тогда
		Месяц = Месяц + 1;
	КонецЕсли;
	
	Если Месяц > 12 Тогда
		Месяц = 1;
		Год = Год + 1;
	КонецЕсли;
	
    // + Аудит
	//Дата_П = Дата(Год, Месяц, День);
	Попытка 	
		День_П = День;
		Дата_П = Дата(Год, Месяц, День_П);
	Исключение
		Попытка 	
			День_П = День - 1;
			Дата_П = Дата(Год, Месяц, День_П);
		Исключение
			Попытка 	
				День_П = День - 2;
				Дата_П = Дата(Год, Месяц, День_П);
			Исключение
				День_П = День - 3;
				Дата_П = Дата(Год, Месяц, День_П);
			КонецПопытки;
		КонецПопытки;
	КонецПопытки;
    // - Аудит
		
	Если День = 1 Тогда
		Дата_П = КонецМесяца(Дата_П);
	Иначе
		Дата_П = Дата_П - 86400; 
	КонецЕсли;
	
	ДатаПо = Дата_П;
	
	//ДатаПо = КонецМесяца(ДатаС);
	//Если НЕ КоворкингЗаявкаОбъект.ВключатьВыходные Тогда
	//	ДатаПо = РабочийДень(ДатаПо, Истина);
	//КонецЕсли;
ИначеЕсли ПериодАренды = "НЕДЕЛЯ" Тогда
	
	ДатаПо = ДатаС + 6*86400;
	
	//Если КоворкингЗаявкаОбъект.ВключатьВыходные Тогда
	//	ДатаПо = КонецНедели(ДатаС);
	//	ДатаПо = ДатаПо + 7*86400;
	//Иначе
	//	ДатаПо = КонецНедели(ДатаС);
	//	ДатаПо = ДатаПо - 2*86400;
	//КонецЕсли;

ИначеЕсли ПериодАренды = "ДЕНЬ" Тогда
	ДатаПо = НачалоДня(ДатаС);
ИначеЕсли ПериодАренды = "ЧАС" Тогда
	ДатаПо = НачалоДня(ДатаС);
Иначе	
	Возврат Неопределено;
КонецЕсли;	

Возврат НачалоДня(ДатаПо); 
КонецФункции	

Процедура ЗаполнитьСрокиАренды(СрокиАренды, ДатаС, ДатаПо) Экспорт
СрокиАренды.Очистить();
Дата_П = ДатаС;
Пока Дата_П <= ДатаПо Цикл
	НоваяСтрока = СрокиАренды.Добавить(); 
	НоваяСтрока.СрокАренды = Дата_П;
	
	Дата_П = Дата_П + 86400;
КонецЦикла;
КонецПроцедуры 

// + Удаление Счета
Функция УдалитьСчет(СчетСсылка) Экспорт
СчетОбъект = СчетСсылка.ПолучитьОбъект();
СчетОбъект.Удалить();
КонецФункции

Функция ЕстьОплатыСчет(Счет) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	КоворкингСчетаДокументыОплаты.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                      |ГДЕ
                      |	КоворкингСчетаДокументыОплаты.Ссылка = &Счет");
Запрос.УстановитьПараметр("Счет", Счет); 

РезультатЗапроса = Запрос.Выполнить();
Возврат НЕ РезультатЗапроса.Пустой(); 
КонецФункции
// - Удаление Счета

Функция УдалитьДокументОплаты(ДокументОплаты, Объект) Экспорт
	
ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты); 
РаспределениеОплатКУдалению = Объект.РаспределениеОплатКоворкинг.НайтиСтроки(ОтборСтроки);

Для Каждого Строка Из РаспределениеОплатКУдалению Цикл
	Если Строка.ЭтоУслуга Тогда
		ОтборСтроки = Новый Структура("ГУИД", Строка.ГУИДДолги);
		НайденныеСтроки = Объект.ДопУслугиКоворкинг.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		СтрокаУслуга = НайденныеСтроки[0];
		СтрокаУслуга.СуммаОплачено = СтрокаУслуга.СуммаОплачено - Строка.СуммаОплаты;
	Иначе
		Объект.СуммаОплачено = Объект.СуммаОплачено - Строка.СуммаОплаты;
	КонецЕсли;
КонецЦикла;

Для Каждого Строка Из РаспределениеОплатКУдалению Цикл
	Объект.РаспределениеОплатКоворкинг.Удалить(Строка);	
КонецЦикла;

ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);	
СтрокиОплатыКУдалению = Объект.ДокументыОплаты.НайтиСтроки(ОтборСтроки);
Для Каждого Строка Из СтрокиОплатыКУдалению Цикл
	Объект.ДокументыОплаты.Удалить(Строка);
КонецЦикла;
	
КонецФункции


// + ВключатьВыходные Не используется
Процедура ЗаполнитьСрокиАрендыВключатьВыходные(СрокиАренды, ДатаС, ДатаПо, ВключатьВыходные) Экспорт
СрокиАренды.Очистить();
Дата_П = ДатаС;
Пока Дата_П <= ДатаПо Цикл
	Если НЕ ВключатьВыходные Тогда 
		Если ДеньНедели(Дата_П) > 5 Тогда Перейти ~Продолжение; КонецЕсли;
	КонецЕсли;	
	
	НоваяСтрока = СрокиАренды.Добавить(); 
	НоваяСтрока.СрокАренды = Дата_П;
	
~Продолжение:	
	Дата_П = Дата_П + 86400;
КонецЦикла;
КонецПроцедуры 

Функция РазницаВДняхВключатьВыходные(ДатаС, ДатаПо, ВключатьВыходные)
Если ВключатьВыходные Тогда
	РазницаВДнях = (НачалоДня(ДатаПо) - НачалоДня(ДатаС)) / (60 * 60 * 24) + 1;	
Иначе
	РазницаВДнях = 0;
	Дата_П = ДатаС;
	Пока Дата_П <= ДатаПо Цикл
		Если ЭтоРабочийДень(Дата_П) Тогда 
		   РазницаВДнях = РазницаВДнях + 1;
		КонецЕсли;	
		Дата_П = Дата_П + 86400;	
	КонецЦикла;
КонецЕсли;
	
Возврат РазницаВДнях;	
КонецФункции

Функция ЭтоРабочийДень(Дата)
ДеньНедели = ДеньНедели(Дата);

Остаток = ДеньНедели - 5;
ЭтоРабочийДень = (Остаток <= 0); 
Возврат ЭтоРабочийДень;
КонецФункции

Функция РабочийДень(Дата, ПредыдущийДень) 
ДеньНедели = ДеньНедели(Дата);

Остаток = ДеньНедели - 5;
Если Остаток <= 0 Тогда Возврат Дата; КонецЕсли;

Если ПредыдущийДень Тогда
	РабочийДень = Дата - Остаток*86400; 	
Иначе
	Если Остаток = 2 Тогда
		Остаток = 1;
	Иначе 
		Остаток = 2;
	КонецЕсли;	
	
	РабочийДень = Дата + Остаток*86400; 	
КонецЕсли;	
Возврат РабочийДень;	
КонецФункции
// - ВключатьВыходные Не используется
//// - Счета


//// + Оплаты

//
Процедура ДобавитьДокументОплатаКоворкингСчет(ДокументОплаты, ДокументДолгОбъектДанныеСсылка) Экспорт  
НачатьТранзакцию();

ДокументДолгОбъект = ДокументДолгОбъектДанныеСсылка.ПолучитьОбъект();

СуммаРаспределено = 0;
РаспределитьДокументОплатаКоворкингСчетОбъект(ДокументОплаты, ДокументДолгОбъект, СуммаРаспределено);

НоваяОплата = ДокументДолгОбъект.ДокументыОплаты.Добавить();
НоваяОплата.ДокументОплаты = ДокументОплаты;
НоваяОплата.СуммаРаспределено = СуммаРаспределено;

ДокументДолгОбъект.Записать(РежимЗаписиДокумента.Проведение);

Если СуммаРаспределено <> 0 Тогда
	ОплатыОбщееСервер.ЗаполнитьДокументОплатыДолгОплатаДляКоворкинг(ДокументОплаты
		, ДокументДолгОбъектДанныеСсылка, НоваяОплата.СуммаРаспределено);		
КонецЕсли;
	
ЗафиксироватьТранзакцию();	
Конецпроцедуры

Процедура РаспределитьДокументОплатаКоворкингСчетОбъект(ДокументОплаты, ДокументДолгОбъект, СуммаРаспределено) Экспорт  
Если ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.КассовыйДокумент")
И ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.ВыпискаБанка")
Тогда Возврат; КонецЕсли;
	
СуммаКоплате = СуммаКОплатеКоворкинг(ДокументДолгОбъект);
Если СуммаКоплате = 0 Тогда Возврат; КонецЕсли;

Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КассовыйДокумент.Сумма КАК Сумма
	                      |ИЗ
	                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
	                      |ГДЕ
	                      |	КассовыйДокумент.ВозвратДокумент = &ВозвратДокумент
	                      |	И КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	КассовыйДокумент.ВозвратДокумент,
	                      |	КассовыйДокумент.Сумма");
Иначе 
 	Запрос = Новый Запрос("ВЫБРАТЬ
 	                      |	ВыпискаБанка.Сумма КАК Сумма
 	                      |ИЗ
 	                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
 	                      |ГДЕ
 	                      |	ВыпискаБанка.ВозвратДокумент = &ВозвратДокумент
 	                      |	И ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
 	                      |
 	                      |СГРУППИРОВАТЬ ПО
 	                      |	ВыпискаБанка.ВозвратДокумент,
 	                      |	ВыпискаБанка.Сумма");
КонецЕсли;

Запрос.УстановитьПараметр("ВозвратДокумент", ДокументОплаты);
Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	СуммаВозврата = Выборка.Сумма; 
Иначе
	СуммаВозврата = 0;
КонецЕсли;
ОстатокДокументОплаты = ДокументОплаты.Сумма - СуммаВозврата;

Если СуммаКоплате < ОстатокДокументОплаты Тогда
	СуммаКРаспределению = СуммаКоплате;
Иначе
	СуммаКРаспределению = ОстатокДокументОплаты;
КонецЕсли;

ОстатокКРаспределению = СуммаКРаспределению;
СуммаРаспределено = 0;

Если ДокументДолгОбъект.СуммаОплачено <> ДокументДолгОбъект.Сумма Тогда

	РаспределениеОплатКоворкинг = ДокументДолгОбъект.РаспределениеОплатКоворкинг;
	ОтборСтроки = Новый Структура("ДокументОплаты, ЭтоУслуга", ДокументОплаты, Ложь);
	НайденныеСтроки = РаспределениеОплатКоворкинг.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаРаспределениеОплатКоворкинг = РаспределениеОплатКоворкинг.Добавить();
		СтрокаРаспределениеОплатКоворкинг.ДокументОплаты = ДокументОплаты;
		СтрокаРаспределениеОплатКоворкинг.ЭтоУслуга = Ложь;
	Иначе
		СтрокаРаспределениеОплатКоворкинг = НайденныеСтроки[0];
	КонецЕсли;

	Если ДокументДолгОбъект.СуммаОплачено < ДокументДолгОбъект.Сумма Тогда
		СуммаКЗакрытию = ДокументДолгОбъект.Сумма - ДокументДолгОбъект.СуммаОплачено; 
		Если ОстатокКРаспределению > СуммаКЗакрытию Тогда
			СтрокаРаспределениеОплатКоворкинг.СуммаОплаты = СуммаКЗакрытию;
			ДокументДолгОбъект.СуммаОплачено = ДокументДолгОбъект.Сумма;
			
			СуммаРаспределено = СуммаКЗакрытию;
			ОстатокКРаспределению = ОстатокКРаспределению - СуммаКЗакрытию;
		Иначе
			СтрокаРаспределениеОплатКоворкинг.СуммаОплаты = ОстатокКРаспределению;
			ДокументДолгОбъект.СуммаОплачено = ДокументДолгОбъект.СуммаОплачено + ОстатокКРаспределению;
			
			СуммаРаспределено = ОстатокКРаспределению;
			
			ОстатокКРаспределению = 0;
		КонецЕсли;
	КонецЕсли;
КонецЕсли;
	
Если ОстатокКРаспределению > 0 Тогда
	Для Каждого Строка Из ДокументДолгОбъект.ДопУслугиКоворкинг Цикл
		Если Строка.Сумма <> Строка.СуммаОплачено Тогда 
		
			РаспределениеОплатКоворкинг = ДокументДолгОбъект.РаспределениеОплатКоворкинг;
			ОтборСтроки = Новый Структура("ДокументОплаты, ГУИДДолги", ДокументОплаты, Строка.ГУИД);
			НайденныеСтроки = РаспределениеОплатКоворкинг.НайтиСтроки(ОтборСтроки);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаРаспределениеОплатКоворкинг = РаспределениеОплатКоворкинг.Добавить();
				СтрокаРаспределениеОплатКоворкинг.ДокументОплаты = ДокументОплаты;
				СтрокаРаспределениеОплатКоворкинг.ЭтоУслуга = Истина;
				СтрокаРаспределениеОплатКоворкинг.ГУИДДолги = Строка.ГУИД;
			Иначе
				СтрокаРаспределениеОплатКоворкинг = НайденныеСтроки[0];
			КонецЕсли;
			
			Если Строка.СуммаОплачено < Строка.Сумма Тогда
				СуммаКЗакрытию = Строка.Сумма - Строка.СуммаОплачено; 
				Если ОстатокКРаспределению > СуммаКЗакрытию Тогда
					СтрокаРаспределениеОплатКоворкинг.СуммаОплаты = СуммаКЗакрытию;
					СуммаРаспределено = СуммаРаспределено + СуммаКЗакрытию;
					
					Строка.СуммаОплачено = Строка.Сумма;
					ОстатокКРаспределению = ОстатокКРаспределению - СуммаКЗакрытию;
				Иначе
					СтрокаРаспределениеОплатКоворкинг.СуммаОплаты = ОстатокКРаспределению;
					СуммаРаспределено = СуммаРаспределено + ОстатокКРаспределению;

					Строка.СуммаОплачено = Строка.СуммаОплачено + ОстатокКРаспределению;
					ОстатокКРаспределению = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОстатокКРаспределению = 0 Тогда Прервать; КонецЕсли;
		
	КонецЦикла;
КонецЕсли;	
Конецпроцедуры

Функция СуммаКОплатеКоворкинг(ДокументДолгОбъект) Экспорт
СуммаКоплате = ДокументДолгОбъект.Сумма - ДокументДолгОбъект.СуммаОплачено
	+ ДокументДолгОбъект.ДопУслугиКоворкинг.Итог("Сумма") 
	- ДокументДолгОбъект.ДопУслугиКоворкинг.Итог("СуммаОплачено");
	
Возврат СуммаКоплате;
КонецФункции

Процедура ОбновитьОплатыКоворкинг(ДокументДолгОбъект) Экспорт
Для каждого Строка Из ДокументДолгОбъект.ДокументыОплаты Цикл
	Строка.СуммаРаспределено = 0;	
КонецЦикла;

ДокументДолгОбъект.СуммаОплачено = 0;

Для каждого Строка Из ДокументДолгОбъект.ДопУслугиКоворкинг Цикл
	Строка.СуммаОплачено = 0;	
КонецЦикла;
ДокументДолгОбъект.РаспределениеОплатКоворкинг.Очистить();

МассивКУдалению = Новый Массив;
Для каждого Строка Из ДокументДолгОбъект.ДокументыОплаты Цикл
	СуммаРаспределено = 0;
	РаспределитьДокументОплатаКоворкингСчетОбъект(Строка.ДокументОплаты, ДокументДолгОбъект, СуммаРаспределено);
	
	Если СуммаРаспределено = 0 Тогда
		 МассивКУдалению.Добавить(Строка);
	Иначе
		Строка.СуммаРаспределено = СуммаРаспределено;
		
		ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(Строка.ДокументОплаты
			, ДокументДолгОбъект.Ссылка, ДокументДолгОбъект.СчетГУИД, СуммаРаспределено, Истина); 	
	КонецЕсли;	
	
    // + Аудит
	//Для Каждого Строка Из МассивКУдалению Цикл
	//	ОплатыОбщееСервер.УдалитьДокументОплатыДолгОплатыИДокументОплаты(Строка.ДокументОплаты
	//		,ДокументДолгОбъект.Ссылка, ДокументДолгОбъект.СчетГУИД); 
	//		
	//	ДокументДолгОбъект.ДокументыОплаты.Удалить(Строка);
	//КонецЦикла;
    // - Аудит
КонецЦикла;
                          
// + Аудит
Для Каждого Строка Из МассивКУдалению Цикл
	ОплатыОбщееСервер.УдалитьДокументОплатыДолгОплатыИДокументОплаты(Строка.ДокументОплаты
		,ДокументДолгОбъект.Ссылка, ДокументДолгОбъект.СчетГУИД); 
		
	ДокументДолгОбъект.ДокументыОплаты.Удалить(Строка);
КонецЦикла;
// - Аудит

КонецПроцедуры
//




//// - Оплаты
//// ++++++++++++++++++++++++++++++++++++++++++



