&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("КатегорияНомера", КатегорияНомера);
Если НЕ ЗначениеЗаполнено(КатегорияНомера) Тогда
	КатегорияНомера=СправочникиКатегорииНомеровСтандартный();
КонецЕсли;	

Элементы.Двухместный.ТолькоПросмотр = КатегорияНомера.ТолькоОдноместный;

ЕстьТарифныйПлан = Константы.ТарифныеПланы.Получить();
Элементы.ТарифныйПлан.Видимость = ЕстьТарифныйПлан;   

Если НастройкиСервер.ЭтоЛайв() Тогда
	Элементы.ИтогоЗаПроживаниеБезЗавтрака.Видимость = Ложь;	
	Элементы.РасшифровкаСтоимостиСтоимостьБезЗавтрака.Видимость = Ложь;	
КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция  СправочникиКатегорииНомеровСтандартный()
Возврат Справочники.КатегорииНомеров.НайтиПоРеквизиту("Стандартный", Истина);	
//Возврат Справочники.КатегорииНомеров.НайтиПоНаименованию("Стандартный");	
КонецФункции

// + Поля Параметры
&НаКлиенте
Процедура ДатаНачалаПроживанияПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(ДатаОкончанияПроживания) Тогда Возврат; КонецЕсли;

Если ДатаОкончанияПроживания < ДатаНачалаПроживания Тогда
	ПоказатьПредупреждение(, "Дата начала проживания БОЛЬШЕ Даты окончания проживания !");  	
	Возврат;	
КонецЕсли;

РассчитатьПроживаниеНаСервере(); 
КонецПроцедуры 

&НаКлиенте
Процедура ДатаОкончанияПроживанияПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(ДатаНачалаПроживания) Тогда Возврат; КонецЕсли;

Если ДатаОкончанияПроживания < ДатаНачалаПроживания Тогда
	ПоказатьПредупреждение(, "Дата окончания проживания МЕНЬШЕ Даты начала проживания !");  	
	Возврат;	
КонецЕсли;

РассчитатьПроживаниеНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНомераПриИзменении(Элемент)
ТолькоОдноместный = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(КатегорияНомера, "ТолькоОдноместный"); 
Если ТолькоОдноместный Тогда
	 Двухместный = Ложь;
КонецЕсли;
Элементы.Двухместный.ТолькоПросмотр = ТолькоОдноместный;
	
РассчитатьПроживаниеНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ДвухместныйПриИзменении(Элемент)
РассчитатьПроживаниеНаСервере(); 
КонецПроцедуры
// - Поля Параметры

&НаКлиенте
Процедура РассчитатьПроживание(Команда)      
РассчитатьПроживаниеНаСервере(); 
КонецПроцедуры

&НаСервере
Функция РассчитатьПроживаниеНаСервере() Экспорт
Если НЕ ЗначениеЗаполнено(КатегорияНомера) Тогда Возврат Неопределено; КонецЕсли; 
Если НЕ (ЗначениеЗаполнено(ДатаНачалаПроживания) 
		И ЗначениеЗаполнено(ДатаОкончанияПроживания)) 
Тогда Возврат Неопределено; КонецЕсли; 

ЕстьТарифныйПлан = ЗначениеЗаполнено(ТарифныйПлан);

ДТН=НачалоДня(ДатаНачалаПроживания);

РасшифровкаСтоимости.Очистить();
Пока ДТН<=НачалоДня(ДатаОкончанияПроживания - 86400) Цикл 
	
	НовДТ = РасшифровкаСтоимости.Добавить();
	
	НовДТ.ДатаПроживания=ДТН;
	
	ЦенаТарифныйПлан = 0; ЦенаТарифныйПланБезЗавтрака = 0;
	Если ЕстьТарифныйПлан Тогда
		ЦенаТарифныйПлан = ДокументыСервер.ЦенаНаДеньТарифныйПлан(ДТН, ТарифныйПлан, КатегорияНомера, Ложь, Двухместный);
		ЦенаТарифныйПланБезЗавтрака = ДокументыСервер.ЦенаНаДеньТарифныйПлан(ДТН, ТарифныйПлан, КатегорияНомера, Истина, Двухместный);
	КонецЕсли;
	
	Если ЦенаТарифныйПлан <> 0 Тогда
	    НовДТ.Стоимость = ЦенаТарифныйПлан;
		НовДТ.ТарифныйПлан = "V";
	Иначе		
		НовДТ.Стоимость = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомера, Ложь, Двухместный);
	КонецЕсли;
		
	Если ЦенаТарифныйПланБезЗавтрака <> 0 Тогда
	    НовДТ.СтоимостьБезЗавтрака = ЦенаТарифныйПланБезЗавтрака;
		НовДТ.ТарифныйПлан = "V";
	Иначе	
		НовДТ.СтоимостьБезЗавтрака = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(ДТН,КатегорияНомера, Истина, Двухместный);
	КонецЕсли;
	
	ДТН=ДТН+86400;
КонецЦикла;

ИтогоЗаПроживание = РасшифровкаСтоимости.Итог("Стоимость");
ИтогоЗаПроживаниеБезЗавтрака = РасшифровкаСтоимости.Итог("СтоимостьБезЗавтрака");
КонецФункции

Функция РассчитатьПроживаниеНаСервере_1() Экспорт
Если НЕ ЗначениеЗаполнено(КатегорияНомера) Тогда Возврат Неопределено; КонецЕсли; 
Если НЕ (ЗначениеЗаполнено(ДатаНачалаПроживания) 
		И ЗначениеЗаполнено(ДатаОкончанияПроживания)) 
Тогда Возврат Неопределено; КонецЕсли; 

ДТН=НачалоДня(ДатаНачалаПроживания);

РасшифровкаСтоимости.Очистить();
Пока ДТН<=НачалоДня(ДатаОкончанияПроживания - 86400) Цикл 
	
	НовДТ = РасшифровкаСтоимости.Добавить();
	
	НовДТ.ДатаПроживания=ДТН;
	 
	НовДТ.Стоимость = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомера, Ложь, Двухместный);
	
	НовДТ.СтоимостьБезЗавтрака = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(ДТН,КатегорияНомера, Истина, Двухместный);
	
	ДТН=ДТН+86400;
КонецЦикла;

ИтогоЗаПроживание = РасшифровкаСтоимости.Итог("Стоимость");
ИтогоЗаПроживаниеБезЗавтрака = РасшифровкаСтоимости.Итог("СтоимостьБезЗавтрака");
КонецФункции


&НаКлиенте
Процедура ПоказатьПроживание(Команда)
Если РасшифровкаСтоимости.Количество() = 0 Тогда Возврат; КонецЕсли;
	
ТабДок = ПоказатьПроживаниеНаСервере();	

ТабДок.Показать("Расчет проживания");
КонецПроцедуры

&НаСервере
Функция ПоказатьПроживаниеНаСервере()
	
	Макет=Обработки.РасчетПроживания.ПолучитьМакет("РасшифровкаСтоимости");
	
	ТабДок=Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.ДТ=Формат(ДатаНачалаПроживания, "ДФ=dd.MM");
	Обл.Параметры.ДТК=Формат(ДатаОкончанияПроживания, "ДФ=dd.MM");
	ТабДок.Вывести(Обл);
	
	Для Каждого Строка из РасшифровкаСтоимости Цикл 		
		Обл=Макет.ПолучитьОбласть("Строка");
		
		Обл.Параметры.Дата=Формат(Строка.ДатаПроживания, "ДФ=dd.MM");
		
		Обл.Параметры.Стоимость=Формат(Строка.Стоимость, "ЧГ=");
		Обл.Параметры.СтоимостьБезЗавтрака = Формат(Строка.СтоимостьБезЗавтрака, "ЧГ=");
		
		Обл.Параметры.ТарифныйПлан = Строка.ТарифныйПлан;
		
		ТабДок.Вывести(Обл);
	КонецЦикла;
	
	Обл=Макет.ПолучитьОбласть("Итого");
	Обл.Параметры.Стоимость=Формат(ИтогоЗаПроживание, "ЧГ=");
	Обл.Параметры.СтоимостьБезЗавтрака=Формат(ИтогоЗаПроживаниеБезЗавтрака, "ЧГ=");
	ТабДок.Вывести(Обл);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабДок;
	//ТабДок.Показать();
КонецФункции





