
&НаСервере
Функция ОбщееКоличествоНомеров()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоНомеров
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд
                      |ГДЕ
                      |	НомернойФонд.ПометкаУдаления = ЛОЖЬ");

ТЗ = Запрос.Выполнить().Выгрузить();
ОбщееКоличествоНомеров = ТЗ[0].КоличествоНомеров;

Возврат ОбщееКоличествоНомеров;
КонецФункции

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
Если Помесячно Тогда
	ДатаС = НачалоМесяца(ДатаС);	
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
Если Помесячно Тогда
	ДатаПо = КонецМесяца(ДатаПо);	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПомесячноПриИзменении(Элемент)
Если Помесячно Тогда
	Если ЗначениеЗаполнено(ДатаС) Тогда ДатаС = НачалоМесяца(ДатаС); КонецЕсли;	
	Если ЗначениеЗаполнено(ДатаПо) Тогда ДатаПо = КонецМесяца(ДатаПо); КонецЕсли;	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверкаДаты()
Если НЕ ЗначениеЗаполнено(ДатаС) 
ИЛИ НЕ ЗначениеЗаполнено(ДатаПо) Тогда
	ПоказатьПредупреждение(, "Пустые даты");
	
	Возврат Истина;
КонецЕсли;

Если ДатаС > ДатаПо Тогда 
	ПоказатьПредупреждение(, "Дата с > дата по");
	
	Возврат Истина;
КонецЕсли;
	
Возврат Ложь;	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
Если ПроверкаДаты() Тогда Возврат; КонецЕсли;

СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
ТЗ_ОтчетДанные = ЕжедневныйОтчетФакт.ТЗ_ОтчетДанные(ДатаС, ДатаПо);	
	
ЕжедневныйОтчетФакт.ЗаполнитьРегистрЕжедневныйОтчетФакт(ТЗ_ОтчетДанные);

ВывестиОтчет();

КонецПроцедуры

&НаСервере
Процедура ВывестиОтчет()
ПолеОтчета.Очистить();	
	
Макет = Обработки.ЕжедневныйОтчетФакт.ПолучитьМакет("Макет");

Область = Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(Область);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЕжедневныйОтчетФакт.Дата КАК Дата,
                      |	ЕжедневныйОтчетФакт.Отель КАК Отель,
                      |	ЕжедневныйОтчетФакт.КоличествоНомеров КАК КоличествоНомеров,
                      |	ЕжедневныйОтчетФакт.КоличествоДвухместныеРазмещения КАК КоличествоДвухместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаДвухместныеРазмещения КАК СуммаДвухместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.КоличествоОдноместныеРазмещения КАК КоличествоОдноместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаОдноместныеРазмещения КАК СуммаОдноместныеРазмещения,
                      |	ЕжедневныйОтчетФакт.СуммаАгентскогоВознаграждения КАК СуммаАгентскогоВознаграждения,
                      |	ЕжедневныйОтчетФакт.Процент_НА КАК Процент_НА,
                      |	ЕжедневныйОтчетФакт.ADR_НА КАК ADR_НА,
                      |	ЕжедневныйОтчетФакт.СуммаВ2В КАК СуммаВ2В,
                      |	ЕжедневныйОтчетФакт.СуммаКомиссии КАК СуммаКомиссии,
                      |	ЕжедневныйОтчетФакт.Мероприятия КАК Мероприятия
                      |ИЗ
                      |	РегистрСведений.ЕжедневныйОтчетФакт КАК ЕжедневныйОтчетФакт
                      |ГДЕ
                      |	ЕжедневныйОтчетФакт.Дата >= &ДатаС
                      |	И ЕжедневныйОтчетФакт.Дата <= &ДатаПо");

Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ = Запрос.Выполнить().Выгрузить();

ОтборСтроки = Новый Структура("Дата", Неопределено);
ТЗИтоги = ТЗ.Скопировать(ОтборСтроки);

ТЗИтоги.Колонки.Добавить("ADRДвухместныеРазмещения");
ТЗИтоги.Колонки.Добавить("ADRОдноместныеРазмещения");
ТЗИтоги.Колонки.Добавить("ИтогоЗанятыеНомера");
ТЗИтоги.Колонки.Добавить("ИтогоСумма");
ТЗИтоги.Колонки.Добавить("ПроцентЗаселяемости");
ТЗИтоги.Колонки.Добавить("ИтогоСредняяСтоимоть");
ТЗИтоги.Колонки.Добавить("ПроцентДвухместныеРазмещения");
ТЗИтоги.Колонки.Добавить("ПроцентОдноместныеРазмещения");

Итоги = ТЗИтоги.Добавить();

Для Каждого Колонка Из ТЗИтоги.Колонки Цикл
	Если Колонка.Имя = "Дата"
	ИЛИ Колонка.Имя = "Отель"  
	ИЛИ Колонка.Имя = "КоличествоНомеров"  
	Тогда Продолжить; КонецЕсли;
	
	Итоги[Колонка.Имя] = 0;
КонецЦикла;

Итоги.Дата = Неопределено;
Итоги.КоличествоНомеров = 0;
Если ТЗ.Количество() > 0 Тогда
	Отель = ТЗ[0].Отель;
	Итоги.Отель = Отель;
Иначе
	Отель = "";
	Итоги.Отель = Отель;
КонецЕсли;

//
ТЗИтогиМесяц = ТЗ.Скопировать(ОтборСтроки);

ТЗИтогиМесяц.Колонки.Добавить("ADRДвухместныеРазмещения");
ТЗИтогиМесяц.Колонки.Добавить("ADRОдноместныеРазмещения");
ТЗИтогиМесяц.Колонки.Добавить("ИтогоЗанятыеНомера");
ТЗИтогиМесяц.Колонки.Добавить("ИтогоСумма");
ТЗИтогиМесяц.Колонки.Добавить("ПроцентЗаселяемости");
ТЗИтогиМесяц.Колонки.Добавить("ИтогоСредняяСтоимоть");
ТЗИтогиМесяц.Колонки.Добавить("ПроцентДвухместныеРазмещения");
ТЗИтогиМесяц.Колонки.Добавить("ПроцентОдноместныеРазмещения");

ИтогиМесяц = ТЗИтогиМесяц.Добавить();

Для Каждого Колонка Из ТЗИтогиМесяц.Колонки Цикл
	Если Колонка.Имя = "Дата"
	ИЛИ Колонка.Имя = "Отель"  
	ИЛИ Колонка.Имя = "КоличествоНомеров"  
	Тогда Продолжить; КонецЕсли;
	
	ИтогиМесяц[Колонка.Имя] = 0;
КонецЦикла;

ИтогиМесяц.Дата = Неопределено;
ИтогиМесяц.КоличествоНомеров = 0;
Если ТЗ.Количество() > 0 Тогда
	Отель = ТЗ[0].Отель;
	ИтогиМесяц.Отель = Отель;
	
	ДатаМесяц_П = НачалоМесяца(ТЗ[0].Дата);
Иначе
	Отель = "";
	ИтогиМесяц.Отель = Отель;
	
	ДатаМесяц_П = '00010101';
КонецЕсли;
КоличествоЗаписейИтогиМесяц = 0;
//
Для Каждого Строка Из ТЗ Цикл

	
	Область = Макет.ПолучитьОбласть("Строка");	
	
	ОбластьПараметры = Область.Параметры; 
	
	//ОбластьПараметры.Дата = Формат(Строка.Дата,"ДФ=dd.MM.yy");
	ОбластьПараметры.Дата = Строка.Дата;
	ОбластьПараметры.ДеньНедели = Формат(Строка.Дата, "ДФ=дддд");
	
	ОбластьПараметры.Отель = Отель;
	ОбластьПараметры.КоличествоНомеров = Строка.КоличествоНомеров;
	ОбластьПараметры.КоличествоДвухместныеРазмещения = Строка.КоличествоДвухместныеРазмещения;
	ОбластьПараметры.СуммаДвухместныеРазмещения = Строка.СуммаДвухместныеРазмещения;
	ОбластьПараметры.КоличествоОдноместныеРазмещения = Строка.КоличествоОдноместныеРазмещения;
	ОбластьПараметры.СуммаОдноместныеРазмещения = Строка.СуммаОдноместныеРазмещения;
	ОбластьПараметры.Процент_НА = Строка.Процент_НА;
	ОбластьПараметры.ADR_НА = Строка.ADR_НА;
	
	ОбластьПараметры.СуммаАгентскогоВознаграждения = Строка.СуммаАгентскогоВознаграждения;
	ОбластьПараметры.СуммаВ2В = Строка.СуммаВ2В;
	ОбластьПараметры.СуммаКомиссии = Строка.СуммаКомиссии;
	
	Если Строка.КоличествоДвухместныеРазмещения = 0 Тогда
		ADRДвухместныеРазмещения = 0;	
	Иначе	
		ADRДвухместныеРазмещения = Окр((Строка.СуммаДвухместныеРазмещения / Строка.КоличествоДвухместныеРазмещения));
	КонецЕсли;
	ОбластьПараметры.ADRДвухместныеРазмещения = ADRДвухместныеРазмещения;
	
	Если Строка.КоличествоОдноместныеРазмещения = 0 Тогда
		ADRОдноместныеРазмещения = 0;	
	Иначе	
		ADRОдноместныеРазмещения = Окр((Строка.СуммаОдноместныеРазмещения / Строка.КоличествоОдноместныеРазмещения));;
	КонецЕсли;
	ОбластьПараметры.ADRОдноместныеРазмещения = ADRОдноместныеРазмещения;
	
	ИтогоЗанятыеНомера = Строка.КоличествоОдноместныеРазмещения + Строка.КоличествоДвухместныеРазмещения;
	ОбластьПараметры.ИтогоЗанятыеНомера = ИтогоЗанятыеНомера;
	
	ПроцентЗаселяемости = Окр((ИтогоЗанятыеНомера / Строка.КоличествоНомеров) * 100);
	ОбластьПараметры.ПроцентЗаселяемости = ПроцентЗаселяемости;
	
	ИтогоСумма = Строка.СуммаОдноместныеРазмещения + Строка.СуммаДвухместныеРазмещения;
	ОбластьПараметры.ИтогоСумма = ИтогоСумма;
	Если ИтогоЗанятыеНомера = 0 Тогда
		ИтогоСредняяСтоимоть = 0;
	Иначе		
		ИтогоСредняяСтоимоть = Окр(ИтогоСумма / ИтогоЗанятыеНомера);
	КонецЕсли;	
	ОбластьПараметры.ИтогоСредняяСтоимоть = ИтогоСредняяСтоимоть;
		
	Если ИтогоЗанятыеНомера = 0 Тогда
		ПроцентДвухместныеРазмещения = 0;
		ПроцентОдноместныеРазмещения = 0;
	Иначе	
		ВсегоРазмещений = Строка.КоличествоОдноместныеРазмещения +  Строка.КоличествоДвухместныеРазмещения;
		ПроцентДвухместныеРазмещения = Окр((Строка.КоличествоДвухместныеРазмещения / ИтогоЗанятыеНомера) * 100);
		ПроцентОдноместныеРазмещения = Окр((Строка.КоличествоОдноместныеРазмещения / ИтогоЗанятыеНомера) * 100);
	КонецЕсли;	
	ОбластьПараметры.ПроцентДвухместныеРазмещения = ПроцентДвухместныеРазмещения;
	ОбластьПараметры.ПроцентОдноместныеРазмещения = ПроцентОдноместныеРазмещения;
	
	ОбластьПараметры.Процент_НА = Строка.Процент_НА;
	ОбластьПараметры.ADR_НА = Строка.ADR_НА;
	
	ОбластьПараметры.Мероприятия = Строка.Мероприятия;
	
	Если Помесячно Тогда 

		Если НачалоМесяца(Строка.Дата) <> ДатаМесяц_П Тогда
			
			Область = Макет.ПолучитьОбласть("Итоги");	
			
			ОбластьПараметры = Область.Параметры; 
			
			ОбластьПараметры.Дата = КонецМесяца(ДатаМесяц_П);
			ОбластьПараметры.Отель = Отель;
			
			ОбластьПараметры.КоличествоНомеров = ИтогиМесяц.КоличествоНомеров;
			ОбластьПараметры.КоличествоДвухместныеРазмещения = ИтогиМесяц.КоличествоДвухместныеРазмещения;
			ОбластьПараметры.СуммаДвухместныеРазмещения = ИтогиМесяц.СуммаДвухместныеРазмещения;
			ОбластьПараметры.КоличествоОдноместныеРазмещения = ИтогиМесяц.КоличествоОдноместныеРазмещения;
			ОбластьПараметры.СуммаОдноместныеРазмещения = ИтогиМесяц.СуммаОдноместныеРазмещения;
			
			//ОбластьПараметры.Процент_НА = Строка.Процент_НА;
			//ОбластьПараметры.ADR_НА = Строка.ADR_НА;
			
			ОбластьПараметры.СуммаАгентскогоВознаграждения = ИтогиМесяц.СуммаАгентскогоВознаграждения;
			
			ADRДвухместныеРазмещения = Окр((ИтогиМесяц.ADRДвухместныеРазмещения / КоличествоЗаписейИтогиМесяц));
			ОбластьПараметры.ADRДвухместныеРазмещения = ADRДвухместныеРазмещения;
			
			ADRОдноместныеРазмещения = Окр((ИтогиМесяц.ADRОдноместныеРазмещения / КоличествоЗаписейИтогиМесяц));
			ОбластьПараметры.ADRОдноместныеРазмещения = ADRОдноместныеРазмещения;
			
			ОбластьПараметры.ИтогоЗанятыеНомера = ИтогиМесяц.ИтогоЗанятыеНомера;
			ОбластьПараметры.ИтогоСумма = ИтогиМесяц.ИтогоСумма;
			
			ПроцентЗаселяемости = Окр((ИтогиМесяц.ПроцентЗаселяемости / КоличествоЗаписейИтогиМесяц));
			ОбластьПараметры.ПроцентЗаселяемости = ПроцентЗаселяемости;
			
			ИтогоСредняяСтоимоть = Окр((ИтогиМесяц.ИтогоСредняяСтоимоть / КоличествоЗаписейИтогиМесяц));
			ОбластьПараметры.ИтогоСредняяСтоимоть = ИтогоСредняяСтоимоть;
				
			ПроцентДвухместныеРазмещения = Окр((ИтогиМесяц.ПроцентДвухместныеРазмещения / КоличествоЗаписейИтогиМесяц));
			ОбластьПараметры.ПроцентДвухместныеРазмещения = ПроцентДвухместныеРазмещения;
			ПроцентОдноместныеРазмещения = Окр((ИтогиМесяц.ПроцентОдноместныеРазмещения / КоличествоЗаписейИтогиМесяц));
			ОбластьПараметры.ПроцентОдноместныеРазмещения = ПроцентОдноместныеРазмещения;
			
			ПолеОтчета.Вывести(Область);
			
			Для Каждого Колонка Из ТЗИтогиМесяц.Колонки Цикл
				Если Колонка.Имя = "Дата"
				ИЛИ Колонка.Имя = "Отель"  
				ИЛИ Колонка.Имя = "КоличествоНомеров"  
				Тогда Продолжить; КонецЕсли;
				
				ИтогиМесяц[Колонка.Имя] = 0;
			КонецЦикла;
			ДатаМесяц_П = НачалоМесяца(Строка.Дата); 
			КоличествоЗаписейИтогиМесяц = 0;
		КонецЕсли;
		
		ИтогиМесяц.КоличествоДвухместныеРазмещения = ИтогиМесяц.КоличествоДвухместныеРазмещения + Строка.КоличествоДвухместныеРазмещения;
		ИтогиМесяц.СуммаДвухместныеРазмещения = ИтогиМесяц.СуммаДвухместныеРазмещения + Строка.СуммаДвухместныеРазмещения;
		ИтогиМесяц.КоличествоОдноместныеРазмещения = ИтогиМесяц.КоличествоОдноместныеРазмещения + Строка.КоличествоОдноместныеРазмещения;
		ИтогиМесяц.СуммаОдноместныеРазмещения = ИтогиМесяц.СуммаОдноместныеРазмещения + Строка.СуммаОдноместныеРазмещения;
		
		//ОбластьПараметры.Процент_НА = Строка.Процент_НА;
		//ОбластьПараметры.ADR_НА = Строка.ADR_НА;
		
		ИтогиМесяц.СуммаАгентскогоВознаграждения = ИтогиМесяц.СуммаАгентскогоВознаграждения + Строка.СуммаАгентскогоВознаграждения;
		
		ИтогиМесяц.ADRДвухместныеРазмещения = ИтогиМесяц.ADRДвухместныеРазмещения + ADRДвухместныеРазмещения;
		ИтогиМесяц.ADRОдноместныеРазмещения = ИтогиМесяц.ADRОдноместныеРазмещения + ADRОдноместныеРазмещения;
		
		ИтогиМесяц.ИтогоЗанятыеНомера = ИтогиМесяц.ИтогоЗанятыеНомера + ИтогоЗанятыеНомера;
		ИтогиМесяц.ИтогоСумма = ИтогиМесяц.ИтогоСумма + ИтогоСумма;
		
		ИтогиМесяц.ПроцентЗаселяемости = ИтогиМесяц.ПроцентЗаселяемости + ПроцентЗаселяемости;
		ИтогиМесяц.ИтогоСредняяСтоимоть = ИтогиМесяц.ИтогоСредняяСтоимоть + ИтогоСредняяСтоимоть;
			
		ИтогиМесяц.ПроцентДвухместныеРазмещения = ИтогиМесяц.ПроцентДвухместныеРазмещения + ПроцентДвухместныеРазмещения;
		ИтогиМесяц.ПроцентОдноместныеРазмещения = ИтогиМесяц.ПроцентОдноместныеРазмещения + ПроцентОдноместныеРазмещения;
		
		КоличествоЗаписейИтогиМесяц = КоличествоЗаписейИтогиМесяц + 1;
	Иначе	
		ПолеОтчета.Вывести(Область);
	КонецЕсли;	
	
	Итоги.КоличествоДвухместныеРазмещения = Итоги.КоличествоДвухместныеРазмещения + Строка.КоличествоДвухместныеРазмещения;
	Итоги.СуммаДвухместныеРазмещения = Итоги.СуммаДвухместныеРазмещения + Строка.СуммаДвухместныеРазмещения;
	Итоги.КоличествоОдноместныеРазмещения = Итоги.КоличествоОдноместныеРазмещения + Строка.КоличествоОдноместныеРазмещения;
	Итоги.СуммаОдноместныеРазмещения = Итоги.СуммаОдноместныеРазмещения + Строка.СуммаОдноместныеРазмещения;
	
	//ОбластьПараметры.Процент_НА = Строка.Процент_НА;
	//ОбластьПараметры.ADR_НА = Строка.ADR_НА;
	
	Итоги.СуммаАгентскогоВознаграждения = Итоги.СуммаАгентскогоВознаграждения + Строка.СуммаАгентскогоВознаграждения;
	
	Итоги.ADRДвухместныеРазмещения = Итоги.ADRДвухместныеРазмещения + ADRДвухместныеРазмещения;
	Итоги.ADRОдноместныеРазмещения = Итоги.ADRОдноместныеРазмещения + ADRОдноместныеРазмещения;
	
	Итоги.ИтогоЗанятыеНомера = Итоги.ИтогоЗанятыеНомера + ИтогоЗанятыеНомера;
	Итоги.ИтогоСумма = Итоги.ИтогоСумма + ИтогоСумма;
	
	Итоги.ПроцентЗаселяемости = Итоги.ПроцентЗаселяемости + ПроцентЗаселяемости;
	Итоги.ИтогоСредняяСтоимоть = Итоги.ИтогоСредняяСтоимоть + ИтогоСредняяСтоимоть;
		
	Итоги.ПроцентДвухместныеРазмещения = Итоги.ПроцентДвухместныеРазмещения + ПроцентДвухместныеРазмещения;
	Итоги.ПроцентОдноместныеРазмещения = Итоги.ПроцентОдноместныеРазмещения + ПроцентОдноместныеРазмещения;

КонецЦикла;

Если Помесячно Тогда
	Если КоличествоЗаписейИтогиМесяц > 0 Тогда
		Область = Макет.ПолучитьОбласть("Итоги");	
		
		ОбластьПараметры = Область.Параметры; 
		
		ОбластьПараметры.Дата = КонецМесяца(ДатаМесяц_П);
		ОбластьПараметры.Отель = Отель;
		
		ОбластьПараметры.КоличествоНомеров = ИтогиМесяц.КоличествоНомеров;
		ОбластьПараметры.КоличествоДвухместныеРазмещения = ИтогиМесяц.КоличествоДвухместныеРазмещения;
		ОбластьПараметры.СуммаДвухместныеРазмещения = ИтогиМесяц.СуммаДвухместныеРазмещения;
		ОбластьПараметры.КоличествоОдноместныеРазмещения = ИтогиМесяц.КоличествоОдноместныеРазмещения;
		ОбластьПараметры.СуммаОдноместныеРазмещения = ИтогиМесяц.СуммаОдноместныеРазмещения;
		
		//ОбластьПараметры.Процент_НА = Строка.Процент_НА;
		//ОбластьПараметры.ADR_НА = Строка.ADR_НА;
		
		ОбластьПараметры.СуммаАгентскогоВознаграждения = ИтогиМесяц.СуммаАгентскогоВознаграждения;
		
		ADRДвухместныеРазмещения = Окр((ИтогиМесяц.ADRДвухместныеРазмещения / КоличествоЗаписейИтогиМесяц));
		ОбластьПараметры.ADRДвухместныеРазмещения = ADRДвухместныеРазмещения;
		
		ADRОдноместныеРазмещения = Окр((ИтогиМесяц.ADRОдноместныеРазмещения / КоличествоЗаписейИтогиМесяц));
		ОбластьПараметры.ADRОдноместныеРазмещения = ADRОдноместныеРазмещения;
		
		ОбластьПараметры.ИтогоЗанятыеНомера = ИтогиМесяц.ИтогоЗанятыеНомера;
		ОбластьПараметры.ИтогоСумма = ИтогиМесяц.ИтогоСумма;
		
		ПроцентЗаселяемости = Окр((ИтогиМесяц.ПроцентЗаселяемости / КоличествоЗаписейИтогиМесяц));
		ОбластьПараметры.ПроцентЗаселяемости = ПроцентЗаселяемости;
		
		ИтогоСредняяСтоимоть = Окр((ИтогиМесяц.ИтогоСредняяСтоимоть / КоличествоЗаписейИтогиМесяц));
		ОбластьПараметры.ИтогоСредняяСтоимоть = ИтогоСредняяСтоимоть;
			
		ПроцентДвухместныеРазмещения = Окр((ИтогиМесяц.ПроцентДвухместныеРазмещения / КоличествоЗаписейИтогиМесяц));
		ОбластьПараметры.ПроцентДвухместныеРазмещения = ПроцентДвухместныеРазмещения;
		ПроцентОдноместныеРазмещения = Окр((ИтогиМесяц.ПроцентОдноместныеРазмещения / КоличествоЗаписейИтогиМесяц));
		ОбластьПараметры.ПроцентОдноместныеРазмещения = ПроцентОдноместныеРазмещения;
		
		ПолеОтчета.Вывести(Область);
	КонецЕсли;	
КонецЕсли;	
	
Если ТЗ.Количество() > 1 Тогда
	ТЗ_Количество = ТЗ.Количество(); 
	
	Область = Макет.ПолучитьОбласть("Итоги");	
	
	Если Помесячно Тогда 
		 Область.Область("Итоги").ЦветТекста = Новый Цвет(150, 50, 0);
	КонецЕсли;
	
	ОбластьПараметры = Область.Параметры; 
	
	//ОбластьПараметры.Дата = Формат(Строка.Дата,"ДФ=dd.MM.yy");
	ОбластьПараметры.Отель = Отель;
	ОбластьПараметры.КоличествоНомеров = Итоги.КоличествоНомеров;
	ОбластьПараметры.КоличествоДвухместныеРазмещения = Итоги.КоличествоДвухместныеРазмещения;
	ОбластьПараметры.СуммаДвухместныеРазмещения = Итоги.СуммаДвухместныеРазмещения;
	ОбластьПараметры.КоличествоОдноместныеРазмещения = Итоги.КоличествоОдноместныеРазмещения;
	ОбластьПараметры.СуммаОдноместныеРазмещения = Итоги.СуммаОдноместныеРазмещения;
	
	//ОбластьПараметры.Процент_НА = Строка.Процент_НА;
	//ОбластьПараметры.ADR_НА = Строка.ADR_НА;
	
	ОбластьПараметры.СуммаАгентскогоВознаграждения = Итоги.СуммаАгентскогоВознаграждения;
	
	ADRДвухместныеРазмещения = Окр((Итоги.ADRДвухместныеРазмещения / ТЗ_Количество));
	ОбластьПараметры.ADRДвухместныеРазмещения = ADRДвухместныеРазмещения;
	
	ADRОдноместныеРазмещения = Окр((Итоги.ADRОдноместныеРазмещения / ТЗ_Количество));
	ОбластьПараметры.ADRОдноместныеРазмещения = ADRОдноместныеРазмещения;
	
	ОбластьПараметры.ИтогоЗанятыеНомера = Итоги.ИтогоЗанятыеНомера;
	ОбластьПараметры.ИтогоСумма = Итоги.ИтогоСумма;
	
	ПроцентЗаселяемости = Окр((Итоги.ПроцентЗаселяемости / ТЗ_Количество));
	ОбластьПараметры.ПроцентЗаселяемости = ПроцентЗаселяемости;
	
	ИтогоСредняяСтоимоть = Окр((Итоги.ИтогоСредняяСтоимоть / ТЗ_Количество));
	ОбластьПараметры.ИтогоСредняяСтоимоть = ИтогоСредняяСтоимоть;
		
	ПроцентДвухместныеРазмещения = Окр((Итоги.ПроцентДвухместныеРазмещения / ТЗ_Количество));
	ОбластьПараметры.ПроцентДвухместныеРазмещения = ПроцентДвухместныеРазмещения;
	ПроцентОдноместныеРазмещения = Окр((Итоги.ПроцентОдноместныеРазмещения / ТЗ_Количество));
	ОбластьПараметры.ПроцентОдноместныеРазмещения = ПроцентОдноместныеРазмещения;
	
	ПолеОтчета.Вывести(Область);
КонецЕсли;	
КонецПроцедуры


&НаКлиенте                                                       
Процедура ПолеОтчетаПриИзменении(Элемент)
Имя = Элемент.ТекущаяОбласть.Имя;		
ИндексКолонка = СтрНайти(Имя, "C");
Если ИндексКолонка = 0 ТОгда Возврат; КонецЕсли;
Длина = СтрДлина(Имя) - ИндексКолонка;	
КолонкаСтрока = Сред(Имя, ИндексКолонка + 1, СтрДлина(Имя) - ИндексКолонка);
Колонка = ПолучитьЧисло(КолонкаСтрока);
Если Колонка = Неопределено Тогда Возврат; КонецЕсли;

Колонка_НА = 20;
Колонка_ADR_НА = 21;
Если Колонка <> Колонка_НА И Колонка <> Колонка_ADR_НА Тогда Возврат; КонецЕсли; 
	
ИндексСтрока = 1;
Длина = ИндексКолонка - ИндексСтрока - 1;	
СтрокаСтрока = Сред(Имя, 2, Длина);
Строка = ПолучитьЧисло(СтрокаСтрока);	   
Если Строка = Неопределено Тогда Возврат; КонецЕсли;

РезультатСтрока = Элемент.ТекущаяОбласть.Текст;
Результат = ПолучитьЧисло(РезультатСтрока);	
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

Имя = "R" + СтрокаСтрока + "C1";
Область = ПолеОтчета.Область(Имя);
ДатаТекст = Область.Текст;

Дата = ПолучитьДату(ДатаТекст);
Если НЕ ЗначениеЗаполнено(Дата) Тогда Возврат; КонецЕсли;

Имя = "R" + СтрокаСтрока + "C3";
Область = ПолеОтчета.Область(Имя);
Отель = Область.Текст;

Если Колонка = Колонка_НА Тогда 
	Процент_НА = Результат;
	ADR_НА = Неопределено;
Иначе
	Процент_НА = Неопределено;
	ADR_НА = Результат;
КонецЕсли;

ОбновитьРегистрЕжедневныйОтчетФакт(Дата, Отель, Процент_НА, ADR_НА);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЧисло(Строка)
Попытка 
	Число = Число(Строка);
Исключение
	Возврат Неопределено;
КонецПопытки;

Возврат Число;

КонецФункции

&НаКлиенте
Функция ПолучитьДату(Строка)
Индекс1 = СтрНайти(Строка, ".");
Если Индекс1 = 0 Тогда Возврат Неопределено; КонецЕсли;

Индекс2 = СтрНайти(Строка, ".",,,2);		
Если Индекс2 = 0 Тогда Возврат Неопределено; КонецЕсли;

ГодСтрока = Сред(Строка, Индекс2 + 1, СтрДлина(Строка) - Индекс2);

Если СтрДлина(ГодСтрока) = 2 Тогда  
	ГодСтрока = "20" + ГодСтрока;
КонецЕсли;

ДеньСтрока = Лев(Строка, Индекс1 - 1);
МесяцСтрока = Сред(Строка, Индекс1 + 1, Индекс2 - Индекс1 - 1);

ДатаСтрока = ГодСтрока + МесяцСтрока + ДеньСтрока;
Попытка 
	Дата = Дата(ДатаСтрока);
Исключение
	Возврат Неопределено;
КонецПопытки;

Возврат Дата;

КонецФункции

&НаСервере
Функция ОбновитьРегистрЕжедневныйОтчетФакт(Дата, Отель, Процент_НА, ADR_НА)
МенеджерЗаписи = РегистрыСведений.ЕжедневныйОтчетФакт.СоздатьМенеджерЗаписи();

МенеджерЗаписи.Дата = Дата;
МенеджерЗаписи.Отель = Отель;
МенеджерЗаписи.Месяц = НачалоМесяца(Дата);

МенеджерЗаписи.Прочитать();

Если Процент_НА <> Неопределено Тогда
	МенеджерЗаписи.Процент_НА = Процент_НА;
КонецЕсли;

Если ADR_НА <> Неопределено Тогда
	МенеджерЗаписи.ADR_НА = ADR_НА;
КонецЕсли;

МенеджерЗаписи.Записать();	
КонецФункции

