
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ЗаявкаСайт", ЗаявкаСайт);
Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ЗаявкаСайт = Объект.ЗаявкаСайт;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЗаявкаСайт) Тогда
	Элементы.ГруппаЗаявкаСайт.Видимость = Ложь;
КонецЕсли;
	
РаботаСИнтерфейсомКлиентСервер.УбратьКнопкуКоманднойПанелиФормы(ЭтаФорма.КоманднаяПанель, "ФормаУдалить");

ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;

ПараметрыТолькоПросмотр = Неопределено;
Параметры.Свойство("ТолькоПросмотр", ПараметрыТолькоПросмотр);
Если ПараметрыТолькоПросмотр = Неопределено Тогда
	ПараметрыТолькоПросмотр = Ложь;
КонецЕсли;

РаботаСИнтерфейсомСервер_УстановитьТолькоПросмотр = РаботаСИнтерфейсомСервер.УстановитьТолькоПросмотр(ЭтаФорма);
Если РаботаСИнтерфейсомСервер_УстановитьТолькоПросмотр Тогда 
	Элементы.Закрыто.ТолькоПросмотр = Истина;
Иначе
	Если НЕ НастройкиСервер.ЭтоАдминистратор() Тогда
		Элементы.Закрыто.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецЕсли;

Если РаботаСИнтерфейсомСервер_УстановитьТолькоПросмотр
ИЛИ ПараметрыТолькоПросмотр
ИЛИ Объект.Закрыто
Тогда ЭтаФорма.ТолькоПросмотр = Истина; КонецЕсли;

ЭтоАдминистратор = НастройкиСервер.ЭтоАдминистратор();

ЕстьПравоСписаниеДолгов = НастройкиСервер.ПользовательЕстьПраво(Перечисления.ПраваПользователя.СписаниеДолгов);
Элементы.ПодменюСписание.Видимость = ЕстьПравоСписаниеДолгов ИЛИ ЭтоАдминистратор;

Разрешение = НастройкиСервер.ЭтоАдмин() ИЛИ ЭтоАдминистратор;
Элементы.ФормаГруппаДобавитьОплату.Доступность = Разрешение;

Элементы.ЧекАванс.Доступность = Разрешение;

//
ЭтоРазработчик = (СокрЛП(ТекущийПользователь.Код) = "Администратор"); 
Элементы.ФормаТЕСТ.Видимость = ЭтоРазработчик;
Элементы.ФормаОчиститьДанные.Видимость  = ЭтоРазработчик; 

Элементы.ГруппаРаспределениеОплатДолги.Видимость  = ЭтоРазработчик; 
Элементы.ГруппаСчетаДетальноДолги.Видимость  = ЭтоРазработчик; 
//

ТарифныеПланы = Константы.ТарифныеПланы.Получить();
Элементы.ТарифныйПлан.Видимость = ТарифныеПланы;

УсловноеОформлениеИсторияОплат();

ДопМестоВозрастСписокВыбораУстановить(Элементы.ДопМесто_1_Возраст.СписокВыбора);
ДопМестоВозрастСписокВыбораУстановить(Элементы.ДопМесто_2_Возраст.СписокВыбора);
ДопМестоТипДопМестаСписокВыбораУстановить(Элементы.ДопМесто_1_ТипДопМеста.СписокВыбора);
ДопМестоТипДопМестаСписокВыбораУстановить(Элементы.ДопМесто_2_ТипДопМеста.СписокВыбора);

ГорничныеВремяЗаездаСписокВыбораУстановить(Элементы.ГорничныеВремяЗаезда.СписокВыбора);

Если НастройкиСервер.ЭтоСтритАрт() Тогда
	Элементы.СчетаОтправитьВPayKeeper.Доступность = Ложь;
	Элементы.СчетаПроверитьОплатуPayKeepr.Доступность = Ложь;
Конецесли;

ТипБронирования_СписокВыбора = Элементы.ТипБронирования.СписокВыбора;
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ТипБронирования.Ссылка КАК Ссылка,
                      |	ТипБронирования.Наименование КАК Наименование
                      |ИЗ
                      |	Справочник.ТипБронирования КАК ТипБронирования
                      |ГДЕ
                      |	ТипБронирования.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ТипБронирования.Номер_пп");

Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
	 ТипБронирования_СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
КонецЦикла;
 
УстановитьПроцентыВ2В();

ФормаОтладка();

ПроверкаДанныхЗаявки = ПроверитьДанныеЗаявки();
КонецПроцедуры

&НаСервере
Процедура ДопМестоВозрастСписокВыбораУстановить(СписокВыбора)
СписокВыбора.Очистить();

СписокВыбора.Добавить("0");
СписокВыбора.Добавить("1");
СписокВыбора.Добавить("2");
СписокВыбора.Добавить("3");
СписокВыбора.Добавить("4");
СписокВыбора.Добавить("5");
СписокВыбора.Добавить("6");
СписокВыбора.Добавить("7");
СписокВыбора.Добавить("8");
СписокВыбора.Добавить("9");
СписокВыбора.Добавить("10");
СписокВыбора.Добавить("11");
СписокВыбора.Добавить("12");
СписокВыбора.Добавить("13");
СписокВыбора.Добавить("14");
СписокВыбора.Добавить("15");
СписокВыбора.Добавить("15+");
КонецПроцедуры

&НаСервере
Процедура ДопМестоТипДопМестаСписокВыбораУстановить(СписокВыбора)
СписокВыбора.Очистить();

СписокВыбора.Добавить(0, "Нет");
СписокВыбора.Добавить(1, "Доп. кровать");
СписокВыбора.Добавить(2, "Дет. кровать");
КонецПроцедуры

&НаСервере
Процедура ГорничныеВремяЗаездаСписокВыбораУстановить(СписокВыбора)
СписокВыбора.Очистить();

Для Индекс = 0 По 23 Цикл
	СписокВыбора.Добавить(Индекс);
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ФормаОтладка() 
ЭтоОтладка = Константы.ЭтоОтладка.Получить();

//Элементы.СчетаДетальноДолги.Видимость = ЭтоОтладка;
//Элементы.РаспределениеОплатДолги.Видимость = ЭтоОтладка;

Элементы.ПроживаниеГУИД.Видимость = ЭтоОтладка;
Элементы.ДопУслугиГУИД.Видимость = ЭтоОтладка;
Элементы.СчетаСчетГУИД.Видимость = ЭтоОтладка;
Элементы.СчетаДетальноСтрокиСчетГУИД.Видимость = ЭтоОтладка;

//Элементы.СчетаПерераспределитьОплатыНаСчет.Видимость  = ЭтоТестоваяПрограмма; 
//Элементы.СчетаРаспределитьОплатыНаСчет.Видимость  = ЭтоТестоваяПрограмма; 
//Элементы.СчетаУдалитьРаспределениеОплатНаСчет.Видимость  = ЭтоТестоваяПрограмма; 
Конецпроцедуры

&НаСервере
Процедура ФормаНастройка() 
Настройки = НастройкиСервер.ФункциональностьДоступностьОрганизация();
Элементы.БонШанс.Видимость 	= Настройки.БонШанс;
Конецпроцедуры

&НаСервере
Процедура УсловноеОформлениеИсторияОплат()
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();     
    ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();	
    ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИсторияОплат.Имя); 
    ПолеОформления.Использование = Истина;
	
    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИсторияОплат.СуммаОплаты");   
    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;    
    ЭлементОтбора.ПравоеЗначение = 0;
    ЭлементОтбора.Использование  = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЛиловый);
КонецПроцедуры

&НаСервере
Функция ПроверитьДанныеЗаявки()
// Проверка наличия счетов на основании РаспределениеОплатДолги 	
ТЗ = Объект.РаспределениеОплатДолги.Выгрузить();
ТЗ.Свернуть("СчетГУИД, ДокументОплаты", "СуммаОплаты");

Для Каждого Строка Из ТЗ Цикл
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	НайденныеСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);
	
	Если НайденныеСтроки.Количество() = 0 Тогда Возврат Истина; КонецЕсли;
КонецЦикла;

Возврат Ложь;
КонецФункции

&НаСервере
Процедура ИсправитьДанныеЗаявки()
// Удаление несвязанных со счетами РаспределениеОплатДолги	
ТЗ = Объект.РаспределениеОплатДолги.Выгрузить();
ТЗ.Свернуть("СчетГУИД, ДокументОплаты", "СуммаОплаты");

МассивКУдалению = Новый Массив;
Для Каждого Строка Из ТЗ Цикл
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	НайденныеСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		ОтборСтрокиРаспределениеОплатДолги = Новый Структура("СчетГУИД, ДокументОплаты", Строка.СчетГУИД, Строка.ДокументОплаты);
		НайденныеСтрокиРаспределениеОплатДолги = Объект.РаспределениеОплатДолги.НайтиСтроки(ОтборСтрокиРаспределениеОплатДолги);
		Для Каждого СтрокаРаспределениеОплатДолги Из НайденныеСтрокиРаспределениеОплатДолги Цикл
			МассивКУдалению.Добавить(СтрокаРаспределениеОплатДолги);
		КонецЦикла;
		
		ОтборСтрокиОплаты = Новый Структура("ДокументОплаты", Строка.ДокументОплаты);
		НайденныеСтрокиОплаты = Объект.СчетаДетальноОплаты.НайтиСтроки(ОтборСтрокиОплаты);
		Если НайденныеСтрокиОплаты.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		СтрокаОплаты = НайденныеСтрокиОплаты[0];
		СтрокаОплаты.СуммаРаспределено = СтрокаОплаты.СуммаРаспределено - Строка.СуммаОплаты; 
		
		Продолжить;
	КонецЕсли;
КонецЦикла;

Для Каждого Строка Из МассивКУдалению Цикл
	Объект.РаспределениеОплатДолги.Удалить(Строка);
КонецЦикла;

КонецПРоцедуры
//

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Если ЗначениеЗаполнено(ЗаявкаСайт) Тогда
		ЗаполнитьЗаявкуИзЗаявкаСайтДействие();		
	КонецЕсли;
КонецЕсли;
	
НетОтказПодтвердитеУдаление = Ложь;

Если ПроверкаДанныхЗаявки Тогда
	ИсправитьДанныеЗаявки();

	ПоказатьПредупреждение(,"ВНИМАНИЕ ! В заявке были ошибки.
	|
	|ОШИБКИ ИСПРАВЛЕНЫ. 
	|
	|Проверьте результат исправления ...
	|Проведите документ.
	|
	|СООБЩИТЕ АДМИНИСТРАТОРУ ПРОГРАММЫ !");
	
	Сообщить("ВНИМАНИЕ ! В заявке были ошибки. ОШИБКИ ИСПРАВЛЕНЫ. Проверьте результат исправления. Проведите документ. СООБЩИТЕ АДМИНИСТРАТОРУ ПРОГРАММЫ.");  
	//ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
КонецЕсли;

ДоступостьВремяТочное = НастройкиСервер.ЭтоАдмин() ИЛИ НастройкиСервер.ЭтоАдминистратор();

Элементы.ВремяВыездаТочное.Доступность = ДоступостьВремяТочное;
Элементы.ВремяЗаездаТочное.Доступность = ДоступостьВремяТочное;
	
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Объект.АвторЗаявки=ТекущийПользователь;
Иначе
// + ПСН
	//Элементы.Тариф.Доступность = ПоискАудитаНаСервере();
// - ПСН
		
	Если ОбщееСервер.ПроверитьДату(Объект.РезервПо) тогда
		ОбщийФункционалСервер.ЗащититьФорму(ЭтаФорма, Истина);
		
		ПоказатьПредупреждение(,"Документ закрыт для редактирования!");
	КонецЕсли;
КонецЕсли;

//	ЭлементыФормы.ЦветКлиента.ЦветФонаКнопки =Новый Цвет(ЦветR,ЦветG,ЦветB);
Элементы.ЦветЗаявки.ЦветФона =Новый Цвет(Объект.ЦветR, Объект.ЦветG, Объект.ЦветB);
ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Элементы.ЦветЗаявки.ЦветФона);
Элементы.ЦветЗаявки.ЦветТекста = ЦветТекста;

ОтборТаблицаАнкет();	
  
//ОтборТабличноеПолеСМС();

//ИсторияКлиента();
Если ЗначениеЗаполнено(Объект.Клиент) Тогда 
	НеПоказыватьИсторию = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Клиент, "НеПоказыватьИсторию");
Иначе
	НеПоказыватьИсторию = Истина;
КонецЕсли;	
Если НЕ НеПоказыватьИсторию Тогда ПредпочтенияИсторияКлиента(); КонецЕсли;
//

//ОбновитьИсториюОплат();
//ОбновитьСумму();

// + ПСН Нужно добавить проверку Клиент2 на дни рождения ?
Если ЗначениеЗаполнено(Объект.Клиент) Тогда
	КлиентДатаРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ДатаРождения"); 
	Если ЗначениеЗаполнено(КлиентДатаРождения) Тогда
		Если День(КлиентДатаРождения) = День(ТекущаяДата()) 
		И Месяц(КлиентДатаРождения) = Месяц(ТекущаяДата()) тогда
			КлиентФИО = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ФИО");
			ПоказатьПредупреждение(,"Внимание! Сегодня день рождения у клиента " + КлиентФИО);
		конецесли;
	КонецЕсли;
КонецЕсли;

//Если НЕ Объект.Клиент.Пустая() тогда
Если ЗначениеЗаполнено(Объект.Клиент) тогда
	СообщениеОПризах=ОбщееСервер.СообщениеОБаллахИПризах(Объект.Клиент);
	Если СообщениеОПризах<>"" тогда
		
		Парам = Новый Структура("ПолеОтчета", СообщениеОПризах);
		ОткрытьФорму("ОбщаяФорма.ВыводОтчета", Парам, ЭтаФорма
			,,,,,  РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
КонецЕсли;

//////
// + ПСН
Статус_OldValue = Объект.Статус;
КатегорияНомера_OldValue = Объект.КатегорияНомера;

Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Если НЕ ЗначениеЗаполнено(Объект.ВремяЗаезда) Тогда
		Объект.ВремяЗаезда = ПредопределенноеЗначение("Перечисление.ВремяЗаезда.Вр14");	
		Объект.ГорничныеВремяЗаезда = 14;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВремяВыезда) Тогда
		Объект.ВремяВыезда = ПредопределенноеЗначение("Перечисление.ВремяВыезда.Вр12");	
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь");	
КонецЕсли;

ЦветФонаКнопки = Новый Цвет(0, 255, 0);
Если ЗначениеЗаполнено(Объект.ВремяЗаездаТочное) Тогда 
	Элементы.Заехал.ЦветФона = ЦветФонаКнопки;
Иначе
	Элементы.Заехал.ЦветФона = Новый Цвет();
КонецЕсли;

Если ЗначениеЗаполнено(Объект.ВремяВыездаТочное) Тогда 
	Элементы.Выехал.ЦветФона = ЦветФонаКнопки;
Иначе
	Элементы.Выехал.ЦветФона = Новый Цвет();
КонецЕсли;
// - ПСН

/////////////////////////	
// + ПСН
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Объект.НовыйРассчет = Истина;
КонецЕсли;
// - ПСН

Если ЗаполнитьЗаявкуИзЗаявкаСайтТекстПредупреждения <> "" Тогда
	Если ЗаполнитьЗаявкуИзЗаявкаСайтОткрытьФормуКлиента Тогда
		ЗаполнитьЗаявкуИзЗаявкаСайтОбработчикОждидания();		
	Иначе	
		ПоказатьПредупреждение(, ЗаполнитьЗаявкуИзЗаявкаСайтТекстПредупреждения); 
	КонецЕсли;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Если ЗначениеЗаполнено(ЗаявкаСайт) Тогда
		ЭтаФорма.Ширина = 170;
		ЭтаФорма.Высота = 60;

		ОбъектShell = Новый COMОбъект("Wscript.Shell");
		ОбъектShell.SendKeys("+%{R}");
	КонецЕсли;
КонецЕсли;

БронируетТурагентство = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Бронирует, "Турагентство");
Элементы.ГруппаЧекАгенту.Доступность = БронируетТурагентство; 
КонецПроцедуры

//
&НаКлиенте
Асинх Процедура ЗаполнитьЗаявкуИзЗаявкаСайтОбработчикОждидания()
Обещание = ПредупреждениеАсинх(ЗаполнитьЗаявкуИзЗаявкаСайтТекстПредупреждения);
Результат = Ждать Обещание; 

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_Клиент", ЭтаФорма);
ПараметрыФормы = Новый Структура("ЗаявкаСайт", ЗаявкаСайт);
ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы_Клиент(Результат, ДополнительныеПараметры) Экспорт
Если НЕ ЗначениеЗаполнено(Результат) Тогда Возврат; КонецЕсли;
	
Объект.Клиент = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаявкуИзЗаявкаСайтДействие()
Если ЗаполнитьЗаявкаСайтОбъект() Тогда Возврат; КонецЕсли;	
	
ПолучитьКлиентИзЗаявкаСайт();	

ЗаполнитьЗаявкуИзЗаявкаСайт();

Если Объект.Проживание.Количество() = 0 Тогда
	Текст = "Необходимо заполнить проживание.";
	ПоказатьПредупреждение(, "ВНИМАНИЕ: " + Текст);
	Сообщить(Текст);
КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗаявкаСайтОбъект()
ЗаявкаСайтОбъект_П = ЗаявкаСайт.ПолучитьОбъект();
Если  ЗаявкаСайтОбъект_П = Неопределено Тогда
	Возврат Истина;
Иначе
	ЗначениеВДанныеФормы(ЗаявкаСайтОбъект_П, ЗаявкаСайтОбъект);
	Возврат Ложь;
КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПолучитьКлиентИзЗаявкаСайт()
Результат = ПолучитьКлиентИзЗаявкаСайтНаСервере();

Если Результат = Неопределено Тогда
	ЗаполнитьЗаявкуИзЗаявкаСайтТекстПредупреждения = "У клиента из заявки с сайта ФИО - пусто
		|
		|СОЗДАЙТЕ Клиента из данных Заявки с сайта ..."	;
	
	КлиентИзЗаявкаСайт = Неопределено;
	ЗаполнитьЗаявкуИзЗаявкаСайтОткрытьФормуКлиента = Истина;
ИначеЕсли Результат.ТипСовпадения = 1 Тогда
	ЗаполнитьЗаявкуИзЗаявкаСайтТекстПредупреждения = Результат.Текст + "
		|
		|СОЗДАЙТЕ Клиента из данных Заявки с сайта ..."	;
		
	КлиентИзЗаявкаСайт = Неопределено;
	ЗаполнитьЗаявкуИзЗаявкаСайтОткрытьФормуКлиента = Истина;
ИначеЕсли Результат.ТипСовпадения = 2 Тогда
	ЗаполнитьЗаявкуИзЗаявкаСайтТекстПредупреждения = Результат.Текст + "
		|
		|ВЫБЕРИТЕ Клиента непосредственно в заявке ...";	
		
	КлиентИзЗаявкаСайт = Неопределено;
	ЗаполнитьЗаявкуИзЗаявкаСайтОткрытьФормуКлиента = Истина;
Иначе
	КлиентИзЗаявкаСайт = Результат.Клиент;	
	
	ЗаполнитьЗаявкуИзЗаявкаСайтТекстПредупреждения = Результат.Текст;
	ЗаполнитьЗаявкуИзЗаявкаСайтОткрытьФормуКлиента = Ложь;
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКлиентИзЗаявкаСайтНаСервере()
Результат = Новый Структура("Клиент, ТипСовпадения, Текст"
	, Неопределено, 1, "Нет совпадений наименования (ФИО) или телефона");
Клиент = Неопределено;	
	
Если ЗначениеЗаполнено(ЗаявкаСайтОбъект.Фамилия) Тогда
	КлиентНаименование = ЗаявкаСайтОбъект.Фамилия;
	Если ЗначениеЗаполнено(ЗаявкаСайтОбъект.Имя) Тогда
	    КлиентНаименование = КлиентНаименование + " " + ЗаявкаСайтОбъект.Имя;
	КонецЕсли;
Иначе
	Возврат Неопределено;
КонецЕсли;
КлиентНаименование = "%" + КлиентНаименование + "%";

Ответ = СлужебныеКлиентСервер.ПроверкаНомераТелефона(ЗаявкаСайтОбъект.Телефон); 
Если Ответ.КодОшибки = -1 Тогда
	ТелефонНормализованный = "";	
Иначе	
	ТелефонНормализованный = Ответ.ТелефонНомер;	
КонецЕсли;

ЗапросТекст = "ВЫБРАТЬ ПЕРВЫЕ 2
              |	Клиенты.Ссылка КАК Ссылка
              |ИЗ
              |	Справочник.Клиенты КАК Клиенты
              |ГДЕ
              |	Клиенты.ПометкаУдаления = ЛОЖЬ";

Если ТелефонНормализованный = "" Тогда
	ЗапросТекстНаименование = ЗапросТекст + "
				|	И Клиенты.Наименование Подобно &КлиентНаименование";
	Запрос = Новый Запрос(ЗапросТекстНаименование);
	Запрос.УстановитьПараметр("КлиентНаименование", КлиентНаименование);

	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		Результат.Клиент = ТЗ[0].Ссылка;
		Результат.ТипСовпадения = 0;
		Результат.Текст = "Совпало наименование (ФИО) клиента из Заявки";
	ИначеЕсли ТЗ.Количество() > 1 Тогда
		Результат.ТипСовпадения = 2;
		Результат.Текст = "Найдено несколько совпадений наименования (ФИО) клиента из Заявки";
	Иначе	
		Результат.ТипСовпадения = 1;
		Результат.Текст = "Нет совпадений наименования (ФИО)";
	КонецЕсли;
Иначе
	ЗапросТекстНаименованиеТелефон = ЗапросТекст + "
				|	И Клиенты.Наименование Подобно &КлиентНаименование
				|	И Клиенты.ТелефонНормализованный = &ТелефонНормализованный";
	Запрос = Новый Запрос(ЗапросТекстНаименованиеТелефон);
	Запрос.УстановитьПараметр("ТелефонНормализованный", ТелефонНормализованный); 
	
	Запрос.УстановитьПараметр("КлиентНаименование", КлиентНаименование);

	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		Результат.Клиент = ТЗ[0].Ссылка;
		Результат.ТипСовпадения = 0;
		Результат.Текст = "Совпало наименование (ФИО) и телефон.";
	ИначеЕсли ТЗ.Количество() > 1 Тогда
		Результат.ТипСовпадения = 2;
		Результат.Текст = "Найдено несколько совпадений наименования (ФИО) и телефона";
	Иначе
		ЗапросТекстТелефон = ЗапросТекст + "
					|	И Клиенты.ТелефонНормализованный = &ТелефонНормализованный";
		Запрос = Новый Запрос(ЗапросТекстТелефон);
		Запрос.УстановитьПараметр("ТелефонНормализованный", ТелефонНормализованный); 
		
		ТЗ_1 = Запрос.Выполнить().Выгрузить();
		Если ТЗ_1.Количество() = 1 Тогда
			Результат.Клиент = ТЗ_1[0].Ссылка;
			Результат.ТипСовпадения = 0;
			Результат.Текст = "Совпал телефон.";
		ИначеЕсли ТЗ_1.Количество() > 1 Тогда
			Результат.ТипСовпадения = 2;
			Результат.Текст = "Найдено несколько совпадений телефона";
			
		Иначе
			ЗапросТекстНаименование = ЗапросТекст + "
				|	И Клиенты.Наименование Подобно &КлиентНаименование
				|	И Клиенты.ТелефонНормализованный <> &ТелефонНормализованный
				|";
			Запрос = Новый Запрос(ЗапросТекстНаименование);
			Запрос.УстановитьПараметр("КлиентНаименование", КлиентНаименование); 
			Запрос.УстановитьПараметр("ТелефонНормализованный", ТелефонНормализованный); 
			
			ТЗ_2 = Запрос.Выполнить().Выгрузить();
			Если ТЗ_2.Количество() = 1 Тогда
				Результат.Клиент = ТЗ_2[0].Ссылка;
				Результат.ТипСовпадения = 0;
				Результат.Текст = "Совпали наименование (ФИО) и НЕ совпал телефон";
			ИначеЕсли ТЗ_2.Количество() > 1 Тогда
				Результат.ТипСовпадения = 2;
				Результат.Текст = "Найдено несколько совпадений наименования (ФИО)";
			Иначе
				Результат.ТипСовпадения = 1;
				Результат.Текст = "Нет совпадений наименования (ФИО) или телефона";
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецЕсли;	

Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьЗаявкуИзЗаявкаСайт()
Объект.Дата = ТекущаяДата();
Объект.ЗаявкаСайт = ЗаявкаСайт;

Объект.Клиент = КлиентИзЗаявкаСайт;

Объект.КолВоЧеловек = 1;

Объект.РезервС = ЗаявкаСайтОбъект.ДатаЗаезда;
Объект.РезервПо = ЗаявкаСайтОбъект.ДатаВыезда;

Объект.ВремяЗаезда = ЗаявкаСайтОбъект.ВремяЗаезда;
Объект.ВремяВыезда = ЗаявкаСайтОбъект.ВремяВыезда;

Объект.КатегорияНомера = ЗаявкаСайтОбъект.КатегорияНомера;
Объект.РаздельныеКровати = ЗаявкаСайтОбъект.РаздельныеКровати;

Объект.БезЗавтрака = НЕ ЗаявкаСайтОбъект.Завтрак;
Объект.КолВоЧеловек = ЗаявкаСайтОбъект.КоличествоЧеловек;

Объект.КаналБронирования = Справочники.КаналыБронирования.НашCайт;
Объект.ТипБронирования = Справочники.ТипБронирования.ЧастныйГость;

Объект.Примечание = ЗаявкаСайтОбъект.Комментарий;

Проживание = Объект.Проживание;

Для Каждого Строка Из ЗаявкаСайтОбъект.Проживание Цикл
	Если Строка.СуммаЗаДень = 0 Тогда
		Прервать;		
	КонецЕсли;
	
	НоваяСтрока = Проживание.Добавить();
	НоваяСтрока.ГУИД = Новый УникальныйИдентификатор();
	
	НоваяСтрока.ДеньПроживания = Строка.ДатаПроживания;
	НоваяСтрока.Цена = Строка.СуммаЗаДень;
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Сумма = Строка.СуммаЗаДень;
	НоваяСтрока.СуммаБезСкидки = Строка.СуммаЗаДень;
КонецЦикла;	
КонецПроцедуры
//

&НаСервере
Процедура УстановитьПроцентыВ2В()
ПроцентКомиссии = ДокументыСервер.ПроцентКомиссии(Объект.Бронирует, Объект.РезервС);	
	
ЭтоТурагентство = Объект.Бронирует.Турагентство;

Элементы.В2В.Видимость = ЭтоТурагентство;
Элементы.ПроцентВ2В.Видимость = ЭтоТурагентство;

ПроцентВ2В = ДокументыСервер.ПроцентВ2В(Объект.Бронирует, Объект.РезервС);
Если ПроцентВ2В = 0 Тогда
	В2В = Ложь;
	Элементы.В2В.ТолькоПросмотр = Истина;
	//Элементы.ПроцентВ2В.ТолькоПросмотр = Истина;
Иначе
	Элементы.В2В.ТолькоПросмотр = Ложь;
	//Элементы.ПроцентВ2В.ТолькоПросмотр = Ложь;
КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура В2ВПриИзменении(Элемент)
Если Объект.В2В Тогда  	
	ПроцентВ2В = ДокументыСервер.ПроцентВ2В(Объект.Бронирует, Объект.РезервС);
Иначе
	ПроцентВ2В = 0;
КонецЕсли;

Если ((НЕ Объект.В2В) ИЛИ Объект.В2В  И ПроцентВ2В <> 0) И Объект.Проживание.Количество() > 0 Тогда
	ПоказатьПредупреждение(, "Изменение процента В2В.
		|
		|ПЕРЕЗАПОЛНИТЕ РАСЧЕТ ПРОЖИВАНИЯ (при необходимости) ...");
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытоПриИзменении(Элемент)
//Если Закрыто Тогда 
//	Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусБрони.Выехал") Тогда 
//		Закрыто = Ложь;
//		 
//		Возврат; 
//	 КонецЕсли;	 
//КонецЕсли;			
	
Если Закрыто Тогда 
	ДанныеОбъект = Объект;		
	Результат = ЗакрытиеСервер.ЗаявкаКЗакрытию(ДанныеОбъект, Истина);
	
	Если НЕ Результат.ЗаявкаКЗакрытию Тогда
		Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_ПодтвердитеЗакрытиеЗаявки", ЭтаФорма);
		
		ТекстПредупреждения = Результат.ОшибкаОписание;

		ПоказатьВопрос(Оповещение, ТекстПредупреждения + "
		|
		|ПОДТВЕРДИТЕ ЗАКРЫТИЕ ЗАЯВКИ ...", РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
КонецЕсли;

ОткрытьЗакрытьЗаявку();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_ПодтвердитеЗакрытиеЗаявки(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда 
	Закрыто = Не Закрыто;
	
	Возврат; 
КонецЕсли;
	
ОткрытьЗакрытьЗаявку();	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗакрытьЗаявку() 
//Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;	
	
Объект.Закрыто = Закрыто;

Если Объект.Закрыто Тогда
	Объект.ДатаЗакрытия = ТекущаяДата();	
Иначе	
	Объект.ДатаЗакрытия = Неопределено;	
КонецЕсли;

ЭтаФорма.Записать(Новый Структура(РежимЗаписиДокумента.Проведение));
ЭтаФорма.ТолькоПросмотр = Закрыто;
КонецПроцедуры

//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
ОбновитьДанныеКолонокТабличныхЧастей();
ОбновитьЗакрыто();

ПрошлыйПериодДопУслуги_Обновить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
ОбновитьДанныеКолонокТабличныхЧастей();
ОбновитьЗакрыто();

ПрошлыйПериодДопУслуги_Обновить();
КонецПроцедуры
//

&НаСервере
Процедура ОбновитьЗакрыто()
Закрыто = Объект.Закрыто; 	
КонецПроцедуры

&НаСервере
Процедура ПрошлыйПериодДопУслуги_Обновить()
ОтКого = Объект.Клиент;

ТЗ = ПрошлыйПериодДопУслуги.Выгрузить();

ТЗ.Свернуть("ПрочиеОплатыДокументОплаты, ПрочиеОплатыДокументДолг", "Сумма");

Запрос = Новый Запрос;
Запрос.Текст = ЗаявкаСервер.ПрошлыйПериодДопУслуги_ТекстЗапроса();
Запрос.Текст = Запрос.Текст + "
                      |	И ПрочиеОплаты.ОтКого = &ОтКого
                      |	И ЕСТЬNULL(Долги.Сумма, 0) - ЕСТЬNULL(Закрыто.СуммаЗакрыто, 0) - ЕСТЬNULL(ТЗ.Сумма, 0) > 0
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаДолга";

Запрос.УстановитьПараметр("ОтКого", ОтКого);
Запрос.УстановитьПараметр("ТЗ", ТЗ);

Результат = Запрос.Выполнить();
Если Результат.Пустой() Тогда
	Элементы.ДопУслугиПрошлыеДолгиДопУслуги.ЦветФона = Новый Цвет();
Иначе
	Элементы.ДопУслугиПрошлыеДолгиДопУслуги.ЦветФона = WebЦвета.Розовый;
КонецЕсли;
	
КонецПроцедуры

//// + ОбновитьДанныеКолонокТабличныхЧастей
&НаСервере
Процедура ОбновитьДанныеКолонокТабличныхЧастей()
СуммаОплаченоИтогоПроживание = 0;
Для Каждого Строка Из Объект.Проживание Цикл
	ОтборСтроки = Новый Структура("ДолгиГУИД", Строка.ГУИД);
	СуммаОплатыДолгиГУИД = ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, Объект.РаспределениеОплатДолги);
	
	Строка.СуммаОплачено = СуммаОплатыДолгиГУИД;	
	СуммаОплаченоИтогоПроживание = СуммаОплаченоИтогоПроживание + Строка.СуммаОплачено;
	
	Строка.НомерСчета = НомерСчетаГУИД(Строка.ГУИД);
КонецЦикла;

СуммаОплаченоИтогоДопУслуги = 0;
СуммаИтогоДопУслуги = 0;
Для Каждого Строка Из Объект.ДопУслуги Цикл
	Строка.Сумма = Строка.Цена * Строка.Количество;	
	СуммаИтогоДопУслуги = СуммаИтогоДопУслуги + Строка.Сумма;
	
	ОтборСтроки = Новый Структура("ДолгиГУИД", Строка.ГУИД);
	СуммаОплатыДолгиГУИД = ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, Объект.РаспределениеОплатДолги);
	
	Строка.СуммаОплачено = СуммаОплатыДолгиГУИД;	
	СуммаОплаченоИтогоДопУслуги = СуммаОплаченоИтогоДопУслуги + Строка.СуммаОплачено;
	
	Строка.НомерСчета = НомерСчетаГУИД(Строка.ГУИД);	
КонецЦикла;

// + Счета
СуммаСчетИтогоСчета = 0;
Для Каждого Строка Из Объект.Счета Цикл
	СуммаСчетаДолги = СуммаДолгиСчет(Строка.СчетГУИД);
	
	Строка.Сумма = СуммаСчетаДолги;	
	СуммаСчетИтогоСчета = СуммаСчетИтогоСчета + Строка.Сумма;
КонецЦикла;

СуммаСчетОплаченоИтогоСчета = 0;
Для Каждого Строка Из Объект.Счета Цикл
	СуммаОплатыСчет = СуммаОплатыСчет(Строка.СчетГУИД);
	
	Строка.СуммаОплачено = СуммаОплатыСчет;	
	СуммаСчетОплаченоИтогоСчета = СуммаСчетОплаченоИтогоСчета + Строка.СуммаОплачено;
КонецЦикла;

СуммаСчетКЗакрытиюИтогоСчета = 0;
Для Каждого Строка Из Объект.Счета Цикл
	СуммаКЗакрытиюСчет = СуммаКЗакрытиюСчет(Строка.СчетГУИД);
	
	Строка.СуммаКЗакрытию = СуммаКЗакрытиюСчет;	
	СуммаСчетКЗакрытиюИтогоСчета = СуммаСчетКЗакрытиюИтогоСчета + Строка.СуммаКЗакрытию;
КонецЦикла;
// - Счета

// + СчетаДетальноОплаты 
ОбновитьСчетаДетальноОплаты();
// - СчетаДетальноОплаты 

// + Распределение Оплат
РаспределениеОплат.Очистить();
ТЗ = Объект.РаспределениеОплатДолги.Выгрузить();
ТЗ.Свернуть("СчетГУИД, ДокументОплаты", "СуммаОплаты");
Для Каждого Строка Из ТЗ Цикл
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	НайденныеСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		//Сообщить("ВНИМАНИЕ! В заявке - ошибочные данные. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
		Продолжить;
	КонецЕсли;
		
	Счет = НайденныеСтроки[0];
	
	НоваяСтрока = РаспределениеОплат.Добавить();
	НоваяСтрока.НомерСчета = Счет.НомерСчета;
	НоваяСтрока.ДатаСчета = Счет.ДатаСчета;
	НоваяСтрока.ДокументОплаты = Строка.ДокументОплаты;
	НоваяСтрока.СуммаОплаты = Строка.СуммаОплаты;
КонецЦикла;
// - Распределение Оплат

ОбновитьСумму();
ОбновитьИсториюОплат();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетаДетальноОплаты()
МассивДокументовДолг = Новый Массив;

ОплатыОбщееСервер.ОбновитьДанныеКолонокДокументыОплаты(СуммаРаспределеноИтогоОплаты
	, Объект.СчетаДетальноОплаты, Объект, МассивДокументовДолг);	
	
Для Каждого Строка Из Объект.СчетаДетальноОплаты Цикл
	Строка.ВидОперацииДокументОплаты = Строка.ДокументОплаты.ВидОперации;		
КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция СуммаДолгиСчет(СчетГУИД) 
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

СуммаСчета = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	СуммаСчета = СуммаСчета + Строка.СуммаДолг; 		
КонецЦикла;

Возврат СуммаСчета;
КонецФункции	

&НаСервере
Функция СуммаОплатыСчет(СчетГУИД) 
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = Объект.РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);

СуммаОплаты = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	СуммаОплаты = СуммаОплаты + Строка.СуммаОплаты; 		
КонецЦикла;

Возврат СуммаОплаты;
КонецФункции	

&НаСервере
Функция СуммаКЗакрытиюСчет(СчетГУИД) 
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

СуммаКЗакрытию = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	СуммаКЗакрытию = СуммаКЗакрытию + Строка.СуммаКЗакрытию; 		
КонецЦикла;

Возврат СуммаКЗакрытию;
КонецФункции	

&НаСервере
Функция НомерСчетаГУИД(ГУИД) 
ОтборСтроки = Новый Структура("ДолгиГУИД", ГУИД);
НайденныеСчетаДетальноДолги = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);	
Если НайденныеСчетаДетальноДолги.Количество() = 0 Тогда Возврат ""; КонецЕсли;

ТЗ = Новый ТаблицаЗначений;
КЧ = Новый КвалификаторыЧисла(12,0);

Массив = Новый Массив;
Массив.Добавить(Тип("Число"));
ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);

ТЗ.Колонки.Добавить("НомерСчета", ОписаниеТиповЧ); 

НомерСчета = "";
Для Каждого СтрокаНайденныеСчетаДетальноДолги Из НайденныеСчетаДетальноДолги Цикл 
	СчетГУИД = СтрокаНайденныеСчетаДетальноДолги.СчетГУИД;
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
	НайденныеСчета = Объект.Счета.НайтиСтроки(ОтборСтроки);
	Если НайденныеСчета.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.НомерСчета = НайденныеСчета[0].НомерСчета;
КонецЦикла;

ТЗ.Сортировать("НомерСчета");
Для Каждого Строка Из ТЗ Цикл 
	НомерСчетаДобавление = Строка(Строка.НомерСчета);
	НомерСчета = ОбщийФункционалКлиентСервер.ДобавитьТекст(НомерСчета, НомерСчетаДобавление, ", ");
КонецЦикла;

Возврат НомерСчета;
КонецФункции	
//// - ОбновитьДанныеКолонокТабличныхЧастей

//
&НаСервере
Функция ОтборТаблицаАнкет()
ТаблицаАнкет.Отбор.Элементы.Очистить();

НовЭлементОтбора = ТаблицаАнкет.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиент"); 
НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
НовЭлементОтбора.Использование = Истина;
НовЭлементОтбора.ПравоеЗначение = Объект.Клиент;	
КонецФункции

&НаСервере
Процедура ОбновитьИсториюОплат()
ИсторияОплат.Очистить();

ЗапросОплат=Новый Запрос("ВЫБРАТЬ
                         |	""БезНал"" КАК ВидОплаты,
                         |	ВыпискаБанка.Ссылка КАК Ссылка,
                         |	ВыпискаБанка.Дата КАК ДатаДокумента,
                         |	ВыпискаБанка.ДатаОплаты КАК ДатаОплаты,
                         |	ВыпискаБанка.ОтКого КАК Оплатил,
                         |	ВыпискаБанка.Сумма КАК СуммаДокументаОплаты,
                         |	ВыпискаБанкаВозврат.Сумма КАК СуммаВозврат,
                         |	ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументДолг КАК ДокументДолг,
                         |	ЗаявкаНаБронированиеСчетаДетальноОплаты.Сумма КАК СуммаОплаты
                         |ИЗ
                         |	Документ.ВыпискаБанка КАК ВыпискаБанка
                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК ДокументДолг,
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
                         |			СУММА(ЗаявкаНаБронированиеСчетаДетальноОплаты.СуммаРаспределено) КАК Сумма
                         |		ИЗ
                         |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                         |		ГДЕ
                         |			НЕ ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.ПометкаУдаления
                         |			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка = &ДокументДолг
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты,
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка) КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                         |		ПО ВыпискаБанка.Ссылка = ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                         |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
                         |		ИЗ
                         |			Документ.ВыпискаБанка КАК ВыпискаБанка
                         |		ГДЕ
                         |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			ВыпискаБанка.ВозвратДокумент) КАК ВыпискаБанкаВозврат
                         |		ПО ВыпискаБанка.Ссылка = ВыпискаБанкаВозврат.ВозвратДокумент
                         |ГДЕ
                         |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                         |	И ВыпискаБанка.Приход = ИСТИНА
                         |
                         |ОБЪЕДИНИТЬ ВСЕ
                         |
                         |ВЫБРАТЬ
                         |	""БезНал Возврат"",
                         |	ВыпискаБанкаВозврат.Ссылка,
                         |	ВыпискаБанкаВозврат.Дата,
                         |	ВыпискаБанкаВозврат.ДатаОплаты,
                         |	ВыпискаБанкаВозврат.ОтКого,
                         |	NULL,
                         |	-ВыпискаБанкаВозврат.Сумма,
                         |	NULL,
                         |	NULL
                         |ИЗ
                         |	Документ.ВыпискаБанка КАК ВыпискаБанкаВозврат
                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ВыпискаБанкаДолгиОплата.Ссылка КАК Ссылка,
                         |			ВыпискаБанкаДолгиОплата.ДокументДолг КАК ДокументДолг
                         |		ИЗ
                         |			Документ.ВыпискаБанка.ДолгиОплата КАК ВыпискаБанкаДолгиОплата
                         |		ГДЕ
                         |			ВыпискаБанкаДолгиОплата.Ссылка.ПометкаУдаления = ЛОЖЬ
                         |			И ВыпискаБанкаДолгиОплата.ДокументДолг = &ДокументДолг
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			ВыпискаБанкаДолгиОплата.Ссылка,
                         |			ВыпискаБанкаДолгиОплата.ДокументДолг) КАК ВыпискаБанкаДолгиОплаты
                         |		ПО ВыпискаБанкаВозврат.Ссылка = ВыпискаБанкаДолгиОплаты.Ссылка
                         |ГДЕ
                         |	ВыпискаБанкаВозврат.ПометкаУдаления = ЛОЖЬ
                         |	И ВыпискаБанкаВозврат.Возврат = ИСТИНА
                         |
                         |ОБЪЕДИНИТЬ ВСЕ
                         |
                         |ВЫБРАТЬ
                         |	ВЫБОР
                         |		КОГДА КассовыйДокумент.СуммаНаличные > 0
                         |				И КассовыйДокумент.СуммаКарта > 0
                         |			ТОГДА ""Смеш.""
                         |		ИНАЧЕ ВЫБОР
                         |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                         |					ТОГДА ""Нал""
                         |				ИНАЧЕ ""Карта""
                         |			КОНЕЦ
                         |	КОНЕЦ,
                         |	КассовыйДокумент.Ссылка,
                         |	КассовыйДокумент.Дата,
                         |	КассовыйДокумент.ДатаОплаты,
                         |	КассовыйДокумент.ОтКого,
                         |	КассовыйДокумент.Сумма,
                         |	КассовыйДокументВозврат.Сумма,
                         |	ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументДолг,
                         |	ЗаявкаНаБронированиеСчетаДетальноОплаты.Сумма
                         |ИЗ
                         |	Документ.КассовыйДокумент КАК КассовыйДокумент
                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК ДокументДолг,
                         |			СУММА(ЗаявкаНаБронированиеСчетаДетальноОплаты.СуммаРаспределено) КАК Сумма
                         |		ИЗ
                         |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                         |		ГДЕ
                         |			НЕ ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.ПометкаУдаления
                         |			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка = &ДокументДолг
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты,
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка) КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                         |		ПО КассовыйДокумент.Ссылка = ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                         |			СУММА(КассовыйДокумент.Сумма) КАК Сумма
                         |		ИЗ
                         |			Документ.КассовыйДокумент КАК КассовыйДокумент
                         |		ГДЕ
                         |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			КассовыйДокумент.ВозвратДокумент) КАК КассовыйДокументВозврат
                         |		ПО КассовыйДокумент.Ссылка = КассовыйДокументВозврат.ВозвратДокумент
                         |ГДЕ
                         |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                         |	И КассовыйДокумент.Приход = ИСТИНА
                         |
                         |ОБЪЕДИНИТЬ ВСЕ
                         |
                         |ВЫБРАТЬ
                         |	ВЫБОР
                         |		КОГДА КассовыйДокумент.СуммаНаличные > 0
                         |				И КассовыйДокумент.СуммаКарта > 0
                         |			ТОГДА ""Смеш.""
                         |		ИНАЧЕ ВЫБОР
                         |				КОГДА КассовыйДокумент.СуммаНаличные > 0
                         |					ТОГДА ""Нал""
                         |				ИНАЧЕ ""Карта""
                         |			КОНЕЦ
                         |	КОНЕЦ,
                         |	КассовыйДокумент.Ссылка,
                         |	КассовыйДокумент.Дата,
                         |	КассовыйДокумент.ДатаОплаты,
                         |	КассовыйДокумент.ОтКого,
                         |	КассовыйДокумент.Сумма,
                         |	КассовыйДокументВозврат.Сумма,
                         |	NULL,
                         |	NULL
                         |ИЗ
                         |	Документ.КассовыйДокумент КАК КассовыйДокумент
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК ДокументДолг
                         |		ИЗ
                         |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                         |		ГДЕ
                         |			НЕ ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.ПометкаУдаления
                         |			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка = &ДокументДолг) КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                         |		ПО КассовыйДокумент.Ссылка = ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                         |			СУММА(КассовыйДокумент.Сумма) КАК Сумма
                         |		ИЗ
                         |			Документ.КассовыйДокумент КАК КассовыйДокумент
                         |		ГДЕ
                         |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			КассовыйДокумент.ВозвратДокумент) КАК КассовыйДокументВозврат
                         |		ПО КассовыйДокумент.Ссылка = КассовыйДокументВозврат.ВозвратДокумент
                         |ГДЕ
                         |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                         |	И КассовыйДокумент.Приход = ИСТИНА
                         |	И ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты ЕСТЬ NULL
                         |	И КассовыйДокумент.ДокументДолг = &ДокументДолг
                         |
                         |ОБЪЕДИНИТЬ ВСЕ
                         |
                         |ВЫБРАТЬ
                         |	""Касса Возврат"",
                         |	КассовыйДокументВозврат.Ссылка,
                         |	КассовыйДокументВозврат.Дата,
                         |	КассовыйДокументВозврат.ДатаОплаты,
                         |	КассовыйДокументВозврат.ОтКого,
                         |	&ДокументДолг,
                         |	-КассовыйДокументВозврат.Сумма,
                         |	NULL,
                         |	NULL
                         |ИЗ
                         |	Документ.КассовыйДокумент КАК КассовыйДокументВозврат
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			КассовыйДокументДолгиОплаты.Ссылка КАК Ссылка,
                         |			КассовыйДокументДолгиОплаты.ДокументДолг КАК ДокументДолг
                         |		ИЗ
                         |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплаты
                         |		ГДЕ
                         |			КассовыйДокументДолгиОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
                         |			И КассовыйДокументДолгиОплаты.ДокументДолг = &ДокументДолг
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			КассовыйДокументДолгиОплаты.Ссылка,
                         |			КассовыйДокументДолгиОплаты.ДокументДолг) КАК КассовыйДокументДолгиОплаты
                         |		ПО КассовыйДокументВозврат.Ссылка = КассовыйДокументДолгиОплаты.Ссылка
                         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			КассовыйДокумент.Ссылка КАК Ссылка,
                         |			КассовыйДокумент.ДокументДолг КАК ДокументДолг
                         |		ИЗ
                         |			Документ.КассовыйДокумент КАК КассовыйДокумент
                         |		ГДЕ
                         |			КассовыйДокумент.Ссылка.ПометкаУдаления = ЛОЖЬ
                         |			И КассовыйДокумент.ДокументДолг = &ДокументДолг) КАК КассовыйДокумент
                         |		ПО КассовыйДокументВозврат.Ссылка = КассовыйДокумент.Ссылка
                         |ГДЕ
                         |	КассовыйДокументВозврат.ПометкаУдаления = ЛОЖЬ
                         |	И КассовыйДокументВозврат.Возврат = ИСТИНА
                         |	И НЕ(КассовыйДокументДолгиОплаты.Ссылка ЕСТЬ NULL
                         |				И КассовыйДокумент.Ссылка ЕСТЬ NULL)
                         |
                         |ОБЪЕДИНИТЬ ВСЕ
                         |
                         |ВЫБРАТЬ
                         |	""ПрочиеОплаты"",
                         |	ПрочиеОплаты.Ссылка,
                         |	ПрочиеОплаты.Дата,
                         |	ПрочиеОплаты.ДатаОплаты,
                         |	ПрочиеОплаты.ОтКого,
                         |	ПрочиеОплаты.Сумма,
                         |	NULL,
                         |	ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументДолг,
                         |	ЗаявкаНаБронированиеСчетаДетальноОплаты.Сумма
                         |ИЗ
                         |	Документ.ПрочиеОплаты КАК ПрочиеОплаты
                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты КАК ДокументОплаты,
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК ДокументДолг,
                         |			СУММА(ЗаявкаНаБронированиеСчетаДетальноОплаты.СуммаРаспределено) КАК Сумма
                         |		ИЗ
                         |			Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                         |		ГДЕ
                         |			НЕ ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.ПометкаУдаления
                         |			И ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка = &ДокументДолг
                         |		
                         |		СГРУППИРОВАТЬ ПО
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты,
                         |			ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка) КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                         |		ПО ПрочиеОплаты.Ссылка = ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты
                         |ГДЕ
                         |	ПрочиеОплаты.ПометкаУдаления = ЛОЖЬ
                         |	И ПрочиеОплаты.Приход = ИСТИНА");

ЗапросОплат.УстановитьПараметр("ДокументДолг",Объект.Ссылка);
ТЗОпл=ЗапросОплат.Выполнить().Выгрузить();

Для Каждого СтрОпл из ТЗОпл цикл
	НовОпл=ИсторияОплат.Добавить();
	
	ЗаполнитьЗначенияСвойств(НовОпл, СтрОпл); 
	//НовОпл.Дата =СтрОпл.Дата;
	//НовОпл.ДатаОплаты=СтрОпл.ДатаОплаты;
	//НовОпл.СуммаОплаты=СтрОпл.Сумма;
	//НовОпл.ВидОплаты=СтрОпл.Вид;
	//НовОпл.Оплатил=СтрОпл.ОтКого;
	//НовОпл.Аванс=СтрОпл.Аванс;
	//
	//НовОпл.Возврат=СтрОпл.Возврат;
	//НовОпл.Отмена=СтрОпл.Отмена;
КонецЦикла;

ИсторияОплат.Сортировать("ДатаОплаты, ДатаДокумента");
КонецПроцедуры
//

// ИсторияКлиента ЭТО Предпочтения Клиента
&НаСервере
Функция ПредпочтенияИсторияКлиента()
Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда Возврат Неопределено; КонецЕсли;

ПолеОтчета.Очистить();
//	Макет=ПолучитьМакет("ПредпочтенияКлиента");
Макет=ПолучитьМакетНаСервере("Объект", "ПредпочтенияКлиента");

Обл=Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Обл.Параметры.Вид="Этаж";
Обл.Параметры.Значение=Объект.Клиент.ЖелательныйЭтаж;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Обл.Параметры.Вид="Завтрак";
Обл.Параметры.Значение=Объект.Клиент.Завтрак;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Обл.Параметры.Вид="Доп. принадлежности";
Обл.Параметры.Значение=Объект.Клиент.ДопПринадлежности;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Обл.Параметры.Вид="Предпочтительный номер";
Обл.Параметры.Значение=Объект.Клиент.ПредпочтительныйНомер;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Обл.Параметры.Вид="Балкон";
Обл.Параметры.Значение=Объект.Клиент.Балкон;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Обл.Параметры.Вид="Вид из окна";
Обл.Параметры.Значение=Объект.Клиент.ВидИзОкна;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Обл.Параметры.Вид="Ванна";
Обл.Параметры.Значение=Объект.Клиент.Ванна;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Обл.Параметры.Вид="Иное";
Обл.Параметры.Значение=Объект.Клиент.Иное;
ПолеОтчета.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
ПолеОтчета.Вывести(Обл);

ПечатьСервер.ВывестиИсториюКлиента(ПолеОтчета, Объект.Клиент, Объект.Дата);
Возврат Неопределено;
КонецФункции
//

//
&НаКлиенте
Процедура ИсторияКлиентаКоманда(Команда)
ТабДок = Новый ТабличныйДокумент;	

ПечатьСервер.ВывестиИсториюКлиента(ТабДок, Объект.Клиент, Объект.Дата);

//ТабДок = ИсторияКлиентаКомандаНаСервере();

КлиентНаименование = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Наименование");
ТабДок.Показать("История клиента " + КлиентНаименование);
КонецПроцедуры

&НаСервере
Функция ИсторияКлиентаКомандаНаСервере()
	ТабДок=Новый ТабличныйДокумент;
	
//	Макет=ПолучитьМакет("МакетИсторииКлиента");
	//Макет = ПолучитьМакетНаСервере("Объект", "МакетИсторииКлиента");	
	Макет = Справочники.Клиенты.ПолучитьМакет("МакетИсторииКлиента");
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Для каждого Пок Из Объект.Клиент.ПрочаяИнформация Цикл
		Если Пок.Информация="" тогда
			Продолжить;
		КонецЕсли;
		
		Обл.Параметры.Показатель=Пок.ВидИнформации.Наименование;
		Обл.Параметры.Значение=Пок.Информация;
		ТабДок.Вывести(Обл);	
	КонецЦикла; 
	
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЗаявкаНаБронирование.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	|ГДЕ
	|	ЗаявкаНаБронирование.Клиент = &Клиент
	|	И ЗаявкаНаБронирование.Дата < &Дата");
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);						
	Запрос.УстановитьПараметр("Дата",Объект.Дата);
	ТЗ=Запрос.Выполнить().Выгрузить();
	Для каждого СтрПос Из ТЗ Цикл
		Обл=Макет.ПолучитьОбласть("Шапка");
		Обл.Параметры.СтрокаПос="Проживание с " + Формат(СтрПос.Ссылка.РезервС, "ДФ=dd.MM.yy") + " по " + Формат(СтрПос.Ссылка.РезервПо, "ДФ=dd.MM.yy") + " " + СтрПос.Ссылка.НомерВРезерв.Наименование;
		ТабДок.Вывести(Обл);
		Если СтрПос.Ссылка.ДопПожелания.Количество()=0 тогда
			Обл.Параметры.СтрокаПос="Пожелания отсутствуют";
		иначе
			Обл.Параметры.СтрокаПос="Пожелания:";
		конецесли;
		ТабДок.Вывести(Обл);
		Обл=Макет.ПолучитьОбласть("Строка");
		Для каждого Доп Из СтрПос.Ссылка.ДопПожелания Цикл
			Если Доп.Информация="" тогда
				Продолжить;
			КонецЕсли;
			Обл.Параметры.Показатель=Доп.ВидИнформации.Наименование;
			Обл.Параметры.Значение=Доп.Информация;
			ТабДок.Вывести(Обл);	
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Возврат ТабДок; 
//	ТабДок.Показать();
КонецФункции
//

//
&НаСервере
Функция ОтборТабличноеПолеСМС()
ТабличноеПолеСМС.Отбор.Элементы.Очистить();

НовЭлементОтбора = ТабличноеПолеСМС.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Бронь"); 
НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
НовЭлементОтбора.Использование = Истина;
НовЭлементОтбора.ПравоеЗначение = Объект.Ссылка;	
КонецФункции
// 
////

//
&НаСервере
Функция ОбновитьСумму()
СуммаПроживание = 0; СуммаПроживаниеОплачено = 0;
Для Каждого Строка Из Объект.Проживание Цикл
	СуммаПроживание = СуммаПроживание + Строка.Сумма;
	СуммаПроживаниеОплачено = СуммаПроживаниеОплачено + Строка.СуммаОплачено;
КонецЦикла;	
СуммаПроживаниеКОплате = СуммаПроживание - СуммаПроживаниеОплачено;  

СуммаУслуги = 0; СуммаУслугиОплачено = 0;
Для Каждого Строка Из Объект.ДопУслуги Цикл
	Если НЕ Строка.ВСчет Тогда Продолжить; КонецЕсли;
	
	СуммаУслуги = СуммаУслуги + Строка.Сумма;
	СуммаУслугиОплачено = СуммаУслугиОплачено + Строка.СуммаОплачено;
КонецЦикла;	
СуммаУслугиКОплате = СуммаУслуги - СуммаУслугиОплачено;  

СуммаРаспределеноКасса = 0;
СуммаРаспределеноВыписка = 0;
СуммаРаспределеноПрочиеОплаты = 0;
Для Каждого Строка из Объект.СчетаДетальноОплаты Цикл
	Если ТипЗнч(Строка.ДокументОплаты) = ТИП("ДокументСсылка.КассовыйДокумент") Тогда 
		СуммаРаспределеноКасса = СуммаРаспределеноКасса + Строка.СуммаРаспределено;
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = ТИП("ДокументСсылка.ВыпискаБанка") Тогда
		СуммаРаспределеноВыписка = СуммаРаспределеноВыписка + Строка.СуммаРаспределено;
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = ТИП("ДокументСсылка.ПрочиеОплаты") Тогда
		СуммаРаспределеноПрочиеОплаты = СуммаРаспределеноПрочиеОплаты + Строка.СуммаРаспределено;
	КонецЕсли;
КонецЦикла;	

СуммаОплаты = СуммаРаспределеноКасса + СуммаРаспределеноВыписка + СуммаРаспределеноПрочиеОплаты;
СуммаНачислено = СуммаПроживание + СуммаУслуги;
СуммаДолг = СуммаНачислено - СуммаОплаты;

НадписьСумма = "ИТОГО к оплате: " + "проживание " + СуммаПроживание
		+ ", услуги " + СуммаУслуги + ", итого: " + СуммаНачислено  + ". ";
		
НадписьОшибка = "";
Если СуммаДолг = 0 Тогда  
	НадписьСумма = НадписьСумма + "Долг отсутсвует."		
Иначе
	Если СуммаДолг > 0 Тогда	
		НадписьОшибка = НадписьОшибка + "Долг: " + "проживание " + СуммаПроживаниеКОплате
			+ ", услуги " + СуммаУслугиКОплате + ".";
	ИначеЕсли СуммаДолг < 0 Тогда  
	//	НадписьОшибка = НадписьОшибка + "Переплата: " + "касса " + СуммаОстатокКассаКРаспределению
	//		+ ", выписка " + СуммаОстатокВыпискаКРаспределению + ".";
		НадписьОшибка = НадписьОшибка + "Переплата: " + "касса " + Строка(-СуммаДолг);
	КонецЕсли;
КонецЕсли;

Элементы.НадписьСумма.Ширина = СтрДлина(НадписьСумма) + 1; 
Элементы.НадписьСумма.Заголовок = НадписьСумма;

//НадписьОшибка = "";
//СуммаДолгиКОплате = СуммаПроживаниеКОплате + СуммаУслугиКОплате;
//Если НЕ (СуммаДолгиКОплате = 0 ИЛИ СуммаОстатокКассаКРаспределению = 0) Тогда
//	НадписьОшибка = "Незакрытый долг: " + "проживание " + СуммаПроживаниеКОплате
//		+ ", услуги " + СуммаУслугиКОплате + ". "; 
//	НадписьОшибка = НадписьОшибка + "Нераспределенные оплаты: " + "Касса " + СуммаОстатокКассаКРаспределению 
//		+ ", выписка " + СуммаОстатокВыпискаКРаспределению + ". "; 
//	//НадписьОшибка = НадписьОшибка + "ТРЕБУЕТСЯ РАСПРЕДЕЛЕНИЕ ОПЛАТ."; 	
//КонецЕсли;	

Элементы.НадписьОшибка.Ширина = СтрДлина(НадписьОшибка) + 1; 
Элементы.НадписьОшибка.Заголовок = НадписьОшибка;
КонецФункции
//

// + ПСН
&НаКлиенте
Функция ЭтотОбъектЗаписатьНаКлиенте()
Если ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда 
	
	Возврат Ложь; 
Иначе
	Сообщить("Есть ошибки при записи Заявки. ЗАПИСЬ ОТМЕНЕНА");
	Возврат Истина; 
КонецЕсли;
КонецФункции

&НаСервере
Функция ЭтотОбъектЗаписатьНаСервере()
Попытка 
	ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
	
	Возврат Ложь; 
Исключение 
	Сообщить("Есть ошибки при записи Заявки. ЗАПИСЬ ОТМЕНЕНА");
	Возврат Истина; 
КонецПопытки;

Возврат Ложь; 
КонецФункции
// - ПСН

//
&НаКлиенте
Процедура БонШансПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(Объект.РезервС) Тогда Объект.БонШанс = Ложь; Возврат; КонецЕсли;	
	
Если ОплатыОбщееКлиент.ЕстьСчета(Объект.Счета) Тогда 
	ТекстПредупреждения =  "Есть счета
							|
							|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...";
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
	Объект.БонШанс = НЕ Объект.БонШанс; 
	Возврат;
КонецЕсли;

Если Объект.БонШанс Тогда 
	Объект.РезервПо = Объект.РезервС;
	Объект.Проживание.Очистить();
КонецЕсли;
КонецПроцедуры
//

//// + Изменение статуса
&НаКлиенте
Процедура БроньУстановка(Команда)
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь") Тогда Возврат; КонецЕсли;
		
Если  Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ПустаяСсылка")
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтменаБронирования")
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтказОтБронирования")
Тогда 
	Ответ = ДокументыСервер.ЗанятостьНомераПроверить(Объект.РезервС, Объект.РезервПо, Объект.ВремяЗаезда, Объект.ВремяВыезда
		, Объект.НомерВРезерв, Объект.БонШанс, Объект.Ссылка);
	Если Ответ.Результат Тогда
		Сообщить("Номер занят. " + Ответ.Регистратор);
		
		Возврат;	
	КонецЕсли;

	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь");
	Объект.ДатаАннуляции = Неопределено;
	
	ЭтотОбъектЗаписатьНаКлиенте();
	Возврат;
КонецЕсли;	

ПоказатьПредупреждение(,"Некорректная установка статуса !");
КонецПроцедуры

&НаКлиенте
Процедура ОтменаБронированияУстановка(Команда)
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтменаБронирования") Тогда Возврат; КонецЕсли;
	
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь") 
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтказОтБронирования") 
Тогда 
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтменаБронирования");
	Объект.ДатаАннуляции=ТекущаяДата();
	
	ЭтотОбъектЗаписатьНаКлиенте();
	Возврат;
КонецЕсли;	

ПоказатьПредупреждение(,"Некорректная установка статуса !");
КонецПроцедуры

&НаКлиенте
Процедура ОтказОтБронированияУстановка(Команда)
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтказОтБронирования") Тогда Возврат; КонецЕсли;
	
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь") 
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Проживает") 
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтменаБронирования") 
Тогда 
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтказОтБронирования");
	Объект.ДатаАннуляции=ТекущаяДата();
	
	ЭтотОбъектЗаписатьНаКлиенте();
	Возврат;
КонецЕсли;	

ПоказатьПредупреждение(,"Некорректная установка статуса !");
КонецПроцедуры


&НаКлиенте
Процедура НеустойкаУстановка(Команда)
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Неустойка") Тогда Возврат; КонецЕсли;
		
Если  Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ПустаяСсылка")
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь")
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтменаБронирования")
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтказОтБронирования")
Тогда 
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Неустойка");
	
	ЭтотОбъектЗаписатьНаКлиенте();
	Возврат;
КонецЕсли;	

ПоказатьПредупреждение(,"Некорректная установка статуса !");
КонецПроцедуры

&НаКлиенте
Процедура ОтменаНеустойкаУстановка(Команда)
Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусБрони.Неустойка") Тогда Возврат; КонецЕсли;
	
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Неустойка") 
Тогда 
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь");
	
	ЭтотОбъектЗаписатьНаКлиенте();
	Возврат;
КонецЕсли;	

ПоказатьПредупреждение(,"Некорректная установка статуса !");
КонецПроцедуры


// + Время точное заехал / выехал
&НаКлиенте
Процедура Заехал(Команда)
//Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Проживает") Тогда Возврат; КонецЕсли;
	
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь") Тогда 
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Проживает");
	Объект.ДатаАннуляции=Неопределено;

	Объект.ВремяЗаездаТочное=ТекущаяДата();
	//Элементы.Заехал.Доступность=Ложь;
	Элементы.Заехал.ЦветФона = ЦветФонаКнопки;
	
	ПроверкаВремяЗаездаТочное();	
	
	ЭтотОбъектЗаписатьНаКлиенте();
	
ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Проживает") Тогда
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь");
	Объект.ДатаАннуляции=Неопределено;
	
	Объект.ВремяЗаездаТочное = Неопределено;
	//Элементы.Заехал.Доступность = Истина;
	Элементы.Заехал.ЦветФона = Новый Цвет();
	
	ЭтотОбъектЗаписатьНаКлиенте();
	
Иначе	
	ПоказатьПредупреждение(,"Некорректная установка статуса !");
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяЗаездаТочноеПриИзменении(Элемент)
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Проживает") Тогда 	
	ВремяЗаездаТочное_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "ВремяЗаездаТочное");
	Если ЗначениеЗаполнено(ВремяЗаездаТочное_OldValue) Тогда 
		Если НачалоДня(Объект.ВремяЗаездаТочное) = '00010101' Тогда 
			
			ПоказатьПредупреждение(, "В статусе " + Объект.Статус + " установка пустого времени заезда НЕ разрешена");
			Объект.ВремяЗаездаТочное = ВремяЗаездаТочное_OldValue;
			Возврат; 
		КонецЕсли;	
	КонецЕсли;	
ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Выехал") Тогда 
Иначе
	Если ЗначениеЗаполнено(Объект.ВремяЗаездаТочное) Тогда		
			ПоказатьПредупреждение(, "В статусе " + Объект.Статус + " должно быть пустое время заезда");
			Объект.ВремяЗаездаТочное = Неопределено;
			Возврат; 
	КонецЕсли;
КонецЕсли;
	
ПроверкаВремяЗаездаТочное();	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаВремяЗаездаТочное()
Если НачалоДня(Объект.ВремяЗаездаТочное) < Объект.РезервС Тогда 
	Текст_1 = "ВНИМАНИЕ: Точное время заезда меньше Даты резерва С. "; 
	Текст_2 = "Добавьте новые строки проживания ";
	Текст_3 = "или исправьте точное время заезда";
	
	ПоказатьПредупреждение(, Текст_1 + Символы.ПС + Символы.ПС + Текст_2 + Символы.ПС + Текст_3 ); 
	Сообщить(Текст_1 + Текст_2 + Текст_3);
	
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции

&НаКлиенте
Асинх Процедура Выехал(Команда)
//Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Выехал") Тогда Возврат; КонецЕсли;
	
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Проживает")
Тогда 
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Выехал");
	Объект.ДатаАннуляции=Неопределено;
	
	Объект.ВремяВыездаТочное = ТекущаяДата();
	//Элементы.Выехал.Доступность=Ложь;
	Элементы.Выехал.ЦветФона = ЦветФонаКнопки;
	
	ПроверкаВремяВыездаТочное();
	
	ЭтотОбъектЗаписатьНаКлиенте();
	
	Текст = ПроверкаОтправкиАктаИСчетаФактуры();
	Если НЕ ЗначениеЗаполнено(Текст) Тогда Возврат; КонецЕсли;	
	
	обещание = ВопросАсинх(Текст, РежимДиалогаВопрос.ОКОтмена);
	Результат = Ждать обещание; // тут выполнение остановится пока пользователь не ответит на вопрос
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
	
    ОтправкаАктаИСчетаФактуры(Неопределено);
	
ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Выехал") Тогда
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Проживает");
	Объект.ДатаАннуляции=Неопределено;
	
	Объект.ВремяВыездаТочное = Неопределено;
	//Элементы.Заехал.Доступность = Истина;
	Элементы.Выехал.ЦветФона = Новый Цвет();
	
	ЭтотОбъектЗаписатьНаКлиенте();
	
Иначе	
	ПоказатьПредупреждение(,"Некорректная установка статуса !");
КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверкаОтправкиАктаИСчетаФактуры()
ТС = Элементы.Счета.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат "Встаньте на нужный счет ..."; КонецЕслИ;

ТД = Объект.Счета.НайтиПоИдентификатору(ТС);
Контрагент = ТД.Контрагент;

Если Контрагент.ТипКлиента <> Перечисления.ТипыКлиентов.ЮрЛицо 
ИЛИ Контрагент.Турагентство 
Тогда Возврат ""; КонецЕсли;	

Если Контрагент <> Объект.Оплачивает Тогда
	Возврат "Контрагент текущего счета <> Оплачивает
			|
			|Встаньте на нужный счет ...";
КонецЕсли;

ЭлПочта = Контрагент.ЭлПочта;
Если НЕ ЗначениеЗаполнено(ЭлПочта) Тогда
	Возврат "У контрагента не заполнена электронная почта 
			|
			|Отправить Акт и счет-фактуру ?";	
КонецЕсли;

Возврат "Отправить Акт и счет-фактуру ?";
	
КонецФункции

&НаКлиенте
Процедура ВремяВыездаТочноеПриИзменении(Элемент)
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Выехал") Тогда 	
	ВремяВыездаТочное_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "ВремяВыездаТочное");
	Если ЗначениеЗаполнено(ВремяВыездаТочное_OldValue) Тогда 
		Если НачалоДня(Объект.ВремяВыездаТочное) = '00010101' Тогда 
			
			ПоказатьПредупреждение(, "В статусе " + Объект.Статус + " установка пустого времени выезда НЕ разрешена");
			Объект.ВремяВыездаТочное = ВремяВыездаТочное_OldValue;
			Возврат; 
		КонецЕсли;	
	КонецЕсли;	
Иначе
	// + Аудит
	//Если ЗначениеЗаполнено(Объект.ВремяЗаездаТочное) Тогда		
	Если ЗначениеЗаполнено(Объект.ВремяВыездаТочное) Тогда		
	// - Аудит
			ПоказатьПредупреждение(, "В статусе " + Объект.Статус + " должно быть пустое время выезда");
			Объект.ВремяВыездаТочное = Неопределено;
			Возврат; 
	КонецЕсли;
КонецЕсли;
	
ПроверкаВремяВыездаТочное();
КонецПроцедуры

&НаКлиенте
Функция ПроверкаВремяВыездаТочное()
	
Если НачалоДня(Объект.ВремяВыездаТочное) > Объект.РезервПо Тогда 
	Текст_1 = "ВНИМАНИЕ: Точное время выезда больше Даты резерва По. "; 
	Текст_2 = "Добавьте новые строки проживания ";
	Текст_3 = "или исправьте точное время выезда";
	
	ПоказатьПредупреждение(, Текст_1 + Символы.ПС + Символы.ПС + Текст_2 + Символы.ПС + Текст_3 ); 
	Сообщить(Текст_1 + Текст_2 + Текст_3);
	
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции
// - Время точное заехал / выехал

//// -  Изменение статуса


////// + Перед Записью

////
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Если ПроверкаЗаполнения_ПередЗаписью() Тогда Отказ = Истина; Возврат; КонецЕсли;

Если НЕ (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтказОтБронирования")  	
ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтменаБронирования"))  	
Тогда
	Ответ = ДокументыСервер.ЗанятостьНомераПроверить(Объект.РезервС, Объект.РезервПо, Объект.ВремяЗаезда, Объект.ВремяВыезда
		, Объект.НомерВРезерв, Объект.БонШанс, Объект.Ссылка);
	Если Ответ.Результат Тогда
		ТекстСообщения = "Номер занят. " + Ответ.Регистратор;
		ПоказатьПредупреждение(, ТекстСообщения);
		Сообщить("Номер занят. " + Ответ.Регистратор);
		
		Отказ = Истина; Возврат;	
	КонецЕсли;
КонецЕсли;

//Если ПроверкаЗаполненияРеквизитов() Тогда Отказ = Истина; Возврат; КонецЕсли;

ПередЗаписью_Продолжение();	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияРеквизитов_НеИспользуется()
//Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтменаБронирования")	
//ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтказОтБронирования")	
//Тогда Возврат Ложь; КонецЕсли;

ТекстСообщения = "";

ТекущийЭлемент_П = Неопределено;
Если НЕ ЗначениеЗаполнено(Объект.ТипБронирования) Тогда
	ТекстСообщения = "Не заполнен Тип бронирования.";
	ТекущийЭлемент_П = Элементы.ТипБронирования;
КонецЕсли;

Если Объект.ТипБронирования <> ПредопределенноеЗначение("Справочник.ТипБронирования.Ремонт") Тогда
	Если НЕ ЗначениеЗаполнено(Объект.КаналБронирования) Тогда
		ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "Не заполнен Канал бронирования.", " ");
		
		Если ТекущийЭлемент_П = Неопределено Тогда ТекущийЭлемент_П = Элементы.КаналБронирования; КонецЕсли;
	КонецЕсли;
КонецЕсли;
	
Если ТекстСообщения <> "" Тогда
	ТекстСообщения = ТекстСообщения + " ЗАПИСЬ ОТМЕНЯЕТСЯ ...";
	Сообщить(ТекстСообщения);
	
	ЭтаФорма.ТекущийЭлемент = ТекущийЭлемент_П;
	
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции

//
&НаСервере
Функция ПроверкаЗаполнения_ПередЗаписью()
ТекстСообщения = ПроверкаЗаполненияТекстСообщенияПередЗаписьюНаСервере(Объект);
Если ТекстСообщения <> "" Тогда
	ТекстСообщения = ТекстСообщения + " ЗАПИСЬ ОТМЕНЕНА.";
	Сообщить(ТекстСообщения); 
	
	Возврат Истина; 
КонецЕсли;

//
Результат = ПроверкаСуммПередЗаписьюНаСервере(Объект);

ТекстСообщения = "";
Если Результат.ЕстьПроживание0 Тогда 
	ТекстСообщения = "В проживании есть строки с суммой = 0."; 
КонецЕсли;

Если Результат.ЕстьДопУслуги0 Тогда 
	ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстСообщения, "В услугах есть строки с суммой = 0.", " "); 
КонецЕсли;

Если ТекстСообщения <> "" Тогда 
	ТекстСообщения = "ВНИМАНИЕ !!! " + ТекстСообщения;
	//ТекстСообщения = ТекстСообщения  + "ЗАПИСЬ ОТМЕНЕНА";
	Сообщить(ТекстСообщения); 
	
	Возврат Истина; 
КонецЕсли;
//

Возврат Ложь; 
КонецФункции

&НаСервере
Функция ПроверкаЗаполненияТекстСообщенияПередЗаписьюНаСервере(ТекущийОбъект)
Возврат ДокументыСервер.ПроверкаЗаполненияЗаявкаНабронированиеТекстСообщения(ТекущийОбъект, " ");
КонецФункции

&НаСервере
Функция ПроверкаСуммПередЗаписьюНаСервере(ТекущийОбъект)
ЕстьПроживание0 = Ложь;
ЕстьДопУслуги0 = Ложь;

Для Каждого Строка Из ТекущийОбъект.Проживание Цикл
	Если Строка.Сумма = 0 Тогда ЕстьПроживание0 = Истина; Прервать; КонецЕсли;
КонецЦикла;	

Для Каждого Строка Из ТекущийОбъект.ДопУслуги Цикл
	Если НЕ Строка.ВСчет Тогда Продолжить; КонецЕсли; 	
	Если (Строка.Цена * Строка.Количество)  = 0 Тогда ЕстьДопУслуги0 = Истина; Прервать; КонецЕсли;
КонецЦикла;

Результат = Новый Структура("ЕстьПроживание0, ЕстьДопУслуги0", ЕстьПроживание0, ЕстьДопУслуги0);
Возврат Результат;
КонецФункции
//
////

////
&НаСервере
Процедура ПередЗаписью_Продолжение()
// Обновление РезервС, РезервПо 
Результат = ОбновитьРезервСРезервПоПередЗаписьюНаСервере(Объект);

ТекстПредупрежденияПослеЗаписи = "";
Если Результат <> Неопределено Тогда

	ТекстПредупреждения = "";
	Если Результат.ЕстьНесколькоДеньПроживания Тогда
		ТекстПредупреждения = "В проживании есть строки с одинаковыми днями проживания."; 
	КонецЕсли;

	Если Результат.ЕстьУдаленныеПустыеСтроки Тогда
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения, "Удалены пустые строки из проживания."
			, Символы.ПС + Символы.ПС); 
 
	КонецЕсли;
	
	Если Результат.ЕстьРасхожденияРезервС Тогда
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			, "Есть расхождения 'Резерв С' и Расчета проживания."
			, Символы.ПС + Символы.ПС); 
 
	КонецЕсли;

	Если Результат.ЕстьРасхожденияРезервПо Тогда
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			, "Есть расхождения 'Резерв По' и Расчета проживания."
			, Символы.ПС + Символы.ПС); 
 
	КонецЕсли;

	Если ТекстПредупреждения <> "" Тогда
		ТекстПредупрежденияПослеЗаписи = "ВНИМАНИЕ !" + Символы.ПС + Символы.ПС + ТекстПредупреждения;
	КонецЕсли;
КонецЕсли;	

Для каждого Услуга Из Объект.ДопУслуги Цикл
	Если Услуга.ДатаУслуги=Дата(1,1,1) тогда
		Услуга.ДатаУслуги=ТекущаяДата();
	КонецЕсли;
КонецЦикла;

УстановитьГорничныеЕстьИзмененияПередЗаписью();

Если СчетаКОбновлению.Количество() > 0  Тогда
	ОбновитьСчетаКОбновлениюПередЗаписьюНаСервере(Объект);
КонецЕсли;

СсылкаСтатус_OldValue = Объект.Ссылка.Статус;

Если НЕ Объект.БонШанс Тогда
	РезультатСкидкаКлиента = ДокументыСервер.СкидкаКлиента(Объект);
	Объект.СкидкаКлиента = РезультатСкидкаКлиента.Скидка;
	Объект.УровеньСкидкиКлиента = РезультатСкидкаКлиента.Уровень;
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьРезервСРезервПоПередЗаписьюНаСервере(ТекущийОбъект)
Если ЗаполнитьПроживание Тогда Возврат Неопределено; КонецЕсли;	
//Если УдалитьРаспределениеОплатНаСчет Тогда Возврат Неопределено; КонецЕсли;	
Если ТекущийОбъект.Проживание.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли;	

РезервС_OldValue = ТекущийОбъект.Ссылка.РезервС;
РезервПо_OldValue = ТекущийОбъект.Ссылка.РезервПо;

ТекущийОбъект.Проживание.Сортировать("ДеньПроживания");

// Удаление пустых строк (ДеньПроживания) Проживание
ЕстьУдаленныеПустыеСтроки = Ложь;
ЕстьНесколькоДеньПроживания = Ложь;

МассивКУдалению = Новый Массив;
Для Каждого Строка Из ТекущийОбъект.Проживание Цикл
	Если НЕ ЗначениеЗаполнено(Строка.ДеньПроживания) Тогда
		ОтборСтроки = Новый Структура("ДолгиГУИД", Строка.ГУИД);
		НайденныеСтроки = ТекущийОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки); 
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ЗаявкаСервер.ОчиститьСчетаДетальноОплатыОтборСтроки(ОтборСтроки, ТекущийОбъект.РаспределениеОплатДолги, ТекущийОбъект.СчетаДетальноОплаты);
			ТекущийОбъект.СчетаДетальноДолги.Удалить(НайденнаяСтрока);
		КонецЦикла;	
		
		ЕстьУдаленныеПустыеСтроки = Истина;
		МассивКУдалению.Добавить(Строка); 	
	КонецЕсли;	
	
	ОтборСтроки = Новый Структура("ДеньПроживания", Строка.ДеньПроживания); 
	НайденныеСтроки = ТекущийОбъект.Проживание.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 1 Тогда 
		ЕстьНесколькоДеньПроживания = Истина;
	КонецЕсли;	
КонецЦикла;	
ОбщийФункционалСервер.УдалитьСтроки(ТекущийОбъект.Проживание, МассивКУдалению); 
//

Если ТекущийОбъект.Проживание.Количество() = 1 Тогда 
	Если ТекущийОбъект.РезервС = ТекущийОбъект.РезервПо Тогда 
		ПерваяСтрока = ТекущийОбъект.Проживание[0];
	Иначе	
		ПерваяСтрока = ТекущийОбъект.Проживание[0];
		Если НЕ (ТекущийОбъект.РезервС = РезервС_OldValue И ТекущийОбъект.РезервПо = РезервПо_OldValue) Тогда
			Если ТекущийОбъект.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр0 Тогда
				ПерваяСтрокаКоличество = 2;
			ИначеЕсли ТекущийОбъект.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр6 Тогда
				ПерваяСтрокаКоличество = 1.5;
			Иначе	
				ПерваяСтрокаКоличество = 1;
			КонецЕсли;
			
			Если ТекущийОбъект.ВремяВыезда = Перечисления.ВремяВыезда.Вр18 Тогда
				ПерваяСтрокаКоличество = ПерваяСтрокаКоличество + 0.5;
			ИначеЕсли ТекущийОбъект.ВремяВыезда = Перечисления.ВремяВыезда.Вр0 Тогда
				ПерваяСтрокаКоличество = ПерваяСтрокаКоличество + 1.0;
			КонецЕсли;

			Если ПерваяСтрока.Количество <> ПерваяСтрокаКоличество Тогда
				ПерваяСтрока.Количество = ПерваяСтрокаКоличество;

				ПерваяСтрока.СуммаБезСкидки = ПерваяСтрока.Цена * ПерваяСтрока.Количество;
				ДокументыСервер.ЗаполнитьСуммаСоСкидкойСтрокаПроживание(ПерваяСтрока);
				ОбновитьСтрокаСчетаДетальноДолги(ПерваяСтрока, Ложь, ТекущийОбъект);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПоследняяСтрока = ТекущийОбъект.Проживание[0];
	
	Перейти ~ВЫХОД;
КонецЕсли;

// + Обновление строк
ПерваяСтрока = ТекущийОбъект.Проживание[0];
Если НЕ (ТекущийОбъект.РезервС = РезервС_OldValue И ТекущийОбъект.РезервПо = РезервПо_OldValue) Тогда
	Если ТекущийОбъект.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр0 Тогда
		ПерваяСтрокаКоличество = 2;
	ИначеЕсли ТекущийОбъект.ВремяЗаезда = Перечисления.ВремяЗаезда.Вр6 Тогда
		ПерваяСтрокаКоличество = 1.5;
	Иначе	
		ПерваяСтрокаКоличество = 1;
	КонецЕсли;

	Если ПерваяСтрока.Количество <> ПерваяСтрокаКоличество Тогда
		ПерваяСтрока.Количество = ПерваяСтрокаКоличество;

		ПерваяСтрока.СуммаБезСкидки = ПерваяСтрока.Цена * ПерваяСтрока.Количество;
		ДокументыСервер.ЗаполнитьСуммаСоСкидкойСтрокаПроживание(ПерваяСтрока);
		ОбновитьСтрокаСчетаДетальноДолги(ПерваяСтрока, Ложь, ТекущийОбъект);
	КонецЕсли;
КонецЕсли;

ПоследнийИндекс = ТекущийОбъект.Проживание.Количество() - 1;

Если ПоследнийИндекс > 1 Тогда 
	Для Индекс = 1 По ТекущийОбъект.Проживание.Количество() - 2 Цикл
		Строка = ТекущийОбъект.Проживание[Индекс]; 
		Если Строка.Количество = 1 Тогда Продолжить; КонецЕсли;
			
		Строка.Количество = 1;
		Строка.СуммаБезСкидки = Строка.Цена * Строка.Количество;
		ДокументыСервер.ЗаполнитьСуммаСоСкидкойСтрокаПроживание(Строка);
		ОбновитьСтрокаСчетаДетальноДолги(Строка, Ложь, ТекущийОбъект);
	КонецЦикла;
КонецЕсли;

ПоследняяСтрока = ТекущийОбъект.Проживание[ПоследнийИндекс];
Если НЕ (ТекущийОбъект.РезервС = РезервС_OldValue И ТекущийОбъект.РезервПо = РезервПо_OldValue) Тогда
	Если ТекущийОбъект.ВремяВыезда = Перечисления.ВремяВыезда.Вр18 Тогда
		ПоследняяСтрокаКоличество = 1.5;
	ИначеЕсли ТекущийОбъект.ВремяВыезда = Перечисления.ВремяВыезда.Вр0 Тогда
		ПоследняяСтрокаКоличество = 2;
	Иначе		
		ПоследняяСтрокаКоличество = 1;
	КонецЕсли;

	Если ПоследняяСтрока.Количество <> ПоследняяСтрокаКоличество Тогда  
		ПоследняяСтрока.Количество = ПоследняяСтрокаКоличество; 
		
		ПоследняяСтрока.СуммаБезСкидки = ПоследняяСтрока.Цена * ПоследняяСтрока.Количество;
		ДокументыСервер.ЗаполнитьСуммаСоСкидкойСтрокаПроживание(ПоследняяСтрока);
		ОбновитьСтрокаСчетаДетальноДолги(ПоследняяСтрока, Ложь, ТекущийОбъект);
	КонецЕсли;
КонецЕсли;
// - Обновление строк

~ВЫХОД:
ДеньПроживанияМинимум = ПерваяСтрока.ДеньПроживания;
ЕстьРасхожденияРезервС = (ТекущийОбъект.Проживание.Количество() <> 0)  И (ТекущийОбъект.РезервС <> ДеньПроживанияМинимум); 

Если ТекущийОбъект.БонШанс Тогда
	ДеньПроживанияМаксимум = ПоследняяСтрока.ДеньПроживания; 	
Иначе	
	ДеньПроживанияМаксимум = ПоследняяСтрока.ДеньПроживания + 86400; 
КонецЕсли;

ЕстьРасхожденияРезервПо = (ТекущийОбъект.Проживание.Количество() <> 0) И (ТекущийОбъект.РезервПо <> ДеньПроживанияМаксимум);
// - Резерв По

ТекущийОбъект.КолВоДней = ТекущийОбъект.Проживание.Итог("Количество");

Результат = Новый Структура;
Результат.Вставить("ЕстьНесколькоДеньПроживания", ЕстьНесколькоДеньПроживания);
Результат.Вставить("ЕстьУдаленныеПустыеСтроки", ЕстьУдаленныеПустыеСтроки);
Результат.Вставить("ЕстьРасхожденияРезервС", ЕстьРасхожденияРезервС);
Результат.Вставить("ЕстьРасхожденияРезервПо", ЕстьРасхожденияРезервПо);

Возврат Результат;
КонецФункции	

&НаСервере
Процедура УстановитьГорничныеЕстьИзмененияПередЗаписью()
Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ГорничныеЕстьИзменения = (Объект.РезервС <> Объект.Ссылка.РезервС) 
							ИЛИ (Объект.РезервПо <> Объект.Ссылка.РезервПо)
							ИЛИ (Объект.НомерВРезерв <> Объект.Ссылка.НомерВРезерв)
							ИЛИ (Объект.РаздельныеКровати <> Объект.Ссылка.РаздельныеКровати)
							ИЛИ (Объект.КолВоЧеловек <> Объект.Ссылка.КолВоЧеловек)
							ИЛИ (Объект.ДопМесто_1_Возраст <> Объект.Ссылка.ДопМесто_1_Возраст)
							ИЛИ (Объект.ДопМесто_1_ТипДопМеста <> Объект.Ссылка.ДопМесто_1_ТипДопМеста)
							ИЛИ (Объект.ДопМесто_2_Возраст <> Объект.Ссылка.ДопМесто_2_Возраст)
							ИЛИ (Объект.ДопМесто_2_ТипДопМеста <> Объект.Ссылка.ДопМесто_2_ТипДопМеста)
							ИЛИ (Объект.ГорничныеВремяЗаезда <> Объект.Ссылка.ГорничныеВремяЗаезда)							
							ИЛИ (Объект.ВремяЗаездаТочное <> Объект.Ссылка.ВремяЗаездаТочное)							
							ИЛИ (Объект.ВремяВыездаТочное <> Объект.Ссылка.ВремяВыездаТочное)							
							ИЛИ (Объект.ГорничныеКоментарий <> Объект.Ссылка.ГорничныеКоментарий)							;		
Иначе
	ГорничныеЕстьИзменения = Ложь;
КонецЕсли;		
КонецПроцедуры	

&НаСервере
Процедура ОбновитьСчетаКОбновлениюПередЗаписьюНаСервере(ТекущийОбъект)
СчетаКОбновлению_П = СчетаКОбновлению.Выгрузить(, "СчетГУИД");
СчетаКОбновлению_П.Свернуть("СчетГУИД");

Для Каждого Строка Из СчетаКОбновлению_П Цикл
	ОтборСтроки = Новый Структура("СчетГУИД", Строка.СчетГУИД);
	НайденныеСчета = ТекущийОбъект.Счета.НайтиСтроки(ОтборСтроки);
	Если НайденныеСчета.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Счет = НайденныеСчета[0]; 
	
	ОбновитьСчетЗаявка(Счет, ТекущийОбъект, Ложь);
КонецЦикла;

СчетаКОбновлению.Очистить();		
КонецПроцедуры	

&НаСервере
Функция СкидкаКлиента_1()
Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда Возврат 0; КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.РезервС) Тогда Возврат 0; КонецЕсли;

Если Объект.Клиент.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо Тогда Возврат 0; КонецЕсли;

Если Объект.Бронирует.Турагентство 
ИЛИ Объект.Бронирует.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо 
Тогда Возврат 0; КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	СчетаДолги.КоличествоНочей КАК КоличествоНочей,
                      |	ЗаявкаНаБронированиеСчета.ГрупповойСчет КАК ГрупповойСчет,
                      |	ЗаявкаНаБронированиеСчета.ЭтоПредварительныйГрупповойСчет КАК ЭтоПредварительныйГрупповойСчет,
                      |	ЗаявкаНаБронированиеСчета.Контрагент КАК Контрагент,
                      |	ЗаявкаНаБронированиеСчета.Клиент КАК Клиент,
                      |	ЗаявкаНаБронированиеСчета.Ссылка.Бронирует КАК Бронирует
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронированиеСчетаДетальноДолги.ДолгиГУИД) КАК КоличествоНочей
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДолги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДолги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДолги.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
                      |	И ЗаявкаНаБронированиеСчета.Клиент = &Клиент
                      |	И ЗаявкаНаБронированиеСчета.Ссылка.РезервС < &РезервС");

Запрос.УстановитьПараметр("РезервС", Объект.РезервС);
Запрос.УстановитьПараметр("Клиент", Объект.Клиент);

ТЗ = Запрос.Выполнить().Выгрузить();

КоличествоНочей = 0;
Для Каждого Строка Из ТЗ Цикл 
	Если Строка.Бронирует.Турагентство 
	ИЛИ Строка.Бронирует.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо 
	Тогда Продолжить; КонецЕсли;
	
	Если Строка.ЭтоПредварительныйГрупповойСчет 
	ИЛИ ЗначениеЗаполнено(Строка.ГрупповойСчет) 
	Тогда
		Если Строка.Клиент <> Строка.Бронирует Тогда Продолжить; КонецЕсли;
	КонецЕсли;
	
	КоличествоНочей = КоличествоНочей + Строка.КоличествоНочей; 	
КонецЦикла;

Если КоличествоНочей = 0 Тогда Возврат 0; КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	СкидкиКлиента.КоличествоНочей КАК КоличествоНочей,
                      |	СкидкиКлиента.Скидка КАК Скидка
                      |ИЗ
                      |	РегистрСведений.СкидкиКлиента КАК СкидкиКлиента
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КоличествоНочей");

ТЗ = Запрос.Выполнить().Выгрузить();

СкидкаКлиента = 0;
Для Каждого Строка Из ТЗ Цикл
	Если Строка.КоличествоНочей >= КоличествоНочей Тогда Прервать; КонецЕсли;
 	
	СкидкаКлиента = Строка.Скидка;		
КонецЦикла;

Возврат СкидкаКлиента;	
КонецФункции

////
////// - Перед Записью

/////// + Отправка СМС, СоздатьЗаданиеГорничной при измениии статуса
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
Если ТекстПредупрежденияПослеЗаписи <> "" Тогда
	 ПоказатьПредупреждение(, ТекстПредупрежденияПослеЗаписи); 
КонецЕсли;
	
ОбработкаСтатусаПослеЗаписи();

СсылкаСтатус_OldValue = Объект.Статус;
Статус_OldValue = Объект.Статус;

КатегорияНомера_OldValue = Объект.КатегорияНомера;

Если фл_ОтправитьСМС Тогда 
	фл_ОтправитьСМС = Ложь; 
	
	ОтправитьСМСПослеЗаписи(); 	
КонецЕсли;

Оповестить("ИзменениеЗаявкиНаБронирование");
КонецПроцедуры

// + Задание горничным, Зарегистрировать Клиента В БонуснойБазе 
&НаСервере
Процедура ОбработкаСтатусаПослеЗаписи()
Если Объект.ЛистОжидания Тогда Возврат; КонецЕсли;	
	
Если (Объект.Статус = СсылкаСтатус_OldValue) И (НЕ ГорничныеЕстьИзменения) Тогда Возврат; КонецЕсли;  

Событие = "";
Если (Объект.Статус <> СсылкаСтатус_OldValue) Тогда
	Если Объект.Статус = Перечисления.СтатусБрони.Бронь Тогда 
		Если СсылкаСтатус_OldValue = Перечисления.СтатусБрони.Проживает тогда
			Событие = "ОтменаЗаезда";
		Иначе
			Событие = "Бронирование";
		КонецЕсли;
		
	ИначеЕсли Объект.Статус = Перечисления.СтатусБрони.Проживает тогда
		Если СсылкаСтатус_OldValue = Перечисления.СтатусБрони.Выехал тогда
			Событие = "ОтменаВыезда";
		ИначеЕсли СсылкаСтатус_OldValue = Перечисления.СтатусБрони.Бронь тогда
			Событие = "Заезд";
		КонецЕсли;
		
	ИначеЕсли Объект.Статус= Перечисления.СтатусБрони.Выехал Тогда
		Событие = "Выезд";
			
	ИначеЕсли Объект.Статус = Перечисления.СтатусБрони.ОтменаБронирования тогда
	    Событие = "ОтменаБронирования";

	ИначеЕсли Объект.Статус= Перечисления.СтатусБрони.ОтказОтБронирования Тогда
		Событие = "ОтказОтБронирования";
		
	КонецЕсли;
КонецЕсли;
	
Если Событие <> "" ИЛИ ГорничныеЕстьИзменения Тогда
	ОбменГорничныеСервер.СоздатьЗаявку(Объект.Ссылка, Событие);	
КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ЗарегистрироватьКлиентаВБонуснойБазе()
СтруктураОтвета = Новый Структура("ЕстьОшибка, ТекстОтвета", Ложь, "");

Попытка
	База =СлужебныеСервер.ConnectБаза_BONUS();;
	
	Рез=База.ЗарегистрироватьКлиента(Объект.Клиент.Фамилия, Объект.Клиент.Имя, Объект.Клиент.Отчество
		, Объект.Клиент.ДатаРождения, Объект.Клиент.Код);
	
	СтруктураОтвета.ТекстОтвета = Рез.РезультатРегистрации;
//				Сообщить(Рез.РезультатРегистрации);
Исключение
	СтруктураОтвета.ЕстьОшибка = Истина;
	СтруктураОтвета.ТекстОтвета = "Не получилось выполнить регистрацию в бонусной базе";
//				Сообщить("Не получилось выполнить регистрацию в бонусной базе");
КонецПопытки; 	

Возврат СтруктураОтвета; 
КонецФункции
// - Задание горничным, Зарегистрировать Клиента В БонуснойБазе 


//
&НаКлиенте
Процедура ПровестиКоманда(Команда)
фл_ОтправитьСМС = Истина;
ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
фл_ОтправитьСМС = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрытьКоманда(Команда)
фл_ОтправитьСМС = Истина;
Если ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
	ЭтаФорма.Закрыть();	
КонецЕсли;
фл_ОтправитьСМС = Ложь;
КонецПроцедуры
//

//// + Отправка СМС

//
&НаКлиенте
Процедура ОтправитьСМСПослеЗаписи()
ВопросОтправитьСМС(Ложь); 
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМСКоманда(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;	
	
ВопросОтправитьСМС(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВопросОтправитьСМС(ВызовИзКоманды) 
ОтменаБронирования = Неопределено;		
Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.Бронь") тогда
	ОтменаБронирования = Ложь;		
	
ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусБрони.ОтменаБронирования") Тогда
	ОтменаБронирования = Истина;		
КонецЕсли;
Если ОтменаБронирования = Неопределено Тогда Возврат; КонецЕсли;

КлиентТелефон = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Телефон");
КлиентТелефон = СокрЛП(КлиентТелефон);

НетОтправленныхСМС = НетОтправленныхСМС(ОтменаБронирования);

Если НЕ НетОтправленныхСМС И НЕ ВызовИзКоманды Тогда Возврат; КонецЕсли;

Ответ = СлужебныеКлиентСервер.ПроверкаНомераТелефона(КлиентТелефон); 

Если Ответ.КодОшибки = 1 Тогда Возврат; КонецЕсли;

Если Ответ.КодОшибки = -1 Тогда
	ПоказатьПредупреждение(, "ОТПРАВКА СМС
							|
							|Некорректный номер телефона у клиента для отправки СМС: " + КлиентТелефон
		+ Символы.ПС + Символы.ПС + "Отправка СМС невозможна !");
		
	Если НетОтправленныхСМС Тогда	
		МесенджерВключен = МесенджерСервер.МесенджерВключен();
		ЗаписатьОтправкуСМС(КлиентТелефон, "", ОтменаБронирования
			, МесенджерВключен, 10, "Некорректный номер телефона: " + КлиентТелефон);
	КонецЕсли;
	
	Возврат;
КонецЕсли;

ДопПараметры = Новый Структура; 
ДопПараметры.Вставить("Телефон", КлиентТелефон); 
ДопПараметры.Вставить("ОтменаБронирования", ОтменаБронирования); 
ДопПараметры.Вставить("НетОтправленныхСМС", НетОтправленныхСМС); 

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаОтправитьСМС", ЭтаФорма, ДопПараметры);

Если ОтменаБронирования Тогда
	ТекстВопроса = "Отправить СМС об отмене бронирования на номер:" + КлиентТелефон + " ?";
Иначе
	ТекстВопроса = "Отправить СМС о бронировании на номер: " + КлиентТелефон + " ?";
КонецЕсли;

Если НЕ НетОтправленныхСМС Тогда
	ТекстВопроса = "ПОВТОРНОЕ ОТПРАВЛЕНИЕ СМС. " + Символы.ПС + Символы.ПС + ТекстВопроса;
КонецЕсли;
	
ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры	

&НаКлиенте
Процедура ЗавершениеВопросаОтправитьСМС(Результат, ДопПараметры) Экспорт
КлиентТелефон = ДопПараметры.Телефон;
ОтменаБронирования = ДопПараметры.ОтменаБронирования;
НетОтправленныхСМС = ДопПараметры.НетОтправленныхСМС;

МесенджерВключен = МесенджерСервер.МесенджерВключен();

Если Результат = КодВозвратаДиалога.Да  Тогда
	Если ОтменаБронирования Тогда
		ТекстWhatsApp = ЗаполнитьТекстДляСМСОтменаБронирования();
		ТекстСМС = ЗаполнитьТекстДляСМСОтменаБронирования();
	Иначе
		ТекстWhatsApp = ЗаполнитьТекстДляWhatsAppБронирование();
		ТекстСМС = ЗаполнитьТекстДляСМСБронирование();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстWhatsApp) Тогда ТекстWhatsApp = ТекстСМС; КонецЕсли;
	
	Результат = ОтправитьСМС(КлиентТелефон, ТекстСМС, ТекстWhatsApp, МесенджерВключен);
	
	Если МесенджерВключен И Результат.КодВозврата = 0 Тогда
		ТекстСообщения = ТекстWhatsApp;
	Иначе
		ТекстСообщения = ТекстСМС;
	КонецЕсли;		
	
	ЗаписатьОтправкуСМС(КлиентТелефон, ТекстСообщения, ОтменаБронирования
		, МесенджерВключен, Результат.КодВозврата, Результат.ОписаниеОшибки);
	
Иначе	
	Если НетОтправленныхСМС Тогда
		Если ОтменаБронирования Тогда
			ТекстСМС = "Отмена отправки СМС об отмене бронирования";
		Иначе
			ТекстСМС = "Отмена отправки СМС о бронировании";
		КонецЕсли;
		
		ЗаписатьОтправкуСМС(КлиентТелефон, ТекстСМС, ОтменаБронирования
			, МесенджерВключен, 0, "");
	КонецЕсли; 	
КонецЕсли; 	
КонецПроцедуры	

&НаСервере
Функция НетОтправленныхСМС(ОтметкаОтменаБронирования)   
ОтборСтроки = Новый Структура("ОтметкаОтменаБронирования, КодОшибки", ОтметкаОтменаБронирования, 0);
НайденныеСтроки = Объект.СМС.НайтиСтроки(ОтборСтроки);

Возврат НайденныеСтроки.Количество() = 0;
КонецФункции

&НаСервере
Функция НетОтправленныхСМС_Регистр(ОтметкаОтменаБронирования)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	СМС.Бронь КАК Бронь
                      |ИЗ
                      |	РегистрСведений.СМС КАК СМС
                      |ГДЕ
                      |	СМС.Бронь = &Бронь
                      |	И СМС.ОтметкаОтменаБронирования = &ОтметкаОтменаБронирования");
Запрос.УстановитьПараметр("Бронь", Объект.Ссылка);
Запрос.УстановитьПараметр("ОтметкаОтменаБронирования", ОтметкаОтменаБронирования);

Возврат Запрос.Выполнить().Пустой();
КонецФункции

&НаКлиенте
Функция ЗаполнитьТекстДляWhatsAppБронирование() Экспорт
КатегорияНомераНаименование = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.КатегорияНомера, "Наименование");

//СуммаИтого = Объект.Проживание.Итог("Сумма");
СуммаИтого = Объект.СчетаДетальноДолги.Итог("СуммаДолг");

ТекстДляСМС = "";	
Если НастройкиСервер.ЭтоЛайв() Тогда
	ТекстДляСМС = ТекстДляСМС + "Дорогой Гость!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Подтверждаем бронирование в city-отеле LIVE!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Номер: " + КатегорияНомераНаименование;
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Кол-во Гостей: " + Строка(Объект.КолВоЧеловек);
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Заезд: " + Формат(Объект.РезервС, "ДФ=dd.MM.yy");
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Выезд: " + Формат(Объект.РезервПо, "ДФ=dd.MM.yy");
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Итого: " + СуммаИтого;
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Будем рады принять любые пожелания и ответить на Ваши вопросы.";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "До скорой встречи!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "г. Екатеринбург, ул.Красноармейская, 72";
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда
	ТекстДляСМС = ТекстДляСМС + "Дорогой Гость!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Подтверждаем бронирование в бутик-отель 'Чехов'!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Номер: " + КатегорияНомераНаименование;
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Кол-во Гостей: " + Строка(Объект.КолВоЧеловек);
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Заезд: " + Формат(Объект.РезервС, "ДФ=dd.MM.yy");
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Выезд: " + Формат(Объект.РезервПо, "ДФ=dd.MM.yy");
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Итого: " + СуммаИтого;
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Будем рады принять любые пожелания и ответить на Ваши вопросы.";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "До скорой встречи!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "г. Екатеринбург, ул.8 Марта, 32";
ИначеЕсли НастройкиСервер.ЭтоРеноме() Тогда
	ТекстДляСМС = ТекстДляСМС + "Дорогой Гость!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Подтверждаем бронирование в отеле 'Реноме'!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Номер: " + КатегорияНомераНаименование;
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Кол-во Гостей: " + Строка(Объект.КолВоЧеловек);
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Заезд: " + Формат(Объект.РезервС, "ДФ=dd.MM.yy");
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Выезд: " + Формат(Объект.РезервПо, "ДФ=dd.MM.yy");
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Итого: " + СуммаИтого;
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Будем рады принять любые пожелания и ответить на Ваши вопросы.";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "До скорой встречи!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "г. Екатеринбург, ул.8 Марта, 50";
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда
//Дорогой Гость! Подтверждаем бронирование в капсульном арт-отеле Street Art!
//Капсула: стандарт (эконом, улучшенная)
//Кол-во Гостей: 1
//Заезд: 
//Выезд:
//Будем рады стать Вашим домом в г.Екатеринбурге!  До скорой встречи! 
//г.Екатеринбург, Белинского, 54, 2 эт.
//P.S. пароль для входа в отель уточняйте у администратора по телефону/ Ватц апп
	
	ТекстДляСМС = ТекстДляСМС + "Дорогой Гость!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Подтверждаем бронирование в капсульном арт-отеле Street Art!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Капсула: " + КатегорияНомераНаименование;
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Кол-во Гостей: " + Строка(Объект.КолВоЧеловек);
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Заезд: " + Формат(Объект.РезервС, "ДФ=dd.MM.yy");
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Выезд: " + Формат(Объект.РезервПо, "ДФ=dd.MM.yy");
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Итого: " + СуммаИтого;
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Будем рады стать Вашим домом в г.Екатеринбурге! До скорой встречи!";
	//ТекстДляСМС = ТекстДляСМС + Символы.ПС + "До скорой встречи!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "г.Екатеринбург, Белинского, 54, 2 эт.";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "P.S. пароль для входа в отель уточняйте у администратора по телефону / Ватц апп";
	
ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда
	
//Дорогой Гость! Подтверждаем бронирование в отель-музей "Дом Советов"!
//Номер: стандартный
//Кол-во Гостей: 1
//Заезд: 
//Выезд:
//Будем рады стать Вашим домом в г.Екатеринбурге!  Принимаем любые пожелания, готовы ответить на все вопросы
//До скорой встречи! 
//г.Екатеринбург, 8 Марта 2 (вход с А.Валека)
	ТекстДляСМС = ТекстДляСМС + "Дорогой Гость!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Подтверждаем бронирование в отель-музей ""Дом Советов""!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Номер: " + "стандартный";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Кол-во Гостей: " + Строка(Объект.КолВоЧеловек);
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Заезд: " + Формат(Объект.РезервС, "ДФ=dd.MM.yy");
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Выезд: " + Формат(Объект.РезервПо, "ДФ=dd.MM.yy");
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Итого: " + СуммаИтого;
	
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "Будем рады стать Вашим домом в г.Екатеринбурге!  Принимаем любые пожелания, готовы ответить на все вопросы";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "До скорой встречи!";
	ТекстДляСМС = ТекстДляСМС + Символы.ПС + "г.Екатеринбург, 8 Марта 2 (вход с А.Валека)";
КонецЕсли;		

Возврат ТекстДляСМС;
КонецФункции

&НаКлиенте
Функция ЗаполнитьТекстДляСМСБронирование() Экспорт
КатегорияНомераНаименование = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.КатегорияНомера, "Наименование");

ТекстДляСМС = "Номер:" + КатегорияНомераНаименование + ", " + Строка(Объект.КолВоЧеловек) + " мест с " +
            Формат(Объект.РезервС, "ДФ=dd.MM")+ " по " +
            Формат(Объект.РезервПо, "ДФ=dd.MM")+ " До встречи! ";

Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
ОрганизацияТекстДляСМС = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Организация, "ТекстДляСМС"); 
ТекстДляСМС = ТекстДляСМС + ОрганизацияТекстДляСМС;

Возврат ТекстДляСМС;
КонецФункции

&НаКлиенте
Функция ЗаполнитьТекстДляСМСОтменаБронирования() Экспорт
КатегорияНомераНаименование = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.КатегорияНомера, "Наименование");

ТекстДляСМС = "Отмена бронирования:" + КатегорияНомераНаименование + ", " + Строка(Объект.КолВоЧеловек) + " мест с " +
            Формат(Объект.РезервС, "ДФ=dd.MM")+ " по " +
            Формат(Объект.РезервПо, "ДФ=dd.MM")+ " ";

Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
ОрганизацияТекстДляСМС = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Организация, "ТекстДляСМС"); 
ТекстДляСМС = ТекстДляСМС + Строка(ОрганизацияТекстДляСМС);
			
Возврат ТекстДляСМС;
КонецФункции

&НаКлиенте
Функция ОтправитьСМС(Телефон, ТекстСМС, ТекстWhatsApp, МесенджерВключен)
Результат = Новый Структура("КодВозврата, ОписаниеОшибки", 0, "");	

Если МесенджерВключен Тогда
	//Ответ = СлужебныеСервер.ОтправитьWhatsApp(Телефон, ТекстWhatsApp);
	Ответ = МесенджерСервер.ОтправитьДанные_Месенджер("ОтправитьТекст", Телефон, ТекстWhatsApp, Неопределено, Неопределено);
	Если Ответ.Ошибка Тогда
		Если СтрНайти(Ответ.Описание, "не зарегистрирован") > 0 Тогда
			ТекстПредупреждения = Ответ.Описание;
			ТекстСообщения = Ответ.Описание;
		ИначеЕсли СтрНайти(Ответ.Описание, "Некорректный номер телефона") > 0 Тогда
			ТекстПредупреждения = Ответ.Описание;
			ТекстСообщения = Ответ.Описание;
		Иначе
			ТекстОшибки = "Ошибка отправки сообщения через Месенджер. ";
			ТекстПредупреждения = ТекстОшибки + Символы.ПС + Ответ.Описание;
				
			ТекстСообщения = ТекстОшибки + Ответ.Описание;
			ТекстСообщения = ТекстСообщения + " ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ";
		КонецЕсли;
		
		ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Символы.ПС 
			+ "БУДЕТ ОТПРАВЛЕНО СМС СООБЩЕНИЕ ...";
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
		ТекстСообщения = ТекстСообщения + Символы.ПС 
			+ "БУДЕТ ОТПРАВЛЕНО СМС СООБЩЕНИЕ ...";
		Сообщить(ТекстСообщения);
		
		Результат.КодВозврата = 1;
		Результат.ОписаниеОшибки = Ответ.Описание;
		
		Перейти ~ОТПРАВКА_СМС;
	КонецЕсли;
	
	Возврат Результат;
КонецЕсли; 	
	
~ОТПРАВКА_СМС:	
Ответ = СлужебныеСервер.ОтправитьBytehand(Телефон, ТекстСМС);
Если Ответ Тогда
	
	ТекстСообщения = "Ошибка отправки СМС. ";
	Сообщить(ТекстСообщения);	
	
	Результат.КодВозврата = 2;
	Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + ". " + ТекстСообщения;
КонецЕсли;

Возврат Результат;
КонецФункции
//

&НаСервере
Функция ЗаписатьОтправкуСМС(Телефон, ТекстСМС, ОтметкаОтменаБронирования, ЭтоWhatsApp
	,КодОшибки, ОписаниеОшибки)
НоваяСтрока = Объект.СМС.Добавить();	
НоваяСтрока.ДатаОтправки=ТекущаяДата();
НоваяСтрока.Телефон=Телефон;
НоваяСтрока.Текст=ТекстСМС;
НоваяСтрока.ОтметкаОтменаБронирования = ОтметкаОтменаБронирования;
НоваяСтрока.КодОшибки=КодОшибки;
НоваяСтрока.WhatsApp=ЭтоWhatsApp;
НоваяСтрока.ОписаниеОшибки=ОписаниеОшибки;

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецФункции

&НаСервере
Функция ЗаписатьОтправкуСМС_Регистр(ТекстСМС, Телефон, ОтметкаОтменаБронирования)
	НашНабор=РегистрыСведений.СМС.СоздатьНаборЗаписей();
	НН=НашНабор.Добавить();
	НН.Бронь = Объект.Ссылка;
	НН.ДатаОтправки=ТекущаяДата();
	НН.Телефон=Телефон;
	НН.Текст=ТекстСМС;
	НН.ОтметкаОтменаБронирования = ОтметкаОтменаБронирования;
	НашНабор.Записать(Ложь);
	
	Элементы.ТабличноеПолеСМС.Обновить();
КонецФункции


//
&НаКлиенте
Процедура ОтправитьСМСВручную(Команда)
Если ЗначениеЗаполнено(Объект.Ссылка) тогда
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		
		КлиентТелефон = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Телефон");
		КлиентТелефон = СокрЛП(КлиентТелефон);
		
		Ответ = СлужебныеКлиентСервер.ПроверкаНомераТелефона(КлиентТелефон);
		Если Ответ.КодОшибки <> 0 Тогда 
			Если Ответ.КодОшибки = -1 Тогда 
				ТекстОшибки = "Некорректный номер телефона у клиента:" + КлиентТелефон;
			ИначеЕсли Ответ.КодОшибки = 1 Тогда 
				ТекстОшибки = "У клиента не заполнен номер телефона."; 
			КонецЕсли;
			
			ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС + "Отправка СМС не возможна.";
			ПоказатьПредупреждение(,ТекстОшибки); 
		    Возврат;
		КонецЕсли;
		
		ДопПараметры = Новый Структура("КлиентТелефон", КлиентТелефон); 
		Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаОтправитьСМСВручную", ЭтаФорма, ДопПараметры);
		ТекстВопроса = "Отправить СМС на номер " + КлиентТелефон + "?"; 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
		
	Иначе
		ПоказатьПредупреждение(, "Необходимо заполнить поле ""Проживает""");
		
	КонецЕсли;	
иначе
	ПоказатьПредупреждение(, "Необходимо записать бронь");
конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаОтправитьСМСВручную(Результат, ДопПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Да  Тогда
	ТекстСМС="";
//	ВвестиСтроку(ТекстСМС,"Введите текст СМС");

	ДопПараметры.Вставить("ТекстДляСМС", ТекстСМС);  
	Оповещение = Новый ОписаниеОповещения("ЗавершениеФормаТекстДляСМС", ЭтаФорма, ДопПараметры);
	ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаТекстДляСМС", ДопПараметры, ЭтаФорма
		,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормаТекстДляСМС(Результат, ДопПараметры) Экспорт
Если НЕ ЗначениеЗаполнено(Результат) Тогда Возврат; КонецЕсли;
	
ТекстСообщения = Результат; 

КлиентТелефон = ДопПараметры.КлиентТелефон;
МесенджерВключен = МесенджерСервер.МесенджерВключен();

Ответ = ОтправитьСМС(КлиентТелефон, ТекстСообщения, ТекстСообщения, МесенджерВключен);	

ЗаписатьОтправкуСМС(КлиентТелефон, ТекстСообщения, Ложь
	, МесенджерВключен, Ответ.КодВозврата, Ответ.ОписаниеОшибки);

ЭтотОбъектЗаписатьНаКлиенте();
КонецПроцедуры
//

// 
&НаКлиенте
Процедура СМСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СМСПередУдалением(Элемент, Отказ)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Отказ = Истина; Возврат; КонецЕсли;	
	
ТекущиеДанные = Элемент.ТекущиеДанные;
Если ТекущиеДанные = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли;	

ДопПараметры = Новый Структура("ТекущаяСтрока", Элемент.ТекущаяСтрока);
Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдалениеСМС", ЭтаФорма, ДопПараметры);
ПоказатьВопрос(Оповещение, "Подтвердите удаление ...", РежимДиалогаВопрос.ОКОтмена);
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдалениеСМС(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.ОК Тогда
	УдалитьСМСНаСервере();
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьСМСНаСервере()
СтрокаТаблицы = Объект.СМС.НайтиПоИдентификатору(Элементы.СМС.ТекущаяСтрока);
Объект.СМС.Удалить(СтрокаТаблицы);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры
//
//// - Отправка СМС
/////// - Отправка СМС, СоздатьЗаданиеГорничной при измениии статуса

//// + Обновление Счетов

//
&НаКлиенте
Процедура ОбновитьСчета(Команда)
//Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;
	
ОбновитьСчета_НаСервереТранзакция();
КонецПроцедуры

&НаСервере
Функция ОбновитьСчета_НаСервереТранзакция()
НачатьТранзакцию();
	
НетОбновлений = ОбновитьСчета_НаСервере(Истина);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();

Возврат НетОбновлений;
КонецФункции

&НаСервере
Функция ОбновитьСчета_НаСервере(НеВсе)
	
НетОбновлений = Истина;	
Для Каждого Счет Из Объект.Счета Цикл
	Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;	
	Если Счет.ЭтоПредварительныйГрупповойСчет Тогда Продолжить; КонецЕсли;	
	
	Если НеВсе Тогда 
		Если Счет.Закрыт Тогда Продолжить; КонецЕсли;	
	КонецЕсли;
	
	ОбновитьСчетЗаявка(Счет, Объект, Истина);	
	
	НетОбновлений = Ложь;	
КонецЦикла;	

Возврат НетОбновлений;
КонецФункции
//

//
&НаКлиенте
Процедура ОбновитьСчет(Команда)
ТС = Элементы.Счета.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ТД = Объект.Счета.НайтиПоИдентификатору(ТС);
//Если ОплатыЧекКлиент.ЕстьОплатыСчета(ТекущиеДанные.СчетГУИД, Объект.РаспределениеОплатДолги);

Если ЗначениеЗаполнено(ТД.ГрупповойСчет) Тогда 
	ПоказатьПредупреждение(, "Групповой счет.
							|
							|ОБНОВЛЕНИЕ НЕ РАЗРЕШЕНО ...");
	Возврат; 
КонецЕсли;

Если ТД.ЭтоПредварительныйГрупповойСчет Тогда 
	ПоказатьПредупреждение(, "Предварительный групповой счет.
							|
							|ОБНОВЛЕНИЕ НЕ РАЗРЕШЕНО ...");
	Возврат; 
КонецЕсли;

Если ТД.Закрыт Тогда 
	ПоказатьПредупреждение(, "Счет закрыт.
							|
							|ОБНОВЛЕНИЕ НЕ РАЗРЕШЕНО ...");
	Возврат; 
КонецЕсли;

Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;

Результат = ОбновитьСчетНаСервере(ТС); 
//Если Результат Тогда ПоказатьПредупреждение(, "Нечего добавить в счет"); КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ОбновитьСчетНаСервере(Идентификатор)
ТД = Объект.Счета.НайтиПоИдентификатору(Идентификатор);	
	
НачатьТранзакцию();

Результат = ОбновитьСчетЗаявка(ТД, Объект, Истина);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();

Возврат Результат; 
КонецФункции
//

//
&НаСервере
Функция ОбновитьСчетЗаявка(Счет, ТекущийОбъект, ОбновитьСчет)
Результат = ЗаявкаСервер.ОбновитьСчетЗаявка(Счет, ТекущийОбъект, ОбновитьСчет);	
Возврат Результат;
КонецФункции
//
//// - Обновление Счетов

&НаКлиенте
Процедура ДопПожеланияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
ТД = Элемент.ТекущиеДанные;

Если НЕ ЗначениеЗаполнено(ТД.ДатаРегистрации) Тогда
	ТД.ДатаРегистрации = ТекущаяДата();
КонецЕсли;
КонецПроцедуры

//// + Проживание

// + Заполнить Проживание
&НаКлиенте
Процедура ЗаполнитьПроживание(Команда)

Если НЕ ЗначениеЗаполнено(Объект.КатегорияНомера) Тогда 	
	ПоказатьПредупреждение(, "Не заполнена категория номера");
	Возврат;
КонецЕсли;	
	
Если Объект.Проживание.Количество()>0 Тогда 
	Если ОплатыОбщееКлиент.ЕстьСчета(Объект.Счета) Тогда
		ТекстПредупреждения = "Есть счета." 
				+ Символы.ПС + Символы.ПС + "Заполните проживание вручную,"
				+ Символы.ПС + "либо удалите счета.";
		ПоказатьПредупреждение( ,ТекстПредупреждения); 		
		
		Возврат;
	КонецЕсли;	
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаТаблицаБудетОчищенаПродолжить", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Данные проживания будут очищены
								|
								|ПРОДОЛЖИТЬ ?", РежимДиалогаВопрос.ДаНет);
Иначе
	ЗаполнитьТаблицуПроживанияНаКлиенте();		
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаТаблицаБудетОчищенаПродолжить(Результат, Параметры) Экспорт
Если Результат = КодВозвратаДиалога.Да Тогда 
	ЗаполнитьТаблицуПроживанияНаКлиенте();	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуПроживанияНаКлиенте()
Двухместный = ДвухМестныйПредупреждение();
Если Двухместный = Неопределено Тогда Возврат; КонецЕсли;
	
Объект.Проживание.Очистить();

ЗаполнитьПроживание = Истина;	
Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;	

ЗаполнитьПроживание = Ложь;	
ЗаполнитьТаблицуПроживанияНаСервере(Двухместный);	

ЭтотОбъектЗаписатьНаКлиенте();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТаблицуПроживанияНаСервере(Двухместный)
Если НЕ ЗначениеЗаполнено(Объект.РезервС) Тогда Возврат Неопределено; КонецЕсли; 
Если НЕ ЗначениеЗаполнено(Объект.РезервПо) Тогда Возврат Неопределено; КонецЕсли; 

ТЗ = ДокументыСервер.ЗаполнитьТаблицуПроживания_Таблица(Объект, Двухместный);

Если Объект.В2В Тогда
	ПроцентВ2В = ДокументыСервер.ПроцентВ2В(Объект.Бронирует, Объект.РезервС);
	
	Для Каждого Строка Из ТЗ Цикл
		//Строка.Цена = ДокументыСервер.ОкруглитьЦену(Строка.Цена * ((100 - ПроцентВ2В) / 100));
		
		Цена_П = Строка.Цена * ((100 - ПроцентВ2В) / 100);
		Цена = Цел(Цена_П);
		Если Цена_П > Цена Тогда
			Цена = Цена + 1;
		КонецЕсли;
		
		Строка.Цена = Цена;
		Строка.СуммаБезСкидки = Строка.Цена * Строка.Количество;
		
		ДокументыСервер.ЗаполнитьСуммаСоСкидкойСтрокаПроживание(Строка);
	КонецЦикла;
КонецЕсли;
	
Объект.Проживание.Очистить();
Для Каждого Строка Из ТЗ Цикл 
	НоваяСтрока = Объект.Проживание.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	НоваяСтрока.ГУИД = Новый УникальныйИдентификатор;
КонецЦикла;

ДеньПроживанияМинимум = ЗаявкаОбщееКлиентСервер.ДеньПроживанияМинимум(Объект.Проживание);
Объект.РезервС = ДеньПроживанияМинимум; 

Если НЕ ЗначениеЗаполнено(Объект.РезервС) Тогда Возврат Неопределено; КонецЕсли;  

Если Объект.РезервС <> Объект.РезервПо Тогда 
	ДеньПроживанияМаксимум = ЗаявкаОбщееКлиентСервер.ДеньПроживанияМаксимум(Объект.Проживание);
	ДеньПроживанияМаксимум = ДеньПроживанияМаксимум + 86400;
	Объект.РезервПо = ДеньПроживанияМаксимум; 
КонецЕсли;

Объект.КолВоДней = Объект.Проживание.Итог("Количество");
Возврат Неопределено;
КонецФункции
// - Заполнить Проживание

//
&НаКлиенте
Функция ДвухМестныйПредупреждение()
ДанныеОбъект = Объект; 	
Двухместный = ДокументыСервер.ДвухМестный(ДанныеОбъект);
Если Двухместный = Неопределено Тогда 
	ПоказатьПредупреждение(, "ВНИМАНИЕ: Количество человек в номере = 0." 
		+ Символы.ПС + Символы.ПС +  "Цены и суммы за проживания автоматически установлены НЕ будут !");
КонецЕсли;
 
Возврат Двухместный;  
КонецФункции	
//

// + Проживание Редактирование
&НаКлиенте
Процедура ДобавитьПроживание(Команда)
Если Объект.БонШанс Тогда
	Если Объект.Проживание.Количество() > 0 Тогда Возврат; КонецЕсли;
КонецЕсли;

Элементы.Проживание.ДобавитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ПроживаниеПередНачаломИзменения(Элемент, Отказ)
ТекущиеДанные = Элемент.ТекущиеДанные;

Если ЕстьВГрупповомСчетеПредупреждение(ТекущиеДанные.ГУИД, "ИЗМЕНЕНИЕ")Тогда Отказ = Истина; Возврат; КонецЕсли;
Если ЕстьВЗакрытомСчетеПредупреждение(ТекущиеДанные.ГУИД, "ИЗМЕНЕНИЕ") Тогда Отказ = Истина; Возврат; КонецЕсли;
//Если ЕстьВОплаченномСчетеПредупреждение(ТекущиеДанные.ГУИД, "ИЗМЕНЕНИЕ") Тогда Отказ = Истина; Возврат; КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроживаниеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
ТекущиеДанные = Элемент.ТекущиеДанные;	
СуммаОплаченоПроживание_OldValue = ТекущиеДанные.СуммаОплачено;	
КоличествоПроживание_OldValue = ТекущиеДанные.Количество;	
ДеньПроживания_OldValue = ТекущиеДанные.ДеньПроживания;

Если НоваяСтрока Тогда
	МаксДата = ЗаявкаОбщееКлиентСервер.ДеньПроживанияМаксимум(Объект.Проживание);
	Если ЗначениеЗаполнено(МаксДата) Тогда
		ТекущиеДанные.ДеньПроживания = МаксДата + 86400;
	ИначеЕсли ЗначениеЗаполнено(Объект.РезервС) Тогда
		ТекущиеДанные.ДеньПроживания = Объект.РезервС;
	Иначе	
		ТекущиеДанные.ДеньПроживания = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ Копирование Тогда
		Двухместный = ДвухМестныйПредупреждение();	
		Если Двухместный = Неопределено Тогда Возврат; КонецЕсли;
		
		ПроживаниеПриНачалеРедактированияНоваяСтрокаНаСервере(Элемент.ТекущаяСтрока, Двухместный);		
	КонецЕсли;		
КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроживаниеПриНачалеРедактированияНоваяСтрокаНаСервере(Идентификатор, Двухместный)
ТекущиеДанные = Объект.Проживание.НайтиПоИдентификатору(Идентификатор);	

ТекущиеДанные.Количество = 1;

ТекущиеДанные.Цена =  ДокументыСервер.ЦенаНаДень(ТекущиеДанные.ДеньПроживания, Объект.КатегорияНомера
	, Объект.БезЗавтрака, Двухместный);
ТекущиеДанные.СуммаБезСкидки = ТекущиеДанные.Цена * ТекущиеДанные.Количество;

//ТекущиеДанные.ПроцентСкидкиКлиента =  ДокументыСервер.ИтогоСкидка(Объект);
ТекущиеДанные.ПроцентСкидкиКлиента =  ДокументыСервер.ИтогоСкидкаКлиент(Объект, Ложь);
ДокументыСервер.ЗаполнитьСуммаСоСкидкойСтрокаПроживание(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПроживаниеДеньПроживанияПриИзменении(Элемент)
ТекущиеДанные = Элементы.Проживание.ТекущиеДанные;

Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДеньПроживания) Тогда
	ТекущиеДанные.Цена = 0;	
	ТекущиеДанные.Сумма = 0;	
	ТекущиеДанные.ПроцентСкидкиКлиента = 0;	
	ТекущиеДанные.СуммаБезСкидки = 0;	
	ТекущиеДанные.Количество = 0;	
		
	Возврат;	
КонецЕсли;

Двухместный = ДвухМестныйПредупреждение();
Если Двухместный = Неопределено Тогда Возврат; КонецЕсли; 

ПроживаниеДеньПроживанияПриИзмененииНаСервере(Элементы.Проживание.ТекущаяСтрока, Двухместный);
КонецПроцедуры

&НаСервере
Процедура ПроживаниеДеньПроживанияПриИзмененииНаСервере(Идентификатор, Двухместный)
ТекущиеДанные = Объект.Проживание.НайтиПоИдентификатору(Идентификатор);	
ТекущиеДанные.Цена =  ДокументыСервер.ЦенаНаДень(ТекущиеДанные.ДеньПроживания, Объект.КатегорияНомера
	, Объект.БезЗавтрака, Двухместный);
КонецПроцедуры

&НаКлиенте
Процедура ПроживаниеПроцентСкидкиКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
ДанныеВыбора = Новый СписокЗначений;
//ПроцентСкидки = ДокументыСервер.ИтогоСкидка(Объект.Ссылка);
ПроцентСкидки = ДокументыСервер.ИтогоСкидкаКлиент(Объект, Ложь);
ДанныеВыбора.Добавить(ПроцентСкидки);
СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПроживаниеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
Если ОтменаРедактирования Тогда	
	Если Элемент.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;		
КонецЕсли;	

ПроживаниеПриОкончанииРедактированияНаСервере(Элемент.ТекущаяСтрока, НоваяСтрока);

ТекущиеДанные = Элемент.ТекущиеДанные;
Если ТекущиеДанные.Сумма = 0 Тогда 
	ПоказатьПредупреждение(, "ВНИМАНИЕ. Сумма = 0");
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроживаниеПриОкончанииРедактированияНаСервере(Идентификатор, ЭтоНоваяСтрока)
ТекущиеДанные = Объект.Проживание.НайтиПоИдентификатору(Идентификатор);	

Если ЭтоНоваяСтрока Тогда
	ТекущиеДанные.ГУИД = Новый УникальныйИдентификатор;
КонецЕсли;

ТекущиеДанные.СуммаБезСкидки = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
ДокументыСервер.ЗаполнитьСуммаСоСкидкойСтрокаПроживание(ТекущиеДанные);

Если НЕ ЭтоНоваяСтрока Тогда
	ОбновитьСтрокаСчетаДетальноДолги(ТекущиеДанные, Ложь, Объект);
	
	ОтборСтроки = Новый Структура("ДолгиГУИД", ТекущиеДанные.ГУИД); 
	ТекущиеДанные.СуммаОплачено = ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, Объект.РаспределениеОплатДолги);
		
	СуммаОплаченоИтогоПроживание = СуммаОплаченоИтогоПроживание - СуммаОплаченоПроживание_OldValue + ТекущиеДанные.СуммаОплачено;	
КонецЕсли;

Если НЕ ЭтоНоваяСтрока Тогда
	ДобавитьСчетаКОбновлению(ТекущиеДанные.ГУИД);
КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПроживаниеПередУдалением(Элемент, Отказ)
Если Элемент.ТекущаяСтрока = Неопределено Тогда Возврат; КонецЕсли;

ТекущиеДанные = Элемент.ТекущиеДанные;	

Если ЕстьВГрупповомСчетеПредупреждение(ТекущиеДанные.ГУИД, "УДАЛЕНИЕ")Тогда Отказ = Истина; Возврат; КонецЕсли;
Если ЕстьВЗакрытомСчетеПредупреждение(ТекущиеДанные.ГУИД, "УДАЛЕНИЕ") Тогда Отказ = Истина; Возврат; КонецЕсли;

ПроживаниеПередУдалениемНаСервере(Элемент.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Функция ПроживаниеПередУдалениемНаСервере(Идентификатор)
ТекущиеДанные = Объект.Проживание.НайтиПоИдентификатору(Идентификатор);	
СуммаОплаченоИтогоПроживание = СуммаОплаченоИтогоПроживание - ТекущиеДанные.СуммаОплачено;

ДолгиГУИД = ТекущиеДанные.ГУИД;
ДобавитьСчетаКОбновлению(ДолгиГУИД);

ОтборСтроки = Новый Структура("ДолгиГУИД", ДолгиГУИД);
ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, Объект.СчетаДетальноДолги);
КонецФункции	

&НаКлиенте
Процедура ПроживаниеКоличествоПриИзменении(Элемент)
//ТД = Элементы.Проживание.ТекущиеДанные;
КонецПроцедуры

// - Проживание Редактирование

&НаСервере
Процедура ДобавитьСчетаКОбновлению(ГУИД)
ОтборСтроки = Новый Структура("ДолгиГУИД", ГУИД);
НайденныеСтроки = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда
	СчетГУИД = НайденныеСтроки[0].СчетГУИД;
	НоваяСтрока = СчетаКОбновлению.Добавить();
	НоваяСтрока.СчетГУИД = СчетГУИД;
КонецЕсли
КонецПроцедуры

//// - Проживание

//// + ДопУслуги
&НаКлиенте
Процедура ДопУслугиПередНачаломИзменения(Элемент, Отказ)
ТекущиеДанные = Элемент.ТекущиеДанные;

Если ЕстьВГрупповомСчетеПредупреждение(ТекущиеДанные.ГУИД, "ИЗМЕНЕНИЕ")Тогда Отказ = Истина; Возврат; КонецЕсли;
Если ЕстьВЗакрытомСчетеПредупреждение(ТекущиеДанные.ГУИД, "ИЗМЕНЕНИЕ") Тогда Отказ = Истина; Возврат; КонецЕсли;

ДопУслугиВСчет_OldValue = ТекущиеДанные.ВСчет; 	
ДопУслугиУслуга_OldValue = ТекущиеДанные.Услуга; 

ДопУслугиКоличество_OldValue = ТекущиеДанные.Количество; 
ДопУслугиЦена_OldValue = ТекущиеДанные.Цена; 
КонецПроцедуры

&НаКлиенте
Процедура ДопУслугиУслугаПриИзменении(Элемент)
ДопУслугиУслугаПриИзмененииНаСервере(Элементы.ДопУслуги.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ДопУслугиУслугаПриИзмененииНаСервере(Идентификатор)
ТекущиеДанные = Объект.ДопУслуги.НайтиПоИдентификатору(Идентификатор);	

ТекущиеДанные.Цена=ТекущиеДанные.Услуга.Цена;

Если ДопУслугиУслуга_OldValue = Справочники.ДопУслуги.ДолгиЗаУслугиПрошлыйПериод Тогда
	ТекущиеДанные.Услуга = ДопУслугиУслуга_OldValue; 	
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДопУслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
Если ОтменаРедактирования Тогда	
	Если Элемент.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;		
КонецЕсли;	

ДопУслугиПриОкончанииРедактированияНаСервере(Элемент.ТекущаяСтрока, НоваяСтрока);

ТекущиеДанные = Элемент.ТекущиеДанные;
//Если НЕ ТекущиеДанные.ВСчет Тогда Возврат; КонецЕсли;	

Если ТекущиеДанные.ВСчет Тогда 	
	Если (ТекущиеДанные.Цена *  ТекущиеДанные.Количество) = 0 Тогда 
		ПоказатьПредупреждение(, "ВНИМАНИЕ. Сумма = 0");
	КонецЕсли;
КонецЕсли;

Если ОбновитьПрошлыйПериодДопУслуги(Элемент.ТекущаяСтрока, НоваяСтрока) Тогда
	ПоказатьПредупреждение(, "ВНИМАНИЕ ! Сумма > Суммы долга");
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДопУслугиПриОкончанииРедактированияНаСервере(Идентификатор, ЭтоНоваяСтрока)
ТекущиеДанные = Объект.ДопУслуги.НайтиПоИдентификатору(Идентификатор);	

Если ЭтоНоваяСтрока Тогда
	ТекущиеДанные.ГУИД = Новый УникальныйИдентификатор;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДатаУслуги) Тогда
	Если Объект.РезервПо <= НачалоДня(ТекущаяДата()) Тогда
		Если Объект.РезервС = Объект.РезервПо Тогда
			ТекущиеДанные.ДатаУслуги = Объект.РезервС;
		Иначе
			ТекущиеДанные.ДатаУслуги = Объект.РезервПо - 24*60*60;
		КонецЕсли;
	ИначеЕсли Объект.РезервС > НачалоДня(ТекущаяДата()) Тогда
		ТекущиеДанные.ДатаУслуги = Объект.РезервС;
	Иначе
		ТекущиеДанные.ДатаУслуги = ТекущаяДата();
	КонецЕсли;
КонецЕсли;

Сумма_OldValue = ТекущиеДанные.Сумма;
ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;

ОтборСтроки = Новый Структура("ДолгиГУИД", ТекущиеДанные.ГУИД); 
НайденныеСтрокиСчетаДетальноДолги = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

Если ТекущиеДанные.ВСчет = ДопУслугиВСчет_OldValue Тогда
	Если ТекущиеДанные.ВСчет Тогда 
		Если НЕ ЭтоНоваяСтрока Тогда
			ОбновитьСтрокаСчетаДетальноДолги(ТекущиеДанные, Истина, Объект);
			
			ОтборСтроки = Новый Структура("ДолгиГУИД", ТекущиеДанные.ГУИД); 
			ТекущиеДанные.СуммаОплачено = ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, Объект.РаспределениеОплатДолги);
		КонецЕсли;
		
		СуммаИтогоДопУслуги = СуммаИтогоДопУслуги - Сумма_OldValue + ТекущиеДанные.Сумма;
	КонецЕсли;
	
	Если НЕ ЭтоНоваяСтрока Тогда
		ДобавитьСчетаКОбновлению(ТекущиеДанные.ГУИД);
	КонецЕсли;
		
Иначе
	Если ТекущиеДанные.ВСчет Тогда	
		СуммаИтогоДопУслуги = СуммаИтогоДопУслуги + ТекущиеДанные.Сумма;
	Иначе	
		ОтборСтроки = Новый Структура("ДолгиГУИД", ТекущиеДанные.ГУИД);
		ТекущиеДанные.СуммаОплачено = ЗаявкаСервер.СуммаОплатыРаспределениеОплатДолгиОтборСтроки(ОтборСтроки, Объект.РаспределениеОплатДолги);
		
		Если НЕ ЭтоНоваяСтрока Тогда
			ДобавитьСчетаКОбновлению(ТекущиеДанные.ГУИД);
		КонецЕсли;
		
		ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, Объект.СчетаДетальноДолги);
	КонецЕсли;	
КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбновитьПрошлыйПериодДопУслуги(Идентификатор, ЭтоНоваяСтрока)
ТекущиеДанные = Объект.ДопУслуги.НайтиПоИдентификатору(Идентификатор);	

Если ТекущиеДанные.Услуга = Справочники.ДопУслуги.ДолгиЗаУслугиПрошлыйПериод Тогда
	ОтборСтроки = Новый Структура("ПрочиеОплатыДокументОплаты, ПрочиеОплатыДокументДолг"
		, ТекущиеДанные.ПрочиеОплатыДокументОплаты, ТекущиеДанные.ПрочиеОплатыДокументДолг);
	НайденныеСтроки = ПрошлыйПериодДопУслуги.НайтиСтроки(ОтборСтроки);	
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаПрошлыйПериодДопУслуги = ПрошлыйПериодДопУслуги.Добавить();
		СтрокаПрошлыйПериодДопУслуги.ПрочиеОплатыДокументОплаты = ТекущиеДанные.ПрочиеОплатыДокументОплаты;
		СтрокаПрошлыйПериодДопУслуги.ПрочиеОплатыДокументДолг = ТекущиеДанные.ПрочиеОплатыДокументДолг;
	Иначе
		СтрокаПрошлыйПериодДопУслуги = НайденныеСтроки[0]; 
	КонецЕсли;
	
	СтрокаПрошлыйПериодДопУслуги.Сумма = СтрокаПрошлыйПериодДопУслуги.Сумма 
		+ ТекущиеДанные.Количество * ТекущиеДанные.Цена 
		- ДопУслугиКоличество_OldValue * ДопУслугиЦена_OldValue; 
КонецЕсли;

Запрос = Новый Запрос;
Запрос.Текст = ЗаявкаСервер.ПрошлыйПериодДопУслуги_ТекстЗапроса();
Запрос.Текст = Запрос.Текст + "
                    |	И ПрочиеОплаты.Ссылка = &ДокументОплаты
                    |	И Долги.ДокументДолг = &ДокументДолг";

Запрос.УстановитьПараметр("ДокументОплаты", ТекущиеДанные.ПрочиеОплатыДокументОплаты);
Запрос.УстановитьПараметр("ДокументДолг", ТекущиеДанные.ПрочиеОплатыДокументДолг);

ТЗ_Параметр = ПрошлыйПериодДопУслуги.Выгрузить();
ТЗ_Параметр.Свернуть("ПрочиеОплатыДокументОплаты, ПрочиеОплатыДокументДолг", "Сумма");
Запрос.УстановитьПараметр("ТЗ", ТЗ_Параметр);

ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	Возврат Ложь;
КонецЕсли;

Возврат (ТЗ[0].СуммаКЗакрытию < 0);
КонецФункции

&НаКлиенте
Процедура ДопУслугиПередУдалением(Элемент, Отказ)
ТекущиеДанные = Элемент.ТекущиеДанные;	

Если ЕстьВГрупповомСчетеПредупреждение(ТекущиеДанные.ГУИД, "УДАЛЕНИЕ")Тогда Отказ = Истина; Возврат; КонецЕсли;
Если ЕстьВЗакрытомСчетеПредупреждение(ТекущиеДанные.ГУИД, "УДАЛЕНИЕ") Тогда Отказ = Истина; Возврат; КонецЕсли;

ДопУслугиПередУдалениемНаСервере(Элемент.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ДопУслугиПередУдалениемНаСервере(Идентификатор)
ТекущиеДанные = Объект.ДопУслуги.НайтиПоИдентификатору(Идентификатор);	
СуммаОплаченоИтогоДопУслуги = СуммаОплаченоИтогоДопУслуги - ТекущиеДанные.СуммаОплачено;

ДолгиГУИД = ТекущиеДанные.ГУИД;
ДобавитьСчетаКОбновлению(ДолгиГУИД);

ОтборСтроки = Новый Структура("ДолгиГУИД", ДолгиГУИД);
ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, Объект.СчетаДетальноДолги);

//Если НЕ ТекущиеДанные.ВСчет Тогда Возврат; КонецЕсли;

Если ЗначениеЗаполнено(ТекущиеДанные.ПрочиеОплатыДокументОплаты) Тогда
	//
	ОтборСтроки = Новый Структура("ПрочиеОплатыДокументОплаты, ПрочиеОплатыДокументДолг"
		, ТекущиеДанные.ПрочиеОплатыДокументОплаты, ТекущиеДанные.ПрочиеОплатыДокументДолг);
	НайденныеСтроки = ПрошлыйПериодДопУслуги.НайтиСтроки(ОтборСтроки);	
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаПрошлыйПериодДопУслуги = ПрошлыйПериодДопУслуги.Добавить();
		СтрокаПрошлыйПериодДопУслуги.ПрочиеОплатыДокументОплаты = ТекущиеДанные.ПрочиеОплатыДокументОплаты;
		СтрокаПрошлыйПериодДопУслуги.ПрочиеОплатыДокументДолг = ТекущиеДанные.ПрочиеОплатыДокументДолг;
	Иначе
		СтрокаПрошлыйПериодДопУслуги = НайденныеСтроки[0]; 
	КонецЕсли;
	
	СтрокаПрошлыйПериодДопУслуги.Сумма = - (ТекущиеДанные.Количество * ТекущиеДанные.Цена);
	//	
КонецЕсли;	
КонецПроцедуры	
//// - ДопУслуги

//
&НаСервере
Функция ОбновитьСтрокаСчетаДетальноДолги(ТекущиеДанные, Услуга, ТекущийОбъект) Экспорт
ДолгиГУИД = ТекущиеДанные.ГУИД;	
ОтборСтроки = Новый Структура("ДолгиГУИД", ДолгиГУИД);
НайденныеСтрокиДолги = ТекущийОбъект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
Если НайденныеСтрокиДолги.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли; 

ЗаявкаСервер.ОчиститьСчетаДетальноОплатыОтборСтроки(ОтборСтроки, ТекущийОбъект.РаспределениеОплатДолги, ТекущийОбъект.СчетаДетальноОплаты);

НайденнаяСтрокаДолги = НайденныеСтрокиДолги[0];

СчетГУИД = НайденнаяСтрокаДолги.СчетГУИД;
ЗаявкаСервер.ЗаполнитьСтрокаДолги(НайденнаяСтрокаДолги, ТекущиеДанные, СчетГУИД, Услуга);   

ОтборСтрокиСчет = Новый Структура("СчетГУИД", НайденнаяСтрокаДолги.СчетГУИД);
НайденныеСчета = ТекущийОбъект.Счета.НайтиСтроки(ОтборСтрокиСчет);
НайденныйСчет = НайденныеСчета[0];

Контрагент = НайденныйСчет.Контрагент;

Если НЕ НайденнаяСтрокаДолги.Услуга Тогда 
	
	Если Контрагент = ТекущийОбъект.Клиент ИЛИ Контрагент = ТекущийОбъект.Клиент2 Тогда
		РазделитьСчет = НайденныйСчет.РазделитьСчет;
		ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Контрагент);
		ЕстьКлиент2 = ЗначениеЗаполнено(ТекущийОбъект.Клиент2);
		НеПервый = (Контрагент = ТекущийОбъект.Клиент2);
	
		ЗаявкаСервер.УстановитьЦенаСуммаСчетаДетальноДолгиДляРазделитьСчет(НайденнаяСтрокаДолги
			, РазделитьСчет, ЮрЛицо, ЕстьКлиент2, НеПервый);	                                                                                     	
	КонецЕсли;	
			
КонецЕсли;	
	
МассивОплатКонтрагента = ЗаявкаСервер.МассивОплатКонтрагента(Контрагент, ТекущийОбъект.СчетаДетальноОплаты); 
ЗаявкаСервер.РаспределитьСчетаДетальноОплатыДолгСтрока(НайденнаяСтрокаДолги
	, ТекущийОбъект.РаспределениеОплатДолги, МассивОплатКонтрагента, ТекущийОбъект);
//МассивОплатСчета = ОбщийМодульОплатыСервер.МассивОплатСчета(СчетГУИД, Объект); 
//ОбщийМодульОплатыСервер.РаспределитьОплатыДолгСтрока(НайденнаяСтрокаДолги, Объект.РаспределениеОплатДолги, МассивОплатСчета);
КонецФункции
//

////
&НаКлиенте
Функция ЕстьВЗакрытомСчетеПредупреждение(ДолгиГУИД, Текст)
ОтборСтроки = Новый Структура("ДолгиГУИД", ДолгиГУИД);
НайденныеСтрокиДолги = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

Для Каждого НайденнаяСтрокаДолги Из НайденныеСтрокиДолги Цикл
	СчетГУИД = НайденнаяСтрокаДолги.СчетГУИД;
	
	ОтборСтрокиСчет = Новый Структура("СчетГУИД", НайденнаяСтрокаДолги.СчетГУИД);
	НайденныеСчета = Объект.Счета.НайтиСтроки(ОтборСтрокиСчет);
	НайденныйСчет = НайденныеСчета[0];
	
	Если НайденныйСчет.Закрыт Тогда 
		ПоказатьПредупреждение(, "Строка находится в закрытом счете" + Символы.ПС + Символы.ПС + Текст + " НЕ РАЗРЕШЕНО ...");		
		
		Возврат Истина;
	КонецЕсли;	
КонецЦикла;		

Возврат Ложь;
КонецФункции	

&НаКлиенте
Функция ЕстьВГрупповомСчетеПредупреждение(ДолгиГУИД, Текст)
ОтборСтроки = Новый Структура("ДолгиГУИД", ДолгиГУИД);
НайденныеСтрокиДолги = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

Для Каждого НайденнаяСтрокаДолги Из НайденныеСтрокиДолги Цикл
	СчетГУИД = НайденнаяСтрокаДолги.СчетГУИД;
	
	ОтборСтрокиСчет = Новый Структура("СчетГУИД", НайденнаяСтрокаДолги.СчетГУИД);
	НайденныеСчета = Объект.Счета.НайтиСтроки(ОтборСтрокиСчет);
	НайденныйСчет = НайденныеСчета[0];
	
	Если ЗначениеЗаполнено(НайденныйСчет.ГрупповойСчет) Тогда
		ПоказатьПредупреждение(, "Строка находится в групповом счете" + Символы.ПС + Символы.ПС + Текст + " НЕ РАЗРЕШЕНО ...");		
		
		Возврат Истина;
	КонецЕсли;	
КонецЦикла;		

Возврат Ложь;
КонецФункции	

&НаКлиенте
Функция ЕстьВОплаченномСчетеПредупреждение(ДолгиГУИД, Текст)
ОтборСтроки = Новый Структура("ДолгиГУИД", ДолгиГУИД);
НайденныеСтрокиДолги = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

Для Каждого НайденнаяСтрокаДолги Из НайденныеСтрокиДолги Цикл
	СчетГУИД = НайденнаяСтрокаДолги.СчетГУИД;
	Если ЕстьОплатыСчета(СчетГУИД) Тогда 
		ПоказатьПредупреждение(, "Строка находится в оплаченном счете" 
			+ Символы.ПС + Символы.ПС + Текст + " НЕ РАЗРЕШЕНО ...");
			
		Возврат Истина; 
	КонецЕсли;
КонецЦикла;		

Возврат Ложь;
КонецФункции	

&НаКлиенте
Функция ЕстьОплатыСчета(СчетГУИД)     
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = Объект.РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);

Возврат (НайденныеСтроки.Количество() > 0); 
КонецФункции
////


///////////// + Реквизиты Формы ///////////////////////////

/////// + Основная

//
&НаКлиенте
Процедура ЦветЗаявки(Команда)
 ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
 Оповещение = Новый ОписаниеОповещения("ОповещениеВыборЦветаЗавершение", ЭтотОбъект);
 ДиалогВыбораЦвета.Показать(Оповещение);
КонецПроцедуры

 &НаКлиенте
Процедура ОповещениеВыборЦветаЗавершение(Результат, ДополнительныеПараметры) Экспорт
Если НЕ Результат = Неопределено Тогда
	АбсолютныйЦвет =  ОбщийФункционалСервер.ПолучитьАбсолютныйЦвет(Результат);
	Объект.ЦветB=АбсолютныйЦвет.Синий;
	Объект.ЦветG=АбсолютныйЦвет.Зеленый;
	Объект.ЦветR=АбсолютныйЦвет.Красный;
	
	Элементы.ЦветЗаявки.ЦветФона = АбсолютныйЦвет; 
// + ПСН
	ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(АбсолютныйЦвет);
	Элементы.ЦветЗаявки.ЦветТекста = ЦветТекста;
// + ПСН
КонецЕсли;
КонецПроцедуры
//

////// + Контрагенты

&НаКлиенте
Процедура ИсторияКлиентаДопПожелания(Команда)
Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда Возврат; КонецЕсли;	
	
ЗначениеОтбора = Новый Структура("Клиент", Объект.Клиент);
ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);

ОткрытьФорму("РегистрСведений.ИсторияКлиентаДопПожелания.Форма.ФормаНабораЗаписей", ПараметрыФормы, ЭтаФорма
	,,,, , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ИсторияКлиента2ДопПожелания(Команда)
Если НЕ ЗначениеЗаполнено(Объект.Клиент2) Тогда Возврат; КонецЕсли;	
	
ЗначениеОтбора = Новый Структура("Клиент", Объект.Клиент2);
ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);

ОткрытьФорму("РегистрСведений.ИсторияКлиентаДопПожелания.Форма.ФормаНабораЗаписей", ПараметрыФормы, ЭтаФорма
	,,,, , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры


//
&НаКлиенте
Функция ПереместитьКонтрагентаИзАрхива(Контрагент, Элемент)
Если НЕ ЭтоАрхивКонтрагентов(Контрагент) Тогда Возврат Ложь; КонецЕсли;	
	
ПараметрыФормы = Новый Структура();		
ПараметрыФормы.Вставить("Ключ", Контрагент); 

ДопПараметры = Новый Структура();
ДопПараметры.Вставить("Элемент", Элемент); 

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ФормаПеремещениеКлиента", ЭтаФорма, ДопПараметры);
ОткрытьФорму("Справочник.Клиенты.Форма.ФормаПеремещениеКлиента", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
Возврат Истина;	
КонецФункции

&НаКлиенте
Процедура ЗавершениеФормы_ФормаПеремещениеКлиента(Результат, ДополнительныеПараметры) Экспорт
Элемент = ДополнительныеПараметры.Элемент;

ЭлементИмя = Элемент.Имя;
Если ЭлементИмя = "Бронирует" Тогда
	БронируетПриИзмененииОбработка(Элемент);		
ИначеЕсли ЭлементИмя = "Клиент" Тогда
	КлиентПриИзмененииОбработка(Элемент)
ИначеЕсли ЭлементИмя = "Клиент2" Тогда
	Клиент2ПриИзмененииОбработка(Элемент)
ИначеЕсли ЭлементИмя = "Оплачивает" Тогда
	ОплачиваетПриИзмененииОбработка(Элемент)
КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЭтоАрхивКонтрагентов(Контрагент)
Родитель = Контрагент.Родитель;
Если Родитель = Справочники.Клиенты.ПустаяСсылка() Тогда Возврат Ложь; КонецЕсли;

Пока Истина Цикл
	Если Родитель = Справочники.Клиенты.ПустаяСсылка() Тогда Возврат Ложь; КонецЕсли;
	РодительНаименование = ВРег(Родитель.Наименование);
	Индекс = СтрНайти(РодительНаименование, "АРХИВ");
	Если Индекс > 0 Тогда Возврат Истина; КонецЕсли; 
	
	Родитель = Родитель.Родитель;
КонецЦикла
	
КонецФункции
//

&НаКлиенте
Функция ПроверкаКонтрагента(Контрагент)
ТекстОшибки = ДокументыСервер.ПроверитьКонтрагента(Контрагент);
Если ТекстОшибки = "" Тогда Возврат Ложь; КонецЕсли;

ПоказатьПредупреждение(, "ВНИМАНИЕ !!!" + Символы.ПС + Символы.ПС + ТекстОшибки + "
	|
	|ИСПРАВТЕ ОШИБКИ ...");

Возврат Истина;
КонецФункции

//
&НаКлиенте
Процедура БронируетПриИзменении(Элемент)
ПроверкаКонтрагента(Объект.Бронирует);
	
Если ПереместитьКонтрагентаИзАрхива(Объект.Бронирует, Элемент) Тогда Возврат; КонецЕсли; 

БронируетПриИзмененииОбработка(Элемент);
КонецПроцедуры

&НаКлиенте
Асинх Процедура БронируетПриИзмененииОбработка(Элемент)
Бронирует_OldValue = Бронирует_OldValue();	
Если Объект.Бронирует = Бронирует_OldValue Тогда Возврат; КонецЕсли;

ИмяРеквизитаКонтрагент = "'Бронирует'";

Если ЗначениеЗаполнено(Объект.Бронирует) Тогда
	БронируетЧС = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Бронирует, "ЧС");
	Если БронируетЧС тогда
		ПоказатьПредупреждение(, "Внимание! " + ИмяРеквизитаКонтрагент + " в черном списке!");
	КонецЕсли;	
КонецЕсли;

Если ПроверкаИзмененияКонтрагентаГрупповойСчет(Объект.Бронирует, Бронирует_OldValue, ИмяРеквизитаКонтрагент) Тогда
	Объект.Бронирует = Бронирует_OldValue;
	Возврат; 
КонецЕсли;	

Ответ = Ждать ПроверкаИзмененияСкидки(Объект.Бронирует, Бронирует_OldValue, ИмяРеквизитаКонтрагент);
Если Ответ.Запрещено Тогда 
	Объект.Бронирует = Бронирует_OldValue;
	Возврат; 
КонецЕсли;
                                                                               
ЗаменитьСкидку = Ответ.ЗаменитьСкидку;

МассивКасса = Новый Массив;

Ответ = Ждать ПодтвердитеЗаменуКонтрагента(Объект.Бронирует, Бронирует_OldValue, ИмяРеквизитаКонтрагент, МассивКасса, ЗаменитьСкидку);
Если Ответ Тогда 
	Объект.Бронирует = Бронирует_OldValue;
	Возврат; 
КонецЕсли;

УстановитьПроцентыВ2В();

Если ЗаменитьСкидку Тогда
	ЗаменаПроцентСкидки();
КонецЕсли;

БронируетТурагентство = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Бронирует, "Турагентство");
Элементы.ГруппаЧекАгенту.Доступность = БронируетТурагентство; 

КонецПроцедуры

&НаСервере
Функция Бронирует_OldValue()
Возврат Объект.Ссылка.Бронирует;	
КонецФункции	

//

//// + Клиент
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
ПроверкаКонтрагента(Объект.Клиент);

Если ПереместитьКонтрагентаИзАрхива(Объект.Клиент, Элемент) Тогда Возврат; КонецЕсли; 

КлиентПриИзмененииОбработка(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзмененииОбработка(Элемент)
ПоказатьИсторияКлиентаДопПожелания(Элемент); 
КонецПроцедуры

//
&НаКлиенте
Процедура ПоказатьИсторияКлиентаДопПожелания(Элемент)
ДопПараметры = Новый Структура("Элемент", Элемент);	

Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда 
	ЗакрытиеФормы_ИсторияКлиентаДопПожелания(Неопределено, ДопПараметры); Возврат; КонецЕсли;
	
Клиент_OldValue = Клиент_OldValue();
Если Клиент_OldValue = Объект.Клиент Тогда 
	ЗакрытиеФормы_ИсторияКлиентаДопПожелания(Неопределено, ДопПараметры); Возврат; КонецЕсли;	
	
//Если НЕ ЕстьИсторияКлиентаДопПожелания() Тогда 
//		ЗакрытиеФормы_ИсторияКлиентаДопПожелания(Неопределено, ДопПараметры); Возврат; КонецЕсли;

ЗначениеОтбора = Новый Структура("Клиент", Объект.Клиент);
ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_ИсторияКлиентаДопПожелания", ЭтаФорма, ДопПараметры);
ОткрытьФорму("РегистрСведений.ИсторияКлиентаДопПожелания.Форма.ФормаНабораЗаписей", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаСервере
Функция ЕстьИсторияКлиентаДопПожелания() 
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ИсторияКлиентаДопПожелания.Клиент КАК Клиент
                      |ИЗ
                      |	РегистрСведений.ИсторияКлиентаДопПожелания КАК ИсторияКлиентаДопПожелания
                      |ГДЕ
                      |	ИсторияКлиентаДопПожелания.Клиент = &Клиент");

Запрос.УстановитьПараметр("Клиент", Объект.Клиент);

Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

&НаКлиенте
Процедура ЗакрытиеФормы_ИсторияКлиентаДопПожелания(Результат, ДополнительныеПараметры) Экспорт
КлиентПриИзмененииОбработкаПродолжение(ДополнительныеПараметры.Элемент);	
КонецПроцедуры
//

&НаКлиенте
Асинх Процедура КлиентПриИзмененииОбработкаПродолжение(Элемент)
	
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	ОбновитьКоличествоЧеловек();
	
	Возврат; 
КонецЕсли;		

Если ПроверкаЗаполнения() Тогда Возврат; КонецЕсли;	

Клиент_OldValue = Клиент_OldValue();

Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда 
	ТекстПредупреждения = "Новый клиент - пусто." 
		+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО.";
		
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
	Объект.Клиент = Клиент_OldValue;
	Возврат;
КонецЕсли;

Если Объект.Клиент = Клиент_OldValue Тогда Возврат; КонецЕсли;

Если КлиентРавенКлиент2Предупреждение() Тогда 
	Объект.Клиент = Клиент_OldValue;
	Возврат; 
КонецЕсли;

ЗаменитьСкидку = Ложь;
МассивКасса = Новый Массив;

ИмяРеквизитаКонтрагент = "'Проживает'";

Если ЗначениеЗаполнено(Клиент_OldValue) Тогда
	//ГрупповойСчет = ОплатыОбщееКлиент.ЕстьГрупповыеСчетаКонтрагент(Объект.Счета, Клиент_OldValue);
	//Если ЗначениеЗаполнено(ГрупповойСчет) Тогда 
	//	//Если НЕ ЗначениеЗаполнено(Объект.Оплачивает) 
	//	//ИЛИ	Объект.Оплачивает = Клиент_OldValue 
	//	//Тогда
	//		ТекстПредупреждения = "Есть счета c Контрагентом ('Проживает')" + Клиент_OldValue 
	//			+ Символы.ПС  + ", включенные в Групповой счет " + ГрупповойСчет
	//			+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ 'Проживает' НЕ РАЗРЕШЕНО ..."
	//			+ Символы.ПС  + Символы.ПС + "Для изменения 'Проживает' удалите счета c Контрагентом " 
	//				+ Клиент_OldValue + " из Группового счета " + ГрупповойСчет;
	//		ПоказатьПредупреждение(, ТекстПредупреждения); 
	//		
	//		Объект.Клиент = Клиент_OldValue;
	//		Возврат; 
	//	//КонецЕсли;
	//КонецЕсли;
	//
	//Если Объект.СчетаДетальноОплаты.Количество() > 0 Тогда 		
	//	ПроверкаОплат = ПроверкаОплатКонтрагента(Клиент_OldValue);
	//	Если ПроверкаОплат.ЕстьКассаОплатыКонтрагентаВДругихЗаявках Тогда  
	//		ТекстПредупреждения = "В Заявке есть кассовые документы оплаты Контрагентом " + Клиент_OldValue + " других Заявок.
	//					|
	//					|ИЗМЕНЕНИЕ 'Проживает' НЕ РАЗРЕШЕНО ...
	//					|
	//					|Для изменения клиента удалите оплаты Контрагентом " + Клиент_OldValue + " из Заявки.
	//					|ЛИБО ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ ...";
	//		ПоказатьПредупреждение(, ТекстПредупреждения); 
	//		
	//		Объект.Клиент = Клиент_OldValue;
	//		Возврат; 
	//	КонецЕсли;
	//	
	//	МассивКасса = ПроверкаОплат.МассивКасса;
	//КонецЕсли;

	Ответ = ПроверкаИзмененияКонтрагента(Объект.Клиент, Клиент_OldValue, ИмяРеквизитаКонтрагент);
	Если Ответ.Запрещено Тогда Возврат; КонецЕсли;           
	
	МассивКасса = Ответ.МассивКасса;
	
	////Если НЕ ЗначениеЗаполнено(Объект.Оплачивает)  
	////ИЛИ Объект.Оплачивает = Клиент_OldValue 
	////Тогда
	//
	//	Если ЕстьИзмениеПроцентСкидки() Тогда
	//		Если ЕстьСчетаКонтрагента(Клиент_OldValue) Тогда
	//			Результат = Ждать ВопросАсинх("Есть изменение скидки клиента: " + Объект.Клиент + "
	//								|
	//								|Есть счета счета c Контрагентом " + Клиент_OldValue + "
	//								|
	//								|СКИДКА НОВОГО КЛИЕНТА ПРИМЕНЕНА НЕ БУДЕТ ...
	//								|
	//								|ПРОДОЛЖИТЬ ?"
	//				, РежимДиалогаВопрос.ОКОтмена); 
	//				
	//			Если Результат = КодВозвратаДиалога.Отмена Тогда
	//				Объект.Клиент = Клиент_OldValue;
	//				
	//				Возврат; 
	//			КонецЕсли;		
	//			
	//		Иначе									
	//			Результат = Ждать ВопросАсинх("Есть изменение скидки для " + Объект.Клиент + "
	//								|
	//								|Заменить скидку в Проживание ?"
	//				, РежимДиалогаВопрос.ДаНет); 	

	//			ЗаменитьСкидку = (Результат = КодВозвратаДиалога.Да);
	//		КонецЕсли; 
	//	КонецЕсли; 
	
		Ответ = Ждать ПроверкаИзмененияСкидки(Объект.Клиент, Клиент_OldValue, ИмяРеквизитаКонтрагент);
		Если Ответ.Запрещено Тогда Возврат; КонецЕсли;
		                                                                               
		ЗаменитьСкидку = Ответ.ЗаменитьСкидку;

		
	////КонецЕсли;
	
	//Если (Объект.Счета.Количество() > 0 
	//	ИЛИ Объект.СчетаДетальноОплаты.Количество() > 0) Тогда
	//	
	//	ТекстВопроса = "Будет заменен 'Проживает' " + Клиент_OldValue + " на " + Объект.Клиент; 
	//	
	//	Если ЗначениеЗаполнено(Объект.Оплачивает) И Объект.Оплачивает = Клиент_OldValue Тогда 
	//		ТекстВопроса = ТекстВопроса + "
	//					|
	//					|Будет заменен 'Оплачивает': " + Клиент_OldValue + " на " + Объект.Клиент; 
	//	КонецЕсли;
	//	
	//	Если МассивКасса.Количество() > 0 Тогда 
	//		ТекстВопроса = ТекстВопроса + "
	//					|
	//					|Будет заменен контрагент " + Клиент_OldValue + " на " + Объект.Клиент + " в кассовых документах клиента.";
	//	КонецЕсли;
	//	
	//	Если ЗаменитьСкидку Тогда 
	//		ТекстВопроса = ТекстВопроса + "
	//					|
	//					|Будет заменена скидка в расчете проживания"; 
	//	КонецЕсли;
	//	
	//	
	//	
	//	ТекстВопроса = ТекстВопроса + "
	//					|
	//					|ПОДТВЕРДИТЕ ЗАМЕНУ ...";
	//	
	//	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	//	Если Результат = КодВозвратаДиалога.Отмена Тогда 
	//		Объект.Клиент = Клиент_OldValue;
	//		
	//		Возврат; 
	//	КонецЕсли;
	//КонецЕсли;
	
	Ответ = Ждать ПодтвердитеЗаменуКонтрагента(Объект.Клиент, Клиент_OldValue, ИмяРеквизитаКонтрагент, МассивКасса, ЗаменитьСкидку);
	Если Ответ Тогда Возврат; КонецЕсли;

КонецЕсли;	

КлиентПриИзмененииДействие(Клиент_OldValue, ЗаменитьСкидку);
КонецПроцедуры

//
&НаКлиенте
Функция ПроверкаИзмененияКонтрагента(Контрагент, Контрагент_OldValue, ИмяРеквизитаКонтрагент)
НовыйМассив = Новый Массив;	
Ответ = Новый Структура("Запрещено, МассивКасса, МассивВыписка, МассивПрочиеОплаты"
	, Ложь, НовыйМассив, НовыйМассив, НовыйМассив); 	

//ГрупповойСчет = ОплатыОбщееКлиент.ЕстьГрупповыеСчетаКонтрагент(Объект.Счета, Контрагент_OldValue);
//Если ЗначениеЗаполнено(ГрупповойСчет) Тогда 
//	//Если НЕ ЗначениеЗаполнено(Объект.Оплачивает) 
//	//ИЛИ	Объект.Оплачивает = Клиент_OldValue 
//	//Тогда
//		ТекстПредупреждения = "Есть счета c Контрагентом (" + ИмяРеквизитаКонтрагент + ")" + Контрагент_OldValue 
//			+ Символы.ПС  + ", включенные в Групповой счет " + ГрупповойСчет
//			+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ " + ИмяРеквизитаКонтрагент + " НЕ РАЗРЕШЕНО ..."
//			+ Символы.ПС  + Символы.ПС + "Для изменения "  + ИмяРеквизитаКонтрагент + " удалите счета c Контрагентом " 
//				+ Контрагент_OldValue + " из Группового счета " + ГрупповойСчет;
//				
//		ПоказатьПредупреждение(, ТекстПредупреждения); 
//		
//		Контрагент = Контрагент_OldValue;
//		Ответ.Запрещено = Истина;
//		
//		Возврат Ответ; 
//	//КонецЕсли;
//КонецЕсли;

Если ПроверкаИзмененияКонтрагентаГрупповойСчет(Контрагент, Контрагент_OldValue, ИмяРеквизитаКонтрагент) Тогда
		Контрагент = Контрагент_OldValue;
		Ответ.Запрещено = Истина;
		
		Возврат Ответ; 
КонецЕсли;

МассивКасса = Новый Массив;
Если Объект.СчетаДетальноОплаты.Количество() > 0 Тогда 		
	ПроверкаОплат = ПроверкаОплатКонтрагента(Контрагент_OldValue);

	Если ПроверкаОплат.ЕстьКассаОплатыКонтрагентаВДругихЗаявках Тогда  
		ТекстПредупреждения = "В Заявке есть кассовые документы оплаты Контрагентом " + Контрагент_OldValue + " других Заявок.
					|
					|ИЗМЕНЕНИЕ " + ИмяРеквизитаКонтрагент + " НЕ РАЗРЕШЕНО ...
					|
					|Для изменения клиента удалите оплаты Контрагентом " + Контрагент_OldValue + " из Заявки.
					|ЛИБО ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ ...";
		ПоказатьПредупреждение(, ТекстПредупреждения); 
		
		Контрагент = Контрагент_OldValue;
		Ответ.Запрещено = Истина;
		
		Возврат Ответ; 
	КонецЕсли;
	
	Ответ.МассивКасса = ПроверкаОплат.МассивКасса;
	Ответ.МассивВыписка = ПроверкаОплат.МассивВыписка;
	Ответ.МассивПрочиеОплаты = ПроверкаОплат.МассивПрочиеОплаты;
	
	Возврат Ответ; 
КонецЕсли;

Возврат Ответ;
КонецФункции

&НаКлиенте
Функция ПроверкаИзмененияКонтрагентаГрупповойСчет(Контрагент, Контрагент_OldValue, ИмяРеквизитаКонтрагент)

ГрупповойСчет = ОплатыОбщееКлиент.ЕстьГрупповыеСчетаКонтрагент(Объект.Счета, Контрагент_OldValue);
Если ЗначениеЗаполнено(ГрупповойСчет) Тогда 
	//Если НЕ ЗначениеЗаполнено(Объект.Оплачивает) 
	//ИЛИ	Объект.Оплачивает = Клиент_OldValue 
	//Тогда
		ТекстПредупреждения = "Есть счета c Контрагентом (" + ИмяРеквизитаКонтрагент + ")" + Контрагент_OldValue 
			+ Символы.ПС  + ", включенные в Групповой счет " + ГрупповойСчет
			+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ " + ИмяРеквизитаКонтрагент + " НЕ РАЗРЕШЕНО ..."
			+ Символы.ПС  + Символы.ПС + "Для изменения "  + ИмяРеквизитаКонтрагент + " удалите счета c Контрагентом " 
				+ Контрагент_OldValue + " из Группового счета " + ГрупповойСчет;
				
		ПоказатьПредупреждение(, ТекстПредупреждения); 
		
		Возврат Истина; 
	//КонецЕсли;
КонецЕсли;

Возврат Ложь; 
КонецФункции


&НаКлиенте
Асинх Функция ПроверкаИзмененияСкидки(Контрагент, Контрагент_OldValue, ИмяРеквизитаКонтрагент)
Ответ = Новый Структура("Запрещено, ЗаменитьСкидку", Ложь, Ложь); 	

Если ЕстьИзмениеПроцентСкидки() Тогда
	Если ЕстьСчетаКонтрагента(Контрагент_OldValue) Тогда
		Результат = Ждать ВопросАсинх("Есть изменение скидки для " + ИмяРеквизитаКонтрагент + " " + Контрагент + "
							|
							|Есть счета c Контрагентом " + Контрагент_OldValue + "
							|
							|НОВАЯ СКИДКА ПРИМЕНЕНА НЕ БУДЕТ ...
							|
							|ПРОДОЛЖИТЬ ?"
			, РежимДиалогаВопрос.ОКОтмена); 
			
		Если Результат = КодВозвратаДиалога.Отмена Тогда
			Контрагент = Контрагент_OldValue;
			
			Ответ.Запрещено = Истина;
			Возврат Ответ; 
		КонецЕсли;		
		
	Иначе									
		Результат = Ждать ВопросАсинх("Есть изменение скидки для " + Контрагент + "
							|
							|Заменить скидку в Проживание ?"
			, РежимДиалогаВопрос.ДаНет); 	

		ЗаменитьСкидку = (Результат = КодВозвратаДиалога.Да);
		Ответ.ЗаменитьСкидку = ЗаменитьСкидку;
		Возврат Ответ; 
	КонецЕсли; 
КонецЕсли; 

Возврат Ответ;
КонецФункции

&НаКлиенте
Асинх Функция ПодтвердитеЗаменуКонтрагента(Контрагент, Контрагент_OldValue, ИмяРеквизитаКонтрагент, МассивКасса, ЗаменитьСкидку)
Если (Объект.Счета.Количество() > 0 
	ИЛИ Объект.СчетаДетальноОплаты.Количество() > 0) Тогда
	
	ТекстВопроса = "Будет заменен " + ИмяРеквизитаКонтрагент + " " + Контрагент_OldValue + " на " + Контрагент; 
	
	Если ИмяРеквизитаКонтрагент = "'Проживает'" Тогда 
		Если ЗначениеЗаполнено(Объект.Оплачивает) И Объект.Оплачивает = Контрагент_OldValue Тогда 
			ТекстВопроса = ТекстВопроса + "
						|
						|Будет заменен 'Оплачивает': " + Контрагент_OldValue + " на " + Контрагент; 
		КонецЕсли;
	КонецЕсли;		
	
	Если ИмяРеквизитаКонтрагент = "'Оплачивает'" Тогда 
		ЗаменаОплачивает = ПроверкаЗаменыКонтрагентОплачивает(Контрагент, Контрагент_OldValue);
	ИначеЕсли ИмяРеквизитаКонтрагент = "'Бронирует'" Тогда 
		ЗаменаОплачивает = Ложь;
	Иначе 	
		ЗаменаОплачивает = Истина;
	КонецЕсли;
	
	Если ЗаменаОплачивает Тогда 
		Если МассивКасса.Количество() > 0 Тогда 
			ТекстВопроса = ТекстВопроса + "
						|
						|Будет заменен контрагент " + Контрагент_OldValue + " на " + Контрагент + " в кассовых документах Заявки.";
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаменитьСкидку Тогда 
		ТекстВопроса = ТекстВопроса + "
					|
					|Будет заменена скидка в расчете проживания"; 
	КонецЕсли;
	
	ТекстВопроса = ТекстВопроса + "
					|
					|ПОДТВЕРДИТЕ ЗАМЕНУ ...";
	
	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Объект.Клиент = Контрагент_OldValue;
		
		Возврат Истина; 
	КонецЕсли;
КонецЕсли;

Возврат Ложь; 

КонецФункции
//

&НаСервере
Функция Клиент_OldValue()
Возврат Объект.Ссылка.Клиент;	
КонецФункции	

&НаКлиенте
Функция КлиентРавенКлиент2Предупреждение()
Если (Объект.Клиент = Объект.Клиент2)  Тогда 
	ТекстПредупреждения = "Выбран клиент: " + Объект.Клиент + "
						|  
						| Первый клиент = Второй клиент." 
		+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО.";
	ПоказатьПредупреждение(, ТекстПредупреждения);
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции	
//

//
&НаКлиенте
Процедура КлиентПриИзмененииДействие(Клиент_OldValue, ЗаменитьСкидку)

ЦветаКлиента = ПолучитьЦветаКлиента();
Если ЦветаКлиента.ЦветR<>0 Или ЦветаКлиента.ЦветG<>0 или ЦветаКлиента.ЦветB<>0 тогда
	ЦветR=ЦветаКлиента.ЦветR;
	ЦветG=ЦветаКлиента.ЦветG;
	ЦветB=ЦветаКлиента.ЦветB;
	Элементы.ЦветЗаявки.ЦветФона =Новый Цвет(ЦветR,ЦветG,ЦветB);
	
	ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(Элементы.ЦветЗаявки.ЦветФона);
	Элементы.ЦветЗаявки.ЦветТекста = ЦветТекста;
конецесли;

//ОбновитьКоличествоЧеловек();

КлиентПриИзмененииЗавершение(Клиент_OldValue, ЗаменитьСкидку);
КонецПроцедуры

&НаСервере
Функция ПолучитьЦветаКлиента() 
Ответ = Новый Структура;
Ответ.Вставить("ЦветR", Объект.Клиент.ЦветR);
Ответ.Вставить("ЦветG", Объект.Клиент.ЦветG);
Ответ.Вставить("ЦветB", Объект.Клиент.ЦветB);

Возврат Ответ;
КонецФункции	
//

//
&НаСервере
Функция ЕстьИзмениеПроцентСкидки()
////ПроцентСкидки = ДокументыСервер.ИтогоСкидка(Объект);				
//ИтогоСкидка = ДокументыСервер.ИтогоСкидка(Объект);				
//СкидкаКлиента = ДокументыСервер.СкидкаКлиента(Объект);

//Если СкидкаКлиента < ИтогоСкидка Тогда
//	ПроцентСкидки = ИтогоСкидка;
//Иначе
//	ПроцентСкидки = СкидкаКлиента;
//КонецЕсли;

ПроцентСкидки = ДокументыСервер.ИтогоСкидкаКлиент(Объект, Ложь);

Для Каждого Строка Из Объект.Проживание Цикл
	Если Строка.ПроцентСкидкиКлиента <> ПроцентСкидки Тогда Возврат Истина;	КонецЕсли;
КонецЦикла;

Возврат Ложь;
КонецФункции

&НаКлиенте
Функция ЕстьСчетаКонтрагента(Контрагент) 
ОтборСтроки = Новый Структура("Контрагент", Контрагент);
НайденныеСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);

Возврат НайденныеСтроки.Количество() > 0;
КонецФункции

&НаКлиенте
Функция ЕстьСчетаКонтрагентаПроживание(Контрагент) 
ОтборСтроки = Новый Структура("Контрагент, ТолькоУслуги", Контрагент, Ложь);
НайденныеСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);

Возврат НайденныеСтроки.Количество() > 0;
КонецФункции

&НаСервере
Процедура ЗаменаПроцентСкидки()
//ПроцентСкидки = ДокументыСервер.ИтогоСкидка(Объект);				
ПроцентСкидки = ДокументыСервер.ИтогоСкидкаКлиент(Объект, Ложь);				
Для Каждого Строка Из Объект.Проживание Цикл
	Строка.ПроцентСкидкиКлиента = ПроцентСкидки;
	ДокументыСервер.ЗаполнитьСуммаСоСкидкойСтрокаПроживание(Строка);
КонецЦикла;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьКоличествоЧеловек()
Если Объект.КолВоЧеловек > 2 Тогда Возврат; КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
	Объект.КолВоЧеловек = 0;	
	Возврат;
КонецЕсли;

//КолВоЧеловек = ?(ЗначениеЗаполнено(Объект.Клиент), 1, 0);
КолВоЧеловек = 1;
КолВоЧеловек2 = ?(ЗначениеЗаполнено(Объект.Клиент2), 1, 0);

Объект.КолВоЧеловек = КолВоЧеловек + КолВоЧеловек2;
КонецПроцедуры

&НаСервере
Функция ПроверкаЗаполнения() 
ТекстСообщения = ДокументыСервер.ПроверкаЗаполненияЗаявкаНабронированиеТекстСообщения(Объект, " "); 
Возврат ТекстСообщения <> ""; 
КонецФункции

&НаСервере
Функция ПроверкаОплатКонтрагента(Контрагент)
МассивКасса = Новый Массив;
МассивВыписка  = Новый Массив;
МассивПрочиеОплаты = Новый Массив;

Результат = Новый Структура("ЕстьКассаОплатыКонтрагентаВДругихЗаявках, МассивКасса, МассивВыписка, МассивПрочиеОплаты"
	, Ложь, МассивКасса, МассивВыписка, МассивПрочиеОплаты); 	
	
Если ЕстьКассаОплатыКонтрагентаВДругихЗаявках(Контрагент) Тогда 
	Результат.ЕстьКассаОплатыКонтрагентаВДругихЗаявках = Истина;
	
	Возврат Результат;
КонецЕсли;
	
Для Каждого Строка Из Объект.СчетаДетальноОплаты Цикл	
	Если Строка.ДокументОплаты.ОтКого <> Контрагент Тогда Продолжить; КонецЕсли; 
	
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		МассивКасса.Добавить(Строка.ДокументОплаты);
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
		МассивВыписка.Добавить(Строка.ДокументОплаты);
	ИначеЕсли ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
		МассивПрочиеОплаты.Добавить(Строка.ДокументОплаты);
	КонецЕсли;
КонецЦикла;

Результат.МассивКасса = МассивКасса;
Результат.МассивВыписка = МассивВыписка;
Результат.МассивПрочиеОплаты = МассивПрочиеОплаты;
Возврат Результат;	
КонецФункции

&НаСервере
Функция ЕстьКассаОплатыКонтрагентаВДругихЗаявках(Контрагент)
ЕстьКассаОплатыКонтрагентаВДругихЗаявках = Ложь;

МассивДокументыОплаты = Новый Массив;
Для Каждого Строка Из Объект.СчетаДетальноОплаты Цикл
	ДокументОплаты = Строка.ДокументОплаты;
	Если ДокументОплаты.ОтКого <> Контрагент Тогда Продолжить; КонецЕсли;
	
	МассивДокументыОплаты.Добавить(Строка.ДокументОплаты);
КонецЦикла;

Если МассивДокументыОплаты.Количество() = 0 Тогда Возврат Ложь; КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка) КАК КоличествоРазличные
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ТИПЗНАЧЕНИЯ(ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты) = ТИП(Документ.КассовыйДокумент)
                      |	И ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты В(&ДокументыОплаты)");

Запрос.УстановитьПараметр("ДокументыОплаты", МассивДокументыОплаты);
Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();

ЕстьКассаОплатыКонтрагентаВДругихЗаявках = Выборка.КоличествоРазличные > 1;

Возврат ЕстьКассаОплатыКонтрагентаВДругихЗаявках; 
КонецФункции
//

//
&НаКлиенте
Процедура КлиентПриИзмененииЗавершение(Клиент_OldValue, ЗаменитьСкидку)
Если ЗаменитьКлиентаНаСервере(Клиент_OldValue, ЗаменитьСкидку) Тогда Возврат; КонецЕсли;

ОтборТаблицаАнкет(); 
Если ЗначениеЗаполнено(Объект.Клиент) Тогда 
	НеПоказыватьИсторию = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Клиент, "НеПоказыватьИсторию");
Иначе
	НеПоказыватьИсторию = Истина;
КонецЕсли;	
Если НЕ НеПоказыватьИсторию Тогда ПредпочтенияИсторияКлиента(); КонецЕсли;

Если НЕ КлиентыСервер.ЭтоЮрЛицо(Объект.Клиент) Тогда
	ПредупрежденияЧСКурит(Объект.Клиент);
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаменитьКлиентаНаСервере(Клиент_OldValue, ЗаменитьСкидку) 
НачатьТранзакцию();

ЗаменитьКлиентаДействие(Клиент_OldValue, ЗаменитьСкидку);

Если ЭтотОбъектЗаписатьНаСервере() Тогда 
	ОтменитьТранзакцию();
	Объект.Клиент = Клиент_OldValue;
	
	Возврат Истина;
Иначе
	ЗафиксироватьТранзакцию();
	
	Возврат Ложь;
Конецесли;
КонецФункции

&НаСервере
Процедура ЗаменитьКлиентаДействие(Клиент_OldValue, ЗаменитьСкидку) 
Если НЕ ЗначениеЗаполнено(Клиент_OldValue) Тогда Возврат; КонецЕсли;

Если ЗаменитьСкидку Тогда ЗаменаПроцентСкидки(); КонецЕсли;

Для Каждого Счет из Объект.Счета Цикл
	Если Счет.Клиент = Клиент_OldValue Тогда
		Счет.Клиент = Объект.Клиент; 
	КонецЕсли;
КонецЦикла;

Если ЗначениеЗаполнено(Объект.Оплачивает) И Объект.Оплачивает = Клиент_OldValue Тогда
	Объект.Оплачивает = Объект.Клиент; 
КонецЕсли;

Для Каждого Счет из Объект.Счета Цикл
	Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;
	
	Если Счет.Контрагент = Клиент_OldValue Тогда
		Счет.Контрагент = Объект.Клиент;
	КонецЕсли;
КонецЦикла;

ЗаменитьКонтрагентаДокументОплатыКасса(Объект.Клиент, Клиент_OldValue);

ЗаменитьУдалитьКонтрагентаДокументОплатыВыписка(Объект.Клиент, Клиент_OldValue);
КонецПроцедуры

//
&НаСервере
Функция ЗаменитьКонтрагентаДокументОплатыКасса(Контрагент, Контрагент_OldValue) 
Для Каждого Строка Из Объект.СчетаДетальноОплаты Цикл
	Если Строка.ГрупповаяОплата Тогда Продолжить; КонецЕсли; 
	
	ДокументОплаты = Строка.ДокументОплаты;

	Если ДокументОплаты.ОтКого <> Контрагент_OldValue Тогда Продолжить; КонецЕсли;
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
		ДокументОплатыОбъект.ОтКого = Контрагент;
	    ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	КассовыйДокумент.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
		                      |ГДЕ
		                      |	КассовыйДокумент.ВозвратДокумент = &ВозвратДокумент");
		Запрос.УстановитьПараметр("ВозвратДокумент", ДокументОплаты); 
		ТЗ = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			ДокументОплатыТЗ = СтрокаТЗ.Ссылка;
			ДокументОплатыОбъект = ДокументОплатыТЗ.ПолучитьОбъект(); 								
			ДокументОплатыОбъект.ОтКого = Контрагент;
			
		    ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);								
		КонецЦикла;
	КонецЕсли;
КонецЦикла;
КонецФункции	

&НаСервере
Функция ЗаменитьУдалитьКонтрагентаДокументОплатыВыписка(Контрагент, Контрагент_OldValue) 
Если Контрагент_OldValue.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо Тогда
	Если Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо Тогда
		ЗаменитьКонтрагентаДокументОплатыВыписка(Контрагент, Контрагент_OldValue);
	Иначе	
		УдалитьДокументыОплатыВыписка(Контрагент_OldValue);
	КонецЕсли;
Иначе	
	 УдалитьДокументыОплатыВыписка(Контрагент_OldValue);
КонецЕсли;		
КонецФункции

&НаСервере
Функция ЗаменитьКонтрагентаДокументОплатыВыписка(Контрагент, Контрагент_OldValue) 
Для Каждого Строка Из Объект.СчетаДетальноОплаты Цикл
	Если Строка.ГрупповаяОплата Тогда Продолжить; КонецЕсли; 
	
	ДокументОплаты = Строка.ДокументОплаты;

	Если ДокументОплаты.ОтКого <> Контрагент_OldValue Тогда Продолжить; КонецЕсли;
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
		ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
		ДокументОплатыОбъект.ОтКого = Контрагент;
	    ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВыпискаБанка.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
		                      |ГДЕ
		                      |	ВыпискаБанка.ВозвратДокумент = &ВозвратДокумент");
		Запрос.УстановитьПараметр("ВозвратДокумент", ДокументОплаты); 
		ТЗ = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			ДокументОплатыТЗ = СтрокаТЗ.Ссылка;
			ДокументОплатыОбъект = ДокументОплатыТЗ.ПолучитьОбъект(); 								
			ДокументОплатыОбъект.ОтКого = Контрагент;
			
		    ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);								
		КонецЦикла;
	КонецЕсли;
КонецЦикла;
КонецФункции	
//

//
&НаКлиенте
Процедура ПредупрежденияЧСКурит(Контрагент)
Если НЕ ЗначениеЗаполнено(Контрагент) Тогда Возврат; КонецЕсли;
//Если Контрагент = Объект.Клиент2 Тогда Возврат; КонецЕсли;

ТекстПредупреждения = "";
КлиентЧС = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Контрагент, "ЧС");
Если КлиентЧС тогда
	ТекстПредупреждения = "ВНИМАНИЕ: Клиент в черном списке!";
конецесли;

КлиентКурит = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Контрагент, "Курит");
Если КлиентКурит тогда
	ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения, "ВНИМАНИЕ: Клиент отмечен как курящий!"
		, Символы.ПС + Символы.ПС) 
конецесли;
	
Если ТекстПредупреждения <> "" Тогда
	ПоказатьПредупреждение( ,ТекстПредупреждения);
конецесли;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОнЖеПроживает(Команда)
Объект.Клиент = Объект.Бронирует;

КлиентПриИзменении(Элементы.Клиент);
КонецПроцедуры
//
//// - Клиент

//// + Клиент2

//
&НаКлиенте
Процедура Клиент2ПриИзменении(Элемент)
ПроверкаКонтрагента(Объект.Клиент2);
	
Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда 
	Объект.Клиент2 = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");	
	
	Возврат;	
КонецЕсли;
	
Если ПереместитьКонтрагентаИзАрхива(Объект.Клиент2, Элемент) Тогда Возврат; КонецЕсли; 

Клиент2ПриИзмененииОбработка(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Клиент2ПриИзмененииОбработка(Элемент)
ПоказатьИсторияКлиента2ДопПожелания(Элемент); 
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсторияКлиента2ДопПожелания(Элемент)
ДопПараметры = Новый Структура("Элемент", Элемент);	

Если НЕ ЗначениеЗаполнено(Объект.Клиент2) Тогда 
	ЗакрытиеФормы_ИсторияКлиента2ДопПожелания(Неопределено, ДопПараметры); Возврат; КонецЕсли;
	
Клиент2_OldValue = Клиент2_OldValue();
//Если ЗначениеЗаполнено(Клиент_OldValue) Тогда 
//	ЗакрытиеФормы_ИсторияКлиентаДопПожелания(Неопределено, ДопПараметры); Возврат; КонецЕсли;
Если Клиент2_OldValue = Объект.Клиент2 Тогда 
	ЗакрытиеФормы_ИсторияКлиента2ДопПожелания(Неопределено, ДопПараметры); Возврат; КонецЕсли;	

ЗначениеОтбора = Новый Структура("Клиент", Объект.Клиент2);
ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_ИсторияКлиента2ДопПожелания", ЭтаФорма, ДопПараметры);
ОткрытьФорму("РегистрСведений.ИсторияКлиентаДопПожелания.Форма.ФормаНабораЗаписей", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы_ИсторияКлиента2ДопПожелания(Результат, ДополнительныеПараметры) Экспорт
Клиент2ПриИзмененииПродолжение(ДополнительныеПараметры.Элемент);	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Клиент2ПриИзмененииПродолжение(Элемент)
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	ОбновитьКоличествоЧеловек();
	Возврат; 
КонецЕсли;		
	
Если ПроверкаЗаполнения() Тогда Возврат; КонецЕсли;	

Клиент2_OldValue = Клиент2_OldValue();

Если Объект.Клиент2 = Клиент2_OldValue Тогда Возврат; КонецЕсли;

Если КлиентРавенКлиент2Предупреждение() Тогда 
	Объект.Клиент2 = Клиент2_OldValue;
	Возврат; 
КонецЕсли;

МассивКасса= Новый Массив;

Если ЗначениеЗаполнено(Клиент2_OldValue) Тогда
	//ГрупповойСчет = ОплатыОбщееКлиент.ЕстьГрупповыеСчетаКонтрагент(Объект.Счета, Клиент2_OldValue);
	//Если ЗначениеЗаполнено(ГрупповойСчет) Тогда 
	//	ТекстПредупреждения = "Есть счета c Контрагентом ('Проживает (второй)')" + Клиент2_OldValue 
	//		+ Символы.ПС  + ", включенные в Групповой счет " + ГрупповойСчет
	//		+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ 'Проживает (второй)' НЕ РАЗРЕШЕНО ..."
	//		+ Символы.ПС  + Символы.ПС + "Для изменения 'Проживает (второй)' удалите счета c Контрагентом " 
	//				+ Клиент2_OldValue + " из Группового счета " + ГрупповойСчет;

	//	ПоказатьПредупреждение(, ТекстПредупреждения);
	//	
	//	Объект.Клиент2 = Клиент2_OldValue;
	//	Возврат; 
	//КонецЕсли;			
	//
	//ПроверкаОплат = ПроверкаОплатКонтрагента(Клиент2_OldValue);
	//МассивКасса = ПроверкаОплат.МассивКасса;
	//Если ПроверкаОплат.ЕстьКассаОплатыКонтрагентаВДругихЗаявках Тогда  
	//	ТекстПредупреждения = "В Заявке есть кассовые документы оплаты второму клиенту, участвующие в других Заявках." 
	//		+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ..."
	//		+ Символы.ПС  + Символы.ПС + "Для изменения клиента удалите оплаты второму клиенту в заявке.
	//									|
	//									|ЛИБО ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ ...";
	//	ПоказатьПредупреждение(, ТекстПредупреждения); 
	//	
	//	Объект.Клиент2 = Клиент2_OldValue;
	//	Возврат; 
	//КонецЕсли;
	
	
	Ответ = ПроверкаИзмененияКонтрагента(Объект.Клиент2, Клиент2_OldValue, "'Проживает (второй)'");
	Если Ответ.Запрещено Тогда Возврат; КонецЕсли;           
	
	МассивКасса = Ответ.МассивКасса;
	
	//Если (Объект.Счета.Количество() > 0 
	//ИЛИ Объект.СчетаДетальноОплаты.Количество() > 0) Тогда
	//	
	//	ДопПараметрыОповещения = Новый Структура();
	//	ДопПараметрыОповещения.Вставить("Клиент2_OldValue", Клиент2_OldValue);

	//	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВопросаБудетЗамененКлиент2", ЭтаФорма, ДопПараметрыОповещения);
	//	
	//	ТекстВопроса = "Будет заменен второй клиент: " + Клиент2_OldValue + "
	//										|на клиента: " + Объект.Клиент2; 
	//	
	//	Если МассивКасса.Количество() > 0 Тогда 
	//		ТекстВопроса = ТекстВопроса + "
	//					|
	//					|Будет заменен контрагент в кассовых документах второго клиента.";
	//	КонецЕсли;
	//	
	//	ТекстВопроса = ТекстВопроса + "
	//					|
	//					|ПОДТВЕРДИТЕ ЗАМЕНУ ...";
	//	
	//	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	//	Возврат;
	//КонецЕсли;
	
	Ответ = Ждать ПодтвердитеЗаменуКонтрагента(Объект.Клиент2, Клиент2_OldValue, "'Проживает (второй)'", МассивКасса, Ложь);
	Если Ответ Тогда Возврат; КонецЕсли;
	
КонецЕсли;		

Клиент2ПриИзмененииЗавершение(Клиент2_OldValue);
КонецПроцедуры

&НаКлиенте
Процедура Клиент2ПриИзмененииПродолжение_1(Элемент)
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	ОбновитьКоличествоЧеловек();
	Возврат; 
КонецЕсли;		
	
Если ПроверкаЗаполнения() Тогда Возврат; КонецЕсли;	

Клиент2_OldValue = Клиент2_OldValue();

Если Объект.Клиент2 = Клиент2_OldValue Тогда Возврат; КонецЕсли;

Если КлиентРавенКлиент2Предупреждение() Тогда 
	Объект.Клиент2 = Клиент2_OldValue;
	Возврат; 
КонецЕсли;

МассивКасса= Новый Массив;

Если ЗначениеЗаполнено(Клиент2_OldValue) Тогда
	ГрупповойСчет = ОплатыОбщееКлиент.ЕстьГрупповыеСчетаКонтрагент(Объект.Счета, Клиент2_OldValue);
	Если ЗначениеЗаполнено(ГрупповойСчет) Тогда 
		ТекстПредупреждения = "Есть счета c Контрагентом ('Проживает (второй)')" + Клиент2_OldValue 
			+ Символы.ПС  + ", включенные в Групповой счет " + ГрупповойСчет
			+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ 'Проживает (второй)' НЕ РАЗРЕШЕНО ..."
			+ Символы.ПС  + Символы.ПС + "Для изменения 'Проживает (второй)' удалите счета c Контрагентом " 
					+ Клиент2_OldValue + " из Группового счета " + ГрупповойСчет;

		ПоказатьПредупреждение(, ТекстПредупреждения);
		
		Объект.Клиент2 = Клиент2_OldValue;
		Возврат; 
	КонецЕсли;			
	
	ПроверкаОплат = ПроверкаОплатКонтрагента(Клиент2_OldValue);
	МассивКасса = ПроверкаОплат.МассивКасса;
	Если ПроверкаОплат.ЕстьКассаОплатыКонтрагентаВДругихЗаявках Тогда  
		ТекстПредупреждения = "В Заявке есть кассовые документы оплаты второму клиенту, участвующие в других Заявках." 
			+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ..."
			+ Символы.ПС  + Символы.ПС + "Для изменения клиента удалите оплаты второму клиенту в заявке.
										|
										|ЛИБО ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ ...";
		ПоказатьПредупреждение(, ТекстПредупреждения); 
		
		Объект.Клиент2 = Клиент2_OldValue;
		Возврат; 
	КонецЕсли;
	
	Если (Объект.Счета.Количество() > 0 
	ИЛИ Объект.СчетаДетальноОплаты.Количество() > 0) Тогда
		
		ДопПараметрыОповещения = Новый Структура();
		ДопПараметрыОповещения.Вставить("Клиент2_OldValue", Клиент2_OldValue);

		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВопросаБудетЗамененКлиент2", ЭтаФорма, ДопПараметрыОповещения);
		
		ТекстВопроса = "Будет заменен второй клиент: " + Клиент2_OldValue + "
											|на клиента: " + Объект.Клиент2; 
		
		Если МассивКасса.Количество() > 0 Тогда 
			ТекстВопроса = ТекстВопроса + "
						|
						|Будет заменен контрагент в кассовых документах второго клиента.";
		КонецЕсли;
		
		ТекстВопроса = ТекстВопроса + "
						|
						|ПОДТВЕРДИТЕ ЗАМЕНУ ...";
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	
КонецЕсли;		

Клиент2ПриИзмененииЗавершение(Клиент2_OldValue);
КонецПроцедуры



&НаСервере
Функция Клиент2_OldValue()
Возврат Объект.Ссылка.Клиент2;	
КонецФункции

&НаКлиенте
Процедура ЗавершениеВопросаБудетЗамененКлиент2(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда 
	Объект.Клиент2 = ДополнительныеПараметры.Клиент2_OldValue;
	
	Возврат; 
КонецЕсли;	

Клиент2ПриИзмененииЗавершение(ДополнительныеПараметры.Клиент2_OldValue);
КонецПроцедуры
//

//
&НаКлиенте
Процедура Клиент2ПриИзмененииЗавершение(Клиент_OldValue)
ОбновитьКоличествоЧеловек();

ЗаменитьКлиента2НаСервере(Клиент_OldValue);

ПредупрежденияЧСКурит(Объект.Клиент2);
КонецПроцедуры

&НаСервере
Функция ЗаменитьКлиента2НаСервере(Клиент_OldValue) 
НачатьТранзакцию();

ЗаменитьКлиента2_Действие(Клиент_OldValue);

Если ЭтотОбъектЗаписатьНаСервере() Тогда 
	ОтменитьТранзакцию();
Иначе
	ЗафиксироватьТранзакцию();
Конецесли;
КонецФункции

&НаСервере
Процедура ЗаменитьКлиента2_Действие(Клиент2_OldValue)
Если НЕ ЗначениеЗаполнено(Клиент2_OldValue) Тогда Возврат; КонецЕсли;
	
Для Каждого Счет из Объект.Счета Цикл
	Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;
		
	Если Счет.Контрагент = Клиент2_OldValue Тогда
		Счет.Контрагент = Объект.Клиент2;
	КонецЕсли;
	
	Если Счет.Клиент = Клиент2_OldValue Тогда
		Счет.Клиент = Объект.Клиент2;
	КонецЕсли;
КонецЦикла;

ЗаменитьКонтрагентаДокументОплатыКасса(Объект.Клиент2, Клиент2_OldValue);

ЗаменитьУдалитьКонтрагентаДокументОплатыВыписка(Объект.Клиент2, Клиент2_OldValue); 
КонецПроцедуры
//

//// + Оплачивает
&НаКлиенте
Процедура ОплачиваетПриИзменении(Элемент)
ПроверкаКонтрагента(Объект.Оплачивает);
	
Если ПереместитьКонтрагентаИзАрхива(Объект.Оплачивает, Элемент) Тогда Возврат; КонецЕсли; 

ОплачиваетПриИзмененииОбработка(Элемент);
КонецПроцедуры

&НаКлиенте   
Асинх Процедура ОплачиваетПриИзмененииОбработка(Элемент)
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда Возврат; КонецЕсли;		

Если ПроверкаЗаполнения() Тогда Возврат; КонецЕсли;	

Оплачивает_OldValue = Оплачивает_OldValue();
Если Объект.Оплачивает = Оплачивает_OldValue Тогда Возврат; КонецЕсли;

МассивКасса = Новый Массив;
МассивВыписка = Новый Массив;
МассивПрочиеОплаты = Новый Массив;

Если ЗначениеЗаполнено(Оплачивает_OldValue) Тогда
	//ГрупповойСчет = ОплатыОбщееКлиент.ЕстьГрупповыеСчетаКонтрагент(Объект.Счета, Оплачивает_OldValue);
	//Если ЗначениеЗаполнено(ГрупповойСчет) Тогда 
	//	ТекстПредупреждения = "Есть счета c Контрагентом ('Оплачивает')" + Оплачивает_OldValue 
	//		+ Символы.ПС  + ", включенные в Групповой счет " + ГрупповойСчет
	//		+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ 'Оплачивает' НЕ РАЗРЕШЕНО ..."
	//		+ Символы.ПС  + Символы.ПС + "Для изменения 'Оплачивает' удалите счета c Контрагентом " 
	//				+ Оплачивает_OldValue + " из Группового счета " + ГрупповойСчет;
	//	
	//	ПоказатьПредупреждение(, ТекстПредупреждения);
	//	
	//	Объект.Оплачивает = Оплачивает_OldValue;
	//	Возврат; 
	//КонецЕсли;
	//
	//ПроверкаОплат = ПроверкаОплатКонтрагента(Оплачивает_OldValue);
	//МассивКасса = ПроверкаОплат.МассивКасса;
	//МассивВыписка = ПроверкаОплат.МассивВыписка;
	//МассивПрочиеОплаты = ПроверкаОплат.МассивПрочиеОплаты;
	//
	//Если ПроверкаОплат.ЕстьКассаОплатыКонтрагентаВДругихЗаявках Тогда  
	//	ТекстПредупреждения = "В Заявке есть кассовые документы оплаты контрагентом 'Оплачивает': " + Оплачивает_OldValue + " других Заявках.   
	//	 	|
	//		|Для изменения контрагента удалите кассовые документы контрагента " + Оплачивает_OldValue + " из заявки.
	//		|
	//		|ЛИБО ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ ...";
	//	ПоказатьПредупреждение(, ТекстПредупреждения); 
	//	
	//	Объект.Оплачивает = Оплачивает_OldValue;
	//	
	//	Возврат; 
	//КонецЕсли;
	
	Ответ = ПроверкаИзмененияКонтрагента(Объект.Оплачивает, Оплачивает_OldValue, "'Оплачивает'");
	Если Ответ.Запрещено Тогда Возврат; КонецЕсли;           
	
	МассивКасса = Ответ.МассивКасса;
	МассивВыписка = Ответ.МассивВыписка;
	МассивПрочиеОплаты = Ответ.МассивПрочиеОплаты;
КонецЕсли;

//ЗаменитьСкидку = Ложь;
Клиент_OldValue = Клиент_OldValue();
//Если ЕстьИзмениеПроцентСкидки() Тогда
//	Контрагент_OldValue = ?(ЗначениеЗаполнено(Оплачивает_OldValue), Оплачивает_OldValue, Клиент_OldValue); 
//	Контрагент = ?(ЗначениеЗаполнено(Объект.Оплачивает), Объект.Оплачивает, Объект.Клиент);  
//	
//	Если ЕстьСчетаКонтрагента(Контрагент_OldValue) Тогда
//		Результат = Ждать ВопросАсинх("Есть изменение скидки " + Контрагент + "
//			|
//			|Есть счета клиента:" + Контрагент_OldValue + "
//			|
//			|СКИДКА ПРИМЕНЕНА НЕ БУДЕТ ...
//			|
//			|ПРОДОЛЖИТЬ ?"
//			, РежимДиалогаВопрос.ОКОтмена); 
//			
//		Если Результат = КодВозвратаДиалога.Отмена Тогда
//			Объект.Оплачивает = Оплачивает_OldValue;
//			Возврат; 
//		КонецЕсли;		
//		
//	Иначе									
//		Результат = Ждать ВопросАсинх("Есть изменение скидки " + Объект.Оплачивает + "
//							|
//							|Заменить скидку клиента в Проживание ?"
//			, РежимДиалогаВопрос.ДаНет); 	

//		ЗаменитьСкидку = (Результат = КодВозвратаДиалога.Да);
//	КонецЕсли; 
//КонецЕсли; 

Контрагент = ?(ЗначениеЗаполнено(Объект.Оплачивает), Объект.Оплачивает, Объект.Клиент);  
Контрагент_OldValue = ?(ЗначениеЗаполнено(Оплачивает_OldValue), Оплачивает_OldValue, Клиент_OldValue); 

Ответ = Ждать ПроверкаИзмененияСкидки(Контрагент, Контрагент_OldValue, "'Оплачивает'");
Если Ответ.Запрещено Тогда Возврат; КонецЕсли;
                                                                               
ЗаменитьСкидку = Ответ.ЗаменитьСкидку;


//Если (Объект.Счета.Количество() > 0 
//ИЛИ Объект.СчетаДетальноОплаты.Количество() > 0) Тогда
	//
	//ТекстВопроса = "Будет заменен 'Оплачивает': " + Оплачивает_OldValue 
	//	+ " на: " + ?(ЗначениеЗаполнено(Объект.Оплачивает), Объект.Оплачивает, "Пусто");;
	//
	//Если МассивКасса.Количество() > 0 Тогда
	//	ТекстВопроса = ТекстВопроса + "
	//	                |
	//					|Будет заменен контрагент в кассовых документах контрагента: " + Оплачивает_OldValue
	//						+ " на " + Объект.Оплачивает
	//КонецЕсли;
	//
	//Если МассивВыписка.Количество() > 0 Тогда
	//	ТекстВопроса = ТекстВопроса + "
	//	                |
	//					|Будут удалены банковские документы контрагента 'Оплачивает'.";
	//КонецЕсли;
	//
	//Если ЗаменитьСкидку Тогда 
	//	ТекстВопроса = ТекстВопроса + "
	//				|
	//				|Будет заменена скидка в расчете проживания"; 
	//КонецЕсли;
	////Если МассивПрочиеОплаты.Количество() > 0 Тогда
	////	ТекстВопроса = ТекстВопроса + "
	////	                |
	////					|Будут удалены документы 'Прочие оплаты' контрагента 'Оплачивает'.";
	////КонецЕсли;
	//
	//ТекстВопроса = ТекстВопроса + "
	//			|
	//			|ПОДТВЕРДИТЕ ЗАМЕНУ ...";

	//Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	//Если Результат = КодВозвратаДиалога.Отмена Тогда 
	//	Объект.Оплачивает = Оплачивает_OldValue;
	//	
	//	Возврат; 
	//КонецЕсли;
	
//КонецЕсли;

Ответ = Ждать ПодтвердитеЗаменуКонтрагента(Контрагент, Контрагент_OldValue, "'Оплачивает'", МассивКасса, ЗаменитьСкидку);
Если Ответ Тогда Возврат; КонецЕсли;

ОплачиваетПриИзмененииДействие(Контрагент_OldValue, ЗаменитьСкидку, Клиент_OldValue);
КонецПроцедуры

&НаСервере
Функция Оплачивает_OldValue()
Возврат Объект.Ссылка.Оплачивает;	
КонецФункции

&НаСервере
Функция ЗаменитьУдалитьДокументыОплатыКасса_НеИспользуется(Оплачивает_OldValue)
Если Оплачивает_OldValue.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо Тогда
	Если Оплачивает_OldValue.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо Тогда
		Возврат "Заменить";		
	Иначе
		Возврат "Удалить";		
	КонецЕсли;	
КонецЕсли;		

Возврат "";
КонецФункции
//

//
&НаКлиенте   
Процедура ОплачиваетПриИзмененииДействие(Оплачивает_OldValue, ЗаменитьСкидку, Клиент_OldValue)
ОплачиваетПриИзмененииЗавершение(Оплачивает_OldValue, ЗаменитьСкидку, Клиент_OldValue);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОплачиваетПриИзмененииЗавершение(Оплачивает_OldValue, ЗаменитьСкидку, Клиент_OldValue)
ЗаменитьОплачиваетНаСервере(Оплачивает_OldValue, ЗаменитьСкидку, Клиент_OldValue);
КонецПроцедуры

&НаСервере
Процедура ЗаменитьОплачиваетНаСервере(Оплачивает_OldValue, ЗаменитьСкидку, Клиент_OldValue)
НачатьТранзакцию();

ЗаменитьОплачивает(Оплачивает_OldValue, ЗаменитьСкидку, Клиент_OldValue);

Если ЭтотОбъектЗаписатьНаСервере() Тогда 
	ОтменитьТранзакцию();
	
	Объект.Оплачивает = Оплачивает_OldValue;
Иначе
	ЗафиксироватьТранзакцию();
Конецесли;
Конецпроцедуры	

&НаСервере
Процедура ЗаменитьОплачивает(Оплачивает_OldValue, ЗаменитьСкидку, Клиент_OldValue)
Если ЗаменитьСкидку Тогда ЗаменаПроцентСкидки(); КонецЕсли;

Если ЗначениеЗаполнено(Оплачивает_OldValue) Тогда
	Контрагент_OldValue = Оплачивает_OldValue;
Иначе
	Контрагент_OldValue = Клиент_OldValue;
КонецЕсли;		

Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда
	Контрагент = Объект.Оплачивает;
Иначе
	Контрагент = Объект.Клиент;
КонецЕсли;

//Замена = Истина;
//Если КлиентыСервер.ЭтоЮрЛицо(Клиент_OldValue) И КлиентыСервер.ЭтоЮрЛицо(Контрагент) Тогда

//ИначеЕсли (КлиентыСервер.ЭтоЮрЛицо(Клиент_OldValue)) И (НЕ КлиентыСервер.ЭтоЮрЛицо(Контрагент)) Тогда
//	
//ИначеЕсли (НЕ КлиентыСервер.ЭтоЮрЛицо(Клиент_OldValue)) И (КлиентыСервер.ЭтоЮрЛицо(Контрагент)) Тогда
//	Замена = Ложь;
//	
//ИначеЕсли (НЕ КлиентыСервер.ЭтоЮрЛицо(Клиент_OldValue)) И (НЕ КлиентыСервер.ЭтоЮрЛицо(Контрагент)) Тогда
//	
//КонецЕсли;

Замена = ПроверкаЗаменыКонтрагентОплачивает(Контрагент, Контрагент_OldValue);

Для Каждого Счет из Объект.Счета Цикл
	Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;

	Если Счет.Контрагент = Контрагент_OldValue Тогда
		
		Если Счет.РазделитьСчет Тогда
			Счет.Контрагент = Счет.Клиент;
		Иначе
		
			Если Замена Тогда
				Счет.Контрагент = Контрагент;
			Иначе	
				Если НЕ Счет.ТолькоУслуги Тогда
					Счет.Контрагент = Контрагент;
				КонецЕсли;
			КонецЕсли;
		
		КонецЕсли;
	КонецЕсли;
КонецЦикла;

Если Замена Тогда		
	ЗаменитьКонтрагентаДокументОплатыКасса(Объект.Оплачивает, Оплачивает_OldValue);
КонецЕсли;
	
УдалитьДокументыОплатыВыписка(Контрагент_OldValue);
КонецПроцедуры	

&НаСервере
Функция ПроверкаЗаменыКонтрагентОплачивает(Контрагент, Контрагент_OldValue)
Замена = Истина;
Если КлиентыСервер.ЭтоЮрЛицо(Контрагент_OldValue) И КлиентыСервер.ЭтоЮрЛицо(Контрагент) Тогда
	
ИначеЕсли (КлиентыСервер.ЭтоЮрЛицо(Контрагент_OldValue)) И (НЕ КлиентыСервер.ЭтоЮрЛицо(Контрагент)) Тогда
	
ИначеЕсли (НЕ КлиентыСервер.ЭтоЮрЛицо(Контрагент_OldValue)) И (КлиентыСервер.ЭтоЮрЛицо(Контрагент)) Тогда
	Замена = Ложь;
	
ИначеЕсли (НЕ КлиентыСервер.ЭтоЮрЛицо(Контрагент_OldValue)) И (НЕ КлиентыСервер.ЭтоЮрЛицо(Контрагент)) Тогда
	
КонецЕсли;

Возврат Замена;
КонецФункции	
	
&НаСервере
Процедура УдалитьДокументыОплатыВыписка(Контрагент_OldValue)
Для Каждого Строка Из Объект.СчетаДетальноОплаты Цикл
	Если Строка.ГрупповаяОплата Тогда Продолжить; КонецЕсли; 
	
	ДокументОплаты = Строка.ДокументОплаты;

	Если ДокументОплаты.ОтКого <> Контрагент_OldValue Тогда Продолжить; КонецЕсли;
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда

		ЗаявкаСервер.УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты, Объект.Ссылка);

		ЗаявкаСервер.ОчиститьСчетаДетальноДолгиДокументОплаты(ДокументОплаты
			, Объект.РаспределениеОплатДолги, Объект.СчетаДетальноДолги); 	
			
		Объект.СчетаДетальноОплаты.Удалить(Строка);
	КонецЕсли; 
КонецЦикла;
Конецпроцедуры	
//
////

//
&НаКлиенте
Процедура РазделитьСчетПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда Возврат; КонецЕсли;	
	
Если ОплатыОбщееКлиент.ЕстьСчета(Объект.Счета) Тогда 
	ТекстПредупреждения = "Есть счета." 
	+ Символы.ПС  + Символы.ПС + "ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ..."
	+ Символы.ПС  + Символы.ПС + "Для изменения удалите счета.";
	ПоказатьПредупреждение(, ТекстПредупреждения); 
	
	РазделитьСчет_OldValue = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Ссылка, "РазделитьСчет"); 	
	Объект.РазделитьСчет = РазделитьСчет_OldValue;
КонецЕсли;
КонецПроцедуры
//

// 
&НаКлиенте
Процедура ОнЖеОплачивает(Команда)
Объект.Оплачивает = Объект.Бронирует;

ОплачиваетПриИзменении(Элементы.Оплачивает);
КонецПроцедуры
// 

//// - Клиенты

&НаКлиенте
Процедура КатегорияНомераПриИзменении(Элемент)
Если НЕ ЗначениеЗаполнено(Объект.КатегорияНомера) Тогда Возврат; КонецЕсли;
Если НЕ ЗначениеЗаполнено(КатегорияНомера_OldValue) Тогда Возврат; КонецЕсли;

Если Объект.КатегорияНомера <> КатегорияНомера_OldValue Тогда 
	Если ЗначениеЗаполнено(КатегорияНомера_OldValue) Тогда 
		ПоказатьПредупреждение(, "ВНИМАНИЕ ! Изменилась категория номера." 
		+ Символы.ПС + Символы.ПС + "Перезаполните расчет проживания (при необходимости)");  		
	КонецЕсли;			
	
	КатегорияНомера_OldValue = Объект.КатегорияНомера;
КонецЕсли;

КонецПроцедуры

//// + НомерВрезерв
&НаКлиенте
Процедура НомерВРезервПриИзменении(Элемент)
Если НЕ (ЗначениеЗаполнено(Объект.РезервС) И ЗначениеЗаполнено(Объект.РезервПо)) Тогда 
	Объект.НомерВРезерв = Неопределено;
	Возврат; 
КонецЕсли;

Если ЗначениеЗаполнено(Объект.НомерВРезерв) Тогда	
	Объект.ЛистОжидания = Ложь;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.КатегорияНомера) Тогда 
	КатегорияНомера = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.НомерВРезерв, "КатегорияНомера"); 
	Объект.КатегорияНомера = КатегорияНомера;
КонецЕсли;
	
Если ДеньНедели(Объект.РезервС)>=5 или  ДеньНедели(Объект.РезервС)=1 тогда
	Если ЗаявкаСервер.ПроверкаСоседей(Объект.НомерВРезерв, Объект.РезервС, Объект.РезервПо) тогда
		ПоказатьПредупреждение(,"Внимание! на период проживания в соседних номерах есть гости");	
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерВРезервНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("КатегорияНомера", Объект.КатегорияНомера);
ПараметрыФормы.Вставить("РезервС", Объект.РезервС);
ПараметрыФормы.Вставить("РезервПо", Объект.РезервПо);
ПараметрыФормы.Вставить("ВремяЗаезда", Объект.ВремяЗаезда);
ПараметрыФормы.Вставить("ВремяВыезда", Объект.ВремяВыезда);
ПараметрыФормы.Вставить("Курящий", Объект.Курящий);

ПараметрыФормы.Вставить("БонШанс", Объект.БонШанс);

ОткрытьФорму("Справочник.НомернойФонд.Форма.ФормаВыбораНомера", ПараметрыФормы, Элементы.НомерВРезерв);
КонецПроцедуры

&НаКлиенте
Процедура НомерВРезервОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


// + Автоподбор номера
&НаКлиенте
Процедура Авто(Команда)
Если НЕ ЗначениеЗаполнено(Объект.КатегорияНомера) Тогда
	ПоказатьПредупреждение(, "Для автоподбора номера заполните Категорию номера"); 	
	Возврат;
КонецЕсли;	
	
МассивТЗсвободных = АвтоНаСервере();

// + ПСН
Если МассивТЗсвободных.Количество()=0 тогда
	ПоказатьПредупреждение(,"Свободных номеров на эти даты данной категории нет!");
	Шахматка(Неопределено);
иначе
	Объект.НомерВРезерв=ПредопределенноеЗначение("Справочник.НомернойФонд.ПустаяСсылка");
	
	// + Нет разделения номеров для курящих и некурящих 
	Для каждого НомерСтр из МассивТЗсвободных цикл
		//Если НомерСтр.курящий=Объект.Курящий тогда
			Объект.НомерВРезерв=НомерСтр.ссылка;
		//конецесли;
	конеццикла;
	
	Возврат;
	// - Нет разделения номеров для курящих и некурящих 
	
	Если Объект.НомерВРезерв=ПредопределенноеЗначение("Справочник.НомернойФонд.ПустаяСсылка") тогда
		ДопПараметры = МассивТЗсвободных[0].ссылка;
		Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросНомерНеНайден", ЭтаФорма, ДопПараметры);
		ТекстВопроса = "Номер для "+?(Объект.Курящий,"курящих","некурящих")+" не найден, но есть другой, забронировать?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
		
		//Если Вопрос("Номер для "+?(Курящий,"курящих","некурящих")+" не найден, но есть другой, забронировать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
		//	НомерВРезерв=ТЗсвободных[0].ссылка;
		//конецесли;
	конецесли;
	
конецесли;
// - ПСН
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросНомерНеНайден(Результат, Параметры) Экспорт
Если Результат = КодВозвратаДиалога.Да Тогда 
	Объект.НомерВРезерв = Параметры;
КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция АвтоНаСервере()
Ответ = ДокументыСервер.ЗанятостьНомераПериодРезерва(Объект.РезервС, Объект.РезервПо, Объект.ВремяЗаезда, Объект.ВремяВыезда);
ТемпС = Ответ.НачалоПериодаРезерва;
ТемпПо = Ответ.КонецПериодаРезерва;

ЗапросСвободных=Новый Запрос;
ЗапросСвободных.Текст = "ВЫБРАТЬ
|	НомернойФонд.Ссылка,
|	НомернойФонд.Курящий
|ИЗ
|	Справочник.НомернойФонд КАК НомернойФонд
|ГДЕ
|	(НЕ НомернойФонд.Ссылка В
|				(ВЫБРАТЬ
|					ЗанятостьНомеров.Номер
|				ИЗ
|					РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
|				ГДЕ
|					ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ПериодН И &ПериодК))";
Если ЗначениеЗаполнено(Объект.КатегорияНомера) Тогда
	ЗапросСвободных.Текст = ЗапросСвободных.Текст + " И НомернойФонд.КатегорияНомера = &КатегорияНомера";
	ЗапросСвободных.УстановитьПараметр("КатегорияНомера", Объект.КатегорияНомера);
КонецЕсли;	
ЗапросСвободных.УстановитьПараметр("ПериодН",ТемпС);
ЗапросСвободных.УстановитьПараметр("ПериодК",ТемпПо);
ТЗсвободных=ЗапросСвободных.Выполнить().Выгрузить();


// + ПСН
МассивТЗсвободных = ОбщийФункционалСервер.ТаблицаЗначенийВМассивСтруктур(ТЗсвободных);
Возврат МассивТЗсвободных; 
// - ПСН

//Если ТЗсвободных.Количество()=0 тогда
//	Предупреждение("Свободных номеров на эти даты данной категории нет!");
//	ШахматкаНажатие(ЭтаФорма);
//иначе
//	НомерВРезерв=Справочники.НомернойФонд.ПустаяСсылка();
//	
//	Для каждого НомерСтр из ТЗсвободных цикл
//		Если НомерСтр.курящий=Курящий тогда
//			НомерВРезерв=НомерСтр.ссылка;
//		конецесли;
//		
//	конеццикла;
//	
//	Если НомерВРезерв=Справочники.НомернойФонд.ПустаяСсылка() тогда
//		Если Вопрос("Номер для "+?(Курящий,"курящих","некурящих")+" не найден, но есть другой, забронировать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
//			НомерВРезерв=ТЗсвободных[0].ссылка;
//		конецесли;
//	конецесли;
//	
//	
//конецесли;
КонецФункции
// - Автоподбор номера
//// - НомерВрезерв

//// + Даты и время

//
&НаКлиенте
Процедура РезервСПриИзменении(Элемент)
Если ЗначениеЗаполнено(Объект.ВремяЗаездаТочное) Тогда
	ПоказатьПредупреждение(, "Заполнено точное время заезда
	|
	|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	Дата_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "РезервС");
	Объект.РезервС = Дата_OldValue; 
	
	Возврат;
КонецЕсли;	
	
Если НЕ ЗначениеЗаполнено(Объект.РезервС) тогда
	ПоказатьПредупреждение(, "Дата заезда - пусто");
	Возврат;
КонецЕсли;	

ДеньПроживанияМинимум = ЗаявкаОбщееКлиентСервер.ДеньПроживанияМинимум(Объект.Проживание);
Если НЕ ЗначениеЗаполнено(ДеньПроживанияМинимум) Тогда Возврат; КонецЕсли;
	
Если Объект.РезервС > ДеньПроживанияМинимум Тогда
	ПоказатьПредупреждение(, "Дата заезда: " + Объект.РезервС + "
							|	
							|Дата заезда больше минимальной даты проживания в расчете проживания");
	
	РезервС_OldValue = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Ссылка, "РезервС"); 
	Объект.РезервС = РезервС_OldValue;
	Возврат;
КонецЕсли;	

Если НЕ ЗначениеЗаполнено(Объект.РезервПо) тогда Возврат; КонецЕсли;	

Если ДатыРезервПроверить() тогда Объект.РезервС = Объект.РезервПо; КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезервПоПриИзменении(Элемент)   
Если НЕ ЗначениеЗаполнено(Объект.РезервПо) тогда
	ПоказатьПредупреждение(, "Дата выезда - пусто");
	Возврат;
КонецЕсли;	

ДеньПроживанияМаксимум = ЗаявкаОбщееКлиентСервер.ДеньПроживанияМаксимум(Объект.Проживание);
Если НЕ ЗначениеЗаполнено(ДеньПроживанияМаксимум) Тогда Возврат; КонецЕсли;

//ДеньПроживанияМаксимум = ДеньПроживанияМаксимум + 86400; 
Если Объект.РезервПо < ДеньПроживанияМаксимум Тогда
	ПоказатьПредупреждение(,  "Дата выезда: " + Объект.РезервПо + "
							|	
							|Дата выезда меньше максимальной даты проживания в расчете проживания");
	
	РезервПо_OldValue = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Ссылка, "РезервПо"); 
	Объект.РезервПо = РезервПо_OldValue;
	
	Возврат;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.РезервС) тогда Возврат; КонецЕсли;	

Если ДатыРезервПроверить() тогда
	Объект.РезервПо = Объект.РезервС;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ДатыРезервПроверить()
	
Если Объект.РезервПо < Объект.РезервС тогда
	ПоказатьПредупреждение(, "Дата выезда меньше даты заезда!");
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции
//

&НаКлиенте
Процедура ВремяЗаездаПриИзменении(Элемент)
Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Если Объект.Проживание.Количество() > 0 Тогда
		ВремяЗаезда_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "ВремяЗаезда");
		Если Объект.ВремяЗаезда <> ВремяЗаезда_OldValue Тогда
			ПоказатьПредупреждение(, "При небходимости исправьте количество в первой строке расчета проживания");			
		КонецЕсли;
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяВыездаПриИзменении(Элемент)
Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Если Объект.Проживание.Количество() > 0 Тогда
		ВремяВыезда_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "ВремяВыезда");
		Если Объект.ВремяВыезда <> ВремяВыезда_OldValue Тогда
			ПоказатьПредупреждение(, "При небходимости исправьте количество в последней строке расчета проживания");			
		КонецЕсли;
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

//// + Даты и время
/////// - Основная

////////////////////////////////////////////////////////////////

////// + Таблицы


//
&НаКлиенте
Процедура ОчиститьДанные(Команда)
Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;

ОчиститьДанныеНаСервере();

ЭтотОбъектЗаписатьНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеНаСервере()
Для Каждого СтрокаОплаты Из Объект.СчетаДетальноОплаты Цикл
	ДокументОплатыОбъект = СтрокаОплаты.ДокументОплаты.ПолучитьОбъект(); 
	ОтборСтроки = Новый Структура("ДокументДолг", Объект.Ссылка);
	ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтроки, ДокументОплатыОбъект.ДолгиОплата);
	ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;

Объект.РаспределениеОплатДолги.Очистить();
Объект.СчетаДетальноДолги.Очистить();
Объект.СчетаДетальноОплаты.Очистить();
Объект.СчетаДетальноСтроки.Очистить();
Объект.Счета.Очистить();

КонецПроцедуры
//

//// + Счета

//// + Добавление, обновление Счетов
&НаКлиенте
Процедура СоздатьПустойСчет(Команда)
ПараметрыФормы = Новый Структура();	
ПараметрыФормы.Вставить("ДокументДолг", Объект);

// + Счет
СчетГУИД = ОбщийФункционалСервер.УникальныйИдентификаторПустой();

КонтрагентПустаяСсылка = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");

ЕстьКлиент2 = (ЗначениеЗаполнено(Объект.Клиент2) И Объект.РазделитьСчет);
Если ЕстьКлиент2 Тогда 
	Клиент = КонтрагентПустаяСсылка;
Иначе
	Клиент = Объект.Клиент;
КонецЕсли;

Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда 
	Контрагент = Объект.Оплачивает;
ИначеЕсли ЕстьКлиент2 Тогда 
	Контрагент = КонтрагентПустаяСсылка;
Иначе
	Контрагент = Объект.Клиент;
КонецЕсли;

ТолькоПроживание = Ложь;
ТолькоУслуги = Ложь;
РазделитьСчет = Ложь;
СвернутьВСчете = ЛОжь;
Закрыт = Ложь;
ДатаС = Объект.РезервС;
ДатаПо =  Объект.РезервПо; 
НомерСчета = 0; 
ДатаСчета = ТекущаяДата();

ГрупповойСчет = Неопределено; 
ЭтоПредварительныйГрупповойСчет = ЭтоПредварительныйГрупповойСчет(Контрагент); 

Счет = ЗаявкаСервер.СчетСтруктура(СчетГУИД, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги, РазделитьСчет
	, СвернутьВСчете, Закрыт, ДатаС, ДатаПо, НомерСчета, ДатаСчета, ГрупповойСчет, ЭтоПредварительныйГрупповойСчет); 
ПараметрыФормы.Вставить("Счет", Счет);
// - Счет

ОткрытьФорму("ОбщаяФорма.СчетНаОплату", ПараметрыФормы, Элементы.Счета
	,,,, , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

// + СчетНаОплатуОткрытьФорму
&НаКлиенте
Процедура СчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
Если Поле.Имя = "СчетаДатаСчета"
ИЛИ Поле.Имя = "СчетаСвернутьВСчете" 
ИЛИ  Поле.Имя = "ЭтоПредварительныйГрупповойСчет"
ИЛИ Поле.Имя = "СчетаКонтрагент"
Тогда Возврат; КонецЕсли;	

ТекущиеДанные = Элемент.ТекущиеДанные;

Если Поле.Имя = "СчетаГрупповойСчет" Тогда 
	Если ЗначениеЗаполнено(ТекущиеДанные.ГрупповойСчет) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ГрупповойСчет); 
		ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
		
	Возврат; 
КонецЕсли;

СчетНаОплатуОткрытьФорму(ТекущиеДанные.СчетГУИД, ТекущиеДанные.Контрагент, ТекущиеДанные.Клиент
	, ТекущиеДанные.ТолькоПроживание, ТекущиеДанные.ТолькоУслуги, ТекущиеДанные.РазделитьСчет
	, ТекущиеДанные.СвернутьВСчете, ТекущиеДанные.Закрыт, ТекущиеДанные.ДатаС, ТекущиеДанные.ДатаПо
	, ТекущиеДанные.НомерСчета, ТекущиеДанные.ДатаСчета, ТекущиеДанные.ГрупповойСчет
	, ТекущиеДанные.ЭтоПредварительныйГрупповойСчет);
КонецПроцедуры

&НаКлиенте
Процедура СчетНаОплатуОткрытьФорму(СчетГУИД, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги, РазделитьСчет
			, СвернутьВСчете, Закрыт,  ДатаС, ДатаПо, НомерСчета, ДатаСчета, ГрупповойСчет, ЭтоПредварительныйГрупповойСчет)
				
Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;
				
ПараметрыФормы = Новый Структура();
ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
Если ЭтаФорма.ТолькоПросмотр Тогда 
	ПараметрыФормы.ТолькоПросмотр = Истина;
КонецЕсли;
Если ЗначениеЗаполнено(ГрупповойСчет) Тогда 
	ПараметрыФормы.ТолькоПросмотр = Истина;
КонецЕсли;

ПараметрыФормы.Вставить("ДокументДолг", Объект);

// + Счет
Счет = ЗаявкаСервер.СчетСтруктура(СчетГУИД, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги, РазделитьСчет
	, СвернутьВСчете, Закрыт, ДатаС, ДатаПо, НомерСчета, ДатаСчета, ГрупповойСчет, ЭтоПредварительныйГрупповойСчет); 
			
ПараметрыФормы.Вставить("Счет", Счет);
// - Счет

ОткрытьФорму("ОбщаяФорма.СчетНаОплату", ПараметрыФормы, Элементы.Счета
	,,,, , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
// - СчетНаОплатуОткрытьФорму

// + Возврат из СчетНаОплатуОткрытьФорму 
&НаКлиенте
Процедура СчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СчетВыбранноеЗначение = ВыбранноеЗначение.Счет;
НовыйСчет = ВыбранноеЗначение.НовыйСчет;
ДанныеСчетаВыбранноеЗначение = ВыбранноеЗначение.ДанныеСчета;  	

ОбновитьДанныеСчетаЗаявка_ЗавершениеСчетНаОплату(СчетВыбранноеЗначение, ДанныеСчетаВыбранноеЗначение);	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСчетаЗаявка_ЗавершениеСчетНаОплату(Счет, ДанныеСчета)
НачатьТранзакцию();	
	
ЗаявкаСервер.ОбновитьСчетИзСчетНаОплату( Счет, ДанныеСчета, Объект);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
ЗафиксироватьТранзакцию();	
КонецПроцедуры
// - Возврат из СчетНаОплатуОткрытьФорму 
//// - Добавление, обновление Счетов

//
&НаСервере
Функция ЭтоПредварительныйГрупповойСчет(Контрагент)
Если Контрагент.ПредварительныйГрупповойСчетПоУмолчанию = Перечисления.ПредварительныйГрупповойСчетПоУмолчанию.Да 
	Тогда Возврат Истина;		
ИначеЕсли Контрагент.ПредварительныйГрупповойСчетПоУмолчанию = Перечисления.ПредварительныйГрупповойСчетПоУмолчанию.Нет
	Тогда Возврат Ложь;
Иначе
	ЭтоПредварительныйГрупповойСчет = Контрагент.Турагентство 
	И (Контрагент.ТипОплатыСчета = Перечисления.ТипОплатыСчета.Взаимозачет 
		ИЛИ Контрагент.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой
		ИЛИ Контрагент.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ПолнаяОплатаТурагентствомСВозвратомКомиссии
		);
		
	Возврат ЭтоПредварительныйГрупповойСчет;
КонецЕсли;	
КонецФункции
//

//// + Изменение Счета

//
&НаКлиенте
Процедура СчетаКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ТД = Элементы.Счета.ТекущиеДанные;
Если ЗначениеЗаполнено(ТД.ГрупповойСчет) Тогда 
	ПоказатьПредупреждение(, "Групповой счет.
	|
	|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО");
	
	Возврат;
КонецЕсли;
	
СчетаКонтрагент_OldValue = ТД.Контрагент;

КонтрагентыОтбор = Новый СписокЗначений;

КонтрагентыОтбор.Добавить(Объект.Клиент);
Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда КонтрагентыОтбор.Добавить(Объект.Оплачивает); КонецЕсли;
Если ЗначениеЗаполнено(Объект.Клиент2) Тогда КонтрагентыОтбор.Добавить(Объект.Клиент2); КонецЕсли;

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("КонтрагентыОтбор", КонтрагентыОтбор);

ОткрытьФорму("Справочник.Клиенты.Форма.ФормаВыбораОтборКонтрагенты", ПараметрыФормы, Элементы.СчетаКонтрагент
	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СчетаКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ТД = Элементы.Счета.ТекущиеДанные;
ТД.Контрагент = ВыбранноеЗначение;	

Элементы.Счета.ЗакончитьРедактированиеСтроки(Ложь);   

ТД.ЭтоПредварительныйГрупповойСчет = ЭтоПредварительныйГрупповойСчет(ТД.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура СчетаКонтрагентПриИзменении(Элемент)
ТД = Объект.Счета.НайтиПоИдентификатору(Элементы.Счета.ТекущаяСтрока);	

Если ЗначениеЗаполнено(ТД.ГрупповойСчет) > 0 Тогда
	ПоказатьПредупреждение(, "Групповой Счет
							|
							|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	ТД.Контрагент = СчетаКонтрагент_OldValue;
	Возврат; 
КонецЕсли;

ОтборСтроки = Новый Структура("СчетГУИД", ТД.СчетГУИД);
НайденныеСтроки = Объект.РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда
	ПоказатьПредупреждение(, "Счет оплачен
							|
							|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО.
							|
							|Для изменения контрагента удалите оплаты счета ...");
	
	ТД.Контрагент = СчетаКонтрагент_OldValue;
	Возврат; 
КонецЕсли;

ТД.ЭтоПредварительныйГрупповойСчет = ЭтоПредварительныйГрупповойСчет(ТД.Контрагент);
КонецПроцедуры
//

// 
&НаКлиенте
Процедура СчетаЭтоПредварительныйГрупповойСчетПриИзменении(Элемент)
ТД = Объект.Счета.НайтиПоИдентификатору(Элементы.Счета.ТекущаяСтрока);	

Если ЗначениеЗаполнено(ТД.ГрупповойСчет) > 0 Тогда
	ПоказатьПредупреждение(, "Групповой Счет
							|
							|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...");
	
	ТД.ЭтоПредварительныйГрупповойСчет = ЭтоПредварительныйГрупповойСчет_OldValue;
	Возврат; 
КонецЕсли;

ОтборСтроки = Новый Структура("СчетГУИД", ТД.СчетГУИД);
НайденныеСтроки = Объект.РаспределениеОплатДолги.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда
	ПоказатьПредупреждение(, "Счет оплачен
							|
							|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО.
							|
							|Для изменения контрагента удалите оплаты счета ...");
	
	ТД.ЭтоПредварительныйГрупповойСчет = ЭтоПредварительныйГрупповойСчет_OldValue;
	Возврат; 
КонецЕсли;
КонецПроцедуры
// 

//
&НаКлиенте
Процедура СчетаЗакрытПриИзменении(Элемент)
ТекущиеДанные = Элементы.Счета.ТекущиеДанные;

Если ТекущиеДанные.Закрыт Тогда 
	Если НЕ (ТекущиеДанные.СуммаОплачено = ТекущиеДанные.Сумма) Тогда
		ПоказатьПредупреждение( , "Счет не оплачен, либо оплачен частично." 
			+ Символы.ПС + Символы.ПС + "ЗАКРЫТИЕ СЧЕТА НЕ РАЗРЕШЕНО.");
		ТекущиеДанные.Закрыт = Ложь;
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СчетаСвернутьВСчетеПриИзменении(Элемент)
ТекущиеДанные = Элементы.Счета.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

//ОбновитьСчетаСтрокиНаСервере(ТекущиеДанные.СчетГУИД);

ЭтотОбъектЗаписатьНаКлиенте();
КонецПроцедуры
//
//// - Изменение Счета

////
&НаКлиенте
Процедура ОбновитьСчетаСтроки(Команда)
ТекущиеДанные = Элементы.Счета.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

//ОбновитьСчетаСтрокиНаСервере(ТекущиеДанные.СчетГУИД);

ЭтотОбъектЗаписатьНаКлиенте();
КонецПроцедуры
////

//
&НаКлиенте
Процедура СчетаПриАктивизацииСтроки(Элемент)
ТекущиеДанные = Элемент.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда 
	СчетГУИД = ОбщийФункционалСервер.УникальныйИдентификаторПустой();
	Элементы.СчетаДетальноСтроки.ОтборСтрок = Новый ФиксированнаяСтруктура("СчетГУИД", СчетГУИД);	
	
	Возврат; 
КонецЕсли;

ЭтоПредварительныйГрупповойСчет_OldValue = ТекущиеДанные.ЭтоПредварительныйГрупповойСчет;
//ЭтоСчетЭквайринг_OldValue = ТекущиеДанные.ЭтоСчетЭквайринг;

СчетГУИД = ТекущиеДанные.СчетГУИД;
Элементы.СчетаДетальноСтроки.ОтборСтрок = Новый ФиксированнаяСтруктура("СчетГУИД", СчетГУИД);	
КонецПроцедуры
//

//
&НаКлиенте
Процедура СчетаПередУдалением(Элемент, Отказ)
Если НЕ	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
ТС = Элемент.ТекущаяСтрока;  	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;	
ТД = Объект.Счета.НайтиПоИдентификатору(ТС);

Если ЗначениеЗаполнено(ТД.ГрупповойСчет) Тогда 
	ПоказатьПредупреждение(, "Групповой счет.
							|
							|УДАЛЕНИЕ НЕ РАЗРЕШЕНО ...");
	Отказ = Истина; 
	Возврат; 
КонецЕсли;

СчетГУИД = ТД.СчетГУИД;

Если ЕстьОплатыСчета(СчетГУИД) Тогда 
	ПоказатьПредупреждение(, "Есть оплаты счета.
							|
							|УДАЛЕНИЕ НЕ РАЗРЕШЕНО ...
							|
							|Для удаления счета удалите оплаты счета");
	Отказ = Истина; 
	Возврат; 
КонецЕсли;

ТекстВопроса = ""; 
Если ТД.Закрыт Тогда 
	ПоказатьПредупреждение(,"Счет закрыт
	|
	|УДАЛЕНИЕ НЕ РАЗРЕШЕНО ...
	|
	|Для удаления счета снимите галочку 'Счет закрыт'");
	
	Отказ = Истина; 
	Возврат; 
КонецЕсли;

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдалениеСчета", ЭтаФорма);

ТекстВопроса = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстВопроса, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ...", Символы.ПС + Символы.ПС);  
ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдалениеСчета(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

УдалитьСчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСчетНаСервере()
НачатьТранзакцию();	

ТекущаяСтрока = Элементы.Счета.ТекущаяСтрока;
ТекущиеДанные = Объект.Счета.НайтиПоИдентификатору(ТекущаяСтрока);
СчетГУИД = ТекущиеДанные.СчетГУИД;

ЗаявкаСервер.УдалитьДанныеСчета(СчетГУИД, Объект);

СчетаДетальноСтроки = Объект.СчетаДетальноСтроки;
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = СчетаДетальноСтроки.НайтиСтроки(ОтборСтроки);
Для Каждого Строка Из НайденныеСтроки Цикл
	СчетаДетальноСтроки.Удалить(Строка);
КонецЦикла;

Объект.Счета.Удалить(ТекущиеДанные);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();	
КонецПроцедуры
//
//// - Счета

//// + Добавление, перезаполнение Счетов
&НаКлиенте
Процедура СчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

//// + Добавление Счетов
&НаКлиенте
Процедура ДобавитьСчета(Команда)
Ответ = ДобавитьСчетаНаСервере(Ложь, Ложь);	

ОбработатьДобавитьСчета(Ответ);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСчетаЗаПроживание(Команда)
Ответ = ДобавитьСчетаНаСервере(Истина, Ложь);

ОбработатьДобавитьСчета(Ответ);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСчетаЗаУслуги(Команда)
Ответ = ДобавитьСчетаНаСервере(Ложь, Истина);

ОбработатьДобавитьСчета(Ответ);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДобавитьСчета(Ответ)
Если Ответ = Неопределено Тогда Возврат; КонецЕсли;
	
Если Ответ.НетСчетов Тогда 
	ПоказатьПредупреждение(, "Нечего добавлять");
	Возврат; 
КонецЕсли;

//ЭтотОбъектЗаписатьНаКлиенте();

СчетПервый = Ответ.СчетПервый;
СчетГУИД = СчетПервый.СчетГУИД;
УстановитьТекущаяСтрокаСчета(СчетГУИД); 

Элементы.СчетаДетальноСтроки.ОтборСтрок = Новый ФиксированнаяСтруктура("СчетГУИД", СчетГУИД);		
КонецПроцедуры

&НаСервере
Функция УстановитьТекущаяСтрокаСчета(СчетГУИД)
ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД);
НайденныеСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() = 0 Тогда 
	Сообщить("Счет не найден: " + СчетГУИД + ". УстановитьТекущаяСтрокаСчета()"); 
	Возврат Истина; 
КонецЕсли;

НайденнаяСтрока = НайденныеСтроки[0];
Идентификатор = НайденнаяСтрока.ПолучитьИдентификатор();
Элементы.Счета.ТекущаяСтрока = Идентификатор;	
Возврат Ложь;
КонецФункции

//
&НаСервере
Функция ДобавитьСчетаНаСервере(ТолькоПроживаниеПараметр, ТолькоУслугиПараметр)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение))	Тогда Возврат Неопределено; КонецЕсли;
	
НачатьТранзакцию();	
	
Ответ = Новый Структура("НетСчетов, СчетПервый", Истина, Неопределено);	
	
ПустойМассив= Новый Массив;	
ДобавляемыеСтрокиДолгиОплачивает = Объект.СчетаДетальноДолги.Выгрузить(ПустойМассив);	

ДобавляемыеСтрокиДолгиОплачивает_Клиент = Объект.СчетаДетальноДолги.Выгрузить(ПустойМассив);	
ДобавляемыеСтрокиДолгиОплачивает_Клиент2 = Объект.СчетаДетальноДолги.Выгрузить(ПустойМассив);

ДобавляемыеСтрокиДолгиКлиент = Объект.СчетаДетальноДолги.Выгрузить(ПустойМассив);	
ДобавляемыеСтрокиДолгиКлиент2 = Объект.СчетаДетальноДолги.Выгрузить(ПустойМассив);	

СчетГУИД_Пустой = ОбщийФункционалСервер.УникальныйИдентификаторПустой();

//ОплачиваетЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Объект.Оплачивает);
ОплачиваетЮрЛицо = (Объект.Оплачивает.ТипКлиента = Перечисления.ТипыКлиентов.ЮрЛицо);

ОплачиваетТурагентство = Объект.Оплачивает.Турагентство;

Если НЕ ТолькоУслугиПараметр Тогда
	Для Каждого СтрокаИсходная Из Объект.Проживание Цикл 
		Если СтрокаИсходная.Сумма = 0 Тогда	Продолжить; КонецЕсли; 
		
		ОтборСтроки = Новый Структура("ДолгиГУИД", СтрокаИсходная.ГУИД);          
		СчетаДетальноДолги = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
		
		Если НЕ (Объект.РазделитьСчет И ЗначениеЗаполнено(Объект.Клиент2)) Тогда
			Если СчетаДетальноДолги.Количество() > 0 Тогда Продолжить; КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда	
				ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиОплачивает;
			Иначе
				ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиКлиент;
			КонецЕсли;
			
			НоваяСтрока = ДобавляемыеСтрокиДолгиКонтрагент.Добавить();
			ЗаявкаСервер.ЗаполнитьСтрокаДолги(НоваяСтрока, СтрокаИсходная, СчетГУИД_Пустой, Ложь);
			
			Продолжить;
		КонецЕсли;	
			
		Если Объект.РазделитьСчет И ЗначениеЗаполнено(Объект.Клиент2) Тогда
			
			Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда
				ДобавляемыеСтрокиДолг_Контрагент = ДобавляемыеСтрокиДолгиОплачивает_Клиент;					
				ДобавляемыеСтрокиДолг_Контрагент2 = ДобавляемыеСтрокиДолгиОплачивает_Клиент2;
				
				Контрагент = Объект.Оплачивает;
				Контрагент2 = Объект.Оплачивает;
				
			Иначе
				
				ДобавляемыеСтрокиДолг_Контрагент = ДобавляемыеСтрокиДолгиКлиент;				
				ДобавляемыеСтрокиДолг_Контрагент2 = ДобавляемыеСтрокиДолгиКлиент2;	
				
				Контрагент = Объект.Клиент;
				Контрагент2 = Объект.Клиент2;
			КонецЕсли;	
			
			ДобавитьСтроку = ДобавитьСтрокуВСчет(СчетаДетальноДолги, Контрагент, Объект.Клиент);
			Если ДобавитьСтроку Тогда
				НеПервый = Ложь;
				НоваяСтрока = ДобавляемыеСтрокиДолг_Контрагент.Добавить();
				ЗаявкаСервер.ЗаполнитьСтрокаДолги(НоваяСтрока, СтрокаИсходная, СчетГУИД_Пустой, Ложь);
				ЗаявкаСервер.УстановитьЦенаСуммаСчетаДетальноДолгиДляРазделитьСчет(НоваяСтрока
						, Истина, Ложь, Истина, НеПервый);
			КонецЕсли;	
			
			ДобавитьСтроку = ДобавитьСтрокуВСчет(СчетаДетальноДолги, Контрагент2, Объект.Клиент2);
			Если ДобавитьСтроку Тогда
				НеПервый = Истина;
				НоваяСтрока = ДобавляемыеСтрокиДолг_Контрагент2.Добавить();
				ЗаявкаСервер.ЗаполнитьСтрокаДолги(НоваяСтрока, СтрокаИсходная, СчетГУИД_Пустой, Ложь);
				ЗаявкаСервер.УстановитьЦенаСуммаСчетаДетальноДолгиДляРазделитьСчет(НоваяСтрока
						, Истина, Ложь, Истина, НеПервый);
			КонецЕсли;	
			
		КонецЕсли;		
	КонецЦикла;	
КонецЕсли;

Если НЕ ТолькоПроживаниеПараметр Тогда
	Для Каждого СтрокаИсходная Из Объект.ДопУслуги Цикл 
		Если НЕ СтрокаИсходная.ВСчет Тогда Продолжить; КонецЕсли; 
		Если СтрокаИсходная.Цена * СтрокаИсходная.Количество = 0 Тогда	Продолжить; КонецЕсли;
		
		ОтборСтроки = Новый Структура("ДолгиГУИД", СтрокаИсходная.ГУИД);
		НайденныеСтроки = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() > 0 Тогда Продолжить; КонецЕсли; 
		
		Если Объект.РазделитьСчет И ЗначениеЗаполнено(Объект.Клиент2) Тогда 		
			Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда	
				Если СтрокаИсходная.НеПервый Тогда
					ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиОплачивает_Клиент2;
				Иначе
					ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиОплачивает_Клиент;
					
				КонецЕсли;
			Иначе
				Если СтрокаИсходная.НеПервый Тогда
					ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиКлиент2;
				Иначе
					ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиКлиент;
					
				КонецЕсли;
			КонецЕсли;	
		Иначе
			Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда	
				Если НЕ ТолькоУслугиПараметр Тогда  
					ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиОплачивает;
				Иначе
					Если Объект.Оплачивает.Турагентство Тогда
						ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиКлиент;
					Иначе	
						ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиОплачивает;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ДобавляемыеСтрокиДолгиКонтрагент = ДобавляемыеСтрокиДолгиКлиент;
			КонецЕсли;
		КонецЕсли;	
		
		НоваяСтрока = ДобавляемыеСтрокиДолгиКонтрагент.Добавить();
		ЗаявкаСервер.ЗаполнитьСтрокаДолги(НоваяСтрока, СтрокаИсходная, СчетГУИД_Пустой, Истина);
	КонецЦикла;	
КонецЕсли;

// Создание счетов

НетСчетов = Истина;
СчетПервый = Неопределено;

Если ДобавляемыеСтрокиДолгиОплачивает.Количество() > 0 Тогда
	НетСчетов = Ложь;
	
	ТолькоПроживание = ТолькоПроживаниеПараметр;
	ТолькоУслуги = ТолькоУслугиПараметр;
		
	Контрагент = Объект.Оплачивает;
	Клиент = Объект.Клиент;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Объект.Клиент;
	КонецЕсли;

	Счет = ДобавитьСчетЗаявка(ДобавляемыеСтрокиДолгиОплачивает, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги);
	Если СчетПервый = Неопределено Тогда СчетПервый = Счет; КонецЕсли;
КонецЕсли;

Если ДобавляемыеСтрокиДолгиОплачивает_Клиент.Количество() > 0 Тогда
	НетСчетов = Ложь;
	
	ТолькоПроживание = ТолькоПроживаниеПараметр;
	ТолькоУслуги = ТолькоУслугиПараметр;
		
	Контрагент = Объект.Оплачивает;
	Клиент = Объект.Клиент;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Объект.Клиент;
	КонецЕсли;
	
	Счет = ДобавитьСчетЗаявка(ДобавляемыеСтрокиДолгиОплачивает_Клиент, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги);
	Если СчетПервый = Неопределено Тогда СчетПервый = Счет; КонецЕсли;
КонецЕсли;

Если ДобавляемыеСтрокиДолгиОплачивает_Клиент2.Количество() > 0 Тогда
	НетСчетов = Ложь;
	
	ТолькоПроживание = ТолькоПроживаниеПараметр;
	ТолькоУслуги = ТолькоУслугиПараметр;
		
	Контрагент = Объект.Оплачивает;
	Клиент = Объект.Клиент2;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Объект.Клиент2;
	КонецЕсли;

	Счет = ДобавитьСчетЗаявка(ДобавляемыеСтрокиДолгиОплачивает_Клиент2, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги);
	Если СчетПервый = Неопределено Тогда СчетПервый = Счет; КонецЕсли;
КонецЕсли;

Если ДобавляемыеСтрокиДолгиКлиент.Количество() > 0 Тогда
	НетСчетов = Ложь;
	
	ТолькоПроживание = ТолькоПроживаниеПараметр;
	ТолькоУслуги = ТолькоУслугиПараметр;
	
	Если Объект.Оплачивает = Объект.Клиент Тогда
		Контрагент = Объект.Клиент;
	ИначеЕсли ЗначениеЗаполнено(Объект.Оплачивает) И Объект.Оплачивает = Объект.Клиент2 Тогда
	    Контрагент = Объект.Клиент2;
	Иначе
		Контрагент = Объект.Клиент;
	КонецЕсли;
		
	Клиент = Объект.Клиент;
	
	Счет = ДобавитьСчетЗаявка(ДобавляемыеСтрокиДолгиКлиент, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги);
	Если СчетПервый = Неопределено Тогда СчетПервый = Счет; КонецЕсли;
КонецЕсли;	

Если ДобавляемыеСтрокиДолгиКлиент2.Количество() > 0 Тогда
	НетСчетов = Ложь;
	
	ТолькоПроживание = ТолькоПроживаниеПараметр;
	ТолькоУслуги = ТолькоУслугиПараметр;

	Если Объект.Оплачивает = Объект.Клиент Тогда
		Контрагент = Объект.Клиент;
	ИначеЕсли ЗначениеЗаполнено(Объект.Оплачивает) И Объект.Оплачивает = Объект.Клиент2 Тогда
	    Контрагент = Объект.Клиент2;
	Иначе
		Контрагент = Объект.Клиент2;
	КонецЕсли;
	
	Клиент = Объект.Клиент2;
	
	Счет = ДобавитьСчетЗаявка(ДобавляемыеСтрокиДолгиКлиент2, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги);
	Если СчетПервый = Неопределено Тогда СчетПервый = Счет; КонецЕсли;
КонецЕсли;	

Ответ.НетСчетов = НетСчетов;
Ответ.СчетПервый = СчетПервый;

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
ЗафиксироватьТранзакцию();	

Возврат Ответ;
КонецФункции

&НаСервере
Функция ДобавитьСтрокуВСчет(СчетаДетальноДолги, Контрагент, Клиент)
ДобавитьСтрокуВСчет = Истина;
Если СчетаДетальноДолги.Количество() = 0 Тогда Возврат ДобавитьСтрокуВСчет; КонецЕсли;

Для Каждого Строка Из СчетаДетальноДолги Цикл
	ОтборСтроки = Новый Структура("СчетГУИД, Контрагент, Клиент", Строка.СчетГУИД, Контрагент, Клиент);
	НайденныеСчета = Объект.Счета.НайтиСтроки(ОтборСтроки);
	Если НайденныеСчета.Количество() > 0 Тогда
		ДобавитьСтрокуВСчет = Ложь;
		
		Прервать;
	КонецЕсли;
КонецЦикла;

Возврат ДобавитьСтрокуВСчет;
КонецФункции

&НаСервере
Функция ДобавитьСчетЗаявка(ДополнительныеСтрокиДолги, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги)
НачатьТранзакцию();	
	
ПустойМассив = Новый Массив;	
СчетГУИД_Пустой = ОбщийФункционалСервер.УникальныйИдентификаторПустой();

СчетаДетальноДолги = Объект.СчетаДетальноДолги;
ОбщийФункционалСервер.ДобавитьСтроки(СчетаДетальноДолги, ДополнительныеСтрокиДолги);

РаспределениеОплатДолги = Объект.РаспределениеОплатДолги;

ДатаС = Объект.РезервС; ДатаПо = Объект.РезервПо;
ЗаявкаСервер.ДатаСДатаПо(ДатаС, ДатаПо, ДополнительныеСтрокиДолги); 
	
Счет = ЗаявкаСервер.СчетСтруктура(СчетГУИД_Пустой, Контрагент, Клиент, ТолькоПроживание, ТолькоУслуги
	, Объект.РазделитьСчет, Объект.СвернутьВСчете, Ложь, ДатаС, ДатаПо, 0, ТекущаяДата(), Неопределено, Ложь); 
	
Счет.ЭтоПредварительныйГрупповойСчет = ЭтоПредварительныйГрупповойСчет(Счет.Контрагент);
	
Счет = ЗаявкаСервер.ЗаполнитьНовыйСчетДанные(Счет, Объект.Счета, СчетаДетальноДолги, РаспределениеОплатДолги);  

СчетОбъект = Объект.Счета.Добавить();
ЗаполнитьЗначенияСвойств(СчетОбъект, Счет); 

МассивОплатКонтрагента = ЗаявкаСервер.МассивОплатКонтрагента(Контрагент, Объект.СчетаДетальноОплаты);
ОбновитьСчетаОплаты(МассивОплатКонтрагента, Объект);

ЗафиксироватьТранзакцию();	
Возврат Счет;
КонецФункции

&НаСервере
Функция ОбновитьСчетаОплаты(СчетаДетальноОплаты, ТекущийОбъект)
Для Каждого СтрокаОплаты Из СчетаДетальноОплаты Цикл
	Если СтрокаОплаты.ГрупповаяОплата Тогда Продолжить; КонецЕсли;
	
	ОбновитьСчетаСтрокаОплаты(СтрокаОплаты, ТекущийОбъект);
КонецЦикла;
КонецФункции

&НаСервере
Процедура ОбновитьСчетаСтрокаОплаты(СтрокаОплаты, ТекущийОбъект)
ЗаявкаСервер.ОбновитьСчетаСтрокаОплаты(СтрокаОплаты, ТекущийОбъект);
КонецПроцедуры
//
//// - Добавление Счетов






///////////// - Элементы Формы /////////////////
//// + СчетаДетальноОплаты

//
&НаСервере
Процедура РаспределитьСтрокаОплатыНаСчет(СтрокаОплаты, ОстатокКРаспределению, СчетГУИД)
ЗаявкаСервер.РаспределитьСтрокаОплатыНаСчет(СтрокаОплаты, ОстатокКРаспределению, СчетГУИД, Объект)	
КонецПроцедуры
//

//
&НаКлиенте
Процедура СчетаДетальноОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ДокументОплаты = Элемент.ТекущиеДанные.ДокументОплаты;

ОплатыОбщееКлиент.ОткрытьДокументОплаты(ЭтаФорма, ДокументОплаты, Истина, Неопределено);
КонецПроцедуры
//

&НаКлиенте
Процедура СчетаДетальноОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры
 
// + Удалить
&НаКлиенте
Процедура СчетаДетальноОплатыПередУдалением(Элемент, Отказ)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
ТекущиеДанные = Элемент.ТекущиеДанные;
Если ТекущиеДанные = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли;	

Если ТекущиеДанные.ГрупповаяОплата Тогда 
	ПоказатьПредупреждение(, "Групповая оплата.
							|
							|ОТМЕНА ОПЛАТЫ НЕ РАЗРЕШЕНА ...");
	Отказ = Истина; 
	Возврат; 
КонецЕсли;	

Разрешение = НастройкиСервер.ЭтоАдмин() ИЛИ НастройкиСервер.ЭтоАдминистратор();
Если НЕ Разрешение Тогда 
	ПоказатьПредупреждение(, "Вы не являетесь администратором программы.
							|
							|ОТМЕНА ОПЛАТЫ НЕ РАЗРЕШЕНА ...");
	Отказ = Истина; 
	Возврат; 
КонецЕсли;

//ДопПараметры = Новый Структура("ДокументОплаты", ТекущиеДанные.ДокументОплаты);
//Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдаление", ЭтаФорма, ДопПараметры);
//ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ ОТМЕНУ ОПЛАТЫ ...", РежимДиалогаВопрос.ОКОтмена);

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдаление", ЭтаФорма);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ ОТМЕНУ ОПЛАТЫ ...", РежимДиалогаВопрос.ОКОтмена);

Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдаление(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

УдалитьОплатаНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьОплатаНаСервере()
НачатьТранзакцию();

СтрокаОплаты = Объект.СчетаДетальноОплаты.НайтиПоИдентификатору(Элементы.СчетаДетальноОплаты.ТекущаяСтрока);
ЗаявкаСервер.УдалитьСтрокаОплатыНаСервере(СтрокаОплаты, Объект);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры
// - Удалить
//// - СчетаДетальноОплаты



////// + Кнопки оплаты

////// + Наличные

// + Чек Счет
&НаКлиенте
Процедура ЧекСчет_1(Команда)
ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

Контрагент = ТекущиеДанные.Контрагент; 

Если КлиентыСервер.ЭтоЮрЛицо(Контрагент) Тогда 	
	ПоказатьПредупреждение(,"Счет выписан на юр. лицо"	
		+ Символы.ПС + Символы.ПС + "ОПЛАТА НАЛИЧНЫМИ НЕ РАЗРЕШЕНА ...");		
		
	Возврат;
КонецЕсли;

Если ЗначениеЗаполнено(ТекущиеДанные.ГрупповойСчет) Тогда 
	ПоказатьПредупреждение(, "Групповой Счет
							|
							|ПРЯМАЯ ОПЛАТА НЕ РАЗРЕШЕНА ...");
	
	ЭтаФорма.Модифицированность = Ложь;
	Возврат;
КонецЕсли;       

Если ТекущиеДанные.ЭтоПредварительныйГрупповойСчет Тогда 	
	ПоказатьПредупреждение(,"Предварительный счет для группового счета"	
		+ Символы.ПС + Символы.ПС + "ПРЯМАЯ ОПЛАТА НЕ РАЗРЕШЕНА ...");		
		
	Возврат;
КонецЕсли;

Счет = Объект.Счета.НайтиПоИдентификатору(Элементы.Счета.ТекущаяСтрока);

Если ОплатыОбщееСервер.ЕстьОстаткиОплатКассаКонтрагент(Контрагент) Тогда
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Счет", Счет);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВопрос_ЕстьКассовыеОстаткиОплат", ЭтаФорма, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, "Есть кассовые остатки оплат для контрагента
										|
										|ПРОДОЛЖИТЬ ФОРМИРОВАНИЕ ЧЕКА ?"
					, РежимДиалогаВопрос.ОКОтмена);
						
	Возврат;				
КонецЕсли;

ЧекСчетДействие(Счет);
КонецПроцедуры


&НаКлиенте
Процедура ЧекСчет(Команда)
ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

Контрагент = ТекущиеДанные.Контрагент; 

Если КлиентыСервер.ЭтоЮрЛицо(Контрагент) Тогда 
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВопрос_ОплатуНаличнымиРазрешить", ЭтаФорма);
	ПоказатьВопрос(Оповещение,"ВНИМАНИЕ ! Счет выписан на юр. лицо"	
		+ Символы.ПС + Символы.ПС + "РАЗРЕШИТЬ ОПЛАТУ ...", РежимДиалогаВопрос.ОКОтмена);		
		
	Возврат;
КонецЕсли;

ЧекСчетПродолжить();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопрос_ОплатуНаличнымиРазрешить(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
	
ЧекСчетПродолжить();
КонецПроцедуры


&НаКлиенте
Процедура ЧекСчетПродолжить()
ТекущиеДанные = Элементы.Счета.ТекущиеДанные;
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

Контрагент = ТекущиеДанные.Контрагент; 

//Если КлиентыСервер.ЭтоЮрЛицо(Контрагент) Тогда 	
//	ПоказатьПредупреждение(,"Счет выписан на юр. лицо"	
//		+ Символы.ПС + Символы.ПС + "ОПЛАТА НАЛИЧНЫМИ НЕ РАЗРЕШЕНА ...");		
//		
//	Возврат;
//КонецЕсли;

Если ЗначениеЗаполнено(ТекущиеДанные.ГрупповойСчет) Тогда 
	ПоказатьПредупреждение(, "Групповой Счет
							|
							|ПРЯМАЯ ОПЛАТА НЕ РАЗРЕШЕНА ...");
	
	ЭтаФорма.Модифицированность = Ложь;
	Возврат;
КонецЕсли;       

Если ТекущиеДанные.ЭтоПредварительныйГрупповойСчет Тогда 	
	ПоказатьПредупреждение(,"Предварительный счет для группового счета"	
		+ Символы.ПС + Символы.ПС + "ПРЯМАЯ ОПЛАТА НЕ РАЗРЕШЕНА ...");		
		
	Возврат;
КонецЕсли;

Счет = Объект.Счета.НайтиПоИдентификатору(Элементы.Счета.ТекущаяСтрока);

Если ОплатыОбщееСервер.ЕстьОстаткиОплатКассаКонтрагент(Контрагент) Тогда
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Счет", Счет);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВопрос_ЕстьКассовыеОстаткиОплат", ЭтаФорма, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, "Есть кассовые остатки оплат для контрагента
										|
										|ПРОДОЛЖИТЬ ФОРМИРОВАНИЕ ЧЕКА ?"
					, РежимДиалогаВопрос.ОКОтмена);
						
	Возврат;				
КонецЕсли;

ЧекСчетДействие(Счет);
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьВопрос_ЕстьКассовыеОстаткиОплат(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
	
ЧекСчетДействие(ДополнительныеПараметры.Счет);
КонецПроцедуры

&НаКлиенте
Процедура ЧекСчетДействие(Счет)
Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;

ДопПараметры = Новый Структура;
ДопПараметры.Вставить("Счет", Счет);

ДопПараметры.Вставить("ДокументДолгОбъектДанные", Объект);  

ДопПараметрыОповещения = Новый Структура;
ОповещениеЗавершениеЧекОплаты = Новый ОписаниеОповещения("ОповещениеЗавершениеЧекОплаты", ЭтаФорма, ДопПараметрыОповещения);
ДопПараметры.Вставить("ОповещениеЗавершениеЧек", ОповещениеЗавершениеЧекОплаты);

ОплатыЧекКлиент.ЧекОплаты(ДопПараметры, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗавершениеЧекОплаты(Результат, ДополнительныеПараметры) Экспорт
//////Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
//ЭтотОбъектЗаписатьНаКлиенте();

ЭтаФорма.Прочитать();
КонецПроцедуры	
// - Чек Счет

// + Чек Оплата
&НаКлиенте
Процедура ЧекОплаты(Команда)
Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;	

СчетаКоличество	= Объект.Счета.Количество();	
Если СчетаКоличество = 0 Тогда 
	ПоказатьПредупреждение(,"Не выписано ни одного счета." 
		+ Символы.ПС + Символы.ПС + "Операция НЕ возможна");		
		
	Возврат;
ИначеЕсли СчетаКоличество > 1 Тогда 
	ПоказатьПредупреждение(,"Количество счетов > 1"	
		+ Символы.ПС + Символы.ПС + "Отбитие чека осуществляется из формы счета,
									|либо на закладке 'Счета'");		
		
	Возврат;
ИначеЕсли КлиентыСервер.ЭтоЮрЛицо(Объект.Счета[0].Контрагент) Тогда 	
	ПоказатьПредупреждение(,"Счет выписан на юр. лицо"	
		+ Символы.ПС + Символы.ПС + "Операция НЕ возможна");		
		
	Возврат;
КонецЕсли;  

Счет = Объект.Счета[0];
ЧекСчетДействие(Счет);
КонецПроцедуры
// - Чек Оплата

//// + Чек Аванс
&НаКлиенте
Процедура ЧекАванс(Команда)
Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;	

КонтрагентыСписокЗначений = Новый СписокЗначений;

Если НЕ ЗначениеЗаполнено(Объект.Оплачивает) Тогда
	КонтрагентыСписокЗначений.Добавить(Объект.Клиент);
	Если Объект.РазделитьСчет И ЗначениеЗаполнено(Объект.Клиент2) Тогда 
		КонтрагентыСписокЗначений.Добавить(Объект.Клиент2);
	КонецЕсли;
Иначе	
	ЭтоЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Объект.Оплачивает);
	Если НЕ ЭтоЮрЛицо Тогда 
		КонтрагентыСписокЗначений.Добавить(Объект.Оплачивает);
	КонецЕсли;
	Если Объект.РазделитьСчет И ЗначениеЗаполнено(Объект.Клиент2) Тогда 
		Если КонтрагентыСписокЗначений.НайтиПоЗначению(Объект.Клиент) = Неопределено Тогда 
			КонтрагентыСписокЗначений.Добавить(Объект.Клиент);
		КонецЕсли;
		Если КонтрагентыСписокЗначений.НайтиПоЗначению(Объект.Клиент2) = Неопределено Тогда 
			КонтрагентыСписокЗначений.Добавить(Объект.Клиент2);
		КонецЕсли;
	Иначе
		Если КонтрагентыСписокЗначений.НайтиПоЗначению(Объект.Клиент) = Неопределено Тогда 
			КонтрагентыСписокЗначений.Добавить(Объект.Клиент);
		КонецЕсли;
	КонецЕсли;
КонецЕсли;

ДопПараметры = Новый Структура;
ДопПараметры.Вставить("КонтрагентыСписокЗначений", КонтрагентыСписокЗначений);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормаЧекАвансПараметры", ЭтаФорма);

ОткрытьФорму("ОбщаяФорма.ЧекАвансПараметры", ДопПараметры, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормаЧекАвансПараметры(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

СуммаАванса = Результат.СуммаАванса; 
Если СуммаАванса <= 0 Тогда Возврат; КонецЕсли;

ДопПараметры = Новый Структура;
ДопПараметры.Вставить("ЭтоГрупповойСчет", Ложь);
ДопПараметры.Вставить("ЭтоСчетКоворкинг", Ложь);
ДопПараметры.Вставить("ЭтоСчетНаОплату", Ложь);

ДопПараметры.Вставить("ЭтоЧекНаАванс", Истина);
ДопПараметры.Вставить("ЭтоАванс", Истина);

ДопПараметры.Вставить("Контрагент", Результат.Контрагент);
ДопПараметры.Вставить("ДокументДолгОбъектДанные", Объект);  

ДопПараметры.Вставить("СчетаДетальноОплаты", Объект.СчетаДетальноОплаты);  
ДопПараметры.Вставить("СчетаДетальноДолги", Объект.СчетаДетальноДолги);  
ДопПараметры.Вставить("РаспределениеОплатДолги", Объект.РаспределениеОплатДолги);  
ДопПараметры.Вставить("Счета", Объект.Счета);  

ДопПараметры.Вставить("СуммаОплаты", СуммаАванса);
ДопПараметры.Вставить("СуммаКОплате", СуммаАванса);

ОповещениеДопПараметры = Новый Структура;
ОповещениеЗавершениеЧекАванс = Новый ОписаниеОповещения("ОповещениеЗавершениеЧекАванс", ЭтаФорма, ОповещениеДопПараметры);
ДопПараметры.Вставить("ОповещениеЗавершениеЧек", ОповещениеЗавершениеЧекАванс);

ДопПараметры.Вставить("Форма", ЭтаФорма);

ОплатыЧекКлиент.ОткрытьФормуЧек(ДопПараметры);	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗавершениеЧекАванс(Результат, ДополнительныеПараметры) Экспорт
//ЭтотОбъектЗаписатьНаКлиенте();

ЭтаФорма.Прочитать();
КонецПроцедуры	
//// - Чек Аванс
 

//// + Чек Возврат
&НаКлиенте
Процедура ВозвратОплаты(Команда)
Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;	

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ЧекВозврат", ЭтаФорма);

ПараметрыФормы = Новый Структура(); 

СписокЗначенийКонтрагенты = Новый СписокЗначений;
СписокЗначенийКонтрагенты.Добавить(Объект.Клиент);
Если ЗначениеЗаполнено(Объект.Клиент2) Тогда СписокЗначенийКонтрагенты.Добавить(Объект.Клиент2); КонецЕсли;
	
Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда
	Если Объект.Оплачивает <> Объект.Клиент И Объект.Оплачивает <> Объект.Клиент2 Тогда
		ТипКлиентаОплачивает = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Оплачивает, "ТипКлиента");
		Если ТипКлиентаОплачивает = ПредопределенноеЗначение("Перечисление.ТипыКлиентов.ФизЛицо") 
		Тогда СписокЗначенийКонтрагенты.Добавить(Объект.Оплачивает); КонецЕсли;	
	КонецЕсли;	
КонецЕсли;	

ПараметрыФормы.Вставить("КонтрагентыОтбор", СписокЗначенийКонтрагенты);

ПараметрыФормы.Вставить("ДокументДолг", Объект.Ссылка);

ОткрытьФорму("ОбщаяФорма.ЧекВозврат", ПараметрыФормы, ЭтаФорма
	,,,,Оповещение , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_ЧекВозврат(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли; 	

ОчиститьСообщения();  

ФУ_Клиент.ПоказатьПодтверждениеСообщение(Результат);

ЭтаФорма.Прочитать();
КонецПроцедуры
//// - Чек Возврат

// + Копия Чека;
&НаКлиенте
Процедура КопияЧека(Команда)
Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_КассовыйДокументФормаВыбораИзКопияЧека", ЭтаФорма);

ДокументыОплатыОтбор = Новый СписокЗначений;
Для Каждого Строка Из Объект.СчетаДетальноОплаты Цикл
	Если Строка.ГрупповаяОплата Тогда Продолжить; КонецЕсли;
	Если ТипЗнч(Строка.ДокументОплаты) <> Тип("ДокументСсылка.КассовыйДокумент") Тогда Продолжить; КонецЕсли;
	
	ДокументыОплатыОтбор.Добавить(Строка.ДокументОплаты);
КонецЦикла;
	
ПараметрыФормы = Новый Структура("ДокументыОплатыОтбор", ДокументыОплатыОтбор);

ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаВыбораКопияЧек", ПараметрыФормы, ЭтаФорма
	,,,,Оповещение , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_КассовыйДокументФормаВыбораИзКопияЧека(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда	Возврат; КонецЕсли;

Текст = ПолучитьТекстКопииЧека(Результат);
ФУ_Клиент.ВыполнитьПечатьТекста(ЭтаФорма, Текст);
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстКопииЧека(КассовыйДокумент) 
Строка = "";

Организация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
НаименованиеДляФУ = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Организация, "НаименованиеДляФУ");
Строка = Строка + НаименованиеДляФУ;

Пока СтрДлина(Строка)<32 цикл
Строка=" " + Строка + " ";
конеццикла;

СуммаЧека=0;
Позиция = Неопределено;
КассовыйДокументЧекККМДетально = 
	ОбщийФункционалСервер.ТабличнаяЧастьДокументаВМассивСтруктур(КассовыйДокумент, "ЧекККМДетально");
Для Каждого Позиция Из КассовыйДокументЧекККМДетально Цикл
	Строка = Строка + Символы.ПС + "-------------------------------";
    Строка = Строка + Символы.ПС + Позиция.Наименование;
	
	СтрСумма=Формат(Позиция.Сумма, "ЧДЦ=2; ЧГ=");
	Пока СтрДлина(СтрСумма)<32 цикл
		СтрСумма=" "+СтрСумма;
	конеццикла;
	
	Строка = Строка + Символы.ПС + СтрСумма;
	
    СуммаЧека=СуммаЧека + Позиция.Сумма;
КонецЦикла;

СтрСумма="ИТОГ "+Формат(СуммаЧека, "ЧДЦ=2; ЧГ=");
	Пока СтрДлина(СтрСумма)<32 цикл
		СтрСумма=" "+СтрСумма;
	конеццикла;
	
Строка = Строка + Символы.ПС + СтрСумма;
Строка = Строка + Символы.ПС + "-------------------------------";

ДокОснДата = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(КассовыйДокумент, "Дата");

Строка = Строка + Символы.ПС + Формат(ДокОснДата, "ДФ=dd.MM.yy");

Строка = Строка + Символы.ПС + "КОПИЯ ЧЕКА";
			
Возврат Строка;
КонецФункции 
// - Копия Чека;

//// + Добавить Касса 

// + Добавить Касса Остатки Оплаты
&НаКлиенте
Процедура ДобавитьОплатаКассаОстатки(Команда)
ОткрытьФормаВыбораОстаткиОплаты(Неопределено, Ложь, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОплатаКассаОтмененные(Команда)
ОткрытьФормаВыбораОстаткиОплаты(Объект.Ссылка, Ложь, Неопределено);
КонецПроцедуры
// - Добавить Касса Остатки Оплаты

// + Добавить Касса Остатки Оплаты Счет
&НаКлиенте
Процедура ОплатаКассаОтмененныеСчет(Команда)
ТС = Элементы.Счета.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ОткрытьФормаВыбораОстаткиОплаты(Объект.Ссылка, Ложь, ТС);
КонецПроцедуры

&НаКлиенте
Процедура ОплатаКассаПрочиеОстаткиСчет(Команда)
ТС = Элементы.Счета.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ОткрытьФормаВыбораОстаткиОплаты(Неопределено, Истина, ТС);
КонецПроцедуры
// - Добавить Касса Остатки Оплаты Счет

// + Добавить отменененные
&НаКлиенте
Процедура ОткрытьФормаВыбораОстаткиОплаты(ОтмененныйДокументДолг, ОплатаОтВсехКонтрагентов, СчетаТекущаяСтрока)
Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;	
	
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);

Результат = ПолучитьДанныеКОплате_Выбор(СчетаТекущаяСтрока);

Если ОплатаОтВсехКонтрагентов Тогда
	СписокКонтрагентов = Новый СписокЗначений;
Иначе
	СписокКонтрагентов = Результат.СписокКонтрагентов;
	Если СписокКонтрагентов.Количество() = 0 Тогда ЭтаФорма.Модифицированность = Ложь; Возврат; КонецЕсли; 
КонецЕсли;
ПараметрыФормы.Вставить("СписокКонтрагентов", СписокКонтрагентов);

ПараметрыФормы.Вставить("ОтмененныйДокументДолг", ОтмененныйДокументДолг);

СуммаКОплате = Результат.СуммаКЗакрытию; 
Если СуммаКОплате = 0 Тогда ЭтаФорма.Модифицированность = Ложь; Возврат; КонецЕсли; 
ПараметрыФормы.Вставить("СуммаКОплате", СуммаКОплате);

ДопПараметры = Новый Структура;

Если СчетаТекущаяСтрока = Неопределено Тогда
	СчетГУИД = Неопределено;
Иначе
	ТД = Объект.Счета.НайтиПоИдентификатору(СчетаТекущаяСтрока);
	СчетГУИД = ТД.СчетГУИД;
КонецЕсли;
ДопПараметры.Вставить("СчетГУИД", СчетГУИД);

ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытиеФормы_ФормаВыбораОплатыОстатки", ЭтаФорма, ДопПараметры);
	
ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаВыбораОстаткиОплаты", ПараметрыФормы, ЭтаФорма 
	,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКОплате_Выбор(СчетаТекущаяСтрока)
ТЗ = Новый ТаблицаЗначений;	
ТЗ.Колонки.Добавить("Контрагент");

Если СчетаТекущаяСтрока = Неопределено Тогда 
	Счета = Объект.Счета;
Иначе
	Счета = Новый Массив;
	Счет = Объект.Счета.НайтиПоИдентификатору(СчетаТекущаяСтрока);
	Счета.Добавить(Счет);
КонецЕсли;

СуммаКЗакрытию = 0;
//Для Каждого Счет Из Объект.Счета Цикл
Для Каждого Счет Из Счета Цикл
	Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;
	Если Счет.ЭтоПредварительныйГрупповойСчет Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Контрагент = Счет.Контрагент;
	
	ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
	НайденныеСтроки = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);

	Для Каждого НайденнаяСтрока	Из НайденныеСтроки Цикл 
		СуммаКЗакрытию = СуммаКЗакрытию + НайденнаяСтрока.СуммаКЗакрытию;	
	КонецЦикла;	
КонецЦикла;	

ТЗ.Свернуть("Контрагент");

СписокКонтрагентов = Новый СписокЗначений;
Для Каждого Строка Из ТЗ Цикл
	СписокКонтрагентов.Добавить(Строка.Контрагент);	
КонецЦикла;

Результат = Новый Структура("СписокКонтрагентов, СуммаКЗакрытию", СписокКонтрагентов, СуммаКЗакрытию); 
Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура ЗакрытиеФормы_ФормаВыбораОплатыОстатки(Результат, ДополнительныеПараметры) Экспорт
Если НЕ ЗначениеЗаполнено(Результат) Тогда Возврат; КонецЕсли;

ДобавитьОплатаКассаНаСервере(Результат, ДополнительныеПараметры);

//ОбновитьИсториюОплат();
//ОбновитьСумму();
КонецПроцедуры

&НаСервере
Процедура ДобавитьОплатаКассаНаСервере(ДокументОплаты, ДополнительныеПараметры)
НачатьТранзакцию();

ОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределениюКасса(ДокументОплаты, Объект);

СтрокаОплаты = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(Объект.СчетаДетальноОплаты, ДокументОплаты, Ложь); 

Если ДополнительныеПараметры.СчетГУИД = Неопределено Тогда
	Контрагент = СтрокаОплаты.ДокументОплаты.ОтКого;	
	ОтборСтроки = Новый Структура("Контрагент", Контрагент);
	СчетаКоплате = Объект.Счета.НайтиСтроки(ОтборСтроки);
Иначе	
	СчетаКоплате = Новый Массив;
	ОтборСтроки = Новый Структура("СчетГУИД", ДополнительныеПараметры.СчетГУИД);
	НайденныеСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);
	СчетаКоплате.Добавить(НайденныеСтроки[0]);
КонецЕсли;

Для Каждого Счет Из СчетаКоплате Цикл
	Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;
	Если Счет.ЭтоПредварительныйГрупповойСчет Тогда Продолжить; КонецЕсли;
	
	РаспределитьСтрокаОплатыНаСчет(СтрокаОплаты, ОстатокКРаспределению, Счет.СчетГУИД); 
	
	//Строка.Закрыт = ОбщийМодульОплатыСервер.СчетЗакрыт(СчетаДетальноДолги, Строка.СчетГУИД);
	
	Если ОстатокКРаспределению = 0 Тогда Прервать; КонецЕсли;	
КонецЦикла;	

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры
// - Добавить отменененные
//// - Добавить Касса 


////// - Наличные


//// + Безнал

// + Безнал Оплата добавить
&НаКлиенте
Процедура ДобавитьОплатаБезнал(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;
	
ПараметрыФормы = Новый Структура();

Если НЕ ЗначениеЗаполнено(Объект.Оплачивает) Тогда 
	ПоказатьПредупреждение(, "Оплачивает - пусто ...");
	
	Возврат; 
КонецЕсли;
	
СписокКонтрагентыЗаявка = Новый СписокЗначений;
СписокКонтрагентыЗаявка.Добавить(Объект.Оплачивает);

ПараметрыФормы.Вставить("ОтКого", СписокКонтрагентыЗаявка);
ПараметрыФормы.Вставить("КонтрагентТолькоПросмотр", Истина);

СуммаКЗакрытию = 0;
Для Каждого Счет Из Объект.Счета Цикл
	Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;
	Если Счет.ЭтоПредварительныйГрупповойСчет Тогда Продолжить; КонецЕсли;
	
	Если Счет.Контрагент <> Объект.Оплачивает Тогда Продолжить; КонецЕсли;
	
	ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
	СчетаДетальноДолги = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);	
	Для Каждого СтрокаДолг Из СчетаДетальноДолги Цикл
		СуммаКЗакрытию = СуммаКЗакрытию + СтрокаДолг.СуммаКЗакрытию;	
	КонецЦикла;
КонецЦикла;
СуммаКОплатеЗаявка = СуммаКЗакрытию;

Если СуммаКОплатеЗаявка <= 0 Тогда ЭтаФорма.Модифицированность = Ложь; Возврат; КонецЕсли;
ПараметрыФормы.Вставить("СуммаКОплате", СуммаКОплатеЗаявка);

ДопПараметры = Новый Структура();
ДопПараметры.Вставить("СуммаКОплатеЗаявка", СуммаКОплатеЗаявка);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормаВыбораОплата_ОплатаБезнал", ЭтаФорма, ДопПараметры);
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаВыбораОплата", ПараметрыФормы , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы .БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормаВыбораОплата_ОплатаБезнал(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

ДокументОплаты = Результат;
СуммаКОплатеЗаявка = ДополнительныеПараметры.СуммаКОплатеЗаявка;

ДобавитьОплатаБезналНаСервере_ОплатаБезнал(ДокументОплаты, СуммаКОплатеЗаявка);

ЭтаФорма.Прочитать();
//ОбновитьИсториюОплат();
//ОбновитьСумму();
Конецпроцедуры

&НаСервере
Процедура ДобавитьОплатаБезналНаСервере_ОплатаБезнал(ДокументОплаты, СуммаКОплатеЗаявка) Экспорт
НачатьТранзакцию();	
	
СуммаКРаспределению = ДокументОплаты.Сумма - ДокументОплаты.ДолгиОплата.Итог("Сумма");

Если СуммаКРаспределению > СуммаКОплатеЗаявка Тогда
	СуммаОплаты = СуммаКОплатеЗаявка;
Иначе
	СуммаОплаты = СуммаКРаспределению;
КонецЕсли;

СтрокаОплата = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(Объект.СчетаДетальноОплаты, ДокументОплаты, Ложь);  

ОтборСтроки = Новый Структура("Контрагент", ДокументОплаты.ОтКого);
НайденныеСчета = Объект.Счета.НайтиСтроки(ОтборСтроки);

Для Каждого Счет Из НайденныеСчета Цикл
	Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;
	Если Счет.ЭтоПредварительныйГрупповойСчет Тогда Продолжить; КонецЕсли;
	
	РаспределитьСтрокаОплатыНаСчет(СтрокаОплата, СуммаОплаты, Счет.СчетГУИД);
	
	Если СуммаОплаты = 0 Тогда Прервать; КонецЕсли;
КонецЦикла;

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();	
КонецПроцедуры
// - Безнал Оплата добавить


// + Безнал Счет добавить
&НаКлиенте
Процедура БезналСчет(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;
	
ТС = Элементы.Счета.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;	

ТД = Объект.Счета.НайтиПоИдентификатору(ТС);

//Если НЕ КлиентыСервер.ЭтоЮрЛицо(ТД.Контрагент) Тогда 	
//	ПоказатьПредупреждение(,"Счет выписан на Физ. лицо"	
//		+ Символы.ПС + Символы.ПС + "ОПЛАТА БЕЗНАЛОМ НЕ РАЗРЕШЕНА ...");		
//		
//	ЭтаФорма.Модифицированность = Ложь;    
//	Возврат;
//КонецЕсли;

Если ЗначениеЗаполнено(ТД.ГрупповойСчет) Тогда 
	ПоказатьПредупреждение(, "Групповой Счет
							|
							|ПРЯМАЯ ОПЛАТА НЕ РАЗРЕШЕНА ...");
	
	ЭтаФорма.Модифицированность = Ложь;
	Возврат;
КонецЕсли;

Если ТД.ЭтоПредварительныйГрупповойСчет Тогда 
	ПоказатьПредупреждение(, "Предварительный Групповой Счет
							|
							|ПРЯМАЯ ОПЛАТА НЕ РАЗРЕШЕНА ...");
	
	ЭтаФорма.Модифицированность = Ложь;
	Возврат;
КонецЕсли;

Контрагент = ТД.Контрагент;

ПараметрыФормы = Новый Структура();

СписокКонтрагентыЗаявка = Новый СписокЗначений; 
СписокКонтрагентыЗаявка.Добавить(Контрагент);
ПараметрыФормы.Вставить("ОтКого", СписокКонтрагентыЗаявка);

ПараметрыФормы.Вставить("КонтрагентТолькоПросмотр", Ложь);

СуммаКЗакрытию = 0;
ОтборСтроки = Новый Структура("СчетГУИД", ТД.СчетГУИД);
СчетаДетальноДолги = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);	
Для Каждого СтрокаДолг Из СчетаДетальноДолги Цикл
	СуммаКЗакрытию = СуммаКЗакрытию + СтрокаДолг.СуммаКЗакрытию;	
КонецЦикла;
СуммаКОплатеСчет = СуммаКЗакрытию;

Если СуммаКОплатеСчет <= 0 Тогда ЭтаФорма.Модифицированность = Ложь; Возврат; КонецЕсли;

ПараметрыФормы.Вставить("СуммаКОплате", СуммаКОплатеСчет);

ДопПараметры = Новый Структура();
ДопПараметры.Вставить("СуммаКОплатеСчет", СуммаКОплатеСчет);
ДопПараметры.Вставить("СчетГУИД", ТД.СчетГУИД);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормаВыбораОплата_БезналСчет", ЭтаФорма, ДопПараметры);
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаВыбораОплата", ПараметрыФормы , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы .БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормаВыбораОплата_БезналСчет(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

ДокументОплаты = Результат;
СуммаКОплатеСчет = ДополнительныеПараметры.СуммаКОплатеСчет; 
СчетГУИД = ДополнительныеПараметры.СчетГУИД; 

ДобавитьОплатаБезналНаСервере_БезналСчет(ДокументОплаты, СчетГУИД, СуммаКОплатеСчет);

ЭтаФорма.Прочитать();
//ОбновитьИсториюОплат();
//ОбновитьСумму();
Конецпроцедуры

&НаСервере
Процедура ДобавитьОплатаБезналНаСервере_БезналСчет(ДокументОплаты, СчетГУИД, СуммаКОплате) Экспорт
НачатьТранзакцию();	

ОстатокКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределениюВыписка(ДокументОплаты, Объект);

Если СуммаКОплате > ОстатокКРаспределению Тогда
	СуммаОплаты = ОстатокКРаспределению;
Иначе
	СуммаОплаты = СуммаКОплате;
КонецЕсли;  

СтрокаОплаты = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(Объект.СчетаДетальноОплаты, ДокументОплаты, Ложь);

РаспределитьСтрокаОплатыНаСчет(СтрокаОплаты, СуммаОплаты, СчетГУИД);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();	
КонецПроцедуры
// - Безнал Счет добавить

//// - Безнал
////// + Кнопки оплаты

/////

//
&НаКлиенте
Асинх Процедура ДобавитьСписаниеОплата(Команда)
Ответ = ПроверкаВозможностиСписания();
	
Если Ответ.Ошибка Тогда Возврат; КонецЕсли;	

СуммаКСписанию_П = Ответ.СуммаКСписанию;
Обещание = ВвестиЧислоАсинх(СуммаКСписанию_П, "Сумма к списанию");
Результат = Ждать Обещание;

Если Результат = Неопределено Тогда Возврат; КонецЕсли;

Если Результат > Ответ.СуммаКСписанию Тогда  
	ПоказатьПредупреждение(, "Сумма к списанию должна быть меньше либо равна " + Ответ.СуммаКСписанию);
	
	Возврат;	
КонецЕсли;

Если Результат <= 0  Тогда  
	ПоказатьПредупреждение(, "Сумма к списанию должна быть больше 0. ");
	
	Возврат;	
КонецЕсли;

ДобавитьСписаниеОплатаНаСервере(Результат);
КонецПроцедуры

&НаКлиенте
Функция ПроверкаВозможностиСписания()
Ответ = Новый Структура("Ошибка, СуммаКСписанию", Ложь, 0); 

Разрешение = НастройкиСервер.ЭтоАдмин() ИЛИ НастройкиСервер.ЭтоАдминистратор();
Если НЕ Разрешение Тогда 
	ПоказатьПредупреждение(, "Вы не являетесь администратором программы.
							|
							|СПИСАНИЕ ДОЛГА НЕ РАЗРЕШЕНО ...");
	
	Ответ.Ошибка = Истина; Возврат Ответ; 
КонецЕсли;

Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) 
Тогда Ответ.Ошибка = Истина; Возврат Ответ; КонецЕсли;


//
СуммаПроживания = Объект.Проживание.Итог("Сумма");

ОтборСтроки = Новый Структура("Услуга", Ложь);
НайденныеСтроки = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
СуммаПроживаниеСчета = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	СуммаПроживаниеСчета = СуммаПроживаниеСчета + Строка.СуммаДолг;
КонецЦикла;

ТекстОшибки = Новый Массив;
Если СуммаПроживания <> СуммаПроживаниеСчета Тогда
	ТекстОшибки.Добавить("Сумма за проживание <> Сумме за проживание в счетах. ");
КонецЕсли;

ОтборСтроки = Новый Структура("ВСчет", Истина);
НайденныеСтроки = Объект.ДопУслуги.НайтиСтроки(ОтборСтроки);
СуммаУслуги = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	СуммаУслуги = СуммаУслуги + Строка.Количество * Строка.Цена;
КонецЦикла;

ОтборСтроки = Новый Структура("Услуга", Истина);
НайденныеСтроки = Объект.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки);
СуммаУслугиСчета = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	СуммаУслугиСчета = СуммаУслугиСчета + Строка.СуммаДолг;
КонецЦикла;

Если СуммаУслуги <> СуммаУслугиСчета Тогда
	ТекстОшибки.Добавить("Сумма за услуги <> Сумме за услуги в счетах. ");
КонецЕсли;

Если ТекстОшибки.Количество() > 0 Тогда
	ТекстОшибки.Добавить("");
	ТекстОшибки.Добавить("ИСПРАВЬТЕ СЧЕТА ...");
	
	Текст = ОбщийФункционалКлиент.ТекстПредупрежденияИзМассив(ТекстОшибки);
	ПоказатьПредупреждение(, Текст);
	
	Текст = ОбщийФункционалКлиентСервер.ТекстСообщенияИзМассив(ТекстОшибки);
	Сообщить(Текст);
	
	Ответ.Ошибка = Истина; Возврат Ответ; 
КонецЕсли;
//

СуммаКСписанию = СуммаКСписанию();	
Если СуммаКСписанию = 0 Тогда 
	ПоказатьПредупреждение(,"Нечего списывать ...");
	
	Ответ.Ошибка = Истина; Возврат Ответ; 
КонецЕсли;
	
Ответ.СуммаКСписанию = СуммаКСписанию; Возврат Ответ;	
КонецФункции

&НаСервере
Функция СуммаКСписанию()
СуммаДолг = Объект.СчетаДетальноДолги.Итог("СуммаКЗакрытию");  	
ОстатокДолга = СуммаДолг; 

Если ОстатокДолга < 0 Тогда ОстатокДолга = 0; КонецЕсли; 

Возврат ОстатокДолга;
КонецФункции

&НаСервере
Процедура ДобавитьСписаниеОплатаНаСервере(СуммаОплаты)
НачатьТранзакцию();

ВидОперации = Справочники.ВидыОпераций.Списание;
ДокументОплаты = СоздатьПрочиеОплатыСписание(СуммаОплаты, ВидОперации);

СтрокаОплата = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(Объект.СчетаДетальноОплаты, ДокументОплаты, Ложь);  

Для Каждого Счет Из Объект.Счета Цикл
	//Если ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда Продолжить; КонецЕсли;
	//Если Счет.ЭтоПредварительныйГрупповойСчет Тогда Продолжить; КонецЕсли;
	
	РаспределитьСтрокаОплатыНаСчет(СтрокаОплата, СуммаОплаты, Счет.СчетГУИД);
	
	Если СуммаОплаты = 0 Тогда Прервать; КонецЕсли;
КонецЦикла;

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДобавитьСписаниеЗачетПроживаниеУслуги(Команда)
Ответ = ПроверкаВозможностиСписания();
Если Ответ.Ошибка Тогда Возврат; КонецЕсли;	

СуммаКСписаниюПроживание = СуммаКСписаниюПроживаниеУслуга(Ложь); 
СуммаКСписаниюУслуги = СуммаКСписаниюПроживаниеУслуга(Истина); 

ДобавитьСписаниеЗачетПроживаниеУслугиНаСервере(СуммаКСписаниюПроживание, СуммаКСписаниюУслуги);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСписаниеЗачетПроживание(Команда)
Ответ = ПроверкаВозможностиСписания();
	
Если Ответ.Ошибка Тогда Возврат; КонецЕсли;	
	
СуммаКСписанию = СуммаКСписаниюПроживаниеУслуга(Ложь); 
Если СуммаКСписанию = 0 Тогда 
	ПоказатьПредупреждение(,"Нечего списывать ...");
	
	Возврат; 
КонецЕсли;

ДобавитьСписаниеЗачетПроживаниеУслугиНаСервере(СуммаКСписанию, 0);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСписаниеЗачетУслуги(Команда)
Ответ = ПроверкаВозможностиСписания();
	
Если Ответ.Ошибка Тогда Возврат; КонецЕсли;	
	
СуммаКСписанию = СуммаКСписаниюПроживаниеУслуга(Истина); 
Если СуммаКСписанию = 0 Тогда 
	ПоказатьПредупреждение(,"Нечего списывать ...");
	
	Возврат; 
КонецЕсли;

ДобавитьСписаниеЗачетПроживаниеУслугиНаСервере(0, СуммаКСписанию);
КонецПроцедуры

&НаСервере                        
Процедура ДобавитьСписаниеЗачетПроживаниеУслугиНаСервере(СуммаКСписаниюПроживание, СуммаКСписаниюУслуги)
НачатьТранзакцию();

Если СуммаКСписаниюПроживание > 0 Тогда 
	ДобавитьСписаниеЗачетОплатаПроживаниеУслугиНаСервере(СуммаКСписаниюПроживание, Ложь, Объект);
КонецЕсли;

Если СуммаКСписаниюУслуги > 0 Тогда 
	ДобавитьСписаниеЗачетОплатаПроживаниеУслугиНаСервере(СуммаКСписаниюУслуги, Истина, Объект);
КонецЕсли;

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере                        
Процедура ДобавитьСписаниеЗачетОплатаПроживаниеУслугиНаСервере(СуммаОплаты, Услуга, ДокументДолгОбъект)
//Если Услуга Тогда ВидОперации = Справочники.ВидыОпераций.СписаниеДопУслуг; 
//Иначе ВидОперации = Справочники.ВидыОпераций.СписаниеПроживание; КонецЕсли; 	
ВидОперации = Справочники.ВидыОпераций.СписаниеЗачет;

ДокументОплаты = СоздатьПрочиеОплатыСписание(СуммаОплаты, ВидОперации);

ОстатокКРаспределению = СуммаОплаты;

СтрокаОплата = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(Объект.СчетаДетальноОплаты, ДокументОплаты, Ложь); 

ЗаявкаСервер.РаспределитьСтрокаОплатыСчетаДетальноДолги(СтрокаОплата, ОстатокКРаспределению, ДокументДолгОбъект, Услуга);
КонецПроцедуры


&НаСервере
Процедура ДобавитьСписаниеЗачетНаСервере(СуммаОплаты)
НачатьТранзакцию();
	
ВидОперации = Справочники.ВидыОпераций.СписаниеЗачет; 

ДокументОплаты = СоздатьПрочиеОплатыСписание(СуммаОплаты, ВидОперации);

ОстатокКРаспределению = СуммаОплаты;

СтрокаОплата = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(Объект.СчетаДетальноОплаты, ДокументОплаты, Ложь); 

Услуга = Ложь;
ДокументДолгОбъект = Объект;
ЗаявкаСервер.РаспределитьСтрокаОплатыСчетаДетальноДолги(СтрокаОплата, ОстатокКРаспределению, ДокументДолгОбъект, Услуга);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДобавитьСписаниеПроживаниеУслуги(Команда)
Ответ = ПроверкаВозможностиСписания();
Если Ответ.Ошибка Тогда Возврат; КонецЕсли;	

СуммаКСписаниюПроживание = СуммаКСписаниюПроживаниеУслуга(Ложь); 
СуммаКСписаниюУслуги = СуммаКСписаниюПроживаниеУслуга(Истина); 

Если СуммаКСписаниюПроживание + СуммаКСписаниюУслуги = 0 Тогда 
	ПоказатьПредупреждение(,"Нечего списывать ...");
	
	Возврат; 
КонецЕсли;


ДобавитьСписаниеПроживаниеУслугиНаСервере(СуммаКСписаниюПроживание, СуммаКСписаниюУслуги);
КонецПроцедуры

&НаСервере                        
Процедура ДобавитьСписаниеПроживаниеУслугиНаСервере(СуммаКСписаниюПроживание, СуммаКСписаниюУслуги)
НачатьТранзакцию();

Если СуммаКСписаниюПроживание > 0 Тогда 
	ДобавитьСписаниеОплатаПроживаниеУслугиНаСервере(СуммаКСписаниюПроживание, Ложь, Объект);
КонецЕсли;

Если СуммаКСписаниюУслуги > 0 Тогда 
	ДобавитьСписаниеОплатаПроживаниеУслугиНаСервере(СуммаКСписаниюУслуги, Истина, Объект);
КонецЕсли;

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере                        
Процедура ДобавитьСписаниеОплатаПроживаниеУслугиНаСервере(СуммаОплаты, Услуга, ДокументДолгОбъект)
//Если Услуга Тогда ВидОперации = Справочники.ВидыОпераций.СписаниеДопУслуг; 
//Иначе ВидОперации = Справочники.ВидыОпераций.СписаниеПроживание; КонецЕсли; 	

Если Услуга Тогда ВидОперации = Справочники.ВидыОпераций.СписаниеДопУслуг; 
Иначе ВидОперации = Справочники.ВидыОпераций.Списание; КонецЕсли; 	


ДокументОплаты = СоздатьПрочиеОплатыСписание(СуммаОплаты, ВидОперации);

ОстатокКРаспределению = СуммаОплаты;

СтрокаОплата = ЗаявкаСервер.ДобавитьОплатаСчетаДетальноОплаты(Объект.СчетаДетальноОплаты, ДокументОплаты, Ложь); 

ЗаявкаСервер.РаспределитьСтрокаОплатыСчетаДетальноДолги(СтрокаОплата, ОстатокКРаспределению, ДокументДолгОбъект, Услуга);
КонецПроцедуры
//

&НаКлиенте
Процедура ДобавитьСписаниеПроживание(Команда)
Ответ = ПроверкаВозможностиСписания();
Если Ответ.Ошибка Тогда Возврат; КонецЕсли;	
	
СуммаКСписаниюПроживание = СуммаКСписаниюПроживаниеУслуга(Ложь); 
Если СуммаКСписаниюПроживание = 0 Тогда 
	ПоказатьПредупреждение(,"Нечего списывать ...");
	
	Возврат; 
КонецЕсли;

ДобавитьСписаниеПроживаниеУслугиНаСервере(СуммаКСписаниюПроживание, 0);
КонецПроцедуры

&НаКлиенте                                                                               
Процедура ДобавитьСписаниеУслуги(Команда)
Ответ = ПроверкаВозможностиСписания();
Если Ответ.Ошибка Тогда Возврат; КонецЕсли;	
	
СуммаКСписаниюУслуги = СуммаКСписаниюПроживаниеУслуга(Истина); 
Если СуммаКСписаниюУслуги = 0 Тогда 
	ПоказатьПредупреждение(,"Нечего списывать ...");
	
	Возврат; 
КонецЕсли;

ДобавитьСписаниеПроживаниеУслугиНаСервере(0, СуммаКСписаниюУслуги);
КонецПроцедуры

//
&НаСервере
Функция СуммаКСписаниюПроживаниеУслуга(Услуга)
ОтборСтроки = Новый Структура("Услуга, ГрупповойСчет", Услуга, Ложь);
СчетаДетальноДолги = Объект.СчетаДетальноДолги.Выгрузить(ОтборСтроки);

СуммаДолг = СчетаДетальноДолги.Итог("СуммаКЗакрытию");  	
	
ОстатокДолга = СуммаДолг; 

Если ОстатокДолга < 0 Тогда ОстатокДолга = 0; КонецЕсли; 

Возврат ОстатокДолга;
КонецФункции

&НаСервере
Функция СоздатьПрочиеОплатыСписание(СуммаСписания, ВидОперации)
ДокументОплаты = ОплатыОбщееСервер.СоздатьПрочиеОплатыСписание(Объект.Клиент, Объект.Ссылка, СуммаСписания
	, ВидОперации);

Возврат ДокументОплаты; 
КонецФункции
//

////
&НаКлиенте
Процедура ОтправитьВPayKeeper(Команда)
ОтправитьВPayKeeperДействие();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВPayKeeperДействие()
ТД = Элементы.Счета.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;	

Если ТД.СуммаКЗакрытию <= 0 Тогда 
	ПоказатьПредупреждение(, "Нечего отправлять");
	
	Возврат;
КонецЕсли;

Если ЗначениеЗаполнено(ЭтаФорма.УникальныйИдентификатор) Тогда
	УникальныйИдентификатор_П = ЭтаФорма.УникальныйИдентификатор;		
Иначе
	УникальныйИдентификатор_П = Новый УникальныйИдентификатор();
КонецЕсли;

ДопПараметры = Новый Структура;
ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеФормы_ОтправкаPayKeeper", ЭтотОбъект, ДопПараметры);

ОбъектДанные = Объект;
	
PayKeeperКлиент.ОтправитьВPayKeeperДолг(ОбъектДанные, ТД.СчетГУИД, УникальныйИдентификатор_П
	, ЭтаФорма, ОповещениеОЗавершении);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_ОтправкаPayKeeper(Результат, ДополнительныеПараметры) Экспорт
Ответ = ДополнительныеПараметры.Результат;	
ИД_Платежа = Ответ.ИД_Платежа;

ПоказатьПредупреждение(, "Платеж отправлен в Pay Keeper");
КонецПроцедуры
////

///////

&НаКлиенте
Процедура ПроверитьОплатуPayKeepr(Команда)
ТС = Элементы.Счета.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат;  КонецЕсли;
 
Ответ = PayKeeperКлиентСервер.СписокПлатежейPayKeeper();
Если Ответ.Ошибка Тогда 
	ПоказатьПредупреждение(, Ответ.ОписаниеОшибки); 
	Сообщить(Ответ.ОписаниеОшибки);
	
	Возврат;
КонецЕсли;

СписокПлатежей = Ответ.СписокПлатежей;	

ЕстьОплаты = Ложь;
НомерСчетаPayKeeper = НомерСчетаPayKeeper(ТС);
Для Каждого СтрокаПлатежа Из СписокПлатежей Цикл 
	                      
	Если СтрокаПлатежа.orderid <> НомерСчетаPayKeeper Тогда Продолжить; КонецЕсли; 
	
	Если СтрокаПлатежа.status <> "success" Тогда  Продолжить; КонецЕсли; 
	
	ИД_ПлатежаСтрока = СтрокаПлатежа.id;
	ИД_Платежа = ОбщийФункционалКлиентСервер.ПолучитьЧисло(ИД_ПлатежаСтрока);
	
	СуммаПлатежаСтрока = СтрокаПлатежа.pay_amount;
	СуммаПлатежа = ОбщийФункционалКлиентСервер.ПолучитьЧисло(СуммаПлатежаСтрока);
	
	ПоказатьПредупреждение(, "Успешная оплата счета: " + НомерСчетаPayKeeper + " на сумму: " + Строка(СуммаПлатежа));
	ЕстьОплаты = Истина;

	//Строка = Новый Структура("ИД_платежа, Плательщик, НомерСчета, СуммаПлатежа, Статус"
	//		 , ИД_Платежа, СтрокаПлатежа.clientid, СтрокаПлатежа.orderid, СуммаПлатежа, СтрокаПлатежа.status); 
	//		 
	//ДатаОплатыСтрока = СтрокаПлатежа.success_datetime;
	//Если ЗначениеЗаполнено(ДатаОплатыСтрока) Тогда
	//	//ДатаОплатыСтрока = СтрЗаменить(ДатаОплатыСтрока ,"-" ,".");
	//	ДатаОплаты = ОбщийФункционалКлиентСервер.ПолучитьДату(ДатаОплатыСтрока);
	//Иначе
	//	ДатаОплаты = Неопределено;
	//КонецЕсли;

	//НаборЗаписей = PayKeeperСервер.ОбновитьPayKeeperПлатежи(Строка, Неопределено, ДатаОплаты);
	//
	//СтрокаНабора = НаборЗаписей[0];	
	//	
	//PayKeeperСервер.СвязатьPayKeeperПлатежи(СтрокаНабора.ИД_Платежа);  
КонецЦикла;

Если НЕ ЕстьОплаты Тогда
	ПоказатьПредупреждение(, "Нет оплаты счета: " + НомерСчетаPayKeeper);
КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НомерСчетаPayKeeper(ТС)
ТД = Объект.Счета.НайтиПоИдентификатору(ТС);

//Ответ = PayKeeperСервер.НомерСчета(Объект, ТД.СчетГУИД);
Ответ = PayKeeperСервер.НомерСчета(Объект, ТД);
НомерСчетаPayKeeper = Ответ.НомерСчетаPayKeeper;

Возврат НомерСчетаPayKeeper;
КонецФункции


/////// + Печать ///////

// + Печать Счета
&НаКлиенте
Процедура ПечатьСчета(Команда)
Если Элементы.Счета.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

СчетСтруктура = ТекущийСчетСтруктура(Элементы.Счета.ТекущаяСтрока);
ПечатьКлиент.ПечатьСчетаИПодтверждения(ЭтаФорма, Объект.Ссылка, СчетСтруктура, Истина);
//ПечатьКлиент.ПечатьСчета(ЭтаФорма, ДокументДолгОбъект, СчетСтруктура);
КонецПроцедуры

&НаСервере
Функция ТекущийСчетСтруктура(ТекущаяСтрока)
СчетСтруктура = ЗаявкаСервер.ТекущийСчетСтруктура(ТекущаяСтрока, Объект);

Возврат СчетСтруктура;
КонецФункции	
// - Печать Счета

//
&НаКлиенте
Процедура ПечатьСчетов(Команда)
Если ЭтаФорма.Модифицированность Тогда	
	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;
КонецЕсли;
	
ДокументДолгПараметр = Объект.Ссылка;
НовыйРасчет = ПечатьСервер.ЭтоНовыйРасчет(ДокументДолгПараметр);
Если ПечатьКлиент.ЭтоСтарыйРасчет(НовыйРасчет) Тогда Возврат; КонецЕсли;

Если СчетАнгл Тогда 
	Контрагент = Объект.Клиент; 
	ТабличныйДокумент = ПечатьСервер.ПечатьСчетаНаАнглийском(ДокументДолгПараметр, Ложь, Ложь); 

	ПечатьКлиент.ОткрытьФормуПечатьСчетаИПодтверждения(ЭтаФорма, Объект.Ссылка, Неопределено,Контрагент
		, ТабличныйДокумент, Истина, СчетАнгл);
Иначе	
	
	ДокументДолгОбъект = Объект;
	МассивТабличныхДокументов = ПечатьСчетовНаСервере();

	Для Каждого ТабличныйДокументПараметры Из МассивТабличныхДокументов Цикл 
		Контрагент = ТабличныйДокументПараметры.Контрагент; 
		ТабличныйДокумент = ТабличныйДокументПараметры.ТабличныйДокумент; 
		
		ПечатьКлиент.ОткрытьФормуПечатьСчетаИПодтверждения(ЭтаФорма, Объект.Ссылка, Неопределено, Контрагент
			, ТабличныйДокумент, Ложь, СчетАнгл);
	КонецЦикла;	
КонецЕсли;		
КонецПроцедуры

&НаСервере
Функция ПечатьСчетовНаСервере()
	
//ТабличныйДокумент = Новый ТабличныйДокумент;
МассивТабличныхДокументов = Новый Массив;
НомерДокумента = Объект.Номер; 

Если СчетАнгл Тогда
	//ТолькоУслуги = Ложь; ТолькоПроживание = Ложь;	
	//ТабличныйДокумент = ПечатьСервер.ПечатьСчетаНаАнглийском(Объект, ТолькоУслуги, ТолькоПроживание);
	//
	//ТабличныйДокументПараметры = Новый Структура("Контрагент, ТабличныйДокумент", Объект.Клиент, ТабличныйДокумент); 
	//МассивТабличныхДокументов.Добавить(ТабличныйДокументПараметры);

	Возврат Неопределено;
КонецЕсли;	

СчетаСвернутые = Объект.Счета.Выгрузить();
СчетаСвернутые.Свернуть("Контрагент");

Для Каждого Строка Из СчетаСвернутые Цикл
	ОтборСтроки = Новый Структура("Контрагент", Строка.Контрагент);
	НайденныеСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;

	Для Каждого Счет Из НайденныеСтроки Цикл
		//Если Счет.Закрыт Тогда Продолжить; КонецЕсли; 
		
		СчетаДетальноСтроки = Объект.СчетаДетальноСтроки.Выгрузить(Новый Массив);
		ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
		НайденыеСтроки = Объект.СчетаДетальноСтроки.НайтиСтроки(ОтборСтроки);
		Если НайденыеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		ОбщийФункционалСервер.ДобавитьСтроки(СчетаДетальноСтроки, НайденыеСтроки);
		
		НомерСчетаПараметр = ПечатьСервер.НомерСчетаДляПечати(НомерДокумента, Счет.НомерСчета);

		Результат = ПечатьСервер.ПечатьСчета_Счет(ТабличныйДокумент, Объект.Ссылка, Счет);
		Если Результат = Неопределено Тогда Продолжить; КонецЕсли;
			
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	КонецЦикла;

	ТабличныйДокументПараметры = Новый Структура("Контрагент, ТабличныйДокумент", Строка.Контрагент, ТабличныйДокумент); 
	МассивТабличныхДокументов.Добавить(ТабличныйДокументПараметры);
КонецЦикла;

Возврат МассивТабличныхДокументов;
КонецФункции

&НаСервере
Функция ПечатьСчетовНаСервере_1()
	
//ТабличныйДокумент = Новый ТабличныйДокумент;
МассивТабличныхДокументов = Новый Массив;
НомерДокумента = Объект.Номер; 

Если СчетАнгл Тогда
	ТолькоУслуги = Ложь; ТолькоПроживание = Ложь;	
	ТабличныйДокумент = ПечатьСервер.ПечатьСчетаНаАнглийском(Объект, ТолькоУслуги, ТолькоПроживание);
	
	ТабличныйДокументПараметры = Новый Структура("Контрагент, ТабличныйДокумент", Объект.Клиент, ТабличныйДокумент); 
	МассивТабличныхДокументов.Добавить(ТабличныйДокументПараметры);

	Возврат МассивТабличныхДокументов;
КонецЕсли;	

СчетаСвернутые = Объект.Счета.Выгрузить();
СчетаСвернутые.Свернуть("Контрагент");

Для Каждого Строка Из СчетаСвернутые Цикл
	ОтборСтроки = Новый Структура("Контрагент", Строка.Контрагент);
	НайденныеСтроки = Объект.Счета.НайтиСтроки(ОтборСтроки);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;

	Для Каждого Счет Из НайденныеСтроки Цикл
		//Если Счет.Закрыт Тогда Продолжить; КонецЕсли; 
		
		СчетаДетальноСтроки = Объект.СчетаДетальноСтроки.Выгрузить(Новый Массив);
		ОтборСтроки = Новый Структура("СчетГУИД", Счет.СчетГУИД);
		НайденыеСтроки = Объект.СчетаДетальноСтроки.НайтиСтроки(ОтборСтроки);
		Если НайденыеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		ОбщийФункционалСервер.ДобавитьСтроки(СчетаДетальноСтроки, НайденыеСтроки);
		
		НомерСчетаПараметр = ПечатьСервер.НомерСчетаДляПечати(НомерДокумента, Счет.НомерСчета);

		Результат = ПечатьСервер.ПечатьСчета_Счет(ТабличныйДокумент, Объект.Ссылка, Счет);
		Если Результат = Неопределено Тогда Продолжить; КонецЕсли;
			
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	КонецЦикла;

	ТабличныйДокументПараметры = Новый Структура("Контрагент, ТабличныйДокумент", Строка.Контрагент, ТабличныйДокумент); 
	МассивТабличныхДокументов.Добавить(ТабличныйДокументПараметры);
КонецЦикла;

Возврат МассивТабличныхДокументов;
КонецФункции

//

////

// + Печать Акта На счет
&НаКлиенте
Процедура ПечатьАктаСчет(Команда)
ТС = Элементы.Счета.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;	

Если ЭтаФорма.Модифицированность Тогда	
	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;
КонецЕсли;

ДанныеОбъект = Объект;
ТабличныйДокумент = ПечатьСервер.ПечатьАктаСчетНаСервере(Ложь, ТС, ДанныеОбъект);
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабличныйДокумент, "Акт");
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ЭтаФорма, Истина);

//ТабличныйДокумент.Показать("Акт");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАктаСчетНаПолнуюСумму(Команда)
Если ЭтаФорма.Модифицированность Тогда	
	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;
КонецЕсли;

ТС = Элементы.Счета.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;	

ДанныеОбъект = Объект;
ТабличныйДокумент = ПечатьСервер.ПечатьАктаСчетНаСервере(Истина, ТС, ДанныеОбъект);    
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

ТабличныйДокумент.Показать("Акт");
КонецПроцедуры
// - Печать Акта На счет

&НаКлиенте
Процедура ПечатьАкта(Команда)
Если ЭтаФорма.Модифицированность Тогда	
	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;	
КонецЕсли;
	
ТабличныйДокумент = ПечатьАктаНаСервере();
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

Если ТабличныйДокумент = 1 Тогда
	ПоказатьПредупреждение(, "Печать Акта по старому расчету НЕ поддерживается !" 
		+ Символы.ПС + Символы.ПС + "(Не установлен флаг 'Новый расчет')");
	Возврат; 
КонецЕсли;	

ТабличныйДокумент.Показать("Акт");
КонецПроцедуры

&НаСервере
Функция ПечатьАктаНаСервере()
Попытка ЭтотОбъект.Записать(); Исключение Возврат Неопределено; КонецПопытки;

Если Объект.НовыйРассчет Тогда 
	ТабДок = ПечатьАкта_новая();
	Возврат ТабДок;
КонецЕсли;

Возврат 1;

//ТабДок = ПечатьАкта_Старая();	
КонецФункции

&НаСервере
Функция ПечатьАкта_новая()
ТабДок = Новый ТабличныйДокумент;

МакАкт="АктГУК";
Макет = ПечатьСервер.ПолучитьМакетДокументаЗаявкаНаБронирование(МакАкт);

//НомерАкта = Объект.Номер + "-" + ТД.НомерСчета; 
НомерАкта = ПечатьСервер.УбратьНезначащиеНули(Объект.Номер);

Если ЗначениеЗаполнено(Объект.ВремяВыездаТочное) тогда
	ДатаАкта = Объект.ВремяВыездаТочное;
иначе
	ДатаАкта = Объект.РезервПо;
КонецЕсли;

Если КлиентыСервер.ЭтоЮрЛицо(Объект.Оплачивает) Тогда 
	Контрагент = Объект.Оплачивает;	
Иначе
	Контрагент = Объект.Клиент;	
КонецЕсли;

Если Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ПустаяСсылка() Тогда
	Сообщить("У клиента: " + Контрагент + " не заполнен 'Тип клиента'. ПЕЧАТЬ СЧЕТА ОТМЕНЯЕТСЯ ...");
	
	Возврат Неопределено;
КонецЕсли;

Клиент = Объект.Клиент;	

СвернутьВСчете = Объект.СвернутьВСчете;
ДатаС = Объект.РезервС;
ДатаПо = Объект.РезервПо;

ПроживаниеТаблица = Объект.Проживание;
УслугиТаблица = Объект.ДопУслуги;
//УслугиТаблица = Новый ТаблицаЗначений; 

ТабДок = ПечатьАктаДействие(НомерАкта, ДатаАкта, Контрагент, Клиент, СвернутьВСчете, ДатаС, ДатаПо, ПроживаниеТаблица, УслугиТаблица);
Возврат ТабДок;
КонецФункции

&НаСервере
Функция ПечатьАктаДействие(НомерАкта, ДатаАкта, Контрагент, Клиент, СвернутьВСчете, ДатаС, ДатаПо, ПроживаниеТаблица, УслугиТаблица)
ТабДок = Новый ТабличныйДокумент;

//МакАкт="АктГУК";
//Макет = ПечатьСервер.ПолучитьМакетДокументаЗаявкаНаБронирование(МакАкт);

МакАкт="Акт";
Макет = ПолучитьОбщийМакет(МакАкт);

ТекстЗаголовка = ПечатьСервер.ПечатьАкта_Шапка(ТабДок, Макет, НомерАкта, ДатаАкта, Контрагент);  

СтрокаТабл = Макет.ПолучитьОбласть("Строка");

Клиент = Объект.Клиент;	
Клиент2 = Объект.Клиент2;

ТоварКлиент = "" + Клиент;
//Товар = Товар + ?(ЗначениеЗаполнено(Клиент2), ", " + Клиент2, "");
Если ЗначениеЗаполнено(Клиент2) Тогда 
	Если Клиент <> Клиент2 Тогда 
		ТоварКлиент = ТоварКлиент + ", " + Клиент2;
	КонецЕсли;
КонецЕсли;
ТоварКлиент = ТоварКлиент + ". ";

СуммаДляПечати = 0;
//НомерСтроки		Товар	Количество			ЕдиницаИзмерения		Цена				Сумма	
Если СвернутьВСчете тогда
	СуммаПроживание = 0;
	КоличествоСуток = 0;
	Для Каждого Строка из ПроживаниеТаблица Цикл
		СуммаПроживание = СуммаПроживание + Строка.Сумма;
		КоличествоСуток = КоличествоСуток + Строка.Количество;
	КонецЦикла;	
	
	СуммаУслуги = 0;
	Для Каждого Строка из УслугиТаблица Цикл
		Если НЕ Строка.ВСчет тогда Продолжить; конецесли;
		
		СуммаУслуги = СуммаУслуги + Строка.Цена * Строка.Количество;
	КонецЦикла;	
	
	СуммаДляПечати = СуммаПроживание + СуммаУслуги;
	
	//	НомерСтроки	Товар	Количество	ЕдиницаИзмерения	Цена	Сумма
	СтрокаТабл.Параметры.НомерСтроки=1;
	
	Товар = ТоварКлиент + "Проживание " + " с "+ Формат(ДатаС, "ДФ=dd.MM.yy")+ " по "+ Формат(ДатаПо, "ДФ=dd.MM.yy");
	СтрокаТабл.Параметры.Товар = Товар;
		
	СтрокаТабл.Параметры.ЕдиницаИзмерения="сутки";
	
	СтрокаТабл.Параметры.Количество = КоличествоСуток;
	СтрокаТабл.Параметры.Цена=?(КоличествоСуток=0, 0, Окр(СуммаДляПечати/КоличествоСуток,2));
	СтрокаТабл.Параметры.Сумма=СуммаДляПечати;
	
	ТабДок.Вывести(СтрокаТабл);
	сч=1;
иначе
	сч=0;
	//Если Объект.Всчет тогда
		Для каждого Стр Из ПроживаниеТаблица Цикл
			сч=сч+1;
			СтрокаТабл.Параметры.НомерСтроки=сч;
			
			НаименованиеДолг = ЗаявкаСервер.НаименованиеДолг(Стр, Ложь);
	        Товар = ТоварКлиент + НаименованиеДолг;

			СтрокаТабл.Параметры.Товар = Товар;
				
			СтрокаТабл.Параметры.ЕдиницаИзмерения="сутки";
			
			СтрокаТабл.Параметры.Количество=Стр.Количество;
			СтрокаТабл.Параметры.Цена=?(Стр.Количество=0, 0, Окр(Стр.Сумма/Стр.Количество,2));
			СтрокаТабл.Параметры.Сумма=Стр.Сумма;
			
			ТабДок.Вывести(СтрокаТабл);
			
			СуммаДляПечати = СуммаДляПечати + Стр.Сумма;
		КонецЦикла; 
	//конецесли;
	
	Для каждого Усл Из УслугиТаблица Цикл
		Если НЕ Усл.ВСчет тогда Продолжить; конецесли;
		
		сч=сч+1;
		СтрокаТабл.Параметры.НомерСтроки=сч;
		
		НаименованиеДолг = ЗаявкаСервер.НаименованиеДолг(Усл, Истина);
	    Товар = ТоварКлиент + НаименованиеДолг;
		
		СтрокаТабл.Параметры.Товар = Товар;
		
		СтрокаТабл.Параметры.ЕдиницаИзмерения="услуга";
		
		СтрокаТабл.Параметры.Количество=Усл.Количество;
		СтрокаТабл.Параметры.Цена=Усл.Цена;
		
		Сумма = Усл.Цена*Усл.Количество;
		СтрокаТабл.Параметры.Сумма = Сумма;
		
		ТабДок.Вывести(СтрокаТабл);
		
		СуммаДляПечати = СуммаДляПечати + Сумма;
	КонецЦикла; 
конецесли;

// проживание 
ИтогоСтр=Макет.ПолучитьОбласть("Итого");
ИтогоСтр.Параметры.Всего=СуммаДляПечати;
ТабДок.Вывести(ИтогоСтр);
ИтогоСтр=Макет.ПолучитьОбласть("СуммаПрописью");  
ИтогоСтр.Параметры.ИтоговаяСтрока="Всего оказанно услуг на сумму:";
ИтогоСтр.Параметры.СуммаПрописью=ЧислоПрописью(СуммаДляПечати,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
ТабДок.Вывести(ИтогоСтр);	

ИтогоСтр=Макет.ПолучитьОбласть("Подписи");
ТабДок.Вывести(ИтогоСтр);

ТабДок.ОтображатьСетку = Ложь; ТабДок.Защита = Ложь; ТабДок.ТолькоПросмотр = Истина; ТабДок.ОтображатьЗаголовки = Ложь;

ТабДок.ВерхнийКолонтитул.ТекстВЦентре = ТекстЗаголовка;
ТабДок.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
ТабДок.ВерхнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.ВерхнийКолонтитул.Шрифт = мШрифт;
//ТабДок.ВерхнийКолонтитул.Выводить = Истина;
ТабДок.ВерхнийКолонтитул.Выводить = Ложь;

ТабДок.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы] из [&СтраницВсего]";
ТабДок.НижнийКолонтитул.Выводить = Истина;
ТабДок.НижнийКолонтитул.НачальнаяСтраница = 2;
мШрифт = Новый Шрифт(, 9, Истина, , , );
ТабДок.НижнийКолонтитул.Шрифт = мШрифт;

Возврат ТабДок;
//ТабДок.Показать();
КонецФункции

//
&НаСервере
Функция ПолучитьМакетДокумента_НеИспользуется(ИмяМакета)
МакетИмя = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();	
МакетИмя = ИмяМакета + "_" + МакетИмя;

Макет = Документы.ЗаявкаНаБронирование.ПолучитьМакет(МакетИмя);
Возврат Макет;
КонецФункции

&НаСервере
Функция ПолучитьМакетНаСервере(ИмяОбъекта, ИмяМакета)
ОтчетОбъект = РеквизитФормыВЗначение(ИмяОбъекта);
Макет = ОтчетОбъект.ПолучитьМакет(ИмяМакета);
Возврат Макет;
КонецФункции
//

//
&НаКлиенте
Процедура ПечатьСчетаФактуры(Команда)
ТС = Элементы.Счета.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;	

Текст = ПроверкаПечатьСчетаФактуры(ТС);
Если Текст <> "" Тогда
	Текст = Текст + "
		|
		|ПЕЧАТЬ ОТМЕНЯЕТСЯ ...";
	ПоказатьПредупреждение(, Текст);
	
	Возврат;
КонецЕсли;
		
Если ЭтаФорма.Модифицированность Тогда	
	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;	
КонецЕсли;

ДанныеОбъект = Объект;
ТабличныйДокумент = ПечатьСчетаФактурыНаСервере(ТС, ДанныеОбъект);
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

ТабличныйДокумент.Показать("Счет-Фактура");
КонецПроцедуры

&НаСервере
Функция ПроверкаПечатьСчетаФактуры(ТС)
Счет = Объект.Счета.НайтиПоИдентификатору(ТС);

Текст = "";
Если Счет.Контрагент.Турагентство Тогда
	 Текст = "Контрагент - Турагентство";
ИначеЕсли Счет.Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо Тогда
	 Текст = "Контрагент - Физ. лицо";
ИначеЕсли Счет.ЭтоПредварительныйГрупповойСчет Тогда
	 Текст = "Это предварительный Групповой счет ";
ИначеЕсли ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда
	 Текст = "Счет входит в Групповой счет ";
ИначеЕсли ПечатьСервер.ЭтоШтрафЗаНезаезд(Объект.Ссылка, Счет)  Тогда
	 Текст = "Штраф за незаед";
КонецЕсли;

Возврат Текст;	
КонецФункции

&НаСервере
Функция ПечатьСчетаФактурыНаСервере(ТС, ДокументОбъект)
//ТабДок = Новый ТабличныйДокумент;

Счет = Объект.Счета.НайтиПоИдентификатору(ТС);
//Счет = ТД.Счет;

НомерАктаДатаАкта = ПечатьСервер.НомерДатаДокумента(ДокументОбъект, Счет.НомерСчета, Счет.ДатаПо);
Номер = НомерАктаДатаАкта.Номер;
Дата =  НомерАктаДатаАкта.Дата;

ДокументОтгрузки = "Акт № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
	
ТабДок = ПечатьСервер.ПечатьСчетаФактуры(Номер, Дата, Объект.Ссылка, Счет);

Возврат ТабДок;	
КонецФункции
//

//
&НаКлиенте
Процедура ПечатьУПД(Команда)
ТС = Элементы.Счета.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;	

Текст = ПроверкаПечатьУПД(ТС);
Если Текст <> "" Тогда
	Текст = Текст + "
		|
		|ПЕЧАТЬ ОТМЕНЯЕТСЯ ...";
	ПоказатьПредупреждение(, Текст);
	
	Возврат;
КонецЕсли;
		
Если ЭтаФорма.Модифицированность Тогда	
	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;	
КонецЕсли;

ДанныеОбъект = Объект;
ТабличныйДокумент = ПечатьУПДНаСервере(ТС, ДанныеОбъект);
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

ТабличныйДокумент.Показать("УПД");
КонецПроцедуры

&НаСервере
Функция ПроверкаПечатьУПД(ТС)
Счет = Объект.Счета.НайтиПоИдентификатору(ТС);

Текст = "";
Если Счет.Контрагент.Турагентство Тогда
	 Текст = "Контрагент - Турагентство";
ИначеЕсли Счет.Контрагент.ТипКлиента = Перечисления.ТипыКлиентов.ФизЛицо Тогда
	 Текст = "Контрагент - Физ. лицо";
ИначеЕсли Счет.ЭтоПредварительныйГрупповойСчет Тогда
	 Текст = "Это предварительный Групповой счет ";
ИначеЕсли ЗначениеЗаполнено(Счет.ГрупповойСчет) Тогда
	 Текст = "Счет входит в Групповой счет ";
ИначеЕсли ПечатьСервер.ЭтоШтрафЗаНезаезд(Объект.Ссылка, Счет)  Тогда
	 Текст = "Штраф за незаед";
КонецЕсли;

Возврат Текст;	
КонецФункции

&НаСервере
Функция ПечатьУПДНаСервере(ТС, ДокументОбъект)
//ТабДок = Новый ТабличныйДокумент;

Счет = Объект.Счета.НайтиПоИдентификатору(ТС);
//Счет = ТД.Счет;

НомерАктаДатаАкта = ПечатьСервер.НомерДатаДокумента(ДокументОбъект, Счет.НомерСчета, Счет.ДатаПо);
Номер = НомерАктаДатаАкта.Номер;
Дата =  НомерАктаДатаАкта.Дата;

ДокументОтгрузки = "Акт № " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"); 

ТабДок = ПечатьСервер.ПечатьУПД(Номер, Дата, Объект.Ссылка, Счет);

Возврат ТабДок;	
КонецФункции
//
////

//
&НаКлиенте
Асинх Процедура ПечатьДоговора(Команда)
Если ЭтаФорма.Модифицированность Тогда	
	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;
КонецЕсли;

СписокОтветов = Новый СписокЗначений;
КлиентНаименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Клиент, "Наименование");
СписокОтветов.Добавить(Объект.Клиент, КлиентНаименование + " (1)");
Клиент2Наименование = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Клиент2, "Наименование");
СписокОтветов.Добавить(Объект.Клиент2, Клиент2Наименование + " (2)");
СписокОтветов.Добавить(Неопределено, "Отмена");

Если ЗначениеЗаполнено(Объект.Клиент2) Тогда
	Клиент = Ждать ВопросАсинх("Выберите клиента ..." 
			, СписокОтветов, , , "ПЕЧАТЬ ДОГОВОРА"); 
		
	Если Клиент = Неопределено Тогда Возврат; КонецЕсли;		
Иначе	
	Клиент = Объект.Клиент;
КонецЕсли;
	
МойДокументВДвоичныхДанных = ПолучитьМакетДоговораВДвоичныхДанных();

ИмяВрем = ПолучитьИмяВременногоФайла(".doc");
МойДокументВДвоичныхДанных.Записать(ИмяВрем);

Если НастройкиСервер.ЭтоРеноме() 
ИЛИ НастройкиСервер.ЭтоЧехов()
ИЛИ НастройкиСервер.ЭтоЛайв()
Тогда
	ПечатьДоговораДействие(ИмяВрем, Клиент);
Иначе
	ПечатьДоговораДействие_Прочие(ИмяВрем, Клиент);
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДоговораДействие(ИмяВрем, Клиент)
Word = Новый COMОбъект("Word.Application");
Документ = Word.Documents.Add(ИмяВрем);

ОбщСт=0;

сч=1;

СтруктураРеквизитов = ПолучитьСтруктуруРеквизитовПечатьДоговораНаСервере(Клиент);
СтруктураРеквизитов.Вставить("ФИО1", СтруктураРеквизитов.ФИО);

Для Каждого Элемент из СтруктураРеквизитов Цикл
	Замена = Документ.Content.Find;
	Замена.Execute("<" + Элемент.Ключ + ">", Ложь, Истина, Ложь, , , Истина, , Ложь, Элемент.Значение);
КонецЦикла;

////TempImagePath = "C:\_Base1C\РЕНОМЕ\SCAN\fa1bd674-3d36-11f0-8361-000c29eccf43_Image_46684.jpg";

//TempImagePath = ИмяФайлаСкана();
//Если TempImagePath <> "" Тогда
//   Файл = Новый Файл(TempImagePath);

//   НомерПараграфа = 12; //Документ.Paragraphs.Count();
//   Параграф = Документ.Paragraphs.Item(НомерПараграфа);
//   Попытка
//		Picture =  Параграф.Range.InlineShapes.AddPicture(TempImagePath);

//		//Picture = ДокументWord.Tables(2).Cell(номерСтроки,1).Range.InlineShapes.AddPicture(ПутьККартинке, Ложь, Истина);
//		
//		Коэфициент = 250 / Picture.Height; 
//		Picture.Height = 250;
//		Picture.Width = Picture.Width * Коэфициент;
//		
//		//        Shape = Picture.ConvertToShape();
//		//        Shape.WrapFormat.Type = 0;
//		//Shape.Top = 0;
//	Исключение
//		
//	КонецПопытки;
//КонецЕсли;
	
Word.Visible = Истина;
Word.Activate();
Документ.ActiveWindow.Caption = "Договор";

//	//Получим путь во временной директории для сохранения туда файла
//	ИмяВрем = ПолучитьИмяВременногоФайла(".doc");
//	//Сохраним туда файл
//	Документ.SaveAs(ИмяВрем);
//	
//	//Закроем Word
//	Word.Application.Quit();
//	//УдалитьФайлы(ИмяВрем);
//			
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДоговораДействие_Прочие(ИмяВрем, Клиент)
Word = Новый COMОбъект("Word.Application");
Документ = Word.Documents.Add(ИмяВрем);

ОбщСт=0;

сч=1;
СтруктураРеквизитов=Новый Структура;

ДанныеОбъекта = ПолучитьДанныеОбъектаПечатьДоговораНаСервере(Клиент);
//СтруктураРеквизитов.Вставить("ФИО", Объект.Клиент.Наименование);
СтруктураРеквизитов.Вставить("ФИО", ДанныеОбъекта.КлиентНаименование);



СтруктураРеквизитов.Вставить("Телефон","                    ");
СтруктураРеквизитов.Вставить("ДН1",Формат(Объект.РезервС, "ДЛФ=DD"));
//СтруктураРеквизитов.Вставить("мес",Формат(РезервС, "ДФ=ММММ"));
//СтруктураРеквизитов.Вставить("год",Формат(РезервС, "ДФ=гггг"));
СтруктураРеквизитов.Вставить("ДН2",Формат(Объект.РезервПО, "ДЛФ=DD"));
//СтруктураРеквизитов.Вставить("мес2",Формат(РезервПо, "ДФ=ММММ"));
//СтруктураРеквизитов.Вставить("год2",Формат(РезервПо, "ДФ=гггг"));

//	СуммаПроживание=РассчитатьСуммуЗапроживание(Неопределено,ПеременныйТариф);//Тариф.Цена*КолВо;
СуммаПроживание=РассчитатьСуммуЗаПроживание();//Тариф.Цена*КолВо;

ФормСтрока = "Л = ru_RU; ДП = Истина";
ФормСтрока2 = "Л = ru_RU; ДП = Истина;НД = Ложь";

ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
ПарПредметаВагон="вагон, вагона, вагонов, м, копейка, копейки, копеек, ж, 0";
ПарПредметаШт="штука, штуки, штук, ж, копейка, копейки, копеек, ж, 0";
//ПарПредметаВагон="вагон, вагона, вагонов, м";

ЭтоТурагентство = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Оплачивает, "Турагентство");
ЭтоЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Объект.Оплачивает);
Если (ЭтоТурагентство ИЛИ ЭтоЮрЛицо) Тогда
	СтруктураРеквизитов.Вставить("стоимость", "");
Иначе	
	СтруктураРеквизитов.Вставить("стоимость",Формат(СуммаПроживание, "ЧГ=")+ " руб. ("+ЧислоПрописью(СуммаПроживание,ФормСтрока,ПарПредмета)+")");
КонецЕсли;
	
//СтруктураРеквизитов.Вставить("категория",Объект.НомерВРезерв.КатегорияНомера.Наименование);
//СтруктураРеквизитов.Вставить("категория", ДанныеОбъекта.НомерВРезервКатегорияНомераНаименование);
СтруктураРеквизитов.Вставить("категория", ДанныеОбъекта.КатегорияНомераНаименование);

//СтруктураРеквизитов.Вставить("паспортныеданные", Объект.Клиент.Наименование 
//	+ ", паспорт серия " + ?(Объект.Клиент.Серия="","      ", Объект.Клиент.Серия) 
//	+ ", номер " + ?(Объект.Клиент.Номер="","          ",Объект.Клиент.Номер) 
//	+ ", выдан " + ?(Объект.Клиент.КемВыдан="","                                        ", Объект.Клиент.КемВыдан)
//	+", дата выдачи " + ?(ЗначениеЗаполнено(Объект.Клиент.ДатаВыдачи),Формат(Объект.Клиент.ДатаВыдачи, "ДФ=dd.MM.yyyy"),"          "));

СтруктураРеквизитов.Вставить("паспортныеданные", ДанныеОбъекта.КлиентНаименование
	+ ", паспорт серия " + ?(ДанныеОбъекта.КлиентСерия="","      ", ДанныеОбъекта.КлиентСерия) 
	+ ", номер " + ?(ДанныеОбъекта.КлиентНомер="","          ",ДанныеОбъекта.КлиентНомер) 
	+ ", выдан " + ?(ДанныеОбъекта.КлиентКемВыдан="","                                        ", ДанныеОбъекта.КлиентКемВыдан)
	+", дата выдачи " + ?(ЗначениеЗаполнено(ДанныеОбъекта.КлиентДатаВыдачи),Формат(ДанныеОбъекта.КлиентДатаВыдачи, "ДФ=dd.MM.yyyy"),"          "));

Для Каждого Элемент из СтруктураРеквизитов Цикл
	Замена = Документ.Content.Find;
	Замена.Execute("<" + Элемент.Ключ + ">", Ложь, Истина, Ложь, , , Истина, , Ложь, Элемент.Значение);
КонецЦикла;

//TempImagePath = "C:\_Base1C\РЕНОМЕ\SCAN\fa1bd674-3d36-11f0-8361-000c29eccf43_Image_46684.jpg";

TempImagePath = ИмяФайлаСкана();
Если TempImagePath <> "" Тогда
   Файл = Новый Файл(TempImagePath);

   НомерПараграфа = 12; //Документ.Paragraphs.Count();
   Параграф = Документ.Paragraphs.Item(НомерПараграфа);
   Попытка
		Picture =  Параграф.Range.InlineShapes.AddPicture(TempImagePath);

		//Picture = ДокументWord.Tables(2).Cell(номерСтроки,1).Range.InlineShapes.AddPicture(ПутьККартинке, Ложь, Истина);
		
		Коэфициент = 250 / Picture.Height; 
		Picture.Height = 250;
		Picture.Width = Picture.Width * Коэфициент;
		
		//        Shape = Picture.ConvertToShape();
		//        Shape.WrapFormat.Type = 0;
		//Shape.Top = 0;
	Исключение
		
	КонецПопытки;
КонецЕсли;
	
Word.Visible = Истина;
Word.Activate();
Документ.ActiveWindow.Caption = "Договор";

//	//Получим путь во временной директории для сохранения туда файла
//	ИмяВрем = ПолучитьИмяВременногоФайла(".doc");
//	//Сохраним туда файл
//	Документ.SaveAs(ИмяВрем);
//	
//	//Закроем Word
//	Word.Application.Quit();
//	//УдалитьФайлы(ИмяВрем);
//			
КонецПроцедуры

&НаСервере
Функция ИмяФайлаСкана()
Папка = Константы.Папка_C_BASE.Получить() + "SCAN\";
СканыДокументов = Объект.Клиент.СканыДокументов;
Если СканыДокументов.Количество() = 0 Тогда Возврат ""; КонецЕсли;

ИмяФайла = Папка + СканыДокументов[0].ПутьДоФото;

Возврат ИмяФайла;
КонецФункции

&НаСервере
Функция ПолучитьМакетДоговораВДвоичныхДанных()
	Макет = ПечатьСервер.ПолучитьМакетДокументаЗаявкаНаБронирование("Договор");
	
	ИмяВрем = ПолучитьИмяВременногоФайла(".doc");
	Макет.Записать(ИмяВрем);
	
	МойДокументВДвоичныхДанных = Новый ДвоичныеДанные(ИмяВрем);
	Возврат МойДокументВДвоичныхДанных;			
КонецФункции

&НаСервере
Функция РассчитатьСуммуЗаПроживание(СсылкаДок=Неопределено, ПеременныйТариф=Ложь)
СуммаПроживание = ДокументыСервер.РассчитатьСуммуЗаПроживание(Объект); 
Возврат СуммаПроживание; 
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруРеквизитовПечатьДоговораНаСервере(Клиент)
Ответ = Новый Структура;
Ответ.Вставить("Номер", Объект.НомерВРезерв.Наименование);
Ответ.Вставить("Категория", Объект.КатегорияНомера.Наименование);
//Ответ.Вставить("Заезд", Формат(Объект.РезервС, "ДФ=dd.MM.yyyy"));
Заезд = ?(ЗначениеЗаполнено(Объект.ВремяЗаездаТочное), Формат(Объект.ВремяЗаездаТочное, "ДФ=dd.MM.yyyy")
								, Формат(Объект.РезервС, "ДФ=dd.MM.yyyy"));
Ответ.Вставить("Заезд", Заезд);
Ответ.Вставить("Выезд", Формат(Объект.РезервПо, "ДФ=dd.MM.yyyy"));
Ответ.Вставить("Сутки", Строка(Объект.КолВоДней));
Ответ.Вставить("ФИО", Клиент.Наименование);
Ответ.Вставить("ДатаРождения", Формат(Объект.Клиент.ДатаРождения, "ДФ=dd.MM.yyyy"));

Паспорт = Объект.Клиент.Серия + " " + Объект.Клиент.Номер;
Ответ.Вставить("Паспорт", Паспорт);
Ответ.Вставить("Выдан", Объект.Клиент.КемВыдан);
Ответ.Вставить("Заявка", Объект.Номер);

Ответ.Вставить("ДатаТекущая", Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));    

Ответ.Вставить("ТелефонНомер", Объект.Клиент.Телефон);   

Возврат Ответ;
КонецФункции	

&НаСервере 
Функция ПолучитьДанныеОбъектаПечатьДоговораНаСервере(Клиент)
Ответ = Новый Структура;
Ответ.Вставить("КлиентНаименование", Клиент.Наименование);
//Ответ.Вставить("НомерВРезервКатегорияНомераНаименование", Объект.КатегорияНомера.Наименование);
Ответ.Вставить("КатегорияНомераНаименование", Объект.КатегорияНомера.Наименование);
Ответ.Вставить("КлиентСерия", Клиент.Серия);
Ответ.Вставить("КлиентНомер", Клиент.Номер);
Ответ.Вставить("КлиентКемВыдан", Клиент.КемВыдан);
Ответ.Вставить("КлиентДатаВыдачи", Клиент.ДатаВыдачи);

Возврат Ответ;
КонецФункции	
//


//
&НаКлиенте
Процедура СправкаОПроживании(Команда)
Если НастройкиСервер.ЭтоРеноме() 
ИЛИ НастройкиСервер.ЭтоДомСоветов()
ИЛИ НастройкиСервер.ЭтоЧехов()
ИЛИ НастройкиСервер.ЭтоЛайв() 
Тогда
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", Объект.Клиент);
	ПараметрыФормы.Вставить("Дата_С", Объект.РезервС);
	ПараметрыФормы.Вставить("Дата_По", Объект.РезервПо);
	ПараметрыФормы.Вставить("КатегорияНомера", Объект.КатегорияНомера);
	
	ПараметрыФормы.Вставить("ИсходящийНомер", Объект.Номер);
	ПараметрыФормы.Вставить("ИсходящаяДата", Объект.ВремяВыездаТочное);

	ОрганизацияИмя = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
	ПараметрыФормы.Вставить("Отель", ОрганизацияИмя);
	
	ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаСправкаОПроживании", ПараметрыФормы , ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецЕсли;
КонецПроцедуры
//

&НаКлиенте
Процедура ПечатьАнкетыФМС(Команда)
Если ЭтаФорма.Модифицированность Тогда	
	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;
КонецЕсли;

ИмяФайла = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
ИмяФайла = ИмяФайла + "ОбразцыДокументов\" + "Приказ.docx";   
//ОткрытьДокументПоШаблонуИзФайла("C:\base\Приказ.doc");
ПроверитьСуществованиеФайлаИОткрыть(ИмяФайла);
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьСуществованиеФайлаИОткрыть(ФайлШаблона) экспорт
	ф=новый файл(ФайлШаблона);
	//Если ф.Существует() Тогда
	ДопПараметры = Новый Структура("ФайлШаблона", ф);
	Оповещение = Новый ОписаниеОповещения("ЗавершитьПроверкуСуществованияФайла", ЭтаФорма, ДопПараметры);
	
	ф.НачатьПроверкуСуществования(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПроверкуСуществованияФайла(Результат, Параметры) экспорт
	ф = Параметры.ФайлШаблона;
	
	Если Результат Тогда 
		ПечатьАнкетыФМСДействие(Параметры);
	Иначе
//		Сообщить("Файл "+ФайлШаблона+" не найден");
		Сообщить("Файл "+ф.ПолноеИмя + " не найден");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАнкетыФМСДействие(Параметры)
ПараметрыФормы = Новый Структура();	
ПараметрыФормы.Вставить("Заголовок", "Создание анкеты ФМС");

ФормаИндикатор = ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.Индикатор", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
ф = Параметры.ФайлШаблона;
	
БольшаяСтрока=СтрДлина("______________________________________________________________________");
Word = Новый COMОбъект("Word.Application");
Word.Visible = True;
Word.Visible = False;

t0 = ТекущаяУниверсальнаяДатаВМиллисекундах();
//Сообщить("0");
ФормаИндикатор.ОбновитьИндикатор(5);

Word.Documents.Add(ф.ПолноеИмя);

t1 = ТекущаяУниверсальнаяДатаВМиллисекундах();
//Сообщить((t1 - t0));
Документ=Word.ActiveDocument;

ФормаИндикатор.ОбновитьИндикатор(15);

t2 = ТекущаяУниверсальнаяДатаВМиллисекундах();
//Сообщить((t2 - t1));

ДанныеАнкетыФМС = ДанныеАнкетыФМС(); 

t3 = ТекущаяУниверсальнаяДатаВМиллисекундах();
//Сообщить((t3 - t2));
ФормаИндикатор.ОбновитьИндикатор(25);

//Ответ = ОбщийМодульНастройки.ПечатьАнкетыФМСЗаявкаНаБронированиеПараметры();

//// + ПСН 
////Документ.Variables.Add("Отель",ПоЦентру("Гостиница ""Реноме""",БольшаяСтрока));
////Документ.Variables.Add("АдресОтель",ПоЦентру("г. Екатеринбург ул. 8 марта 50",БольшаяСтрока));
//Документ.Variables.Add("Отель",ПоЦентру(Ответ.Отель, БольшаяСтрока));
//Документ.Variables.Add("АдресОтель",ПоЦентру(Ответ.АдресОтель, БольшаяСтрока));
//// - ПСН 
Документ.Variables.Add("Отель",ПоЦентру(ДанныеАнкетыФМС.Отель, БольшаяСтрока));
Документ.Variables.Add("АдресОтель",ПоЦентру(ДанныеАнкетыФМС.АдресОтель, БольшаяСтрока));

//НомерВРезервНаименование = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.НомерВРезерв, "Наименование");
//Документ.Variables.Add("НомерКомнаты",ПоЦентру(НомерВРезервНаименование, СтрДлина("__________ ")));
Документ.Variables.Add("НомерКомнаты",ПоЦентру(ДанныеАнкетыФМС.НомерКомнаты, СтрДлина("__________ ")));

//КлиентФамилия = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Фамилия");
//Документ.Variables.Add("Фамилия",ПоЦентру(КлиентФамилия,СтрДлина("__________________________________________________________  ")));
Документ.Variables.Add("Фамилия",ПоЦентру(ДанныеАнкетыФМС.Фамилия, СтрДлина("__________________________________________________________  ")));

//КлиентИмя = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Имя");
//Документ.Variables.Add("Имя",ПоЦентру(КлиентИмя,СтрДлина("______________________________________________________________  ")));
Документ.Variables.Add("Имя",ПоЦентру(ДанныеАнкетыФМС.Имя, СтрДлина("______________________________________________________________  ")));

//КлиентОтчество = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Отчество");
//Документ.Variables.Add("Очество",ПоЦентру(КлиентОтчество,СтрДлина("__________________________________________________         ")));
Документ.Variables.Add("Очество",ПоЦентру(ДанныеАнкетыФМС.Отчество, СтрДлина("__________________________________________________         ")));

//КлиентДатаРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ДатаРождения");
//Документ.Variables.Add("ДатаР",ПоЦентру(Формат(КлиентДатаРождения, "ДЛФ=DD"),СтрДлина("""________  "" ______________ _______")));
Документ.Variables.Add("ДатаР",ПоЦентру(Формат(ДанныеАнкетыФМС.ДатаР, "ДЛФ=DD"),СтрДлина("""________  "" ______________ _______")));

//КлиентПол = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Пол");
//Документ.Variables.Add("МЖ",ПоЦентру(?(КлиентПол = ПредопределенноеЗначение("Перечисление.Пол.Мужской"),"Муж.","Жен."),8));
Документ.Variables.Add("МЖ",ПоЦентру(ДанныеАнкетыФМС.МЖ, 8));

//КлиентСтранаРожденияСсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеСтранаФМС_NEW");
//СтранаРожд = ОбщийФункционалСервер.СправочникНайтиПоРеквизитуНаСервере("СтраныФМС_NEW", "Наименование", КлиентСтранаРожденияСсылка);
//Если НЕ ЗначениеЗаполнено(СтранаРожд) Тогда СтранаРожд = "Россия"; КонецЕсли;
//Документ.Variables.Add("Страна",ПоЦентру(СтранаРожд,СтрДлина(" ____________________________________________")));
Документ.Variables.Add("Страна",ПоЦентру(ДанныеАнкетыФМС.Страна,СтрДлина(" ____________________________________________")));

//КлиентРегионРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеРегион_NEW");
//Документ.Variables.Add("Регион",ПоЦентру(КлиентРегионРождения,СтрДлина(" ____________________________________________________________  ")));
Документ.Variables.Add("Регион",ПоЦентру(ДанныеАнкетыФМС.Регион,СтрДлина(" ____________________________________________________________  ")));

//КлиентРайонРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеРайон");
//Документ.Variables.Add("Район",ПоЦентру(КлиентРайонРождения,СтрДлина(" ________________________________________________________________")));
Документ.Variables.Add("Район",ПоЦентру(ДанныеАнкетыФМС.Район,СтрДлина(" ________________________________________________________________")));

//КлиентГородРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеГород");
//Документ.Variables.Add("Город",ПоЦентру(КлиентГородРождения,СтрДлина(" ________________________________________________________________")));
Документ.Variables.Add("Город",ПоЦентру(ДанныеАнкетыФМС.Город,СтрДлина(" ________________________________________________________________")));

//НасПунктРождения="";
//КлиентНасПунктРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеНасПункт");
Документ.Variables.Add("НасПункт",ПоЦентру(ДанныеАнкетыФМС.НасПункт,СтрДлина("____________________________Нас пункт_________________")));

//КлиентГражданствоСсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ГражданствоФМС_NEW");
//Гражданство = ОбщийФункционалСервер.СправочникНайтиПоРеквизитуНаСервере("СтраныФМС_NEW", "Наименование", КлиентГражданствоСсылка);
//Документ.Variables.Add("Гражданство",ПоЦентру(Гражданство,СтрДлина("________________________________РФ______________________")));
Документ.Variables.Add("Гражданство",ПоЦентру(ДанныеАнкетыФМС.Гражданство,СтрДлина("________________________________РФ______________________")));
//----Перечень значений  _____________________________

// Паспорт
// + ПСН
//КлиентВидДокументаУдостоверяющегоЛичность = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ВидДокументаУдостоверяющегоЛичность");
//КлиентТипДокументаФМССсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ТипДокументаФМС_NEW");
//КлиентВидДокументаУдостоверяющегоЛичность = ОбщийФункционалСервер.СправочникНайтиПоРеквизитуНаСервере("ТипДокументаФМС_NEW", "Наименование", КлиентТипДокументаФМССсылка);
// - ПСН
//"____________________________________ "
// 1234567891123456789212345678931234567
//Документ.Variables.Add("ВидДок",ПоЦентру(КлиентВидДокументаУдостоверяющегоЛичность,СтрДлина("____________________________________ ")));
Документ.Variables.Add("ВидДок",ПоЦентру(ДанныеАнкетыФМС.ВидДок, СтрДлина("____________________________________ ")));

//КлиентСерия = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Серия");
//Документ.Variables.Add("СерДок",ПоЦентру(КлиентСерия,СтрДлина("________")));
Документ.Variables.Add("СерДок",ПоЦентру(ДанныеАнкетыФМС.СерДок,СтрДлина("________")));

//КлиентНомер = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Номер");
//Документ.Variables.Add("НомерДок",ПоЦентру(КлиентНомер,СтрДлина("______")));
Документ.Variables.Add("НомерДок",ПоЦентру(ДанныеАнкетыФМС.НомерДок,СтрДлина("______")));

//КлиентДатаВыдачи = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ДатаВыдачи");
//Документ.Variables.Add("ДеньВыд",ПоЦентру(Формат(КлиентДатаВыдачи, "ДЛФ=DD"),СтрДлина("  ""________"" _____________")));
Документ.Variables.Add("ДеньВыд",ПоЦентру(Формат(ДанныеАнкетыФМС.ДеньВыд, "ДЛФ=DD"),СтрДлина("  ""________"" _____________")));

//КлиентКемВыдан = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "КемВыдан");
//КлиентКемВыдан = КлиентКемВыдан(Объект.Клиент);
//Документ.Variables.Add("Орган1",ПоЦентру(КлиентКемВыдан,СтрДлина("_____________________________________________")));
Документ.Variables.Add("Орган1",ПоЦентру(ДанныеАнкетыФМС.Орган1,СтрДлина("_____________________________________________")));

//КлиентКодОргана = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "КодОргана");
//Документ.Variables.Add("ОрганКод",ПоЦентру(КлиентКодОргана,СтрДлина("_____________________________")));
Документ.Variables.Add("ОрганКод",ПоЦентру(ДанныеАнкетыФМС.ОрганКод,СтрДлина("_____________________________")));

//КлиентСтранаПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "СтранаПроживания");
//Документ.Variables.Add("МестоСтрана",ПоЦентру(КлиентСтранаПроживания,СтрДлина(" _______________________________________ ")));

//КлиентСтранаПроживания = "Россия";
//Документ.Variables.Add("МестоСтрана",ПоЦентру(КлиентСтранаПроживания,СтрДлина(" _______________________________________ ")));
Документ.Variables.Add("МестоСтрана",ПоЦентру(ДанныеАнкетыФМС.МестоСтрана,СтрДлина(" _______________________________________ ")));

//КлиентРегионПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеРегион_NEW");
//Документ.Variables.Add("МестоРегион",ПоЦентру(КлиентРегионПроживания,СтрДлина(" _____________________________________________________________  ")));
Документ.Variables.Add("МестоРегион",ПоЦентру(ДанныеАнкетыФМС.МестоРегион,СтрДлина(" _____________________________________________________________  ")));

//КлиентРайонПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеРайон");
//Документ.Variables.Add("МестоРайон",ПоЦентру(КлиентРайонПроживания,СтрДлина("________________________________________________________________")));
Документ.Variables.Add("МестоРайон",ПоЦентру(ДанныеАнкетыФМС.МестоРайон,СтрДлина("________________________________________________________________")));

//	ВвестиЗначение(ГородРожд,"Введите город проживания");
//КлиентГородПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеГород");
//Документ.Variables.Add("МестоГород",ПоЦентру(КлиентГородПроживания,СтрДлина(" ________________________________________________________________")));
Документ.Variables.Add("МестоГород",ПоЦентру(ДанныеАнкетыФМС.МестоГород,СтрДлина(" ________________________________________________________________")));

//КлиентНасПунктПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеНасПункт");
//Документ.Variables.Add("МестоНасПункт",ПоЦентру(КлиентНасПунктПроживания,СтрДлина(" ____________________________________________________ ")));
Документ.Variables.Add("МестоНасПункт",ПоЦентру(ДанныеАнкетыФМС.МестоНасПункт,СтрДлина(" ____________________________________________________ ")));

//Улица=Клиент.УлицаПроживания;
//ВвестиЗначение(Улица,"Улица");
//КлиентУлицаПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеУлица");
//Улица=КлиентУлицаПроживания;
//Документ.Variables.Add("МестоУл",ПоЦентру(КлиентУлицаПроживания,СтрДлина("_________________________")));
Документ.Variables.Add("МестоУл",ПоЦентру(ДанныеАнкетыФМС.МестоУл,СтрДлина("_________________________")));

//Дом="";
//КлиентДомПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеДом");
//Документ.Variables.Add("МестоДом",ПоЦентру(КлиентДомПроживания,СтрДлина("________")));
Документ.Variables.Add("МестоДом",ПоЦентру(ДанныеАнкетыФМС.МестоДом,СтрДлина("________")));

//Корп="";
//КлиентКорпусПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеКорпус");
//Документ.Variables.Add("МестоКорп",ПоЦентру(КлиентКорпусПроживания,СтрДлина("_________")));
Документ.Variables.Add("МестоКорп",ПоЦентру(ДанныеАнкетыФМС.МестоКорп,СтрДлина("_________")));

//Квартира="";
//ВвестиЗначение(Квартира,"Квартира");
//КлиентКвартираПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеКвартира");
//Документ.Variables.Add("МестоКВ",ПоЦентру(КлиентКвартираПроживания,СтрДлина("________")));
Документ.Variables.Add("МестоКВ",ПоЦентру(ДанныеАнкетыФМС.МестоКВ,СтрДлина("________")));

//Документ.Variables.Add("ПрибылДень",ПоЦентру(Формат(Объект.РезервС, "ДЛФ=DD"),СтрДлина("_______ ___________ ____г")));
Документ.Variables.Add("ПрибылДень",ПоЦентру(Формат(ДанныеАнкетыФМС.ПрибылДень, "ДЛФ=DD"),СтрДлина("_______ ___________ ____г")));

//Документ.Variables.Add("ВыбылДень",ПоЦентру(Формат(Объект.РезервПо, "ДЛФ=DD"),СтрДлина("________________ ____ г")));
Документ.Variables.Add("ВыбылДень",ПоЦентру(Формат(ДанныеАнкетыФМС.ВыбылДень, "ДЛФ=DD"),СтрДлина("________________ ____ г")));

//Документ.Variables.Add("РегДата",ПоЦентру(Формат(Объект.РезервС, "ДЛФ=DD"),СтрДлина("_____ ___________ г")));
Документ.Variables.Add("РегДата",ПоЦентру(Формат(ДанныеАнкетыФМС.РегДата, "ДЛФ=DD"),СтрДлина("_____ ___________ г")));

t4 = ТекущаяУниверсальнаяДатаВМиллисекундах();
//Сообщить(t4 - t3);
ФормаИндикатор.ОбновитьИндикатор(70);

Документ.Fields.UpDate();

t5 = ТекущаяУниверсальнаяДатаВМиллисекундах();
//Сообщить(t5 - t4);

ФормаИндикатор.ОбновитьИндикатор(90);

Word.visible=истина;
	
// + ПСН
//MSWord.Activate()	
Word.Activate();
Документ.ActiveWindow.Caption = "Анкета ФМС";
ФормаИндикатор.ОбновитьИндикатор(100);

Word = Неопределено;

ФормаИндикатор.Закрыть();
// - ПСН
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАнкетыФМСДействие_SearchReplace(Параметры) 
ф = Параметры.ФайлШаблона;
	
БольшаяСтрока=СтрДлина("______________________________________________________________________");
Word = Новый COMОбъект("Word.Application");

t0 = ТекущаяУниверсальнаяДатаВМиллисекундах();
Сообщить("0");

Word.Documents.Add(ф.ПолноеИмя);

t1 = ТекущаяУниверсальнаяДатаВМиллисекундах();
Сообщить((t1 - t0));
Документ=Word.ActiveDocument;

//Word.visible=истина;

t2 = ТекущаяУниверсальнаяДатаВМиллисекундах();
Сообщить((t2 - t1));

ДанныеАнкетыФМС = ДанныеАнкетыФМС(); 

t3 = ТекущаяУниверсальнаяДатаВМиллисекундах();
Сообщить((t3 - t2));

//Ответ = ОбщийМодульНастройки.ПечатьАнкетыФМСЗаявкаНаБронированиеПараметры();

//// + ПСН 
////Документ.Variables.Add("Отель",ПоЦентру("Гостиница ""Реноме""",БольшаяСтрока));
////Документ.Variables.Add("АдресОтель",ПоЦентру("г. Екатеринбург ул. 8 марта 50",БольшаяСтрока));
//Документ.Variables.Add("Отель",ПоЦентру(Ответ.Отель, БольшаяСтрока));
//Документ.Variables.Add("АдресОтель",ПоЦентру(Ответ.АдресОтель, БольшаяСтрока));
//// - ПСН 

//Документ.Variables.Add("Отель",ПоЦентру(ДанныеАнкетыФМС.Отель, БольшаяСтрока));
SearchReplace(Документ,"Отель", ПоЦентру(ДанныеАнкетыФМС.Отель, БольшаяСтрока));

//Документ.Variables.Add("АдресОтель",ПоЦентру(ДанныеАнкетыФМС.АдресОтель, БольшаяСтрока));
SearchReplace(Документ,"АдресОтель", ПоЦентру(ДанныеАнкетыФМС.АдресОтель, БольшаяСтрока));

//НомерВРезервНаименование = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.НомерВРезерв, "Наименование");
//Документ.Variables.Add("НомерКомнаты",ПоЦентру(НомерВРезервНаименование, СтрДлина("__________ ")));
//Документ.Variables.Add("НомерКомнаты",ПоЦентру(ДанныеАнкетыФМС.НомерКомнаты, СтрДлина("__________ ")));
SearchReplace(Документ,"НомерКомнаты",ПоЦентру(ДанныеАнкетыФМС.НомерКомнаты, СтрДлина("__________ ")));

//КлиентФамилия = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Фамилия");
//Документ.Variables.Add("Фамилия",ПоЦентру(КлиентФамилия,СтрДлина("__________________________________________________________  ")));
//Документ.Variables.Add("Фамилия",ПоЦентру(ДанныеАнкетыФМС.Фамилия, СтрДлина("__________________________________________________________  ")));
SearchReplace(Документ,"Фамилия",ПоЦентру(ДанныеАнкетыФМС.Фамилия, СтрДлина("__________________________________________________________  ")));

//КлиентИмя = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Имя");
//Документ.Variables.Add("Имя",ПоЦентру(КлиентИмя,СтрДлина("______________________________________________________________  ")));
//Документ.Variables.Add("Имя",ПоЦентру(ДанныеАнкетыФМС.Имя, СтрДлина("______________________________________________________________  ")));
SearchReplace(Документ,"Имя",ПоЦентру(ДанныеАнкетыФМС.Имя, СтрДлина("______________________________________________________________  ")));

//КлиентОтчество = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Отчество");
//Документ.Variables.Add("Очество",ПоЦентру(КлиентОтчество,СтрДлина("__________________________________________________         ")));
//Документ.Variables.Add("Очество",ПоЦентру(ДанныеАнкетыФМС.Отчество, СтрДлина("__________________________________________________         ")));
SearchReplace(Документ,"Отчество",ПоЦентру(ДанныеАнкетыФМС.Отчество, СтрДлина("__________________________________________________         ")));

//КлиентДатаРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ДатаРождения");
//Документ.Variables.Add("ДатаР",ПоЦентру(Формат(КлиентДатаРождения, "ДЛФ=DD"),СтрДлина("""________  "" ______________ _______")));
//Документ.Variables.Add("ДатаР",ПоЦентру(Формат(ДанныеАнкетыФМС.ДатаР, "ДЛФ=DD"),СтрДлина("""________  "" ______________ _______")));
SearchReplace(Документ,"ДатаР",ПоЦентру(Формат(ДанныеАнкетыФМС.ДатаР, "ДЛФ=DD"),СтрДлина("""________  "" ______________ _______")));

//КлиентПол = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Пол");
//Документ.Variables.Add("МЖ",ПоЦентру(?(КлиентПол = ПредопределенноеЗначение("Перечисление.Пол.Мужской"),"Муж.","Жен."),8));
//Документ.Variables.Add("МЖ",ПоЦентру(ДанныеАнкетыФМС.МЖ, 8));
SearchReplace(Документ,"МЖ",ПоЦентру(ДанныеАнкетыФМС.МЖ, 8));

//КлиентСтранаРожденияСсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеСтранаФМС_NEW");
//СтранаРожд = ОбщийФункционалСервер.СправочникНайтиПоРеквизитуНаСервере("СтраныФМС_NEW", "Наименование", КлиентСтранаРожденияСсылка);
//Если НЕ ЗначениеЗаполнено(СтранаРожд) Тогда СтранаРожд = "Россия"; КонецЕсли;
//Документ.Variables.Add("Страна",ПоЦентру(СтранаРожд,СтрДлина(" ____________________________________________")));
//Документ.Variables.Add("Страна",ПоЦентру(ДанныеАнкетыФМС.Страна,СтрДлина(" ____________________________________________")));
SearchReplace(Документ,"Страна",ПоЦентру(ДанныеАнкетыФМС.Страна,СтрДлина(" ____________________________________________")));

//КлиентРегионРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеРегион_NEW");
//Документ.Variables.Add("Регион",ПоЦентру(КлиентРегионРождения,СтрДлина(" ____________________________________________________________  ")));
//Документ.Variables.Add("Регион",ПоЦентру(ДанныеАнкетыФМС.Регион,СтрДлина(" ____________________________________________________________  ")));
SearchReplace(Документ,"Регион",ПоЦентру(ДанныеАнкетыФМС.Регион,СтрДлина(" ____________________________________________________________  ")));

//КлиентРайонРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеРайон");
//Документ.Variables.Add("Район",ПоЦентру(КлиентРайонРождения,СтрДлина(" ________________________________________________________________")));
//Документ.Variables.Add("Район",ПоЦентру(ДанныеАнкетыФМС.Район,СтрДлина(" ________________________________________________________________")));
SearchReplace(Документ,"Район",ПоЦентру(ДанныеАнкетыФМС.Район,СтрДлина(" ________________________________________________________________")));

//КлиентГородРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеГород");
//Документ.Variables.Add("Город",ПоЦентру(КлиентГородРождения,СтрДлина(" ________________________________________________________________")));
//Документ.Variables.Add("Город",ПоЦентру(ДанныеАнкетыФМС.Город,СтрДлина(" ________________________________________________________________")));
SearchReplace(Документ,"Город",ПоЦентру(ДанныеАнкетыФМС.Город,СтрДлина(" ________________________________________________________________")));

//НасПунктРождения="";
//КлиентНасПунктРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеНасПункт");
//Документ.Variables.Add("НасПункт",ПоЦентру(ДанныеАнкетыФМС.НасПункт,СтрДлина("____________________________Нас пункт_________________")));
SearchReplace(Документ,"НасПункт",ПоЦентру(ДанныеАнкетыФМС.НасПункт,СтрДлина("____________________________Нас пункт_________________")));

//КлиентГражданствоСсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ГражданствоФМС_NEW");
//Гражданство = ОбщийФункционалСервер.СправочникНайтиПоРеквизитуНаСервере("СтраныФМС_NEW", "Наименование", КлиентГражданствоСсылка);
//Документ.Variables.Add("Гражданство",ПоЦентру(Гражданство,СтрДлина("________________________________РФ______________________")));
//Документ.Variables.Add("Гражданство",ПоЦентру(ДанныеАнкетыФМС.Гражданство,СтрДлина("________________________________РФ______________________")));
SearchReplace(Документ,"Гражданство",ПоЦентру(ДанныеАнкетыФМС.Гражданство,СтрДлина("________________________________РФ______________________")));
//----Перечень значений  _____________________________

// Паспорт
// + ПСН
//КлиентВидДокументаУдостоверяющегоЛичность = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ВидДокументаУдостоверяющегоЛичность");
//КлиентТипДокументаФМССсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ТипДокументаФМС_NEW");
//КлиентВидДокументаУдостоверяющегоЛичность = ОбщийФункционалСервер.СправочникНайтиПоРеквизитуНаСервере("ТипДокументаФМС_NEW", "Наименование", КлиентТипДокументаФМССсылка);
// - ПСН
//"____________________________________ "
// 1234567891123456789212345678931234567
//Документ.Variables.Add("ВидДок",ПоЦентру(КлиентВидДокументаУдостоверяющегоЛичность,СтрДлина("____________________________________ ")));
//Документ.Variables.Add("ВидДок",ПоЦентру(ДанныеАнкетыФМС.ВидДок, СтрДлина("____________________________________ ")));
SearchReplace(Документ,"ВидДок",ПоЦентру(ДанныеАнкетыФМС.ВидДок, СтрДлина("____________________________________ ")));

//КлиентСерия = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Серия");
//Документ.Variables.Add("СерДок",ПоЦентру(КлиентСерия,СтрДлина("________")));
//Документ.Variables.Add("СерДок",ПоЦентру(ДанныеАнкетыФМС.СерДок,СтрДлина("________")));
SearchReplace(Документ,"СерДок",ПоЦентру(ДанныеАнкетыФМС.СерДок,СтрДлина("________")));

//КлиентНомер = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Номер");
//Документ.Variables.Add("НомерДок",ПоЦентру(КлиентНомер,СтрДлина("______")));
//Документ.Variables.Add("НомерДок",ПоЦентру(ДанныеАнкетыФМС.НомерДок,СтрДлина("______")));
SearchReplace(Документ,"НомерДок",ПоЦентру(ДанныеАнкетыФМС.НомерДок,СтрДлина("______")));

//КлиентДатаВыдачи = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ДатаВыдачи");
//Документ.Variables.Add("ДеньВыд",ПоЦентру(Формат(КлиентДатаВыдачи, "ДЛФ=DD"),СтрДлина("  ""________"" _____________")));
//Документ.Variables.Add("ДеньВыд",ПоЦентру(Формат(ДанныеАнкетыФМС.ДеньВыд, "ДЛФ=DD"),СтрДлина("  ""________"" _____________")));
SearchReplace(Документ,"ДеньВыд",ПоЦентру(Формат(ДанныеАнкетыФМС.ДеньВыд, "ДЛФ=DD"),СтрДлина("  ""________"" _____________")));

//КлиентКемВыдан = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "КемВыдан");
//КлиентКемВыдан = КлиентКемВыдан(Объект.Клиент);
//Документ.Variables.Add("Орган1",ПоЦентру(КлиентКемВыдан,СтрДлина("_____________________________________________")));
//Документ.Variables.Add("Орган1",ПоЦентру(ДанныеАнкетыФМС.Орган1,СтрДлина("_____________________________________________")));
SearchReplace(Документ,"Орган1",ПоЦентру(ДанныеАнкетыФМС.Орган1,СтрДлина("_____________________________________________")));

//КлиентКодОргана = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "КодОргана");
//Документ.Variables.Add("ОрганКод",ПоЦентру(КлиентКодОргана,СтрДлина("_____________________________")));
//Документ.Variables.Add("ОрганКод",ПоЦентру(ДанныеАнкетыФМС.ОрганКод,СтрДлина("_____________________________")));
SearchReplace(Документ,"ОрганКод",ПоЦентру(ДанныеАнкетыФМС.ОрганКод,СтрДлина("_____________________________")));

//КлиентСтранаПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "СтранаПроживания");
//Документ.Variables.Add("МестоСтрана",ПоЦентру(КлиентСтранаПроживания,СтрДлина(" _______________________________________ ")));

//КлиентСтранаПроживания = "Россия";
//Документ.Variables.Add("МестоСтрана",ПоЦентру(КлиентСтранаПроживания,СтрДлина(" _______________________________________ ")));
//Документ.Variables.Add("МестоСтрана",ПоЦентру(ДанныеАнкетыФМС.МестоСтрана,СтрДлина(" _______________________________________ ")));
SearchReplace(Документ,"МестоСтрана",ПоЦентру(ДанныеАнкетыФМС.МестоСтрана,СтрДлина(" _______________________________________ ")));

//КлиентРегионПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеРегион_NEW");
//Документ.Variables.Add("МестоРегион",ПоЦентру(КлиентРегионПроживания,СтрДлина(" _____________________________________________________________  ")));
//Документ.Variables.Add("МестоРегион",ПоЦентру(ДанныеАнкетыФМС.МестоРегион,СтрДлина(" _____________________________________________________________  ")));
SearchReplace(Документ,"МестоРегион",ПоЦентру(ДанныеАнкетыФМС.МестоРегион,СтрДлина(" _____________________________________________________________  ")));

//КлиентРайонПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеРайон");
//Документ.Variables.Add("МестоРайон",ПоЦентру(КлиентРайонПроживания,СтрДлина("________________________________________________________________")));
//Документ.Variables.Add("МестоРайон",ПоЦентру(ДанныеАнкетыФМС.МестоРайон,СтрДлина("________________________________________________________________")));
SearchReplace(Документ,"МестоРайон",ПоЦентру(ДанныеАнкетыФМС.МестоРайон,СтрДлина("________________________________________________________________")));

//	ВвестиЗначение(ГородРожд,"Введите город проживания");
//КлиентГородПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеГород");
//Документ.Variables.Add("МестоГород",ПоЦентру(КлиентГородПроживания,СтрДлина(" ________________________________________________________________")));
//Документ.Variables.Add("МестоГород",ПоЦентру(ДанныеАнкетыФМС.МестоГород,СтрДлина(" ________________________________________________________________")));
SearchReplace(Документ,"МестоГород",ПоЦентру(ДанныеАнкетыФМС.МестоГород,СтрДлина(" ________________________________________________________________")));

//КлиентНасПунктПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеНасПункт");
//Документ.Variables.Add("МестоНасПункт",ПоЦентру(КлиентНасПунктПроживания,СтрДлина(" ____________________________________________________ ")));
//Документ.Variables.Add("МестоНасПункт",ПоЦентру(ДанныеАнкетыФМС.МестоНасПункт,СтрДлина(" ____________________________________________________ ")));
SearchReplace(Документ,"МестоНасПункт",ПоЦентру(ДанныеАнкетыФМС.МестоНасПункт,СтрДлина(" ____________________________________________________ ")));

//Улица=Клиент.УлицаПроживания;
//ВвестиЗначение(Улица,"Улица");
//КлиентУлицаПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеУлица");
//Улица=КлиентУлицаПроживания;
//Документ.Variables.Add("МестоУл",ПоЦентру(КлиентУлицаПроживания,СтрДлина("_________________________")));
//Документ.Variables.Add("МестоУл",ПоЦентру(ДанныеАнкетыФМС.МестоУл,СтрДлина("_________________________")));
SearchReplace(Документ,"МестоУл",ПоЦентру(ДанныеАнкетыФМС.МестоУл,СтрДлина("_________________________")));

//Дом="";
//КлиентДомПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеДом");
//Документ.Variables.Add("МестоДом",ПоЦентру(КлиентДомПроживания,СтрДлина("________")));
//Документ.Variables.Add("МестоДом",ПоЦентру(ДанныеАнкетыФМС.МестоДом,СтрДлина("________")));
SearchReplace(Документ,"МестоДом",ПоЦентру(ДанныеАнкетыФМС.МестоДом,СтрДлина("________")));

//Корп="";
//КлиентКорпусПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеКорпус");
//Документ.Variables.Add("МестоКорп",ПоЦентру(КлиентКорпусПроживания,СтрДлина("_________")));
//Документ.Variables.Add("МестоКорп",ПоЦентру(ДанныеАнкетыФМС.МестоКорп,СтрДлина("_________")));
SearchReplace(Документ,"МестоКорп",ПоЦентру(ДанныеАнкетыФМС.МестоКорп,СтрДлина("_________")));

//Квартира="";
//ВвестиЗначение(Квартира,"Квартира");
//КлиентКвартираПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеКвартира");
//Документ.Variables.Add("МестоКВ",ПоЦентру(КлиентКвартираПроживания,СтрДлина("________")));
//Документ.Variables.Add("МестоКВ",ПоЦентру(ДанныеАнкетыФМС.МестоКВ,СтрДлина("________")));
SearchReplace(Документ,"МестоКВ",ПоЦентру(ДанныеАнкетыФМС.МестоКВ,СтрДлина("________")));

//Документ.Variables.Add("ПрибылДень",ПоЦентру(Формат(Объект.РезервС, "ДЛФ=DD"),СтрДлина("_______ ___________ ____г")));
//Документ.Variables.Add("ПрибылДень",ПоЦентру(Формат(ДанныеАнкетыФМС.ПрибылДень, "ДЛФ=DD"),СтрДлина("_______ ___________ ____г")));
SearchReplace(Документ,"ПрибылДень",ПоЦентру(Формат(ДанныеАнкетыФМС.ПрибылДень, "ДЛФ=DD"),СтрДлина("_______ ___________ ____г")));

//Документ.Variables.Add("ВыбылДень",ПоЦентру(Формат(Объект.РезервПо, "ДЛФ=DD"),СтрДлина("________________ ____ г")));
//Документ.Variables.Add("ВыбылДень",ПоЦентру(Формат(ДанныеАнкетыФМС.ВыбылДень, "ДЛФ=DD"),СтрДлина("________________ ____ г")));
SearchReplace(Документ,"ВыбылДень",ПоЦентру(Формат(ДанныеАнкетыФМС.ВыбылДень, "ДЛФ=DD"),СтрДлина("________________ ____ г")));

//Документ.Variables.Add("РегДата",ПоЦентру(Формат(Объект.РезервС, "ДЛФ=DD"),СтрДлина("_____ ___________ г")));
//Документ.Variables.Add("РегДата",ПоЦентру(Формат(ДанныеАнкетыФМС.РегДата, "ДЛФ=DD"),СтрДлина("_____ ___________ г")));
SearchReplace(Документ,"РегДата",ПоЦентру(Формат(ДанныеАнкетыФМС.РегДата, "ДЛФ=DD"),СтрДлина("_____ ___________ г")));

t4 = ТекущаяУниверсальнаяДатаВМиллисекундах();
Сообщить(t4 - t3);

//Документ.Fields.UpDate();

//t5 = ТекущаяУниверсальнаяДатаВМиллисекундах();
//Сообщить(t5 - t4);

Word.visible=истина;
	
// + ПСН
//MSWord.Activate()	
Word.Activate();
Документ.ActiveWindow.Caption = "Анкета ФМС";

// - ПСН
КонецПроцедуры

&НаКлиенте
Процедура SearchReplace(Документ,FindText, ReplaceText)
//ActiveDocument.Content 
//myRange.Find.Execute FindText:="hi", ReplaceWith:="hello", _ 
// Replace:=wdReplaceAll
 //findObject = Application.Selection.Find;
	findObject = Документ.Content.Find;
    findObject.ClearFormatting();
    findObject.Text = FindText;
    findObject.Replacement.ClearFormatting();
    findObject.Replacement.Text = ReplaceText;

	//replaceAll = Word.WdReplace.wdReplaceOne;
    replaceAll = 1;
    findObject.Execute(, , , , ,
        , , , , ,
        replaceAll, , , , );
КонецПроцедуры

&НаСервере
Функция ДанныеАнкетыФМС() 
ДанныеАнкетыФМС = Новый Структура;

//ф = Параметры.ФайлШаблона;
//	
//БольшаяСтрока=СтрДлина("______________________________________________________________________");
//Word = Новый COMОбъект("Word.Application");
//Word.Documents.Add(ф.ПолноеИмя);
//Документ=Word.ActiveDocument;

Ответ = КлиентыСервер.ПечатьАнкетыФМСЗаявкаНаБронированиеПараметры();

// + ПСН 
//Документ.Variables.Add("Отель",ПоЦентру("Гостиница ""Реноме""",БольшаяСтрока));
//Документ.Variables.Add("АдресОтель",ПоЦентру("г. Екатеринбург ул. 8 марта 50",БольшаяСтрока));
//Документ.Variables.Add("Отель",ПоЦентру(Ответ.Отель, БольшаяСтрока));
//Документ.Variables.Add("АдресОтель",ПоЦентру(Ответ.АдресОтель, БольшаяСтрока));

ДанныеАнкетыФМС.Вставить("Отель", Ответ.Отель);
ДанныеАнкетыФМС.Вставить("АдресОтель", Ответ.АдресОтель);
// - ПСН 

//НомерВРезервНаименование = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.НомерВРезерв, "Наименование");
//Документ.Variables.Add("НомерКомнаты",ПоЦентру(НомерВРезервНаименование, СтрДлина("__________ ")));
ДанныеАнкетыФМС.Вставить("НомерКомнаты", Объект.НомерВРезерв.Наименование);

//КлиентФамилия = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Фамилия");
//Документ.Variables.Add("Фамилия",ПоЦентру(КлиентФамилия,СтрДлина("__________________________________________________________  ")));
ДанныеАнкетыФМС.Вставить("Фамилия", Объект.Клиент.Фамилия);

//КлиентИмя = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Имя");
//Документ.Variables.Add("Имя",ПоЦентру(КлиентИмя,СтрДлина("______________________________________________________________  ")));
ДанныеАнкетыФМС.Вставить("Имя", Объект.Клиент.Имя);

//КлиентОтчество = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Отчество");
//Документ.Variables.Add("Очество",ПоЦентру(КлиентОтчество,СтрДлина("__________________________________________________         ")));
ДанныеАнкетыФМС.Вставить("Отчество", Объект.Клиент.Отчество);

//КлиентДатаРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ДатаРождения");
//Документ.Variables.Add("ДатаР",ПоЦентру(Формат(КлиентДатаРождения, "ДЛФ=DD"),СтрДлина("""________  "" ______________ _______")));
ДанныеАнкетыФМС.Вставить("ДатаР", Объект.Клиент.ДатаРождения);

//КлиентПол = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Пол");
//Документ.Variables.Add("МЖ",ПоЦентру(?(КлиентПол = ПредопределенноеЗначение("Перечисление.Пол.Мужской"),"Муж.","Жен."),8));
ДанныеАнкетыФМС.Вставить("МЖ", ?(Объект.Клиент.Пол = Перечисления.Пол.Мужской, "Муж." ,"Жен."));

//КлиентСтранаРожденияСсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеСтранаФМС_NEW");
//СтранаРожд = ОбщийФункционалСервер.СправочникНайтиПоРеквизитуНаСервере("СтраныФМС_NEW", "Наименование", КлиентСтранаРожденияСсылка);
//Если НЕ ЗначениеЗаполнено(СтранаРожд) Тогда СтранаРожд = "Россия"; КонецЕсли;
//Документ.Variables.Add("Страна",ПоЦентру(СтранаРожд,СтрДлина(" ____________________________________________")));

//КлиентСтранаРожденияСсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеСтранаФМС_NEW");
СтранаРожд = Объект.Клиент.РождениеСтранаФМС_NEW.Наименование;
Если НЕ ЗначениеЗаполнено(СтранаРожд) Тогда СтранаРожд = "Россия"; КонецЕсли;
ДанныеАнкетыФМС.Вставить("Страна", СтранаРожд);

//КлиентРегионРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеРегион_NEW");
//Документ.Variables.Add("Регион",ПоЦентру(КлиентРегионРождения,СтрДлина(" ____________________________________________________________  ")));
ДанныеАнкетыФМС.Вставить("Регион", Объект.Клиент.РождениеРегион_NEW);

//КлиентРайонРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеРайон");
//Документ.Variables.Add("Район",ПоЦентру(КлиентРайонРождения,СтрДлина(" ________________________________________________________________")));
ДанныеАнкетыФМС.Вставить("Район", Объект.Клиент.РождениеРайон);

//КлиентГородРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеГород");
//Документ.Variables.Add("Город",ПоЦентру(КлиентГородРождения,СтрДлина(" ________________________________________________________________")));
ДанныеАнкетыФМС.Вставить("Город", Объект.Клиент.РождениеГород);

//НасПунктРождения="";
//КлиентНасПунктРождения = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "РождениеНасПункт");
//Документ.Variables.Add("НасПункт",ПоЦентру(КлиентНасПунктРождения,СтрДлина("____________________________Нас пункт_________________")));
ДанныеАнкетыФМС.Вставить("НасПункт", Объект.Клиент.РождениеНасПункт);

//КлиентГражданствоСсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ГражданствоФМС_NEW");
Гражданство = Объект.Клиент.ГражданствоФМС_NEW.Наименование;
//Документ.Variables.Add("Гражданство",ПоЦентру(Гражданство,СтрДлина("________________________________РФ______________________")));
Если НЕ ЗначениеЗаполнено(Гражданство) Тогда Гражданство = "РФ"; КонецЕсли;
ДанныеАнкетыФМС.Вставить("Гражданство", Гражданство);
//----Перечень значений  _____________________________

// Паспорт
// + ПСН
//КлиентВидДокументаУдостоверяющегоЛичность = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ВидДокументаУдостоверяющегоЛичность");
//КлиентТипДокументаФМССсылка = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ТипДокументаФМС_NEW");
//КлиентВидДокументаУдостоверяющегоЛичность = ОбщийФункционалСервер.СправочникНайтиПоРеквизитуНаСервере("ТипДокументаФМС_NEW", "Наименование", КлиентТипДокументаФМССсылка);
// - ПСН
//"____________________________________ "
// 1234567891123456789212345678931234567
//Документ.Variables.Add("ВидДок",ПоЦентру(КлиентВидДокументаУдостоверяющегоЛичность,СтрДлина("____________________________________ ")));
ДанныеАнкетыФМС.Вставить("ВидДок", Объект.Клиент.ТипДокументаФМС_NEW.ВидДокументаУдостоверяющегоЛичностьАнкетаФМС);

//КлиентСерия = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Серия");
//Документ.Variables.Add("СерДок",ПоЦентру(КлиентСерия,СтрДлина("________")));
ДанныеАнкетыФМС.Вставить("СерДок", Объект.Клиент.Серия);

//КлиентНомер = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "Номер");
//Документ.Variables.Add("НомерДок",ПоЦентру(КлиентНомер,СтрДлина("______")));
ДанныеАнкетыФМС.Вставить("НомерДок", Объект.Клиент.Номер);

//КлиентДатаВыдачи = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ДатаВыдачи");
//Документ.Variables.Add("ДеньВыд",ПоЦентру(Формат(КлиентДатаВыдачи, "ДЛФ=DD"),СтрДлина("  ""________"" _____________")));
ДанныеАнкетыФМС.Вставить("ДеньВыд", Объект.Клиент.ДатаВыдачи);

//КлиентКемВыдан = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "КемВыдан");
КлиентКемВыдан = КлиентКемВыдан(Объект.Клиент);
//Документ.Variables.Add("Орган1",ПоЦентру(КлиентКемВыдан,СтрДлина("_____________________________________________")));
ДанныеАнкетыФМС.Вставить("Орган1", КлиентКемВыдан);

//КлиентКодОргана = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "КодОргана");
//Документ.Variables.Add("ОрганКод",ПоЦентру(КлиентКодОргана,СтрДлина("_____________________________")));
ДанныеАнкетыФМС.Вставить("ОрганКод", Объект.Клиент.КодОргана);

//КлиентСтранаПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "СтранаПроживания");
//Документ.Variables.Add("МестоСтрана",ПоЦентру(КлиентСтранаПроживания,СтрДлина(" _______________________________________ ")));

КлиентСтранаПроживания = "Россия";
//Документ.Variables.Add("МестоСтрана",ПоЦентру(КлиентСтранаПроживания,СтрДлина(" _______________________________________ ")));
ДанныеАнкетыФМС.Вставить("МестоСтрана", КлиентСтранаПроживания);

//КлиентРегионПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеРегион_NEW");
//Документ.Variables.Add("МестоРегион",ПоЦентру(КлиентРегионПроживания,СтрДлина(" _____________________________________________________________  ")));
ДанныеАнкетыФМС.Вставить("МестоРегион", Объект.Клиент.ПроживаниеРегион_NEW);

//КлиентРайонПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеРайон");
//Документ.Variables.Add("МестоРайон",ПоЦентру(КлиентРайонПроживания,СтрДлина("________________________________________________________________")));
ДанныеАнкетыФМС.Вставить("МестоРайон", Объект.Клиент.ПроживаниеРайон);

//	ВвестиЗначение(ГородРожд,"Введите город проживания");
//КлиентГородПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеГород");
//Документ.Variables.Add("МестоГород",ПоЦентру(КлиентГородПроживания,СтрДлина(" ________________________________________________________________")));
ДанныеАнкетыФМС.Вставить("МестоГород", Объект.Клиент.ПроживаниеГород);

//КлиентНасПунктПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеНасПункт");
//Документ.Variables.Add("МестоНасПункт",ПоЦентру(КлиентНасПунктПроживания,СтрДлина(" ____________________________________________________ ")));
ДанныеАнкетыФМС.Вставить("МестоНасПункт", Объект.Клиент.ПроживаниеНасПункт);

//Улица=Клиент.УлицаПроживания;
//ВвестиЗначение(Улица,"Улица");
//КлиентУлицаПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеУлица");
//Улица=КлиентУлицаПроживания;
//Документ.Variables.Add("МестоУл",ПоЦентру(КлиентУлицаПроживания,СтрДлина("_________________________")));
//Дом="";
ДанныеАнкетыФМС.Вставить("МестоУл", Объект.Клиент.ПроживаниеУлица);

//КлиентДомПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеДом");
//Документ.Variables.Add("МестоДом",ПоЦентру(КлиентДомПроживания,СтрДлина("________")));
//Корп="";
ДанныеАнкетыФМС.Вставить("МестоДом", Объект.Клиент.ПроживаниеДом);

//КлиентКорпусПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеКорпус");
//Документ.Variables.Add("МестоКорп",ПоЦентру(КлиентКорпусПроживания,СтрДлина("_________")));
//Квартира="";
ДанныеАнкетыФМС.Вставить("МестоКорп", Объект.Клиент.ПроживаниеКорпус);

//ВвестиЗначение(Квартира,"Квартира");
//КлиентКвартираПроживания = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Клиент, "ПроживаниеКвартира");
//Документ.Variables.Add("МестоКВ",ПоЦентру(КлиентКвартираПроживания,СтрДлина("________")));
ДанныеАнкетыФМС.Вставить("МестоКВ", Объект.Клиент.ПроживаниеКвартира);

//Документ.Variables.Add("ПрибылДень",ПоЦентру(Формат(Объект.РезервС, "ДЛФ=DD"),СтрДлина("_______ ___________ ____г")));
ДанныеАнкетыФМС.Вставить("ПрибылДень", Объект.РезервС);

//Документ.Variables.Add("ВыбылДень",ПоЦентру(Формат(Объект.РезервПо, "ДЛФ=DD"),СтрДлина("________________ ____ г")));
ДанныеАнкетыФМС.Вставить("ВыбылДень", Объект.РезервПо);

//Документ.Variables.Add("РегДата",ПоЦентру(Формат(Объект.РезервС, "ДЛФ=DD"),СтрДлина("_____ ___________ г")));
ДанныеАнкетыФМС.Вставить("РегДата", Объект.РезервС);

Возврат ДанныеАнкетыФМС;
КонецФункции

&НаСервере
Функция КлиентКемВыдан(Клиент)
ПунктыВыдачиФМС_NEW = Клиент.ПунктыВыдачиФМС_NEW;
Если ТипЗнч(ПунктыВыдачиФМС_NEW) = Тип("СправочникСсылка.ПунктыВыдачиФМС_NEW") Тогда
	КлиентКемВыдан = ПунктыВыдачиФМС_NEW.Наименование;
ИначеЕсли ТипЗнч(ПунктыВыдачиФМС_NEW) = Тип("Строка") Тогда
	КлиентКемВыдан = ПунктыВыдачиФМС_NEW;
Иначе
	КлиентКемВыдан = "";
КонецЕсли;	 

Возврат КлиентКемВыдан;
КонецФункции

&НаКлиенте
Функция ПоЦентру(ИСтр,ИКолВо)
	КолВо2=ИКолВо;
	Стр=СокрЛП(ИСтр);
	ИзначДлинна=СтрДлина(Стр);
	КолВо2=КолВо2-ИзначДлинна;
	Пока СтрДлина(Стр)<ИзначДлинна+Окр(КолВо2/2) цикл
		Стр="_"+Стр;
	конеццикла;
	
	Пока СтрДлина(Стр)<ИзначДлинна+КолВо2 цикл
		Стр=Стр+"_";
	конеццикла;
	
	Возврат Стр;
	
КонецФункции
//

// 
&НаКлиенте
Процедура СформироватьПодтверждениеБрони(Команда)
ТабличныйДокумент = Неопределено;
Контрагент = Объект.Клиент;

ТД = Элементы.Счета.ТекущиеДанные;
Если ТД = Неопределено Тогда
	Возврат;
КонецЕсли;
СчетГУИД = ТД.СчетГУИД;

ПечатьКлиент.ОткрытьФормуПечатьСчетаИПодтверждения(ЭтаФорма, Объект.Ссылка,  СчетГУИД, Контрагент
	, ТабличныйДокумент, Истина, СчетАнгл);
КонецПроцедуры

&НаСервере
Функция ПолучитьПодтверждениеБрониНаСервере_НеИспользуется(БроньСсылка)
	Поиск=Новый Запрос("ВЫБРАТЬ
	|	ПодтверждениеБронированияНомера.Ссылка
	|ИЗ
	|	Документ.ПодтверждениеБронирования.Номера КАК ПодтверждениеБронированияНомера
	|ГДЕ
	|	ПодтверждениеБронированияНомера.Бронь = &Бронь");
	Поиск.УстановитьПараметр("Бронь", БроньСсылка);
	ТЗ = Поиск.Выполнить().Выгрузить();
	
	МассивСтрок = ОбщийФункционалСервер.ТаблицаЗначенийВМассивСтруктур(ТЗ);
	Возврат МассивСтрок;
	
	//Если ТЗ.Количество()<>0 тогда
	//	Об=ТЗ[0].ссылка.получитьОбъект();
	//иначе
	//	Об=Документы.ПодтверждениеБронирования.СоздатьДокумент();
	//	Нов=Об.Номера.Добавить();
	//	Нов.Бронь=ссылка;
	//	Нов.ФИО=Клиент.Наименование;
	//	
	//конецесли;
	//
	//Об.ПолучитьФорму("ФормаДокумента").Открыть();
	
КонецФункции
//
/////// - Печать ///////


//
&НаКлиенте
Процедура Шахматка(Команда)
	ВывестиШахматку(Объект.РезервС - 1*86400, Объект.РезервПо + 1*86400, "Час");
	ЭтаФорма.ТекущийЭлемент = Элементы.ПолеОтчета;
КонецПроцедуры

&НаСервере
Функция ВывестиШахматку(ДатаС,ДатаПо,Детализация)  
	ТЗШахм.Очистить();
	
	ДатаС=?(Детализация="День",НачалоДня(ДатаС),НачалоЧаса(ДатаС));
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЗанятостьНомеров.Клиент
	|ИЗ
	|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	|ГДЕ
	|	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	|	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
	
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
	ТЗКлиентов=Запрос.Выполнить().Выгрузить();
	
	ТЗКлиентов.Колонки.Добавить("Цвет");
// + ПСН	
	ТЗКлиентов.Колонки.Добавить("ЦветТекста");
// - ПСН	
	
	Сч=0;
	//СписокЦветов=Новый СписокЗначений;
	Для каждого СтрКлиент Из ТЗКлиентов Цикл		
		Случай=Новый ГенераторСлучайныхЧисел();
		СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
		СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
		СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
		НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
		Если ТЗКлиентов.Найти(НовЦвет,"Цвет")<>Неопределено тогда
			Случай=Новый ГенераторСлучайныхЧисел();
			СлучайР=Новый ГенераторСлучайныхЧисел(100+Случай.СлучайноеЧисло(0,1000));
			СлучайГ=Новый ГенераторСлучайныхЧисел(200+Случай.СлучайноеЧисло(0,1000));
			СлучайБ=Новый ГенераторСлучайныхЧисел(300+Случай.СлучайноеЧисло(0,1000));
			НовЦвет=Новый Цвет(СлучайР.СлучайноеЧисло(10,200),СлучайГ.СлучайноеЧисло(10,200),СлучайБ.СлучайноеЧисло(10,200));
		КонецЕсли;
		СтрКлиент.Цвет=НовЦвет;
// + ПСН		
		ЦветТекста = ОбщийФункционалСервер.ПолучитьЦветТекстаПоЦветуФона(НовЦвет);
		СтрКлиент.ЦветТекста = ЦветТекста;
// - ПСН		

	КонецЦикла; 
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЗанятостьНомеров.Номер,
	|	ЗанятостьНомеров.Клиент,
	|	ЗанятостьНомеров.ПериодРезерва
	|ИЗ
	|	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	|ГДЕ
	|	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДатаС И &ДатаПо
	|	И ЗанятостьНомеров.Номер = &Номер
	|	И ЗанятостьНомеров.Зарезервирован = ИСТИНА");	
	
	Запрос.УстановитьПараметр("ДатаС",ДатаС);						
	Запрос.УстановитьПараметр("ДатаПо",ДатаПо);
	//	ТЗЗапроса=Запрос.Выполнить().Выгрузить();
	    
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	ТемпС=ДатаС;
	ТемпПо=ДатаПо;
	
	//Макет=ПолучитьМакет("Макет");
	Макет=ПолучитьМакетНаСервере("Объект", "Макет");

	ТабДок=Новый ТабличныйДокумент;
	Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
	ТабДок.Присоединить(Обл);
	
	Обл=Макет.ПолучитьОбласть("Шапка|СтрПериод");
	Пока ТемпС<=ТемпПо цикл
		Обл.Параметры.Период=Формат(ТемпС, ?(Детализация="День","ДФ='dd.MM'","ДФ='dd.MM HH:mm'"));
		ТабДок.Присоединить(Обл);
		ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
	КонецЦикла;
	//ЭлементыФормы.ПолеОтчета.Вывести(ТабДок);
	ПолеОтчета.Вывести(ТабДок);
	
//	Возврат Неопределено;
	
	СпрНомеров=Справочники.НомернойФонд.Выбрать();
	Х=0;
	У=0;
	
	Пока СпрНомеров.Следующий() цикл
		Если СпрНомеров.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		
		У=У+1;
		
		ТабДок=Новый ТабличныйДокумент;
		ТемпС=ДатаС;
		ТемпПо=ДатаПо;
		
		Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
		Обл.Параметры.Номер=СпрНомеров.Наименование;
		ТабДок.Присоединить(Обл);
		
		ТемпКл=Справочники.Клиенты.ПустаяСсылка();
		СписОб=Новый СписокЗначений;
		Сч=1;
		НачИ=2;	
		Пока ТемпС<=ТемпПо цикл
			Х=Х+1;			
			ПС=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			ПК=?(Детализация="День",КонецДня(ТемпС),КонецЧаса(ТемпС));
			Запрос.УстановитьПараметр("ДатаС",ПС);						
			Запрос.УстановитьПараметр("ДатаПо",ПК);
			Запрос.УстановитьПараметр("Номер",СпрНомеров.Ссылка);
			ТЗЗапроса=Запрос.Выполнить().Выгрузить();
			Обл=Макет.ПолучитьОбласть("Строка|СтрПериод");
			
			Если ТЗЗапроса.Количество()<>0 тогда
				//Цв=ТЗКлиентов.Найти(ТЗЗапроса[0].Клиент,"Клиент").Цвет;
				КлиентЦвет=ТЗКлиентов.Найти(ТЗЗапроса[0].Клиент,"Клиент");
				Цв=КлиентЦвет.Цвет;
				
// + ПСН		
				ЦвТекста = КлиентЦвет.ЦветТекста; 
// - ПСН		
				
				ТекКл=ТЗЗапроса[0].Клиент;
				
				Обл.Область(1,1,1,1).ЦветФона=Цв;
// + ПСН		
				Обл.Область(1,1,1,1).ЦветТекста=ЦвТекста;
// - ПСН		

				
				Обл.Параметры.Период=ТекКл.Наименование;
				НовШ=ТЗШахм.Добавить();
				НовШ.Х=Х;
				НовШ.У=У;
				НовШ.Клиент=ТекКл;
				НовШ.Номер=СпрНомеров.Ссылка;
				НовШ.Период=?(Детализация="День",НачалоДня(ТемпС),НачалоЧаса(ТемпС));
			иначе
				ТекКл=Справочники.Клиенты.ПустаяСсылка();			
			конецесли;
			
			Если ТекКл<>ТемпКл тогда
				
				НовОб=новый Структура("Нач,Кон",НачИ,сч);
				СписОб.Добавить(НовОб);
				ТемпКл=ТекКл;
				НачИ=Сч+1;
				
			конецесли;
			
			ТабДок.Присоединить(Обл);
			ТемпС=ТемпС+?(Детализация="День",86400,3600*6);
			сч=сч+1;
		КонецЦикла;
		
		НовОб=новый Структура("Нач,Кон",НачИ,сч);
		СписОб.Добавить(НовОб);
		
		Для каждого Об Из СписОб Цикл
			ТабДок.Область(1,Об.Значение.Нач,1,Об.Значение.Кон).Объединить();
		КонецЦикла; 
		//ЭлементыФормы.ПолеОтчета.Вывести(ТабДок);
		ПолеОтчета.Вывести(ТабДок);
		
	КонецЦикла;
	
	//ЭлементыФормы.ПолеОтчета.ФиксацияСлева=1;
	ПолеОтчета.ФиксацияСлева=1;
	
	// + ПСН
	ПолеОтчета.ФиксацияСверху = 2;
	// - ПСН
	
	//ТЗЗапроса
КонецФункции
//


//
&НаСервере
Процедура ОсновныеДействияФормыАнкета__(Кнопка)
	//Если Не ЭтоНовый() тогда
	//	ЗапросПоискАнкеты=Новый Запрос("ВЫБРАТЬ
	//	|	Анкета.Ссылка
	//	|ИЗ
	//	|	Документ.Анкета КАК Анкета
	//	|ГДЕ
	//	|	Анкета.Бронь = &Бронь");
	//	ЗапросПоискАнкеты.УстановитьПараметр("Бронь",Ссылка);
	//	ТЗА=ЗапросПоискАнкеты.Выполнить().Выгрузить();
	//	Если ТЗА.Количество()<>0 тогда
	//		Об=ТЗА[0].ссылка.ПолучитьОбъект();
	//		Об.ПолучитьФорму().открыть();
	//	иначе
	//		НовА=Документы.Анкета.СоздатьДокумент();
	//		НовА.Бронь=Ссылка;
	//		НовА.Клиент=Клиент;
	//		НовА.ПолучитьФорму().Открыть();
	//		
	//	конецесли;
	//	
	//	
	//иначе
	//	Предупреждение("Сначала запишите бронь!");   
	//конецесли;
	//
	
КонецПроцедуры

&НаКлиенте
Процедура Анкета(Команда)
Если НастройкиСервер.ЭтоРеноме() ИЛИ НастройкиСервер.ЭтоЧехов() Тогда 
	АнкетаДействие(Истина);
Иначе	
	АнкетаДействие(Ложь);
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АнкетаДействие(ЭтоНоваяАнкета)
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		
		Массив = ЗапросПоискАнкеты(ЭтоНоваяАнкета);
		
		Если ЭтоНоваяАнкета Тогда
			ФормаИмя = "Документ.АнкетаНовая.Форма.ФормаДокумента";
		Иначе	
			ФормаИмя = "Документ.Анкета.Форма.ФормаДокумента";
		КонецЕсли;				
		
		Если Массив.Количество() <> 0 Тогда
			
			Ключ = Массив[0].Ссылка; 
			Парам = Новый Структура("Ключ", Ключ);
			
			ОткрытьФорму(ФормаИмя, Парам, ЭтаФорма
				,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		Иначе
			Ключ = Неопределено; 
			Парам = Новый Структура("Ключ", Ключ);
			
			ФормаАнкета = ОткрытьФорму(ФормаИмя, Парам, ЭтаФорма
				,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
				
			ФормаАнкета.Объект.Бронь =  Объект.Ссылка;
			ФормаАнкета.Объект.Клиент =  Объект.Клиент;
			
			Если ЭтоНоваяАнкета Тогда
				Телефон = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Клиент, "Телефон");	
				ФормаАнкета.Объект.Телефон = Телефон;
				ЭлПочта = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Клиент, "ЭлПочта");	
				ФормаАнкета.Объект.EMail = ЭлПочта;
			КонецЕсли;	
				
		КонецЕсли;
		
	иначе
		Предупреждение("Сначала запишите бронь!");   
	конецесли;
КонецПроцедуры

&НаСервере
Функция ЗапросПоискАнкеты(ЭтоНоваяАнкета)
Если ЭтоНоваяАнкета Тогда
	ЗапросПоискАнкеты = Новый Запрос("ВЫБРАТЬ
		|	Анкета.Ссылка
		|ИЗ
		|	Документ.АнкетаНовая КАК Анкета
		|ГДЕ
		|	Анкета.Бронь = &Бронь");
Иначе	
	ЗапросПоискАнкеты = Новый Запрос("ВЫБРАТЬ
         |	Анкета.Ссылка КАК Ссылка
         |ИЗ
         |	Документ.Анкета КАК Анкета
         |ГДЕ
         |	Анкета.Бронь = &Бронь");
КонецЕсли;	
	
ЗапросПоискАнкеты.УстановитьПараметр("Бронь", Объект.Ссылка);
ТЗА=ЗапросПоискАнкеты.Выполнить().Выгрузить();
Массив = ОбщийФункционалСервер.ТаблицаЗначенийВМассивСтруктур(ТЗА);

Возврат Массив;
КонецФункции


&НаКлиенте
Процедура Анкета_1(Команда)
	//Если ЗначениеЗаполнено(Объект.Ссылка) тогда
	//	
	//	Массив = ЗапросПоискАнкеты();
	//	
	//	Если Массив.Количество() <> 0 Тогда
	//		
	//		Ключ = Массив[0].Ссылка; 
	//		Парам = Новый Структура("Ключ", Ключ);
	//		ОткрытьФорму("Документ.Анкета.Форма.ФормаДокумента", Парам, ЭтаФорма
	//			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	//	Иначе
	//		Ключ = Неопределено; 
	//		Парам = Новый Структура("Ключ", Ключ);
	//		
	//		ФормаАнкета = ОткрытьФорму("Документ.Анкета.Форма.ФормаДокумента", Парам, ЭтаФорма
	//			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	//			
	//		ФормаАнкета.Объект.Бронь =  Объект.Ссылка;
	//		ФормаАнкета.Объект.Клиент =  Объект.Клиент;
	//	КонецЕсли;
	//	
	//иначе
	//	Предупреждение("Сначала запишите бронь!");   
	//конецесли;
КонецПроцедуры

&НаСервере
Функция ЗапросПоискАнкеты_1()
		ЗапросПоискАнкеты=Новый Запрос("ВЫБРАТЬ
		|	Анкета.Ссылка
		|ИЗ
		|	Документ.Анкета КАК Анкета
		|ГДЕ
		|	Анкета.Бронь = &Бронь");
		ЗапросПоискАнкеты.УстановитьПараметр("Бронь", Объект.Ссылка);
		ТЗА=ЗапросПоискАнкеты.Выполнить().Выгрузить();
		Массив = ОбщийФункционалСервер.ТаблицаЗначенийВМассивСтруктур(ТЗА);
		
		Возврат Массив;
КонецФункции
//


&НаКлиенте
Процедура ПоместитьВЛистОжидания(Команда)
Если Объект.СчетаДетальноОплаты.Количество() <> 0 Тогда
	ПоказатьПредупреждение(, "У заявки есть оплаты. 
		|
		|ОПЕРАЦИЯ ОТМЕНЯЕТСЯ ...
		| 
		|Для помещения Заявки в лист ожидания удалите оплаты");
	
	Возврат;
КонецЕсли;
	
Объект.ЛистОжидания = Истина;

Объект.НомерВРезерв = Неопределено;

//Объект.Проживание.Очистить();
//Объект.РаспределениеОплатДолги.Очистить();
//Объект.СчетаДетальноДолги.Очистить();
//Объект.Счета.Очистить();

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаКлиенте
Процедура HP(Команда)
	Объект.НовыйРассчет=НЕ Объект.НовыйРассчет;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетНаАнглийском(Команда)
Если ЭтаФорма.Модифицированность Тогда	
	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;	
КонецЕсли;

ДокументДолгПараметр = Объект.Ссылка;
НовыйРасчет = ПечатьСервер.ЭтоНовыйРасчет(ДокументДолгПараметр);
Если ПечатьКлиент.ЭтоСтарыйРасчет(НовыйРасчет) Тогда Возврат; КонецЕсли;

Контрагент = Объект.Клиент; 
ТабличныйДокумент = ПечатьСервер.ПечатьСчетаНаАнглийском(ДокументДолгПараметр, Ложь, Ложь); 

ПечатьКлиент.ОткрытьФормуПечатьСчетаИПодтверждения(ЭтаФорма, Объект.Ссылка, Контрагент
	, ТабличныйДокумент, Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеНомера(Команда)
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ЗаявкаНаБронирование", Объект.Ссылка);
ПараметрыФормы.Вставить("ТолькоПросмотр", ЭтаФорма.ТолькоПросмотр);

Оповещение = Новый ОписаниеОповещения("ЗавершениеСостяниеНомераЗаявка", ЭтаФорма);
ОткрытьФорму("ОбщаяФорма.СостяниеНомераЗаявка", ПараметрыФормы, ЭтаФорма
	,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСостяниеНомераЗаявка(Результат, ДополнительнаяИнформация) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

ЗавершениеСостяниеНомераЗаявкаНаСервере(Результат);
КонецПроцедуры

&НаСервере
Процедура ЗавершениеСостяниеНомераЗаявкаНаСервере(Результат)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК Услуга,
                      |	ДопУслуги.НоменклатураМинибара КАК НоменклатураМинибара
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.НоменклатураМинибара <> ЗНАЧЕНИЕ(Справочник.НоменклатураМинибара.ПустаяСсылка)");

ТЗ_УслугиМинибар = Запрос.Выполнить().Выгрузить(); 

Для Каждого Строка Из Результат Цикл
	
	ЕстьСоответствие = Ложь;
	Для Каждого СтрокаУслуги Из Объект.ДопУслуги Цикл
		
		Если СтрокаУслуги.Услуга.НоменклатураМинибара = Строка.НоменклатураМинибара 
		И СтрокаУслуги.ДатаУслуги = Строка.ДатаОбслуживания 
		Тогда
			СтрокаУслуги.Цена = Строка.НоменклатураМинибара.Цена;
			СтрокаУслуги.Количество = Строка.Количество;
			
			ЕстьСоответствие = Истина;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьСоответствие Тогда
		ОтборСтроки = Новый Структура("НоменклатураМинибара", Строка.НоменклатураМинибара);
		НайденныеСтроки = ТЗ_УслугиМинибар.НайтиСтроки(ОтборСтроки);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрока = Объект.ДопУслуги.Добавить();
			
			НоваяСтрока.ГУИД = Новый УникальныйИдентификатор;
			
			Услуга = НайденныеСтроки[0].Услуга; 
			НоваяСтрока.Услуга = Услуга;
			
			НоваяСтрока.Цена = Строка.НоменклатураМинибара.Цена;
			НоваяСтрока.Количество = Строка.Количество;
			НоваяСтрока.ДатаУслуги = Строка.ДатаОбслуживания;
			
			НоваяСтрока.ВСчет = Истина;
			НоваяСтрока.ЗагруженоГорничные = Истина;
		
		Иначе
			Сообщить("Не найдена услуга, соответствующая номенклатуре минибара: " 
				+ Строка.НоменклатураМинибара + Строка.НоменклатураМинибараНаименование 
				+ ". НОМЕНКЛАТУРА НЕ ВЫГРУЖЕНА ...");
		КонецЕсли;	
		
	КонецЕсли;
КонецЦикла;	
	
КонецПроцедуры
/////////

&НаКлиенте
Процедура ОтправкаАктаИСчетаФактуры(Команда)
ТС = Элементы.Счета.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ТД = Элементы.Счета.ТекущиеДанные;	

ДанныеОбъект = Объект;
ТабДокАкт = ПечатьСервер.ПечатьАктаСчетНаСервере(Ложь, ТС, ДанныеОбъект);	

ДанныеОбъект = Объект;
НомерАктаДатаАкта = ПечатьСервер.НомерДатаДокумента(ДанныеОбъект, ТД.НомерСчета, ТД.ДатаПо);
НомерАкта = НомерАктаДатаАкта.Номер;
ДатаАкта = НомерАктаДатаАкта.Дата;

ДокументАкт = "Акт " + Строка(НомерАктаДатаАкта.Номер) + " от " + Формат(ДатаАкта, "ДФ=dd.MM.yyyy");

ТабДокСчетФактура = ПечатьСервер.ПечатьСчетаФактураНаСервере(ТС, ДанныеОбъект);	

ДокументСчетФактура = "Счет-фактура " + Строка(НомерАктаДатаАкта.Номер) + " от " + Формат(ДатаАкта, "ДФ=dd.MM.yyyy");

ПараметрыФормы = Новый Структура("ТабДокАкт, ТабДокСчетФактура, Контрагент, ДокументАкт, ДокументСчетФактура"
	 , ТабДокАкт, ТабДокСчетФактура, ТД.Контрагент, ДокументАкт, ДокументСчетФактура);
	 
ОткрытьФорму("ОбщаяФорма.ОтправкаАктаИСчетаФактуры", ПараметрыФормы,,,
	,,, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаУПД(Команда)
ТС = Элементы.Счета.ТекущаяСтрока;	
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ТД = Элементы.Счета.ТекущиеДанные;	

ДанныеОбъект = Объект;
ТабДокУПД = ПечатьСервер.ПечатьУПДНаСервере(ТС, ДанныеОбъект);	

ДанныеОбъект = Объект;
НомерАктаДатаАкта = ПечатьСервер.НомерДатаДокумента(ДанныеОбъект, ТД.НомерСчета, ТД.ДатаПо);
НомерАкта = НомерАктаДатаАкта.Номер;
ДатаАкта = НомерАктаДатаАкта.Дата;

ДокументУПД = "УПД " + Строка(НомерАктаДатаАкта.Номер) + " от " + Формат(ДатаАкта, "ДФ=dd.MM.yyyy");

//ТабДокСчетФактура = ПечатьСервер.ПечатьСчетаФактураНаСервере(ТС, ДанныеОбъект);	

//ДокументСчетФактура = "Счет-фактура " + Строка(НомерАктаДатаАкта.Номер) + " от " + Формат(ДатаАкта, "ДФ=dd.MM.yyyy");

ПараметрыФормы = Новый Структура("ТабДокУПД, Контрагент, ДокументУПД"
	 , ТабДокУПД, ТД.Контрагент, ДокументУПД);
	 
ОткрытьФорму("ОбщаяФорма.ОтправкаУПД", ПараметрыФормы,,,
	,,, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры

//
&НаКлиенте
Процедура ПрошлыеДолгиДопУслуги(Команда)
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ОтКого", Объект.Клиент);

Адрес_ТЗ = Адрес_ТЗ();
ПараметрыФормы.Вставить("ПрошлыйПериодДопУслуги", Адрес_ТЗ);

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_ФормаПрошлыеДолгиДопУслуги", ЭтаФорма);
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаПрошлыеДолгиДопУслуги", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция Адрес_ТЗ()
ТЗ = ПрошлыйПериодДопУслуги.Выгрузить();

Адрес_ТЗ = ПоместитьВоВременноеХранилище(ТЗ);
Возврат Адрес_ТЗ;
КонецФункции

&НаКлиенте
Процедура ЗакрытиеФормы_ФормаПрошлыеДолгиДопУслуги(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
Для Каждого Строка Из Результат Цикл
	НоваяСтрока = Объект.ДопУслуги.Добавить();
	НоваяСтрока.Услуга = ПредопределенноеЗначение("Справочник.ДопУслуги.ДолгиЗаУслугиПрошлыйПериод");
	НоваяСтрока.ВСчет = Истина;
	НоваяСтрока.ДатаУслуги = Строка.ДатаДолга;
	НоваяСтрока.Количество = 1;
	Сумма = Строка.СуммаКЗакрытию; 
	НоваяСтрока.Цена = Сумма;
	НоваяСтрока.Сумма = Сумма;
	
	НоваяСтрока.ПрочиеОплатыДокументОплаты = Строка.ДокументОплаты;
	НоваяСтрока.ПрочиеОплатыДокументДолг = Строка.ДокументДолг;
	
	//
	ОтборСтроки = Новый Структура("ПрочиеОплатыДокументОплаты, ПрочиеОплатыДокументДолг"
		, Строка.ДокументОплаты, Строка.ДокументДолг);
	НайденныеСтроки = ПрошлыйПериодДопУслуги.НайтиСтроки(ОтборСтроки);	
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаПрошлыйПериодДопУслуги = ПрошлыйПериодДопУслуги.Добавить();
		СтрокаПрошлыйПериодДопУслуги.ПрочиеОплатыДокументОплаты = Строка.ДокументОплаты;
		СтрокаПрошлыйПериодДопУслуги.ПрочиеОплатыДокументДолг = Строка.ДокументДолг;
	Иначе
		СтрокаПрошлыйПериодДопУслуги = НайденныеСтроки[0]; 
	КонецЕсли;
	
	СтрокаПрошлыйПериодДопУслуги.Сумма = Сумма;
	//	
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
ТЗ = ПрошлыйПериодДопУслуги.Выгрузить();
//ТЗ.Свернуть("ПрочиеОплатыДокументОплаты, ПрочиеОплатыДокументДолг, Добавлено", "Сумма");
ТЗ.Свернуть("ПрочиеОплатыДокументОплаты, ПрочиеОплатыДокументДолг", "Сумма");

Для Каждого Строка Из ПрошлыйПериодДопУслуги Цикл
	//Если Строка.Услуга <> Справочники.ДопУслуги.ДолгиЗаУслугиПрошлыйПериод Тогда Продолжить; КонецЕсли;
	
	ПрочиеОплатыОбъект = Строка.ПрочиеОплатыДокументОплаты.ПолучитьОбъект();
	Если ПрочиеОплатыОбъект = Неопределено Тогда Продолжить; КонецЕсли;
	
	ОтборСтроки = Новый Структура("ДокументДолг, ДокументЗакрытия", Строка.ПрочиеОплатыДокументДолг, Объект.Ссылка);	
	НайденныеСтроки = ПрочиеОплатыОбъект.ДолгиЗакрыто.НайтиСтроки(ОтборСтроки);
	
	Если НайденныеСтроки.Количество() = 0 Тогда 
		СтрокаЗакрытия = ПрочиеОплатыОбъект.ДолгиЗакрыто.Добавить();
		СтрокаЗакрытия.ДокументДолг = Строка.ПрочиеОплатыДокументДолг; 
		СтрокаЗакрытия.ДокументЗакрытия = Объект.Ссылка; 
	Иначе
		СтрокаЗакрытия = НайденныеСтроки[0];
	КонецЕсли;
	
	СуммаЗакрыто = СтрокаЗакрытия.СуммаЗакрыто + Строка.Сумма;
	
	//ОтборСтроки = Новый Структура("ДокументДолг", Строка.ПрочиеОплатыДокументДолг);	
	//ТЗ = ПрочиеОплатыОбъект.ДолгиОплата.Выгрузить(ОтборСтроки);
	//ТЗ.Свернуть("ДокументДолг", "Сумма");
	//СуммаДолг = ТЗ[0].Сумма;
	//
	//Если СуммаЗакрыто > СуммаДолг Тогда
	//	 СтрокаЗакрытия.СуммаЗакрыто = СуммаДолг;
	//Иначе
	//	СтрокаЗакрытия.СуммаЗакрыто = СуммаЗакрыто; 
	//КонецЕсли;	
	
	СтрокаЗакрытия.СуммаЗакрыто = СуммаЗакрыто; 
		
	Если СуммаЗакрыто <= 0 Тогда 
		Если НайденныеСтроки.Количество() = 0 Тогда 
			Продолжить;
		Иначе
			ПрочиеОплатыОбъект.ДолгиЗакрыто.Удалить(СтрокаЗакрытия);
	    КонецЕсли;
	КонецЕсли;
		
	ПрочиеОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;	

ПрошлыйПериодДопУслуги.Очистить();
КонецПроцедуры
//

&НаКлиенте
Процедура ЧекАгента(Команда)
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("СуммаКОплате", Объект.ЦенаПродажиАгентом);
ПараметрыФормы.Вставить("СуммаОплаты", 0);
ПараметрыФормы.Вставить("СуммаПредыдущихОплат", Объект.ЦенаПродажиАгентом);
ПараметрыФормы.Вставить("ЭтоАванс", Ложь);                     

//
ПозицииЧекаККМ = Новый Массив;

ТекущаяОрганизация = НастройкиСервер.ПолучитьТекущуюОрганизацию();
СтавкаНДС = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущаяОрганизация, "СтавкаНДС");
ДатаУчетаНДС = Объект.РезервПо; 
СтавкаНДС = ДокументыСервер.СтавкаНДСТекущая(СтавкаНДС, ДатаУчетаНДС);  

ВсеСНДС = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТекущаяОрганизация, "ВсеСНДС"); 

//ДатаУчета = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ДокументДолгОбъект.Ссылка, "РезервПо");
ДатаУчета = Объект.РезервПо;
УчитыватьНДС = ДокументыСервер.УчитыватьНДС_Чек(ДатаУчета);

ПозицииЧекаККМШаблон = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента("КассовыйДокумент", "ЧекККМДетально");

НоваяЗапись = ОбщийФункционалСервер.СкопироватьСтруктуру(ПозицииЧекаККМШаблон);   

Если Объект.РезервПо = Объект.РезервС Тогда
	КоличествоСуток = 1;	
Иначе
	КоличествоСуток = Цел((Объект.РезервПо - Объект.РезервС) / (24 * 60 * 60));
КонецЕсли;
НоваяЗапись.Наименование="Услуги гостиницы " + Формат(КоличествоСуток, "ЧГ=") + " сут.";

НоваяЗапись.Количество=1;  

СуммаПроживание = Объект.ЦенаПродажиАгентом;

НоваяЗапись.Цена = СуммаПроживание;
НоваяЗапись.Сумма = СуммаПроживание;

НоваяЗапись.Скидка=0;

Если УчитыватьНДС Тогда
	Если ВсеСНДС Тогда
		НоваяЗапись.СтавкаНДС = СтавкаНДС;
		НоваяЗапись.СуммаНДС = ДокументыСервер.СуммаНДС(СтавкаНДС, СуммаПроживание);
	Иначе
		Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка")
		Тогда
			СтавкаНДС_П = СтавкаНДС;
		Иначе
			СтавкаНДС_П = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
		КонецЕсли;
		
		НоваяЗапись.СтавкаНДС = СтавкаНДС_П;
		НоваяЗапись.СуммаНДС = 0;
	КонецЕсли;
КонецЕсли;

ПозицииЧекаККМ.Добавить(НоваяЗапись);
//
ПараметрыФормы.Вставить("ПозицииЧекаККМ", ПозицииЧекаККМ); 

ПараметрыФормы.Вставить("ДокументДолг", Объект.Ссылка); 

ПараметрыФормы.Вставить("ОплатаКартойВключена", Ложь);   

ДопПараметры = Новый Структура;

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_ЧекАгента", ЭтотОбъект, ДопПараметры);
ОткрытьФорму("ОбщаяФорма.Чек", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы_ЧекАгента(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;	

ОчиститьСообщения();

КонецПроцедуры


// -------------------------------------------------


// ===========================

&НаКлиенте
Асинх Процедура ТЕСТ(Команда)
//Результат = Ждать ВопросАсинх("Есть изменение скидки для Контрагента: " 
//		+ Символы.ПС + Символы.ПС + "Заменить скидку Контрагента в Проживание ?"
//	, РежимДиалогаВопрос.ДаНет); 		
	//	ТЕСТНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ТЕСТНаСервере()
НачатьТранзакцию();	
//ПерераспределитьОплаты();	

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();	
КонецПроцедуры
// ===========================


// + Для установки Тариф.Доступность
&НаСервере
Функция ПоискАудитаНаСервере()
ПоискАудита=Новый Запрос("ВЫБРАТЬ
	|	ЕжедневныйАудитПроданныеНомера.Бронь
	|ИЗ
	|	Документ.ЕжедневныйАудит.ПроданныеНомера КАК ЕжедневныйАудитПроданныеНомера
	|ГДЕ
	|	ЕжедневныйАудитПроданныеНомера.Бронь = &Бронь");
ПоискАудита.УстановитьПараметр("Бронь",Объект.Ссылка);
	
Результат = ПоискАудита.Выполнить().Пустой();
Возврат Результат; 	
КонецФункции
















































