&НаКлиенте
Перем MSWord, ДокументWord;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//ЭтаФорма.АвтоЗаголовок = Ложь;
//ЭтаФорма.Заголовок = Параметры.Заголовок;	

Параметры.Свойство("Почта", Почта);

Параметры.Свойство("ПочтаТема", ПочтаТема);
Параметры.Свойство("ПочтаТекстСообщения", ПочтаТекстСообщения);

Параметры.Свойство("ИмяФайла", ИмяФайла);   

ИмяФайла = СтрЗаменить(ИмяФайла, ".", "");
ИмяФайла = СтрЗаменить(ИмяФайла, ":", "");

	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
УстановитьПочтаДостуность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПочтаДостуность()
ЕстьПочта = ЗначениеЗаполнено(Почта);
Элементы.ФормаОтправитьПоПочте.Доступность = ЕстьПочта;

Элементы.ПочтаТема.Доступность = ЕстьПочта;
Элементы.ПочтаТекстСообщения.Доступность = ЕстьПочта;
КонецПроцедуры


//
&НаКлиенте
Процедура ПриЗаписи___(Отказ)
	//Если Аннулированно тогда
	//	Для каждого Ном Из Номера Цикл
	//		Об=Ном.Бронь.ПолучитьОбъект();
	//		Об.Статус=Перечисления.СтатусБрони.ОтменаБронирования;
	//		Об.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	//		Сообщить("Бронь номер "+ Об.Номер + " отменена ");
	//	КонецЦикла; 			
	//конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
Если Объект.Аннулированно тогда
	Для каждого Ном Из Объект.Номера Цикл
		Об=Ном.Бронь.ПолучитьОбъект();
		Об.Статус=Перечисления.СтатусБрони.ОтменаБронирования;
		Об.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Сообщить("Бронь номер "+ Об.Номер + " отменена ");
	КонецЦикла; 			
конецесли;
КонецПроцедуры
//

&НаКлиенте
Процедура ПочтаПриИзменении(Элемент)
УстановитьПочтаДостуность();
КонецПроцедуры

//
&НаКлиенте
Процедура НомераБроньПриИзменении__(Элемент)
	//Если НЕ ЭлементыФормы.Номера.ТекущаяСтрока.Бронь.Пустая() тогда
	//	ЭлементыФормы.Номера.ТекущаяСтрока.ФИО=ЭлементыФормы.Номера.ТекущаяСтрока.Бронь.Клиент.Наименование;
	//конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомераБроньПриИзменении(Элемент)
ТекущиеДанные =  Элементы.Номера.ТекущиеДанные;
Если НЕ ТекущиеДанные.Бронь.Пустая() тогда
	ТекущиеДанные.ФИО = БроньКлиентНаименование(ТекущиеДанные.Бронь);
конецесли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция БроньКлиентНаименование(Бронь)
Возврат Бронь.Клиент.Наименование; 
КонецФункции
//

//
&НаКлиенте
Процедура ОсновныеДействияФормыПечать___(Кнопка)
	//Если не Аннулированно тогда
	//	Макет=ПолучитьМакет("Подтверждение");	
	//иначе
	//	Макет=ПолучитьМакет("Аннуляция");
	//конецесли;
	//ТабДок=Новый ТабличныйДокумент;
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//Обл.Параметры.Кому=Кому.Наименование;
	//Обл.Параметры.Факс=Факс;
	//ТабДок.Вывести(Обл);
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Для каждого Ном Из Номера Цикл
	//	Обл.Параметры.ФИО=Ном.Бронь.Клиент.Наименование + "   " + Ном.Бронь.КатегорияНомера.Наименование;	
	//	Обл.Параметры.ДатаЗаезда=Формат(Ном.Бронь.РезервС, "ДФ=dd.MM.yy")+" ("+Ном.Бронь.ВремяЗаезда+")";
	//	Обл.Параметры.ДатаВыезда=Формат(Ном.Бронь.РезервПо, "ДФ=dd.MM.yy")+" ("+Ном.Бронь.ВремяВыезда+")";
	//	Обл.Параметры.Колво=Ном.Бронь.КолВо;	
	//	Обл.Параметры.Стоимость=Ном.Бронь.Тариф.Цена-?(Ном.Бронь.Клиент.Категория.Пустая(),0,Ном.Бронь.Тариф.Цена*(Ном.Бронь.Клиент.Категория.Скидка/100));	
	//	Обл.Параметры.Номер=Формат(Номер, "ЧГ=");	
	//	ТабДок.Вывести(Обл);
	//	//ФИО													ДатаЗаезда					Колво				ДатаВыезда					Стоимость			Номер		
	//	
	//КонецЦикла; 
	//Обл=Макет.ПолучитьОбласть("Подвал");
	//ТабДок.Вывести(Обл);	
	//ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
ТабДок = ПечатьНаСервере();

Если не Объект.Аннулированно тогда
	Заголовок="Подтверждение";	
иначе
	Заголовок="Аннуляция" ;	
конецесли;

ТабДок.Показать(Заголовок);
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
ИмяМакета = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
Если не Объект.Аннулированно тогда
	ИмяМакета="Подтверждение_" + ИмяМакета;	
иначе
	ИмяМакета="Аннуляция_" + ИмяМакета;	
конецесли;

//Макет = ПолучитьМакетНаСервере(ИмяМакета);	 
Макет = Документы.ПодтверждениеБронирования.ПолучитьМакет(ИмяМакета);	 

ТабДок=Новый ТабличныйДокумент;

Обл=Макет.ПолучитьОбласть("Шапка");
Обл.Параметры.Кому=Объект.Кому.Наименование;
Обл.Параметры.Факс=Объект.Факс;
ТабДок.Вывести(Обл);

Обл=Макет.ПолучитьОбласть("Строка");
Для каждого Ном Из Объект.Номера Цикл
	Обл.Параметры.ФИО=Ном.Бронь.Клиент.Наименование + "   " + Ном.Бронь.КатегорияНомера.Наименование;	
	Обл.Параметры.ДатаЗаезда=Формат(Ном.Бронь.РезервС, "ДФ=dd.MM.yy")+" ("+Ном.Бронь.ВремяЗаезда+")";
	Обл.Параметры.ДатаВыезда=Формат(Ном.Бронь.РезервПо, "ДФ=dd.MM.yy")+" ("+Ном.Бронь.ВремяВыезда+")";
	Обл.Параметры.Колво=Ном.Бронь.КолВоДней;	
	
	//Обл.Параметры.Стоимость = Ном.Бронь.Тариф.Цена-?(Ном.Бронь.Клиент.Категория.Пустая(),0,Ном.Бронь.Тариф.Цена*(Ном.Бронь.Клиент.Категория.Скидка/100));	
	
	Обл.Параметры.Номер=Формат(Объект.Номер, "ЧГ=");	
	ТабДок.Вывести(Обл);
	//ФИО													ДатаЗаезда					Колво				ДатаВыезда					Стоимость			Номер		
	
КонецЦикла; 
Обл=Макет.ПолучитьОбласть("Подвал");
ТабДок.Вывести(Обл);

ТабДок.ОтображатьСетку = Ложь;
ТабДок.ОтображатьЗаголовки = Ложь;

Возврат ТабДок;
КонецФункции

// + Создать Документ WORD Подтверждение
&НаКлиенте
Процедура ОсновныеДействияФормыНовоеПодтверждение___(Кнопка)
	//НовНомера=Новый ТаблицаЗначений;
	//НовНомера.Колонки.Добавить("Бронь");
	//НовНомера.Колонки.Добавить("РезервС");
	//НовНомера.Колонки.Добавить("РезервПо");
	//НовНомера.Колонки.Добавить("КолВо");
	//НовНомера.Колонки.Добавить("СТ");
	//
	//Для каждого Ном Из Номера Цикл
	//	Если Ном.Бронь.НовыйРассчет Тогда 
	//		Для каждого СтрИскл Из Ном.Бронь.Исключения Цикл
	//				Нов=НовНомера.Добавить();
	//				Нов.Бронь=Ном.Бронь;
	//				Нов.РезервС=Формат(СтрИскл.ДеньПроживания, "ДФ=dd.MM.yy");
	//				Нов.РезервПо=Формат(СтрИскл.ДеньПроживания+86400, "ДФ=dd.MM.yy");
	//				Нов.КолВо=СтрИскл.Количество;
	//				Нов.СТ=СтрИскл.Цена-СтрИскл.Цена*(СтрИскл.ПроцентСкидкиКлиента/100);	
	//		КонецЦикла; 
	//	Иначе 
	//		Если Ном.Бронь.Исключения.Количество()=0 тогда 
	//			Нов=НовНомера.Добавить();
	//			Нов.Бронь=Ном.Бронь;
	//			Нов.РезервС=Формат(Ном.Бронь.РезервС, "ДФ=dd.MM.yy")+" ("+?(Ном.Бронь.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр12,"14:00",Ном.Бронь.ВремяЗаезда)+")";
	//			Нов.РезервПо=Формат(Ном.Бронь.РезервПо, "ДФ=dd.MM.yy")+" ("+Ном.Бронь.ВремяВыезда+")";
	//			Нов.КолВо=Ном.Бронь.КолВо;
	//			Нов.СТ=Ном.Бронь.Тариф.Цена-?(Ном.Бронь.Оплачивает.Категория.Пустая(),0,Ном.Бронь.Тариф.Цена*(Ном.Бронь.Оплачивает.Категория.Скидка/100));
	//		иначе
	//			Нов=НовНомера.Добавить();
	//			Нов.Бронь=Ном.Бронь;
	//			Нов.РезервС=Формат(Ном.Бронь.РезервС, "ДФ=dd.MM.yy")+" ("+?(Ном.Бронь.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр12,"14:00",Ном.Бронь.ВремяЗаезда)+")";
	//			Нов.РезервПо=Формат(Ном.Бронь.РезервПо, "ДФ=dd.MM.yy")+" ("+Ном.Бронь.ВремяВыезда+")";
	//			Нов.КолВо=Ном.Бронь.КолВо-Ном.Бронь.Исключения.Количество();
	//			Нов.СТ=Ном.Бронь.Тариф.Цена-?(Ном.Бронь.Оплачивает.Категория.Пустая(),0,Ном.Бронь.Тариф.Цена*(Ном.Бронь.Оплачивает.Категория.Скидка/100));
	//			//	НБ=Документы.ЗаявкаНаБронирование.СоздатьДокумент();
	//			Для каждого СтрИскл Из Ном.Бронь.Исключения Цикл
	//				Нов=НовНомера.Добавить();
	//				Нов.Бронь=Ном.Бронь;
	//				Нов.РезервС=Формат(СтрИскл.ДеньПроживания, "ДФ=dd.MM.yy");
	//				Нов.РезервПо=Формат(СтрИскл.ДеньПроживания, "ДФ=dd.MM.yy");
	//				Нов.КолВо=1;
	//				Нов.СТ=СтрИскл.Тариф.Цена-?(Ном.Бронь.Оплачивает.Категория.Пустая(),0,СтрИскл.Тариф.Цена*(Ном.Бронь.Оплачивает.Категория.Скидка/100));	
	//			КонецЦикла; 
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//
	//Если Вопрос("На английском языке?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
	//	Если НовНомера.Количество()=0 тогда
	//		Макет = ПолучитьМакет("НовоеПодтверждение1_А");
	//	Иначе		
	//		Макет = ПолучитьМакет("НовоеПодтверждение"+?(НовНомера.Количество()>3,"11",Строка(НовНомера.Количество()))+"_А");
	//	КонецЕсли;
	//иначе
	//	Если НовНомера.Количество()=0 тогда
	//		Макет = ПолучитьМакет("НовоеПодтверждение1");
	//	ИначеЕсли НовНомера.Количество()<=11 тогда 
	//		Макет = ПолучитьМакет("НовоеПодтверждение"+?(НовНомера.Количество()>3,"11",Строка(НовНомера.Количество())));
	//	иначе
	//		Макет = ПолучитьМакет("НовоеПодтверждение12");
	//	КонецЕсли;
	//конецесли;
	//MSWord = Макет.Получить();
	//ОбщСт=0;
	//Документ = MSWord.Application.Documents(1);
	//
	//сч=1;
	//СтруктураРеквизитов=Новый Структура;
	//
	//Для каждого СтрНом Из НовНомера Цикл
	//	
	//	СтруктураРеквизитов.Вставить("ФИО"+Строка(Сч),СтрНом.Бронь.Клиент.Наименование+"("+СтрНом.Бронь.НомерВРезерв.КатегорияНомера.Наименование+")");
	//	СтруктураРеквизитов.Вставить("ДТ"+Строка(Сч),СтрНом.РезервС);
	//	СтруктураРеквизитов.Вставить("К"+Строка(Сч),Строка(СтрНом.КолВо));
	//	СтруктураРеквизитов.Вставить("ДТВ"+Строка(Сч),СтрНом.РезервПо);
	//	СтруктураРеквизитов.Вставить("СТ"+Строка(Сч),Строка(СтрНом.СТ));
	//	СтруктураРеквизитов.Вставить("СТО"+Строка(Сч),Строка(СтрНом.СТ*СтрНом.КолВо));
	//	ОбщСт=ОбщСт+СтрНом.СТ*СтрНом.КолВо;	
	//	сч=сч+1;
	//	Если Сч>25 тогда
	//		Прервать;
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	//Пока Сч<=25 цикл
	//	СтруктураРеквизитов.Вставить("ФИО"+Строка(Сч),"");
	//	СтруктураРеквизитов.Вставить("ДТ"+Строка(Сч),"");
	//	СтруктураРеквизитов.Вставить("К"+Строка(Сч),"");
	//	СтруктураРеквизитов.Вставить("ДТВ"+Строка(Сч),"");
	//	СтруктураРеквизитов.Вставить("СТ"+Строка(Сч),"");
	//	СтруктураРеквизитов.Вставить("СТО"+Строка(Сч),"");
	//	сч=сч+1;
	//КонецЦикла;
	//
	//СтруктураРеквизитов.Вставить("СТОИ",ОбщСт);
	//СтруктураРеквизитов.Вставить("ИмяПользователя",ТекПол.наименование);
	//
	//Для Каждого Элемент из СтруктураРеквизитов Цикл
	//	Замена = Документ.Content.Find;
	//	Замена.Execute("<" + Элемент.Ключ + ">", Ложь, Истина, Ложь, , , Истина, , Ложь, Элемент.Значение);
	//КонецЦикла;
	//MSWord.Application.Visible = Истина;
	//MSWord.Activate();
КонецПроцедуры

&НаКлиенте
Процедура НовоеПодтверждение(Команда)
Индикатор = 5;
ЗаполнитьНовоеПодтверждение();

Индикатор = 10;
ФормированиеПодтвержденияWORD();
КонецПроцедуры

&НаКлиенте
Функция ФормированиеПодтвержденияWORD() 
МойДокументВДвоичныхДанных = ПолучитьМакетНовоеПодтверждениеВДвоичныхДанных(НаАнглийском);

ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".doc");
МойДокументВДвоичныхДанных.Записать(ИмяВременногоФайла);

Индикатор = 15;
ОбновитьОтображениеДанных();
	   
//MSWord = ПолучитьMsWord();
MSWord = Новый COMОбъект("Word.Application");

//MSWord = Новый COMОбъект("Word.Application");
Документ = MSWord.Documents.Open(ИмяВременногоФайла);
//Документ.Activate();

//MSWord.Application.Visible = Истина;

Индикатор = 20;
ОбновитьОтображениеДанных();

Table = Документ.Tables(1);
Row1 = Table.Rows(2);

Индикатор = 25;
ОбновитьОтображениеДанных();
ш = 1;

//Для Индекс = 2 По НовНомера.Количество() Цикл
//	СтрНом = НовНомера[Индекс - 1];
//	
//	Row1.Range.Copy();
//	wdFormatOriginalFormatting = 16;
//	Row1.Range.PasteAndFormat (wdFormatOriginalFormatting);
//	
//КонецЦикла;
ш = 1;
Для Индекс = 1 По НовНомера.Количество() Цикл
	СтрНом = НовНомера[Индекс - 1];
	
	Если Индекс > 1 Тогда
		Row1.Range.Copy();
		wdFormatOriginalFormatting = 16;
		Row1.Range.PasteAndFormat (wdFormatOriginalFormatting);
	КонецЕсли;
	
	//Row = Table.Rows(Индекс + 2);
	Row = Документ.Tables(1).Rows(Индекс + 1);
	НомерСтроки = Строка(Индекс + 1);
	
	//Row.Cells(1).Range.Text = "<ФИО" + НомерСтроки + ">";
	//Row.Cells(1).Range.Text = ПолучитьФИО(СтрНом.Бронь);
	//Row.Cells(1).Select();
	//Документ.ActiveWindow.Selection.TypeText("Текст 1");
	Row.Cells(1).Range.Text ="Текст 1";
	
	//Row.Cells(3).Range.Text = "<ДТ" + НомерСтроки + ">";
	//Row.Cells(3).Range.Text = СтрНом.РезервС;
	Row.Cells(3).Range.Text = "Текст 1";
	
	//Row.Cells(4).Range.Text = "<К" + НомерСтроки + ">";
	//Row.Cells(4).Range.Text = СтрНом.Колво;
	Row.Cells(4).Range.Text = "Текст 1";
	
	//Row.Cells(5).Range.Text = "<ДТВ" + НомерСтроки + ">";
	//Row.Cells(5).Range.Text = СтрНом.РезервПо;
	Row.Cells(5).Range.Text = "Текст 1";
	
	//Row.Cells(6).Range.Text = "<СТ" + НомерСтроки + ">";
	//Row.Cells(6).Range.Text = СтрНом.СТ;
	Row.Cells(6).Range.Text = "Текст 1";

	//Row.Cells(7).Range.Text = "<СТО" + НомерСтроки + ">";
	//Row.Cells(7).Range.Text = СтрНом.Колво * СтрНом.СТ;
	Row.Cells(7).Range.Text = "Текст 1";
	
	Индикатор = 25 + 0.4 * (Индекс * 100 / НовНомера.Количество()) ;
	ОбновитьОтображениеДанных();
КонецЦикла;
ш = 1;

//Для Индекс = 1 По НовНомера.Количество() Цикл
//	СтрНом = НовНомера[Индекс - 1];
//	
//	Row1.Range.Copy();
//	wdFormatOriginalFormatting = 16;
//	Row1.Range.PasteAndFormat (wdFormatOriginalFormatting);
//	
//	//Row = Table.Rows(Индекс + 2);
//	Row = Table.Rows(Индекс + 1);
//	НомерСтроки = Строка(Индекс + 1);
//	//Row.Cells(1).Range.Text = "<ФИО" + НомерСтроки + ">";
//	
//	//Row.Cells(1).Range.Text = ПолучитьФИО(Бронь);
//	
//	//Row.Cells(3).Range.Text = "<ДТ" + НомерСтроки + ">";
//	Row.Cells(3).Range.Text =СтрНом.РезервС;
//	
//	//Row.Cells(4).Range.Text = "<К" + НомерСтроки + ">";
//	Row.Cells(4).Range.Text = СтрНом.Колво;
//	
//	//Row.Cells(5).Range.Text = "<ДТВ" + НомерСтроки + ">";
//	Row.Cells(5).Range.Text = СтрНом.РезервПо;
//	
//	//Row.Cells(6).Range.Text = "<СТ" + НомерСтроки + ">";
//	Row.Cells(6).Range.Text = СтрНом.СТ;
//	
//	//Row.Cells(7).Range.Text = "<СТО" + НомерСтроки + ">";
//	Row.Cells(7).Range.Text = СтрНом.Колво * СтрНом.СТ;
//	
//	Индикатор = 25 + 0.4 * (Индекс * 100 / НовНомера.Количество()) ;
//	ОбновитьОтображениеДанных();
//КонецЦикла;


		//СтруктураРеквизитов.Вставить("ФИО"+Строка(Сч),СтрНом.Бронь.Клиент.Наименование+"("+СтрНом.Бронь.НомерВРезерв.КатегорияНомера.Наименование+")");
		//СтруктураРеквизитов.Вставить("ДТ"+Строка(Сч),СтрНом.РезервС);
		//СтруктураРеквизитов.Вставить("К"+Строка(Сч),Строка(СтрНом.КолВо));
		//СтруктураРеквизитов.Вставить("ДТВ"+Строка(Сч),СтрНом.РезервПо);
		//СтруктураРеквизитов.Вставить("СТ"+Строка(Сч),Строка(СтрНом.СТ));
		//СтруктураРеквизитов.Вставить("СТО"+Строка(Сч),Строка(СтрНом.СТ*СтрНом.КолВо));
		//ОбщСт=ОбщСт+СтрНом.СТ*СтрНом.КолВо;	
		//сч=сч+1;

//СтруктураРеквизитов = ЗаполнитьРеквизитыНовоеПодтверждение();	
//Индекс = 1;
//Для Каждого Элемент из СтруктураРеквизитов Цикл
//	Замена = Документ.Content.Find;
//	Замена.Execute("<" + Элемент.Ключ + ">", Ложь, Истина, Ложь, , , Истина, , Ложь, Элемент.Значение);
//	
//	Индикатор = 65 + 0.2 * (Индекс * 100 / СтруктураРеквизитов.Количество()) ;
//	ОбновитьОтображениеДанных();
//	
//	Индекс = Индекс + 1;
//КонецЦикла;

Индикатор = 90;
Документ.SaveAs2(ИмяВременногоФайла);
ЗакрытьДокументWORD(Документ);

MSWord.Application.Visible = Истина;

Документ = MSWord.Documents.Open(ИмяВременногоФайла);

Документ.Activate();


//MSWord.ActiveWindow.Caption = "Подтверждение";



Индикатор = 100;

ДобавитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord;

Возврат ИмяВременногоФайла;
КонецФункции

&НаСервере
Функция ПолучитьФИО(Бронь)
ФИО = Бронь.Клиент.Наименование +"(" + Бронь.КатегорияНомера.Наименование+")";	
КонецФункции	

&НаКлиенте
Функция ФормированиеПодтвержденияWORD_2() 
МойДокументВДвоичныхДанных = ПолучитьМакетНовоеПодтверждениеВДвоичныхДанных(НаАнглийском);

ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".doc");
МойДокументВДвоичныхДанных.Записать(ИмяВременногоФайла);

Индикатор = 15;
ОбновитьОтображениеДанных();
	   
MSWord = ПолучитьMsWord();
//MSWord = Новый COMОбъект("Word.Application");
Документ = MSWord.Documents.Open(ИмяВременногоФайла);

//MSWord.Application.Visible = Истина;

Индикатор = 20;
ОбновитьОтображениеДанных();

Table = Документ.Tables(1);
Row1 = Table.Rows(2);

Индикатор = 25;
ОбновитьОтображениеДанных();

Для Индекс = 1 По НовНомера.Количество() - 1 Цикл
	
	Row1.Range.Copy();
	wdFormatOriginalFormatting = 16;
	Row1.Range.PasteAndFormat (wdFormatOriginalFormatting);
	
	Row = Table.Rows(Индекс + 2);
	НомерСтроки = Строка(Индекс + 1); 
	Row.Cells(1).Range.Text = "<ФИО" + НомерСтроки + ">";
	Row.Cells(3).Range.Text = "<ДТ" + НомерСтроки + ">";
	Row.Cells(4).Range.Text = "<К" + НомерСтроки + ">";
	Row.Cells(5).Range.Text = "<ДТВ" + НомерСтроки + ">";
	Row.Cells(6).Range.Text = "<СТ" + НомерСтроки + ">";
	Row.Cells(7).Range.Text = "<СТО" + НомерСтроки + ">";
	
	Индикатор = 25 + 0.4 * (Индекс * 100 / НовНомера.Количество()) ;
	ОбновитьОтображениеДанных();
КонецЦикла;

СтруктураРеквизитов = ЗаполнитьРеквизитыНовоеПодтверждение();	
Индекс = 1;
Для Каждого Элемент из СтруктураРеквизитов Цикл
	Замена = Документ.Content.Find;
	Замена.Execute("<" + Элемент.Ключ + ">", Ложь, Истина, Ложь, , , Истина, , Ложь, Элемент.Значение);
	
	Индикатор = 65 + 0.2 * (Индекс * 100 / СтруктураРеквизитов.Количество()) ;
	ОбновитьОтображениеДанных();
	
	Индекс = Индекс + 1;
КонецЦикла;

Индикатор = 90;
Документ.SaveAs2(ИмяВременногоФайла);

Документ.Activate();
MSWord.ActiveWindow.Caption = "Подтверждение";

MSWord.Application.Visible = Истина;

Индикатор = 100;

ДобавитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord;

Возврат ИмяВременногоФайла;
КонецФункции


&НаСервере
Функция ПолучитьМакетНовоеПодтверждениеВДвоичныхДанных(НаАнглийском)
	ИмяМакета = НастройкиСервер.ПолучитьИмяТекущаяОрганизация();
	Если НаАнглийском тогда
		ИмяМакета = "НовоеПодтверждение_А_" + ИмяМакета;	
		//Макет = ПолучитьМакетНаСервере(ИмяМакета);	
			
	иначе
		ИмяМакета = "НовоеПодтверждение_" + ИмяМакета; 
		//Макет = ПолучитьМакетНаСервере(ИмяМакета);		
	конецесли;
	Макет = Документы.ПодтверждениеБронирования.ПолучитьМакет(ИмяМакета);	
	
	//Получим путь во временной директории для сохранения туда файла
	ИмяВрем = ПолучитьИмяВременногоФайла(".doc");

	Макет.Записать(ИмяВрем);
	МойДокументВДвоичныхДанных = Новый ДвоичныеДанные(ИмяВрем);

	Возврат МойДокументВДвоичныхДанных;
КонецФункции

&НаКлиенте
Функция ПолучитьMsWord()
Если MSWord = Неопределено Тогда
	MSWord = Новый COMОбъект("Word.Application");
Иначе
	Попытка
		WordОшибка = Ложь;
		cnt = MSWord.Documents.Count;
	Исключение
		WordОшибка = Истина;
	КонецПопытки;	
	
	Если WordОшибка Тогда
		MSWord = Неопределено;		
		MSWord = Новый COMОбъект("Word.Application");
	Иначе
		УдалитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord; 
		
		Для Каждого Док Из MSWord.Documents Цикл
			wdDoNotSaveChanges = 0;
			wdSaveChanges =	-1;
			Док.Close(wdDoNotSaveChanges);
		КонецЦикла;
	КонецЕсли;	
КонецЕсли;

MSWord.Application.Visible = Ложь;
Возврат MSWord;
КонецФункции	

&НаСервере
Процедура ЗаполнитьНовоеПодтверждение()
	//НовоеПодтверждениеНаСервере();
	//
	//НовНомера=Новый ТаблицаЗначений;
	//НовНомера.Колонки.Добавить("Бронь");
	//НовНомера.Колонки.Добавить("РезервС");
	//НовНомера.Колонки.Добавить("РезервПо");
	//НовНомера.Колонки.Добавить("КолВо");
	//НовНомера.Колонки.Добавить("СТ");
	
	НовНомера.Очистить();
	Для каждого Ном Из Объект.Номера Цикл
		Если Ном.Бронь.НовыйРассчет Тогда 
			//Для каждого СтрИскл Из Ном.Бронь.Исключения Цикл
			Для каждого СтрИскл Из Ном.Бронь.Проживание Цикл
					Нов=НовНомера.Добавить();
					Нов.Бронь=Ном.Бронь;
					Нов.РезервС=Формат(СтрИскл.ДеньПроживания, "ДФ=dd.MM.yy");
					Нов.РезервПо=Формат(СтрИскл.ДеньПроживания+86400, "ДФ=dd.MM.yy");
					Нов.КолВо=СтрИскл.Количество;
					Нов.СТ=СтрИскл.Цена-СтрИскл.Цена*(СтрИскл.ПроцентСкидкиКлиента/100);	
			КонецЦикла; 
		Иначе 
			//Если Ном.Бронь.Исключения.Количество()=0 тогда 
			Если Ном.Бронь.Проживание.Количество()=0 тогда 
				Нов=НовНомера.Добавить();
				Нов.Бронь=Ном.Бронь;
				Нов.РезервС=Формат(Ном.Бронь.РезервС, "ДФ=dd.MM.yy")+" (" + Ном.Бронь.ВремяЗаезда+")";
				Нов.РезервПо=Формат(Ном.Бронь.РезервПо, "ДФ=dd.MM.yy")+" ("+Ном.Бронь.ВремяВыезда+")";
				Нов.КолВо=Ном.Бронь.КолВо;
				Нов.СТ=Ном.Бронь.Тариф_НеИспользуется.Цена-?(Ном.Бронь.Оплачивает.Категория.Пустая(),0,Ном.Бронь.Тариф_НеИспользуется.Цена*(Ном.Бронь.Оплачивает.Категория.Скидка/100));
			иначе
				Нов=НовНомера.Добавить();
				Нов.Бронь=Ном.Бронь;
				Нов.РезервС=Формат(Ном.Бронь.РезервС, "ДФ=dd.MM.yy")+" ("+Ном.Бронь.ВремяЗаезда+")";
				Нов.РезервПо=Формат(Ном.Бронь.РезервПо, "ДФ=dd.MM.yy")+" ("+Ном.Бронь.ВремяВыезда+")";
				Нов.КолВо=Ном.Бронь.КолВо-Ном.Бронь.Исключения.Количество();
				Нов.СТ=Ном.Бронь.Тариф_НеИспользуется.Цена-?(Ном.Бронь.Оплачивает.Категория.Пустая(),0,Ном.Бронь.Тариф_НеИспользуется.Цена*(Ном.Бронь.Оплачивает.Категория.Скидка/100));
				//	НБ=Документы.ЗаявкаНаБронирование.СоздатьДокумент();
				Для каждого СтрИскл Из Ном.Бронь.Исключения Цикл
					Нов=НовНомера.Добавить();
					Нов.Бронь=Ном.Бронь;
					Нов.РезервС=Формат(СтрИскл.ДеньПроживания, "ДФ=dd.MM.yy");
					Нов.РезервПо=Формат(СтрИскл.ДеньПроживания, "ДФ=dd.MM.yy");
					Нов.КолВо=1;
					Нов.СТ=СтрИскл.Тариф_НеИспользуется.Цена-?(Ном.Бронь.Оплачивает.Категория.Пустая(),0,СтрИскл.Тариф_НеИспользуется.Цена*(Ном.Бронь.Оплачивает.Категория.Скидка/100));	
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРеквизитыНовоеПодтверждение()
	ОбщСт=0;
	сч=1;
	СтруктураРеквизитов=Новый Структура;
	
	Для каждого СтрНом Из НовНомера Цикл
		
		//СтруктураРеквизитов.Вставить("ФИО"+Строка(Сч),СтрНом.Бронь.Клиент.Наименование+"("+СтрНом.Бронь.НомерВРезерв.КатегорияНомера.Наименование+")");
		СтруктураРеквизитов.Вставить("ФИО"+Строка(Сч),СтрНом.Бронь.Клиент.Наименование
			+"("+СтрНом.Бронь.КатегорияНомера.Наименование+")");
		СтруктураРеквизитов.Вставить("ДТ"+Строка(Сч),СтрНом.РезервС);
		СтруктураРеквизитов.Вставить("К"+Строка(Сч),Строка(СтрНом.КолВо));
		СтруктураРеквизитов.Вставить("ДТВ"+Строка(Сч),СтрНом.РезервПо);
		СтруктураРеквизитов.Вставить("СТ"+Строка(Сч),Строка(СтрНом.СТ));
		СтруктураРеквизитов.Вставить("СТО"+Строка(Сч),Строка(СтрНом.СТ*СтрНом.КолВо));
		ОбщСт=ОбщСт+СтрНом.СТ*СтрНом.КолВо;	
		сч=сч+1;
		Если Сч>25 тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 
	Пока Сч<=25 цикл
		СтруктураРеквизитов.Вставить("ФИО"+Строка(Сч),"");
		СтруктураРеквизитов.Вставить("ДТ"+Строка(Сч),"");
		СтруктураРеквизитов.Вставить("К"+Строка(Сч),"");
		СтруктураРеквизитов.Вставить("ДТВ"+Строка(Сч),"");
		СтруктураРеквизитов.Вставить("СТ"+Строка(Сч),"");
		СтруктураРеквизитов.Вставить("СТО"+Строка(Сч),"");
		сч=сч+1;
	КонецЦикла;
	
	СтруктураРеквизитов.Вставить("СТОИ",ОбщСт);
	
	//СтруктураРеквизитов.Вставить("ИмяПользователя",ТекПол.наименование);
	ТекПолНаименование = ПараметрыСеанса["ТекущийПользователь"].Наименование;
	СтруктураРеквизитов.Вставить("ИмяПользователя", ТекПолНаименование);
	
	Возврат СтруктураРеквизитов;
КонецФункции
// - Создать Документ WORD Подтверждение

&НаКлиенте
Процедура ПередЗакрытиемДокументаWord(Документ, Отмена)
УдалитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord; 

ЕстьИзменения = НЕ Документ.Saved; 

Если WordОтправитьПоПочте Тогда
	WordОтправитьПоПочте = Ложь;
	
	Если НЕ Объект.Отправлено Тогда
		Если ЕстьИзменения Тогда
			Документ.SaveAs2();
		КонецЕсли;	
		
		ОтправитьПоПочтеДокумент(Документ);		
	КонецЕсли;
	
	Перейти ~ЗАКРЫТЬ; 
	
Иначе	
	
	Если ЕстьИзменения Тогда
		wdDialogFileSaveAs = 84;
		Диалог = MSWord.Dialogs(wdDialogFileSaveAs);
		
		Диалог.Name = ИмяФайла;
		
		Результат = Диалог.Show();
		
		Если Результат <> -1 Тогда 
			Перейти ~ЗАКРЫТЬ; 
		КонецЕсли;
	КонецЕсли;
КонецЕсли;

~ЗАКРЫТЬ:
ЗакрытьДокументWORD(Документ);

Отмена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочтеДокумент(Документ);
Если НЕ ЗначениеЗаполнено(Почта) Тогда Возврат; КонецЕсли;
	
Если WordВыбратьФайл Тогда
	WordВыбратьФайл = Ложь;		
	ИмяФайла_ТМП = Документ.Name;
Иначе
	ИмяФайла_ТМП = ИмяФайла;
КонецЕсли;	
	
КаталогВременныхФайлов = КаталогВременныхФайлов();

ИмяФайлаPDF = КаталогВременныхФайлов + ИмяФайла_ТМП +  ".pdf";

wdFormatPDF	= 17; //	Формат PDF.
Документ.SaveAs2(ИмяФайлаPDF, wdFormatPDF);

//ОтправитьПоПочтеНаСервере(ИмяФайлаPDF);
ОтправитьПоПочтеНаКлиенте(ИмяФайлаPDF);

Объект.Отправлено = Истина;
//УдалитьФайлы(ИмяФайлаPDF); 
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочтеНаКлиенте(ИмяФайла)
Если НЕ ЗначениеЗаполнено(Почта) Тогда Возврат; КонецЕсли;
	
Получатели = Новый Массив;
Получатели.Добавить(Почта);

Файлы = Новый Массив;
Файлы.Добавить(ИмяФайла);

//ОбщийМодульСлужебныеСервер.ОтправитьМейлом(ПочтаТема, Файлы, Получатели, ПочтаТекстСообщения);
СлужебныеКлиент.ОтправитьEmail(ПочтаТема, Файлы, Получатели, ПочтаТекстСообщения, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьДокументWORD(Документ)
wdDoNotSaveChanges = 0;
wdSaveChanges =	-1;
Документ.Close(wdSaveChanges);

MSWord.Application.Visible = Ложь;

Индикатор = 0;
КонецПроцедуры

//
&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
WordОтправитьПоПочте = Истина;
	
Если ВыбратьФайл Тогда
	WordВыбратьФайл = Истина;
	
	ВыбратьФайл= Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Расширение = "doc";
		
	Диалог.Фильтр = "(*.DOC)|*.doc|(*.DOCX)*|*.docx";;

	//Диалог.ПолноеИмяФайла = ИмяФайла;

	Если НЕ Диалог.Выбрать() Тогда Возврат; КонецЕсли;
		
	ПолноеИмяФайлаПочта = Диалог.ПолноеИмяФайла;
	
	MSWord = ПолучитьMsWord();
	ДобавитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord;
	
	Документ = MSWord.Documents.Open(ПолноеИмяФайлаПочта);
	MSWord.Application.Visible = Истина;
Иначе
	
	Документ = WordФайлОткрыт();
	Если Документ <> Неопределено Тогда
		УдалитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord; 
		WordОтправитьПоПочте = Ложь;

		Документ = MsWord.Documents.Item(1);
		ОтправитьПоПочтеДокумент(Документ);
		
		ЗакрытьДокументWORD(Документ);
		
	Иначе
		НовоеПодтверждение(Неопределено);
	КонецЕсли;		
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция WordФайлОткрыт()
Если MsWord = Неопределено Тогда 	
	Возврат Неопределено;	
Иначе
	Попытка
		cnt = MSWord.Documents.Count;
		Возврат MsWord.Documents.Item(1);	
	Исключение
		Возврат Неопределено;	
	КонецПопытки;	
КонецЕсли;		
	
КонецФункции	
//

&НаКлиенте
Процедура СохранитьПодтверждение(Команда)
Документ = WordФайлОткрыт();	
Если Документ = Неопределено Тогда Возврат; КонецЕсли;	

Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
Диалог.Расширение = "doc";
Диалог.Фильтр = "(*.DOC)|*.doc|(*.DOCX)*|*.docx";;

Если НЕ Диалог.Выбрать() Тогда 
	
	Попытка
		cnt = MSWord.Documents.Count;
		ОшибкаWord = Ложь;
	Исключение
		ОшибкаWord = Истина;
	КонецПопытки;
	Если НЕ ОшибкаWord Тогда 
		УдалитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord; 
		
		wdDoNotSaveChanges = 0;
		wdSaveChanges =	-1;
		MSWord.Close(wdDoNotSaveChanges); 
	КонецЕсли;
	
	MSWord = Неопределено;
	
	Возврат; 
КонецЕсли;

УдалитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord; 
Документ.SaveAs2(Диалог.ПолноеИмяФайла);

ЗакрытьДокументWORD(Документ);

// + Диалог Word
//wdDialogFileSaveAs = 84;
//Диалог = MSWord.Dialogs(wdDialogFileSaveAs);

//Диалог.Name = ИмяФайла;

//Результат = Диалог.Show();
// - Диалог Word
КонецПроцедуры

//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
Если MsWord <> Неопределено Тогда
	Попытка
		cnt = MSWord.Documents.Count;
		ОшибкаWord = Ложь;
	Исключение
		ОшибкаWord = Истина;
	КонецПопытки;
	Если НЕ ОшибкаWord Тогда 
		УдалитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord; 
		
		wdDoNotSaveChanges = 0;
		wdSaveChanges =	-1;
		MSWord.Quit(wdDoNotSaveChanges); 
	КонецЕсли;
	
	MsWord = Неопределено;
КонецЕсли;
КонецПроцедуры

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета) Экспорт
ОтчетОбъект = РеквизитФормыВЗначение("Объект");
Макет = ОтчетОбъект.ПолучитьМакет(ИмяМакета);
Возврат Макет;
КонецФункции

&НаСервере
Функция ПолучитьМакетНовоеПодтверждение_1(НаАнглийском)
	Если НаАнглийском тогда
		Если НовНомера.Количество()=0 тогда
			//Макет = ПолучитьМакет("НовоеПодтверждение1_А");
			Макет = ПолучитьМакетНаСервере("НовоеПодтверждение1_А");	
			
		Иначе		
			//Макет = ПолучитьМакет("НовоеПодтверждение"+?(НовНомера.Количество()>3,"11",Строка(НовНомера.Количество()))+"_А");
			Макет = ПолучитьМакетНаСервере("НовоеПодтверждение"+?(НовНомера.Количество()>3,"11",Строка(НовНомера.Количество()))+"_А");
				
		КонецЕсли;
	иначе
		Если НовНомера.Количество()=0 тогда
			//Макет = ПолучитьМакет("НовоеПодтверждение1");
			Макет = ПолучитьМакетНаСервере("НовоеПодтверждение1");		

		ИначеЕсли НовНомера.Количество()<=11 тогда 
			//Макет = ПолучитьМакет("НовоеПодтверждение"+?(НовНомера.Количество()>3,"11",Строка(НовНомера.Количество())));
			Макет = ПолучитьМакетНаСервере("НовоеПодтверждение"+?(НовНомера.Количество()>3,"11",Строка(НовНомера.Количество())));
		иначе
			//Макет = ПолучитьМакет("НовоеПодтверждение12");
			Макет = ПолучитьМакетНаСервере("НовоеПодтверждение12");		
		КонецЕсли;
	конецесли;
	
	//Получим путь во временной директории для сохранения туда файла
    ИмяВрем = ПолучитьИмяВременногоФайла(".doc");

	Макет.Записать(ИмяВрем);
 	МойДокументВДвоичныхДанных = Новый ДвоичныеДанные(ИмяВрем);

	Возврат МойДокументВДвоичныхДанных;
КонецФункции

&НаКлиенте
Процедура НовоеПодтверждение_1(Команда)
ЗаполнитьНовоеПодтверждение();  

ФормированиеПодтвержденияWORD_1(Ложь);

//Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаНаАнглийскомЯзыке", ЭтаФорма);
//ПоказатьВопрос(Оповещение, "На английском языке?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаНаАнглийскомЯзыке(Результат, ДополнительныеПараметры) Экспорт
НаАнглийском = (Результат = КодВозвратаДиалога.Да); 
ФормированиеПодтвержденияWORD_1(Ложь);
КонецПроцедуры


&НаКлиенте
Функция ФормированиеПодтвержденияWORD_1(ФайлPDF) 
МойДокументВДвоичныхДанных = ПолучитьМакетНовоеПодтверждениеВДвоичныхДанных(НаАнглийском);

ИмяВрем = ПолучитьИмяВременногоФайла(".doc");
МойДокументВДвоичныхДанных.Записать(ИмяВрем);

Индикатор = 10;
ОбновитьОтображениеДанных();
	   
MSWord = Новый COMОбъект("Word.Application");
Документ = MSWord.Documents.Add(ИмяВрем);
//Документ = MSWord.Documents.Open(ИмяВрем);

Индикатор = 15;
ОбновитьОтображениеДанных();

Table = Документ.Tables(1);
Row1 = Table.Rows(2);

Индикатор = 20;
ОбновитьОтображениеДанных();

Для Индекс = 1 По НовНомера.Количество() - 1 Цикл
	Row1.Range.Copy();
	wdFormatOriginalFormatting = 16;
	Row1.Range.PasteAndFormat (wdFormatOriginalFormatting);
		
	Row = Table.Rows(Индекс + 2);
	НомерСтроки = Строка(Индекс + 1); 
	Row.Cells(1).Range.Text = "<ФИО" + НомерСтроки + ">";
	Row.Cells(3).Range.Text = "<ДТ" + НомерСтроки + ">";
	Row.Cells(4).Range.Text = "<К" + НомерСтроки + ">";
	Row.Cells(5).Range.Text = "<ДТВ" + НомерСтроки + ">";
	Row.Cells(6).Range.Text = "<СТ" + НомерСтроки + ">";
	Row.Cells(7).Range.Text = "<СТО" + НомерСтроки + ">";
	
	Индикатор = 20 + 0.4 * (Индекс * 100 / НовНомера.Количество()) ;
	ОбновитьОтображениеДанных();
КонецЦикла;

СтруктураРеквизитов = ЗаполнитьРеквизитыНовоеПодтверждение();	
Индекс = 1;
Для Каждого Элемент из СтруктураРеквизитов Цикл
	Замена = Документ.Content.Find;
	Замена.Execute("<" + Элемент.Ключ + ">", Ложь, Истина, Ложь, , , Истина, , Ложь, Элемент.Значение);
	
	Индикатор = 60 + 0.2 * (Индекс * 100 / СтруктураРеквизитов.Количество()) ;
	ОбновитьОтображениеДанных();
	
	Индекс = Индекс + 1;
КонецЦикла;

MSWord.Application.Visible = Истина;

MSWord.Activate();
Документ.ActiveWindow.Caption = "Подтверждение";
Документ.Save();

Индикатор = 90;

Если ФайлPDF Тогда
	ИмяВремPDF = ПолучитьИмяВременногоФайла(".pdf");

	вдформатпдф	= 17; //	Формат PDF.
	Документ.SaveAs2(ИмяВремPDF, вдформатпдф);

	Индикатор = 100;
	Возврат ИмяВремPDF;
КонецЕсли;

Индикатор = 100;
Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ТЕСТ(Команда)
Получатели = Новый СписокЗначений;
Получатели.Добавить(Почта);

Файлы = Новый СписокЗначений;
Файлы.Добавить("C:\TEMP\123.docx");

СлужебныеКлиент.ОтправитьEmail("123", Файлы , Получатели, "321", ЭтаФорма.УникальныйИдентификатор);	
КонецПроцедуры

&НаКлиенте
Процедура ТЕСТ_1(Команда)
MSWord = ПолучитьMsWord();
//Если MSWord = Неопределено Тогда
//	MSWord = Новый COMОбъект("Word.Application");
//Иначе
//	Если MsWord.Documents.Count > 0 Тогда 
//		УдалитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord; 

//		Для Каждого Документ Из MsWord.Documents Цикл
//			wdDoNotSaveChanges = 0;
//			wdSaveChanges =	-1;
//			Документ.Close(wdDoNotSaveChanges);
//		КонецЦикла;	
//	КонецЕсли;
//КонецЕсли;

МойДокументВДвоичныхДанных = ПолучитьМакетНовоеПодтверждениеВДвоичныхДанных(НаАнглийском);

ИмяВрем = ПолучитьИмяВременногоФайла(".doc");
МойДокументВДвоичныхДанных.Записать(ИмяВрем);
	
ДокументWord = MSWord.Documents.Open(ИмяВрем);

MSWord.Application.Visible = Истина;

WordОтправитьПоПочте = Истина;

ДобавитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord_ТЕСТ;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемДокументаWord_ТЕСТ(Документ, Отмена)
УдалитьОбработчик MSWord.DocumentBeforeClose, ПередЗакрытиемДокументаWord; 

ЕстьИзменения = НЕ Документ.Saved; 

Если WordОтправитьПоПочте Тогда
	Если НЕ Объект.Отправлено Тогда
		Если ЕстьИзменения Тогда
			Документ.SaveAs2();
		КонецЕсли;	
		
		ИмяВремPDF = ПолучитьИмяВременногоФайла(".pdf");

		wdFormatPDF	= 17; //	Формат PDF.
		Документ.SaveAs2(ИмяВремPDF, wdFormatPDF);
	
		Объект.Отправлено = Истина;
		//ОтправитьПоПочтеНаСервере(ИмяВремPDF);
		ОтправитьПоПочтеНаКлиенте(ИмяВремPDF);
	КонецЕсли;
	
	Перейти ~ЗАКРЫТЬ; 
	
Иначе	
	
	Если ЕстьИзменения Тогда
		wdDialogFileSaveAs = 84;
		Диалог = MSWord.Dialogs(wdDialogFileSaveAs);
		Диалог.Name = ИмяФайла;
		Результат = Диалог.Show();
		Если Результат <> -1 Тогда 
					
			Перейти ~ЗАКРЫТЬ; 
		КонецЕсли;
	КонецЕсли;
КонецЕсли;

~ЗАКРЫТЬ:
wdDoNotSaveChanges = 0;
wdSaveChanges =	-1;
Документ.Quit(wdSaveChanges);

Отмена = Истина;
КонецПроцедуры



	





