

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
// + регистр УборкиНомеров
Движения.УборкиНомеров.Записывать = Истина;

Движение = Движения.УборкиНомеров.Добавить();
Движение.Документ = ЭтотОбъект.Ссылка;

Движение.Комната = ЭтотОбъект.НомерВРезерв;
Движение.Горничная = ЭтотОбъект.Горничная;
Движение.ВремяУброки = ЭтотОбъект.ВремяУборки;

Движение.ТипУборки = ЭтотОбъект.ТипУборки;
Движение.ТипУборкиПризнак = ЭтотОбъект.ТипУборкиПризнак;

Движение.ТипКомплектации = ЭтотОбъект.ТипКомплектации;

Движение.Температура = ЭтотОбъект.Температура;
Движение.КолВоГостей = ЭтотОбъект.КоличествоПроживающих;

Неисправности_П = ПолучитьТехническиеНеисправности(ЭтотОбъект.ТехническиеНеисправности, ЭтотОбъект.ТехническиеНеисправностиПримечание);
Движение.Неисправности = Неисправности_П;

Движение.Ущерб = ЭтотОбъект.УщербНомеру;

ДополнительноеОборудование_П = ПолучитьОборудование(ЭтотОбъект.ДополнительноеОборудование);
Движение.Оборудование = ДополнительноеОборудование_П;

Минибар_П = ПолучитьМинибар(ЭтотОбъект.Минибар);
Движение.Минибар = Минибар_П;

Движение.Курит = ЭтотОбъект.Курит;
Движение.ЗабытыеВещи = ЭтотОбъект.ЗабытыеВещи;
Движение.Комментарий = ЭтотОбъект.Комментарий;

Движение.РаздельныеКровати = ЭтотОбъект.РаздельныеКровати;
Движение.РаздельныеКроватиОбработка = ЭтотОбъект.РаздельныеКроватиОбработка;
 //- регистр УборкиНомеров
КонецПроцедуры

Функция ПолучитьОборудование(ДопОборудование)
СтрокаДопОборудование = "";
Для Каждого Строка Из ДопОборудование Цикл
	СтрокаДопОборудование = СтрокаДопОборудование + Строка.ДопОборудование + ", "; 
КонецЦикла;

Если СтрокаДопОборудование <> "" Тогда
	СтрокаДопОборудование = Лев(СтрокаДопОборудование, СтрДлина(СтрокаДопОборудование) - 2) + ".";
КонецЕсли;

Возврат СтрокаДопОборудование; 	
КонецФункции

Функция ПолучитьМинибар(Минибар)
СтрокаМинибар = "";
Для Каждого Строка Из Минибар Цикл
	СтрокаМинибар = СтрокаМинибар + Строка.НоменклатураМинибараНаименованиеВыгрузка + ", ";
КонецЦикла;

Если СтрокаМинибар <> "" Тогда
	СтрокаМинибар = Лев(СтрокаМинибар, СтрДлина(СтрокаМинибар) - 2) + ".";
КонецЕсли;

Возврат СтрокаМинибар;
КонецФункции

Функция ПолучитьТехническиеНеисправности(ТехническиеНеисправности, ТехническиеНеисправностиПримечание)
СтрокаТехническиеНеисправности = ГорничныеОбслуживаниеНомераСервер.ПолучитьТехническиеНеисправности(
	ТехническиеНеисправности, ТехническиеНеисправностиПримечание);
Возврат СтрокаТехническиеНеисправности;
КонецФункции

