
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ВызовИзДокумента", ВызовИзДокумента);

Параметры.Свойство("ТипГрупповогоСчета", ТипГрупповогоСчета);
Если ЗначениеЗаполнено(ТипГрупповогоСчета) Тогда 
	Элементы.ТипГрупповогоСчета.ТолькоПросмотр = Истина; 
	
	ТипГрупповогоСчетаПриИзмененииНаСервере();
КонецЕсли;

Параметры.Свойство("Контрагент", Контрагент);
Если ЗначениеЗаполнено(Контрагент) Тогда
	КонтрагентОтбор = Контрагент;
	Элементы.Контрагент.ТолькоПросмотр = Истина; 
КонецЕсли;

Если НЕ Параметры.Свойство("ТолькоПроживание", ТолькоПроживание) Тогда
	ТолькоПроживание = Ложь;
КонецЕсли;	

Если НЕ Параметры.Свойство("ТолькоУслуги", ТолькоУслуги) Тогда
	ТолькоУслуги = Ложь;
КонецЕсли;

Если ТолькоПроживание И ТолькоУслуги Тогда
	ТолькоПроживание = Ложь;
	ТолькоУслуги = Ложь;
КонецЕсли;

Параметры.Свойство("ДатаС", ДатаОтбораС);
Параметры.Свойство("ДатаПо", ДатаОтбораПо);

УстановитьДекорацияТолькоПроживаниеТолькоУслуги(ТолькоПроживание, ТолькоУслуги);

Неоплачено = Истина;

УсловноеОформлениеЗагрузить();
КонецПроцедуры

&НаСервере
Процедура УстановитьДекорацияТолькоПроживаниеТолькоУслуги(ТолькоПроживание, ТолькоУслуги)
Если ТолькоПроживание Тогда
	Элементы.ДекорацияТолькоПроживаниеТолькоУслуги.Заголовок = "Только проживание";
ИначеЕсли ТолькоУслуги Тогда
	Элементы.ДекорацияТолькоПроживаниеТолькоУслуги.Заголовок = "Только услуги";
Иначе
	Элементы.ДекорацияТолькоПроживаниеТолькоУслуги.Заголовок = "Проживание и услуги";
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(КонтрагентОтбор);
Если ВызовИзДокумента Тогда 
	Отобрать(Неопределено);
КонецЕсли;		
КонецПроцедуры

//
&НаСервере
Процедура УсловноеОформлениеЗагрузить()
ЭлементыТабНаФормеИмя = Элементы.ТаблицаОтбора.Имя;

ПутьКПолюОтбора = "ТаблицаОтбора.Отметка";
Вид_Сравнения = ВидСравненияКомпоновкиДанных.Равно;

УсловноеОформление.Элементы.Очистить();

ПравоеЗначение = Истина;
Web_Цвета = WebЦвета.БледноЗолотистый;

ОбщийФункционалСервер.УсловноеОформлениеДобавитьПоле(УсловноеОформление,
	ЭлементыТабНаФормеИмя,ПутьКПолюОтбора,Вид_Сравнения, ПравоеЗначение, Web_Цвета );
КонецПроцедуры
//

////
&НаКлиенте
Процедура ТипГрупповогоСчетаПриИзменении(Элемент)
ТипГрупповогоСчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипГрупповогоСчетаПриИзмененииНаСервере()
Контрагент = Неопределено;

КонтрагентОтбор = Неопределено;
КонтрагентОтборПриИзмененииНаСервере();

ТаблицаОтбора.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
КонтрагентОтбор = Контрагент;
КонтрагентОтборПриИзмененииНаСервере();
КонецПроцедуры

//
&НаСервере
Процедура КонтрагентОтборПриИзмененииНаСервере()
ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(КонтрагентОтбор);

//Если ЮрЛицо Тогда ИПустые = Ложь; КонецЕсли;
//Элементы.ИПустые.Доступность = НЕ ЮрЛицо;

//ОтобратьНаСервере();
КонецПроцедуры
//

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

Если НЕ ЗначениеЗаполнено(ТипГрупповогоСчета) Тогда Возврат; КонецЕсли;

ПараметрыФормы = КонтрагентНачалоВыбораПараметрыОтбора();

ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаВыбораКонтрагента", ПараметрыФормы, Элементы.Контрагент
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция КонтрагентНачалоВыбораПараметрыОтбора()
ПараметрыФормы = Новый Структура;
Если ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ГруппаЗаявок Тогда
	ПараметрыФормы.Вставить("Турагентство", Ложь);
	
ИначеЕсли ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ТурагентствоВзаимозачет Тогда
	ПараметрыФормы.Вставить("Турагентство", Истина);
	
	СписокЗначенийТипыОплатыСчета = Новый СписокЗначений;
	СписокЗначенийТипыОплатыСчета.Добавить(Перечисления.ТипОплатыСчета.Взаимозачет);
	
	ПараметрыФормы.Вставить("СписокЗначенийТипыОплатыСчета", СписокЗначенийТипыОплатыСчета);
	
ИначеЕсли ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ТурагентствоКомиссия Тогда
	ПараметрыФормы.Вставить("Турагентство", Ложь);
	
 	СписокЗначенийТипыОплатыСчета = Новый СписокЗначений;
	СписокЗначенийТипыОплатыСчета.Добавить(Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой);
	СписокЗначенийТипыОплатыСчета.Добавить(Перечисления.ТипОплатыСчета.ПолнаяОплатаТурагентствомСВозвратомКомиссии);
	
	ПараметрыФормы.Вставить("СписокЗначенийТипыОплатыСчета", СписокЗначенийТипыОплатыСчета);
	
	
ИначеЕсли ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ТурагентствоДолги Тогда
	ПараметрыФормы.Вставить("Турагентство", Ложь);
	
 	СписокЗначенийТипыОплатыСчета = Новый СписокЗначений;
	СписокЗначенийТипыОплатыСчета.Добавить(Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой);
	СписокЗначенийТипыОплатыСчета.Добавить(Перечисления.ТипОплатыСчета.ПолнаяОплатаТурагентствомСВозвратомКомиссии);
	
Иначе
	
КонецЕсли;

Возврат ПараметрыФормы;
КонецФункции
//


//

&НаКлиенте
Процедура ТолькоПроживаниеПриИзменении(Элемент)
Если ТолькоПроживание Тогда ТолькоУслуги = Ложь; КонецЕсли;	

УстановитьДекорацияТолькоПроживаниеТолькоУслуги(ТолькоПроживание, ТолькоУслуги);

Отобрать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоУслугиПриИзменении(Элемент)
Если ТолькоУслуги Тогда ТолькоПроживание = Ложь; КонецЕсли;	
	
УстановитьДекорацияТолькоПроживаниеТолькоУслуги(ТолькоПроживание, ТолькоУслуги);
	
Отобрать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура НеоплаченоПриИзменении(Элемент)
Отобрать(Неопределено);
КонецПроцедуры
////

//
&НаКлиенте
Процедура Отобрать(Команда)
Если ТолькоПроживание И ТолькоУслуги Тогда
	ПоказатьПредупреждение(, "Установлены флажки 'Только проживание' и 'Только услуги'
	|
	|ОТБОР НЕ ВОЗМОЖЕН ...");
	Возврат;
КонецЕсли;
	
ОтобратьНаСервере()
КонецПроцедуры

&НаСервере
Процедура ОтобратьНаСервере()
Запрос = Новый Запрос;
Запрос.Текст = ГрупповойСчетСервер.ЗапросТекстОтборСчетовЗаявокГрупповойСчет();

Запрос.УстановитьПараметр("КонтрагентОтбор", КонтрагентОтбор);
Запрос.УстановитьПараметр("РезервС", ДатаОтбораС);

Если ЗначениеЗаполнено(ДатаОтбораПо) Тогда ДатаОтбораПо_П = ДатаОтбораПо; Иначе ДатаОтбораПо_П = '30010101'; КонецЕсли;
Запрос.УстановитьПараметр("РезервПо", ДатаОтбораПо_П);

Запрос.УстановитьПараметр("ТолькоПроживание", ТолькоПроживание);
Запрос.УстановитьПараметр("ТолькоУслуги", ТолькоУслуги);

ТЗРезультат = Запрос.Выполнить().Выгрузить();

ТаблицаОтбора.Очистить();
Для Каждого Строка Из ТЗРезультат Цикл
	Если Неоплачено тогда
		Если НЕ Строка.СуммаОплаты = 0 Тогда Продолжить; КонецЕсли;
	КонецЕсли;
	
	Если ТолькоПроживание И Строка.СуммаПроживание = 0 Тогда Продолжить; КонецЕсли;
	
	Если ТолькоУслуги И Строка.СуммаУслуги = 0 Тогда Продолжить; КонецЕсли;
	
	Если Строка.СуммаПроживание = 0 И Строка.СуммаУслуги = 0 Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = ТаблицаОтбора.Добавить();
	НоваяСтрока.ЗаявкаНаБронирование = Строка.Ссылка;
	НоваяСтрока.Контрагент = Строка.Оплачивает;
	НоваяСтрока.Проживает = Строка.Клиент;
	НоваяСтрока.Бронирует = Строка.Бронирует;
	НоваяСтрока.РезервС = Строка.РезервС;
	НоваяСтрока.РезервПо = Строка.РезервПо;
	НоваяСтрока.Номер = Строка.НомерВРезерв;
	НоваяСтрока.СуммаПроживание = Строка.СуммаПроживание;
	НоваяСтрока.СуммаУслуги = Строка.СуммаУслуги;
	НоваяСтрока.СуммаОплачено = Строка.СуммаОплаты;
	
	НоваяСтрока.ДатаЗаявки = Строка.Дата;
	НоваяСтрока.НомерЗаявки = Строка.Номер;
	
	НоваяСтрока.ТолькоПроживание = Строка.ТолькоПроживание;
	НоваяСтрока.ТолькоУслуги = Строка.ТолькоУслуги;
	
	НоваяСтрока.НомерСчета = Строка.НомерСчета;
	НоваяСтрока.ДатаСчета = Строка.ДатаСчета;
	НоваяСтрока.СчетГУИД = Строка.СчетГУИД;
КонецЦикла;	

ТаблицаОтбора.Сортировать("РезервС, ЗаявкаНаБронирование, НомерСчета, ДатаСчета"); 
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтметитьВсе(Команда)
Для Каждого Строка Из ТаблицаОтбора Цикл
	Строка.Отметка = Истина;	
КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтметкиВсе(Команда)
Для Каждого Строка Из ТаблицаОтбора Цикл
	Строка.Отметка = Ложь;	
КонецЦикла;	
КонецПроцедуры
//


//
&НаКлиенте
Процедура ТаблицаОтбораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтбораПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТекущиеДанные = ТаблицаОтбора.НайтиПоИдентификатору(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура();
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ЗаявкаНаБронирование);

ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы .БлокироватьОкноВладельца);
КонецПроцедуры
//

////////
&НаКлиенте
Процедура ОтменаКоманда(Команда)
Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаявки(Команда)
МассивЗаявок = МассивЗаявок();
Если МассивЗаявок.Количество() = 0 Тогда 
		ПоказатьПредупреждение(, "Ничего не отмечено.");
	Возврат;
КонецЕсли;

ТекстПредупреждения = "";
Если НЕ ЗначениеЗаполнено(ТипГрупповогоСчета) Тогда 
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			, "Заполните реквизит 'Тип группового счета'", Символы.ПС);
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			, "Заполните реквизит 'Оплачивает'", Символы.ПС);
КонецЕсли;

Если НЕ ТекстПредупреждения = "" Тогда 
		ПоказатьПредупреждение(, ТекстПредупреждения);
	Возврат;
КонецЕсли;

ПараметрыЗакрытия = Новый Структура("ТипГрупповогоСчета, Оплачивает, ТолькоПроживание, ТолькоУслуги, МассивЗаявок"
	, ТипГрупповогоСчета, Контрагент, ТолькоПроживание, ТолькоУслуги, МассивЗаявок); 
Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаСервере
Функция МассивЗаявок()
ТаблицаОтбораПараметр = ТаблицаОтбора;	
МассивЗаявок = Новый Массив;
	
ОтборСтроки = Новый Структура("Отметка", Истина);
МассивОтборЗаявок = ТаблицаОтбора.НайтиСтроки(ОтборСтроки);
Если МассивОтборЗаявок.Количество() = 0 Тогда 
	Возврат МассивЗаявок; 
КонецЕсли; 

ТаблицаЗаявок = ТаблицаОтбора.Выгрузить(МассивОтборЗаявок);
ТаблицаЗаявок.Сортировать("РезервС, ЗаявкаНаБронирование, НомерСчета, ДатаСчета");

Для Каждого Строка Из ТаблицаЗаявок Цикл
	Данные = Новый Структура("ЗаявкаСсылка, СчетГУИД", Строка.ЗаявкаНаБронирование, Строка.СчетГУИД);
	
	МассивЗаявок.Добавить(Данные);
КонецЦикла;

Возврат МассивЗаявок;
КонецФункции


// ++++++++++++++++++++++++++++++++++++++++++++++++++++



