Перем КолВоДней,КолВоДнейВых,ТарифРомантик,ТарифСвадьба;


&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//КолВоДней=Окр((КонецДня(ДК)-НачалоДня(ДН))/86400);
	//ТарифРомантик=Справочники.Тариф.НайтиПоКоду("000000001");
	//Заселяемость=ПолучитьПроцентЗаселяемости();
	//Финансы=ПолучитьФинансы();
	//КолВоДнейВых=0;
	//ДТН=НачалоДня(ДН);
	//ДТК=КонецДня(ДК);
	//Пока ДТН<=ДТК цикл
	//	Если ДеньНедели(ДТН)>5 тогда
	//		КолВоДнейВых=КолВоДнейВых+1;
	//	конецесли;		
	//	ДТН=ДТН+86400;		
	//КонецЦикла;
	//
	//Макет=ПолучитьМакет("Макет");
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	////Рез=Новый Структура("НомерДень,ЧеловекДень,НомерДеньВых,ЧеловекДеньВых,НомерДеньБезВых,ЧеловекДеньБезВых");
	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Процент заселяемости (номеров)";
	//Обл.Параметры.Значение=Формат(?(КолВоДней=0,0,(Заселяемость.НомерДень/(КолВоДней*20))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Процент заселяемости (номеров) вар.2";
	//Обл.Параметры.Значение=Формат(?(КолВоДней=0,0,(Заселяемость.НомерДень2/(КолВоДней*20))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Процент заселяемости (Человек)";
	//Обл.Параметры.Значение=Формат(?(КолВоДней=0,0,(Заселяемость.ЧеловекДень/(КолВоДней*40))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Процент заселяемости (Ежедневный)";
	//Обл.Параметры.Значение=Формат(?(КолВоДней=0,0,(Заселяемость.НомерЧас/(КолВоДней*20*24))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Процент заселяемости в выходные (номеров)";
	//Обл.Параметры.Значение=Формат(?(КолВоДнейВых=0,0,(Заселяемость.НомерДеньВых/(КолВоДнейВых*20))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Процент заселяемости в выходные(Человек)";
	//Обл.Параметры.Значение=Формат(?(КолВоДнейВых=0,0,(Заселяемость.ЧеловекДеньВых/(КолВоДнейВых*40))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Процент заселяемости без выходных (номеров)";
	//Обл.Параметры.Значение=Формат(?(КолВоДней-КолВоДнейВых=0,0,(Заселяемость.НомерДеньБезВых/((КолВоДней-КолВоДнейВых)*20))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Процент заселяемости без выходных(Человек)";
	//Обл.Параметры.Значение=Формат(?(КолВоДней-КолВоДнейВых=0,0,(Заселяемость.ЧеловекДеньБезВых/((КолВоДней-КолВоДнейВых)*40))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Количество номеров по тарифу Романтическая Встреча ";
	//Обл.Параметры.Значение=Формат(Заселяемость.Романтик, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Количество свадебных номеров";
	//Обл.Параметры.Значение=Формат(Заселяемость.Свадьба, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Общее количество ночевок  (человек/ночей)";
	//Обл.Параметры.Значение=Формат(Заселяемость.ЧеловекДень, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Общее количество гостей";
	//Обл.Параметры.Значение=Формат(Заселяемость.Гости, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Количество номеров, которым предоставлена скидка 10%";
	//Обл.Параметры.Значение=Формат(Заселяемость.Скидка10, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Количество номеров, которым предоставлена скидка 15%";
	//Обл.Параметры.Значение=Формат(Заселяемость.Скидка15, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Количество номеров, которым предоставлена скидка 20%";
	//Обл.Параметры.Значение=Формат(Заселяемость.Скидка20, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Среднее количество гостей в номере";
	//Обл.Параметры.Значение=Формат(?(Заселяемость.Проживаний=0,0,Заселяемость.Гости/Заселяемость.Проживаний), "ЧДЦ=2; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Завтрак на 1 чел. ";
	//Обл.Параметры.Значение=Формат(?(Заселяемость.Гости=0,0,Финансы.Завтрак/Заселяемость.Гости), "ЧДЦ=2; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Прачечная на 1 чел. ";
	//Обл.Параметры.Значение=Формат(?(Заселяемость.Гости=0,0,Финансы.Прачечная/Заселяемость.Гости), "ЧДЦ=2; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Cредняя длительность проживания гостя";
	//Обл.Параметры.Значение=Формат(?(Заселяемость.Проживаний=0,0,(Заселяемость.Длительность/24)/Заселяемость.Проживаний), "ЧДЦ=2; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//
	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Кол-во гостей из России";
	//Обл.Параметры.Значение=Формат(Заселяемость.Россия, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Кол-во гостей из СНГ";
	//Обл.Параметры.Значение=Формат(Заселяемость.СНГ, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

	//Обл=Макет.ПолучитьОбласть("Строка");
	//Обл.Параметры.Показатель="Кол-во гостей-иностранцев";
	//Обл.Параметры.Значение=Формат(Заселяемость.Иностранцы, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
 СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	КолВоДней=Окр((КонецДня(Отчет.ДК)-НачалоДня(Отчет.ДН))/86400);
	ТарифРомантик=Справочники.Тариф_НеИспользуется.НайтиПоКоду("000000001");
	Заселяемость=ПолучитьПроцентЗаселяемости();
	Финансы=ПолучитьФинансы();
	КолВоДнейВых=0;
	ДТН=НачалоДня(Отчет.ДН);
	ДТК=КонецДня(Отчет.ДК);
	Пока ДТН<=ДТК цикл
		Если ДеньНедели(ДТН)>5 тогда
			КолВоДнейВых=КолВоДнейВых+1;
		конецесли;		
		ДТН=ДТН+86400;		
	КонецЦикла;
	
	//Макет=ПолучитьМакет("Макет");
	Макет = Отчеты.ОтчетПоПоказателям.ПолучитьМакет("Макет");
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	////Рез=Новый Структура("НомерДень,ЧеловекДень,НомерДеньВых,ЧеловекДеньВых,НомерДеньБезВых,ЧеловекДеньБезВых");
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Процент заселяемости (номеров)";
	Обл.Параметры.Значение=Формат(?(КолВоДней=0,0,(Заселяемость.НомерДень/(КолВоДней*20))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Процент заселяемости (номеров) вар.2";
	Обл.Параметры.Значение=Формат(?(КолВоДней=0,0,(Заселяемость.НомерДень2/(КолВоДней*20))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Процент заселяемости (Человек)";
	Обл.Параметры.Значение=Формат(?(КолВоДней=0,0,(Заселяемость.ЧеловекДень/(КолВоДней*40))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Процент заселяемости (Ежедневный)";
	Обл.Параметры.Значение=Формат(?(КолВоДней=0,0,(Заселяемость.НомерЧас/(КолВоДней*20*24))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Процент заселяемости в выходные (номеров)";
	Обл.Параметры.Значение=Формат(?(КолВоДнейВых=0,0,(Заселяемость.НомерДеньВых/(КолВоДнейВых*20))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Процент заселяемости в выходные(Человек)";
	Обл.Параметры.Значение=Формат(?(КолВоДнейВых=0,0,(Заселяемость.ЧеловекДеньВых/(КолВоДнейВых*40))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Процент заселяемости без выходных (номеров)";
	Обл.Параметры.Значение=Формат(?(КолВоДней-КолВоДнейВых=0,0,(Заселяемость.НомерДеньБезВых/((КолВоДней-КолВоДнейВых)*20))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Процент заселяемости без выходных(Человек)";
	Обл.Параметры.Значение=Формат(?(КолВоДней-КолВоДнейВых=0,0,(Заселяемость.ЧеловекДеньБезВых/((КолВоДней-КолВоДнейВых)*40))*100), "ЧДЦ=2; ЧГ=")+"%";
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Количество номеров по тарифу Романтическая Встреча ";
	Обл.Параметры.Значение=Формат(Заселяемость.Романтик, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Количество свадебных номеров";
	Обл.Параметры.Значение=Формат(Заселяемость.Свадьба, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Общее количество ночевок  (человек/ночей)";
	Обл.Параметры.Значение=Формат(Заселяемость.ЧеловекДень, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Общее количество гостей";
	Обл.Параметры.Значение=Формат(Заселяемость.Гости, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Количество номеров, которым предоставлена скидка 10%";
	Обл.Параметры.Значение=Формат(Заселяемость.Скидка10, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	        
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Количество номеров, которым предоставлена скидка 15%";
	Обл.Параметры.Значение=Формат(Заселяемость.Скидка15, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Количество номеров, которым предоставлена скидка 20%";
	Обл.Параметры.Значение=Формат(Заселяемость.Скидка20, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

    Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Среднее количество гостей в номере";
	Обл.Параметры.Значение=Формат(?(Заселяемость.Проживаний=0,0,Заселяемость.Гости/Заселяемость.Проживаний), "ЧДЦ=2; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Завтрак на 1 чел. ";
	Обл.Параметры.Значение=Формат(?(Заселяемость.Гости=0,0,Финансы.Завтрак/Заселяемость.Гости), "ЧДЦ=2; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Прачечная на 1 чел. ";
	Обл.Параметры.Значение=Формат(?(Заселяемость.Гости=0,0,Финансы.Прачечная/Заселяемость.Гости), "ЧДЦ=2; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Cредняя длительность проживания гостя";
	Обл.Параметры.Значение=Формат(?(Заселяемость.Проживаний=0,0,(Заселяемость.Длительность/24)/Заселяемость.Проживаний), "ЧДЦ=2; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Кол-во гостей из России";
	Обл.Параметры.Значение=Формат(Заселяемость.Россия, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

    Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Кол-во гостей из СНГ";
	Обл.Параметры.Значение=Формат(Заселяемость.СНГ, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

	Обл=Макет.ПолучитьОбласть("Строка");
	Обл.Параметры.Показатель="Кол-во гостей-иностранцев";
	Обл.Параметры.Значение=Формат(Заселяемость.Иностранцы, "ЧДЦ=0; ЧГ=");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);

КонецПроцедуры


&НаСервере
Функция ПолучитьПроцентЗаселяемости()
	
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) КАК Поле1,
	                    |	ЗанятостьНомеров.Номер,
	                    |	ЗанятостьНомеров.Регистратор.КолВоЧеловек КАК КолВоЧеловек
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                    |	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется <> &Тариф_НеИспользуется
	                    |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);

	 
	 ТЗ=Запрос.Выполнить().Выгрузить();
	 
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                     |	ЗанятостьНомеров.Регистратор.КолВо,
	                     |	ЗанятостьНомеров.Регистратор
	                     |ИЗ
	                     |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                     |ГДЕ
	                     |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                     |	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется <> &Тариф_НеИспользуется
	                     |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);

	 
	 ТЗ2=Запрос.Выполнить().Выгрузить();

	 
	 
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	ЗанятостьНомеров.ПериодРезерва,
	                    |	ЗанятостьНомеров.Номер	                  
	                    |ИЗ
	                    |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                    |ГДЕ
	                    |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
						|	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется <> &Тариф_НеИспользуется
	                    |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);
 
	 ТЗДень=Запрос.Выполнить().Выгрузить();

	 
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                     |	НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) КАК Поле1,
	                     |	ЗанятостьНомеров.Номер,
	                     |	ЗанятостьНомеров.Регистратор.КолВоЧеловек КАК КолВоЧеловек
	                     |ИЗ
	                     |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                     |ГДЕ
	                     |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                     |	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется <> &Тариф_НеИспользуется
	                     |	И ДЕНЬНЕДЕЛИ(ЗанятостьНомеров.ПериодРезерва) > 5
						 |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	  Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);
 
	 ТЗВых=Запрос.Выполнить().Выгрузить();

	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                     |	НАЧАЛОПЕРИОДА(ЗанятостьНомеров.ПериодРезерва, ДЕНЬ) КАК Поле1,
	                     |	ЗанятостьНомеров.Номер,
	                     |	ЗанятостьНомеров.Регистратор.КолВоЧеловек КАК КолВоЧеловек
	                     |ИЗ
	                     |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                     |ГДЕ
	                     |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                     |	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется <> &Тариф_НеИспользуется
	                     |	И ДЕНЬНЕДЕЛИ(ЗанятостьНомеров.ПериодРезерва) <= 5");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	  Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);

	 ТЗБезВых=Запрос.Выполнить().Выгрузить();

	 
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                     |	ЗанятостьНомеров.Регистратор
	                     |ИЗ
	                     |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                     |ГДЕ
	                     |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                     |	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется = &Тариф_НеИспользуется
						  |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));	 
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);

	 
	 ТЗРомантик=Запрос.Выполнить().Выгрузить();
	 
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ	                 
	                     |	РАЗЛИЧНЫЕ ЗанятостьНомеров.Регистратор КАК Регистратор,
	                     |	ЗанятостьНомеров.Регистратор.КолВоЧеловек КАК КолВоЧеловек
	                     |ИЗ
	                     |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                     |ГДЕ
	                     |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                     |	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется <> &Тариф_НеИспользуется
						  |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);
	 
	 ТЗГости=Запрос.Выполнить().Выгрузить();

     Запрос=Новый Запрос("ВЫБРАТЬ
                         |	ЗанятостьНомеров.Клиент.Категория КАК Скидка,
                         |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗанятостьНомеров.Регистратор) КАК Номер
                         |ИЗ
                         |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                         |ГДЕ
                         |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
                         |	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется <> &Тариф_НеИспользуется
                         |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус
                         |
                         |СГРУППИРОВАТЬ ПО
                         |	ЗанятостьНомеров.Клиент.Категория");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);

	 ТЗСкидки=Запрос.Выполнить().Выгрузить();
     Спр10=Справочники.КатегорииКлиентов.НайтиПоКоду("000000001");	
	 Спр15=Справочники.КатегорииКлиентов.НайтиПоКоду("000000002");
	 Спр20=Справочники.КатегорииКлиентов.НайтиПоКоду("000000004");
	 
	 Скидка10=0;
	 Скидка15=0;
	 Скидка20=0;
	 
	 Для каждого Стр Из ТЗСкидки Цикл
		 Если СТр.Скидка=Спр10 тогда
			 Скидка10=Стр.Номер;
		 конецесли;
		 Если СТр.Скидка=Спр15 тогда
			 Скидка15=Стр.Номер;
		 конецесли;
		 Если СТр.Скидка=Спр20 тогда
			 Скидка20=Стр.Номер;
		 конецесли;
	 	
	 
	 КонецЦикла; 
	 
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                     |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗанятостьНомеров.ПериодРезерва) КАК ПериодРезерва,
	                     |	ЗанятостьНомеров.Регистратор
	                     |ИЗ
	                     |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                     |ГДЕ
	                     |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                     |	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется <> &Тариф_НеИспользуется
	                     |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус
	                     |СГРУППИРОВАТЬ ПО
	                     |	ЗанятостьНомеров.Регистратор");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	  Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);
	 
	 ТЗДлит=Запрос.Выполнить().Выгрузить();
	 
	 
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                     |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗанятостьНомеров.ПериодРезерва) КАК ПериодРезерва,
	                     |	ЗанятостьНомеров.Регистратор
	                     |ИЗ
	                     |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                     |ГДЕ
	                     |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                     |	И ЗанятостьНомеров.Регистратор.Тариф_НеИспользуется <> &Тариф_НеИспользуется
						  |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	ЗанятостьНомеров.Регистратор");
	 Запрос.УстановитьПараметр("Тариф_НеИспользуется",ТарифРомантик);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь); 
	 ТЗДлит=Запрос.Выполнить().Выгрузить();
	 
     Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
                         |	ЗанятостьНомеров.Клиент
                         |ИЗ
                         |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
                         |ГДЕ
                         |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
                         |	И (ЗанятостьНомеров.Клиент.Страна.Наименование = &СтранаН
                         |	ИЛИ ЗанятостьНомеров.Клиент.Страна = &Страна)
						  |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус");
	 Запрос.УстановитьПараметр("СтранаН","Россия");
	 Запрос.УстановитьПараметр("Страна",Справочники.Страны.ПустаяСсылка());
     Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 
	 ТЗРос=Запрос.Выполнить().Выгрузить();

	 
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                     |	ЗанятостьНомеров.Клиент
	                     |ИЗ
	                     |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                     |ГДЕ
	                     |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                     |	И ЗанятостьНомеров.Клиент.ИностранныйГражданин = ИСТИНА
						 |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус");
	 
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);
	 ТЗИно=Запрос.Выполнить().Выгрузить();
	 
     СписокСНГ=Новый СписокЗначений;
	 СписокСНГ.Добавить(Справочники.Страны.НайтиПоНаименованию("Украина"));
	 СписокСНГ.Добавить(Справочники.Страны.НайтиПоНаименованию("Казахстан"));
	 СписокСНГ.Добавить(Справочники.Страны.НайтиПоНаименованию("Белорусь"));
	 СписокСНГ.Добавить(Справочники.Страны.НайтиПоНаименованию("Армения"));
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                     |	ЗанятостьНомеров.Клиент
	                     |ИЗ
	                     |	РегистрСведений.ЗанятостьНомеров КАК ЗанятостьНомеров
	                     |ГДЕ
	                     |	ЗанятостьНомеров.ПериодРезерва МЕЖДУ &ДН И &ДК
	                     |	И ЗанятостьНомеров.Клиент.Страна В(&Страна)
	                     |	И ЗанятостьНомеров.Клиент.Страна <> &СтранаП
						  |	И ЗанятостьНомеров.Регистратор.Статус <> &Статус");
	 Запрос.УстановитьПараметр("Страна",СписокСНГ);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 Запрос.УстановитьПараметр("СтранаП",Справочники.Страны.ПустаяСсылка());
	 Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Бронь);
	 ТЗСНГ=Запрос.Выполнить().Выгрузить();

	 
	 Рез=Новый Структура("НомерДень,НомерДень2,ЧеловекДень,НомерЧас,НомерДеньВых,ЧеловекДеньВых,НомерДеньБезВых,ЧеловекДеньБезВых,Романтик,Свадьба,Гости,Скидка10,Скидка15,Скидка20,Проживаний,Длительность,Россия,Иностранцы,СНГ");
	 Рез.НомерДень=ТЗ.Количество();
	 Рез.ЧеловекДень=ТЗ.Итог("КолВоЧеловек");
	  Рез.НомерДень2=ТЗ2.Итог("РегистраторКолВо");
	 
	 Рез.НомерЧас=ТЗДень.Количество();

	 
	 Рез.НомерДеньВых=ТЗВых.Количество();
	 Рез.ЧеловекДеньВых=ТЗВых.Итог("КолВоЧеловек");
	 
	 Рез.НомерДеньБезВых=ТЗБезВых.Количество();
	 Рез.ЧеловекДеньБезВых=ТЗБезВых.Итог("КолВоЧеловек");
	 
	 Рез.Романтик=ТЗРомантик.Количество();
	 Рез.Свадьба=0;
	 Рез.Гости=ТЗГости.Итог("КолВоЧеловек");
	 Рез.Скидка10=Скидка10;
	 Рез.Скидка15=Скидка15;
	 Рез.Скидка20=Скидка20;
     Рез.Проживаний=ТЗГости.Количество();
     Рез.Длительность=ТЗДлит.Итог("ПериодРезерва");
     Рез.Россия=ТЗРос.Количество();
	 Рез.Иностранцы=ТЗИно.Количество();
	 Рез.СНГ=ТЗСНГ.Количество();
	 Возврат Рез;
	 
КонецФункции

&НаСервере
Функция ПолучитьФинансы()
	ОперацияЗавтрак=Справочники.ВидыОпераций.НайтиПоКоду("000000003");
	ОперацияПрачечная=Справочники.ВидыОпераций.НайтиПоКоду("000000005");
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	СУММА(Деньги.Сумма) КАК Сумма
	                    |ИЗ
	                    |	РегистрНакопления.Деньги КАК Деньги
	                    |ГДЕ
	                    |	Деньги.ВидДвижения = &ВидДвижения
	                    |	И Деньги.ВидОперации = &ВидОперации
	                    |	И Деньги.Период МЕЖДУ &ДН И &ДК");
	 Запрос.УстановитьПараметр("ВидОперации",ОперацияЗавтрак);
	 Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 
	 ТЗЗавтрак=Запрос.Выполнить().Выгрузить();
	 
	 Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	СУММА(Деньги.Сумма) КАК Сумма
	                    |ИЗ
	                    |	РегистрНакопления.Деньги КАК Деньги
	                    |ГДЕ
	                    |	Деньги.ВидДвижения = &ВидДвижения
	                    |	И Деньги.ВидОперации = &ВидОперации
	                    |	И Деньги.Период МЕЖДУ &ДН И &ДК");
	 Запрос.УстановитьПараметр("ВидОперации",ОперацияПрачечная);
	 Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
	 Запрос.УстановитьПараметр("ДН",НачалоДня(Отчет.ДН));
	 Запрос.УстановитьПараметр("ДК",КонецДня(Отчет.ДК));
	 
	 ТЗПрачечная=Запрос.Выполнить().Выгрузить();
	 
	 
	 
	 Рез=Новый Структура("Завтрак,Прачечная");
	 Рез.Завтрак=ТЗЗавтрак.Итог("Сумма");
	 Рез.Прачечная=ТЗПрачечная.Итог("Сумма");
     Возврат Рез;
	
КонецФункции

