
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаДатчики Из Датчики Цикл
		// регистр ПоказанияДатчиков 
		Движение = Движения.ПоказанияДатчиков.Добавить();
		Движение.НомерКадра = НомерКадра;
		Движение.Время = Время;
		Движение.Датчик = ТекСтрокаДатчики.Датчик;
		Движение.Показатель = ТекСтрокаДатчики.Показатель;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
