
//
Функция ВыполнитьВыгрузкуУзла(Узел) Экспорт
Если НЕ ЗначениеЗаполнено(Узел) Тогда Возврат Неопределено; КонецЕсли;
	
УзелОбмена = Узел.ПолучитьОбъект();

Результат = УзелОбмена.ЗаписатьСообщениеСИзменениями();

Возврат Результат;
КонецФункции

Функция ВыполнитьЗагрузкуУзла(Узел) Экспорт
Если НЕ ЗначениеЗаполнено(Узел) Тогда Возврат Неопределено; КонецЕсли;

УзелОбмена = Узел.ПолучитьОбъект();

//УзелОбмена.ПрочитатьСообщениеПодтверждения();
Результат = УзелОбмена.ПрочитатьСообщениеСИзменениями(); 

Возврат Результат;
КонецФункции

Функция ВыполнитьОбменДанными() Экспорт  
Массив = Новый Массив;
	
Выборка = ПланыОбмена.ОбменГостиницы.Выбрать();

Пока Выборка.Следующий() Цикл
	Если Выборка.ЭтотУзел Тогда Продолжить; КонецЕсли;	
	
	Результат = Новый Структура("РезультатЧтения, РезультатЗаписи", Неопределено, Неопределено);
	
	УзелОбмена = Выборка.ПолучитьОбъект();

	РезультатЧтения = УзелОбмена.ПрочитатьСообщениеСИзменениями();
	Результат.РезультатЧтения = РезультатЧтения;
	
	Если РезультатЧтения.Ошибка Тогда 
		Если НЕ (РезультатЧтения.КодОшибки = 1 ИЛИ РезультатЧтения.КодОшибки = 30) Тогда 
			Массив.Добавить(Результат);
			
			Продолжить; 
		КонецЕсли;
	КонецЕсли;
	                                        
	РезультатЗаписи = УзелОбмена.ЗаписатьСообщениеСИзменениями();	
	Результат.РезультатЗаписи = РезультатЗаписи;
	
	Массив.Добавить(Результат);
КонецЦикла;

Возврат Массив;
КонецФункции

//

////
Функция ЗаписатьСообщениеСИзменениями(УзелИсточник, УзелПриемник) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	
	
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Выгрузка в узел " + Строка(УзелПриемник) + " ------------";
Сообщение.Сообщить();

// + ПСН 
// Получить имя файла обмена.
//ИмяФайла = ОбменГостиницы.ПолучитьИмяФайлаОбмена(ПланыОбмена.Выписка.ЭтотУзел(), Ссылка);
ИмяФайла = ПолучитьИмяВременногоФайла("xml"); 
// - ПСН 

// Создать объект записи XML.
// *** ЗаписьXML-документов.
ЗаписьXML = Новый ЗаписьXML;
ЗаписьXML.ОткрытьФайл(ИмяФайла);
ЗаписьXML.ЗаписатьОбъявлениеXML();

// *** Инфраструктура сообщений.
ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелПриемник.Ссылка);

// Записать соответствие пространств имен для сокращения размера файла сообщения
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = " Номер сообщения: " + ЗаписьСообщения.НомерСообщения;
Сообщение.Сообщить();

ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
Пока ВыборкаИзменений.Следующий() Цикл
	Данные = ВыборкаИзменений.Получить();
	
	//Если НЕ (ТипЗнч(Данные) = Тип("УдалениеОбъекта")) Тогда  
	//	Если ВГ_ОбменВыписка.ПроверитьДанные(Данные, ДанныеУзлаОбмена) Тогда Продолжить; КонецЕсли;
	//КонецЕсли;		
	
	// Проверить, нужен ли перенос данных. Если нет, то записать удаление этих данных.
	//Если Не ВГ_ОбменВыписка.НуженПереносДанных(ЗаписьСообщения.Получатель, Данные) Тогда
	//	ВГ_ОбменВыписка.УдалениеДанных(Данные);
	//КонецЕсли;  
	
	// Записать данные в сообщение *** XML-сериализация.
	ОбменГостиницы.ЗаписатьДанныеXML(ЗаписьXML, Данные);	 
КонецЦикла;

ЗаписьСообщения.ЗакончитьЗапись();
ЗаписьXML.Закрыть();

// Получить имя файла обмена.
ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(УзелПриемник.Ссылка.Код);

ИмяФайлаФТП = ФТПСервер.ПолучитьИмяФайлаОбменаФТП(УзелИсточник, УзелПриемник, ДанныеУзлаОбмена.КаталогОбменаFTP);

Ответ = ФТПСервер.ЗаписатьФТПФайл(ИмяФайла, ИмяФайлаФТП
	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
//Результат = ОбщийМодульФТП.ЗаписатьФТПФайл_TECT(ИмяФайла, "C:\_Base1C\Обмен.xml"); 

Если Ответ.Ошибка Тогда 
	Сообщить("Ошибка записи файла обмена по FTP. " + Ответ.ОписаниеОшибки + 
	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
	
	Результат = Ответ;	
КонецЕсли;

 ~ВЫХОД:
УдалитьФайлы(ИмяФайла);
// - ПСН 

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец выгрузки ------------";
Сообщение.Сообщить();

Возврат Результат;
КонецФункции

Функция ПрочитатьСообщениеСИзменениями(УзелИсточник, УзелПриемник) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки, Удалено, Добавлено, Заменено", Ложь, 0, "", 0, 0, 0);	

ИмяФайла = ПолучитьИмяВременногоФайла("xml");

ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(УзелИсточник.Ссылка.Код);

ИмяФайлаФТП = ФТПСервер.ПолучитьИмяФайлаОбменаФТП(УзелИсточник, УзелПриемник, ДанныеУзлаОбмена.КаталогОбменаFTP);

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Загрузка из " + Строка(УзелИсточник) + " ------------";
Сообщение.Сообщить();
Сообщение.Текст = " – Считывается файл " + ИмяФайлаФТП;
Сообщение.Сообщить();

Ответ = ФТПСервер.ПолучитьФТПФайл(ИмяФайлаФТП, ИмяФайла, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
//Результат = ОбщийМодульФТП.ПолучитьФТПФайл_TECT("C:\_Base1C\Обмен 1.xml", ИмяФайла); 

//Если Результат.КодОшибки < 0 Тогда 
//	Сообщить("Ошибка записи файла обмена по FTP: " + Результат.ОписаниеОшибки + 
//	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
//ИначеЕсли Результат.КодОшибки > 0 Тогда 
//	Возврат Неопределено;
//КонецЕсли;

Если Ответ.Ошибка Тогда
	Если Ответ.КодОшибки = 1 Тогда 
		 Сообщить(Ответ.ОписаниеОшибки); // Отсутсвует файд обмена
	Иначе	
		Сообщить("Ошибка записи файла обмена по FTP: " + Ответ.ОписаниеОшибки + 
		". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
	КонецЕсли;
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки  = Ответ.КодОшибки;
	Результат.ОписаниеОшибки  = Ответ.ОписаниеОшибки;
	
	Возврат Результат;	
КонецЕсли;

Файл = Новый Файл(ИмяФайла);

Если Не Файл.Существует() Тогда Возврат Неопределено; КонецЕсли;

// Попытаться открыть файл.
// *** Чтение документов XML.
ЧтениеXML = Новый ЧтениеXML;
Попытка
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
Исключение
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Невозможно открыть файл обмена данными.";
	Сообщение.Сообщить();
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -10;
	Результат.ОписаниеОшибки = "Невозможно открыть файл обмена данными. " + ОписаниеОшибки();

	Возврат Результат;
КонецПопытки;

// Загрузить данные из найденного файла.
// *** Инфраструктура сообщений.
ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();

// Прочитать заголовок сообщения обмена данными – файла XML.
Попытка
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
Исключение
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Номер сообщения меньше или равен номеру ранее принятого сообщения";
	Сообщение.Сообщить();
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -20;
	Результат.ОписаниеОшибки = "Номер сообщения меньше или равен номеру ранее принятого сообщения. " + ОписаниеОшибки();

	Возврат Результат
КонецПопытки;

// Проверить, что сообщение предназначено для этого узла.
Если ЧтениеСообщения.Отправитель <> УзелИсточник.Ссылка Тогда
	//ВызватьИсключение "Неверный узел";
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -20;
	Результат.ОписаниеОшибки = "Неверный узел.";
	
	Возврат Результат;
КонецЕсли;

// Удалить регистрацию изменений для узла-отправителя сообщения.
// *** Служба регистрации изменений.
ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);

// Прочитать данные из сообщения в цикле. *** XML-сериализация.
ПолучательПлатежаПриемник = ПолучательПлатежаПриемник(УзелПриемник.Код);

УдаленоКоличество = 0;
ЗамененоКоличество = 0;
ДобавленоКоличество = 0;
Пока ОбменГостиницы.ВозможностьЧтенияДанныхXML(ЧтениеXML) Цикл
	// Прочитать очередное значение.
	Данные = ОбменГостиницы.ПрочитатьДанныеXML(ЧтениеXML);

	//// Проверить, нужно ли принимать сообщение от узла-отправителя. Если нет, отклонить изменения.
	//Если Не ОбменВыписка.ПринятьИзменения(ЧтениеСообщения.Отправитель, Данные) Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = Строка(Данные.Метаданные()) + ": " + Строка(Данные) + " – Изменения отклонены";

	//	Сообщение.Сообщить();
	//	Продолжить;
	//КонецЕсли;

	// Записать полученные данные.
	Ответ = ОбменГостиницы.ЗаписатьПолученныеДанные(Данные, ПолучательПлатежаПриемник);	 
	
	Если Ответ = -1 Тогда
		УдаленоКоличество = УдаленоКоличество + 1; 		
	ИначеЕсли Ответ = 0 Тогда
		ДобавленоКоличество = ДобавленоКоличество + 1; 		
	ИначеЕсли Ответ = 1 Тогда
		ЗамененоКоличество = ЗамененоКоличество + 1; 		
	КонецЕсли;	
	// - ПСН
КонецЦикла;

ЧтениеСообщения.ЗакончитьЧтение();
ЧтениеXML.Закрыть();

УдалитьФайлы(ИмяФайла);

Ответ = ФТПСервер.УдалитьФТПФайл(ИмяФайлаФТП, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль);
Если Ответ.Ошибка Тогда
	Сообщить("Ошибка удаления файла FTP. " + Ответ.ОписаниеОшибки);
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = Ответ.КодОшибки;  // Код 30
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
КонецЕсли;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец загрузки ------------";
Сообщение.Сообщить();

//Результат = Новый Структура("Удалено, Добавлено, Заменено"
//	, УдаленоКоличество, ДобавленоКоличество, ЗамененоКоличество);

Результат.Удалено = УдаленоКоличество; 
Результат.Добавлено = ДобавленоКоличество; 
Результат.Заменено = ЗамененоКоличество; 

Возврат Результат;
КонецФункции

Функция ПолучательПлатежаПриемник(УзелПриемникКод)
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГостиницыНастройкиОбмена.ПолучательПлатежа КАК ПолучательПлатежа
                      |ИЗ
                      |	РегистрСведений.ГостиницыНастройкиОбмена КАК ГостиницыНастройкиОбмена
                      |ГДЕ
                      |	ГостиницыНастройкиОбмена.КодУзлаОбмена = &КодУзлаОбмена");

Запрос.УстановитьПараметр("КодУзлаОбмена", УзелПриемникКод);
Выборка = Запрос.Выполнить().Выбрать();

Выборка.Следующий();
Возврат Выборка.ПолучательПлатежа;
КонецФункции
////
 

//// + Запись XML
Процедура ЗаписатьДанныеXML(ЗаписьXML, Данные) Экспорт
//Удаление = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Истина, Ложь);

//// Получить объект описания метаданного, соответствующий данным.
//ОбъектМетаданных = ?(Удаление, Данные.Ссылка.Метаданные(), Данные.Метаданные());

//Если Не Удаление И ОбъектМетаданных = Метаданные.Справочники.Номенклатура Тогда
//	// Записать элемент справочника вручную.
//	ЗаписатьXMLНоменклатура(ЗаписьXML, Данные);
//Иначе
	// Записать данные с помощью стандартного метода.
	ЗаписатьXML(ЗаписьXML, Данные);
//КонецЕсли
КонецПроцедуры
//// - Запись XML

//// + Чтение XML
Функция ВозможностьЧтенияДанныхXML(ЧтениеXML) Экспорт
// Получить тип данных XML, который может быть считан в данный момент.
ТипXML = ПолучитьXMLТип(ЧтениеXML);

Если ТипXML = Неопределено Тогда
	Возврат Ложь;
КонецЕсли;

Возврат ВозможностьЧтенияXML(ЧтениеXML);
КонецФункции

Функция ПрочитатьДанныеXML(ЧтениеXML) Экспорт
ТипXML = ПолучитьXMLТип(ЧтениеXML);

Если ТипXML = Неопределено Тогда
	Возврат Неопределено;
КонецЕсли;

// Прочитать значение из объекта ЧтениеXML стандартным образом.
Возврат ПрочитатьXML(ЧтениеXML);
КонецФункции

//
Функция ЗаписатьПолученныеДанные(Данные, ПолучательПлатежаПриемник) Экспорт
БезналЗагрузка = Данные;

БезналЗагрузка.ОбменДанными.Загрузка = Истина;

Если БезналЗагрузка.Количество() > 0 Тогда
	БезналЗагрузкаДанные = БезналЗагрузка[0];
	Если БезналЗагрузкаДанные.ПолучательПлатежа = ПолучательПлатежаПриемник 
	ИЛИ БезналЗагрузкаДанные.ПолучательПлатежа = "СМЕШАННЫЙ" 	
	Тогда 
		БезналЗагрузкаДанные.ДатаИзменения = ТекущаяДата();
	
		БезналЗагрузкаДанные.ДатаЗагрузки = ТекущаяДата();
		//БезналЗагрузкаДанные.ИсточникПлатежа = ИсточникПлатежа;

		БезналЗагрузка.Записать(Истина);
		
		Возврат 1;
	Иначе
		
		БезналЗагрузка.Удалить(БезналЗагрузкаДанные);
		БезналЗагрузка.Записать(Истина);
		Возврат -1;
		
	Конецесли;
Иначе
	БезналЗагрузкаРегистр = РегистрыСведений.БезналЗагрузка.СоздатьНаборЗаписей();
	БезналЗагрузкаРегистр.Отбор.ГУИД.Установить(БезналЗагрузка.Отбор.ГУИД.Значение);
	БезналЗагрузкаРегистр.Прочитать();
	
	Для Каждого Строка Из БезналЗагрузкаРегистр Цикл
		БезналЗагрузкаРегистр.Удалить(Строка);
	КонецЦикла;
	
	БезналЗагрузкаРегистр.Записать(Истина);
	Возврат -1;
КонецЕсли;

КонецФункции

//
//// + Чтение XML

// + ====== Шаблоны ======
Функция НуженПереносДанных(Получатель, Данные) Экспорт
Перенос = Истина;

//Склад = Получатель.Склад;

//Если ТипЗнч(Данные) = Тип("ДокументОбъект.ПриходнаяНакладная")
//ИЛИ  ТипЗнч(Данные) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда

//	// Проверить, совпадает ли склад документов со складом узла обмена.
//	Если Не Склад.Пустая() И Данные.Склад <> Склад Тогда
//		Перенос = Ложь;
//	КонецЕсли;    

//КонецЕсли;

Возврат Перенос;
КонецФункции

Функция НуженПереносДанных_1(Получатель, Данные) Экспорт
Перенос = Истина;
Склад = Получатель.Склад;

Если ТипЗнч(Данные) = Тип("ДокументОбъект.ПриходнаяНакладная")
ИЛИ  ТипЗнч(Данные) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда

	// Проверить, совпадает ли склад документов со складом узла обмена.
	Если Не Склад.Пустая() И Данные.Склад <> Склад Тогда
		Перенос = Ложь;
	КонецЕсли;    

//ИначеЕсли ТипЗнч(Данные) = Тип("РегистрНакопленияНаборЗаписей.УчетНоменклатуры") Тогда
//	// Проверить, что у всех записей набора склад один и тот же.
//	СкладНабора = Неопределено;
//	Для Каждого Запись Из Данные Цикл
//		Если СкладНабора <> Неопределено И Запись.Склад <> СкладНабора Тогда
//			ВызватьИсключение "Склад должен быть одинаковый для всех записей";
//		КонецЕсли;
//		СкладНабора = Запись.Склад;
//	КонецЦикла;
//	
//	// Проверить, совпадает ли склад набора записей со складом узла обмена.
//	Если Не Склад.Пустая() И СкладНабора <> Склад Тогда
//		Перенос = Ложь;
//	КонецЕсли;    
КонецЕсли;

Возврат Перенос;
КонецФункции

Процедура УдалениеДанных(Данные) Экспорт
// Получить объект описания метаданного, соответствующий данным.
ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());

Если 
//	Метаданные.Справочники.Содержит(ОбъектМетаданных)
//ИЛИ 
Метаданные.Документы.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) 
Тогда
	// Записать удаление объекта для объектных данных.
	Данные = Новый УдалениеОбъекта(Данные.Ссылка);
КонецЕсли;    
КонецПроцедуры

Процедура УдалениеДанных_1(Данные) Экспорт
// Получить объект описания метаданного, соответствующий данным.
ОбъектМетаданных = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Данные.Ссылка.Метаданные(), Данные.Метаданные());

Если Метаданные.Справочники.Содержит(ОбъектМетаданных)
ИЛИ Метаданные.Документы.Содержит(ОбъектМетаданных)
ИЛИ Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных)
ИЛИ Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных)
ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
	// Записать удаление объекта для объектных данных.
	Данные = Новый УдалениеОбъекта(Данные.Ссылка);
	
//ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных)
//ИЛИ Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных.Родитель)
//ИЛИ Метаданные.Последовательности.Содержит(ОбъектМетаданных) Тогда
//	// Очистить данные.
//	Данные.Очистить();
КонецЕсли;    
КонецПроцедуры

Процедура ЗаписатьДанные(ЗаписьXML, Данные) Экспорт
//Удаление = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Истина, Ложь);

//// Получить объект описания метаданного, соответствующий данным.
//ОбъектМетаданных = ?(Удаление, Данные.Ссылка.Метаданные(), Данные.Метаданные());

//Если Не Удаление И ОбъектМетаданных = Метаданные.Справочники.Номенклатура Тогда
//	// Записать элемент справочника вручную.
//	ЗаписатьXMLНоменклатура(ЗаписьXML, Данные);
//Иначе
	// Записать данные с помощью стандартного метода.
	ЗаписатьXML(ЗаписьXML, Данные);
//КонецЕсли
КонецПроцедуры

Процедура ЗаписатьДанные_1(ЗаписьXML, Данные) Экспорт
Удаление = ?(ТипЗнч(Данные) = Тип("УдалениеОбъекта"), Истина, Ложь);

// Получить объект описания метаданного, соответствующий данным.
ОбъектМетаданных = ?(Удаление, Данные.Ссылка.Метаданные(), Данные.Метаданные());

Если Не Удаление И ОбъектМетаданных = Метаданные.Справочники.Номенклатура Тогда
	// Записать элемент справочника вручную.
	ЗаписатьXMLНоменклатура(ЗаписьXML, Данные);
Иначе
	// Записать данные с помощью стандартного метода.
	ЗаписатьXML(ЗаписьXML, Данные);
КонецЕсли
КонецПроцедуры

Процедура ЗаписатьXMLНоменклатура(ЗаписьXML, Товар) Экспорт
// Записать начало элемента XML.
ЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Номенклатура.Вручную");

// Ссылка
ЗаписатьXML(ЗаписьXML, Товар.Ссылка, "Ref", НазначениеТипаXML.Явное);

// ЭтоГруппа
ЗаписатьXML(ЗаписьXML, Товар.ЭтоГруппа, "IsFolder", НазначениеТипаXML.Явное);

// Родитель
ЗаписатьXML(ЗаписьXML, Товар.Родитель, "Parent", НазначениеТипаXML.Явное);

// Наименование
ЗаписатьXML(ЗаписьXML, Товар.Наименование, "Description", НазначениеТипаXML.Явное);

// Код
ЗаписатьXML(ЗаписьXML, Товар.Код, "Code", НазначениеТипаXML.Явное);

// Записать реквизиты, выгружаемые только для элемента справочника.
Если Не Товар.ЭтоГруппа Тогда
	// ЗакупочнаяЦена
	ЗаписатьXML(ЗаписьXML, Товар.ЗакупочнаяЦена, "ЗакупочнаяЦена", НазначениеТипаXML.Явное);

	//// ФайлКартинки
	//ЗаписатьXML(ЗаписьXML, Товар.ФайлКартинки, "ФайлКартинки", НазначениеТипаXML.Явное);

	//// Картинка
	//ЗаписатьXML(ЗаписьXML, Товар.Картинка, "Картинка", НазначениеТипаXML.Явное);
КонецЕсли;    

// Записать конец элемента.
ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Функция ПрочитатьXMLНоменклатура(ЧтениеXML) Экспорт
Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
	ВызватьИсключение "Ошибка чтения XML";
КонецЕсли;

// Прочитать следующий узел XML-документа.
ЧтениеXML.Прочитать();

// Прочитать ссылку на элемент справочника Номенклатура.
ТоварСсылка = ПрочитатьXML(ЧтениеXML);
Если ТипЗнч(ТоварСсылка) <> Тип("СправочникСсылка.Номенклатура") Тогда
	ВызватьИсключение "Ошибка чтения XML";
КонецЕсли;

// Создать объект по полученной ссылке.
Товар = ТоварСсылка.ПолучитьОбъект();

// Прочитать признак группы.
ЭтоГруппа = ПрочитатьXML(ЧтениеXML);
Если Товар <> Неопределено Тогда
	Если Товар.ЭтоГруппа <> ЭтоГруппа Тогда
		ВызватьИсключение "Некорректные данные";
	КонецЕсли;
Иначе

// Создать элемент справочника Номенклатура.
	Если ЭтоГруппа = Истина Тогда
		Товар = Справочники.Номенклатура.СоздатьГруппу();
	Иначе
		Товар = Справочники.Номенклатура.СоздатьЭлемент();
	КонецЕсли;

	// Устанавить значение ссылки для нового объекта.
	Товар.УстановитьСсылкуНового(ТоварСсылка);

КонецЕсли;

// Родитель
Товар.Родитель = ПрочитатьXML(ЧтениеXML);

// Наименование
Товар.Наименование = ПрочитатьXML(ЧтениеXML);

// Код
Товар.Код = ПрочитатьXML(ЧтениеXML);

// Прочитать реквизиты, загружаемые только для элемента справочника.
Если Не Товар.ЭтоГруппа Тогда

// ЗакупочнаяЦена
	Товар.ЗакупочнаяЦена = ПрочитатьXML(ЧтениеXML);

	//// ФайлКартинки
	//Товар.ФайлКартинки = ПрочитатьXML(ЧтениеXML);

	//// Картинка
	//Товар.Картинка = ПрочитатьXML(ЧтениеXML);
КонецЕсли;    
 

// Проверить, что текущим узлом является КонецЭлемента.
Если ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Тогда
	ВызватьИсключение "Ошибка чтения XML";
КонецЕсли;

// Прочитать следующий узел для завершение чтения элемента XML-документа.
ЧтениеXML.Прочитать();

Возврат Товар;
КонецФункции  

Функция ПринятьИзменения(Отправитель, Данные) Экспорт
Прием = Истина;

// Проверить зарегистрировано ли изменение данных для отправителя.
Если ПланыОбмена.ИзменениеЗарегистрировано(Отправитель, Данные) Тогда
	
	// Разрешить получение данных только от главного узла.
	Если Не Отправитель.Главный Тогда
		Прием = Ложь;
	КонецЕсли;
КонецЕсли;

Возврат Прием;
КонецФункции

Функция ПрочитатьДанные(ЧтениеXML) Экспорт
ТипXML = ПолучитьXMLТип(ЧтениеXML);

Если ТипXML = Неопределено Тогда
	Возврат Неопределено;
КонецЕсли;

//Если ТипXML.ИмяТипа = "DocumentObject.ОбменЧехов.Вручную" И ТипXML.URIПространстваИмен = "" Тогда
//	Возврат ПрочитатьXMLОбменЧехов(ЧтениеXML);
//КонецЕсли;

// Прочитать значение из объекта ЧтениеXML стандартным образом.
Возврат ПрочитатьXML(ЧтениеXML);
КонецФункции

Функция ВозможностьЧтенияДанных(ЧтениеXML) Экспорт
// Получить тип данных XML, который может быть считан в данный момент.
ТипXML = ПолучитьXMLТип(ЧтениеXML);

Если ТипXML = Неопределено Тогда
	Возврат Ложь;
КонецЕсли;

//Если ТипXML.ИмяТипа = "DocumentObject.ОбменЧехов.Вручную" И ТипXML.URIПространстваИмен = "" Тогда
//	Возврат Истина;
//КонецЕсли;

Возврат ВозможностьЧтенияXML(ЧтениеXML);
КонецФункции
// - ====== Шаблоны ======
