
Функция ПараметрыGREEN() Экспорт
idInstance = Константы.GREENIdInstanceTelegram.Получить(); // "3100530778";	
ApiToken = Константы.GREENApiToken_Telegram.Получить(); // "84a9441987a9415fb7f03365ffdea87b67027916c3e54405bb";

Если НЕ ЗначениеЗаполнено(idInstance) ИЛИ НЕ ЗначениеЗаполнено(ApiToken) Тогда 
	ВызватьИсключение("Параметры GREEN_Telegram неопределены");
КонецЕсли;

Возврат Новый Структура("idInstance, ApiToken", idInstance, ApiToken) ;
КонецФункции

// + Green
Функция ПроверитьНаличиеGreenTelegram(Знач Телефон) Экспорт 
Результат = Новый Структура("chatid, Ошибка, КодОшибки, ОписаниеОшибки", "", Ложь, 0, "");
	
Попытка  
	ПараметрыGREEN = ПараметрыGREEN();
	idInstance = ПараметрыGREEN.idInstance; // "3100530778";	
	ApiToken = ПараметрыGREEN.ApiToken; // "84a9441987a9415fb7f03365ffdea87b67027916c3e54405bb";

	Настройки = Новый Структура;
	Настройки.Вставить("IdInstance", IdInstance);
	Настройки.Вставить("ApiToken", ApiToken);    
Исключение
	Результат.Ошибка = Истина;
	Результат.ОписаниеОшибки = ОписаниеОшибки();
	
	Возврат Результат;
КонецПопытки;

Попытка  
	ОбработкаОбъект = Обработки.GREEN_Telegram.Создать();
	ОбработкаОбъект.УстановитьНастройки(Настройки);
	Ответ = ОбработкаОбъект.ПроверитьНаличиеТелеграм(Телефон);
	
	Если НЕ Ответ.exist Тогда
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = "На телефоне не установлен Телеграм"; 
		
		Возврат Результат; 
	КонецЕсли;
	
	Результат.chatid = Ответ.chatid;
Исключение
	Результат.Ошибка = Истина;
	Результат.ОписаниеОшибки = ОписаниеОшибки();
КонецПопытки;

Возврат Результат;
КонецФункции

Функция ОтправитьТекстGreenTelegram(Знач Телефон, Текст) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");
	
Попытка  
	ПараметрыGREEN = ПараметрыGREEN();
	idInstance = ПараметрыGREEN.idInstance; // "3100530778";	
	ApiToken = ПараметрыGREEN.ApiToken; // "84a9441987a9415fb7f03365ffdea87b67027916c3e54405bb";

	Настройки = Новый Структура;
	Настройки.Вставить("IdInstance", IdInstance);
	Настройки.Вставить("ApiToken", ApiToken);    
Исключение
	Результат.Ошибка = Истина;
	Результат.Описание = ОписаниеОшибки();

	Возврат Результат;
КонецПопытки;

Попытка  
	ОбработкаОбъект = Обработки.GREEN_Telegram.Создать();
	ОбработкаОбъект.УстановитьНастройки(Настройки);
	Ответ = ОбработкаОбъект.ПроверитьНаличиеТелеграм(Телефон);
	
	Если НЕ Ответ.exist Тогда
		Результат.Ошибка = Истина;
		Результат.Описание = "На телефоне не установлен Телеграм"; 
		
		Возврат Результат; 
	КонецЕсли;
	
Исключение
	Результат.Ошибка = Истина;
	Результат.Описание = ОписаниеОшибки();
КонецПопытки; 

Если Результат.Ошибка Тогда Возврат Результат; КонецЕсли;	

chatid = Ответ.chatid;

Попытка   
	//ОбработкаОбъект = Обработки.GREEN_Telegram.Создать();
	//ОбработкаОбъект.УстановитьНастройки(Настройки);
	Ответ = ОбработкаОбъект.ОтправитьТекст(chatid, Текст);
	
	щ =1 ;
Исключение
	Результат.Ошибка = Истина;
	Результат.Описание = ОписаниеОшибки();
КонецПопытки;

Возврат Результат;
КонецФункции

Функция ОтправитьФайлИТекстGreenTelegram(Знач Телефон, Картинка, Текст) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");
	
Телефон_П = GREEN_WhatsApp.ТелефонGREEN(Телефон);
Если Телефон_П = 0 Тогда
	Результат.Ошибка = Истина;
	Результат.ОписаниеОшибки = "Некорректный номер телефона для GREEN";

	Возврат Результат;	
КонецЕсли;

Попытка  
	ПараметрыGREEN = ПараметрыGREEN();
	idInstance = ПараметрыGREEN.idInstance; // "3100530778";	
	ApiToken = ПараметрыGREEN.ApiToken; // "84a9441987a9415fb7f03365ffdea87b67027916c3e54405bb";

	Настройки = Новый Структура;
	Настройки.Вставить("IdInstance", IdInstance);
	Настройки.Вставить("ApiToken", ApiToken);    
Исключение
	Результат.Ошибка = Истина;
	Результат.ОписаниеОшибки = ОписаниеОшибки();

	Возврат Результат;
КонецПопытки;

Попытка  
	ОбработкаОбъект = Обработки.GREEN_Telegram.Создать();
	ОбработкаОбъект.УстановитьНастройки(Настройки);
	Ответ = ОбработкаОбъект.ПроверитьНаличиеТелеграм(Телефон_П);
	
	Если НЕ Ответ.exist Тогда
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = "На телефоне не установлен Телеграм"; 
		
		Возврат Результат; 
	КонецЕсли;
	
Исключение
	Результат.Ошибка = Истина;
	Результат.ОписаниеОшибки = ОписаниеОшибки();
КонецПопытки; 

Если Результат.Ошибка Тогда Возврат Результат; КонецЕсли;	

chatid = Ответ.chatid;

Попытка 
	//ОбработкаОбъект = Обработки.GREEN_Telegram.Создать();
	//ОбработкаОбъект.УстановитьНастройки(Настройки);
	Ответ = ОбработкаОбъект.ОтправитьВидеоАудиоИзображениеДокумент(chatid, Картинка, Текст);
	
	щ =1 ;
Исключение
	Результат.Ошибка = Истина;
	Результат.ОписаниеОшибки = ОписаниеОшибки();
КонецПопытки;

Возврат Результат;	
	
КонецФункции
// - Green
