
Функция ЗаписатьСообщениеСИзменениями() Экспорт
ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(Ссылка.Код);
	
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Выгрузка в узел " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();

// + ПСН 
// Получить имя файла обмена.
//ИмяФайла = ОбменГостиницы.ПолучитьИмяФайлаОбмена(ПланыОбмена.Выписка.ЭтотУзел(), Ссылка);
ИмяФайла = ПолучитьИмяВременногоФайла("xml"); 
// - ПСН 

// Создать объект записи XML.
// *** ЗаписьXML-документов.
ЗаписьXML = Новый ЗаписьXML;
ЗаписьXML.ОткрытьФайл(ИмяФайла);
ЗаписьXML.ЗаписатьОбъявлениеXML();

// *** Инфраструктура сообщений.
ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);

// Записать соответствие пространств имен для сокращения размера файла сообщения
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = " Номер сообщения: " + ЗаписьСообщения.НомерСообщения;
Сообщение.Сообщить();

ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
Пока ВыборкаИзменений.Следующий() Цикл
	Данные = ВыборкаИзменений.Получить();
	
	//Если НЕ (ТипЗнч(Данные) = Тип("УдалениеОбъекта")) Тогда  
	//	Если ВГ_ОбменВыписка.ПроверитьДанные(Данные, ДанныеУзлаОбмена) Тогда Продолжить; КонецЕсли;
	//КонецЕсли;		
	
	// Проверить, нужен ли перенос данных. Если нет, то записать удаление этих данных.
	//Если Не ВГ_ОбменВыписка.НуженПереносДанных(ЗаписьСообщения.Получатель, Данные) Тогда
	//	ВГ_ОбменВыписка.УдалениеДанных(Данные);
	//КонецЕсли;  
	
	// Записать данные в сообщение *** XML-сериализация.
	//ОбменГостиницы.ЗаписатьДанные(ЗаписьXML, Данные);	 
	
	ЗаписатьXML(ЗаписьXML, Данные);
КонецЦикла;

ЗаписьСообщения.ЗакончитьЗапись();
ЗаписьXML.Закрыть();

// Получить имя файла обмена.
//ИмяФайлаФТП = ОбменГостиницы.ПолучитьИмяФайлаОбменаФТП(ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), Ссылка, ДанныеУзлаОбмена.КаталогОбменаFTP);

//Результат = ОбщийМодульФТП.ЗаписатьФТПФайл(ИмяФайла, ИмяФайлаФТП
//	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
Результат = ФТПСервер.ЗаписатьФТПФайл_TECT(ИмяФайла, "C:\_Base1C\ОбменТест.xml"); 

Если Результат.ЕстьОшибки Тогда 
	Сообщить("Ошибка записи файла обмена по FTP: " + Результат.ОписаниеОшибки + 
	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
КонецЕсли;

 ~ВЫХОД:
УдалитьФайлы(ИмяФайла);
// - ПСН 

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец выгрузки ------------";
Сообщение.Сообщить();
КонецФункции

Функция ПрочитатьСообщениеПодтверждения() Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");

ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(Ссылка.Код);

ИмяФайлаФТП = ФТПСервер.ПолучитьИмяФайлаОбменаФТП(Ссылка, ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), ДанныеУзлаОбмена.КаталогОбменаFTP);
ИмяФайла = ПолучитьИмяВременногоФайла("xml");
Ответ = ФТПСервер.ПолучитьФТПФайл(ИмяФайлаФТП, ИмяФайла
	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
	
Если Ответ.Ошибка Тогда
	Если Ответ.КодОшибки = 1 Тогда 
		Сообщить(Ответ.ОписаниеОшибки);
	Иначе
		Сообщить("Ошибка чтения файла обмена по FTP: " + Ответ.ОписаниеОшибки + 
		". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
	КонецЕсли;
	
	Возврат Ответ;	
КонецЕсли;

Файл = Новый Файл(ИмяФайла);

//Если Не Файл.Существует() Тогда
//	Возврат;
//КонецЕсли;

// Попытаться открыть файл.
// *** Чтение документов XML.
ЧтениеXML = Новый ЧтениеXML;
Попытка
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
Исключение
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Невозможно открыть файл обмена данными.";
	Сообщение.Сообщить();
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -10;
	Результат.ОписаниеОшибки = "Невозможно открыть файл обмена данными: " + ОписаниеОшибки();

	Возврат Результат;
КонецПопытки;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Загрузка из " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();
Сообщение.Текст = " – Считывается файл " + ИмяФайла;
Сообщение.Сообщить();

// Загрузить данные из найденного файла.
// *** Инфраструктура сообщений.
ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();

// Прочитать заголовок сообщения обмена данными – файла XML.
ЧтениеСообщения.НачатьЧтение(ЧтениеXML);

// Проверить, что сообщение предназначено для этого узла.
Если ЧтениеСообщения.Отправитель <> Ссылка Тогда
	//ВызватьИсключение "Неверный узел";
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -20;
	Результат.ОписаниеОшибки = "Неверный узел: " + ОписаниеОшибки();

	Возврат Результат;
КонецЕсли;

// Удалить регистрацию изменений для узла-отправителя сообщения.
// *** Служба регистрации изменений.
ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);

ЧтениеСообщения.ЗакончитьЧтение();
ЧтениеXML.Закрыть();

УдалитьФайлы(ИмяФайла);

Ответ = ФТПСервер.УдалитьФТПФайл(ИмяФайлаФТП
	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
Если Ответ.Ошибка Тогда
	Сообщить("Ошибка удаления файла FTP. " + Ответ.ОписаниеОшибки);
КонецЕсли;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец загрузки ------------";
Сообщение.Сообщить();
КонецФункции


//
Функция ПрочитатьСообщениеСИзменениями() Экспорт

//// Получить имя файла обмена.
//ИмяФайлаФТП = ОбменВыписка.ПолучитьИмяФайлаОбменаФТП(Ссылка, ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел());

ИмяФайла = ПолучитьИмяВременногоФайла("xml");
//Результат = ОбщийМодульФТП.ПолучитьФТПФайл(ИмяФайлаФТП, ИмяФайла); 
Результат = ФТПСервер.ПолучитьФТПФайл_TECT("C:\_Base1C\Обмен 1.xml", ИмяФайла); 

Если Результат.КодОшибки < 0 Тогда 
	Сообщить("Ошибка записи файла обмена по FTP: " + Результат.ОписаниеОшибки + 
	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
ИначеЕсли Результат.КодОшибки > 0 Тогда 
	Возврат Неопределено;
КонецЕсли;

Файл = Новый Файл(ИмяФайла);

Если Не Файл.Существует() Тогда Возврат Неопределено; КонецЕсли;

// Попытаться открыть файл.
// *** Чтение документов XML.
ЧтениеXML = Новый ЧтениеXML;
Попытка
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
Исключение
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Невозможно открыть файл обмена данными.";
	Сообщение.Сообщить();

	Возврат Неопределено;
КонецПопытки;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Загрузка из " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();
Сообщение.Текст = " – Считывается файл " + ИмяФайла;
Сообщение.Сообщить();

// Загрузить данные из найденного файла.
// *** Инфраструктура сообщений.
ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();

// Прочитать заголовок сообщения обмена данными – файла XML.
ЧтениеСообщения.НачатьЧтение(ЧтениеXML);

// Проверить, что сообщение предназначено для этого узла.
Если ЧтениеСообщения.Отправитель <> Ссылка Тогда
	ВызватьИсключение "Неверный узел";
КонецЕсли;

// Удалить регистрацию изменений для узла-отправителя сообщения.
// *** Служба регистрации изменений.
//ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);

// Прочитать данные из сообщения в цикле. *** XML-сериализация.
УдаленоКоличество = 0;
ЗамененоКоличество = 0;
ДобавленоКоличество = 0;
Пока ОбменГостиницы.ВозможностьЧтенияДанных(ЧтениеXML) Цикл
	// Прочитать очередное значение.
	Данные = ОбменГостиницы.ПрочитатьДанные(ЧтениеXML);

	//// Проверить, нужно ли принимать сообщение от узла-отправителя. Если нет, отклонить изменения.
	//Если Не ОбменВыписка.ПринятьИзменения(ЧтениеСообщения.Отправитель, Данные) Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = Строка(Данные.Метаданные()) + ": " + Строка(Данные) + " – Изменения отклонены";

	//	Сообщение.Сообщить();
	//	Продолжить;
	//КонецЕсли;

	// Записать полученные данные.
	// + ПСН
	//Данные.ОбменДанными.Отправитель = ЧтениеСообщения.Отправитель;
	//Данные.ОбменДанными.Загрузка = Истина;
	//Данные.Записать();
	
	Результат = ОбменГостиницы.ЗаписатьПолученныеДанные(Данные);	
	
	Если Результат = -1 Тогда
		УдаленоКоличество = УдаленоКоличество + 1; 		
	ИначеЕсли Результат = 0 Тогда
		ДобавленоКоличество = ДобавленоКоличество + 1; 		
	ИначеЕсли Результат = 1 Тогда
		ЗамененоКоличество = ЗамененоКоличество + 1; 		
	КонецЕсли;	
	// - ПСН
КонецЦикла;

ЧтениеСообщения.ЗакончитьЧтение();
ЧтениеXML.Закрыть();

УдалитьФайлы(ИмяФайла);

//Результат = ОбщийМодульФТП.УдалитьФТПФайл(ИмяФайлаФТП);
//Если Результат.ЕстьОшибки Тогда
//	Сообщить("Ошибка удаления файла FTP: " + Результат.ОписаниеОшибки);
//КонецЕсли;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец загрузки ------------";
Сообщение.Сообщить();

Результат = Новый Структура("Удалено, Добавлено, Заменено"
	, УдаленоКоличество, ДобавленоКоличество, ЗамененоКоличество);
	
Возврат Результат;
КонецФункции
///// +++++++++++++++++++


Функция ЗаписатьСообщениеСИзменениями_Бух() Экспорт
ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(Ссылка.Код);
	
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Выгрузка в узел " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();

// + ПСН 
// Получить имя файла обмена.
//ИмяФайла = ВГ_ОбменВыписка.ПолучитьИмяФайлаОбмена(ПланыОбмена.Выписка.ЭтотУзел(), Ссылка);
ИмяФайла = ПолучитьИмяВременногоФайла("xml"); 
// - ПСН 

// Создать объект записи XML.
// *** ЗаписьXML-документов.
ЗаписьXML = Новый ЗаписьXML;
ЗаписьXML.ОткрытьФайл(ИмяФайла);
ЗаписьXML.ЗаписатьОбъявлениеXML();

// *** Инфраструктура сообщений.
ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);

// Записать соответствие пространств имен для сокращения размера файла сообщения
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = " Номер сообщения: " + ЗаписьСообщения.НомерСообщения;
Сообщение.Сообщить();

ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
Пока ВыборкаИзменений.Следующий() Цикл
	Данные = ВыборкаИзменений.Получить();
	
	//Если НЕ (ТипЗнч(Данные) = Тип("УдалениеОбъекта")) Тогда  
	//	Если ВГ_ОбменВыписка.ПроверитьДанные(Данные, ДанныеУзлаОбмена) Тогда Продолжить; КонецЕсли;
	//КонецЕсли;		
	
	// Проверить, нужен ли перенос данных. Если нет, то записать удаление этих данных.
	//Если Не ВГ_ОбменВыписка.НуженПереносДанных(ЗаписьСообщения.Получатель, Данные) Тогда
	//	ВГ_ОбменВыписка.УдалениеДанных(Данные);
	//КонецЕсли;  
	
	// Записать данные в сообщение *** XML-сериализация.
	ОбменГостиницы.ЗаписатьДанные(ЗаписьXML, Данные);	
КонецЦикла;

ЗаписьСообщения.ЗакончитьЗапись();
ЗаписьXML.Закрыть();

// Получить имя файла обмена.
ИмяФайлаФТП = ФТПСервер.ПолучитьИмяФайлаОбменаФТП(ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), Ссылка, ДанныеУзлаОбмена.КаталогОбменаFTP);

//Результат = ВГ_ОбщийМодульФТП.ЗаписатьФТПФайл(ИмяФайла, ИмяФайлаФТП
//	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 

//Если Результат.ЕстьОшибки Тогда 
//	Сообщить("Ошибка записи файла обмена по FTP: " + Результат.ОписаниеОшибки + 
//	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
//КонецЕсли;

 ~ВЫХОД:
УдалитьФайлы(ИмяФайла);
// - ПСН 

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец выгрузки ------------";
Сообщение.Сообщить();
КонецФункции

Процедура ПрочитатьСообщениеПодтверждения_Бух() Экспорт
// Получить имя файла обмена.
ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(Ссылка.Код);

ИмяФайлаФТП = ФТПСервер.ПолучитьИмяФайлаОбменаФТП(Ссылка, ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), ДанныеУзлаОбмена.КаталогОбменаFTP);
ИмяФайла = ПолучитьИмяВременногоФайла("xml");
//Результат = ВГ_ОбщийМодульФТП.ПолучитьФТПФайл(ИмяФайлаФТП, ИмяФайла
//	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
//	
//Если Результат.КодОшибки < 0 Тогда 
//	Сообщить("Ошибка чтения файла обмена по FTP: " + Результат.ОписаниеОшибки + 
//	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
//ИначеЕсли Результат.КодОшибки > 0 Тогда 
//	Возврат;
//КонецЕсли;

Файл = Новый Файл(ИмяФайла);

//Если Не Файл.Существует() Тогда
//	Возврат;
//КонецЕсли;

// Попытаться открыть файл.
// *** Чтение документов XML.
ЧтениеXML = Новый ЧтениеXML;
Попытка
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
Исключение
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Невозможно открыть файл обмена данными.";
	Сообщение.Сообщить();

	Возврат;
КонецПопытки;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Загрузка из " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();
Сообщение.Текст = " – Считывается файл " + ИмяФайла;
Сообщение.Сообщить();

// Загрузить данные из найденного файла.
// *** Инфраструктура сообщений.
ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();

// Прочитать заголовок сообщения обмена данными – файла XML.
ЧтениеСообщения.НачатьЧтение(ЧтениеXML);

// Проверить, что сообщение предназначено для этого узла.
Если ЧтениеСообщения.Отправитель <> Ссылка Тогда
	ВызватьИсключение "Неверный узел";
КонецЕсли;

// Удалить регистрацию изменений для узла-отправителя сообщения.
// *** Служба регистрации изменений.
ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);

ЧтениеСообщения.ЗакончитьЧтение();
ЧтениеXML.Закрыть();

УдалитьФайлы(ИмяФайла);

//Результат = ВГ_ОбщийМодульФТП.УдалитьФТПФайл(ИмяФайлаФТП
//	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
//Если Результат.ЕстьОшибки Тогда
//	Сообщить("Ошибка удаления файла FTP: " + Результат.ОписаниеОшибки);
//КонецЕсли;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец загрузки ------------";                                                    
Сообщение.Сообщить();
КонецПроцедуры

// ++++++++++++++
