
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("РезервСОтбор", РезервСОтбор);	
Параметры.Свойство("РезервПоОтбор", РезервПоОтбор);	

ТолькоНовые = Истина;

ЗаполнитьУслугиРодительСправочник();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиРодительСправочник()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ДопУслуги.Ссылка КАК УслугаРодитель,
                      |	ДопУслуги.НомерПП КАК НомерПП,
                      |	ДопУслуги.ЗаголовокОтчеты КАК ЗаголовокОтчеты,
                      |	0 КАК Номер
                      |ИЗ
                      |	Справочник.ДопУслуги КАК ДопУслуги
                      |ГДЕ
                      |	ДопУслуги.ПометкаУдаления = ЛОЖЬ
                      |	И ДопУслуги.ЭтоГруппа = ИСТИНА
                      |	И ДопУслуги.Родитель = ЗНАЧЕНИЕ(Справочник.ДопУслуги.ПустаяСсылка)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НомерПП");

ТЗ_РодительУслуги = Запрос.Выполнить().Выгрузить();
ТЗ_РодительУслуги.Сортировать("НомерПП");

Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	Если ЗначениеЗаполнено(Строка.УслугаРодитель) Тогда		
		Если НЕ ЗначениеЗаполнено(Строка.ЗаголовокОтчеты) Тогда
			Строка.ЗаголовокОтчеты = Строка.УслугаРодитель;
		КонецЕсли;
	КонецЕсли;
КонецЦикла;

НоваяСтрока = ТЗ_РодительУслуги.Добавить();
НоваяСтрока.УслугаРодитель = Справочники.ДопУслуги.ПустаяСсылка();
НоваяСтрока.ЗаголовокОтчеты = "Без папки";
НоваяСтрока.НомерПП = 9999999;

УслугиРодительСправочник.Очистить();

Номер = 1;
Для Каждого Строка Из ТЗ_РодительУслуги Цикл
	НоваяСтрока = УслугиРодительСправочник.Добавить();

	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	НоваяСтрока.Номер = Номер;
	Номер = Номер + 1;
КонецЦикла;

// + Доп. реквизиты
ДобавляемыеРеквизиты	= Новый Массив;

Индекс = 1;
ОписаниеЧисло_10_2 = Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10, 2)); 
Для Каждого Строка Из УслугиРодительСправочник Цикл
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Услуга_" + Строка(Индекс), ОписаниеЧисло_10_2, "ДокументыКСписанию"));
	
	Индекс = Индекс + 1;
КонецЦикла;	

// Добавим новые реквизиты в форму
ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

Номер = 1;
Для Каждого Строка Из УслугиРодительСправочник Цикл
	Имя = "Услуга_" + Строка(Номер); 
	НовыйЭлемент = Элементы.Добавить(Имя, Тип("ПолеФормы"), Элементы.ДокументыКСписанию);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДокументыКСписанию." + Имя;
	//НовыйЭлемент.Ширина = 10;
	НовыйЭлемент.Заголовок = Строка.ЗаголовокОтчеты;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	Номер = Номер + 1;
КонецЦикла;
// - Доп. реквизиты
КонецПроцедуры

&НаКлиенте
Процедура Получить(Команда)
ПолучитьНаСервере(); 
КонецПроцедуры

&НаСервере
Функция ИмяОбъекта()
ФормаИмя = ЭтаФорма.ИмяФормы;	
Индекс1 = СтрНайти(ФормаИмя, ".",,, 1);
Индекс2 = СтрНайти(ФормаИмя, ".",,, 2);
Имя = Сред(ФормаИмя, Индекс1 + 1, Индекс2 - Индекс1 - 1);
	
Возврат Имя;
КонецФункции

&НаСервере
Процедура ПолучитьНаСервере()
Имя = ИмяОбъекта();

ДатаРезервПо_П = ?(ЗначениеЗаполнено(РезервПоОтбор), РезервПоОтбор, '30010101');
ТЗ = Документы[Имя].ПолучитьДокументыКСписанию(РезервСОтбор, ДатаРезервПо_П, ТолькоНовые, Неопределено);	

СписокЗаявок = Новый Массив;
Для Каждого Строка Из ТЗ Цикл
	СписокЗаявок.Добавить(Строка.ДокументДолг);
КонецЦикла;

ДокументыКСписанию.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ДокументыКСписанию.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеДопУслуги.Ссылка КАК ДокументДолг,
                      |	ЗаявкаНаБронированиеДопУслуги.Услуга КАК Услуга,
                      |	ЗаявкаНаБронированиеДопУслуги.Цена * ЗаявкаНаБронированиеДопУслуги.Количество КАК Сумма
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.ДопУслуги КАК ЗаявкаНаБронированиеДопУслуги
                      |ГДЕ
                      |	ЗаявкаНаБронированиеДопУслуги.ВСчет = ИСТИНА
                      |	И ЗаявкаНаБронированиеДопУслуги.Ссылка В(&СписокЗаявок)");

Запрос.УстановитьПараметр("СписокЗаявок", СписокЗаявок); 
ТЗ_Услуги = Запрос.Выполнить().Выгрузить();

ТЗ_УслугиРодитель = ТЗ_Услуги.Скопировать();
ТЗ_УслугиРодитель.Колонки.Добавить("УслугаРодитель");
Для Каждого Строка Из ТЗ_УслугиРодитель Цикл 
	Результат = Справочники.ДопУслуги.ПустаяСсылка();
	Ссылка = Строка.Услуга; 
	ОбщийФункционалСервер.ВерхняяПапка(Ссылка, Результат);			
	
	Строка.УслугаРодитель = Результат;	
КонецЦикла;	
ТЗ_УслугиРодитель.Свернуть("ДокументДолг, УслугаРодитель", "Сумма");

Для Каждого СтрокаСписание Из ДокументыКСписанию Цикл 
	ОтборСтроки = Новый Структура("ДокументДолг", СтрокаСписание.ДокументДолг);
	НайденныеСтроки = ТЗ_УслугиРодитель.НайтиСтроки(ОтборСтроки);
	
	Для Каждого СтрокаУслугиРодитель Из НайденныеСтроки Цикл
		ОтборСтроки = Новый Структура("УслугаРодитель", СтрокаУслугиРодитель.УслугаРодитель);
		НайденныеСтроки = УслугиРодительСправочник.НайтиСтроки(ОтборСтроки);
		
		Номер = НайденныеСтроки[0].Номер;
		
		Имя = "Услуга_" + Строка(Номер);
		СтрокаСписание[Имя] = СтрокаУслугиРодитель.Сумма;	
	КонецЦикла;
КонецЦикла;
КонецПроцедуры

//
&НаКлиенте
Процедура ДокументыКСписаниюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = ДокументыКСписанию.НайтиПоИдентификатору(ВыбраннаяСтрока);

ПараметрыФормы = Новый Структура("Ключ", ТД.ДокументДолг);
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКСписаниюПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКСписаниюПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры
//

&НаКлиенте
Процедура Отправить(Команда)
Закрыть(ДокументыКСписанию);
КонецПроцедуры

//
&НаКлиенте
Процедура УстановитьФлажки(Команда)
Для Каждого Строка Из ДокументыКСписанию Цикл
	Строка.Отметка = Истина;	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
Для Каждого Строка Из ДокументыКСписанию Цикл
	Строка.Отметка = Ложь;	
КонецЦикла;
КонецПроцедуры


//
