
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("БезЗавтрака", БезЗавтрака);  

МассивВыбранных = Неопределено;
Параметры.Свойство("МассивВыбранных", МассивВыбранных);  
Для Каждого Элемент Из МассивВыбранных Цикл
	ЗначениеСписокВыбранных = СписокВыбранных.Добавить(Элемент);	
КонецЦикла;

//Для Каждого Элемент Из МассивВыбранных Цикл
//	Если ДеньНедели(Элемент) > 4 Тогда
//		ЕстьВыбранныеВыходные = Истина;
//		Прервать;
//	КонецЕсли;
//КонецЦикла; 

//Для Каждого Элемент Из МассивВыбранных Цикл
//	Если ДеньНедели(Элемент) < 5 Тогда
//		ЕстьВыбранныеБудни = Истина;
//		Прервать;
//	КонецЕсли;
//КонецЦикла;

ВидЦеныТекущий = Перечисления.КалендарьЦенВидЦены.ТекущаяЦена;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КатегорииНомеров.Ссылка КАК КатегорияНомера
                      |ИЗ
                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                      |ГДЕ
                      |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ");

ТЗ_Категории = Запрос.Выполнить().Выгрузить();

ДатаБазовойЦены = СписокВыбранных[0].Значение;

//
ТЗ_БазовыеЦены = КалендарьЦен.ПолучитьТЗБазовыеЦены(ДатаБазовойЦены);

Если ТЗ_БазовыеЦены.Количество() > 0 Тогда
	СтрокаБазовыеЦены = ТЗ_БазовыеЦены[0];
	
	БазоваяЦена = СтрокаБазовыеЦены.БазоваяЦена;
	//БазоваяЦенаИсходная = СтрокаБазовыеЦены.БазоваяЦена;
	БазоваяЦенаИсходная = БазоваяЦена;
	//БазоваяЦенаТекущая = СтрокаБазовыеЦены.БазоваяЦена;
	БазоваяЦенаТекущая = БазоваяЦенаИсходная;
	
	ДоплатаЗаЗавтрак = СтрокаБазовыеЦены.ДоплатаЗаЗавтрак;
	//ДоплатаЗаЗавтракИсходная = СтрокаБазовыеЦены.ДоплатаЗаЗавтрак;
	ДоплатаЗаЗавтракИсходная = ДоплатаЗаЗавтрак;
	//ДоплатаЗаЗавтракТекущая = СтрокаБазовыеЦены.ДоплатаЗаЗавтрак;
	ДоплатаЗаЗавтракТекущая = ДоплатаЗаЗавтракИсходная;
	
	ДоплатаЗаДвухместный = СтрокаБазовыеЦены.ДоплатаЗаДвухместный;
	//ДоплатаЗаДвухместныйИсходная = СтрокаБазовыеЦены.ДоплатаЗаДвухместный;
	ДоплатаЗаДвухместныйИсходная = ДоплатаЗаДвухместный;
	//ДоплатаЗаДвухместныйТекущая = СтрокаБазовыеЦены.ДоплатаЗаДвухместный;  
	ДоплатаЗаДвухместныйТекущая = ДоплатаЗаДвухместныйИсходная; 
	
	ДоплатыЗаКатегории.Очистить();
	Для Каждого СтрокаКатегории Из ТЗ_Категории Цикл
		НоваяСтрока = ДоплатыЗаКатегории.Добавить();		
		
		НоваяСтрока.КатегорияНомера = СтрокаКатегории.КатегорияНомера;
		
		ОтборСтроки = Новый Структура("КатегорияНомера", СтрокаКатегории.КатегорияНомера);
		НайденныеСтроки = СтрокаБазовыеЦены.ДоплатыЗаКатегории.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрока.ДоплатаЗаКатегорию = НайденныеСтроки[0].ДоплатаЗаКатегорию;
			//НоваяСтрока.ДоплатаЗаКатегориюИсходная = НайденныеСтроки[0].ДоплатаЗаКатегорию;
			НоваяСтрока.ДоплатаЗаКатегориюИсходная = НоваяСтрока.ДоплатаЗаКатегорию;
			//НоваяСтрока.ДоплатаЗаКатегориюТекущая = НайденныеСтроки[0].ДоплатаЗаКатегорию;
			НоваяСтрока.ДоплатаЗаКатегориюТекущая = НоваяСтрока.ДоплатаЗаКатегориюИсходная;
		КонецЕсли;	
	КонецЦикла;
КонецЕсли;
//

//
ТЗ = КалендарьЦен.ПолучитьКалендарьЦенБазовый(ДатаБазовойЦены, ВидЦеныТекущий);
Если ТЗ.Количество() > 0 Тогда
	Строка = ТЗ[0];                        
	
	ОтборСтроки = Новый Структура("ТипЦены", Перечисления.КалендарьЦенТипЦены.БазоваяЦена);
	НайденныеСтроки = ТЗ.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		//БазоваяЦенаИсходная = НайденныеСтроки[0].ЦенаДоплата;
		БазоваяЦенаТекущая = НайденныеСтроки[0].ЦенаДоплата;
		//БазоваяЦенаТекущая = БазоваяЦенаИсходная;
	КонецЕсли;
	
	ОтборСтроки = Новый Структура("ТипЦены", Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак);
	НайденныеСтроки = ТЗ.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		//ДоплатаЗаЗавтракИсходная = НайденныеСтроки[0].ЦенаДоплата;
		ДоплатаЗаЗавтракТекущая = НайденныеСтроки[0].ЦенаДоплата;
		//ДоплатаЗаЗавтракТекущая = ДоплатаЗаЗавтракИсходная;
	КонецЕсли;
	
	ОтборСтроки = Новый Структура("ТипЦены", Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный);
	НайденныеСтроки = ТЗ.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		//ДоплатаЗаДвухместныйИсходная = НайденныеСтроки[0].ЦенаДоплата;
		ДоплатаЗаДвухместныйТекущая = НайденныеСтроки[0].ЦенаДоплата;
		//ДоплатаЗаДвухместныйТекущая = ДоплатаЗаДвухместныйИсходная;	
	КонецЕсли;
	
	Для Каждого СтрокаКатегории Из ДоплатыЗаКатегории Цикл
		ТЗ_КалендарьЦенКатегории = КалендарьЦен.ПолучитьТЗКалендарьЦенКатегории(ДатаБазовойЦены, СтрокаКатегории.КатегорияНомера, ВидЦеныТекущий);
		
		ОтборСтроки = Новый Структура("КатегорияНомера", СтрокаКатегории.КатегорияНомера);
		НайденныеСтроки = ТЗ_КалендарьЦенКатегории.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() > 0 Тогда
			//СтрокаКатегории.ДоплатаЗаКатегориюИсходная = НайденныеСтроки[0].ДоплатаЗаКатегорию;
			СтрокаКатегории.ДоплатаЗаКатегориюТекущая = НайденныеСтроки[0].ДоплатаЗаКатегорию;
			//СтрокаКатегории.ДоплатаЗаКатегориюТекущая = СтрокаКатегории.ДоплатаЗаКатегориюИсходная;	
		КонецЕсли;	
	КонецЦикла;
КонецЕсли;
//

//
ЦеныКатегорииНомеров.Очистить();
Для Каждого Строка Из ТЗ_Категории Цикл
	НоваяСтрока = ЦеныКатегорииНомеров.Добавить();
	
	НоваяСтрока.КатегорияНомера = Строка.КатегорияНомера;
	
	ОтборСтроки = Новый Структура("КатегорияНомера", Строка.КатегорияНомера);
	НайденныеСтроки = ДоплатыЗаКатегории.НайтиСтроки(ОтборСтроки);
	
	НоваяСтрока.ДоплатаЗаКатегорию = НайденныеСтроки[0].ДоплатаЗаКатегорию;
	//НоваяСтрока.ДоплатаЗаКатегориюИсходная = НайденныеСтроки[0].ДоплатаЗаКатегориюИсходная;
	НоваяСтрока.ДоплатаЗаКатегориюИсходная = НоваяСтрока.ДоплатаЗаКатегорию;
	//НоваяСтрока.ДоплатаЗаКатегориюТекущая = НайденныеСтроки[0].ДоплатаЗаКатегориюТекущая;
	НоваяСтрока.ДоплатаЗаКатегориюТекущая = НоваяСтрока.ДоплатаЗаКатегориюИсходная;
	
	НоваяСтрока.ЦенаОдноместный = БазоваяЦена + НоваяСтрока.ДоплатаЗаКатегорию;
	Если Строка.КатегорияНомера.ТолькоОдноместный Тогда
		НоваяСтрока.ЦенаДвухместный = 0;
	Иначе
		НоваяСтрока.ЦенаДвухместный = БазоваяЦена + ДоплатаЗаДвухместный 
			+ НоваяСтрока.ДоплатаЗаКатегорию;
	КонецЕсли;
		
	НоваяСтрока.ЦенаОдноместныйИсходная = БазоваяЦенаИсходная + НоваяСтрока.ДоплатаЗаКатегориюИсходная;
	Если Строка.КатегорияНомера.ТолькоОдноместный Тогда
		НоваяСтрока.ЦенаДвухместныйИсходная = 0;
	Иначе
		НоваяСтрока.ЦенаДвухместныйИсходная = БазоваяЦенаИсходная + ДоплатаЗаДвухместныйИсходная 
			+ НоваяСтрока.ДоплатаЗаКатегориюИсходная;
	КонецЕсли;
			
	НоваяСтрока.ЦенаОдноместныйТекущая = БазоваяЦенаТекущая + НоваяСтрока.ДоплатаЗаКатегориюТекущая;
	Если Строка.КатегорияНомера.ТолькоОдноместный Тогда
		НоваяСтрока.ЦенаДвухместныйТекущая = 0;
	Иначе	
		НоваяСтрока.ЦенаДвухместныйТекущая = БазоваяЦенаТекущая + ДоплатаЗаДвухместныйТекущая 
		+ НоваяСтрока.ДоплатаЗаКатегориюТекущая;
	КонецЕсли;
КонецЦикла;
//

СоздатьСтроки();	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтроки()
Имя = "ГруппаТаблица";	 
ГруппаТаблица = Элементы.Добавить(Имя, Тип("ГруппаФормы"), Элементы.ЦеныПоКатегориям); 
ГруппаТаблица.Вид = ВидГруппыФормы.ОбычнаяГруппа;	
ГруппаТаблица.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
ГруппаТаблица.Заголовок = "Цены по категориям";	
ГруппаТаблица.ЦветФона = Новый Цвет(225, 245, 255);

ГруппаТаблица.Высота = 2;	
ГруппаТаблица.РастягиватьПоВертикали = Ложь;

Индекс = 0;
Для Каждого Строка Из ЦеныКатегорииНомеров Цикл

	Имя = "ГруппаСтрока_" + Строка(Индекс);	 
	ГруппаСтрока = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаТаблица); 
	ГруппаСтрока.Вид = ВидГруппыФормы.ОбычнаяГруппа;	
	ГруппаСтрока.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
	ГруппаСтрока.Заголовок = Строка.КатегорияНомера.Наименование;	
	ГруппаСтрока.ШрифтЗаголовка = Новый Шрифт(,,Истина);
	
	Имя = "ГруппаКатегория_" + Строка(Индекс);	 
	ГруппаСтрокаКатегория = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаСтрока); 
	ГруппаСтрокаКатегория.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтрокаКатегория.ОтображатьЗаголовок = Ложь;
	ГруппаСтрокаКатегория.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 

	Имя = "ГруппаДоплатыЗаКатегорию_" + Строка(Индекс);	 
	ГруппаСтрокаДоплатыЗаКатегорию = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаСтрокаКатегория); 
	ГруппаСтрокаДоплатыЗаКатегорию.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтрокаДоплатыЗаКатегорию.ОтображатьЗаголовок = Ложь;
	ГруппаСтрокаДоплатыЗаКатегорию.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 

	Имя = "БазоваяДоплатаЗаКатегорию_" + Строка(Индекс);	 
	Поле = Элементы.Добавить(Имя, Тип("ПолеФормы"), ГруппаСтрокаДоплатыЗаКатегорию);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "ЦеныКатегорииНомеров[" + Строка(Индекс) + "].ДоплатаЗаКатегорию";	
	Поле.Заголовок = "Базовая доплата за категорию";
	Поле.ТолькоПросмотр = Истина;
	Поле.ВысотаЗаголовка = 2;

	Имя = "ТекущаяДоплатаЗаКатегорию_" + Строка(Индекс);	 
	Поле = Элементы.Добавить(Имя, Тип("ПолеФормы"), ГруппаСтрокаДоплатыЗаКатегорию);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "ЦеныКатегорииНомеров[" + Строка(Индекс) + "].ДоплатаЗаКатегориюТекущая";	
	Поле.Заголовок = "Текущая доплата за категорию";
	Поле.ТолькоПросмотр = Строка.КатегорияНомера.Базовый;
	Поле.УстановитьДействие("ПриИзменении", "ДействиеПриИзмененииДоплатаЗаКатегорию");
	Поле.ШрифтЗаголовка = Новый Шрифт(,,Истина);
	Поле.Шрифт = Новый Шрифт(,,Истина);
	Поле.ВысотаЗаголовка = 2;
	
	Имя = "ГруппаЦеныОдноместный_" + Строка(Индекс);	 
	ГруппаСтрокаЦеныОдноместный = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаСтрокаКатегория); 
	ГруппаСтрокаЦеныОдноместный.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтрокаЦеныОдноместный.ОтображатьЗаголовок = Ложь;
	ГруппаСтрокаЦеныОдноместный.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	
	Имя = "БазоваяЦена_Одноместный_" + Строка(Индекс);	 
	Поле = Элементы.Добавить(Имя, Тип("ПолеФормы"), ГруппаСтрокаЦеныОдноместный);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "ЦеныКатегорииНомеров[" + Строка(Индекс) + "].ЦенаОдноместный";	
	Поле.Заголовок = "1 БЦ";
	Поле.ТолькоПросмотр = Истина;

	Имя = "НоваяЦена_Одноместный_" + Строка(Индекс);	 
	Поле = Элементы.Добавить(Имя, Тип("ПолеФормы"), ГруппаСтрокаЦеныОдноместный);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "ЦеныКатегорииНомеров[" + Строка(Индекс) + "].ЦенаОдноместныйТекущая";	
	Поле.ТолькоПросмотр = Истина;
	Поле.Заголовок = "1 НЦ";
////
	
////
	Имя = "ГруппаЦеныДвухместный_" + Строка(Индекс);	 
	ГруппаСтрокаЦеныДвухместный = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаСтрокаКатегория); 
	ГруппаСтрокаЦеныДвухместный.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтрокаЦеныДвухместный.ОтображатьЗаголовок = Ложь;
	ГруппаСтрокаЦеныДвухместный.Группировка =  ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 

	Имя = "БазоваяЦена_Двухместный_" + Строка(Индекс);	 
	Поле = Элементы.Добавить(Имя, Тип("ПолеФормы"), ГруппаСтрокаЦеныДвухместный);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "ЦеныКатегорииНомеров[" + Строка(Индекс) + "].ЦенаДвухместный";	
	Поле.Заголовок = "2 БЦ";
	Поле.ТолькоПросмотр = Истина;

	Имя = "НоваяЦена_Двухместный_" + Строка(Индекс);	 
	Поле = Элементы.Добавить(Имя, Тип("ПолеФормы"), ГруппаСтрокаЦеныДвухместный);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "ЦеныКатегорииНомеров[" + Строка(Индекс) + "].ЦенаДвухместныйТекущая";	
	Поле.Заголовок = "2 НЦ";
	Поле.ТолькоПросмотр = Истина;
////	
	Индекс = Индекс + 1;
КонецЦикла;
	
КонецПроцедуры

//
&НаКлиенте
Процедура БазоваяЦенаТекущаяПриИзменении(Элемент)
Для Каждого Строка Из ЦеныКатегорииНомеров Цикл
	Строка.ЦенаОдноместныйТекущая = БазоваяЦенаТекущая + Строка.ДоплатаЗаКатегориюТекущая;
	Строка.ЦенаДвухместныйТекущая = БазоваяЦенаТекущая + ДоплатаЗаДвухместныйТекущая + Строка.ДоплатаЗаКатегориюТекущая;
КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ДоплатаЗаДвухместныйТекущаяПриИзменении(Элемент)
Для Каждого Строка Из ЦеныКатегорииНомеров Цикл
	Строка.ЦенаДвухместныйТекущая = БазоваяЦенаТекущая + ДоплатаЗаДвухместныйТекущая + Строка.ДоплатаЗаКатегориюТекущая;
КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзмененииДоплатаЗаКатегорию(Элемент)
ИмяЭлемента = Элемент.Имя;
Индекс = СтрНайти(ИмяЭлемента, "_");
НомерСтроки = Число(Сред(ИмяЭлемента, Индекс + 1));

Строка = ЦеныКатегорииНомеров[НомерСтроки];

Строка.ЦенаОдноместныйТекущая = БазоваяЦенаТекущая + Строка.ДоплатаЗаКатегориюТекущая;
Строка.ЦенаДвухместныйТекущая = БазоваяЦенаТекущая + ДоплатаЗаДвухместныйТекущая + Строка.ДоплатаЗаКатегориюТекущая;
КонецПроцедуры
//


&НаКлиенте
Процедура Заполнить(Команда)
//Результат = ЦеныКатегорииНомеров;	

Строка = "БазоваяЦенаИсходная, БазоваяЦенаТекущая"
	+ ", ДоплатаЗаДвухместныйИсходная, ДоплатаЗаДвухместныйТекущая"
	+ ", ДоплатаЗаЗавтракИсходная, ДоплатаЗаЗавтракТекущая"
	+ ", ЦеныКатегорииНомеров";
Результат = Новый Структура(Строка
	, БазоваяЦенаИсходная, БазоваяЦенаТекущая
	, ДоплатаЗаДвухместныйИсходная, ДоплатаЗаДвухместныйТекущая
	, ДоплатаЗаЗавтракИсходная, ДоплатаЗаЗавтракТекущая
	, ЦеныКатегорииНомеров);
Закрыть(Результат);	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
Закрыть();	
КонецПроцедуры


