
Процедура ПередЗаписью(Отказ, Замещение)
Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли; 
	
Если ЭтотОбъект.Количество() = 0 Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БезналЗагрузка.ПолучательПлатежа КАК ПолучательПлатежа,
	                      |	БезналЗагрузка.СуммаЧехов КАК СуммаЧехов,
	                      |	БезналЗагрузка.СуммаЛайв КАК СуммаЛайв,
	                      |	БезналЗагрузка.СуммаДомСоветов КАК СуммаДомСоветов,
	                      |	БезналЗагрузка.СуммаРеноме КАК СуммаРеноме,
	                      |	БезналЗагрузка.СуммаСтритАрт КАК СуммаСтритАрт
	                      |ИЗ
	                      |	РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
	                      |ГДЕ
	                      |	БезналЗагрузка.ГУИД = &ГУИД");
	Запрос.УстановитьПараметр("ГУИД", Отбор.ГУИД.Значение);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Данные = Выборка;	
Иначе
	Данные = ЭтотОбъект[0];
КонецЕсли;

Если НастройкиСервер.ЭтоЛайв() Тогда
	Если Данные.СуммаЧехов > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЧЕХОВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
	//Если Данные.СуммаДомСоветов > 0 Тогда
	//	Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ДОМСОВЕТ");	
	//	ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	//КонецЕсли;

ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда
	Если Данные.СуммаЛайв > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЛАЙВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
	//Если Данные.СуммаДомСоветов > 0 Тогда
	//	Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ДОМСОВЕТ");	
	//	ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	//КонецЕсли;
	
ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда
	Если Данные.СуммаСтритАрт > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("СТРИТАРТ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;

	//Если Данные.СуммаЛайв > 0 Тогда
	//	Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЛАЙВ");	
	//	ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	//КонецЕсли;
	//
	//Если Данные.СуммаЧехов > 0 Тогда
	//	Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЧЕХОВ");	
	//	ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	//КонецЕсли;
	
ИначеЕсли НастройкиСервер.ЭтоРеноме() Тогда
	//Если Данные.СуммаСтритАрт > 0 Тогда
	//	Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("СТРИТАРТ");	
	//	ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	//КонецЕсли;
	
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда     
	
	Если Данные.СуммаДомСоветов > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ДОМСОВЕТ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
	Если Данные.СуммаЛайв > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЛАЙВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
	Если Данные.СуммаЧехов > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЧЕХОВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	//
	//Если Данные.СуммаРеноме > 0 Тогда
	//	Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("РЕНОМЕ");	
	//	ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	//КонецЕсли;
КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью_1(Отказ, Замещение)
Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли; 
	
Если ЭтотОбъект.Количество() = 0 Тогда	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БезналЗагрузка.ПолучательПлатежа КАК ПолучательПлатежа,
	                      |	БезналЗагрузка.СуммаЧехов КАК СуммаЧехов,
	                      |	БезналЗагрузка.СуммаЛайв КАК СуммаЛайв,
	                      |	БезналЗагрузка.СуммаДомСоветов КАК СуммаДомСоветов,
	                      |	БезналЗагрузка.СуммаРеноме КАК СуммаРеноме,
	                      |	БезналЗагрузка.СуммаСтритАрт КАК СуммаСтритАрт
	                      |ИЗ
	                      |	РегистрСведений.БезналЗагрузка КАК БезналЗагрузка
	                      |ГДЕ
	                      |	БезналЗагрузка.ГУИД = &ГУИД");
	Запрос.УстановитьПараметр("ГУИД", Отбор.ГУИД.Значение);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Данные = Выборка;	
Иначе
	Данные = ЭтотОбъект[0];
КонецЕсли;

Если НастройкиСервер.ЭтоЛайв() Тогда
	Если Данные.СуммаЧехов > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЧЕХОВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
	Если Данные.СуммаДомСоветов > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ДОМСОВЕТ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;

ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда
	Если Данные.СуммаЛайв > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЛАЙВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
	Если Данные.СуммаДомСоветов > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ДОМСОВЕТ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
ИначеЕсли НастройкиСервер.ЭтоДомСоветов() Тогда
	Если Данные.СуммаЛайв > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЛАЙВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
	Если Данные.СуммаЧехов > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЧЕХОВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
ИначеЕсли НастройкиСервер.ЭтоРеноме() Тогда
	Если Данные.СуммаСтритАрт > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("СТРИТАРТ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда
	Если Данные.СуммаЛайв > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЛАЙВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
	Если Данные.СуммаЧехов > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("ЧЕХОВ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
	
	Если Данные.СуммаРеноме > 0 Тогда
		Узел = ПланыОбмена.ОбменГостиницы.НайтиПоКоду("РЕНОМЕ");	
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭтотОбъект);
	КонецЕсли;
КонецЕсли;	
КонецПроцедуры




