
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТабличныйДокумент = Параметры.ТабличныйДокумент;

ЭтаФорма.АвтоЗаголовок = Ложь;
ЭтаФорма.Заголовок = Параметры.Заголовок;	

Параметры.Свойство("Почта", Почта);
Параметры.Свойство("ПочтаТема", ПочтаТема);
Параметры.Свойство("ПочтаТекстСообщения", ПочтаТекстСообщения);

Параметры.Свойство("ИмяФайла", ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
УстановитьПочтаДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПочтаПриИзменении(Элемент)
УстановитьПочтаДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПочтаДоступность()
ЕстьПочта = ЗначениеЗаполнено(Почта);
Элементы.ФормаОтправитьНаПочту.Доступность = ЕстьПочта;
Элементы.ПочтаТема.Доступность = ЕстьПочта;
Элементы.ПочтаТекстСообщения.Доступность = ЕстьПочта;
КонецПроцедуры
//

&НаКлиенте
Процедура ОтправитьНаПочту(Команда)
ОтправитьНаПочтуНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаПочтуНаСервере()
Получатели = Новый СписокЗначений;
Получатели.Добавить(Почта);

Файлы = Новый СписокЗначений;

//ВременныйФайл = ПолучитьИмяВременногоФайла("PDF"); 
//ТабличныйДокумент.Записать(ВременныйФайл, "PDF");

КаталогВременныхФайлов = КаталогВременныхФайлов();
ВременныйФайл = КаталогВременныхФайлов + ИмяФайла + ".PDF";
ТабличныйДокумент.Записать(ВременныйФайл, "PDF");
Файлы.Добавить(ВременныйФайл);

СлужебныеСервер.ОтправитьМейлом(ПочтаТема, Файлы, Получатели, ПочтаТекстСообщения);

Попытка
	УдалитьФайлы(ВременныйФайл);
Исключение
	Сообщить("Возникли проблемы с удалением временного файла почты: " + ВременныйФайл + ". " + ОписаниеОшибки());
	Возврат;
КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
Диалог.Расширение = "PDF";

//Фильтр = НСтр("ru = 'Текст'; en = 'Text'")
//    + "(*.PDF)|*.PDF";
	
Диалог.Фильтр = "(*.PDF)|*.PDF";;

Диалог.ПолноеИмяФайла = ИмяФайла;

Если Диалог.Выбрать() Тогда
    ТабличныйДокумент.Записать(Диалог.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF)
КонецЕсли;
КонецПроцедуры




