//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;	
	
Если НастройкиСервер.ЭтоРеноме() Тогда
	ОтельИмя = "Реноме";
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда
	ОтельИмя = "Чехов";
ИначеЕсли НастройкиСервер.ЭтоЛайв() Тогда
	ОтельИмя = "Лайв";
Иначе
	ОтельИмя = "";
КонецЕсли;
	
Если ОтельИмя = "Реноме" Тогда
	Элементы.ЗарплатаСменыКоличествоЗаселенийДомСоветов_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗаселенийДомСоветов_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыПроверитьЗаселенияВДомСоветов.Видимость = Ложь;
	Элементы.ЗарплатаСменыЗаселенияВДомСоветовНаДату.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗаселенийСтритАрт_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗаселенийСтритАрт_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыПроверитьЗаселенияВСтритАрт.Видимость = Ложь;
	Элементы.ЗарплатаСменыЗаселенияВСтритАртНаДату.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗавтракиЧехов_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗавтракиЧехов_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗавтракиДомСоветов_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗавтракиДомСоветов_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗавтракиЛайв_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗавтракиЛайв_Э.Видимость = Ложь;
ИначеЕсли ОтельИмя = "Чехов" Тогда
	Элементы.ЗарплатаСменыКоличествоЗаселенийЛайв_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗаселенийЛайв_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыПроверитьЗаселенияВЛайв.Видимость = Ложь;
	Элементы.ЗарплатаСменыЗаселенияВЛайвНаДату.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗавтракиЛайв_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗавтракиЛайв_Э.Видимость = Ложь;
ИначеЕсли ОтельИмя = "Лайв" Тогда
	Элементы.ЗарплатаСменыКоличествоЗаселенийЛайв_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗаселенийЛайв_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыПроверитьЗаселенияВЛайв.Видимость = Ложь;
	Элементы.ЗарплатаСменыЗаселенияВЛайвНаДату.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗаселенийДомСоветов_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗаселенийДомСоветов_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыПроверитьЗаселенияВДомСоветов.Видимость = Ложь;
	Элементы.ЗарплатаСменыЗаселенияВДомСоветовНаДату.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗаселенийСтритАрт_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗаселенийСтритАрт_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыПроверитьЗаселенияВСтритАрт.Видимость = Ложь;
	Элементы.ЗарплатаСменыЗаселенияВСтритАртНаДату.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗавтракиЧехов_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗавтракиЧехов_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗавтракиДомСоветов_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗавтракиДомСоветов_Э.Видимость = Ложь;
Иначе
	Элементы.ЗарплатаСменыКоличествоЗаселенийЛайв_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗаселенийЛайв_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыПроверитьЗаселенияВЛайв.Видимость = Ложь;
	Элементы.ЗарплатаСменыЗаселенияВЛайвНаДату.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗаселенийДомСоветов_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗаселенийДомСоветов_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыПроверитьЗаселенияВДомСоветов.Видимость = Ложь;
	Элементы.ЗарплатаСменыЗаселенияВДомСоветовНаДату.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗаселенийСтритАрт_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗаселенийСтритАрт_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыПроверитьЗаселенияВСтритАрт.Видимость = Ложь;
	Элементы.ЗарплатаСменыЗаселенияВСтритАртНаДату.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗавтракиЧехов_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗавтракиЧехов_Э.Видимость = Ложь;
	
	Элементы.ЗарплатаСменыКоличествоЗавтракиДомСоветов_Э.Видимость = Ложь;
    // + Аудит
	//Элементы.ЗарплатаСменыСуммаЗаселенийДомСоветов_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗавтракиДомСоветов_Э.Видимость = Ложь;
    // - Аудит
	
	Элементы.ЗарплатаСменыКоличествоЗавтракиЛайв_Э.Видимость = Ложь;
	Элементы.ЗарплатаСменыСуммаЗавтракиЛайв_Э.Видимость = Ложь;
КонецЕсли;

//ПриЧтенииНаСервере(Объект);

//ЗаполнитьЗарплатаСмены();
	
УсловноеОформлениеУстановить();

ДН_OldValue = Объект.ДН;
ДК_OldValue = Объект.ДК;

ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр();
ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр; 

Элементы.ЗарплатаСмены.ТолькоПросмотр = ТолькоПросмотр;

Для Каждого Элемент Из Элементы.ЗарплатаСмены.ПодчиненныеЭлементы Цикл
	Если Элемент.Вид = ВидГруппыФормы.ГруппаКолонок Тогда Продолжить; КонецЕсли;
	//Если Элемент = Элементы.ЗарплатаНомерСтроки Тогда Продолжить; КонецЕсли;
	Если Элемент = Элементы.ЗарплатаСменыАдминистратор Тогда Продолжить; КонецЕсли;
	
	Элемент.Ширина = 6;	
КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеУстановить() 
УО = ЭтаФорма.УсловноеОформление; 
УО.Элементы.Очистить(); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыОклад_Э", "ЗарплатаСмены.Оклад_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыСуммаПереработка_Э", "ЗарплатаСмены.СуммаПереработка_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыОтпуск_Э", "ЗарплатаСмены.Отпуск_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыНадбавкаЗаСтаж_Э", "ЗарплатаСмены.НадбавкаЗаСтаж_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыНадбавкаЗаСтандарты_Э", "ЗарплатаСмены.НадбавкаЗаСтандарты_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыНадбавкаЗаИнЯзыки_Э", "ЗарплатаСмены.НадбавкаЗаИнЯзыки_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыСуммаЗаПроживающих_Э", "ЗарплатаСмены.СуммаЗаПроживающих_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыКоличествоЗаселенийЛайв_Э", "ЗарплатаСмены.КоличествоЗаселенийЛайв_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);

//ЭлементУО = УО.Элементы.Добавить(); 
//УсловноеОформлениеПолеДобавить(ЭлементУО, "СуммаСменыЗаселенийЛайв_Э", "ЗарплатаСмены.КоличествоЗаселенийЛайв_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Зеленый);

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыКоличествоЗаселенийДомСоветов_Э", "ЗарплатаСмены.КоличествоЗаселенийДомСоветов_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);

//ЭлементУО = УО.Элементы.Добавить(); 
//УсловноеОформлениеПолеДобавить(ЭлементУО, "СуммаСменыЗаселенийДомСоветов_Э", "ЗарплатаСмены.КоличествоЗаселенийДомСоветов_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Зеленый);

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыКоличествоЗаселенийСтритАрт_Э", "ЗарплатаСмены.КоличествоЗаселенийСтритАрт_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);

//ЭлементУО = УО.Элементы.Добавить(); 
//УсловноеОформлениеПолеДобавить(ЭлементУО, "СуммаСменыЗаселенийСтритАрт_Э", "ЗарплатаСмены.КоличествоЗаселенийСтритАрт_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Зеленый);

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыКоличествоЗавтракиЧехов_Э", "ЗарплатаСмены.КоличествоЗавтракиЧехов_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);

//ЭлементУО = УО.Элементы.Добавить(); 
//УсловноеОформлениеПолеДобавить(ЭлементУО, "СуммаСменыЗавтракиЧехов_Э", "ЗарплатаСмены.КоличествоЗавтракиЧехов_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Зеленый);

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыКоличествоЗавтракиДомСоветов_Э", "ЗарплатаСмены.КоличествоЗавтракиДомСоветов_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);

//ЭлементУО = УО.Элементы.Добавить(); 
//УсловноеОформлениеПолеДобавить(ЭлементУО, "СуммаСменыЗавтракиДомСоветов_Э", "ЗарплатаСмены.КоличествоЗавтракиДомСоветов_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Зеленый);

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСменыКоличествоЗавтракиЛайв_Э", "ЗарплатаСмены.КоличествоЗавтракиЛайв_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);

//ЭлементУО = УО.Элементы.Добавить(); 
//УсловноеОформлениеПолеДобавить(ЭлементУО, "СуммаСменыЗавтракиЛайв_Э", "ЗарплатаСмены.КоличествоЗавтракиЛайв_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Зеленый);

Дата_П = Объект.ДН;
Пока Дата_П <= Объект.ДК Цикл
	Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
	Дата_И = СтрЗаменить(Дата_С, ".", "");
	
	Имя = "КоличествоЗаселенийЛайв_" + Дата_И; 
	ЭлементУО = УО.Элементы.Добавить(); 
	УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСмены" + Имя + "_Э", "ЗарплатаСмены." + Имя + "_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);
	
	Имя = "КоличествоЗаселенийДомСоветов_" + Дата_И; 
	ЭлементУО = УО.Элементы.Добавить(); 
	УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСмены" + Имя + "_Э", "ЗарплатаСмены." + Имя + "_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);
	
	Имя = "КоличествоЗаселенийСтритАрт_" + Дата_И; 
	ЭлементУО = УО.Элементы.Добавить(); 
	УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСмены" + Имя + "_Э", "ЗарплатаСмены." + Имя + "_Р", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный);
	
	Имя = "Оклад_" + Дата_И; 
	ЭлементУО = УО.Элементы.Добавить(); 
	УсловноеОформлениеПолеДобавить(ЭлементУО, "ЗарплатаСмены" + Имя + "_Э", "ЗарплатаСмены." + Имя + "_Есть", Истина, ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 
	
	Дата_П = Дата_П + 24 * 60 * 60;	    
КонецЦикла;

КонецПроцедуры
 
&НаСервере
Процедура УсловноеОформлениеПолеДобавить(ЭлементУО, ИмяПоля, ИмяЛевогоЗначения, ПравоеЗначение, ВидСравнения) 
    
Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить(); 
Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
Оформляемоеполе.Использование = ИСТИНА;  

ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементУсловия.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных(ИмяЛевогоЗначения);
ЭлементУсловия.ПравоеЗначение = ПравоеЗначение;
ЭлементУсловия.ВидСравнения    = ВидСравнения;   
ЭлементУсловия.Использование   = Истина;    
        
КонецПроцедуры
//

//                                           
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ТекстСообщения = "Открытие Зарплата Администраторы
			|
			|Идет загрука данных. 
			|
			|ПОДОЖДИТЕ ...";	
ПараметрыФормы = Новый Структура("ТекстСообщения", ТекстСообщения);
Форма = ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.СообщениеОперация", ПараметрыФормы,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

ЗаполнитьСправочныеДанные();

ТекстОшибки = "";
Если ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)	
Тогда
	ТекстОшибки = ЗаполнитьСправочныеДанныеПоДНиДК();
	ЗаполнитьЗарплатаСмены();
КонецЕсли;

Форма.Закрыть();

Если ТекстОшибки <> "" Тогда
	Сообщить(ТекстОшибки);
КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСправочныеДанные()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Администраторы.Ссылка КАК Администратор,
                      |	Администраторы.ДатаПриема КАК ДатаПриема,
                      |	Администраторы.НеНачислятьЗаСтаж КАК НеНачислятьЗаСтаж,
                      |	Администраторы.АдминистраторКодЛайв КАК АдминистраторКодЛайв,
                      |	Администраторы.АдминистраторКодСтритАрт КАК АдминистраторКодСтритАрт,
                      |	Администраторы.Постоянный КАК Постоянный,
                      |	Администраторы.Начисления.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		ДатаУстановки КАК ДатаУстановки,
                      |		СтавкаЗаСмену12 КАК СтавкаЗаСмену12,
                      |		СтавкаЗаСмену24 КАК СтавкаЗаСмену24,
                      |		СтавкаЗаПереработку КАК СтавкаЗаПереработку,
                      |		НадбавкаЗаСтандарты КАК НадбавкаЗаСтандарты,
                      |		НадбавкаЗаИнЯзыки КАК НадбавкаЗаИнЯзыки,
                      |		СтавкаЗаЗаселение КАК СтавкаЗаЗаселение,
                      |		СтавкаЗаОтпуск КАК СтавкаЗаОтпуск,
                      |		СтавкаЗавтракиЧехов КАК СтавкаЗавтракиЧехов,
                      |		СтавкаЗавтракиДомСоветов КАК СтавкаЗавтракиДомСоветов,
                      |		СтавкаЗавтракиЛайв КАК СтавкаЗавтракиЛайв,
                      |		СуммаОклад КАК СуммаОклад,
                      |		НадбавкаЗаПроживающих КАК НадбавкаЗаПроживающих
                      |	) КАК Начисления
                      |ИЗ
                      |	Справочник.Администраторы КАК Администраторы
                      |ГДЕ
                      |	Администраторы.ПометкаУдаления = ЛОЖЬ
                      |	И Администраторы.НеРаботает = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Администраторы.Сортировка");

ТЗ = Запрос.Выполнить().Выгрузить();
АдминистраторыСправочник.Очистить();
ДатаУчета = Объект.ДК;
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = АдминистраторыСправочник.Добавить();
	                                                    
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	
	Начисления = Строка.Начисления;
	Начисления.Сортировать("ДатаУстановки УБЫВ");
	Для Каждого СтрокаНачисления Из Начисления Цикл
		Если ДатаУчета < СтрокаНачисления.ДатаУстановки Тогда Продолжить; КонецЕсли;		
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНачисления);
		Прервать;
	КонецЦикла;	
КонецЦикла;

ПрочееАдминистратор_СписокВыбора = Элементы.ПрочееАдминистратор.СписокВыбора;

Для Каждого Строка Из АдминистраторыСправочник Цикл
	ПрочееАдминистратор_СписокВыбора.Добавить(Строка.Администратор);
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьСправочныеДанныеПоДНиДК()
ЗаполнитьСправочныеДанныеПоДНиДКНаСервере();	
	
ЗаполнитьПроживающие();
ПроживающиеЗагружены = Истина;

ТекстОшибки = "";	
Если ОтельИмя = "Реноме" Тогда
	Ответ = ЗагрузитьЗаселенияЛайв_HTTP();
	Если Ответ.Ошибка Тогда
		ТекстОшибки = Ответ.ТекстОшибки + Символы.ПС 
			+ "ЗАСЕЛЕНИЯ В ЛАЙВ НЕ ЗАГРУЖЕНЫ";
		ЗаселенияВЛайвЗагружены = Ложь;
	Иначе	
		ЗаселенияВЛайвЗагружены = Истина;
	КонецЕсли;
КонецЕсли;

Если ОтельИмя = "Чехов" Тогда	
	Ответ = ЗагрузитьЗаселенияДомСоветов_HTTP();
	Если Ответ.Ошибка Тогда
		ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Ответ.ТекстОшибки, Символы.ПС);
		ТекстОшибки = ТекстОшибки + Символы.ПС + "ЗАСЕЛЕНИЯ В ДОМ СОВЕТОВ НЕ ЗАГРУЖЕНЫ";
		ЗаселенияВДомСоветовЗагружены = Ложь;
	Иначе	
		ЗаселенияВДомСоветовЗагружены = Истина;
	КонецЕсли;

	Ответ = ЗагрузитьЗаселенияСтритАрт_HTTP();
	Если Ответ.Ошибка Тогда
		ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Ответ.ТекстОшибки, Символы.ПС);
		ТекстОшибки = ТекстОшибки + Символы.ПС + "ЗАСЕЛЕНИЯ В СТРИТ АРТ НЕ ЗАГРУЖЕНЫ";
	ЗаселенияВДомСоветовЗагружены = Ложь;
	Иначе	
		ЗаселенияВСтритАртЗагружены = Истина;
	КонецЕсли;
КонецЕсли;

Возврат ТекстОшибки;
КонецФункции	

&НаСервере
Процедура ЗаполнитьСправочныеДанныеПоДНиДКНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	АдминистраторыНадбавкаЗаСтаж.ДатаНазначения КАК ДатаНазначения,
                      |	АдминистраторыНадбавкаЗаСтаж.РазницаВДняхС КАК РазницаВДняхС,
                      |	АдминистраторыНадбавкаЗаСтаж.РазницаВДняхПо КАК РазницаВДняхПо,
                      |	АдминистраторыНадбавкаЗаСтаж.Сумма КАК Сумма
                      |ИЗ
                      |	РегистрСведений.АдминистраторыНадбавкаЗаСтаж КАК АдминистраторыНадбавкаЗаСтаж
                      |ГДЕ
                      |	АдминистраторыНадбавкаЗаСтаж.ДатаНазначения <= &ДатаНазначения
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаНазначения УБЫВ,
                      |	РазницаВДняхС");

ДатаУчета = Объект.ДК;
Запрос.УстановитьПараметр("ДатаНазначения", ДатаУчета);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() > 0 Тогда 
	АдминистраторыНадбавкаЗаСтаж.Очистить();
	ДатаНазначения = ТЗ[0].ДатаНазначения;
	Для Каждого Строка Из ТЗ Цикл
		Если Строка.ДатаНазначения <> ДатаНазначения Тогда Прервать; КонецЕсли;
		
		НоваяСтрока = АдминистраторыНадбавкаЗаСтаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	КонецЦикла;
КонецЕсли;
//

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	АдминистраторыСуммаЗаПроживающих.ДатаНазначения КАК ДатаНазначения,
                      |	АдминистраторыСуммаЗаПроживающих.КоличествоНомеровС КАК КоличествоНомеровС,
                      |	АдминистраторыСуммаЗаПроживающих.КоличествоНомеровПо КАК КоличествоНомеровПо,
                      |	АдминистраторыСуммаЗаПроживающих.Сумма_12 КАК Сумма_12,
                      |	АдминистраторыСуммаЗаПроживающих.Сумма_24 КАК Сумма_24
                      |ИЗ
                      |	РегистрСведений.АдминистраторыСуммаЗаПроживающих КАК АдминистраторыСуммаЗаПроживающих
                      |ГДЕ
                      |	АдминистраторыСуммаЗаПроживающих.ДатаНазначения <= &ДатаНазначения
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаНазначения УБЫВ,
                      |	КоличествоНомеровС");

ДатаУчета = Объект.ДК;
Запрос.УстановитьПараметр("ДатаНазначения", ДатаУчета);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() > 0 Тогда 
	АдминистраторыСуммаЗаПроживающих.Очистить();
	ДатаНазначения = ТЗ[0].ДатаНазначения;
	Для Каждого Строка Из ТЗ Цикл
		Если Строка.ДатаНазначения <> ДатаНазначения Тогда Прервать; КонецЕсли;
		
		НоваяСтрока = АдминистраторыСуммаЗаПроживающих.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	КонецЦикла;
КонецЕсли;
//

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗарплатаСмены()
//Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 

ДН_П = НачалоМесяца(Объект.ДН);
ДК_П = КонецМесяца(Объект.ДК);
	
ДобавляемыеРеквизиты = РеквизитыЗарплатаСмены(ДН_П, ДК_П);

Дата_П = ДН_П;
Пока Дата_П <= ДК_П Цикл
	Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
	Дата_И = СтрЗаменить(Дата_С, ".", "");
	
	//
	Имя = "Часы_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(4))
		, "ЗарплатаСмены_OldValue");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	Имя = "НомерСмены_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(1, 0))
		, "ЗарплатаСмены_OldValue");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	Имя = "ДлинаСмены_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(2, 0))
		, "ЗарплатаСмены_OldValue");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	Имя = "ПереработкаЧасы_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(2, 0))
		, "ЗарплатаСмены_OldValue");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	//
	
	Дата_П = Дата_П + 24 * 60 * 60;	
КонецЦикла;	
// Добавим новые реквизиты в форму
ИзменитьРеквизиты(ДобавляемыеРеквизиты);	

ЭлементТаблицаИмя = "ЗарплатаСмены";
Дата_П = Объект.ДН;
Пока Дата_П <= Объект.ДК Цикл
	Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
	Дата_И = СтрЗаменить(Дата_С, ".", "");
	
	Имя = ЭлементТаблицаИмя + "Группа1_" + Дата_И;  
	ГруппаФормы1 = Элементы.Добавить(Имя, Тип("ГруппаФормы"), Элементы.ЗарплатаСмены);

  	ГруппаФормы1.Вид                        = ВидГруппыФормы.ГруппаКолонок;
    ГруппаФормы1.Группировка                = ГруппировкаКолонок.Вертикальная;
	
	Имя = ЭлементТаблицаИмя + "Группа2_" + Дата_И;  
	ГруппаФормы2 = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаФормы1);
  	ГруппаФормы2.Вид                        = ВидГруппыФормы.ГруппаКолонок;
    ГруппаФормы2.Группировка                = ГруппировкаКолонок.Горизонтальная;
	
	ИмяРеквизита = "Дата_" + Дата_И;
    ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок                    = Дата_С;
	НовыйЭлемент.Формат = "ДФ=dd.MM.yy";
	НовыйЭлемент.Ширина		                  = 7;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр; 
	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.Шрифт = Новый Шрифт(,,Истина);
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "НомерСмены_ПриИзменении");	
	
	ИмяРеквизита = "НомерСмены_" + Дата_И;
    ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок                    = "Смена";
	НовыйЭлемент.Ширина		                  = 5;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр; 
	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.Шрифт = Новый Шрифт(,,Истина);
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
	//НовыйЭлемент.ТолькоПросмотр               = Истина;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "НомерСмены_ПриИзменении");	
	
	ИмяРеквизита = "ДлинаСмены_" + Дата_И;
    ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок                    = "Длит.";
	НовыйЭлемент.Ширина		                  = 5;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр; 
	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр; 
	//НовыйЭлемент.ТолькоПросмотр               = Истина;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ДлинаСмены_ПриИзменении");	
	
   	ИмяРеквизита = "ПереработкаЧасы_" + Дата_И;
    ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок                    = "Кол" + Символы.ПС + "Пер.";
	НовыйЭлемент.Ширина		                  = 5;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр; 
	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр; 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПереработкаЧасы_ПриИзменении");	
	
	ИмяРеквизита = "КоличествоЗаселенийЛайв_" + Дата_И + "_Э";
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Кол. Лайв";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КоличествоЗаселенийЛайв_ЭПриИзменении");	
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.УстановитьДействие("Очистка", "КоличествоЗаселенийЛайв_ЭОчистка");	
	Если ОтельИмя <> "Реноме" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;
	
	ИмяРеквизита = "КоличествоЗаселенийДомСоветов_" + Дата_И + "_Э";
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Кол. ДС";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КоличествоЗаселенийДомСоветов_ЭПриИзменении");	
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.УстановитьДействие("Очистка", "КоличествоЗаселенийДомСоветов_ЭОчистка");		
	Если ОтельИмя <> "Чехов" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;
	
	ИмяРеквизита = "КоличествоЗаселенийСтритАрт_" + Дата_И + "_Э";
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Кол. СА";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КоличествоЗаселенийСтритАрт_ЭПриИзменении");	
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.УстановитьДействие("Очистка", "КоличествоЗаселенийСтритАрт_ЭОчистка");
	Если ОтельИмя <> "Чехов" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;
	
	ИмяРеквизита = "КоличествоЗавтракиЧехов_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "КЗ. Чех.";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
//	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КоличествоЗавтракиЧехов_ЭПриИзменении");	
	НовыйЭлемент.КнопкаОчистки = Ложь;
	//НовыйЭлемент.УстановитьДействие("Очистка", "КоличествоЗавтракиЧехов_ЭОчистка");
	Если ОтельИмя <> "Чехов" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;
	
	ИмяРеквизита = "КоличествоЗавтракиДомСоветов_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "КЗ. ДС";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
//	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КоличествоЗавтракиДомСоветов_ЭПриИзменении");	
	НовыйЭлемент.КнопкаОчистки = Ложь;
	//НовыйЭлемент.УстановитьДействие("Очистка", "КоличествоЗавтракиДомСоветов_ЭОчистка");
	Если ОтельИмя <> "Чехов" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;

	ИмяРеквизита = "КоличествоЗавтракиЛайв_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы2);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "КЗ. Лайв";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
//	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КоличествоЗавтракиДомСоветов_ЭПриИзменении");	
	НовыйЭлемент.КнопкаОчистки = Ложь;
	//НовыйЭлемент.УстановитьДействие("Очистка", "КоличествоЗавтракиДомСоветов_ЭОчистка");
	Если ОтельИмя <> "Лайв" Тогда НовыйЭлемент.Видимость = Ложь; КонецЕсли;
	
	Имя = ЭлементТаблицаИмя + "Группа3_" + Дата_И;  
	ГруппаФормы3 = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаФормы1);
  	ГруппаФормы3.Вид                        = ВидГруппыФормы.ГруппаКолонок;
    ГруппаФормы3.Группировка                = ГруппировкаКолонок.Горизонтальная;

    ИмяРеквизита = "Итого_" + Дата_И;
    ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Итог";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	НовыйЭлемент.Шрифт = Новый Шрифт(,,Истина);
	НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
	
    ИмяРеквизита = "Оклад_" + Дата_И + "_Э";
    ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Окл.";
	НовыйЭлемент.Ширина		                  = 5;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	//НовыйЭлемент.ТолькоПросмотр               = Истина;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Оклад_ЭПриИзменении");
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.УстановитьДействие("Очистка", "Оклад_ЭОчистка");		
	
	ИмяРеквизита = "СуммаЗаПроживающих_" + Дата_И;
	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
	НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
	НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок                    = "Прож.";
	НовыйЭлемент.Ширина		                  = 5;
	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	
    ИмяРеквизита = "СуммаПереработка_" + Дата_И;
    ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Пер.";
	НовыйЭлемент.Ширина		                  = 5;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	
	ИмяРеквизита = "СуммаЗаселенийЛайв_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Лайв";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	Если ОтельИмя <> "Реноме" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;
	
	ИмяРеквизита = "СуммаЗаселенийДомСоветов_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "ДС";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	Если ОтельИмя <> "Чехов" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;
	
	ИмяРеквизита = "СуммаЗаселенийСтритАрт_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "СА";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	Если ОтельИмя <> "Чехов" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;

	ИмяРеквизита = "СуммаЗавтракиЧехов_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Зав. Чех.";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	Если ОтельИмя <> "Чехов" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;

	ИмяРеквизита = "СуммаЗавтракиДомСоветов_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Зав. ДС";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	Если ОтельИмя <> "Чехов" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;
	
	ИмяРеквизита = "СуммаЗавтракиЛайв_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы3);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Зав. Лайв";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Истина;
	Если ОтельИмя <> "Лайв" Тогда	НовыйЭлемент.Видимость = Ложь; КонецЕсли;
	
	Имя = ЭлементТаблицаИмя + "Группа4_" + Дата_И;  
	ГруппаФормы4 = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ГруппаФормы1);
  	ГруппаФормы4.Вид                        = ВидГруппыФормы.ГруппаКолонок;
    ГруппаФормы4.Группировка                = ГруппировкаКолонок.Горизонтальная;
	
	ИмяРеквизита = "СуммаДопУслуги_" + Дата_И;
   	ИмяЭлемента = ЭлементТаблицаИмя + ИмяРеквизита;
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы4);
    НовыйЭлемент.ПутьКДанным                  = ЭлементТаблицаИмя + "." + ИмяРеквизита;
    НовыйЭлемент.Вид                          = ВидПоляФормы.ПолеВвода;
   	НовыйЭлемент.Заголовок                    = "Доп. Усл";
	НовыйЭлемент.Ширина		                  = 7;
 	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ТолькоПросмотр               = Ложь;
	
	Дата_П = Дата_П + 24 * 60 * 60;	
КонецЦикла;	

ЗарплатаОбъект = Объект.Зарплата;
ЗарплатаСменыОбъект = Объект.ЗарплатаСмены;

ЗарплатаСмены.Очистить();
Для Каждого Строка Из АдминистраторыСправочник Цикл
	НоваяСтрока = ЗарплатаСмены.Добавить();
	НоваяСтрока.Администратор = Строка.Администратор;
	
	ОтборСтроки = Новый Структура("Администратор", Строка.Администратор); 
	НайденныеСтроки = ЗарплатаОбъект.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		НайденнаяСтрока = НайденныеСтроки[0]; 
		
		НоваяСтрока.Оклад = НайденнаяСтрока.Оклад;	
		НоваяСтрока.Оклад_Р = НайденнаяСтрока.Оклад_Р;	
		НоваяСтрока.Оклад_Есть = НайденнаяСтрока.Оклад_Есть;
		
		НоваяСтрока.Отпуск = НайденнаяСтрока.Отпуск;	
		НоваяСтрока.Отпуск_Р = НайденнаяСтрока.Отпуск_Р;	
		НоваяСтрока.Отпуск_Есть = НайденнаяСтрока.Отпуск_Есть;
		
		НоваяСтрока.СуммаПереработка = НайденнаяСтрока.СуммаПереработка;	
		НоваяСтрока.СуммаПереработка_Р = НайденнаяСтрока.СуммаПереработка_Р;	
		НоваяСтрока.СуммаПереработка_Есть = НайденнаяСтрока.СуммаПереработка_Есть;
		
		НоваяСтрока.НадбавкаЗаСтаж = НайденнаяСтрока.НадбавкаЗаСтаж;	
		НоваяСтрока.НадбавкаЗаСтаж_Р = НайденнаяСтрока.НадбавкаЗаСтаж_Р;	
		НоваяСтрока.НадбавкаЗаСтаж_Есть = НайденнаяСтрока.НадбавкаЗаСтаж_Есть;
		
		НоваяСтрока.НадбавкаЗаСтандарты = НайденнаяСтрока.НадбавкаЗаСтандарты;	
		НоваяСтрока.НадбавкаЗаСтандарты_Р = НайденнаяСтрока.НадбавкаЗаСтандарты_Р;	
		НоваяСтрока.НадбавкаЗаСтандарты_Есть = НайденнаяСтрока.НадбавкаЗаСтандарты_Есть;
		
		НоваяСтрока.НадбавкаЗаИнЯзыки = НайденнаяСтрока.НадбавкаЗаИнЯзыки;	
		НоваяСтрока.НадбавкаЗаИнЯзыки_Р = НайденнаяСтрока.НадбавкаЗаИнЯзыки_Р;	
		НоваяСтрока.НадбавкаЗаИнЯзыки_Есть = НайденнаяСтрока.НадбавкаЗаИнЯзыки_Есть;
		
		НоваяСтрока.КоличествоСмен = НайденнаяСтрока.КоличествоСмен;
		НоваяСтрока.КоличествоЧасов = НайденнаяСтрока.КоличествоЧасов;
		
		НоваяСтрока.СуммаЗаПроживающих = НайденнаяСтрока.СуммаЗаПроживающих;	
		НоваяСтрока.СуммаЗаПроживающих_Р = НайденнаяСтрока.СуммаЗаПроживающих_Р;	
		НоваяСтрока.СуммаЗаПроживающих_Есть = НайденнаяСтрока.СуммаЗаПроживающих_Есть;
		
		НоваяСтрока.КоличествоЗаселенийЛайв = НайденнаяСтрока.КоличествоЗаселенийЛайв;	
		НоваяСтрока.КоличествоЗаселенийЛайв_Р = НайденнаяСтрока.КоличествоЗаселенийЛайв_Р;	
		
		НоваяСтрока.СуммаЗаселенийЛайв = НайденнаяСтрока.СуммаЗаселенийЛайв;	
		НоваяСтрока.СуммаЗаселенийЛайв_Р = НайденнаяСтрока.СуммаЗаселенийЛайв_Р;
		
		НоваяСтрока.КоличествоЗаселенийДомСоветов = НайденнаяСтрока.КоличествоЗаселенийДомСоветов;	
		НоваяСтрока.КоличествоЗаселенийДомСоветов_Р = НайденнаяСтрока.КоличествоЗаселенийДомСоветов_Р;	
		
		НоваяСтрока.СуммаЗаселенийДомСоветов = НайденнаяСтрока.СуммаЗаселенийДомСоветов;	
		НоваяСтрока.СуммаЗаселенийДомСоветов_Р = НайденнаяСтрока.СуммаЗаселенийДомСоветов_Р;
		
		НоваяСтрока.КоличествоЗаселенийСтритАрт = НайденнаяСтрока.КоличествоЗаселенийСтритАрт;	
		НоваяСтрока.КоличествоЗаселенийСтритАрт_Р = НайденнаяСтрока.КоличествоЗаселенийСтритАрт_Р;	
		
		НоваяСтрока.СуммаЗаселенийСтритАрт = НайденнаяСтрока.СуммаЗаселенийСтритАрт;	
		НоваяСтрока.СуммаЗаселенийСтритАрт_Р = НайденнаяСтрока.СуммаЗаселенийСтритАрт_Р;
		
		НоваяСтрока.КоличествоЗавтракиЧехов = НайденнаяСтрока.КоличествоЗавтракиЧехов;	
		НоваяСтрока.КоличествоЗавтракиЧехов_Р = НайденнаяСтрока.КоличествоЗавтракиЧехов_Р;	
		
		НоваяСтрока.СуммаЗавтракиЧехов = НайденнаяСтрока.СуммаЗавтракиЧехов;	
		НоваяСтрока.СуммаЗавтракиЧехов_Р = НайденнаяСтрока.СуммаЗавтракиЧехов_Р;
		
		НоваяСтрока.КоличествоЗавтракиДомСоветов = НайденнаяСтрока.КоличествоЗавтракиДомСоветов;	
		НоваяСтрока.КоличествоЗавтракиДомСоветов_Р = НайденнаяСтрока.КоличествоЗавтракиДомСоветов_Р;	
		
		НоваяСтрока.СуммаЗавтракиДомСоветов = НайденнаяСтрока.СуммаЗавтракиДомСоветов;	
		НоваяСтрока.СуммаЗавтракиДомСоветов_Р = НайденнаяСтрока.СуммаЗавтракиДомСоветов_Р;
		
		НоваяСтрока.КоличествоЗавтракиЛайв = НайденнаяСтрока.КоличествоЗавтракиЛайв;	
		НоваяСтрока.КоличествоЗавтракиЛайв_Р = НайденнаяСтрока.КоличествоЗавтракиЛайв_Р;	
		
		НоваяСтрока.СуммаЗавтракиЛайв = НайденнаяСтрока.СуммаЗавтракиЛайв;	
		НоваяСтрока.СуммаЗавтракиЛайв_Р = НайденнаяСтрока.СуммаЗавтракиЛайв_Р;
		
		НоваяСтрока.ДопУслуги = НайденнаяСтрока.ДопУслуги;
		НоваяСтрока.Больничный = НайденнаяСтрока.Больничный;
		НоваяСтрока.Премия = НайденнаяСтрока.Премия;
		
		НоваяСтрока.СуммаПрочее = НайденнаяСтрока.СуммаПрочее;
		
		НоваяСтрока.АвансНал = НайденнаяСтрока.АвансНал;
		НоваяСтрока.АвансКарта = НайденнаяСтрока.АвансКарта;
		
		НоваяСтрока.ОтпускныеКарта = НайденнаяСтрока.ОтпускныеКарта;
		НоваяСтрока.ЗПКарта = НайденнаяСтрока.ЗПКарта;
		НоваяСтрока.ИныеВыплатыНал = НайденнаяСтрока.ИныеВыплатыНал;
		НоваяСтрока.ИныеВыплатыКарта = НайденнаяСтрока.ИныеВыплатыКарта;

		НоваяСтрока.СуммаМинимум = НайденнаяСтрока.СуммаМинимум;
	КонецЕсли;
	
	Дата_П = ДН_П;
	Пока Дата_П <= ДК_П Цикл
		Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
		Дата_И = СтрЗаменить(Дата_С, ".", "");
		
		Имя = "Дата_" + Дата_И;
		НоваяСтрока[Имя] = Дата_П;
		
		Дата_П = Дата_П + 24 * 60 * 60;
	КонецЦикла;
	
	НоваяСтрока_OldValue = ЗарплатаСмены_OldValue.Добавить();
	НоваяСтрока_OldValue.Администратор = Строка.Администратор;
	
	ОтборСтроки = Новый Структура("Администратор", Строка.Администратор); 
	НайденныеСтроки = ЗарплатаСменыОбъект.НайтиСтроки(ОтборСтроки);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		НомерСмены = НайденнаяСтрока.НомерСмены;
		ПереработкаЧасы = НайденнаяСтрока.ПереработкаЧасы;
		
		КоличествоЗавтракиЧехов = НайденнаяСтрока.КоличествоЗавтракиЧехов;
		КоличествоЗавтракиДомСоветов = НайденнаяСтрока.КоличествоЗавтракиДомСоветов;
		КоличествоЗавтракиЛайв = НайденнаяСтрока.КоличествоЗавтракиЛайв;
		СуммаДопУслуги = НайденнаяСтрока.СуммаДопУслуги;
		
		Если НомерСмены = 0 И ПереработкаЧасы = 0 
		И КоличествоЗавтракиЧехов = 0 И КоличествоЗавтракиДомСоветов = 0 И КоличествоЗавтракиЛайв = 0 
		И СуммаДопУслуги = 0 
		Тогда Продолжить; КонецЕсли;
		
		Дата_П = НайденнаяСтрока.ДатаСмены;
		
		Если Дата_П < Объект.ДН Тогда Продолжить; КонецЕсли;
		Если Дата_П > Объект.ДК Тогда Продолжить; КонецЕсли;
		
		Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
		Дата_И = СтрЗаменить(Дата_С, ".", "");
		
		Имя = "Дата_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.ДатаСмены;
		
		Имя = "Часы_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.Часы;
		
		Имя = "НомерСмены_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.НомерСмены;
		
		Имя = "ДлинаСмены_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.ДлинаСмены;
	
		Имя = "ПереработкаЧасы_" + Дата_И;
		НоваяСтрока[Имя] = ПереработкаЧасы;
		
		Имя = "Оклад_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.Оклад;                          
		
		Имя = "Оклад_" + Дата_И + "_Р";
		НоваяСтрока[Имя] = НайденнаяСтрока.Оклад_Р;
		
		Имя = "Оклад_" + Дата_И + "_Есть";
		НоваяСтрока[Имя] = НайденнаяСтрока.Оклад_Есть;
		
		Имя = "СуммаПереработка_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.СуммаПереработка;
		
		Имя = "СуммаЗаПроживающих_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.СуммаЗаПроживающих;
		
		Имя = "КоличествоЗаселенийЛайв_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.КоличествоЗаселенийЛайв;
		
		Имя = "КоличествоЗаселенийЛайв_" + Дата_И +"_Р";
		НоваяСтрока[Имя] = НайденнаяСтрока.КоличествоЗаселенийЛайв_Р;
		
		Имя = "СуммаЗаселенийЛайв_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.СуммаЗаселенийЛайв;
		
		Имя = "КоличествоЗаселенийДомСоветов_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.КоличествоЗаселенийДомСоветов;
		
		Имя = "КоличествоЗаселенийДомСоветов_" + Дата_И +"_Р";
		НоваяСтрока[Имя] = НайденнаяСтрока.КоличествоЗаселенийДомСоветов_Р;
		
		Имя = "СуммаЗаселенийДомСоветов_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.СуммаЗаселенийДомСоветов;
		
		Имя = "КоличествоЗаселенийСтритАрт_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.КоличествоЗаселенийСтритАрт;
		
		Имя = "КоличествоЗаселенийСтритАрт_" + Дата_И +"_Р";
		НоваяСтрока[Имя] = НайденнаяСтрока.КоличествоЗаселенийСтритАрт_Р;
		
		Имя = "СуммаЗаселенийСтритАрт_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.СуммаЗаселенийСтритАрт;
		
		Имя = "КоличествоЗавтракиЧехов_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.КоличествоЗавтракиЧехов;
		
		Имя = "СуммаЗавтракиЧехов_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.СуммаЗавтракиЧехов;
		
		Имя = "КоличествоЗавтракиДомСоветов_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.КоличествоЗавтракиДомСоветов;
		
		Имя = "СуммаЗавтракиДомСоветов_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.СуммаЗавтракиДомСоветов;
		
		Имя = "КоличествоЗавтракиЛайв_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.КоличествоЗавтракиЛайв;
		
		Имя = "СуммаЗавтракиЛайв_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.СуммаЗавтракиЛайв;
		
		Имя = "СуммаДопУслуги_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.СуммаДопУслуги;
		
		Имя = "Итого_" + Дата_И;
		НоваяСтрока[Имя] = НайденнаяСтрока.Оклад + НайденнаяСтрока.СуммаПереработка 
			+ НайденнаяСтрока.СуммаЗаПроживающих 
			+ НайденнаяСтрока.СуммаЗаселенийЛайв
			+ НайденнаяСтрока.СуммаЗаселенийДомСоветов
			+ НайденнаяСтрока.СуммаЗаселенийСтритАрт
			+ НайденнаяСтрока.СуммаЗавтракиЧехов
			+ НайденнаяСтрока.СуммаЗавтракиДомСоветов
			+ НайденнаяСтрока.СуммаЗавтракиЛайв
			+ НайденнаяСтрока.СуммаДопУслуги
			;
		//
		Имя = "Часы_" + Дата_И;
		НоваяСтрока_OldValue[Имя] = НайденнаяСтрока.Часы;
		
		Имя = "НомерСмены_" + Дата_И;
		НоваяСтрока_OldValue[Имя] = НайденнаяСтрока.НомерСмены;
		
		Имя = "ДлинаСмены_" + Дата_И;
		НоваяСтрока_OldValue[Имя] = НайденнаяСтрока.ДлинаСмены;
		
		Имя = "ПереработкаЧасы_" + Дата_И;
        // + Аудит
		//НоваяСтрока_OldValue[Имя] = НайденнаяСтрока.ДлинаСмены;
		НоваяСтрока_OldValue[Имя] = НайденнаяСтрока.ПереработкаЧасы;
        // - Аудит
		//
	КонецЦикла;
	
	ОбновитьСтрокаЗарплатыСмена(НоваяСтрока);
КонецЦикла;
Конецпроцедуры

&НаСервере
Функция РеквизитыЗарплатаСмены(ДН, ДК)
Реквизиты	= Новый Массив;

Если НЕ (ЗначениеЗаполнено(ДН) И ЗначениеЗаполнено(ДК)) Тогда Возврат Реквизиты; КонецЕсли;

Дата_П = ДН;
Пока Дата_П <= ДК Цикл
	Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
	Дата_И = СтрЗаменить(Дата_С, ".", "");
	
	Имя = "Дата_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Дата", ,,, Новый КвалификаторыДаты(ЧастиДаты.Дата))
		, "ЗарплатаСмены", Дата_С );
	Реквизиты.Добавить(НовыйРеквизит);		
		
	Имя = "Часы_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(7))
		, "ЗарплатаСмены", "Смена");
	Реквизиты.Добавить(НовыйРеквизит);		
	
	Имя = "НомерСмены_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(1, 0))
		, "ЗарплатаСмены", "Номер Смены");
	Реквизиты.Добавить(НовыйРеквизит);		
	
	Имя = "ДлинаСмены_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(2, 0))
		, "ЗарплатаСмены", "Длина Смены");
	Реквизиты.Добавить(НовыйРеквизит);		
	
	Имя = "ПереработкаЧасы_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(2, 0))
		, "ЗарплатаСмены", "Переработка");
	Реквизиты.Добавить(НовыйРеквизит);		
	
	Имя = "СуммаПереработка_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Сумма Переработка");
	Реквизиты.Добавить(НовыйРеквизит);	
	
	Имя = "Оклад_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Оклад");
	Реквизиты.Добавить(НовыйРеквизит);		
	
	Имя = "Оклад_" + Дата_И + "_Р";
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Оклад");
	Реквизиты.Добавить(НовыйРеквизит);	
	
	Имя = "Оклад_" + Дата_И + "_Есть";
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Булево")
		, "ЗарплатаСмены", "Оклад");
	Реквизиты.Добавить(НовыйРеквизит);	
	
	Имя = "Оклад_" + Дата_И + "_Э";
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Оклад");
	Реквизиты.Добавить(НовыйРеквизит);	
	
	Имя = "СуммаЗаПроживающих_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Сумма За Проживающих");
	Реквизиты.Добавить(НовыйРеквизит);		
	
	Имя = "КоличествоЗаселенийЛайв_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Заселений Лайв И");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗаселенийЛайв_" + Дата_И + "_Р";
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Заселений Лайв Р");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗаселенийЛайв_" + Дата_И + "_Э";
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Заселений Лайв");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "СуммаЗаселенийЛайв_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Сумма Заселений Лайв");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗаселенийДомСоветов_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Заселений Дом советов И");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗаселенийДомСоветов_" + Дата_И + "_Р";
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Заселений Дом советов Р");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗаселенийДомСоветов_" + Дата_И + "_Э";
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Заселений Дом Советов");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "СуммаЗаселенийДомСоветов_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Сумма Заселений Дом Советов");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗаселенийСтритАрт_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Заселений СтритАрт И");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗаселенийСтритАрт_" + Дата_И + "_Р";
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Заселений СтритАрт Р");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗаселенийСтритАрт_" + Дата_И + "_Э";
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Заселений СтритАрт");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "СуммаЗаселенийСтритАрт_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Сумма Заселений СтритАрт");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗавтракиЧехов_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 1))
		, "ЗарплатаСмены", "Количество Завтраки Чехов И");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "СуммаЗавтракиЧехов_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Сумма Завтраки Чехов");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗавтракиДомСоветов_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Завтраки Дом Советов И");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "СуммаЗавтракиДомСоветов_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Сумма Завтраки Дом Советов");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "КоличествоЗавтракиЛайв_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Количество Завтраки Лайв И");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "СуммаЗавтракиЛайв_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Сумма Завтраки Лайв");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "СуммаДопУслуги_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Сумма Доп. Услуги");
	Реквизиты.Добавить(НовыйРеквизит);
	
	Имя = "Итого_" + Дата_И;
	НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("Число")
		, "ЗарплатаСмены", "Итого");
	Реквизиты.Добавить(НовыйРеквизит);	
	
	Дата_П = Дата_П + 24 * 60 * 60;	
КонецЦикла;	

Возврат Реквизиты;
КонецФункции

&НаСервере
Процедура ЗаполнитьПроживающие()
Запрос =	Новый Запрос ("ВЫБРАТЬ
        	              |	НомернойФонд.Ссылка КАК НомерВРезерв,
        	              |	ЗаявкаДанные.Ссылка КАК Заявка,
        	              |	ЗаявкаДанные.ДеньПроживанияМинимум КАК ДеньПроживанияМинимум,
        	              |	ЗаявкаДанные.ДеньПроживанияМаксимум КАК ДеньПроживанияМаксимум
        	              |ИЗ
        	              |	Справочник.НомернойФонд КАК НомернойФонд
        	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |			ЗаявкаНаБронирование.Ссылка КАК Ссылка,
        	              |			ЗаявкаНаБронирование.НомерВРезерв КАК НомерВРезерв,
        	              |			ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДеньПроживанияМинимум,
        	              |			ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) КАК ДеньПроживанияМаксимум
        	              |		ИЗ
        	              |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
        	              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        	              |					ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
        	              |					МИНИМУМ(ЗаявкаНаБронированиеПроживание.ДеньПроживания) КАК ДеньПроживанияМинимум,
        	              |					МАКСИМУМ(ЗаявкаНаБронированиеПроживание.ДеньПроживания) КАК ДеньПроживанияМаксимум
        	              |				ИЗ
        	              |					Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
        	              |				
        	              |				СГРУППИРОВАТЬ ПО
        	              |					ЗаявкаНаБронированиеПроживание.Ссылка) КАК Проживания
        	              |				ПО ЗаявкаНаБронирование.Ссылка = Проживания.Ссылка
        	              |		ГДЕ
        	              |			ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
        	              |			И ВЫБОР
        	              |					КОГДА &ТипДатаС = ""ВсеЗаПериод""
        	              |							ИЛИ &ТипДатаПо = ""ВсеЗаПериод""
        	              |						ТОГДА ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |								И ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |					ИНАЧЕ ВЫБОР
        	              |								КОГДА &ТипДатаС = ""ДатаВыезда""
        	              |									ТОГДА ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |								ИНАЧЕ ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) >= &ДатаОтчетаС
        	              |							КОНЕЦ
        	              |							И ВЫБОР
        	              |								КОГДА &ТипДатаПо = ""ДатаВыезда""
        	              |									ТОГДА ЕСТЬNULL(Проживания.ДеньПроживанияМаксимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |								ИНАЧЕ ЕСТЬNULL(Проживания.ДеньПроживанияМинимум, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтчетаПо
        	              |							КОНЕЦ
        	              |				КОНЕЦ
        	              |			И (ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
        	              |					ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает))) КАК ЗаявкаДанные
        	              |		ПО НомернойФонд.Ссылка = ЗаявкаДанные.НомерВРезерв
        	              |ГДЕ
        	              |	НомернойФонд.ПометкаУдаления = ЛОЖЬ
        	              |
        	              |УПОРЯДОЧИТЬ ПО
        	              |	НомернойФонд.Наименование,
        	              |	Заявка");

Запрос.УстановитьПараметр("ДатаОтчетаС", Объект.ДН);
Запрос.УстановитьПараметр("ДатаОтчетаПо", Объект.ДК);
Запрос.УстановитьПараметр("ТипДатаС", "ВсеЗаПериод");
Запрос.УстановитьПараметр("ТипДатаПо", "ВсеЗаПериод");

БронируетОтбор = Справочники.Клиенты.ПустаяСсылка();
Запрос.УстановитьПараметр("БронируетОтбор", БронируетОтбор);

ТЗ_Заявки = Запрос.Выполнить().Выгрузить();

Заявки = ТЗ_Заявки.ВыгрузитьКолонку("Заявка");

ТЗ_ПроживаниеЗаявки = ОтчетыСервер.ТЗ_ПроживаниеЗаявки(Заявки);

ИтогиДень = Новый Структура();
ИтогиДень.Вставить("КоличествоСутокТариф", 0);

Проживающие.Очистить();

Дата_П = Объект.ДН;
Пока Дата_П <=Объект.ДК Цикл
	
	Если ТЗ_Заявки.Количество() = 0 Тогда Перейти ~ПРОДОЛЖИТЬ_ДатаОтчетаПо; КонецЕсли;
	
	ИтогиДень.КоличествоСутокТариф = 0;
	
	Для Каждого СтрокаЗаявка Из ТЗ_Заявки Цикл
		КоличествоСутокТариф = 0;
		
		Если НЕ (СтрокаЗаявка.ДеньПроживанияМинимум <= Дата_П И СтрокаЗаявка.ДеньПроживанияМаксимум >= Дата_П) Тогда 
			Продолжить; 
		КонецЕсли; 
		
		ТЗ_Проживание = ОтчетыСервер.ТЗ_ПроживаниеЗаявкаДеньПроживания(ТЗ_ПроживаниеЗаявки, СтрокаЗаявка.Заявка, Дата_П);
		
		Если ТЗ_Проживание.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		ТЗ_ПроживаниеКоличество = ТЗ_Проживание.Количество();
		Если ТЗ_ПроживаниеКоличество = 0 Тогда  		
			СтрокаПроживание = ОбщийФункционалСервер.СтруктураИзТаблицы(ТЗ_Проживание);
			
			СтрокаПроживание.Цена = 0;
			СтрокаПроживание.Количество = 0;
			СтрокаПроживание.СуммаБезСкидки = 0;
			СтрокаПроживание.Сумма = 0;
		Иначе		
			СтрокаПроживание = ТЗ_Проживание[0];
		КонецЕсли;
		
		КоличествоСутокТариф = СтрокаПроживание.Количество;
		
		ИтогиДень.КоличествоСутокТариф = ИтогиДень.КоличествоСутокТариф + КоличествоСутокТариф;
	КонецЦикла;
	
	НоваяСтрока = Проживающие.Добавить();
	
	НоваяСтрока.Дата = Дата_П;
	НоваяСтрока.КоличествоНомеров = ИтогиДень.КоличествоСутокТариф;

~ПРОДОЛЖИТЬ_ДатаОтчетаПо:	
	Дата_П = Дата_П + 60*60*24;	
КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьЗаселенияЛайв_HTTP()
Ответ = Новый Структура("Ошибка, ТекстОшибки", Ложь, "");	
	
Результат = HTTP_Модуль.ПолучитьЗаселения(Объект.ДН, Объект.ДК, "СерверЛайвHTTP");
Если Результат.Ошибка Тогда
	Ответ.Ошибка = Истина;
	Ответ.ТекстОшибки = "Ошибка соединения с HTTP сервисом Лайв. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ." + Символы.ПС
		+ Результат.ТекстОшибки;
	
	Возврат Ответ; 
КонецЕсли;

Если Результат.Данные = Неопределено Тогда 
	Ответ.Ошибка = Истина;
	Ответ.ТекстОшибки = "Ошибка подготовки данных в HTTP сервисе Лайв. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ."; 	
	
	Возврат Ответ; 
КонецЕсли;

ЗагрузитьЗаселенияНаСервере("ЗаселенияВЛайв", Результат.Данные);
Возврат Ответ;
КонецФункции

&НаКлиенте
Функция ЗагрузитьЗаселенияДомСоветов_HTTP()
Ответ = Новый Структура("Ошибка, ТекстОшибки", Ложь, "");	
	
Результат = HTTP_Модуль.ПолучитьЗаселения(Объект.ДН, Объект.ДК, "СерверДомСоветовHTTP");
Если Результат.Ошибка Тогда 
	Ответ.Ошибка = Истина;
	Ответ.ТекстОшибки = "Ошибка соединения с HTTP сервисом Дом советов. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ." + Символы.ПС
		+ Результат.ТекстОшибки;
	
	Возврат Ответ; 
КонецЕсли;

Если Результат.Данные = Неопределено Тогда 
	Ответ.Ошибка = Истина;
	Ответ.ТекстОшибки = "Ошибка подготовки данных в HTTP сервисе Дом советов. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ."; 	
	
	Возврат Ответ; 
КонецЕсли;

ЗагрузитьЗаселенияНаСервере("ЗаселенияВДомСоветов", Результат.Данные);
Возврат Ответ;
КонецФункции                                               

&НаКлиенте
Функция ЗагрузитьЗаселенияСтритАрт_HTTP()
Ответ = Новый Структура("Ошибка, ТекстОшибки", Ложь, "");	
	
Результат = HTTP_Модуль.ПолучитьЗаселения(Объект.ДН, Объект.ДК, "СерверСтритАртHTTP");
Если Результат.Ошибка Тогда 
	Ответ.Ошибка = Истина;
	Ответ.ТекстОшибки = "Ошибка соединения с HTTP сервисом Стрит Арт. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ." + Символы.ПС
		+ Результат.ТекстОшибки;
	
	Возврат Ответ; 
КонецЕсли;

Если Результат.Данные = Неопределено Тогда 
	Ответ.Ошибка = Истина;
	Ответ.ТекстОшибки = "Ошибка подготовки данных в HTTP сервисе Стрит Арт. ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ."; 	
	
	Возврат Ответ; 
КонецЕсли;

ЗагрузитьЗаселенияНаСервере("ЗаселенияВСтритАрт", Результат.Данные);
Возврат Ответ;
КонецФункции                                               

&НаСервере
Процедура ЗагрузитьЗаселенияНаСервере(ЗаселенияИмя, Данные)
Заселения = ЭтаФорма[ЗаселенияИмя];
Заселения.Очистить();

Если ЗаселенияИмя = "ЗаселенияВЛайв" Тогда
	ИмяРеквизита = "АдминистраторКодЛайв";
ИначеЕсли ЗаселенияИмя = "ЗаселенияВДомСоветов" Тогда
	ИмяРеквизита = "АдминистраторКодДомСоветов";
ИначеЕсли ЗаселенияИмя = "ЗаселенияВСтритАрт" Тогда
	ИмяРеквизита = "АдминистраторКодСтритАрт";
Иначе
	Возврат;
КонецЕсли;

Для Каждого Строка Из Данные Цикл
	АдминистраторКод = Строка.АвторЗаявкиКод;
	АдминистраторКод = СокрЛП(АдминистраторКод);
	
	Администратор = Справочники.Администраторы.НайтиПоРеквизиту(ИмяРеквизита, АдминистраторКод);
	
	ДатаВремя = Строка.ВремяЗаезда;
	
	// 0001.01.01Т01:01:01
	// 1234567890123456789
	Год = Число(Сред(ДатаВремя, 1, 4));
	Месяц = Число(Сред(ДатаВремя, 6, 2));
	День = Число(Сред(ДатаВремя, 9, 2));
	Час = Число(Сред(ДатаВремя, 12, 2));
	Минута = Число(Сред(ДатаВремя, 15, 2));
	Секунда = Число(Сред(ДатаВремя, 18, 2));
	
	ДатаВремя = Дата(Год, Месяц, День, Час, Минута, Секунда);  
	
	НоваяСтрока = Заселения.Добавить();
	НоваяСтрока.ДатаВремя = ДатаВремя;
	
	НоваяСтрока.Администратор = Администратор;
	НоваяСтрока.АдминистраторКодОбмен = Строка.АвторЗаявкиКод;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ОбновитьДанныеПоДНиДК()
Если НЕ ПроживающиеЗагружены Тогда
	ЗаполнитьПроживающие();
	ПроживающиеЗагружены = Истина;
КонецЕсли;
	
ТекстОшибки = "";
ТекстСообщения = "Идет загрука заселений. 
	|
	|ПОДОЖДИТЕ ...";	
ПараметрыФормы = Новый Структура("ТекстСообщения", ТекстСообщения);

Если ОтельИмя = "Реноме" Тогда	
	Если НЕ ЗаселенияВЛайвЗагружены Тогда	
		//ФормаСообщение = ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.СообщениеЗагрузкаЗаселений",,ЭтаФорма
		//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ФормаСообщение = ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.СообщениеОперация", ПараметрыФормы,ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Ответ = ЗагрузитьЗаселенияЛайв_HTTP();	
		Если Ответ.Ошибка Тогда
			ТекстОшибки = Ответ.ТекстОшибки + Символы.ПС 
			+ "ЗАСЕЛЕНИЯ В ЛАЙВ НЕ ЗАГРУЖЕНЫ";
		КонецЕсли;
		
		ФормаСообщение.Закрыть();
		
		ЗаселенияВЛайвЗагружены = Истина;
	КонецЕсли;
КонецЕсли;

Если ОтельИмя = "Чехов" Тогда	
	Если НЕ ЗаселенияВДомСоветовЗагружены Тогда	
		//ФормаСообщение = ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.СообщениеЗагрузкаЗаселений",,ЭтаФорма
		//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ФормаСообщение = ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.СообщениеОперация", ПараметрыФормы,ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Ответ = ЗагрузитьЗаселенияДомСоветов_HTTP();	
		Если Ответ.Ошибка Тогда
			ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Ответ.ТекстОшибки, Символы.ПС);
			ТекстОшибки = ТекстОшибки + Символы.ПС + "ЗАСЕЛЕНИЯ В ДОМ СОВЕТОВ НЕ ЗАГРУЖЕНЫ";
		КонецЕсли;
		
		ФормаСообщение.Закрыть();
		
		ЗаселенияВДомСоветовЗагружены = Истина;
	КонецЕсли;
	
	Если НЕ ЗаселенияВСтритАртЗагружены Тогда	
		//ФормаСообщение = ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.СообщениеЗагрузкаЗаселений",,ЭтаФорма
		//	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ФормаСообщение = ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.СообщениеОперация",ПараметрыФормы,ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Ответ = ЗагрузитьЗаселенияСтритАрт_HTTP();	
		Если Ответ.Ошибка Тогда
			ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Ответ.ТекстОшибки, Символы.ПС);
			ТекстОшибки = ТекстОшибки + Символы.ПС + "ЗАСЕЛЕНИЯ В СТРИТ АРТ НЕ ЗАГРУЖЕНЫ";
		КонецЕсли;
		
		ФормаСообщение.Закрыть();
		
		ЗаселенияВСтритАртЗагружены = Истина;
	КонецЕсли;
КонецЕсли;

Если ТекстОшибки <> "" Тогда
	Сообщить(ТекстОшибки);
КонецЕсли;

КонецФункции
//

//
&НаКлиенте
Процедура ДНПриИзменении(Элемент)
Если ПроверкаДКДН() Тогда Возврат; КонецЕсли; 

ПровестиНаСервере(ДН_OldValue, ДК_OldValue);

ТекстОшибки = ЗаполнитьСправочныеДанныеПоДНиДК();
ДНДК_ПриИзмененииНаСервере();

Если ТекстОшибки <> "" Тогда 
	Сообщить(ТекстОшибки);	
КонецЕсли;

ПровестиНаСервере(Объект.ДН, Объект.ДК);

ДН_OldValue = Объект.ДН;
КонецПроцедуры

&НаКлиенте
Процедура ДКПриИзменении(Элемент)
Если ПроверкаДКДН() Тогда Возврат; КонецЕсли; 

Если ЗначениеЗаполнено(ДН_OldValue) И ЗначениеЗаполнено(ДК_OldValue) Тогда
	ТекстСообщения = "Идет перерасчет Зарплаты";
Иначе	
	ТекстСообщения = "Идет расчет Зарплаты";
КонецЕсли;
ТекстСообщения = ТекстСообщения + "
			|
			|ПОДОЖДИТЕ ...";
ПараметрыФормы = Новый Структура("ТекстСообщения", ТекстСообщения);
ФормаСообщения = ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.СообщениеОперация", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
ПровестиНаСервере(ДН_OldValue, ДК_OldValue);

ТекстОшибки = ЗаполнитьСправочныеДанныеПоДНиДК();
ДНДК_ПриИзмененииНаСервере();

ПровестиНаСервере(Объект.ДН, Объект.ДК);
ФормаСообщения.Закрыть();

Если ТекстОшибки <> "" Тогда 
	Сообщить(ТекстОшибки);	
КонецЕсли;

ДК_OldValue = Объект.ДК;
КонецПроцедуры

&НаКлиенте
Функция ПроверкаДКДН()
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат Истина; КонецЕсли; 

Если Объект.ДН > Объект.ДК Тогда 
	
	ПоказатьПредупреждение( ,"Дата начала > Даты окончания");
	//
	Объект.ДН = ДН_OldValue;
	Объект.ДК = ДК_OldValue;
	
	Возврат Истина; 
КонецЕсли; 

Если НачалоМесяца(Объект.ДН) <> НачалоМесяца(Объект.ДК) Тогда
	ПоказатьПредупреждение( ,"Месяц начала <> Месяц окончания");
	//
	Объект.ДН = ДН_OldValue;
	Объект.ДК = ДК_OldValue;
	
	Возврат Истина; 
КонецЕсли;	

Возврат Ложь; 
КонецФункции

&НаСервере
Процедура ДНДК_ПриИзмененииНаСервере()
	
ДН_П = НачалоМесяца(Объект.ДН);
ДК_П = КонецМесяца(Объект.ДК);
	
Если ЗарплатаСмены.Количество() > 0 Тогда
	
	РеквизитыЗарплатаСмены = РеквизитыЗарплатаСмены(ДН_П, ДК_П);  

	Если РеквизитыЗарплатаСмены.Количество() > 0 Тогда
		УдаляемыеРеквизиты = Новый Массив;
		Для каждого Строка Из РеквизитыЗарплатаСмены Цикл
			УдаляемыеРеквизиты.Добавить(Строка.Путь + "." + Строка.Имя);	
		КонецЦикла;

		Дата_П = ДН_П;
		Пока Дата_П <= ДК_П Цикл
			Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
			Дата_И = СтрЗаменить(Дата_С, ".", "");
			
			//
			Имя = "Часы_" + Дата_И;
			УдаляемыеРеквизиты.Добавить("ЗарплатаСмены_OldValue." + Имя);
			
			Имя = "НомерСмены_" + Дата_И;
			УдаляемыеРеквизиты.Добавить("ЗарплатаСмены_OldValue." + Имя);
			
			Имя = "ДлинаСмены_" + Дата_И;
			УдаляемыеРеквизиты.Добавить("ЗарплатаСмены_OldValue." + Имя);
			
			Имя = "ПереработкаЧасы_" + Дата_И;
			УдаляемыеРеквизиты.Добавить("ЗарплатаСмены_OldValue." + Имя);
			//
			
			Дата_П = Дата_П + 24 * 60 * 60;	
		КонецЦикла;
		
		ИзменитьРеквизиты(,УдаляемыеРеквизиты);

		ЭлементТаблицаИмя = "ЗарплатаСмены";
		Дата_П = ДН_OldValue;
		Пока Дата_П <= ДК_OldValue Цикл
			Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
			Дата_И = СтрЗаменить(Дата_С, ".", "");
			
			Имя = ЭлементТаблицаИмя + "Группа1_" + Дата_И; 
			Элемент = Элементы.Найти(Имя);
			Элементы.Удалить(Элемент);
			
			Дата_П = Дата_П + 24 * 60 * 60;
		КонецЦикла;
	КонецЕсли;
КонецЕсли;

ЗаполнитьЗарплатаСмены();

РасчитатьЗарплатуНаСервере();
ОбновитьЗарплатыСмена();
КонецПроцедуры
//


//
&НаСервере
Процедура ОбновитьСтрокаЗарплатыСмена(Строка)
ОбновитьСтрокаЗарплатаСменыДаты_Э(Строка);

ОбновитьСтрокаЗарплатыСменаИзДат(Строка);

РасчитатьНадбавки(Строка);
Если Строка.Администратор.Постоянный Тогда
	 РасчитатьПостоянный(Строка);
КонецЕсли;

РасчитатьПрочее(Строка);

ОбновитьСтрокаЗарплатаСменыОсновные_Э(Строка);

ОбновитьЗарплатаСменыИтоги(Строка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокаЗарплатаСменыДаты_Э(ТД)
Дата_П = Объект.ДН;
Пока Дата_П <= Объект.ДК Цикл
	Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
	Дата_И = СтрЗаменить(Дата_С, ".", "");  
	
	ДатаСмены = ТД["Дата_" + Дата_И];
	НомерСмены = ТД["НомерСмены_" + Дата_И];
	ДлинаСмены = ТД["ДлинаСмены_" + Дата_И];
	
	ПереработкаЧасы = ТД["ПереработкаЧасы_" + Дата_И];
	СуммаПереработка = СуммаПереработкаЗаСмену(ТД.Администратор, ПереработкаЧасы);
	ТД["СуммаПереработка_" + Дата_И] = СуммаПереработка;
	
	КоличествоЗавтракиЧехов = ТД["КоличествоЗавтракиЧехов_" + Дата_И];
	СуммаЗавтракиЧехов  = СуммаЗавтракиЧеховЗаСмену(ТД.Администратор, КоличествоЗавтракиЧехов);
	ТД["СуммаЗавтракиЧехов_" + Дата_И] = СуммаЗавтракиЧехов;
	
	КоличествоЗавтракиДомСоветов = ТД["КоличествоЗавтракиДомСоветов_" + Дата_И];
	СуммаЗавтракиДомСоветов  = СуммаЗавтракиДомСоветовЗаСмену(ТД.Администратор, КоличествоЗавтракиДомСоветов);
	ТД["СуммаЗавтракиДомСоветов_" + Дата_И] = СуммаЗавтракиДомСоветов;
	
	КоличествоЗавтракиЛайв = ТД["КоличествоЗавтракиЛайв_" + Дата_И];
	СуммаЗавтракиЛайв  = СуммаЗавтракиЛайвЗаСмену(ТД.Администратор, КоличествоЗавтракиЛайв);
	ТД["СуммаЗавтракиЛайв_" + Дата_И] = СуммаЗавтракиЛайв;
	
	Если НомерСмены = 0 Тогда	
		ТД["Часы_" + Дата_И] = "";

		Имя_П = "ДлинаСмены_" + Дата_И;
		ТД[Имя_П] = 0;
		
		Имя_П = "Оклад_" + Дата_И;
		ТД[Имя_П] = 0; 
		Имя_П = "Оклад_" + Дата_И + "_Р";
		ТД[Имя_П] = 0; 
		Имя_П = "Оклад_" + Дата_И + "_Есть";
		ТД[Имя_П] = Ложь; 
		ТД["Оклад_" + Дата_И + "_Э"] = 0;

		Имя_П = "СуммаЗаПроживающих_" + Дата_И;
		ТД[Имя_П] = 0; 
		
		Имя_П = "КоличествоЗаселенийЛайв_" + Дата_И;
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийЛайв_" + Дата_И + "_Р";
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийЛайв_" + Дата_И + "_Э";
		ТД[Имя_П] = 0; 
		ТД["СуммаЗаселенийЛайв_" + Дата_И] = 0;
		
		Имя_П = "КоличествоЗаселенийДомСоветов_" + Дата_И;
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийДомСоветов_" + Дата_И + "_Р";
		ТД[Имя_П] = 0;	
		Имя_П = "КоличествоЗаселенийДомСоветов_" + Дата_И + "_Э";
		ТД[Имя_П] = 0;	
		ТД["СуммаЗаселенийДомСоветов_" + Дата_И] = 0;
		
		Имя_П = "КоличествоЗаселенийСтритАрт_" + Дата_И;
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийСтритАрт_" + Дата_И + "_Р";
		ТД[Имя_П] = 0;	
		Имя_П = "КоличествоЗаселенийСтритАрт_" + Дата_И + "_Э";
		ТД[Имя_П] = 0;
		ТД["СуммаЗаселенийСтритАрт_" + Дата_И] = 0;
		
		ТД["Часы_" + Дата_И] = "00-0/00";
		
		Перейти ~ВЫХОД;
	КонецЕсли;	
	
	Если НомерСмены = 3 Тогда	
		ТД["Часы_" + Дата_И] = "";

		Имя_П = "ДлинаСмены_" + Дата_И;
		ТД[Имя_П] = 0;
		
		ТД["Оклад_" + Дата_И] = СтавкаЗаОтпуск(ТД.Администратор); 
		Имя_П = "Оклад_" + Дата_И + "_Р";
		ТД[Имя_П] = 0; 
		Имя_П = "Оклад_" + Дата_И + "_Есть";
		ТД[Имя_П] = Ложь; 
		ТД["Оклад_" + Дата_И + "_Э"] = ТД["Оклад_" + Дата_И];
		
		Имя_П = "СуммаЗаПроживающих_" + Дата_И;
		ТД[Имя_П] = 0; 

		Имя_П = "КоличествоЗаселенийЛайв_" + Дата_И;
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийЛайв_" + Дата_И + "_Р";
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийЛайв_" + Дата_И + "_Э";
		ТД[Имя_П] = 0; 
		ТД["СуммаЗаселенийЛайв_" + Дата_И] = 0;
		
		Имя_П = "КоличествоЗаселенийДомСоветов_" + Дата_И;
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийДомСоветов_" + Дата_И + "_Р";
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийДомСоветов_" + Дата_И + "_Э";
		ТД[Имя_П] = 0; 
		ТД["СуммаЗаселенийДомСоветов_" + Дата_И] = 0;
		
		Имя_П = "КоличествоЗаселенийСтритАрт_" + Дата_И;
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийСтритАрт_" + Дата_И + "_Р";
		ТД[Имя_П] = 0; 
		Имя_П = "КоличествоЗаселенийСтритАрт_" + Дата_И + "_Э";
		ТД[Имя_П] = 0; 
		ТД["СуммаЗаселенийСтритАрт_" + Дата_И] = 0;
		
		ТД["Часы_" + Дата_И] = "00-0/00";
		
		Перейти ~ВЫХОД;;
	КонецЕсли;
	
	Если НомерСмены = 4 Тогда	
		//ТД["Оклад_" + Дата_И] = СтавкаЗаОтпуск(ТД.Администратор); 
		ТД["Оклад_" + Дата_И] = 0; 
		Имя_П = "Оклад_" + Дата_И + "_Р";
		ТД[Имя_П] = 0; 
		Имя_П = "Оклад_" + Дата_И + "_Есть";
		ТД[Имя_П] = Ложь; 
		ТД["Оклад_" + Дата_И + "_Э"] = ТД["Оклад_" + Дата_И];
		
		ТД["Часы_" + Дата_И] = "00-0/00";
		
		Перейти ~ВЫХОД;;
	КонецЕсли;
	
	
	//Если СокрЛП(ТД.Администратор.Наименование) = "Помыткина Анастасия" Тогда 
	//	 ш = 1;
	//КонецЕсли;
	
	ДатаВремяСмена = Документы.АдминистраторыЗарплата.ДатаВремяСмена(ДатаСмены, НомерСмены, ДлинаСмены, ПереработкаЧасы);
	ДатаВремяС = ДатаВремяСмена.ДатаВремяС;
	ДатаВремяПо = ДатаВремяСмена.ДатаВремяПо;

	ОкладЗаСмену = ОкладЗаСмену(ТД.Администратор, ДлинаСмены);
	Имя_П = "Оклад_" + Дата_И;
	ТД[Имя_П] = ОкладЗаСмену; 

	Если ТД["Оклад_" + Дата_И + "_Есть"] Тогда
		Оклад = ТД["Оклад_" + Дата_И + "_Р"];
	Иначе
		Оклад = ТД["Оклад_" + Дата_И];
	КонецЕсли;
	ТД["Оклад_" + Дата_И + "_Э"] = Оклад;
	
	СуммаЗаПроживающих = СуммаЗаПроживающихЗаСмену(ДатаСмены, ДлинаСмены);
	ТД["СуммаЗаПроживающих_" + Дата_И] = СуммаЗаПроживающих;
	
	//
	КоличествоЗаселенийЛайвЗаСмену = КоличествоЗаселенийЗаСмену(ЗаселенияВЛайв, ТД.Администратор, ДатаВремяС, ДатаВремяПо);
	ТД["КоличествоЗаселенийЛайв_" + Дата_И] = КоличествоЗаселенийЛайвЗаСмену;
	КоличествоЗаселенийЛайв = ТД["КоличествоЗаселенийЛайв_" + Дата_И] 
	 	+ ТД["КоличествоЗаселенийЛайв_" + Дата_И + "_Р"];
	ТД["КоличествоЗаселенийЛайв_" + Дата_И + "_Э"] = КоличествоЗаселенийЛайв;
	
	СуммаЗаселенийЛайв = СуммаЗаселенийЗаСмену(ТД.Администратор, ТД["КоличествоЗаселенийЛайв_" + Дата_И + "_Э"]);	
	ТД["СуммаЗаселенийЛайв_" + Дата_И] = СуммаЗаселенийЛайв;	
	
	КоличествоЗаселенийДомСоветовЗаСмену = КоличествоЗаселенийЗаСмену(ЗаселенияВДомСоветов, ТД.Администратор, ДатаВремяС, ДатаВремяПо);
	ТД["КоличествоЗаселенийДомСоветов_" + Дата_И] = КоличествоЗаселенийДомСоветовЗаСмену;
	КоличествоЗаселенийДомСоветов = ТД["КоличествоЗаселенийДомСоветов_" + Дата_И] 
	 	+ ТД["КоличествоЗаселенийДомСоветов_" + Дата_И + "_Р"];
	ТД["КоличествоЗаселенийДомСоветов_" + Дата_И + "_Э"] = КоличествоЗаселенийДомСоветов;
	
	СуммаЗаселенийДомСоветов = СуммаЗаселенийЗаСмену(ТД.Администратор, ТД["КоличествоЗаселенийДомСоветов_" + Дата_И + "_Э"]);	
	ТД["СуммаЗаселенийДомСоветов_" + Дата_И] = СуммаЗаселенийДомСоветов;	
	
	КоличествоЗаселенийСтритАртЗаСмену = КоличествоЗаселенийЗаСмену(ЗаселенияВСтритАрт, ТД.Администратор, ДатаВремяС, ДатаВремяПо);
	ТД["КоличествоЗаселенийСтритАрт_" + Дата_И] = КоличествоЗаселенийСтритАртЗаСмену;
	КоличествоЗаселенийСтритАрт = ТД["КоличествоЗаселенийСтритАрт_" + Дата_И] 
	 	+ ТД["КоличествоЗаселенийСтритАрт_" + Дата_И + "_Р"];
	ТД["КоличествоЗаселенийСтритАрт_" + Дата_И + "_Э"] = КоличествоЗаселенийСтритАрт;
	
	СуммаЗаселенийСтритАрт = СуммаЗаселенийЗаСмену(ТД.Администратор, ТД["КоличествоЗаселенийСтритАрт_" + Дата_И + "_Э"]);	
	ТД["СуммаЗаселенийСтритАрт_" + Дата_И] = СуммаЗаселенийСтритАрт;	
	
~ВЫХОД:
	ТД["Итого_" + Дата_И] = 
	  ТД["Оклад_" + Дата_И + "_Э"]
	+ ТД["СуммаЗаПроживающих_"  + Дата_И]
	+ ТД["СуммаПереработка_" + Дата_И]
	+ ТД["СуммаЗаселенийЛайв_" + Дата_И]
	+ ТД["СуммаЗаселенийДомСоветов_" + Дата_И]
	+ ТД["СуммаЗаселенийСтритАрт_" + Дата_И]
	+ ТД["СуммаЗавтракиЧехов_" + Дата_И]
	+ ТД["СуммаЗавтракиДомСоветов_" + Дата_И]
	+ ТД["СуммаЗавтракиЛайв_" + Дата_И]
	+ ТД["СуммаДопУслуги_" + Дата_И]
	; 

	Дата_П = Дата_П + 24 * 60 * 60;
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокаЗарплатыСменаИзДат(Строка)
СуммаПереработка = 0;
	
КоличествоСмен = 0;
КоличествоЧасов = 0;
Оклад = 0;
Отпуск = 0;

СуммаЗаПроживающих = 0;
КоличествоЗаселенийЛайв = 0;
СуммаЗаселенийЛайв = 0;
КоличествоЗаселенийДомСоветов = 0;
СуммаЗаселенийДомСоветов = 0;
КоличествоЗаселенийСтритАрт = 0;
СуммаЗаселенийСтритАрт = 0;

КоличествоЗавтракиЧехов = 0;
СуммаЗавтракиЧехов = 0;
КоличествоЗавтракиДомСоветов = 0;
СуммаЗавтракиДомСоветов = 0;
КоличествоЗавтракиЛайв = 0;
СуммаЗавтракиЛайв = 0;

СуммаДопУслуги = 0;

Дата_П = Объект.ДН;
Пока Дата_П <= Объект.ДК Цикл
	Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
	Дата_И = СтрЗаменить(Дата_С, ".", "");
	
	Имя = "СуммаПереработка_" + Дата_И;
	СуммаПереработка = СуммаПереработка + Строка[Имя];
	
	Имя = "КоличествоЗавтракиЧехов_" + Дата_И;
	КоличествоЗавтракиЧехов = КоличествоЗавтракиЧехов + Строка[Имя];
		
	Имя = "СуммаЗавтракиЧехов_" + Дата_И;
	СуммаЗавтракиЧехов = СуммаЗавтракиЧехов + Строка[Имя];
	
	Имя = "КоличествоЗавтракиДомСоветов_" + Дата_И;
	КоличествоЗавтракиДомСоветов = КоличествоЗавтракиДомСоветов + Строка[Имя];
		
	Имя = "СуммаЗавтракиДомСоветов_" + Дата_И;
	СуммаЗавтракиДомСоветов = СуммаЗавтракиДомСоветов + Строка[Имя];
	
	Имя = "КоличествоЗавтракиЛайв_" + Дата_И;
	КоличествоЗавтракиЛайв = КоличествоЗавтракиЛайв + Строка[Имя];
		
	Имя = "СуммаЗавтракиЛайв_" + Дата_И;
	СуммаЗавтракиЛайв = СуммаЗавтракиЛайв + Строка[Имя];
	
	Имя = "СуммаДопУслуги_" + Дата_И;
	СуммаДопУслуги = СуммаДопУслуги + Строка[Имя];
	
	Имя = "НомерСмены_" + Дата_И;
	Если Строка[Имя] = 0 Тогда Перейти ~ПРОДОЛЖИТЬ; КонецЕсли;
	
	Если Строка[Имя] = 3 Тогда
		Имя = "Оклад_" + Дата_И + "_Э";
		Отпуск = Отпуск + Строка[Имя];
	Иначе
		ДлинаСмены = Строка["ДлинаСмены_" + Дата_И];
		//Если ОтельИмя = "Чехов" 
		//И ДлинаСмены <= 12 
		//И (НЕ Строка.Администратор.Постоянный) 
		//Тогда
		//	КоличествоСмен = КоличествоСмен + 1;
		//Иначе
		//	КоличествоСмен = КоличествоСмен + 2;
		//КонецЕсли;
		Если ОтельИмя = "Чехов" Тогда 
			Если ДлинаСмены <= 12 
			//ИЛИ Строка.Администратор.Постоянный 
			Тогда
				КоличествоСмен = КоличествоСмен + 1;
			Иначе
				КоличествоСмен = КоличествоСмен + 2;
			КонецЕсли;   
		Иначе
	  		КоличествоСмен = КоличествоСмен + 1;
		КонецЕсли;   
			
	  //КоличествоСмен = КоличествоСмен + 1;
		
		Имя = "Оклад_" + Дата_И + "_Э";
		Оклад = Оклад + Строка[Имя];
		
		Имя = "СуммаЗаПроживающих_" + Дата_И;
		СуммаЗаПроживающих = СуммаЗаПроживающих + Строка[Имя];
			
		Имя = "КоличествоЗаселенийЛайв_" + Дата_И + "_Э";
		КоличествоЗаселенийЛайв = КоличествоЗаселенийЛайв + Строка[Имя];
			
		Имя = "СуммаЗаселенийЛайв_" + Дата_И;
		СуммаЗаселенийЛайв = СуммаЗаселенийЛайв + Строка[Имя];
		
		Имя = "КоличествоЗаселенийДомСоветов_" + Дата_И + "_Э";
		КоличествоЗаселенийДомСоветов = КоличествоЗаселенийДомСоветов + Строка[Имя];
			
		Имя = "СуммаЗаселенийДомСоветов_" + Дата_И;
		СуммаЗаселенийДомСоветов = СуммаЗаселенийДомСоветов + Строка[Имя];
		
		Имя = "КоличествоЗаселенийСтритАрт_" + Дата_И + "_Э";
		КоличествоЗаселенийСтритАрт = КоличествоЗаселенийСтритАрт + Строка[Имя];
			
		Имя = "СуммаЗаселенийСтритАрт_" + Дата_И;
		СуммаЗаселенийСтритАрт = СуммаЗаселенийСтритАрт + Строка[Имя];
		
	КонецЕсли;
	
~ПРОДОЛЖИТЬ:   

	Имя = "ДлинаСмены_" + Дата_И;
	КоличествоЧасов = КоличествоЧасов + Строка[Имя];;
	
	Имя = "ПереработкаЧасы_" + Дата_И;
	КоличествоЧасов = КоличествоЧасов + Строка[Имя];;

	Дата_П = Дата_П + 24 * 60 * 60;
КонецЦикла;
	
Строка.КоличествоСмен = КоличествоСмен;

Строка.КоличествоЧасов = КоличествоЧасов;

Если НЕ Строка.Администратор.Постоянный Тогда
	Строка.Оклад = Оклад;	
КонецЕсли;

Строка.Отпуск = Отпуск;	

Строка.СуммаПереработка = СуммаПереработка;	

Если НЕ Строка.Администратор.Постоянный Тогда
	Строка.СуммаЗаПроживающих = СуммаЗаПроживающих;	
КонецЕсли;

Строка.КоличествоЗаселенийЛайв = КоличествоЗаселенийЛайв;	
Строка.СуммаЗаселенийЛайв = СуммаЗаселенийЛайв;	
Строка.КоличествоЗаселенийДомСоветов = КоличествоЗаселенийДомСоветов;	
Строка.СуммаЗаселенийДомСоветов = СуммаЗаселенийДомСоветов;	
Строка.КоличествоЗаселенийСтритАрт = КоличествоЗаселенийСтритАрт;	
Строка.СуммаЗаселенийСтритАрт = СуммаЗаселенийСтритАрт;	

Строка.КоличествоЗавтракиЧехов = КоличествоЗавтракиЧехов;	
Строка.СуммаЗавтракиЧехов = СуммаЗавтракиЧехов;	
Строка.КоличествоЗавтракиДомСоветов = КоличествоЗавтракиДомСоветов;	
Строка.СуммаЗавтракиДомСоветов = СуммаЗавтракиДомСоветов;	
Строка.КоличествоЗавтракиЛайв = КоличествоЗавтракиЛайв;	
Строка.СуммаЗавтракиЛайв = СуммаЗавтракиЛайв;	

Строка.ДопУслуги = СуммаДопУслуги;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокаЗарплатаСменыОсновные_Э(ТД)
Если ТД.Оклад_Есть Тогда 
	ТД.Оклад_Э = ТД.Оклад_Р;
Иначе
	ТД.Оклад_Э = ТД.Оклад;
КонецЕсли;

Если ТД.Отпуск_Есть Тогда 
	ТД.Отпуск_Э = ТД.Отпуск_Р;
Иначе
	ТД.Отпуск_Э = ТД.Отпуск;
КонецЕсли;

Если ТД.СуммаПереработка_Есть Тогда 
	ТД.СуммаПереработка_Э = ТД.СуммаПереработка_Р;
Иначе
	ТД.СуммаПереработка_Э = ТД.СуммаПереработка;
КонецЕсли;

Если ТД.НадбавкаЗаСтаж_Есть Тогда 
	ТД.НадбавкаЗаСтаж_Э = ТД.НадбавкаЗаСтаж_Р;
Иначе
	ТД.НадбавкаЗаСтаж_Э = ТД.НадбавкаЗаСтаж;
КонецЕсли;

Если ТД.НадбавкаЗаСтандарты_Есть Тогда 
	ТД.НадбавкаЗаСтандарты_Э = ТД.НадбавкаЗаСтандарты_Р;
Иначе
	ТД.НадбавкаЗаСтандарты_Э = ТД.НадбавкаЗаСтандарты;
КонецЕсли;

Если ТД.НадбавкаЗаИнЯзыки_Есть Тогда 
	ТД.НадбавкаЗаИнЯзыки_Э = ТД.НадбавкаЗаИнЯзыки_Р;
Иначе
	ТД.НадбавкаЗаИнЯзыки_Э = ТД.НадбавкаЗаИнЯзыки;
КонецЕсли;

Если ТД.СуммаЗаПроживающих_Есть Тогда 
	ТД.СуммаЗаПроживающих_Э = ТД.СуммаЗаПроживающих_Р;
Иначе
	ТД.СуммаЗаПроживающих_Э = ТД.СуммаЗаПроживающих;
КонецЕсли;

ТД.КоличествоЗаселенийЛайв_Э = ТД.КоличествоЗаселенийЛайв + ТД.КоличествоЗаселенийЛайв_Р;
ТД.СуммаЗаселенийЛайв_Э = ТД.СуммаЗаселенийЛайв + ТД.СуммаЗаселенийЛайв_Р;

ТД.КоличествоЗаселенийДомСоветов_Э = ТД.КоличествоЗаселенийДомСоветов + ТД.КоличествоЗаселенийДомСоветов_Р;
ТД.СуммаЗаселенийДомСоветов_Э = ТД.СуммаЗаселенийДомСоветов + ТД.СуммаЗаселенийДомСоветов_Р;

ТД.КоличествоЗаселенийСтритАрт_Э = ТД.КоличествоЗаселенийСтритАрт + ТД.КоличествоЗаселенийСтритАрт_Р;
ТД.СуммаЗаселенийСтритАрт_Э = ТД.СуммаЗаселенийСтритАрт + ТД.СуммаЗаселенийСтритАрт_Р;

ТД.КоличествоЗавтракиЧехов_Э = ТД.КоличествоЗавтракиЧехов + ТД.КоличествоЗавтракиЧехов_Р;
ТД.СуммаЗавтракиЧехов_Э = ТД.СуммаЗавтракиЧехов + ТД.СуммаЗавтракиЧехов_Р;

ТД.КоличествоЗавтракиДомСоветов_Э = ТД.КоличествоЗавтракиДомСоветов + ТД.КоличествоЗавтракиДомСоветов_Р;
ТД.СуммаЗавтракиДомСоветов_Э = ТД.СуммаЗавтракиДомСоветов + ТД.СуммаЗавтракиДомСоветов_Р;

ТД.КоличествоЗавтракиЛайв_Э = ТД.КоличествоЗавтракиЛайв + ТД.КоличествоЗавтракиЛайв_Р;
ТД.СуммаЗавтракиЛайв_Э = ТД.СуммаЗавтракиЛайв + ТД.СуммаЗавтракиЛайв_Р;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗарплатаСменыИтоги(ТД)
СменыИтого = ТД.Оклад_Э 
	+ ТД.СуммаПереработка_Э
	+ ТД.СуммаЗаПроживающих_Э
	+ ТД.СуммаЗаселенийЛайв_Э
	+ ТД.СуммаЗаселенийДомСоветов_Э
	+ ТД.СуммаЗаселенийСтритАрт_Э
	+ ТД.СуммаЗавтракиЧехов_Э
	+ ТД.СуммаЗавтракиДомСоветов_Э
	+ ТД.СуммаЗавтракиЛайв_Э
	;
	
ЗарплатаИтого = СменыИтого + ТД.НадбавкаЗаСтаж_Э + ТД.НадбавкаЗаСтандарты_Э + ТД.НадбавкаЗаИнЯзыки_Э
	+ ТД.Отпуск_Э 
	+ ТД.Больничный 
	+ ТД.Премия 
	+ ТД.ДопУслуги
	+ ТД.СуммаПрочее
	;
	
ТД.ИтогоСмены = СменыИтого;
ТД.Итого = ЗарплатаИтого;

Выплачено = ТД.АвансНал + ТД.АвансКарта + ТД.ОтпускныеКарта + ТД.ЗПКарта 
			+ ТД.ИныеВыплатыНал + ТД.ИныеВыплатыКарта; 
ТД.КВыплате = ЗарплатаИтого - Выплачено;

КонецПроцедуры
//

&НаСервере
Процедура ОбновитьЗарплатыСмена()
Для Каждого Строка Из ЗарплатаСмены Цикл
	ОбновитьСтрокаЗарплатыСмена(Строка);
КонецЦикла;	
КонецПроцедуры


//
&НаСервере
Процедура ПровестиНаСервере(ДН, ДК)
	
ЗаполнитьПередЗаписью(ДН, ДК);

ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда 
	
	Отказ = Истина;
	Возврат; 
КонецЕсли; 

ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
ЗаполнитьПередЗаписью(Объект.ДН, Объект.ДК);                   
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПередЗаписью(ДН, ДК)
	
Объект.Зарплата.Очистить();	
	
//Объект.ЗарплатаСмены.Очистить();
МассивКУдалению = Новый Массив;
Для Каждого Строка Из Объект.ЗарплатаСмены Цикл
	Если Строка.ДатаСмены < ДН ИЛИ Строка.ДатаСмены > ДК Тогда Продолжить; КонецЕсли;
	
	МассивКУдалению.Добавить(Строка);
КонецЦикла;

Для Каждого Строка Из МассивКУдалению Цикл
	Объект.ЗарплатаСмены.Удалить(Строка);
КонецЦикла;

Для Каждого Строка Из ЗарплатаСмены Цикл
	//
	НоваяСтрокаЗарплата = Объект.Зарплата.Добавить();
	НоваяСтрокаЗарплата.Администратор = Строка.Администратор;
	
	НоваяСтрокаЗарплата.Оклад = Строка.Оклад;
	НоваяСтрокаЗарплата.Оклад_Р = Строка.Оклад_Р;
	НоваяСтрокаЗарплата.Оклад_Есть = Строка.Оклад_Есть;
	
	НоваяСтрокаЗарплата.Отпуск = Строка.Отпуск;
	НоваяСтрокаЗарплата.Отпуск_Р = Строка.Отпуск_Р;
	НоваяСтрокаЗарплата.Отпуск_Есть = Строка.Отпуск_Есть;
	
	НоваяСтрокаЗарплата.СуммаПереработка = Строка.СуммаПереработка;
	НоваяСтрокаЗарплата.СуммаПереработка_Р = Строка.СуммаПереработка_Р;
	НоваяСтрокаЗарплата.СуммаПереработка_Есть = Строка.СуммаПереработка_Есть;
	
	НоваяСтрокаЗарплата.НадбавкаЗаСтаж = Строка.НадбавкаЗаСтаж;
	НоваяСтрокаЗарплата.НадбавкаЗаСтаж_Р = Строка.НадбавкаЗаСтаж_Р;
	НоваяСтрокаЗарплата.НадбавкаЗаСтаж_Есть = Строка.НадбавкаЗаСтаж_Есть;
	
	НоваяСтрокаЗарплата.НадбавкаЗаСтандарты = Строка.НадбавкаЗаСтандарты;
	НоваяСтрокаЗарплата.НадбавкаЗаСтандарты_Р = Строка.НадбавкаЗаСтандарты_Р;
	НоваяСтрокаЗарплата.НадбавкаЗаСтандарты_Есть = Строка.НадбавкаЗаСтандарты_Есть;
	
	НоваяСтрокаЗарплата.НадбавкаЗаИнЯзыки = Строка.НадбавкаЗаИнЯзыки;
	НоваяСтрокаЗарплата.НадбавкаЗаИнЯзыки_Р = Строка.НадбавкаЗаИнЯзыки_Р;
	НоваяСтрокаЗарплата.НадбавкаЗаИнЯзыки_Есть = Строка.НадбавкаЗаИнЯзыки_Есть;
	
	НоваяСтрокаЗарплата.КоличествоСмен = Строка.КоличествоСмен;	
	
	НоваяСтрокаЗарплата.СуммаЗаПроживающих = Строка.СуммаЗаПроживающих;
	НоваяСтрокаЗарплата.СуммаЗаПроживающих_Р = Строка.СуммаЗаПроживающих_Р;
	НоваяСтрокаЗарплата.СуммаЗаПроживающих_Есть = Строка.СуммаЗаПроживающих_Есть;
	
	НоваяСтрокаЗарплата.КоличествоЗаселенийЛайв = Строка.КоличествоЗаселенийЛайв;
	НоваяСтрокаЗарплата.КоличествоЗаселенийЛайв_Р = Строка.КоличествоЗаселенийЛайв_Р;
	
	НоваяСтрокаЗарплата.СуммаЗаселенийЛайв = Строка.СуммаЗаселенийЛайв;
	НоваяСтрокаЗарплата.СуммаЗаселенийЛайв_Р = Строка.СуммаЗаселенийЛайв_Р;
	
	НоваяСтрокаЗарплата.КоличествоЗаселенийДомСоветов = Строка.КоличествоЗаселенийДомСоветов;
	НоваяСтрокаЗарплата.КоличествоЗаселенийДомСоветов_Р = Строка.КоличествоЗаселенийДомСоветов_Р;
	
	НоваяСтрокаЗарплата.СуммаЗаселенийДомСоветов = Строка.СуммаЗаселенийДомСоветов;
	НоваяСтрокаЗарплата.СуммаЗаселенийДомСоветов_Р = Строка.СуммаЗаселенийДомСоветов_Р;

	// + Аудит
	//НоваяСтрокаЗарплата.КоличествоЗаселенийДомСоветов = Строка.КоличествоЗаселенийДомСоветов;
	//НоваяСтрокаЗарплата.КоличествоЗаселенийДомСоветов_Р = Строка.КоличествоЗаселенийДомСоветов_Р;
	НоваяСтрокаЗарплата.КоличествоЗаселенийСтритАрт = Строка.КоличествоЗаселенийСтритАрт;
	НоваяСтрокаЗарплата.КоличествоЗаселенийСтритАрт_Р = Строка.КоличествоЗаселенийСтритАрт_Р;
	// - Аудит
	
	НоваяСтрокаЗарплата.СуммаЗаселенийСтритАрт = Строка.СуммаЗаселенийСтритАрт;
	НоваяСтрокаЗарплата.СуммаЗаселенийСтритАрт_Р = Строка.СуммаЗаселенийСтритАрт_Р;
	
	НоваяСтрокаЗарплата.КоличествоЗавтракиЧехов = Строка.КоличествоЗавтракиЧехов;
	НоваяСтрокаЗарплата.КоличествоЗавтракиЧехов_Р = Строка.КоличествоЗавтракиЧехов_Р;
	
	НоваяСтрокаЗарплата.СуммаЗавтракиЧехов = Строка.СуммаЗавтракиЧехов;
	НоваяСтрокаЗарплата.СуммаЗавтракиЧехов_Р = Строка.СуммаЗавтракиЧехов_Р;
	
	НоваяСтрокаЗарплата.КоличествоЗавтракиДомСоветов = Строка.КоличествоЗавтракиДомСоветов;
	НоваяСтрокаЗарплата.КоличествоЗавтракиДомСоветов_Р = Строка.КоличествоЗавтракиДомСоветов_Р;
	
	НоваяСтрокаЗарплата.СуммаЗавтракиДомСоветов = Строка.СуммаЗавтракиДомСоветов;
	НоваяСтрокаЗарплата.СуммаЗавтракиДомСоветов_Р = Строка.СуммаЗавтракиДомСоветов_Р;
	
	НоваяСтрокаЗарплата.КоличествоЗавтракиЛайв = Строка.КоличествоЗавтракиЛайв;
	НоваяСтрокаЗарплата.КоличествоЗавтракиЛайв_Р = Строка.КоличествоЗавтракиЛайв_Р;
	
	НоваяСтрокаЗарплата.СуммаЗавтракиЛайв = Строка.СуммаЗавтракиЛайв;
	НоваяСтрокаЗарплата.СуммаЗавтракиЛайв_Р = Строка.СуммаЗавтракиЛайв_Р;
	
	НоваяСтрокаЗарплата.ДопУслуги = Строка.ДопУслуги;	
	НоваяСтрокаЗарплата.Больничный = Строка.Больничный;	
	НоваяСтрокаЗарплата.Премия = Строка.Премия;	
	
	НоваяСтрокаЗарплата.СуммаПрочее = Строка.СуммаПрочее;	
	
	НоваяСтрокаЗарплата.АвансНал = Строка.АвансНал;	
	НоваяСтрокаЗарплата.АвансКарта = Строка.АвансКарта;	
	
	НоваяСтрокаЗарплата.ОтпускныеКарта = Строка.ОтпускныеКарта;	
	НоваяСтрокаЗарплата.ЗПКарта = Строка.ЗПКарта;	
	НоваяСтрокаЗарплата.ИныеВыплатыНал = Строка.ИныеВыплатыНал;	
	НоваяСтрокаЗарплата.ИныеВыплатыКарта = Строка.ИныеВыплатыКарта;	
	
	НоваяСтрокаЗарплата.СуммаМинимум = Строка.СуммаМинимум;	
	//	
	
	//Дата_П = Объект.ДН;
	//Пока Дата_П <= Объект.ДК Цикл
	Дата_П = ДН;
	Пока Дата_П <= ДК Цикл
		Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
		Дата_И = СтрЗаменить(Дата_С, ".", "");
		
		Имя = "Часы_" + Дата_И;
		
		Часы = Строка[Имя];
		
		Имя = "НомерСмены_" + Дата_И;
		НомерСмены = Строка[Имя]; 
		
		Имя = "ПереработкаЧасы_" + Дата_И;
		ПереработкаЧасы = Строка[Имя];

		Имя = "КоличествоЗавтракиЧехов_" + Дата_И;
		КоличествоЗавтракиЧехов = Строка[Имя];
		
		Имя = "КоличествоЗавтракиДомСоветов_" + Дата_И;
		КоличествоЗавтракиДомСоветов = Строка[Имя];
		
		Имя = "КоличествоЗавтракиЛайв_" + Дата_И;
		КоличествоЗавтракиЛайв = Строка[Имя];
		
		Имя = "СуммаДопУслуги_" + Дата_И;
		СуммаДопУслуги = Строка[Имя];	
		
		Если НомерСмены = 0 И ПереработкаЧасы = 0 
		И    КоличествоЗавтракиЧехов = 0 И КоличествоЗавтракиДомСоветов = 0 И КоличествоЗавтракиЛайв = 0
		И    СуммаДопУслуги = 0
		Тогда Перейти ~ПРОДОЛЖИТЬ_ДАТА; КонецЕсли;
		
		НоваяСтрока = Объект.ЗарплатаСмены.Добавить();
		
		НоваяСтрока.Администратор = Строка.Администратор;
		НоваяСтрока.ДатаСмены = Дата_П;
		НоваяСтрока.Часы = Часы;
		
		НоваяСтрока.НомерСмены = НомерСмены;
				
		Имя = "ДлинаСмены_" + Дата_И;
		НоваяСтрока.ДлинаСмены = Строка[Имя];
		
		НоваяСтрока.ПереработкаЧасы = ПереработкаЧасы;
		
		Имя = "Оклад_" + Дата_И;
		НоваяСтрока.Оклад = Строка[Имя];
		
		Имя = "Оклад_" + Дата_И + "_Р";
		НоваяСтрока.Оклад_Р = Строка[Имя];
		
		Имя = "Оклад_" + Дата_И + "_Есть";
		НоваяСтрока.Оклад_Есть = Строка[Имя];
		
		Имя = "СуммаПереработка_" + Дата_И;
		НоваяСтрока.СуммаПереработка = Строка[Имя];
		
		Имя = "СуммаЗаПроживающих_" + Дата_И;
		НоваяСтрока.СуммаЗаПроживающих = Строка[Имя];

		Имя = "КоличествоЗаселенийЛайв_" + Дата_И;
		НоваяСтрока.КоличествоЗаселенийЛайв = Строка[Имя];
		
		Имя = "КоличествоЗаселенийЛайв_" + Дата_И + "_Р";
		НоваяСтрока.КоличествоЗаселенийЛайв_Р = Строка[Имя];
		
		Имя = "СуммаЗаселенийЛайв_" + Дата_И;
		НоваяСтрока.СуммаЗаселенийЛайв = Строка[Имя];
		
		Имя = "КоличествоЗаселенийДомСоветов_" + Дата_И;
		НоваяСтрока.КоличествоЗаселенийДомСоветов = Строка[Имя];
		
		Имя = "КоличествоЗаселенийДомСоветов_" + Дата_И + "_Р";
		НоваяСтрока.КоличествоЗаселенийДомСоветов_Р = Строка[Имя];
		
		Имя = "СуммаЗаселенийДомСоветов_" + Дата_И;
		НоваяСтрока.СуммаЗаселенийДомСоветов = Строка[Имя];

		Имя = "КоличествоЗаселенийСтритАрт_" + Дата_И;
		НоваяСтрока.КоличествоЗаселенийСтритАрт = Строка[Имя];
		
		Имя = "КоличествоЗаселенийСтритАрт_" + Дата_И + "_Р";
		НоваяСтрока.КоличествоЗаселенийСтритАрт_Р = Строка[Имя];
		
		Имя = "СуммаЗаселенийСтритАрт_" + Дата_И;
		НоваяСтрока.СуммаЗаселенийСтритАрт = Строка[Имя];
		
		Имя = "КоличествоЗавтракиЧехов_" + Дата_И;
		НоваяСтрока.КоличествоЗавтракиЧехов = Строка[Имя];
		
		Имя = "СуммаЗавтракиЧехов_" + Дата_И;
		НоваяСтрока.СуммаЗавтракиЧехов = Строка[Имя];		
		
		Имя = "КоличествоЗавтракиДомСоветов_" + Дата_И;
		НоваяСтрока.КоличествоЗавтракиДомСоветов = Строка[Имя];
		
		Имя = "СуммаЗавтракиДомСоветов_" + Дата_И;
		НоваяСтрока.СуммаЗавтракиДомСоветов = Строка[Имя];		
		
		Имя = "КоличествоЗавтракиЛайв_" + Дата_И;
		НоваяСтрока.КоличествоЗавтракиЛайв = Строка[Имя];
		
		Имя = "СуммаЗавтракиЛайв_" + Дата_И;
		НоваяСтрока.СуммаЗавтракиЛайв = Строка[Имя];		
		
		Имя = "СуммаДопУслуги_" + Дата_И;
		НоваяСтрока.СуммаДопУслуги = Строка[Имя];		
~ПРОДОЛЖИТЬ_ДАТА:
		Дата_П = Дата_П + 24 * 60 * 60;	
	КонецЦикла;
КонецЦикла;
КонецПроцедуры

//

//
&НаКлиенте
Процедура ОчиститьДанные(Команда)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 	
	
Для Каждого Строка Из ЗарплатаСмены Цикл	
	Строка.Оклад_Р = 0; Строка.Оклад_Есть = Ложь;
	Строка.СуммаПереработка_Р = 0; Строка.СуммаПереработка_Есть = Ложь;
	
	Строка.Отпуск_Р = 0; Строка.Отпуск_Есть = Ложь; 
	Строка.НадбавкаЗаСтаж_Р = 0; Строка.НадбавкаЗаСтаж_Есть = Ложь; 
	Строка.НадбавкаЗаСтандарты_Р = 0; Строка.НадбавкаЗаСтандарты_Есть = Ложь; 
	Строка.НадбавкаЗаИнЯзыки_Р = 0; Строка.НадбавкаЗаИнЯзыки_Есть = Ложь; 
	
	Строка.СуммаЗаПроживающих_Р = 0; Строка.СуммаЗаПроживающих_Есть = Ложь; 
	
	Строка.КоличествоЗаселенийЛайв_Р = 0;  
	Строка.СуммаЗаселенийЛайв_Р = 0;  
	Строка.КоличествоЗаселенийДомСоветов_Р = 0;  
	Строка.СуммаЗаселенийДомСоветов_Р = 0;  
	Строка.КоличествоЗаселенийСтритАрт_Р = 0;  
	Строка.СуммаЗаселенийСтритАрт_Р = 0;  
	
	Строка.КоличествоЗавтракиЧехов_Р = 0;  
	Строка.СуммаЗавтракиЧехов_Р = 0;  
	Строка.КоличествоЗавтракиДомСоветов_Р = 0;  
	Строка.СуммаЗавтракиДомСоветов_Р = 0;  
	Строка.КоличествоЗавтракиЛайв_Р = 0;  
	Строка.СуммаЗавтракиЛайв_Р = 0;  
	
	Дата_П = Объект.ДН;
	Пока Дата_П <= Объект.ДК Цикл
		Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
		Дата_И = СтрЗаменить(Дата_С, ".", "");
		
		Строка["КоличествоЗаселенийЛайв_" + Дата_И + "_Р"] = 0;	
		Строка["КоличествоЗаселенийДомСоветов_" + Дата_И + "_Р"] = 0;	
		Строка["КоличествоЗаселенийСтритАрт_" + Дата_И + "_Р"] = 0;	
		
		Строка["Оклад_" + Дата_И + "_Р"] = 0;	
		Строка["Оклад_" + Дата_И + "_Есть"] = 0;	
		
		Дата_П = Дата_П + 24 * 60 * 60;	
	КонецЦикла;	
КонецЦикла;	

ПровестиНаСервере(Объект.ДН, Объект.ДК);

ОбновитьЗарплатыСмена();
КонецПроцедуры
//

//
&НаКлиенте
Асинх Процедура РасчитатьЗарплату(Команда)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 	
	
//Результат = Ждать ВопросАсинх("Рсчет зарплаты обнулит все изменения внесенные вручную ! 			
//					|
//					|ПОДТВЕРДИТЕ РАСЧЕТ ЗАРПЛАТЫ ..."
//	, РежимДиалогаВопрос.ОКОтмена); 
//	
//Если Результат = КодВозвратаДиалога.ОК Тогда
	РасчитатьЗарплатуДействие();
//КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьЗарплатуДействие()
ЗаполнитьСправочныеДанные();

Если НастройкиСервер.ЭтоРеноме() Тогда
	ОбновитьДанныеПоДНиДК();
КонецЕсли;
 
ПодключитьОбработчикОжидания("РасчитатьЗарплатуДействиеОбработчикОжидания", 1, Истина); 
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьЗарплатуДействиеОбработчикОжидания()
//Для ш = 1 По 10000000 Цикл
//	к = 1;	
//КонецЦикла;

РасчитатьЗарплатуНаСервере();

ПровестиНаСервере(Объект.ДН, Объект.ДК);

ОбновитьЗарплатыСмена();
КонецПроцедуры


&НаСервере
Процедура РасчитатьЗарплатуНаСервере()
ДН = Объект.ДН; 
ДК = КонецДня(Объект.ДК);

Для Каждого Строка Из ЗарплатаСмены Цикл
	
	Дата_П = Объект.ДН;
	Пока Дата_П <= Объект.ДК Цикл
		Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
		Дата_И = СтрЗаменить(Дата_С, ".", "");
		
		Имя_Право = Дата_И;
		
		РасчитатьСтрокаЗарплатаСменыСмена(Строка, Имя_Право);
		
		Дата_П = Дата_П + 24 * 60 * 60;
	КонецЦикла;	
	
	ОбновитьСтрокаЗарплатаСменыДаты_Э(Строка);
	ОбновитьСтрокаЗарплатыСменаИзДат(Строка);	
	
	РасчитатьНадбавки(Строка);
	Если Строка.Администратор.Постоянный Тогда
		 РасчитатьПостоянный(Строка);
	КонецЕсли;
	РасчитатьПрочее(Строка);
	
	ОбновитьСтрокаЗарплатаСменыОсновные_Э(Строка);
	ОбновитьЗарплатаСменыИтоги(Строка);
КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура РасчитатьНадбавки(Строка);

Строка.НадбавкаЗаСтаж = СуммаНадбавкаЗаСтаж(Строка);	
Строка.НадбавкаЗаСтандарты = СуммаНадбавкаЗаСтандарты(Строка);	
Строка.НадбавкаЗаИнЯзыки = СуммаНадбавкаЗаИнЯзыки(Строка);	
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьПостоянный(Строка);
КоличествоРасчетныхДней = КоличествоРасчетныхДней(Строка); 

МесяцРасчета = Объект.ДН;
КоличествоДнейМесяц = День(КонецМесяца(МесяцРасчета));

АдминистраторСправочник = АдминистраторСправочник(Строка.Администратор);
ОкладДляПостоянных = Окр(АдминистраторСправочник.СуммаОклад * КоличествоРасчетныхДней / КоличествоДнейМесяц);
Строка.Оклад = ОкладДляПостоянных;

НадбавкаЗаПроживающихДляПостоянных = Окр(АдминистраторСправочник.НадбавкаЗаПроживающих * КоличествоРасчетныхДней / КоличествоДнейМесяц);
Строка.СуммаЗаПроживающих = НадбавкаЗаПроживающихДляПостоянных;
КонецПроцедуры

&НаСервере
Функция КоличествоРасчетныхДней(ТД) 
//Если Горничная.Наименование = "Сонникова Людмила" Тогда
//	ш= 1;
//КонецЕсли;

РазницаВДняхОбщая = ((НачалоДня(Объект.ДК) - НачалоДня(Объект.ДН)) / (60 * 60 * 24)) + 1;
	
ДнейОтпуска = 0;

Дата_П = Объект.ДН;
Пока Дата_П <= Объект.ДК Цикл
	Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
	Дата_И = СтрЗаменить(Дата_С, ".", "");
	
	Если ТД["НомерСмены_" + Дата_И] = 3 Тогда
		ДнейОтпуска = ДнейОтпуска + 1;
	КонецЕсли;
	
	Дата_П = Дата_П + 24 * 60 * 60;
КонецЦикла;

КоличествоРасчетныхДней = РазницаВДняхОбщая - ДнейОтпуска; 

Возврат КоличествоРасчетныхДней;
КонецФункции

&НаСервере
Функция СуммаНадбавкаЗаСтандарты(Строка) 
//КоличествоРасчетныхДней = КоличествоРасчетныхДней(Строка); 
КоличествоРасчетныхДней = ((НачалоДня(Объект.ДК) - НачалоДня(Объект.ДН)) / (60 * 60 * 24)) + 1;

МесяцРасчета = Объект.ДН;
КоличествоДнейМесяц = День(КонецМесяца(МесяцРасчета));

АдминистраторСправочник = АдминистраторСправочник(Строка.Администратор);
СуммаНадбавкаЗаСтандарты = Окр(АдминистраторСправочник.НадбавкаЗаСтандарты * КоличествоРасчетныхДней / КоличествоДнейМесяц);

Возврат СуммаНадбавкаЗаСтандарты;
КонецФункции

&НаСервере
Функция СуммаНадбавкаЗаИнЯзыки(Строка) 
//КоличествоРасчетныхДней = КоличествоРасчетныхДней(Строка); 
КоличествоРасчетныхДней = ((НачалоДня(Объект.ДК) - НачалоДня(Объект.ДН)) / (60 * 60 * 24)) + 1;
	
МесяцРасчета = Объект.ДН;
КоличествоДнейМесяц = День(КонецМесяца(МесяцРасчета));
АдминистраторСправочник = АдминистраторСправочник(Строка.Администратор);
СуммаНадбавкаЗаИнЯзыки = Окр(АдминистраторСправочник.НадбавкаЗаИнЯзыки * КоличествоРасчетныхДней / КоличествоДнейМесяц);

Возврат СуммаНадбавкаЗаИнЯзыки;
КонецФункции

&НаСервере    
Функция СуммаНадбавкаЗаСтаж(Строка)
Администратор = Строка.Администратор;	
ДатаПриема = Администратор.ДатаПриема; 	
Если НЕ ЗначениеЗаполнено(ДатаПриема) Тогда Возврат 0; КонецЕсли;
Если Администратор.НеНачислятьЗаСтаж Тогда Возврат 0; КонецЕсли;

Если АдминистраторыНадбавкаЗаСтаж.Количество() = 0 Тогда Возврат 0; КонецЕсли;

ДатаУчета = Объект.ДК;
РазницаВДнях = (НачалоДня(ДатаУчета) - НачалоДня(ДатаПриема)) / (60 * 60 * 24);

СуммаНадбавкаЗаСтажПолная = 0;
Для Каждого СтрокаНадбавкаЗаСтаж Из АдминистраторыНадбавкаЗаСтаж Цикл
	Если РазницаВДнях >= СтрокаНадбавкаЗаСтаж.РазницаВДняхС И РазницаВДнях < СтрокаНадбавкаЗаСтаж.РазницаВДняхПо Тогда
		 СуммаНадбавкаЗаСтажПолная = СтрокаНадбавкаЗаСтаж.Сумма;
		 
		 Прервать;
	КонецЕсли;
КонецЦикла;

//КоличествоРасчетныхДней = КоличествоРасчетныхДней(Строка); 
КоличествоРасчетныхДней = ((НачалоДня(Объект.ДК) - НачалоДня(Объект.ДН)) / (60 * 60 * 24)) + 1;

МесяцРасчета = Объект.ДН;
КоличествоДнейМесяц = День(КонецМесяца(МесяцРасчета));
СуммаНадбавкаЗаСтаж = Окр(СуммаНадбавкаЗаСтажПолная * КоличествоРасчетныхДней / КоличествоДнейМесяц);

Возврат СуммаНадбавкаЗаСтаж;
КонецФункции

&НаСервере
Процедура РасчитатьПрочее(Строка)
АдминистраторПрочееИтого = АдминистраторПрочееИтого(Строка.Администратор);
Строка.СуммаПрочее = АдминистраторПрочееИтого; 	
КонецПроцедуры
//

//
&НаКлиенте
Процедура НомерСмены_ПриИзменении(Элемент)
ОбновитьДанныеПоДНиДК();	

ТД = Элементы.ЗарплатаСмены.ТекущиеДанные;

ИмяЭлемента = Элемент.Имя;
Имя_Право = Прав(ИмяЭлемента, 6);

Имя_НомерСмены = "НомерСмены_" + Имя_Право;
НомерСмены = ТД[Имя_НомерСмены];


Если НомерСмены > 0 Тогда
	Постоянный = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(ТД.Администратор, "Постоянный");  
	Если Постоянный Тогда
		ТекстПредупреждения = "Для постоянных администраторов Номер смены д. б. 0 или 3 или 4";
		ПроверкаНомераСмены = НЕ (НомерСмены = 3 ИЛИ НомерСмены = 4);
	Иначе
		ТекстПредупреждения = "Номер смены д. б. 0 или 1 или 2 или 3";
		ПроверкаНомераСмены = НЕ (НомерСмены = 1 ИЛИ НомерСмены = 2 ИЛИ НомерСмены = 3);
	КонецЕсли;	
		
	Если ПроверкаНомераСмены Тогда
		ПоказатьПредупреждение(, ТекстПредупреждения);
		
		ОтборСтроки = Новый Структура("Администратор", ТД.Администратор);
		НайденныеСтрока = ЗарплатаСмены_OldValue.НайтиСтроки(ОтборСтроки);
		НайденнаяСтрока = НайденныеСтрока[0];
		
		ТД[Имя_НомерСмены] = НайденнаяСтрока[Имя_НомерСмены];
		Возврат;
	КонецЕсли;
КонецЕсли;

ИмяДлинаСмены = "ДлинаСмены_" + Имя_Право;
ДлинаСмены = ТД[ИмяДлинаСмены];	

Если НомерСмены = 4 Тогда
	Если ДлинаСмены = 0 Тогда
		 ТД[ИмяДлинаСмены] = 8;
	КонецЕсли;
КонецЕсли;
	
ТС = Элементы.ЗарплатаСмены.ТекущаяСтрока;
РасчитатьСтрокаЗарплатаСмены_НаСервере(ТС, Имя_Право);
КонецПроцедуры

&НаКлиенте
Процедура ДлинаСмены_ПриИзменении(Элемент)
ОбновитьДанныеПоДНиДК();	

ТД = Элементы.ЗарплатаСмены.ТекущиеДанные;

ИмяЭлемента = Элемент.Имя;
Имя_Право = Прав(ИмяЭлемента, 6);

ТС = Элементы.ЗарплатаСмены.ТекущаяСтрока;
РасчитатьСтрокаЗарплатаСмены_НаСервере(ТС, Имя_Право);
КонецПроцедуры

&НаКлиенте
Процедура ПереработкаЧасы_ПриИзменении(Элемент)
ОбновитьДанныеПоДНиДК();	

ТД = Элементы.ЗарплатаСмены.ТекущиеДанные;

ИмяЭлемента = Элемент.Имя;
Имя_Право = Прав(ИмяЭлемента, 6);

ТС = Элементы.ЗарплатаСмены.ТекущаяСтрока;
РасчитатьСтрокаЗарплатаСмены_НаСервере(ТС, Имя_Право);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ГруппаЭлемент_ПриИзменении(Элемент, ЭтоЗамена)
ТС = Элемент.Родитель.Родитель.Родитель.ТекущаяСтрока;		
ТД = ЗарплатаСмены.НайтиПоИдентификатору(ТС);
//ЗарплатаСмены
//1234567890123
ИмяЭлемента = Сред(Элемент.Имя, 14);
Индекс = СтрНайти(ИмяЭлемента, "_Э");
ИмяРеквизита = Сред(ИмяЭлемента, 1, Индекс - 1);  

Если ЭтоЗамена Тогда
	ТД[ИмяРеквизита + "_Р"] = ТД[ИмяРеквизита + "_Э"];
	ТД[ИмяРеквизита + "_Есть"] = Истина;
Иначе
	ТД[ИмяРеквизита + "_Р"] = ТД[ИмяРеквизита + "_Э"] - ТД[ИмяРеквизита];
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаЭлемент_Очистка(Элемент, ЭтоЗамена)
ТС = Элемент.Родитель.Родитель.Родитель.ТекущаяСтрока;		
ТД = ЗарплатаСмены.НайтиПоИдентификатору(ТС);

ИмяРеквизита = Элемент.Имя;
ИмяРеквизита = Сред(ИмяРеквизита, 14);
ИмяРеквизита = Лев(ИмяРеквизита, СтрДлина(ИмяРеквизита) - 2);
	
Если ЭтоЗамена Тогда
	Имя = ИмяРеквизита + "_Р";
	ТД[Имя] = 0;
	Имя = ИмяРеквизита + "_Есть";
	ТД[Имя] = Ложь;
Иначе
	Имя = ИмяРеквизита + "_Р";
	ТД[Имя] = 0;
КонецЕсли;	
Имя = ИмяРеквизита + "_Э";
ТД[Имя] = ТД[ИмяРеквизита];

Элементы.ЗарплатаСмены.ЗакончитьРедактированиеСтроки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаселенийЛайв_ЭПриИзменении(Элемент)
ГруппаЭлемент_ПриИзменении(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаселенийЛайв_ЭОчистка(Элемент, СтандартнаяОбработка)
ГруппаЭлемент_Очистка(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаселенийДомСоветов_ЭПриИзменении(Элемент)
ГруппаЭлемент_ПриИзменении(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаселенийДомСоветов_ЭОчистка(Элемент, СтандартнаяОбработка)
ГруппаЭлемент_Очистка(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаселенийСтритАрт_ЭПриИзменении(Элемент)
ГруппаЭлемент_ПриИзменении(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаселенийСтритАрт_ЭОчистка(Элемент, СтандартнаяОбработка)
ГруппаЭлемент_Очистка(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Оклад_ЭПриИзменении(Элемент)
ГруппаЭлемент_ПриИзменении(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Оклад_ЭОчистка(Элемент, СтандартнаяОбработка)
ГруппаЭлемент_Очистка(Элемент, Истина);
КонецПроцедуры
//

&НаСервере
Процедура РасчитатьСтрокаЗарплатаСмены_НаСервере(ТС, Имя_Право)
ТД = ЗарплатаСмены.НайтиПоИдентификатору(ТС);

РасчитатьСтрокаЗарплатаСменыСмена(ТД, Имя_Право);

ОбновитьСтрокаЗарплатыСмена(ТД);
КонецПроцедуры

//
&НаСервере
Процедура РасчитатьСтрокаЗарплатаСменыСмена(Строка, Имя_Право)
Администратор = Строка.Администратор;

//
ПереработкаЧасы = Строка["ПереработкаЧасы_" + Имя_Право];	
СуммаПереработка = СуммаПереработкаЗаСмену(Администратор, ПереработкаЧасы);
//Имя_П = "СуммаПереработка_" + Имя_Право;
//Строка[Имя_П] = СуммаПереработка; 
//

ДатаСмены = Строка["Дата_" + Имя_Право];

ИмяНомерСмены = "НомерСмены_" + Имя_Право;
НомерСмены = Строка[ИмяНомерСмены];	

//
ИмяДлинаСмены = "ДлинаСмены_" + Имя_Право;
ДлинаСмены = Строка[ИмяДлинаСмены];	

Строка["Часы_" + Имя_Право] = Строка_0(ДлинаСмены, 2) + "-" + Строка_0(НомерСмены, 1) + "/" + Строка_0(ПереработкаЧасы, 2);  

~ВЫХОД:
КонецПроцедуры

&НаСервере
Функция Строка_0(Число, Длина)
Строка = Строка(Число);  	
Длина_0 = Длина - СтрДлина(Строка); 
Если Длина_0 > 0 Тогда
	Результат = "";
	Для Счетчик = 1 По Длина_0 Цикл
		Результат = Результат + "0";
	КонецЦикла;
	
	Строка = Строка + Результат;
КонецЕсли;

Возврат Строка;
КонецФункции

&НаСервере
Функция СтавкаЗаОтпуск(Администратор)
АдминистраторСправочник = АдминистраторСправочник(Администратор);	
СтавкаЗаОтпуск = АдминистраторСправочник.СтавкаЗаОтпуск;

Возврат СтавкаЗаОтпуск;
КонецФункции

&НаСервере
Функция СтавкаЗаСмену12(Администратор)
АдминистраторСправочник = АдминистраторСправочник(Администратор);	
СтавкаЗаСмену12 = АдминистраторСправочник.СтавкаЗаСмену12;

Возврат СтавкаЗаСмену12;
КонецФункции

&НаСервере
Функция СтавкаЗаСмену24(Администратор)
АдминистраторСправочник = АдминистраторСправочник(Администратор);	
СтавкаЗаСмену24 = АдминистраторСправочник.СтавкаЗаСмену24;

Возврат СтавкаЗаСмену24;
КонецФункции

&НаСервере
Функция НадбавкаЗаСтандарты(Администратор)
АдминистраторСправочник = АдминистраторСправочник(Администратор);	
НадбавкаЗаСтандарты = АдминистраторСправочник.НадбавкаЗаСтандарты;

Возврат НадбавкаЗаСтандарты;
КонецФункции

&НаСервере
Функция СуммаОкладПостоянный(Администратор)
АдминистраторСправочник = АдминистраторСправочник(Администратор);	
СуммаОкладПостоянный = АдминистраторСправочник.СуммаОклад;

Возврат СуммаОкладПостоянный;
КонецФункции

&НаСервере
Функция НадбавкаЗаПроживающихПостоянный(Администратор)
АдминистраторСправочник = АдминистраторСправочник(Администратор);	
НадбавкаЗаПроживающихПостоянный = АдминистраторСправочник.НадбавкаЗаПроживающих;

Возврат НадбавкаЗаПроживающихПостоянный;
КонецФункции

&НаСервере
Функция НадбавкаЗаИнЯзыки(Администратор)
АдминистраторСправочник = АдминистраторСправочник(Администратор);	
НадбавкаЗаИнЯзыки = АдминистраторСправочник.НадбавкаЗаИнЯзыки;

Возврат НадбавкаЗаИнЯзыки;
КонецФункции


&НаСервере
Функция ОкладЗаСмену(Администратор, ДлинаСмены)

АдминистраторСправочник = АдминистраторСправочник(Администратор);

Если ДлинаСмены = 0 Тогда	
	ОкладЗаСмену = 0;
ИначеЕсли ДлинаСмены <= 12 Тогда	
	ОкладЗаСмену = Окр(АдминистраторСправочник.СтавкаЗаСмену12 * (ДлинаСмены / 12));	
Иначе
	Если ДлинаСмены > 12 И ДлинаСмены <= 24 Тогда	
		ОкладЗаСмену = Окр(АдминистраторСправочник.СтавкаЗаСмену24 * (ДлинаСмены / 24));
	Иначе
		ОкладЗаСмену = АдминистраторСправочник.СтавкаЗаСмену24;
	КонецЕсли;
КонецЕсли;

Возврат ОкладЗаСмену;
КонецФункции

&НаСервере
Функция СуммаПереработкаЗаСмену(Администратор, ПереработкаЧасы)
АдминистраторСправочник = АдминистраторСправочник(Администратор);	
СуммаПереработки = АдминистраторСправочник.СтавкаЗаПереработку * ПереработкаЧасы;

Возврат СуммаПереработки;
КонецФункции

&НаСервере
Функция АдминистраторСправочник(Администратор)
ОтборСтрок = Новый Структура("Администратор", Администратор);
НайденныеСтроки = АдминистраторыСправочник.НайтиСтроки(ОтборСтрок);
АдминистраторСправочник = НайденныеСтроки[0];

Возврат АдминистраторСправочник;
КонецФункции


&НаСервере
Функция КоличествоЗаселенийЗаСмену(Заселения, Администратор, ДатаВремяС, ДатаВремяПо)
ОтборСтроки = Новый Структура("Администратор", Администратор); 	
НайденныеСтроки = Заселения.НайтиСтроки(ОтборСтроки);

КоличествоЗаселений = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	Если НЕ (Строка.ДатаВремя >= ДатаВремяС И Строка.ДатаВремя <= ДатаВремяПо) Тогда Продолжить; КонецЕсли; 
	
	КоличествоЗаселений = КоличествоЗаселений + 1;		
КонецЦикла;
	
Возврат КоличествоЗаселений;
КонецФункции

&НаСервере
Функция СуммаЗаселенийЗаСмену(Администратор, КоличествоЗаселений)
АдминистраторСправочник = АдминистраторСправочник(Администратор);
СтавкаЗаЗаселение = АдминистраторСправочник.СтавкаЗаЗаселение;

СуммаЗаселений =  КоличествоЗаселений * СтавкаЗаЗаселение;

Возврат СуммаЗаселений;
КонецФункции

&НаСервере
Функция СуммаЗавтракиЧеховЗаСмену(Администратор, КоличествоЗавтраки)
АдминистраторСправочник = АдминистраторСправочник(Администратор);
СтавкаЗавтраки = АдминистраторСправочник.СтавкаЗавтракиЧехов;

СуммаЗавтраки =  КоличествоЗавтраки * СтавкаЗавтраки;

Возврат СуммаЗавтраки;
КонецФункции

&НаСервере
Функция СуммаЗавтракиДомСоветовЗаСмену(Администратор, КоличествоЗавтраки)
АдминистраторСправочник = АдминистраторСправочник(Администратор);
СтавкаЗавтраки = АдминистраторСправочник.СтавкаЗавтракиДомСоветов;

СуммаЗавтраки =  КоличествоЗавтраки * СтавкаЗавтраки;

Возврат СуммаЗавтраки;
КонецФункции

&НаСервере
Функция СуммаЗавтракиЛайвЗаСмену(Администратор, КоличествоЗавтраки)
АдминистраторСправочник = АдминистраторСправочник(Администратор);
СтавкаЗавтраки = АдминистраторСправочник.СтавкаЗавтракиЛайв;

СуммаЗавтраки =  КоличествоЗавтраки * СтавкаЗавтраки;

Возврат СуммаЗавтраки;
КонецФункции

&НаСервере
Функция СуммаЗаПроживающихЗаСмену(ДатаСмены, ДлинаСмены)
КоличествоНомеровЗаСмену = Документы.АдминистраторыЗарплата.КоличествоНомеровЗаСмену(Проживающие, ДатаСмены) ;

СуммаЗаПроживающихЗаСменуПолная = Документы.АдминистраторыЗарплата.СуммаЗаПроживающихЗаСмену(АдминистраторыСуммаЗаПроживающих
	, КоличествоНомеровЗаСмену, ДлинаСмены);	

//АдминистраторыВСмену = Менеджер.АдминистраторыВСмену(ЗарплатаСмены, ДатаСмены);
//КоличествоАдминистроровВСмену = АдминистраторыВСмену.Количество();

//Если КоличествоАдминистроровВСмену > 0 Тогда 
//	СуммаЗаПроживающихЗаСмену = Окр(СуммаЗаПроживающихЗаСменуПолная / КоличествоАдминистроровВСмену);
//Иначе
//	СуммаЗаПроживающихЗаСмену = 0;
//КонецЕсли;

СуммаЗаПроживающихЗаСмену = СуммаЗаПроживающихЗаСменуПолная;
Возврат СуммаЗаПроживающихЗаСмену;
КонецФункции
//  


//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
//ОбновитьСтрокаЗарплатыСмена(Строка)
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//ОбновитьЗарплатаСтроки();
КонецПроцедуры

 
///////

//
//

//

&НаКлиенте
Процедура ЗарплатаСменыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ТС = Элемент.ТекущаяСтрока;	
ЗарплатаСменыПриОкончанииРедактированияНаСервере(ТС);
КонецПроцедуры

&НаСервере
Процедура ЗарплатаСменыПриОкончанииРедактированияНаСервере(ТС)
ТД = ЗарплатаСмены.НайтиПоИдентификатору(ТС);

ОбновитьСтрокаЗарплатаСменыДаты_Э(ТД);

ОбновитьСтрокаЗарплатыСменаИзДат(ТД);	

ОбновитьСтрокаЗарплатаСменыОсновные_Э(ТД);

ОбновитьЗарплатаСменыИтоги(ТД);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Элемент.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	
Если Поле.Имя = "ЗарплатаСменыДопУслуги" Тогда 
	Массив = Новый Массив;		
	Дата_П = Объект.ДН;
	Пока Дата_П <= Объект.ДК Цикл
		Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
		Дата_И = СтрЗаменить(Дата_С, ".", "");
		
		СуммаДопУслуги = ТД["СуммаДопУслуги_" + Дата_И];
		Если СуммаДопУслуги <> 0 Тогда 
			Данные = Новый Структура("Дата, Сумма", Дата_П, СуммаДопУслуги);
			Массив.Добавить(Данные);
		КонецЕсли;
		
		Дата_П = Дата_П + 24 * 60 * 60;
	КонецЦикла;
	ПараметрыФормы = Новый Структура("ДопУслуги", Массив);
	
	ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.ДопУслугиРасшифровка", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
ИначеЕсли Поле.Имя = "ЗарплатаСменыСуммаПрочее" Тогда 
	Массив = Новый Массив;
	Для Каждого Строка Из Объект.Прочее Цикл
		Если Строка.Администратор <> ТД.Администратор Тогда Продолжить; КонецЕсли;
		
		Данные = Новый Структура("Дата, Наименование,Сумма", Строка.Дата, Строка.Наименование, Строка.Сумма);
		Массив.Добавить(Данные);
	КонецЦикла;

	ПараметрыФормы = Новый Структура("Прочее", Массив);
	
	ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.ПрочееРасшифровка", ПараметрыФормы, ЭтаФорма
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецЕсли;
 	
КонецПроцедуры



//
&НаКлиенте
Процедура ЗарплатаСменыЭлемент_ПриИзменении(Элемент, ЭтоЗамена)
ТС = Элемент.Родитель.ТекущаяСтрока;		
ТД = ЗарплатаСмены.НайтиПоИдентификатору(ТС);
//ЗарплатаСмены
//1234567890123
ИмяЭлемента = Сред(Элемент.Имя, 14);
Индекс = СтрНайти(ИмяЭлемента, "_Э");
ИмяРеквизита = Сред(ИмяЭлемента, 1, Индекс - 1);  

Если ЭтоЗамена Тогда
	ТД[ИмяРеквизита + "_Р"] = ТД[ИмяРеквизита + "_Э"];
	ТД[ИмяРеквизита + "_Есть"] = Истина;
Иначе
	ТД[ИмяРеквизита + "_Р"] = ТД[ИмяРеквизита + "_Э"] - ТД[ИмяРеквизита];
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыЭлемент_Очистка(Элемент, ЭтоЗамена)
ТС = Элемент.Родитель.ТекущаяСтрока;		
ТД = ЗарплатаСмены.НайтиПоИдентификатору(ТС);

ИмяРеквизита = Элемент.Имя;
ИмяРеквизита = Сред(ИмяРеквизита, 14);
ИмяРеквизита = Лев(ИмяРеквизита, СтрДлина(ИмяРеквизита) - 2);
	
Если ЭтоЗамена Тогда
	Имя = ИмяРеквизита + "_Р";
	ТД[Имя] = 0;
	Имя = ИмяРеквизита + "_Есть";
	ТД[Имя] = Ложь;
Иначе
	Имя = ИмяРеквизита + "_Р";
	ТД[Имя] = 0;
КонецЕсли;	
Имя = ИмяРеквизита + "_Э";
ТД[Имя] = ТД[ИмяРеквизита];

Элементы.ЗарплатаСмены.ЗакончитьРедактированиеСтроки(Ложь);
КонецПроцедуры

//
&НаКлиенте
Процедура ЗарплатаСменыОклад_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыОклад_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыСуммаПереработка_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыСуммаПереработка_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыНадбавкаЗаСтаж_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыНадбавкаЗаСтаж_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыНадбавкаЗаСтандарты_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыНадбавкаЗаСтандарты_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыНадбавкаЗаИнЯзыки_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыНадбавкаЗаИнЯзыки_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыСуммаЗаПроживающих_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыСуммаЗаПроживающих_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыКоличествоЗаселенийЛайв_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыКоличествоЗаселенийЛайв_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыКоличествоЗаселенийДомСоветов_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыКоличествоЗаселенийДомСоветов_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыКоличествоЗаселенийСтритАрт_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыКоличествоЗаселенийСтритАрт_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыОтпуск_ЭПриИзменении(Элемент)
ЗарплатаСменыЭлемент_ПриИзменении(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСменыОтпуск_ЭОчистка(Элемент, СтандартнаяОбработка)
ЗарплатаСменыЭлемент_Очистка(Элемент, Истина);
КонецПроцедуры
//

//

//
&НаКлиенте
Процедура ПрочееАдминистраторОтборПриИзменении(Элемент)
УстановитьПрочееОтбор();	
КонецПроцедуры

&НаКлиенте
Процедура ПрочееДатаОтборПриИзменении(Элемент)
УстановитьПрочееОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ПрочееНаименованиеОтборПриИзменении(Элемент)
УстановитьПрочееОтбор();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПрочееОтбор()
ОтборСтрок = Новый Структура;
Если ЗначениеЗаполнено(ПрочееАдминистраторОтбор) Тогда
	ОтборСтрок.Вставить("Администратор", ПрочееАдминистраторОтбор);
КонецЕсли;

Если ЗначениеЗаполнено(ПрочееДатаОтбор) Тогда
	ОтборСтрок.Вставить("Дата", ПрочееДатаОтбор);
КонецЕсли;

Если ЗначениеЗаполнено(ПрочееНаименованиеОтбор) Тогда
	ОтборСтрок.Вставить("Наименование", ПрочееНаименованиеОтбор);
КонецЕсли;

Если ОтборСтрок.Количество() = 0 Тогда
	Элементы.Прочее.ОтборСтрок = Неопределено;
Иначе
	Элементы.Прочее.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
КонецЕсли;	
КонецПроцедуры
//

&НаКлиенте
Процедура ПрочееПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
ТД = Элемент.ТекущиеДанные;
ПрочееАдминистратор_OldValue = ТД.Администратор;
ПрочееДата_OldValue = ТД.Дата;
ПрочееСумма_OldValue = ТД.Сумма;
КонецПроцедуры

&НаКлиенте
Процедура ПрочееПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ТД = Элемент.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

Текст = "";
Если НЕ ЗначениеЗаполнено(ТД.Администратор) Тогда
	Текст = ОбщийФункционалКлиентСервер.ДобавитьТекст(Текст, "Администратор должен быть заполнен.", Символы.ПС);
КонецЕсли;	
Если НЕ ЗначениеЗаполнено(ТД.Дата) Тогда
	Текст = ОбщийФункционалКлиентСервер.ДобавитьТекст(Текст, "Дата должна быть заполнена.", Символы.ПС);
КонецЕсли;	

Если Текст <> "" Тогда
	ПоказатьПредупреждение(,Текст);	
КонецЕсли;

ТС = Элемент.ТекущаяСтрока;
ОбновитьПрочееСтрокаИзКлиента(ТС);
			
АдминистраторПрочееИтогоДействие(ТД);	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПрочееСтрокаИзКлиента(ТС)
ТД = Объект.Прочее.НайтиПоИдентификатору(ТС);	

ОбновитьПрочееСтрока(ТД);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПрочееСтрока(ТД)

//ТД.Итого = ПрочееИтого(ТД);
ТД.Сумма = ПрочееИтого(ТД);
КонецПроцедуры			

&НаСервере
Функция ПрочееИтого(ТД)
Если НЕ (ЗначениеЗаполнено(ТД.Администратор) И ЗначениеЗаполнено(ТД.Дата)) Тогда
	Возврат 0;
КонецЕсли;

Итого = ТД.Сумма;
			
Возврат Итого;			
КонецФункции	

&НаКлиенте		
Процедура АдминистраторПрочееИтогоДействие(ТД)
Если ЗначениеЗаполнено(ТД.Администратор) Тогда
	//ОтборСтроки = Новый Структура("Администратор", ТД.Администратор);	
	//НайденныеСтроки = Объект.Прочее.НайтиСтроки(ОтборСтроки);
	//АдминистраторПрочееИтого = 0;
	//Для Каждого Строка Из НайденныеСтроки Цикл
	//	Если Строка.Дата < Объект.ДН ИЛИ Строка.Дата > Объект.ДК Тогда Продолжить; КонецЕсли; 
	//	
	//	АдминистраторПрочееИтого = АдминистраторПрочееИтого + Строка.Сумма; 		
	//КонецЦикла;
	
	АдминистраторПрочееИтого = АдминистраторПрочееИтого(ТД.Администратор);
	ОтборСтроки = Новый Структура("Администратор", ТД.Администратор);	
	НайденныеСтрокиЗарплата = ЗарплатаСмены.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтрокиЗарплата.Количество() > 0 Тогда 
		НайденнаяСтрокаЗарплата = НайденныеСтрокиЗарплата[0];
		НайденнаяСтрокаЗарплата.СуммаПрочее = АдминистраторПрочееИтого;
	КонецЕсли;
Иначе	
	ОтборСтроки = Новый Структура("Администратор", ПрочееАдминистратор_OldValue);
	НайденныеСтрокиЗарплата = ЗарплатаСмены.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтрокиЗарплата.Количество() > 0 Тогда 
		НайденнаяСтрокаЗарплата = НайденныеСтрокиЗарплата[0];
		НайденнаяСтрокаЗарплата.СуммаПрочее = НайденнаяСтрокаЗарплата.СуммаПрочее - ПрочееСумма_OldValue;
	КонецЕсли;
КонецЕсли;

Если НайденныеСтрокиЗарплата.Количество() > 0 Тогда 
	Идентификатор = НайденнаяСтрокаЗарплата.ПолучитьИдентификатор();
	ОбновитьЗарплатаИтогоИзКлиента(Идентификатор);
КонецЕсли;
КонецПроцедуры         

&НаСервере
Функция АдминистраторПрочееИтого(Администратор)
ОтборСтроки = Новый Структура("Администратор", Администратор);	
НайденныеСтроки = Объект.Прочее.НайтиСтроки(ОтборСтроки);
АдминистраторПрочееИтого = 0;
Для Каждого Строка Из НайденныеСтроки Цикл
	Если Строка.Дата < Объект.ДН ИЛИ Строка.Дата > Объект.ДК Тогда Продолжить; КонецЕсли; 
	
	АдминистраторПрочееИтого = АдминистраторПрочееИтого + Строка.Сумма; 		
КонецЦикла;

Возврат АдминистраторПрочееИтого;
КонецФункции

&НаСервере
Процедура ОбновитьЗарплатаИтогоИзКлиента(Идентификатор)
ТД = ЗарплатаСмены.НайтиПоИдентификатору(Идентификатор);	
ОбновитьЗарплатаСменыИтоги(ТД);
КонецПроцедуры	

&НаКлиенте
Процедура ПрочееПередУдалением(Элемент, Отказ)
ТД = Элемент.ТекущиеДанные;

ОтборСтроки = Новый Структура("Администратор", ТД.Администратор);	
НайденныеСтроки = ЗарплатаСмены.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда 
	НайденнаяСтрока = НайденныеСтроки[0];
	
	НайденнаяСтрока.СуммаПрочее = НайденнаяСтрока.СуммаПрочее - ТД.Сумма;
	
	Идентификатор = НайденнаяСтрока.ПолучитьИдентификатор();
	ОбновитьЗарплатаИтогоИзКлиента(Идентификатор);
КонецЕсли;
КонецПроцедуры
//

&НаКлиенте
Процедура ПрочееДатаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


//
&НаКлиенте
Процедура ПроверитьСуммуЗаПроживающих(Команда)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 	
	
ТД = Элементы.ЗарплатаСмены.ТекущиеДанные;	
Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	
ПараметрыФормы = Новый Структура("ЗарплатаСмены, Проживающие, АдминистраторыСуммаЗаПроживающих, Администратор, ДН, ДК"
	, ЗарплатаСмены, Проживающие, АдминистраторыСуммаЗаПроживающих, ТД.Администратор, Объект.ДН, Объект.ДК);	
	
ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.ЗарплатаЗаПроживающих", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаселения(Команда)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 	
	
ОбновитьДанныеПоДНиДК();

ТД = Элементы.ЗарплатаСмены.ТекущиеДанные;	
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

Если Команда.Имя = "ПроверитьЗаселенияВЛайв" Тогда
	Заселения = ЗаселенияВЛайв;
ИначеЕсли Команда.Имя = "ПроверитьЗаселенияВДомСоветов" Тогда
	Заселения = ЗаселенияВДомСоветов;
ИначеЕсли Команда.Имя = "ПроверитьЗаселенияВСтритАрт" Тогда
	Заселения = ЗаселенияВСтритАрт;
Иначе
	Возврат;
КонецЕсли;

ПараметрыФормы = Новый Структура("Заселения, Администратор", Заселения, ТД.Администратор);	
	
ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.Заселения", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаселенияНаДату(Команда)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 	
	
ТД = Элементы.ЗарплатаСмены.ТекущиеДанные;	
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

//ЭтаФорма.ТекущийЭлемент.ТекущийЭлемент
//ЗарплатаСменыОклад_010524_Э
Попытка
	Имя = ЭтаФорма.ТекущийЭлемент.ТекущийЭлемент.Имя;
Исключение
	Возврат;
КонецПопытки;
	
Массив = Новый Массив;
Массив.Добавить("Дата");
Массив.Добавить("НомерСмены");
Массив.Добавить("ДлинаСмены");
Массив.Добавить("ПереработкаЧасы");
Массив.Добавить("КоличествоЗаселенийЛайв");
Массив.Добавить("КоличествоЗаселенийДомСоветов");
Массив.Добавить("КоличествоЗаселенийСтритАрт");
Массив.Добавить("КоличествоЗавтракиЧехов");
Массив.Добавить("КоличествоЗавтракиДомСоветов");
Массив.Добавить("КоличествоЗавтракиЛайв");

Массив.Добавить("Итого");
Массив.Добавить("Оклад");
Массив.Добавить("СуммаПереработка");
Массив.Добавить("СуммаЗаПроживающих");
Массив.Добавить("СуммаЗаселенийЛайв");
Массив.Добавить("СуммаЗаселенийДомСоветов");
Массив.Добавить("СуммаЗаселенийСтритАрт");
Массив.Добавить("СуммаЗавтракиЧехов");
Массив.Добавить("СуммаЗавтракиДомСоветов");
Массив.Добавить("СуммаЗавтракиЛайв");

Массив.Добавить("СуммаДопУслуги");

Индекс = СтрНайти(Имя, "_");
Если Индекс = 0 Тогда Возврат; КонецЕсли;

Имя_Право = Лев(Имя, Индекс - 1);
//ЗарплатаСменыОклад_010524_Э
//1234567890123
ИмяРеквизитаПолное = Сред(Имя_Право, 14);
Если СтрДлина(ИмяРеквизитаПолное) = 0 Тогда Возврат; КонецЕсли;

Индекс = СтрНайти(ИмяРеквизитаПолное, "_", , 2);
Если Индекс > 0 Тогда 
	ИмяРеквизита = Лев(ИмяРеквизитаПолное, Индекс - 1);  
Иначе	
	ИмяРеквизита = ИмяРеквизитаПолное;
КонецЕсли;

НетРеквизит = Истина;
Для Каждого Элемент Из Массив Цикл
	Если Элемент = ИмяРеквизита Тогда
		НетРеквизит = Ложь;
		
		Прервать;
	КонецЕсли;
КонецЦикла;

Если НетРеквизит Тогда Возврат; КонецЕсли;

Индекс = СтрНайти(Имя, "_");
Если Индекс = 0 Тогда Возврат; КонецЕсли;

Дата_С = Сред(Имя, Индекс + 1, 6);

День_С = Лев(Дата_С, 2);
Месяц_С = Сред(Дата_С, 3, 2);
Год_С = Сред(Дата_С, 5, 2);

День = ОбщийФункционалКлиентСервер.ПолучитьЧисло(День_С);
Месяц = ОбщийФункционалКлиентСервер.ПолучитьЧисло(Месяц_С);
Год = ОбщийФункционалКлиентСервер.ПолучитьЧисло(Год_С) + 2000;

ДатаОтбора = Дата(Год, Месяц, День); 


Если Команда.Имя = "ЗаселенияВЛайвНаДату" Тогда
	Заселения = ЗаселенияВЛайв;
ИначеЕсли Команда.Имя = "ЗаселенияВДомСоветовНаДату" Тогда
	Заселения = ЗаселенияВДомСоветов;
ИначеЕсли Команда.Имя = "ЗаселенияВСтритАртНаДату" Тогда
	Заселения = ЗаселенияВСтритАрт;
Иначе
	Возврат;
КонецЕсли;

ПараметрыФормы = Новый Структура("Заселения, ДатаОтбора, Администратор", Заселения, ДатаОтбора, ТД.Администратор);	
	
ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.ЗаселенияНаДату", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаселенияВЛайв(Команда)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 	
	
ОбновитьДанныеПоДНиДК();

ТД = Элементы.ЗарплатаСмены.ТекущиеДанные;	
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ПараметрыФормы = Новый Структура("ЗаселенияВЛайв, Администратор", ЗаселенияВЛайв, ТД.Администратор);	
	
ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.ЗаселенияВЛайв", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаселенияВЛайвНаДату(Команда)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 	
	
ТД = Элементы.ЗарплатаСмены.ТекущиеДанные;	
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

//ЭтаФорма.ТекущийЭлемент.ТекущийЭлемент
//ЗарплатаСменыОклад_010524_Э
Попытка
	Имя = ЭтаФорма.ТекущийЭлемент.ТекущийЭлемент.Имя;
Исключение
	Возврат;
КонецПопытки;
	
Массив = Новый Массив;
Массив.Добавить("НомерСмены");
Массив.Добавить("ДлинаСмены");
Массив.Добавить("ПереработкаЧасы");
Массив.Добавить("КоличествоЗаселенийЛайв");
//"КоличествоЗаселенийЛайв_" + Дата_И + "_Э";

Массив.Добавить("Итого");
Массив.Добавить("Оклад");
//"Оклад_" + Дата_И + "_Э"

Массив.Добавить("СуммаПереработка");
Массив.Добавить("СуммаЗаПроживающих");
Массив.Добавить("СуммаЗаселенийЛайв");

Индекс = СтрНайти(Имя, "_");
Если Индекс = 0 Тогда Возврат; КонецЕсли;

Имя_Право = Лев(Имя, Индекс - 1);
//ЗарплатаСменыОклад_010524_Э
//1234567890123
ИмяРеквизитаПолное = Сред(Имя_Право, 14);
Если СтрДлина(ИмяРеквизитаПолное) = 0 Тогда Возврат; КонецЕсли;

Индекс = СтрНайти(ИмяРеквизитаПолное, "_", , 2);
Если Индекс > 0 Тогда 
	ИмяРеквизита = Лев(ИмяРеквизитаПолное, Индекс - 1);  
Иначе	
	ИмяРеквизита = ИмяРеквизитаПолное;
КонецЕсли;

НетРеквизит = Истина;
Для Каждого Элемент Из Массив Цикл
	Если Элемент = ИмяРеквизита Тогда
		НетРеквизит = Ложь;
		
		Прервать;
	КонецЕсли;
КонецЦикла;

Если НетРеквизит Тогда Возврат; КонецЕсли;

Индекс = СтрНайти(Имя, "_");
Если Индекс = 0 Тогда Возврат; КонецЕсли;

Дата_С = Сред(Имя, Индекс + 1, 6);

День_С = Лев(Дата_С, 2);
Месяц_С = Сред(Дата_С, 3, 2);
Год_С = Сред(Дата_С, 5, 2);

День = ОбщийФункционалКлиентСервер.ПолучитьЧисло(День_С);
Месяц = ОбщийФункционалКлиентСервер.ПолучитьЧисло(Месяц_С);
Год = ОбщийФункционалКлиентСервер.ПолучитьЧисло(Год_С) + 2000;

ДатаОтбора = Дата(Год, Месяц, День); 


Если Команда.Имя = "ПроверитьЗаселенияВЛайв" Тогда
	Заселения = ЗаселенияВЛайв;
ИначеЕсли Команда.Имя = "ПроверитьЗаселенияВДомСоветов" Тогда
	Заселения = ЗаселенияВДомСоветов;
Иначе
	Возврат;
КонецЕсли;

ПараметрыФормы = Новый Структура("Заселения, ДатаОтбора, Администратор", Заселения, ДатаОтбора, ТД.Администратор);	
	
ОткрытьФорму("Документ.АдминистраторыЗарплата.Форма.ЗаселенияНаДату", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтчетЗарплата(Команда)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 
	
ТабДок = ОтчетЗарплатаНаСервере();

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Зарплаты администраторов"); 
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, , Истина);
КонецПроцедуры   

&НаСервере
Функция ОтчетЗарплатаНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Документы.АдминистраторыЗарплата.ПолучитьМакет("Макет");	

//Область = Макет.ПолучитьОбласть("Заголовок");
//ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

Для Каждого Строка Из ЗарплатаСмены Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.Администратор = Строка.Администратор;
	
	Область.Параметры.КоличествоСмен = Строка.КоличествоСмен;
	Область.Параметры.Оклад = Строка.Оклад_Э;
	Область.Параметры.Переработка = Строка.СуммаПереработка_Э;
	Область.Параметры.Отпуск = Строка.Отпуск_Э;
	Область.Параметры.НадбавкаЗаСтаж = Строка.НадбавкаЗаСтаж_Э;
	Область.Параметры.НадбавкаЗаСтандарты = Строка.НадбавкаЗаСтандарты_Э;
	Область.Параметры.НадбавкаЗаИнЯзыки = Строка.НадбавкаЗаИнЯзыки_Э;
	
	Область.Параметры.ДопУслуги = Строка.ДопУслуги;
	Область.Параметры.Больничный = Строка.Больничный;
	Область.Параметры.Премия = Строка.Премия;
	
	Область.Параметры.СуммаЗаПроживающих = Строка.СуммаЗаПроживающих_Э;
	
	Область.Параметры.СуммаЗаселенийЛайв = Строка.СуммаЗаселенийЛайв_Э;
	Область.Параметры.СуммаЗаселенийДомСоветов = Строка.СуммаЗаселенийДомСоветов_Э;
	Область.Параметры.СуммаЗаселенийСтритАрт = Строка.СуммаЗаселенийСтритАрт_Э;
	
	Область.Параметры.СуммаЗавтракиЧехов = Строка.СуммаЗавтракиЧехов_Э;
	Область.Параметры.СуммаЗавтракиДомСоветов = Строка.СуммаЗавтракиДомСоветов_Э;
	Область.Параметры.СуммаЗавтракиЛайв = Строка.СуммаЗавтракиЛайв_Э;
	
	Область.Параметры.СуммаПрочее = Строка.СуммаПрочее;
	
	Область.Параметры.ЗарплатаИтого = Строка.Итого;
	
	Область.Параметры.АвансНал = Строка.АвансНал;
	Область.Параметры.АвансКарта = Строка.АвансКарта;
	
	Область.Параметры.ОтпускныеКарта = Строка.ОтпускныеКарта;
	Область.Параметры.ЗПКарта = Строка.ЗПКарта;
	Область.Параметры.ИныеВыплатыНал = Строка.ИныеВыплатыНал;
	Область.Параметры.ИныеВыплатыКарта = Строка.ИныеВыплатыКарта;
	
	Область.Параметры.КВыплате = Строка.КВыплате;
	
	Область.Параметры.СуммаМинимум = Строка.СуммаМинимум;
	
	ТабДок.Вывести(Область);
КонецЦикла;

Если ОтельИмя = "Реноме" Тогда 
	ТабДок.УдалитьОбласть(ТабДок.Область(,14, ,18), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
ИначеЕсли ОтельИмя = "Чехов" Тогда 
	ТабДок.УдалитьОбласть(ТабДок.Область(,13, ,13), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	ТабДок.УдалитьОбласть(ТабДок.Область(,18, ,18), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
ИначеЕсли ОтельИмя = "Лайв" Тогда 
	ТабДок.УдалитьОбласть(ТабДок.Область(,13, ,17), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
КонецЕсли;

	//ОтельИмя = "Чехов";
	//ОтельИмя = "Лайв";
	
Возврат ТабДок;
КонецФункции
//

&НаКлиенте
Процедура ОтчетЗарплатаОбщий(Команда)
ТабДок = ОтчетЗарплатаОбщийНаСервере();

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Зарплаты администраторов с "
							+ Формат(Объект.ДН, "ДФ=dd.MM.yy") + " по " + Формат(Объект.ДК, "ДФ=dd.MM.yy")) ; 
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ,Истина);	
КонецПроцедуры

&НаСервере
Функция ОтчетЗарплатаОбщийНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = ПолучитьОбщийМакет("МакетЗарплатаОбщий");	

//Область = Макет.ПолучитьОбласть("Заголовок");
//ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
//Если НастройкиСервер.ЭтоСтритАрт() Тогда
//	Область.Параметры.Оклад = "Оклад \ коворкинг";
//Иначе
	Область.Параметры.Оклад = "Оклад";
//КонецЕсли;

ТабДок.Вывести(Область);

Для Каждого Строка Из ЗарплатаСмены Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.Сотрудник = Строка.Администратор;
	Область.Параметры.ТипДолжности = Строка.Администратор.Должность.ТипДолжности;
	Область.Параметры.Должность = Строка.Администратор.Должность;
	
	Область.Параметры.КоличествоСмен = Строка.КоличествоСмен;
	КоличествоЧасовОтчет = КоличествоЧасовОтчет(Строка.Администратор);
	Область.Параметры.КоличествоЧасовОтчет = КоличествоЧасовОтчет;
	
	Область.Параметры.Оклад = Строка.Оклад_Э;
	Область.Параметры.Переработка = Строка.СуммаПереработка_Э;
	Область.Параметры.Отпуск = Строка.Отпуск_Э;
	Область.Параметры.НадбавкаЗаСтаж = Строка.НадбавкаЗаСтаж_Э;
	Область.Параметры.НадбавкаЗаСтандарты = Строка.НадбавкаЗаСтандарты_Э;
	Область.Параметры.НадбавкаЗаИнЯзыки = Строка.НадбавкаЗаИнЯзыки_Э;
	
	Область.Параметры.ДопУслуги = Строка.ДопУслуги;
	
	Область.Параметры.Больничный = Строка.Больничный;
	Область.Параметры.Премия = Строка.Премия;
	
	Область.Параметры.СуммаЗаПроживающих = Строка.СуммаЗаПроживающих_Э;
	
	Область.Параметры.СуммаЗаселенийЛайв = Строка.СуммаЗаселенийЛайв_Э;
	Область.Параметры.СуммаЗаселенийДомСоветов = Строка.СуммаЗаселенийДомСоветов_Э;
	Область.Параметры.СуммаЗаселенийСтритАрт = Строка.СуммаЗаселенийСтритАрт_Э;
	
	Область.Параметры.СуммаЗавтракиЧехов = Строка.СуммаЗавтракиЧехов_Э;
	Область.Параметры.СуммаЗавтракиДомСоветов = Строка.СуммаЗавтракиДомСоветов_Э;
	Область.Параметры.СуммаЗавтракиЛайв = Строка.СуммаЗавтракиЛайв_Э;
	
	Область.Параметры.СуммаПрочее = Строка.СуммаПрочее;
	
	Область.Параметры.ЗарплатаИтого = Строка.Итого;
	
	Область.Параметры.Аванс_Нал = Строка.АвансНал;
	Область.Параметры.Аванс_кк = Строка.АвансКарта;
	
	Область.Параметры.Отпуск_кк = Строка.ОтпускныеКарта;
	
	Область.Параметры.Зарплата_кк = Строка.ЗПКарта;
	
	Область.Параметры.ИныеВыплаты_нал = Строка.ИныеВыплатыНал;
	
	Область.Параметры.ИныеВыплатыКарта = Строка.ИныеВыплатыКарта;
	
	Область.Параметры.СуммаМинимум = Строка.СуммаМинимум;
	
	Область.Параметры.ОстатокКВыдаче = Строка.КВыплате;
	
	ТабДок.Вывести(Область);
КонецЦикла;


ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

Возврат ТабДок;
КонецФункции

&НаСервере
Функция КоличествоЧасовОтчет(Администратор)
Если Администратор.Постоянный Тогда
	//КоличествоЧасовОтчет = 0;
	
	ОтборСтроки = Новый Структура("Администратор", Администратор);
	ТЗ = Объект.ЗарплатаСмены.Выгрузить(ОтборСтроки);
	
	//КоличествоЧасовОтчет = ТЗ.Итог("ДлинаСмены");
	КоличествоЧасовДлинаСмены = ТЗ.Итог("ДлинаСмены");
	КоличествоЧасовПереработкаЧасы = ТЗ.Итог("ПереработкаЧасы"); 
	КоличествоЧасовОтчет = КоличествоЧасовДлинаСмены + КоличествоЧасовПереработкаЧасы;

Иначе
	ОтборСтроки = Новый Структура("Администратор", Администратор);
	ТЗ = Объект.ЗарплатаСмены.Выгрузить(ОтборСтроки);
	
	//КоличествоЧасовОтчет = ТЗ.Итог("ДлинаСмены");     
	КоличествоЧасовДлинаСмены = ТЗ.Итог("ДлинаСмены");
	КоличествоЧасовПереработкаЧасы = ТЗ.Итог("ПереработкаЧасы"); 
	КоличествоЧасовОтчет = КоличествоЧасовДлинаСмены + КоличествоЧасовПереработкаЧасы;
КонецЕсли;
	
Возврат КоличествоЧасовОтчет;	
КонецФункции

&НаКлиенте
Процедура ОтчетЗарплатаРасширенный(Команда)
Если НЕ (ЗначениеЗаполнено(Объект.ДН) И ЗначениеЗаполнено(Объект.ДК)) Тогда Возврат; КонецЕсли; 
	
ТабДок = ОтчетЗарплатаРасширенныйНаСервере();

ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Зарплаты администраторов Расширенный"); 
ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, , Истина);
	
КонецПроцедуры

&НаСервере
Функция ОтчетЗарплатаРасширенныйНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Документы.АдминистраторыЗарплата.ПолучитьМакет("МакетРасширенный");	

//Область = Макет.ПолучитьОбласть("Заголовок");
//ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка|Лево");
ТабДок.Вывести(Область);

Дата_П = Объект.ДН;
Пока Дата_П <= Объект.ДК Цикл
	Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
	Дата_И = СтрЗаменить(Дата_С, ".", "");
	
	Имя_Право = Дата_И;
	
	ОбластьПраво = Макет.ПолучитьОбласть("Шапка|Право");
	ОбластьПраво.Параметры.Дата = Дата_С;
	
	ТабДок.Присоединить(ОбластьПраво);
	
	Дата_П = Дата_П + 24 * 60 * 60;
КонецЦикла;

Для Каждого Строка Из ЗарплатаСмены Цикл
	Область = Макет.ПолучитьОбласть("Строка|Лево");
	
	Область.Параметры.Администратор = Строка.Администратор;
	Область.Параметры.КоличествоСмен = Строка.КоличествоСмен;
	Область.Параметры.Оклад = Строка.Оклад_Э;
	Область.Параметры.Переработка = Строка.СуммаПереработка_Э;
	Область.Параметры.Отпуск = Строка.Отпуск_Э;
	Область.Параметры.НадбавкаЗаСтаж = Строка.НадбавкаЗаСтаж_Э;
	Область.Параметры.НадбавкаЗаСтандарты = Строка.НадбавкаЗаСтандарты_Э;
	Область.Параметры.НадбавкаЗаИнЯзыки = Строка.НадбавкаЗаИнЯзыки_Э;
	
	Область.Параметры.ДопУслуги = Строка.ДопУслуги;
	Область.Параметры.Больничный = Строка.Больничный;
	Область.Параметры.Премия = Строка.Премия;
	
	Область.Параметры.СуммаЗаПроживающих = Строка.СуммаЗаПроживающих_Э;
	
	Область.Параметры.СуммаЗаселенийЛайв = Строка.СуммаЗаселенийЛайв_Э;
	Область.Параметры.ЗарплатаИтого = Строка.Итого;
	
	ТабДок.Вывести(Область);
	
	Дата_П = Объект.ДН;
	Пока Дата_П <= Объект.ДК Цикл
		Дата_С = Формат(Дата_П, "ДФ=dd.MM.yy");
		Дата_И = СтрЗаменить(Дата_С, ".", "");
		
		Имя_Право = Дата_И;
		
		ОбластьПраво = Макет.ПолучитьОбласть("Строка|Право");
		
		НомерСмены = Строка["НомерСмены_" + Имя_Право];
		Если НомерСмены <> 0 Тогда
			НомерДлинаСмены = "" + Строка["НомерСмены_" + Имя_Право] + " / " + Строка["ДлинаСмены_" + Имя_Право];
			ОбластьПраво.Параметры.НомерДлинаСмены = НомерДлинаСмены;
		КонецЕсли;
		
		ОбластьПраво.Параметры.Итого = Строка["Итого_" + Имя_Право];
		ОбластьПраво.Параметры.Оклад = Строка["Оклад_" + Имя_Право];
		ОбластьПраво.Параметры.Переработка = Строка["СуммаПереработка_" + Имя_Право];
		ОбластьПраво.Параметры.СуммаЗаПроживающих = Строка["СуммаЗаПроживающих_" + Имя_Право];
		ОбластьПраво.Параметры.СуммаЗаселенийЛайв = Строка["СуммаЗаселенийЛайв_" + Имя_Право];
		
		ТабДок.Присоединить(ОбластьПраво);
		
		Дата_П = Дата_П + 24 * 60 * 60;
	КонецЦикла;	


КонецЦикла;

Возврат ТабДок;
КонецФункции

//

////////////////////////////////////////

//
&НаКлиенте
Процедура Тест(Команда)
	//Проживающие
ЗаполнитьПроживающие();
ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры





//

////





