Функция ТекстСообщенияИзМассив(Массив) Экспорт
ТекстСообщенияИзМассив = "";
Для Каждого Элемент Из Массив Цикл
	ТекстСообщенияИзМассив = ТекстСообщенияИзМассив + Элемент;	
КонецЦикла;

Возврат ТекстСообщенияИзМассив; 
КонецФункции

Процедура УбратьКнопкуКоманднойПанелиФормы_КУдалению(КоманднаяПанель, ИмяКнопки) Экспорт
ТекущийПользовательКодРавноАдминистратор = НастройкиСервер.ТекущийПользовательКодРавноАдминистратор();	
Если НЕ ТекущийПользовательКодРавноАдминистратор Тогда
	КнопкаУдалить = КоманднаяПанель.ПодчиненныеЭлементы.Найти(ИмяКнопки);
	Если КнопкаУдалить <> Неопределено Тогда 
		КнопкаУдалить.Видимость = Ложь;
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

Функция ДобавитьТекст(ТекстИсходный, ТекстДобавление, Разделитель) Экспорт
Если ТекстИсходный = "" Тогда
	ТекстРезультат = ТекстДобавление;
Иначе
	Если ТекстДобавление = "" Тогда 
		ТекстРезультат = ТекстИсходный;
	Иначе
		ТекстРезультат = ТекстИсходный + Разделитель + ТекстДобавление;
	КонецЕсли;	
КонецЕсли;

Возврат ТекстРезультат;
КонецФункции	

Функция НайтиВМассивеСтрок(Массив, Имя, Значение) Экспорт
Для Каждого Элемент Из Массив Цикл
	Если Элемент[Имя] = Значение Тогда
		Возврат Элемент;		
	КонецЕсли;	
КонецЦикла;	

Возврат Неопределено;
КонецФункции	

//
Процедура ЗаполнитьЭлементОтбораСписок(Список, ИмяПолеКомпоновкиДанных, ПравоеЗначение
	, ВидСравненияКомпоновкиДанных, ВсеПриПусто) Экспорт
	
ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных(ИмяПолеКомпоновкиДанных);	

ЭлементОтбора = ЭлементОтбора(Список, ПолеКомпоновкиДанных);
Если ЭлементОтбора = Неопределено Тогда
	Если (НЕ ЗначениеЗаполнено(ПравоеЗначение)) И (ВсеПриПусто) Тогда Возврат; КонецЕсли;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДанных;
Иначе
	Если (НЕ ЗначениеЗаполнено(ПравоеЗначение)) И (ВсеПриПусто) Тогда
		Список.Отбор.Элементы.Удалить(ЭлементОтбора);	
		
		Возврат;
	КонецЕсли;
КонецЕсли;

ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных;
ЭлементОтбора.Использование = Истина;
ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;	
КонецПроцедуры

Функция ЭлементОтбора(Список, ПолеКомпоновкиДанных) 
Для Каждого Элемент Из Список.Отбор.Элементы Цикл
	Если Элемент.ЛевоеЗначение = ПолеКомпоновкиДанных Тогда Возврат Элемент; КонецЕсли;
КонецЦикла;	
Возврат Неопределено;
КонецФункции	
//


Функция ИмяОбработки(Форма) Экспорт
Имя = Форма.ИмяФормы;    
ИмяОбработки = Сред(Имя, 11);
Индекс = СтрНайти(ИмяОбработки,".");
ИмяОбработки = Сред(ИмяОбработки, 1, Индекс - 1); 	

Возврат ИмяОбработки
КонецФункции

//
Функция ПолучитьЧисло(Строка) Экспорт
Попытка 
	Число = Число(Строка);		
Исключение
	Число = 0;
КонецПопытки;

Возврат Число;
КонецФункции

Функция ПолучитьДату(Строка) Экспорт
Попытка
	Строка_П = СтрЗаменить(Строка, "-", "");
	Строка_П = СтрЗаменить(Строка_П, ":", "");
	Строка_П = СтрЗаменить(Строка_П, " ", "");
	
	Дата = Дата(Строка_П);		
Исключение
	Дата = '00010101';
КонецПопытки;

Возврат Дата;
КонецФункции

Функция УбратьНезначащиеНули(Значение) Экспорт
Строка = Значение;

Индекс = 1;
Пока Индекс < СтрДлина(Строка) Цикл
	Если Сред(Строка, Индекс, 1) <> "0" Тогда Прервать; КонецЕсли;
	
	Индекс = Индекс + 1;
КонецЦикла;

Результат = Сред(Строка, Индекс);
Возврат Результат;
КонецФункции	

Функция ДеньНеделиСтрока(НомерДняНедели) Экспорт
Результат = "";

Если НомерДняНедели = 1 Тогда
	Результат = НСтр("ru='Понедельник'");
ИначеЕсли НомерДняНедели = 2 Тогда
	Результат = НСтр("ru='Вторник'");
ИначеЕсли НомерДняНедели = 3 Тогда
	Результат = НСтр("ru='Среда'");
ИначеЕсли НомерДняНедели = 4 Тогда
	Результат = НСтр("ru='Четверг'");
ИначеЕсли НомерДняНедели = 5 Тогда
	Результат = НСтр("ru='Пятница'");
ИначеЕсли НомерДняНедели = 6 Тогда
	Результат = НСтр("ru='Суббота'");
ИначеЕсли НомерДняНедели = 7 Тогда
	Результат = НСтр("ru='Воскресенье'");
КонецЕсли;

Возврат Результат;

КонецФункции