//&НаКлиенте
//Перем глПодключаемоеОборудование;

#Область ОбработчикиСобытий         

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ НастройкиСервер.ЭтоСтритАрт() Тогда
	Параметры.Свойство("ЭтоКоворкинг", ЭтоКоворкинг);
	Элементы.ЭтоКоворкинг.Видимость = ЭтоКоворкинг;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыполнитьОперациюЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		
//РезультатВыполнения.ТекстСлипЧека	

		//Если Параметры <> Неопределено Тогда
		//	Если Параметры.Свойство("ТипТранзакции") Тогда
		//		ТипТранзакции = Параметры.ТипТранзакции;
		//		
		//		Если ТипТранзакции = "СверкаИтогов" Тогда
		//			ЭТСервер.СверкаИтоговЗаписать(РезультатВыполнения, Параметры);
		//			
		//			Перейти ~ЗАВЕРШЕНИЕ;
		//		КонецЕсли;	
		//	КонецЕсли;	
		//КонецЕсли;	
		
		Если ЭТКлиент.ЗаписатьСверкуИтогов(РезультатВыполнения, Параметры) Тогда Перейти ~ЗАВЕРШЕНИЕ; КонецЕсли;
		
		ЭТСервер.ЗаписатьОперацию(РезультатВыполнения, Параметры);
	
		ТипТранзакции = "";
		Если ЗначениеЗаполнено(Параметры) Тогда 
			Если Параметры.Свойство("ТипТранзакции") Тогда ТипТранзакции = Параметры.ТипТранзакции; КонецЕсли;
		КонецЕсли;	
		
		Если ТипТранзакции = "AuthorizeSales" 
		ИЛИ  ТипТранзакции = "AuthorizeRefund" 
		ИЛИ  ТипТранзакции = "AuthorizeVoid" 
		Тогда
			ФорматированнаяСтрока = Новый ФорматированнаяСтрока("ПРИ НЕОБХОДИМОСТИ ОФОРМИТЕ КАССОВЫЙ ЧЕК !!!"
				, Новый Шрифт(, 12, Истина), WebЦвета.Красный);
			ПоказатьПредупреждение(, ФорматированнаяСтрока); 
		КонецЕсли;
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
~ЗАВЕРШЕНИЕ:
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОплатитьПлатежнойКартой(Команда)
	
	//ВыполнитьОперациюПоПлатежнойКарте("AuthorizeSales");
	ИмяОповещенияОЗавершении = "ВыполнитьОперациюЗавершение";
	ЭТКлиент.ОплатитьПлатежнойКартой(ЭтаФорма, ИмяОповещенияОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьПлатежПоКарте(Команда)
	
	//ВыполнитьОперациюПоПлатежнойКарте("AuthorizeRefund");
	ИмяОповещенияОЗавершении = "ВыполнитьОперациюЗавершение";
	ЭТКлиент.ВернутьПлатежПоКарте(ЭтаФорма, ИмяОповещенияОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПлатежПоКарте(Команда)
	
	//ВыполнитьОперациюПоПлатежнойКарте("AuthorizeVoid");
	ИмяОповещенияОЗавершении = "ВыполнитьОперациюЗавершение";
	ЭТКлиент.ОтменитьПлатежПоКарте(ЭтаФорма, ИмяОповещенияОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтогов(Команда)
	
	//ОчиститьСообщения();
	//Доступность = Ложь;
	//
	//ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект);
	//ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор)
	
	//ИмяОповещенияОЗавершении = "ВыполнитьОперациюЗавершение";
	//ЭТКлиент.ВыполнитьСверкуИтогов(ЭтаФорма, ИмяОповещенияОЗавершении);

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТипТранзакции", "СверкаИтогов");
	
	ДопПараметры.Вставить("ЭтоКоворкинг", ЭтоКоворкинг); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтаФорма, ДопПараметры);
	
	ЭТКлиент.ВыполнитьСверкуИтогов(ЭтаФорма, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура НапечататьПоследнийСлипЧек(Команда)
	
	//ОчиститьСообщения();
	//
	//Если Не ПустаяСтрока(глПодключаемоеОборудование.ПоследнийСлипЧек) Тогда
	//	Доступность = Ложь;
	//	ПараметрыОперации = Новый Структура("СтрокиТекста", глПодключаемоеОборудование.ПоследнийСлипЧек);    
	//	Оповещение = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект);
	//	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
	//Иначе
	//	ТекстСообщения = НСтр("ru = 'Отсутствует последний слип чек.'");
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	//КонецЕсли;
	
	ИмяОповещенияОЗавершении = "ВыполнитьОперациюЗавершение";
	ЭТКлиент.НапечататьПоследнийСлипЧек(ЭтаФорма, ИмяОповещенияОЗавершении);
КонецПроцедуры

//// ????
&НаКлиенте
Процедура ВыполнитьПреавторизацию(Команда)
	
	ВыполнитьОперациюПоПлатежнойКарте("AuthorizePreSales");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПреавторизацию(Команда)
	
	ВыполнитьОперациюПоПлатежнойКарте("AuthorizeCompletion");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПреавторизацию(Команда)
	
	ВыполнитьОперациюПоПлатежнойКарте("AuthorizeVoidPreSales");
	
КонецПроцедуры
//// ????

//// +++
&НаКлиенте
Процедура ВыполнитьОперациюЗавершение_1(РезультатВыполнения, Параметры) Экспорт
	
	Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		
		ЗаписатьОперацию(РезультатВыполнения, Параметры);
		
		ТипТранзакции = "";
		Если Параметры.Свойство("ТипТранзакции") Тогда ТипТранзакции = Параметры.ТипТранзакции; КонецЕсли;
			
		Если ТипТранзакции = "AuthorizeSales" 
		ИЛИ  ТипТранзакции = "AuthorizeRefund" 
		ИЛИ  ТипТранзакции = "AuthorizeVoid" 
		Тогда
			ФорматированнаяСтрока = Новый ФорматированнаяСтрока("НЕ ЗАБУДЬТЕ ОФОРМИТЬ КАССОВЫЙ ЧЕК !!!"
				, Новый Шрифт(, 12, Истина), WebЦвета.Красный);
			ПоказатьПредупреждение(, ФорматированнаяСтрока); 
		КонецЕсли;
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОперацию(РезультатВыполнения, Параметры) 
	Если Параметры.ТипТранзакции <> "AuthorizeSales" Тогда Возврат; КонецЕсли;
	
	ОперацииЭТМенеджер = РегистрыСведений.ОперацииЭТ.СоздатьМенеджерЗаписи();
	ОперацииЭТМенеджер.ГУИД = Новый УникальныйИдентификатор;
	
	ОперацииЭТМенеджер.КодАвторизации = РезультатВыполнения.КодАвторизации;
	ОперацииЭТМенеджер.НомерКарты = РезультатВыполнения.НомерКарты;
	ОперацииЭТМенеджер.НомерМерчанта = РезультатВыполнения.НомерМерчанта;
	ОперацииЭТМенеджер.НомерЧекаЭТ = РезультатВыполнения.НомерЧекаЭТ;
	ОперацииЭТМенеджер.СсылочныйНомер = РезультатВыполнения.СсылочныйНомер;
	ОперацииЭТМенеджер.СуммаОперации = РезультатВыполнения.СуммаОперации;
	
	ОперацииЭТМенеджер.ТипТранзакции = Параметры.ТипТранзакции; 
	
	ОперацииЭТМенеджер.ДанныеКарты = ?(Параметры.Свойство("ДанныеКарты")  , Параметры.ДанныеКарты, ""); 
	ОперацииЭТМенеджер.ТипКарты = ?(Параметры.Свойство("ТипКарты")  , Параметры.ТипКарты, 0); 
	
	ОперацииЭТМенеджер.НомерЧека = ?(Параметры.Свойство("НомерЧека")  , Параметры.НомерЧека, ""); 
	
	ОперацииЭТМенеджер.ДатаРегистрации = ТекущаяДата();
	
	ОперацииЭТМенеджер.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюПоПлатежнойКарте(ТипТранзакции)
	
	ОчиститьСообщения();
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ТипТранзакции"               , ТипТранзакции);
	ПараметрыОперации.Вставить("УказатьДополнительныеДанные" , Истина);
	ПараметрыОперации.Вставить("ЗапретРедактированияСуммы"   , Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюПоПлатежнойКартеЗавершение", ЭтотОбъект, ПараметрыОперации);
	
	Если ТипТранзакции = "AuthorizeSales" 
	ИЛИ  ТипТранзакции = "AuthorizeRefund" 
	ИЛИ  ТипТранзакции = "AuthorizeVoid" 
	Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаАвторизацииЭТ_ПСН", ПараметрыОперации,,,  ,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ", ПараметрыОперации,,,  ,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюПоПлатежнойКарте_1(ТипТранзакции)
	
	ОчиститьСообщения();
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ТипТранзакции"               , ТипТранзакции);
	ПараметрыОперации.Вставить("УказатьДополнительныеДанные" , Истина);
	ПараметрыОперации.Вставить("ЗапретРедактированияСуммы"   , Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьОперациюПоПлатежнойКартеЗавершение", ЭтотОбъект, ПараметрыОперации);
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ", ПараметрыОперации,,,  ,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюПоПлатежнойКартеЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если НЕ Параметры.Свойство("ТипТранзакции") Тогда
			ТекстСообщения = НСтр("ru = 'Не указан тип транзакции.'");
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Доступность = Ложь;
		ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
		ПараметрыОперации.ТипТранзакции  = Параметры.ТипТранзакции;
		ПараметрыОперации.СуммаОперации  = Результат.Сумма;
		ПараметрыОперации.НомерЧека      = ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, "");
		ПараметрыОперации.НомерЧекаЭТ    = ?(Результат.Свойство("НомерЧекаЭТ"), Результат.НомерЧекаЭТ, "");

		ПараметрыОперации.СсылочныйНомер = Результат.СсылочныйНомер;
		
		ДанныеОперации = Новый Структура();
		ДанныеОперации.Вставить("ТипТранзакции", Параметры.ТипТранзакции);
		ДанныеОперации.Вставить("ДанныеКарты", ?(Результат.Свойство("ДанныеКарты")  , Результат.ДанныеКарты, ""));
		ДанныеОперации.Вставить("ТипКарты", ?(Результат.Свойство("ТипКарты")  , Результат.ТипКарты, 0));
		ДанныеОперации.Вставить("НомерЧека", ?(Результат.Свойство("НомерЧека")  , Результат.НомерЧека, ""));
		
		Оповещение = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект, ДанныеОперации);
		ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение, УникальныйИдентификатор, Неопределено, ПараметрыОперации);
		
	КонецЕсли;
	
КонецПроцедуры
//// +++

#КонецОбласти