
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Если РаботаСИнтерфейсомСервер.УстановитьТолькоПросмотр(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
//Если ЭтоНовый() тогда
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Спр=Справочники.ЦелиВизита.Выбрать(,,,"Код");
	Пока Спр.Следующий() Цикл
		НовВ=Объект.ЦелиВизита.Добавить();
		НовВ.Цель=Спр.Ссылка;
	КонецЦикла;
	
	Спр=Справочники.ВопросыАнкеты.Выбрать(,,,"Код");
	Пока Спр.Следующий() Цикл
		НовВ=Объект.Вопросы.Добавить();
		НовВ.Вопрос=Спр.Ссылка;
	КонецЦикла;

	Спр=Справочники.ХарактеристикиОтеля.Выбрать(,,,"Код");
	Пока Спр.Следующий() Цикл
		НовВ=Объект.ХарактеристикиОтеля.Добавить();
		НовВ.Характеристика=Спр.Ссылка;
	КонецЦикла;

КонецЕсли;
КонецПроцедуры

// + ПСН Отправить Мылом
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаОтправитьАнкетуПоПочте",
      ЭтаФорма);	
 
    ПоказатьВопрос(Оповещение,
        "Отправить анкету по почте?"
        , РежимДиалогаВопрос.ДаНет
        , // 0 // таймаут в секундах
        , // КодВозвратаДиалога.Да // (необ.) кнопка по умолчанию
        , "ОТПРАВКА АНКЕТЫ" // (необ.) заголовок
		);
КонецПроцедуры
 
&НаКлиенте
Процедура ЗавершениеВопросаОтправитьАнкетуПоПочте(Результат, Параметры) Экспорт
 
Если Результат = КодВозвратаДиалога.Да Тогда
	// ИмяФ = ПечатьАнкетыВыполнить(Истина);
	//
	//// + ПСН
	////ОтправитьМылом("Анкета",Имяф,"1@renome-hotel.ru");
	//ОтправитьМылом("Анкета", Имяф, "postnikov_sn@invina.ru");
	//// - ПСН
	
	 ПечатьАнкетыВыполнить(Истина);
КонецЕсли;	
 
КонецПроцедуры
// - ПСН Отправить Мылом

// + ПСН Защита
&НаКлиенте
Процедура ВопросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиОтеляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиОтеляПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦелиВизитаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦелиВизитаПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры
// - ПСН Защита

&НаКлиенте
Процедура ВопросыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
		
	ТекушиеДанные = Элементы.Вопросы.ТекущиеДанные;	
	Если Поле.Имя="ВопросыОтлично" тогда
		ТекушиеДанные.Отлично=Истина;	
		ТекушиеДанные.Хорошо=Ложь;
		ТекушиеДанные.Удовлетворительно=Ложь;
		ТекушиеДанные.Плохо=Ложь;
	ИначеЕсли Поле.Имя="ВопросыХорошо" тогда	
		ТекушиеДанные.Отлично=Ложь;	
		ТекушиеДанные.Хорошо=Истина;
		ТекушиеДанные.Удовлетворительно=Ложь;
		ТекушиеДанные.Плохо=Ложь;
	ИначеЕсли Поле.Имя="ВопросыУдовлетворительно" тогда
		ТекушиеДанные.Отлично=Ложь;	
		ТекушиеДанные.Хорошо=Ложь;
		ТекушиеДанные.Удовлетворительно=Истина;
		ТекушиеДанные.Плохо=Ложь;
	ИначеЕсли Поле.Имя="ВопросыПлохо" тогда
		ТекушиеДанные.Отлично=Ложь;	
		ТекушиеДанные.Хорошо=Ложь;
		ТекушиеДанные.Удовлетворительно=Ложь;
		ТекушиеДанные.Плохо=Истина;
	конецесли;	

КонецПроцедуры

//
&НаКлиенте
Процедура ПечатьАнкеты(Команда)
ПечатьАнкетыВыполнить();
КонецПроцедуры

&НаКлиенте
Функция ПечатьАнкетыВыполнить(ДляОтправки=Ложь)
	ТабДок = СформироватьАнкету();

	Если Не ДляОтправки тогда
		
		ТабДок.Показать();
		
	иначе
		//ИмяФ="C:\BASE\REP\Ank_"+?(Бронь.Пустая(),Формат(Дата, "ДФ=ddMMyyHHmm"),Бронь.Номер)+".xls";
		//ТабДок.Записать(ИмяФ,ТипФайлаТабличногоДокумента.XLS97);
		//Возврат ИмяФ;
		
		ИмяФ = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
		БроньПустая = НЕ ЗначениеЗаполнено(Объект.Бронь);
		БроньНомер = ОбщийФункционалСервер.ПолучитьЗначениеРеквизитаНаСервере(Объект.Бронь, "Номер");
		
		ИмяФ =  ИмяФ + "REP\Ank_"+?(БроньПустая, Формат(Объект.Дата, "ДФ=ddMMyyHHmm"), БроньНомер)+".xls";
		
		//ТабДок.Записать(ИмяФ,ТипФайлаТабличногоДокумента.XLS97);
		ДопПараметры = Новый Структура("ИмяФ", ИмяФ); 
		Оповещение = Новый ОписаниеОповещения("ЗавершениеНачатьЗапись", ЭтаФорма, ДопПараметры);
		ТабДок.НачатьЗапись(Оповещение, ИмяФ, ТипФайлаТабличногоДокумента.XLS97);
		
		Возврат ИмяФ;
	конецесли;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ЗавершениеНачатьЗапись(Результат, ДополнительныеПараметры) Экспорт
ИмяФ =  ДополнительныеПараметры.ИмяФ;

//ОтправитьМылом("Анкета",Имяф,"1@renome-hotel.ru");
//ОтправитьМылом("Анкета", Имяф, "postnikov_sn@invina.ru");

Получатели = Новый СписокЗначений;
Получатели.Добавить("postnikov_sn@invina.ru");
// + ПСН		
		//ПочтовоеСообщение.Получатели.Добавить("guz@agent5.ru");
		//ПочтовоеСообщение.Получатели.Добавить("Kantorov_EE@invina.ru");
// - ПСН

Файлы = Новый СписокЗначений;
Файлы.Добавить(ИмяФ);

//ОтправитьМылом("Анкета", Имяф, Получатели);
СлужебныеСервер.ОтправитьМейлом("Анкета", Файлы, Получатели);
КонецПроцедуры

&НаСервере
Функция СформироватьАнкету()
//	Макет=ПолучитьМакет("Макет");
	
	ОбъектМакет = РеквизитФормыВЗначение("Объект");
	Макет = ОбъектМакет.ПолучитьМакет("Макет");
	
	ТабДок = Новый ТабличныйДокумент;
	Обл = Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.Клиент = Объект.Клиент;
	Обл.Параметры.Номер = Объект.Бронь.НомерВРезерв;
	Обл.Параметры.Город = Объект.Клиент.ПроживаниеГород;
	Обл.Параметры.Дата = Формат(Объект.Дата, "ДФ=dd.MM.yy");
	ТабДок.Вывести(Обл);
	
	Для каждого СтрЦ Из Объект.ЦелиВизита Цикл
		Если СтрЦ.Подходит тогда
			Обл=макет.ПолучитьОбласть("СтрокаЦельДа");
		иначе
			Обл=макет.ПолучитьОбласть("СтрокаЦельНет");
		конецесли;
		Обл.Параметры.цель=СтрЦ.Цель.Наименование;
		
		ТабДок.Вывести(Обл);
	КонецЦикла; 
	
	Обл=Макет.ПолучитьОбласть("ДругаяЦель");
	Обл.Параметры.ДругаяЦель = Объект.ДругаяЦель;
	ТабДок.Вывести(Обл);
		
	Обл=Макет.ПолучитьОбласть("ШапкаВопросы");
	ТабДок.Вывести(Обл);
	Для каждого Стр Из Объект.Вопросы Цикл
	
		Обл=Макет.ПолучитьОбласть("СтрокаВопрос");
		Обл.Параметры.Вопрос=Стр.Вопрос;
		Обл.Параметры.Отл=?(Стр.Отлично,"*","");
		Обл.Параметры.Хор=?(Стр.Хорошо,"*","");
		Обл.Параметры.Уд=?(Стр.Удовлетворительно,"*","");
		Обл.Параметры.Пл=?(Стр.Плохо,"*","");
		ТабДок.Вывести(Обл);
		
	КонецЦикла; 
	
	Обл=Макет.ПолучитьОбласть("ШапкаХар");
	Обл.Параметры.Понравилось=Объект.Понравилось;
	Обл.Параметры.НеПонравилось=Объект.НеПонравилось;
	ТабДок.Вывести(Обл);
	
	Для каждого СтрХ Из Объект.ХарактеристикиОтеля Цикл
	     Обл=Макет.ПолучитьОбласть("СтрокаХар");
		 Обл.Параметры.Характеристика=СтрХ.Характеристика;//	 
		 Обл.Параметры.ДаНет=СтрХ.Подходит;//	 
		 ТабДок.Вывести(Обл);
	 КонецЦикла; 
	 
     Обл=Макет.ПолучитьОбласть("СтрокаХар");
	 Обл.Параметры.Характеристика="Желаете получить скидку?";
	 Обл.Параметры.ДаНет=Формат(Объект.ЖелаетеПолучитьСкидку, "БЛ=Нет; БИ=Да");
	 ТабДок.Вывести(Обл);
     Обл=Макет.ПолучитьОбласть("СтрокаХар");
	 Обл.Параметры.Характеристика="Контактная информация";
	 Обл.Параметры.ДаНет= Объект.КонтактнаяИнформация;
	 ТабДок.Вывести(Обл);

	Возврат ТабДок;
КонецФункции
//








