 

&НаКлиенте
Функция ПроверкаДаты()
Если НЕ ЗначениеЗаполнено(ДатаС) 
ИЛИ НЕ ЗначениеЗаполнено(ДатаПо) Тогда
	ПоказатьПредупреждение(, "Пустые даты");
	
	Возврат Истина;
КонецЕсли;

Если ДатаС > ДатаПо Тогда 
	ПоказатьПредупреждение(, "Дата с > дата по");
	
	Возврат Истина;
КонецЕсли;
	
Возврат Ложь;	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
Если ПроверкаДаты() Тогда Возврат; КонецЕсли;
	
Данные = ЕжедневныйОтчетФакт.ПолучитьДанныеДляЕжедневныйОтчетФактСводный(ДатаС, ДатаПо);

Если ЗначениеЗаполнено(Данные.ТекстОшибки) Тогда
	Сообщить(Данные.ТекстОшибки);	
КонецЕсли;

ПолеОтчета = ЕжедневныйОтчетФакт.СформироватьЕжедневныйОтчетСводный(Данные);
КонецПроцедуры




