
Функция ЗапросТекстВозврат() Экспорт 
ЗапросТекст =	 "ВЫБРАТЬ
             	 |	ДокументКассовыйДокумент.Ссылка КАК Ссылка,
             	 |	ДокументКассовыйДокумент.ПометкаУдаления КАК ПометкаУдаления,
             	 |	ДокументКассовыйДокумент.Номер КАК Номер,
             	 |	ДокументКассовыйДокумент.Дата КАК Дата,
             	 |	ДокументКассовыйДокумент.Проведен КАК Проведен,
             	 |	ДокументКассовыйДокумент.ОтКого КАК ОтКого,
             	 |	ДокументКассовыйДокумент.Приход КАК Приход,
             	 |	ДокументКассовыйДокумент.ВидОперации КАК ВидОперации,
             	 |	ДокументКассовыйДокумент.Примечание КАК Примечание,
             	 |	ДокументКассовыйДокумент.ДатаОплаты КАК ДатаОплаты,
             	 |	ДокументКассовыйДокумент.НомерСменыККМ КАК НомерСменыККМ,
             	 |	ДокументКассовыйДокумент.НомерЧекаККМ КАК НомерЧекаККМ,
             	 |	ДокументКассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
             	 |	ДокументКассовыйДокумент.Сумма КАК СуммаДокументаОплаты,
             	 |	ДокументКассовыйДокумент.СуммаКарта КАК СуммаКарта,
             	 |	ДокументКассовыйДокумент.СуммаНаличные КАК СуммаНаличные,
             	 |	Возвраты.Сумма КАК СуммаВозврат,
             	 |	Возвраты.СуммаКарта КАК СуммаВозвратКарта,
             	 |	Возвраты.СуммаНаличные КАК СуммаВозвратНаличные,
             	 |	ДокументКассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) КАК ОстатокДокументаОплаты,
             	 |	ДокументКассовыйДокумент.СуммаКарта - ЕСТЬNULL(Возвраты.СуммаКарта, 0) КАК ОстатокКарта,
             	 |	ДокументКассовыйДокумент.СуммаНаличные - ЕСТЬNULL(Возвраты.СуммаНаличные, 0) КАК ОстатокНаличные,
             	 |	ВЫБОР
             	 |		КОГДА &ДокументДолг = ЗНАЧЕНИЕ(Документ.ЗаявкаНаБронирование.ПустаяСсылка)
             	 |				ИЛИ &ДокументДолг = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
             	 |				ИЛИ &ДокументДолг = ЗНАЧЕНИЕ(Документ.КОворкингСчета.ПустаяСсылка)
             	 |				ИЛИ &ДокументДолг = НЕОПРЕДЕЛЕНО
             	 |			ТОГДА ДокументКассовыйДокумент.ДокументДолг
             	 |		ИНАЧЕ Оплаты.ДокументДолг
             	 |	КОНЕЦ КАК ДокументДолг,
             	 |	Оплаты.ДокументДолг КАК ДокументДолг_1,
             	 |	ЕСТЬNULL(Оплаты.Сумма, 0) КАК СуммаОплачено,
             	 |	ДокументКассовыйДокумент.Аванс КАК Аванс,
             	 |	ДокументКассовыйДокумент.Отмена КАК Отмена
             	 |ИЗ
             	 |	Документ.КассовыйДокумент КАК ДокументКассовыйДокумент
             	 |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
             	 |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
             	 |			СУММА(КассовыйДокумент.Сумма) КАК Сумма,
             	 |			СУММА(КассовыйДокумент.СуммаКарта) КАК СуммаКарта,
             	 |			СУММА(КассовыйДокумент.СуммаНаличные) КАК СуммаНаличные
             	 |		ИЗ
             	 |			Документ.КассовыйДокумент КАК КассовыйДокумент
             	 |		
             	 |		СГРУППИРОВАТЬ ПО
             	 |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
             	 |		ПО ДокументКассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
             	 |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
             	 |			КассовыйДокументДолгиОплата.Ссылка КАК Ссылка,
             	 |			СУММА(КассовыйДокументДолгиОплата.Сумма) КАК Сумма,
             	 |			КассовыйДокументДолгиОплата.ДокументДолг КАК ДокументДолг
             	 |		ИЗ
             	 |			Документ.КассовыйДокумент.ДолгиОплата КАК КассовыйДокументДолгиОплата
             	 |		ГДЕ
             	 |			КассовыйДокументДолгиОплата.ДокументДолг = &ДокументДолг
             	 |		
             	 |		СГРУППИРОВАТЬ ПО
             	 |			КассовыйДокументДолгиОплата.Ссылка,
             	 |			КассовыйДокументДолгиОплата.ДокументДолг) КАК Оплаты
             	 |		ПО ДокументКассовыйДокумент.Ссылка = Оплаты.Ссылка
             	 |ГДЕ
             	 |	ДокументКассовыйДокумент.ПометкаУдаления = ЛОЖЬ
             	 |	И ДокументКассовыйДокумент.Приход = ИСТИНА
             	 |	И ДокументКассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) > 0
             	 |	И ДокументКассовыйДокумент.ОтКого В(&КонтрагентыОтбор)
             	 |	И ВЫБОР
             	 |			КОГДА &ДокументДолг = ЗНАЧЕНИЕ(Документ.ЗаявкаНаБронирование.ПустаяСсылка)
             	 |					ИЛИ &ДокументДолг = ЗНАЧЕНИЕ(Документ.ГрупповыеСчета.ПустаяСсылка)
             	 |					ИЛИ &ДокументДолг = ЗНАЧЕНИЕ(Документ.КОворкингСчета.ПустаяСсылка)
             	 |					ИЛИ &ДокументДолг = НЕОПРЕДЕЛЕНО
             	 |				ТОГДА Оплаты.Ссылка ЕСТЬ NULL
             	 |			ИНАЧЕ Оплаты.ДокументДолг = &ДокументДолг
             	 |		КОНЕЦ
             	 |	И ВЫБОР
             	 |			КОГДА &ДокументОплаты = ЗНАЧЕНИЕ(Документ.КассовыйДокумент.ПустаяСсылка)
             	 |					ИЛИ &ДокументОплаты = НЕОПРЕДЕЛЕНО
             	 |				ТОГДА ИСТИНА
             	 |			ИНАЧЕ ДокументКассовыйДокумент.Ссылка = &ДокументОплаты
             	 |		КОНЕЦ";
	                                             
Возврат ЗапросТекст;
КонецФункции

//
Функция СоздатьПрочиеОплатыСписание(Клиент, Основание, СуммаСписания, ВидОперации) Экспорт
ПрочиеОплатыОбъект = Документы.ПрочиеОплаты.СоздатьДокумент();

ПрочиеОплатыОбъект.Дата = ТекущаяДата();

ПрочиеОплатыОбъект.ДатаОплаты = ТекущаяДата();
ПрочиеОплатыОбъект.ОтКого = Клиент;

ПрочиеОплатыОбъект.Приход = Истина;
ПрочиеОплатыОбъект.Сумма = СуммаСписания;

ПрочиеОплатыОбъект.ВидОперации = ВидОперации;

ПрочиеОплатыОбъект.Основание = Основание;  

ПрочиеОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);

Возврат ПрочиеОплатыОбъект.Ссылка; 
КонецФункции
//

//
Функция КассовыйДокументСоздатьДокументПриход(СуммаНалЧекККМ, СуммаБезналЧекККМ, ДополнительныеПараметры) Экспорт 
ДокКасс = Документы.КассовыйДокумент.СоздатьДокумент();
ДокКасс.Дата = ТекущаяДата();
ДокКасс.ДатаОплаты = ТекущаяДата();

ДокКасс.ВидОперации = Справочники.ВидыОпераций.Проживание;

ДокКасс.ОтКого = ДополнительныеПараметры.Оплачивает;

ДокументДолгОбъектДанные = ДополнительныеПараметры.ДокументДолгОбъектДанные; 
ДокКасс.ДокументДолг 	= ДокументДолгОбъектДанные.Ссылка;

ДокКасс.Аванс 	= ДополнительныеПараметры.ЭтоАванс;

ДокКасс.Приход = Истина;

ДокКасс.Сумма=СуммаНалЧекККМ + СуммаБезналЧекККМ;
ДокКасс.СуммаКарта=СуммаБезналЧекККМ;
ДокКасс.СуммаНаличные=СуммаНалЧекККМ;

ДокКасс.НомерСменыККМ 	= ДополнительныеПараметры.НомерСменыККМ;
ДокКасс.НомерЧекаККМ 	= ДополнительныеПараметры.НомерЧекаККМ;

ДокКасс.ГУИД_ЭТ	= ДополнительныеПараметры.ГУИД_ЭТ;

ДокКасс.КредитнаяКарта = (СуммаБезналЧекККМ > 0);
ДокКасс.Наличные = (СуммаНалЧекККМ > 0);

ПозицииЧекаККМ = ДополнительныеПараметры.ПозицииЧекаККМ;

Сумма = 0;
Для Каждого Строка Из ПозицииЧекаККМ Цикл
	Сумма = Сумма + Строка.Сумма;			
КонецЦикла;	

Для каждого Строка Из ПозицииЧекаККМ Цикл
	НоваяСтрока = ДокКасс.ЧекККМДетально.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 	
КонецЦикла; 

ДокКасс.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
Возврат ДокКасс.Ссылка; 
КонецФункции
// 

Функция ЕстьОстаткиОплатКассаКонтрагент(Контрагент) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	КассовыйДокумент.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		ГДЕ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) КАК ЗаявкиОплаты
                      |		ПО КассовыйДокумент.Ссылка = ЗаявкиОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
                      |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
                      |		ИЗ
                      |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
                      |		ГДЕ
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КоворкингСчетаДокументыОплаты.ДокументОплаты) КАК КоворкингОплаты
                      |		ПО КассовыйДокумент.Ссылка = КоворкингОплаты.ДокументОплаты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |			СУММА(КассовыйДокумент.Сумма) КАК Сумма
                      |		ИЗ
                      |			Документ.КассовыйДокумент КАК КассовыйДокумент
                      |		ГДЕ
                      |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
                      |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.Возврат = ЛОЖЬ
                      |	И КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ЗаявкиОплаты.СуммаОплаты, 0) - ЕСТЬNULL(КоворкингОплаты.СуммаРаспределено, 0) > 0
                      |	И КассовыйДокумент.ОтКого = &Контрагент");

Запрос.УстановитьПараметр("Контрагент", Контрагент);

Результат = Запрос.Выполнить();

ЕстьОстаткиОплатКассаКонтрагент = НЕ Результат.Пустой();
Возврат ЕстьОстаткиОплатКассаКонтрагент;
КонецФункции



//// + ДокументОплатыДолгОплата

//
Функция ЗаполнитьДокументОплатыДолгОплатаДляКоворкинг(ДокументОплаты, ДокументДолг, СуммаОплаты) Экспорт 
ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты
	, ДокументДолг, ДокументДолг.СчетГУИД, СуммаОплаты, Истина); 
КонецФункции	

Функция ЗаполнитьДокументОплатыДолгОплатаДляЗаявкаНаБронирование(ДокументОплаты, РаспределениеОплатДолги, ДокументДолг) Экспорт 
ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);
ТЗ = РаспределениеОплатДолги.Выгрузить(ОтборСтроки, "ДокументОплаты, СчетГУИД, СуммаОплаты");
ТЗ.Свернуть("ДокументОплаты, СчетГУИД", "СуммаОплаты"); 

Для Каждого Строка Из ТЗ Цикл
	Если Строка.СуммаОплаты = 0 Тогда Продолжить; КонецЕсли;
	
	ОплатыОбщееСервер.ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты
		, ДокументДолг, Строка.СчетГУИД, Строка.СуммаОплаты, Истина); 
КонецЦикла;	
КонецФункции	
//

//
Процедура ДобавитьЗаменитьДокументОплатыДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД, СуммаОплаты
	, ЗаменитьСумму) Экспорт
ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
	
ДобавитьЗаменитьДокументОплатыОбъектДолгОплата(ДокументОплатыОбъект, ДокументДолг, СчетГУИД, СуммаОплаты
	, ЗаменитьСумму);
	
ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение); ;
КонецПроцедуры

Функция ДобавитьЗаменитьДокументОплатыОбъектДолгОплата(ДокументОплатыОбъект, ДокументДолг, СчетГУИД, СуммаОплаты
	, ЗаменитьСумму = Ложь) Экспорт

ДолгиОплата = ДокументОплатыОбъект.ДолгиОплата;
ОтборСтроки = Новый Структура("ДокументДолг", ДокументДолг); 
ОтборСтроки.Вставить("СчетГУИД", СчетГУИД);	
НайденныеСтроки = ДолгиОплата.НайтиСтроки(ОтборСтроки);

Если НайденныеСтроки.Количество() = 0 Тогда
	ДолгиОплатаСтрока = ДокументОплатыОбъект.ДолгиОплата.Добавить(); 
	ДолгиОплатаСтрока.ДокументДолг = ДокументДолг;
	ДолгиОплатаСтрока.СчетГУИД = СчетГУИД;
Иначе
	ДолгиОплатаСтрока = НайденныеСтроки[0];
КонецЕсли;

Результат = Истина;
Если ЗаменитьСумму Тогда
	Результат = (ДолгиОплатаСтрока.Сумма <> СуммаОплаты);
	ДолгиОплатаСтрока.Сумма = СуммаОплаты;
Иначе
	ДолгиОплатаСтрока.Сумма = ДолгиОплатаСтрока.Сумма + СуммаОплаты;
КонецЕсли;

Возврат Результат; 
КонецФункции
//

//
Функция УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД) Экспорт
ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
Если ДокументОплатыОбъект = Неопределено Тогда Возврат Неопределено; КонецЕсли; 

ДолгиОплата = ДокументОплатыОбъект.ДолгиОплата;	

ОтборСтроки = Новый Структура("ДокументДолг, СчетГУИД", ДокументДолг, СчетГУИД); 
НайденныеСтроки = ДолгиОплата.НайтиСтроки(ОтборСтроки);
	
Если НайденныеСтроки.Количество() = 0 Тогда Возврат ДокументОплатыОбъект; КонецЕсли;        

ОбщийФункционалСервер.УдалитьСтроки(ДолгиОплата, НайденныеСтроки);

ДокументОплатыОбъект.Записать(РежимЗаписиДокумента.Проведение);

Возврат ДокументОплатыОбъект; 
КонецФункции

Процедура УдалитьДокументОплатыДолгОплатыИДокументОплаты(ДокументОплаты, ДокументДолг, СчетГУИД) Экспорт
ДокументОплатыОбъект = УдалитьДокументОплатыДокументДолгДолгОплата(ДокументОплаты, ДокументДолг, СчетГУИД);
Если ДокументОплатыОбъект = Неопределено Тогда Возврат; КонецЕсли; 

ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
Если ДокументОплатыОбъект = Неопределено Тогда Возврат; КонецЕсли; 

Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
	ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();	
	
	Если ДокументОплатыОбъект.ДолгиОплата.Количество() = 0 Тогда
		ДокументОплатыОбъект.Удалить();
	КонецЕсли;
	
ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда 
	
	Если ДокументОплаты.ЭтоЭквайринг Тогда
		ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
		
		Если ДокументОплатыОбъект.ДолгиОплата.Количество() = 0 Тогда
			ДокументОплатыОбъект.Удалить();
		КонецЕсли;
	КонецЕсли;		
КонецЕсли;
КонецПроцедуры
//
//// - ДокументОплатыДолгОплата


//
Процедура ОбновитьДанныеКолонокДокументыОплаты(СуммаРаспределеноИтогоОплаты
	, ДокументыОплаты, ДокументДолгОбъект, МассивДокументовДолг) Экспорт
// + ДокументыОплаты 
ТЗ = ДокументыОплаты.Выгрузить(,"ДокументОплаты");
МассивДокументов = ТЗ.ВыгрузитьКолонку(0);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
                      |	СУММА(КассовыйДокумент.Сумма) КАК Сумма
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.ВозвратДокумент В (&ВозвратДокументы)
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	КассовыйДокумент.ВозвратДокумент");
Запрос.УстановитьПараметр("ВозвратДокументы", МассивДокументов);
ТЗВозвратыКасса = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
                      |	СУММА(ВыпискаБанка.Сумма) КАК Сумма
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.ВозвратДокумент В(&ВозвратДокументы)
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ВыпискаБанка.ВозвратДокумент");
Запрос.УстановитьПараметр("ВозвратДокументы", МассивДокументов);
ТЗВозвратыВыписка = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос;
Запрос.Текст = ОплатыОбщееСервер.ЗапросОплатаОстатокКРаспределениюКасса() + "
                     |	И КассовыйДокумент.Ссылка В (&ДокументыОплаты)";
Запрос.УстановитьПараметр("ДокументыОплаты", МассивДокументов);
Запрос.УстановитьПараметр("ДокументДолг", ДокументДолгОбъект.Ссылка);
Запрос.УстановитьПараметр("ДокументыДолг", МассивДокументовДолг);
ТЗКасса = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос;
Запрос.Текст = ОплатыОбщееСервер.ЗапросОплатаОстатокКРаспределениюВыписка() + "
                     |	И ВыпискаБанка.Ссылка В (&ДокументыОплаты)";
Запрос.УстановитьПараметр("ДокументыОплаты", МассивДокументов);
Запрос.УстановитьПараметр("ДокументДолг", ДокументДолгОбъект.Ссылка);
Запрос.УстановитьПараметр("ДокументыДолг", МассивДокументовДолг);
ТЗВыписка = Запрос.Выполнить().Выгрузить();

Запрос = Новый Запрос;
Запрос.Текст = ОплатыОбщееСервер.ЗапросОплатаОстатокКРаспределениюПрочиеОплаты() + "
                     |	И ПрочиеОплаты.Ссылка В (&ДокументыОплаты)";
Запрос.УстановитьПараметр("ДокументыОплаты", МассивДокументов);
Запрос.УстановитьПараметр("ДокументДолг", ДокументДолгОбъект.Ссылка);
Запрос.УстановитьПараметр("ДокументыДолг", МассивДокументовДолг);
ТЗПрочиеОплаты = Запрос.Выполнить().Выгрузить();

СуммаРаспределеноИтогоОплаты = 0;
Для Каждого Строка Из ДокументыОплаты Цикл
	ДокументОплаты = Строка.ДокументОплаты;
	Строка.Контрагент = ДокументОплаты.ОтКого;
	Строка.СуммаДокументОплаты = ДокументОплаты.Сумма;
	
	Строка.СуммаВозвратаДокументОплаты = 0; 
	Строка.СуммаОстатокДокументаОплаты = 0; 
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		
		СтрокаТЗКасса = ТЗКасса.Найти(ДокументОплаты, "ДокументОплаты");
		Если СтрокаТЗКасса <> Неопределено Тогда 
			Строка.СуммаОстатокДокументаОплаты = СтрокаТЗКасса.ОстатокКРаспределению; 
		КонецЕсли;
		
		СтрокаВозвраты = ТЗВозвратыКасса.Найти(ДокументОплаты, "ВозвратДокумент");
		Если СтрокаВозвраты <> Неопределено Тогда Строка.СуммаВозвратаДокументОплаты = СтрокаВозвраты.Сумма; КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
		
		СтрокаТЗВыписка = ТЗВыписка.Найти(ДокументОплаты, "ДокументОплаты");
		Если СтрокаТЗВыписка <> Неопределено Тогда 
			Строка.СуммаОстатокДокументаОплаты = СтрокаТЗВыписка.ОстатокКРаспределению; 
		КонецЕсли;

		СтрокаВозвраты = ТЗВозвратыВыписка.Найти(ДокументОплаты, "ВозвратДокумент");
		Если СтрокаВозвраты <> Неопределено Тогда Строка.СуммаВозвратаДокументОплаты = СтрокаВозвраты.Сумма; КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
		
		СтрокаТЗПрочиеОплаты = ТЗПрочиеОплаты.Найти(ДокументОплаты, "ДокументОплаты");
		Если СтрокаТЗПрочиеОплаты <> Неопределено Тогда 
			Строка.СуммаОстатокДокументаОплаты = СтрокаТЗПрочиеОплаты.ОстатокКРаспределению; 
		КонецЕсли;
		
	КонецЕсли;
	Строка.СуммаОстатокДокументаОплаты = Строка.СуммаОстатокДокументаОплаты 
		- ОплатыОбщееСервер.СуммаДокументОплаты(ДокументОплаты, ДокументДолгОбъект); 
	
	СуммаРаспределеноИтогоОплаты = СуммаРаспределеноИтогоОплаты + Строка.СуммаРаспределено;		
КонецЦикла;
// - ДокументыОплаты 
КонецПроцедуры

Функция СуммаДокументОплаты(ДокументОплаты, ДокументДолгОбъект) Экспорт 
Если ТипЗнч(ДокументДолгОбъект.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
	СуммаДокументОплаты = СуммаДокументОплатыЗаявкаНаБронирование(ДокументОплаты, ДокументДолгОбъект); 
ИначеЕсли ТипЗнч(ДокументДолгОбъект.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	СуммаДокументОплаты = СуммаДокументОплатыГрупповойСчет(ДокументОплаты, ДокументДолгОбъект); 
ИначеЕсли ТипЗнч(ДокументДолгОбъект.Ссылка) = Тип("ДокументСсылка.КоворкингСчета") Тогда
	СуммаДокументОплаты = СуммаДокументОплатыКоворкингСчета(ДокументОплаты, ДокументДолгОбъект); 
КонецЕсли;
 
Возврат СуммаДокументОплаты;
КонецФункции

Функция СуммаДокументОплатыЗаявкаНаБронирование(ДокументОплаты, ДокументДолгОбъект) Экспорт 
ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);	
ТЗ = ДокументДолгОбъект.РаспределениеОплатДолги.Выгрузить(ОтборСтроки, "СуммаОплаты");	
СуммаДокументОплаты = ТЗ.Итог("СуммаОплаты");

Возврат СуммаДокументОплаты;
КонецФункции

Функция СуммаДокументОплатыГрупповойСчет(ДокументОплаты, ДокументДолгОбъект) Экспорт 
ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);	
ТЗ = ДокументДолгОбъект.РаспределениеОплат.Выгрузить(ОтборСтроки, "СуммаОплаты");	
СуммаДокументОплаты = ТЗ.Итог("СуммаОплаты");

Возврат СуммаДокументОплаты;
КонецФункции

Функция СуммаДокументОплатыКоворкингСчета(ДокументОплаты, ДокументДолгОбъект) Экспорт 
ОтборСтроки = Новый Структура("ДокументОплаты", ДокументОплаты);	
ТЗ = ДокументДолгОбъект.РаспределениеОплатКоворкинг.Выгрузить(ОтборСтроки, "СуммаОплаты");	
СуммаДокументОплаты = ТЗ.Итог("СуммаОплаты");

Возврат СуммаДокументОплаты;
КонецФункции

Функция ОплатаОстатокКРаспределению(ДокументОплаты, ДокументДолгОбъект) Экспорт
Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
	ОплатаОстатокКРаспределению = ОплатаОстатокКРаспределениюВыписка(ДокументОплаты, ДокументДолгОбъект); 			
ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
	ОплатаОстатокКРаспределению = ОплатаОстатокКРаспределениюКасса(ДокументОплаты, ДокументДолгОбъект);
ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
	ОплатаОстатокКРаспределению = ОплатаОстатокКРаспределениюПрочиеОплаты(ДокументОплаты, ДокументДолгОбъект);
КонецЕсли;	

Возврат ОплатаОстатокКРаспределению;
КонецФункции

Функция ОплатаОстатокКРаспределениюКасса(ДокументОплаты, ДокументДолгОбъект) Экспорт
Запрос = Новый Запрос;
Запрос.Текст = ЗапросОплатаОстатокКРаспределениюКасса() + "
                      |	И КассовыйДокумент.Ссылка = &ДокументОплаты";
					  
Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
Запрос.УстановитьПараметр("ДокументДолг", ДокументДолгОбъект.Ссылка);

МассивДокументыДолг = Новый Массив;
Если ТипЗнч(ДокументДолгОбъект.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	Для Каждого Строка Из ДокументДолгОбъект.ДокументыДолги Цикл
		МассивДокументыДолг.Добавить(Строка.ДокументДолг);
	КонецЦикла;	
КонецЕсли;
Запрос.УстановитьПараметр("ДокументыДолг", МассивДокументыДолг);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	ОплатаОстатокКРаспределениюКасса = Выборка.ОстатокКРаспределению;
Иначе
	ОплатаОстатокКРаспределениюКасса = 0; 
КонецЕсли;

ОплатаОстатокКРаспределениюКасса = ОплатаОстатокКРаспределениюКасса - СуммаДокументОплаты(ДокументОплаты, ДокументДолгОбъект); 
	
Возврат ОплатаОстатокКРаспределениюКасса;
КонецФункции

Функция ЗапросОплатаОстатокКРаспределениюКасса() Экспорт
ЗапросТекст = "ВЫБРАТЬ
              |	КассовыйДокумент.Ссылка КАК ДокументОплаты,
              |	КассовыйДокумент.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ЗаявкиОплаты.СуммаРаспределено, 0) - ЕСТЬNULL(КоворкингОплаты.СуммаРаспределено, 0) КАК ОстатокКРаспределению
              |ИЗ
              |	Документ.КассовыйДокумент КАК КассовыйДокумент
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			КассовыйДокумент.ВозвратДокумент КАК ВозвратДокумент,
              |			СУММА(КассовыйДокумент.Сумма) КАК Сумма
              |		ИЗ
              |			Документ.КассовыйДокумент КАК КассовыйДокумент
              |		ГДЕ
              |			КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
              |		
              |		СГРУППИРОВАТЬ ПО
              |			КассовыйДокумент.ВозвратДокумент) КАК Возвраты
              |		ПО КассовыйДокумент.Ссылка = Возвраты.ВозвратДокумент
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
              |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаРаспределено
              |		ИЗ
              |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
              |		ГДЕ
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка <> &ДокументДолг
              |			И НЕ ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка В (&ДокументыДолг)
              |		
              |		СГРУППИРОВАТЬ ПО
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) КАК ЗаявкиОплаты
              |		ПО КассовыйДокумент.Ссылка = ЗаявкиОплаты.ДокументОплаты
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
              |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
              |		ИЗ
              |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
              |		ГДЕ
              |			КоворкингСчетаДокументыОплаты.Ссылка <> &ДокументДолг
              |		
              |		СГРУППИРОВАТЬ ПО
              |			КоворкингСчетаДокументыОплаты.ДокументОплаты) КАК КоворкингОплаты
              |		ПО КассовыйДокумент.Ссылка = КоворкингОплаты.ДокументОплаты
              |ГДЕ
              |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
              |	И КассовыйДокумент.Приход = ИСТИНА";

Возврат ЗапросТекст;
КонецФункции	

Функция ОплатаОстатокКРаспределениюВыписка(ДокументОплаты, ДокументДолгОбъект) Экспорт
Запрос = Новый Запрос;
Запрос.Текст = ЗапросОплатаОстатокКРаспределениюВыписка() + "
                      |	И ВыпискаБанка.Ссылка = &ДокументОплаты";
					  
Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
Запрос.УстановитьПараметр("ДокументДолг", ДокументДолгОбъект.Ссылка);

МассивДокументыДолг = Новый Массив;
Если ТипЗнч(ДокументДолгОбъект.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	Для Каждого Строка Из ДокументДолгОбъект.ДокументыДолги Цикл
		МассивДокументыДолг.Добавить(Строка.ДокументДолг);
	КонецЦикла;	
КонецЕсли;
Запрос.УстановитьПараметр("ДокументыДолг", МассивДокументыДолг);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	ОплатаОстатокКРаспределениюВыписка = Выборка.ОстатокКРаспределению;
Иначе
	ОплатаОстатокКРаспределениюВыписка = 0; 
КонецЕсли;

ОплатаОстатокКРаспределениюВыписка = ОплатаОстатокКРаспределениюВыписка - СуммаДокументОплаты(ДокументОплаты, ДокументДолгОбъект); 

Возврат ОплатаОстатокКРаспределениюВыписка;
КонецФункции

Функция ЗапросОплатаОстатокКРаспределениюВыписка() Экспорт
ЗапросТекст = "ВЫБРАТЬ
              |	ВыпискаБанка.Ссылка КАК ДокументОплаты,
              |	ВыпискаБанка.Сумма - ЕСТЬNULL(Возвраты.Сумма, 0) - ЕСТЬNULL(ЗаявкиОплаты.СуммаРаспределено, 0) - ЕСТЬNULL(КоворкингОплаты.СуммаРаспределено, 0) КАК ОстатокКРаспределению
              |ИЗ
              |	Документ.ВыпискаБанка КАК ВыпискаБанка
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ВыпискаБанка.ВозвратДокумент КАК ВозвратДокумент,
              |			СУММА(ВыпискаБанка.Сумма) КАК Сумма
              |		ИЗ
              |			Документ.ВыпискаБанка КАК ВыпискаБанка
              |		ГДЕ
              |			ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
              |		
              |		СГРУППИРОВАТЬ ПО
              |			ВыпискаБанка.ВозвратДокумент) КАК Возвраты
              |		ПО ВыпискаБанка.Ссылка = Возвраты.ВозвратДокумент
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
              |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаРаспределено
              |		ИЗ
              |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
              |		ГДЕ
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка <> &ДокументДолг
              |			И НЕ ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка В (&ДокументыДолг)
              |		
              |		СГРУППИРОВАТЬ ПО
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) КАК ЗаявкиОплаты
              |		ПО ВыпискаБанка.Ссылка = ЗаявкиОплаты.ДокументОплаты
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			КоворкингСчетаДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
              |			СУММА(КоворкингСчетаДокументыОплаты.СуммаРаспределено) КАК СуммаРаспределено
              |		ИЗ
              |			Документ.КоворкингСчета.ДокументыОплаты КАК КоворкингСчетаДокументыОплаты
              |		ГДЕ
              |			КоворкингСчетаДокументыОплаты.Ссылка <> &ДокументДолг
              |		
              |		СГРУППИРОВАТЬ ПО
              |			КоворкингСчетаДокументыОплаты.ДокументОплаты) КАК КоворкингОплаты
              |		ПО ВыпискаБанка.Ссылка = КоворкингОплаты.ДокументОплаты
              |ГДЕ
              |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ";

Возврат ЗапросТекст;
КонецФункции	

Функция ОплатаОстатокКРаспределениюПрочиеОплаты(ДокументОплаты, ДокументДолгОбъект) Экспорт
Запрос = Новый Запрос;
Запрос.Текст = ЗапросОплатаОстатокКРаспределениюПрочиеОплаты() + "
                      |	И ПрочиеОплаты.Ссылка = &ДокументОплаты";
					  
Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
Запрос.УстановитьПараметр("ДокументДолг", ДокументДолгОбъект.Ссылка);

МассивДокументыДолг = Новый Массив;
Если ТипЗнч(ДокументДолгОбъект.Ссылка) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
	Для Каждого Строка Из ДокументДолгОбъект.ДокументыДолги Цикл
		МассивДокументыДолг.Добавить(Строка.ДокументДолг);
	КонецЦикла;	
КонецЕсли;
Запрос.УстановитьПараметр("ДокументыДолг", МассивДокументыДолг);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	ОплатаОстатокКРаспределениюПрочиеОплаты = Выборка.ОстатокКРаспределению;
Иначе
	ОплатаОстатокКРаспределениюПрочиеОплатыа = 0; 
КонецЕсли;

ОплатаОстатокКРаспределениюПрочиеОплаты = ОплатаОстатокКРаспределениюПрочиеОплаты 
	- СуммаДокументОплаты(ДокументОплаты, ДокументДолгОбъект); 

Возврат ОплатаОстатокКРаспределениюПрочиеОплаты;
КонецФункции

Функция ЗапросОплатаОстатокКРаспределениюПрочиеОплаты() Экспорт
ЗапросТекст = "ВЫБРАТЬ
              |	ПрочиеОплаты.Ссылка КАК ДокументОплаты,
              |	ПрочиеОплаты.Сумма - ЕСТЬNULL(ЗаявкиОплаты.СуммаРаспределено, 0) КАК ОстатокКРаспределению
              |ИЗ
              |	Документ.ПрочиеОплаты КАК ПрочиеОплаты
              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты КАК ДокументОплаты,
              |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаРаспределено
              |		ИЗ
              |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
              |		ГДЕ
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка <> &ДокументДолг
              |			И НЕ ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка В (&ДокументыДолг)
              |		
              |		СГРУППИРОВАТЬ ПО
              |			ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты) КАК ЗаявкиОплаты
              |		ПО ПрочиеОплаты.Ссылка = ЗаявкиОплаты.ДокументОплаты
              |ГДЕ
              |	ПрочиеОплаты.ПометкаУдаления = ЛОЖЬ";

Возврат ЗапросТекст;
КонецФункции	
//
