
//
&НаКлиенте
Процедура ЗагрузитьКатегорииНомеров(Команда)
ЗагрузитьКатегорииНомеровНаСервере();
КонецПроцедуры

&НаСервере
Функция ПараметрыСоединения()
ПараметрыСоединения = "File=""C:\_Base1C\InfoBase"";Usr=""Администратор"";Pwd=""123"";";
Возврат ПараметрыСоединения;	
КонецФункции
//

	
&НаСервере
Процедура ЗагрузитьКатегорииНомеровНаСервере()
ПараметрыСоединения = ПараметрыСоединения();
Соединение = Новый COMОбъект("V83.COMConnector");
Попытка
	База = Соединение.Connect(ПараметрыСоединения);
Исключение
	Сообщить("Ошибка подключения! " + ОписаниеОшибки());
	Возврат ;
КонецПопытки;

Запрос = База.NewObject("Запрос");
Запрос.Текст = 
    "ВЫБРАТЬ
    |	КатегорииНомеров.Код КАК Код,
    |	КатегорииНомеров.Наименование КАК Наименование
    |ИЗ
    |	Справочник.КатегорииНомеров КАК КатегорииНомеров
    |ГДЕ
    |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ";
	
ТЗ = Запрос.Выполнить().Выгрузить(); 	

Для Каждого Строка Из ТЗ Цикл
	КатегорияНомера = Справочники.КатегорииНомеров.НайтиПоКоду(Строка.Код);
	Если НЕ ЗначениеЗаполнено(КатегорияНомера) Тогда
		КатегорияНомераОбъект = Справочники.КатегорииНомеров.СоздатьЭлемент();
		КатегорияНомераОбъект.Код = Строка.Код;
		КатегорияНомераОбъект.Наименование = Строка.Наименование;
		КатегорияНомераОбъект.Записать();
	КонецЕсли;	
КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьНомера(Команда)
	ЗагрузитьНомераНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНомераНаСервере()
ПараметрыСоединения = ПараметрыСоединения();
Соединение = Новый COMОбъект("V83.COMConnector");
Попытка
	База = Соединение.Connect(ПараметрыСоединения);
Исключение
	Сообщить("Ошибка подключения! " + ОписаниеОшибки());
	Возврат ;
КонецПопытки;

Запрос = База.NewObject("Запрос");
Запрос.Текст = 
  "ВЫБРАТЬ
                       |	НомернойФонд.Ссылка,
                       |	НомернойФонд.Код,
                       |	НомернойФонд.Наименование,
                       |	НомернойФонд.Этаж,
                       |	НомернойФонд.КатегорияНомера,
                       |	НомернойФонд.Курящий
                       |ИЗ
                       |	Справочник.НомернойФонд КАК НомернойФонд
                       |ГДЕ
                       |	НомернойФонд.ПометкаУдаления = ЛОЖЬ";

	
ТЗ = Запрос.Выполнить().Выгрузить(); 	

Для Каждого Строка Из ТЗ Цикл
	НомерОтель = Справочники.НомернойФонд.НайтиПоКоду(Строка.Код);
	Если НЕ ЗначениеЗаполнено(НомерОтель) Тогда
		НомерОтельОбъект = Справочники.НомернойФонд.СоздатьЭлемент();
		
		НомерОтельОбъект.Код = Строка.Код;
		НомерОтельОбъект.Наименование = Строка.Наименование;
		
		НомерОтельОбъект.Этаж = Строка.Этаж;
		
		КатегорияНомера = Справочники.КатегорииНомеров.НайтиПоКоду(Строка.КатегорияНомера.Код);
		НомерОтельОбъект.КатегорияНомера = КатегорияНомера;
		
		НомерОтельОбъект.Курящий = Строка.Курящий;
		
		НомерОтельОбъект.Записать();
	КонецЕсли;	
	
КонецЦикла;	
КонецПроцедуры

Функция ИмяЗначенияПеречисление(Соединение, Значение) 
Если Значение.Пустая() Тогда Возврат ""; КонецЕсли;
     
//получаем как названо перечисление в конфигураторе
ИмяПеречисления = Значение.Метаданные().Имя;

//теперь получим индекс где хранится то что нам надо
НужныйИндекс = Соединение.Перечисления[ИмяПеречисления].Индекс(Значение);

//и вот счастье. то что нам надо - идентификатор!!! всего-то четыре строчки кода
//ИмяЗначения = Соединение.Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[НужныйИндекс].Имя;     
ЗначенияПеречисления = Соединение.Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления;
Индекс = 0;
Для Каждого ЗначениеПеречисления Из ЗначенияПеречисления Цикл
	Если Индекс = НужныйИндекс Тогда  Возврат ЗначениеПеречисления.Имя;	КонецЕсли;
	Индекс = Индекс + 1;
КонецЦикла;	

Возврат "";     
КонецФункции


//

&НаКлиенте
Процедура ЗагрузитьДанныеНомеров(Команда)
	ЗагрузитьДанныеНомеровНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНомеровНаСервере()
ПараметрыСоединения = "File=""D:\DB"";Usr=""Администратор"";Pwd=""123"";";
Соединение = Новый COMОбъект("V83.COMConnector");
Попытка
	База = Соединение.Connect(ПараметрыСоединения);
Исключение
	Сообщить("Ошибка подключения! " + ОписаниеОшибки());
	Возврат ;
КонецПопытки;

Запрос = База.NewObject("Запрос");
Запрос.Текст = 
    "ВЫБРАТЬ
    |	НомернойФонд.Код КАК Код,
    |	НомернойФонд.ОбщийКондиционер КАК ОбщийКондиционер,
    |	НомернойФонд.Соседи.(
    |		СоседнийНомер КАК СоседнийНомер
    |	) КАК Соседи
    |ИЗ
    |	Справочник.НомернойФонд КАК НомернойФонд";

ТЗ = Запрос.Выполнить().Выгрузить(); 	

Для Каждого Строка Из ТЗ Цикл
	НомерОтель = Справочники.НомернойФонд.НайтиПоКоду(Строка.Код);
	
	Если ЗначениеЗаполнено(НомерОтель) Тогда
		НомерОтельОбъект = НомерОтель.ПолучитьОбъект();
		
		ОбщийКондиционер = Справочники.НомернойФонд.НайтиПоКоду(Строка.ОбщийКондиционер.Код);
		НомерОтельОбъект.ОбщийКондиционер = ОбщийКондиционер;
		
		Если Строка.Соседи.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		Если НомерОтельОбъект.Соседи.Количество() > 0 Тогда Продолжить; КонецЕсли;
		Для Каждого СтрокаСоседи Из ТЗ.Соседи Цикл
			
			СоседнийНомер = Справочники.НомернойФонд.НайтиПоКоду(СтрокаСоседи.СоседнийНомер.Код);
			Если НЕ ЗначениеЗаполнено(СоседнийНомер) Тогда Продолжить; КонецЕсли;

			НоваяСтрокаСоседи =  НомерОтельОбъект.Соседи.Добавить();
			НоваяСтрокаСоседиСоседнийНомер = СоседнийНомер;
		КонецЦикла;
		
		
	КонецЕсли;	
	
КонецЦикла;	
КонецПроцедуры

//

