
// + Green
Функция ОтправитьТекстGreenWhatsApp(Знач Телефон, Текст) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");
	
Результат = ПроверитьНаличиеGreenWhatsApp(Телефон);
Если Результат.Ошибка Тогда 
	Возврат Результат; 
КонецЕсли;	

Попытка 
	GREEN_WhatsApp.ОтправитьТекст(Телефон, Текст);
Исключение
	Результат.Ошибка = Истина;
	Результат.Описание = ОписаниеОшибки();
КонецПопытки;

Возврат Результат;
КонецФункции

Функция ОтправитьФайлИТекстGreenWhatsApp(Знач Телефон, Картинка, Текст = "") Экспорт  
Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");
	
Телефон_П = GREEN_WhatsApp.ТелефонGREEN(Телефон);	
Если Телефон_П = 0 Тогда
	Результат.Ошибка = Истина;
	Результат.Описание = "Некорректный номер телефона для Whats App";

	Возврат Результат;	
КонецЕсли;

Результат = ПроверитьНаличиеGreenWhatsApp(Телефон);
Если Результат.Ошибка Тогда Возврат Результат; КонецЕсли;	

Попытка 
	GREEN_WhatsApp.ОтправитьВидеоАудиоИзображениеДокумент(Телефон_П, Картинка, Текст);
Исключение
	Результат.Ошибка = Истина;
	Результат.Описание = ОписаниеОшибки();
КонецПопытки;

Возврат Результат;	
КонецФункции

Функция ОтправитьСсылкуGreenWhatsApp(Знач Телефон, Ссылка) Экспорт
	
Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");

Телефон_П = GREEN_WhatsApp.ТелефонGREEN(Телефон); 	
Если Телефон_П = 0 Тогда
	Результат.Ошибка = Истина;
	Результат.Описание = "Некорректный номер телефона для Whats App";

	Возврат Результат;	
КонецЕсли;

Результат = ПроверитьНаличиеGreenWhatsApp(Телефон);
Если Результат.Ошибка Тогда Возврат Результат; КонецЕсли;	

Попытка 
	GREEN_WhatsApp.ОтправитьСсылку(Телефон_П, Ссылка);
Исключение
	Результат.Ошибка = Истина;
	Результат.Описание = ОписаниеОшибки();
КонецПопытки;

Возврат Результат;	
КонецФункции

Функция ПроверитьНаличиеGreenWhatsApp(Знач Телефон) Экспорт 
Результат = Новый Структура("Ошибка, КодОшибки, Описание", Ложь, 0, "");
	
Попытка 
	Ответ = GREEN_WhatsApp.ПроверитьНаличиеWhatsAppДействие(Телефон);
	
	Если НЕ Ответ Тогда
		Результат.Ошибка = Истина;
		Результат.КодОшибки = 100;
		Результат.Описание = "На телефоне не установлен WhatsApp";
	КонецЕсли;
Исключение
	Результат.Ошибка = Истина;
	Результат.Описание = ОписаниеОшибки();
КонецПопытки;

Возврат Результат;
КонецФункции
// - Green
