

Функция КаталогИБ() Экспорт
СтрокаСоединенияСБД = СтрокаСоединенияИнформационнойБазы();
ПозицияПоиска = Найти(Врег(СтрокаСоединенияСБД), "FILE=");
Если ПозицияПоиска = 1 тогда
	Возврат Сред(СтрокаСоединенияСБД,7,СтрДлина(СтрокаСоединенияСБД)-8)+"\";
Иначе 
	Возврат "";
КонецЕсли;
КонецФункции 


//// + ПриНачалеРаботыСистемы

// + Также Из кода
Процедура ЗагрузкаАрхива() Экспорт
Возврат;	
конецпроцедуры

Процедура ЗагрузкаТек() Экспорт
Возврат;
КонецПроцедуры

Процедура ЗагрузкаОсмотра() Экспорт
Возврат;
КонецПроцедуры
// - Также Из кода

// Политов
Функция АвтоБонус() Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЗаявкаНаБронирование.Клиент КАК Клиент
//	|	ЗаявкаНаБронирование.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	|ГДЕ
//	|	(ЗаявкаНаБронирование.Клиент = &Клиент) 
	|     (ЗаявкаНаБронирование.Дата МЕЖДУ &НачДата И &КонДата)
	|	И (ЗаявкаНаБронирование.РезервС МЕЖДУ &НачалоДня И &КонДата)
//	|   УПОРЯДОЧИТЬ ПО
//	|	ЗаявкаНаБронирование.Клиент,
//	|	ЗаявкаНаБронирование.ссылка

	|");
	//Запрос.УстановитьПараметр("Клиент",Клиент);						
	Запрос.УстановитьПараметр("НачДата",НачалоГода(НачалоГода(ТекущаяДата())-1));  // выборка с начала прошлого года
	Запрос.УстановитьПараметр("КонДата",КонецДня(ТекущаяДата()));                  //по текущую дату
	Запрос.УстановитьПараметр("НачалоДня",НачалоДня(ТекущаяДата()));
	//Заезд=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Заезд=Запрос.Выполнить().Выгрузить();
//	Выборка = Заезд.Выбрать();

    Таб = Новый ТаблицаЗначений;    
    Таб.Колонки.Добавить("Клиент");
    Таб.Колонки.Добавить("Количество");
	Таб.Колонки.Добавить("Результат");
	Для каждого Стр  Из Заезд Цикл
		ЧислоВизитов = КоличествоПроживанийЗаПериод(Стр.Клиент);
	    Если ЧислоВизитов >2 Тогда
          Строка = Таб.Добавить();
          Строка.Клиент = Стр.Клиент;
	      Строка.Количество = ЧислоВизитов;
		КонецЕсли;
	КонецЦикла;  
	
	Если Таб.Количество()>0 Тогда
		//   ЗарегистрироватьВБонуснойБазе
		
	
		//СтрокаПодключения  = "File = ""C:\BONUS""; Usr=""Admin""; Pwd=""123"";";
		//Ком = Новый COMОбъект("V82.COMConnector");	
		
		//Папка_C_BONUS = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BONUS");
		//СтрокаПодключения  = "File = """ + Папка_C_BONUS +  """; Usr=""Admin""; Pwd=""123"";";
		//Ком = Новый COMОбъект("V83.COMConnector");
		//
		//База = Ком.Connect(СтрокаПодключения);
		
		База =СлужебныеСервер.ConnectБаза_BONUS();;
		
		Для ном=0 По Таб.Количество()-1 Цикл
			Попытка
				Рез=База.ЗарегистрироватьКлиента(Таб[Ном].Клиент.Фамилия,Таб[Ном].Клиент.Имя,Таб[Ном].Клиент.Отчество,Таб[Ном].Клиент.ДатаРождения,Таб[Ном].Клиент.Код);
				Таб[Ном].Результат  =  Рез.РезультатРегистрации;
		    Исключение
				Таб[Ном].Результат  =  "Сбой регистрации в базе бонусов"; 		
			КонецПопытки;
		КонецЦикла; 
		// сохраним в файл
		ТабДок = Новый ТабличныйДокумент;
	    Секция = ТабДок.ПолучитьОбласть("R1");
	    
	    Для Н=0 По Таб.Количество()-1 Цикл 
	        С= Н+1; 
	        Секция.Область("R"+Строка(С)+"C1").Текст = Таб[Н].Клиент;
	        Секция.Область("R"+Строка(С)+"C2").Текст = Таб[Н].Количество;
	        Секция.Область("R"+Строка(С)+"C3").Текст = Таб[Н].Результат;
	    КонецЦикла;
	    
	    ТабДок.Вывести(Секция);
		
		//ТабДок.Записать("C:\BASE\REP\Bonus.xls",ТипФайлаТабличногоДокумента.XLS97);
		
		ИмяФ = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BASE");
		ИмяФ =  ИмяФ + "REP\Bonus.xls";
		ТабДок.Записать(ИмяФ,ТипФайлаТабличногоДокумента.XLS97);
		
		//ОтправитьМейлом("Обновление бонусной базы Реноме","C:\BASE\REP\Bonus.xls","1@renome-hotel.ru");
		
		Получатели = Новый СписокЗначений;
		Получатели.Добавить("postnikov_sn@invina.ru");
		
		//Получатели.Добавить("1@renome-hotel.ru");
		//Получатели.Добавить("pka@5sreda.ru");
		
		Файлы = Новый СписокЗначений;
		Файлы.Добавить(ИмяФ);
		
		СлужебныеСервер.ОтправитьМейлом("Обновление бонусной базы Реноме", Файлы, Получатели);
		
	  //  ///
	  //  //Сообщить(Рез.РезультатРегистрации);
	  //  
	  //  //Сообщить("Не получилось выполнить регистрацию в бонусной базе");
	  //
	  //  	///   ЗарегистрироватьВБонуснойБазе
  КонецЕсли;
  
Возврат Неопределено;
КонецФункции	

Функция КоличествоПроживанийЗаПериод(Клиент) 
  КоличествоПроживаний=0;	
  Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЗаявкаНаБронирование.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	|ГДЕ
	|	(ЗаявкаНаБронирование.Клиент = &Клиент) 
	|	И (ЗаявкаНаБронирование.Дата МЕЖДУ &НачДата И &КонДата)
	|	И (ЗаявкаНаБронирование.Статус = &Статус)");
	Запрос.УстановитьПараметр("Клиент",Клиент);						
	Запрос.УстановитьПараметр("НачДата",НачалоГода(НачалоГода(ТекущаяДата())-1));  // выборка с начала прошлого года
	Запрос.УстановитьПараметр("КонДата",КонецДня(ТекущаяДата()));                  //по текущую дату
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусБрони.Выехал);
	Заезд=Запрос.Выполнить().Выгрузить();
	Возврат Заезд.Количество()   
КонецФункции              
//// - ПриНачалеРаботыСистемы

////// + Из кода
Функция ПроверитьДату(ДТ) Экспорт
	//Если ТекПол.Наименование="Администратор" тогда
	//Если ПараметрыСеанса.ТекущийПользователь.Наименование="Администратор" тогда
	//	Возврат ложь;
	//конецесли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЗакрытыеДни.Закрыт
	|ИЗ
	|	РегистрСведений.ЗакрытыеДни КАК ЗакрытыеДни
	|ГДЕ
	|	ЗакрытыеДни.День = &День
	|	И ЗакрытыеДни.Закрыт = ИСТИНА");	
	Запрос.УстановитьПараметр("День",НачалоДня(ДТ));
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции
////// - Из кода


//// + Перенесено из ОбщийМодульОбщегоНазначения

// Из ЗаявкаНаБронирование ФормаДокумента и ФормаСписка
Функция ПолучитьПредставлениеКлиента(Клиент) Экспорт 
	
	Если Клиент.ТипКлиента=Перечисления.ТипыКлиентов.ЮрЛицо тогда
		НаименованиеЮрЛица = ?(ЗначениеЗаполнено(Клиент.НаименованиеЮрЛица), Клиент.НаименованиеЮрЛица, Клиент.Наименование);  
		Возврат НаименованиеЮрЛица + ". ИНН " + Формат(Клиент.ИНН, "ЧГ=") + ?(ЗначениеЗаполнено(Клиент.КПП), ", КПП " + Клиент.КПП, "")
			+ ?(ЗначениеЗаполнено(Клиент.Адрес), ", " + Клиент.Адрес, "");
	иначе
		Возврат Клиент.Наименование;
	КонецЕсли;
	
КонецФункции

// Из ОтчетПоДнямРождения
Функция ПолучитьБаллы(Клиент) Экспорт
	Попытка
		//СтрокаПодключения  = "File = ""C:\BONUS""; Usr=""Admin""; Pwd=""123"";";
		//Ком = Новый COMОбъект("V82.COMConnector");	
		//База = Ком.Connect(СтрокаПодключения);
		
		//СтрокаПодключения  = "File = """ + ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BONUS") + """;" + " Usr=""Admin""; Pwd=""123"";";

		//Ком = Новый COMОбъект("V83.COMConnector");	
		//База = Ком.Connect(СтрокаПодключения);
		
		База =СлужебныеСервер.ConnectБаза_BONUS();
		
		Рез=База.БаллыИПризыПоКлиенту(Клиент.Код);
		Если Рез<>"Клиент отсутствует в базе" тогда
			Возврат Рез.Баллы;
		иначе
			Возврат 0;
		КонецЕсли;
	Исключение
		Возврат 0;
		
	КонецПопытки;
	
	
КонецФункции

// Из ФормаДокумента.ЗаявкаНаБронирование
Функция СообщениеОБаллахИПризах(Клиент) Экспорт
// + Пока Заблокировано	
	Возврат "";
// - Пока Заблокировано	
	
	
	Попытка
		//СтрокаПодключения  = "File = ""C:\BONUS""; Usr=""Admin""; Pwd=""123"";";
		//Ком = Новый COMОбъект("V82.COMConnector");	
		//База = Ком.Connect(СтрокаПодключения);
		
		//СтрокаПодключения  = "File = """ + ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("Папка_C_BONUS") + """;" + " Usr=""Admin""; Pwd=""123"";";

		//Ком = Новый COMОбъект("V83.COMConnector");	
		//База = Ком.Connect(СтрокаПодключения);
		
		База = СлужебныеСервер.ConnectБаза_BONUS();;

		Рез=База.БаллыИПризыПоКлиенту(Клиент.Код);
		Если Рез<>"Клиент отсутствует в базе" тогда
			Макет=ПолучитьОбщийМакет("МакетПризыИБаллы");
			ТабДок=Новый ТабличныйДокумент;
			Обл=Макет.ПолучитьОбласть("Шапка");
			Обл.Параметры.Баллы=Рез.Баллы;
			ТабДок.Вывести(Обл);

			Обл=Макет.ПолучитьОбласть("Шапка1");
			ТабДок.Вывести(Обл);
			Ном=1;
			Для каждого СтрП Из Рез.Призы Цикл
				Обл=Макет.ПолучитьОбласть("Строка");
				Обл.Параметры.Ном=Ном;
				Обл.Параметры.Приз=СтрП.Приз;
				Обл.Параметры.Стоимость=СтрП.Стоимость;
				ТабДок.Вывести(Обл);

			    Ном=Ном+1;
			КонецЦикла; 
			
			
			Возврат ТабДок;
			
		////	Возврат "Текущие баллы - " +  Рез.Баллы + ?(Рез.Призы="",""," Возможные призы: "+Рез.Призы);
		иначе
			Возврат "";
		КонецЕсли;
	Исключение
		Возврат "";
		
	КонецПопытки;
	
КонецФункции

Функция СообщениеОБаллахИПризах___(Клиент) Экспорт
	//Попытка
	//	СтрокаПодключения  = "File = ""C:\BONUS""; Usr=""Admin""; Pwd=""123"";";
	//	Ком = Новый COMОбъект("V82.COMConnector");	
	//	База = Ком.Connect(СтрокаПодключения);
	//	Рез=База.БаллыИПризыПоКлиенту(Клиент.Код);
	//	Если Рез<>"Клиент отсутствует в базе" тогда
	//		Макет=ПолучитьОбщийМакет("МакетПризыИБаллы");
	//		ТабДок=Новый ТабличныйДокумент;
	//		Обл=Макет.ПолучитьОбласть("Шапка");
	//		Обл.Параметры.Баллы=Рез.Баллы;
	//		ТабДок.Вывести(Обл);

	//		Обл=Макет.ПолучитьОбласть("Шапка1");
	//		ТабДок.Вывести(Обл);
	//		Ном=1;
	//		Для каждого СтрП Из Рез.Призы Цикл
	//			Обл=Макет.ПолучитьОбласть("Строка");
	//			Обл.Параметры.Ном=Ном;
	//			Обл.Параметры.Приз=СтрП.Приз;
	//			Обл.Параметры.Стоимость=СтрП.Стоимость;
	//			ТабДок.Вывести(Обл);

	//		    Ном=Ном+1;
	//		КонецЦикла; 
	//		
	//		
	//		Возврат ТабДок;
	//	//	Возврат "Текущие баллы - " +  Рез.Баллы + ?(Рез.Призы="",""," Возможные призы: "+Рез.Призы);
	//	иначе
	//		Возврат "";
	//	КонецЕсли;
	//Исключение
	//	Возврат "";
	//	
	//КонецПопытки;
КонецФункции
//// - Перенесено из ОбщийМодульОбщегоНазначения



// + Из  Обработка.ФормированиеЗаданийНаСменуБелья.Форма

// Политов
Процедура СоздатьЗначок(Номер,Значок) Экспорт
				////         INSERT INTO `artemis`.`icon` (`nomer`, `icon`) VALUES ('501', 'fa-bed');
	//Запрос="INSERT INTO `artemis`.`icon` (`nomer`, `icon`) VALUES ('"+Строка(Число(Номер.Код))+"','"+Значок+"')";	
	Если ПараметрыСеанса.ТипСервера = "МойКомпьютер" Тогда
		Запрос="INSERT INTO icon(nomer, icon) VALUES ('"+Строка(Число(Номер.Код))+"');"; //='"+Задание+"' where nomer = "+Строка(Число(Номер.Код));	
		
	Иначе
		Запрос="INSERT INTO `artemis`.`icon` (`nomer`, `icon`) VALUES ('"+Строка(Число(Номер.Код))+"','"+Значок+"')";	
	КонецЕсли;	
	СлужебныеСервер.КомандаMySQL(Запрос);
	
	////ВЛог("Создано задание горничной: " + Задание + " по номеру " + Строка(Число(Номер.Код))+" пользователем " + ТекПол,"Задания.log");	
КонецПроцедуры

Процедура ОчиститьЗначки() Экспорт
				////         INSERT INTO `artemis`.`icon` (`nomer`, `icon`) VALUES ('501', 'fa-bed');
	Запрос="DELETE FROM icon";	
	СлужебныеСервер.КомандаMySQL(Запрос);
	////ВЛог("Создано задание горничной: " + Задание + " по номеру " + Строка(Число(Номер.Код))+" пользователем " + ТекПол,"Задания.log");	
КонецПроцедуры
// - Из  Обработка.ФормированиеЗаданийНаСменуБелья.Форма

//////// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++





	



