
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = Истина;	
	
Параметры.Свойство("ДокументыОплатыОтбор", ДокументыОплатыОтбор);
Если ДокументыОплатыОтбор.Количество() > 0 Тогда 
	Элементы.Контрагент.Видимость = Ложь;
	Элементы.НаименованиеЮрЛица.Видимость = Ложь;
	
	//Элементы.КонтрагентНаименование.Видимость = Ложь;
	
	ЕстьДокументыОплатыОтбор = Истина;	
Иначе
	Элементы.Контрагент.Видимость = Истина;
	Элементы.НаименованиеЮрЛица.Видимость = КлиентыСервер.ЭтоЮрЛицо(Контрагент);
	
	//Элементы.КонтрагентНаименование.Видимость = Истина;
КонецЕсли;	

Параметры.Свойство("Контрагент", Контрагент);
НаименованиеЮрЛица = Контрагент.НаименованиеЮрЛица;

КонтрагентНаименование = КлиентыСервер.КлиентПредставление(Контрагент);

Список.Параметры.УстановитьЗначениеПараметра("ЕстьДокументыОплатыОтбор", ЕстьДокументыОплатыОтбор);
Список.Параметры.УстановитьЗначениеПараметра("ДокументыОплатыОтбор", ДокументыОплатыОтбор);
Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
КонецПроцедуры

//
&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ПараметрыФормы = Новый Структура();

ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаВыбораКлиентаДляКопияЧек", , Элементы.Контрагент
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

Контрагент = ВыбранноеЗначение;
//НаименованиеЮрЛица = Контрагент.НаименованиеЮрЛица;
//Элементы.НаименованиеЮрЛица.Видимость = КлиентыСервер.ЭтоЮрЛицо(Контрагент);
Элементы.НаименованиеЮрЛица.Видимость = Ложь;

Список.Параметры.УстановитьЗначениеПараметра("ЕстьДокументыОплатыОтбор", ЕстьДокументыОплатыОтбор);
Список.Параметры.УстановитьЗначениеПараметра("ДокументыОплатыОтбор", ДокументыОплатыОтбор);
Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
КонецПроцедуры


//
&НаКлиенте
Процедура КонтрагентНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_КонтрагентНаименованиеНачалоВыбора", ЭтаФорма);

ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаВыбораКлиентаДляКопияЧек", , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_КонтрагентНаименованиеНачалоВыбора(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

Контрагент = Результат;
КонтрагентНаименование = КлиентыСервер.КлиентПредставление(Контрагент);

КонтрагентНаименованиеОбработкаВыбора();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНаименованиеОбработкаВыбора()
Список.Параметры.УстановитьЗначениеПараметра("ЕстьДокументыОплатыОтбор", ЕстьДокументыОплатыОтбор);
Список.Параметры.УстановитьЗначениеПараметра("ДокументыОплатыОтбор", ДокументыОплатыОтбор);
Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ПараметрыФормы = Новый Структура("Ключ", Контрагент);

ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//

