

&НаКлиенте
Процедура ПроверитьЗаявки(Команда)
ПроверитьЗаявкиНаСервере();

ЭтаФорма.ТекущийЭлемент = Элементы.ОшибкиЗаявкиТаблица;
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаявкиНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |ГДЕ
                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                      |	И ЗаявкаНаБронирование.РезервС >= &ДатаС
                      |	И ЗаявкаНаБронирование.РезервС <= &ДатаПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ЗаявкаНаБронирование.РезервС");	

Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_Заявки = Запрос.Выполнить().Выгрузить();

Для Каждого СтрокаЗаявка Из ТЗ_Заявки Цикл
	ЗаявкаОбъект = СтрокаЗаявка.Ссылка.ПолучитьОбъект();
	
	Для Каждого СтрокаОплаты Из ЗаявкаОбъект.СчетаДетальноОплаты Цикл
		ДокументОплатыОбъект = СтрокаОплаты.ДокументОплаты.ПолучитьОбъект();
		Если ДокументОплатыОбъект = Неопределено Тогда
			СтрокаОшибки = ОшибкиЗаявкиТаблица.Добавить();
			СтрокаОшибки.ЗаявкаНаБронирование = ЗаявкаОбъект.Ссылка;
			СтрокаОшибки.ТекстОшибки = "" + ЗаявкаОбъект.Ссылка + " Ошибочный документ оплаты.";
			
			Продолжить;
		КонецЕсли;
		
		Если СтрокаОплаты.СуммаРаспределено = 0 Тогда
			СтрокаОшибки = ОшибкиЗаявкиТаблица.Добавить();
			СтрокаОшибки.ЗаявкаНаБронирование = ЗаявкаОбъект.Ссылка;
			СтрокаОшибки.ТекстОшибки = "" + ЗаявкаОбъект.Ссылка + " Документ оплаты: " + СтрокаОплаты.ДокументОплаты  
				+ " Сумма Распределено документа оплаты	равна 0.";	
		КонецЕсли;  
		
		ОтборСтроки = Новый Структура("ДокументОплаты", СтрокаОплаты.ДокументОплаты);
		ТЗ = ЗаявкаОбъект.РаспределениеОплатДолги.Выгрузить(ОтборСтроки, "СуммаОплаты"); 
		ИтогоСуммаОплаты = ТЗ.Итог("СуммаОплаты");
		Если СтрокаОплаты.СуммаРаспределено <> ИтогоСуммаОплаты ТОгда
			СтрокаОшибки = ОшибкиЗаявкиТаблица.Добавить();
			СтрокаОшибки.ЗаявкаНаБронирование = ЗаявкаОбъект.Ссылка;
			СтрокаОшибки.ТекстОшибки = "" + ЗаявкаОбъект.Ссылка + " Документ оплаты: " + СтрокаОплаты.ДокументОплаты  
				+ " СуммаРаспределено документа оплаты: " + СтрокаОплаты.СуммаРаспределено 
				+ "	НЕ равна Итого СуммаОплаты в Распределении оплат: " + ИтогоСуммаОплаты;			
		КонецЕсли;
	КонецЦикла;
	
	ТЗ = ЗаявкаОбъект.СчетаДетальноДолги.Выгрузить(, "СуммаДолг, СуммаКЗакрытию, СуммаОплачено");
	ИтогоСуммаДолг = ТЗ.Итог("СуммаДолг");
	ИтогоСуммаКЗакрытию = ТЗ.Итог("СуммаКЗакрытию");
	ИтогоСуммаОплачено = ТЗ.Итог("СуммаОплачено");
	
	Если  ИтогоСуммаДолг <> ИтогоСуммаКЗакрытию + ИтогоСуммаОплачено Тогда
		СтрокаОшибки = ОшибкиЗаявкиТаблица.Добавить();
		СтрокаОшибки.ЗаявкаНаБронирование = ЗаявкаОбъект.Ссылка;
		СтрокаОшибки.ТекстОшибки = "" + ЗаявкаОбъект.Ссылка + " Итого СуммаДолг: " + ИтогоСуммаДолг  
			+ "	НЕ равна Итого СуммаКЗакрытию: " +  ИтогоСуммаКЗакрытию + " + Итого СуммаОплачено: " + ИтогоСуммаОплачено;
	КонецЕсли;
	
	Для Каждого СтрокаДолги Из ЗаявкаОбъект.СчетаДетальноДолги Цикл
		ОтборСтроки = Новый Структура("ГУИД", СтрокаДолги.ДолгиГУИД);
		Если СтрокаДолги.Услуга Тогда 
			НайденныеСтроки = ЗаявкаОбъект.ДопУслуги.НайтиСтроки(ОтборСтроки);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаОшибки = ОшибкиЗаявкиТаблица.Добавить();
				СтрокаОшибки.ЗаявкаНаБронирование = ЗаявкаОбъект.Ссылка;
				СтрокаОшибки.ТекстОшибки = "" + ЗаявкаОбъект.Ссылка + " На найдена строка ДопУслуги по строке Долги: " + СтрокаДолги.НаименованиеДолг 
					+ " Дата Долг: " + СтрокаДолги.ДатаДолг;	
			КонецЕсли;
		Иначе	
			НайденныеСтроки = ЗаявкаОбъект.Проживание.НайтиСтроки(ОтборСтроки);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаОшибки = ОшибкиЗаявкиТаблица.Добавить();
				СтрокаОшибки.ЗаявкаНаБронирование = ЗаявкаОбъект.Ссылка;
				СтрокаОшибки.ТекстОшибки = "" + ЗаявкаОбъект.Ссылка + " На найдена строка Проживание по строке Долги: " + СтрокаДолги.НаименованиеДолг 
					+ " Дата Долг: " + СтрокаДолги.ДатаДолг;	
			КонецЕсли;
		КонецЕсли;
		
		ОтборСтроки = Новый Структура("ДолгиГУИД", СтрокаДолги.ДолгиГУИД);
		ТЗ = ЗаявкаОбъект.РаспределениеОплатДолги.Выгрузить(ОтборСтроки, "СуммаОплаты");
		ИтогоСуммаОплаты = ТЗ.Итог("СуммаОплаты"); 
		
		Если СтрокаДолги.СуммаОплачено <> ИтогоСуммаОплаты Тогда
			СтрокаОшибки = ОшибкиЗаявкиТаблица.Добавить();
			СтрокаОшибки.ЗаявкаНаБронирование = ЗаявкаОбъект.Ссылка;
			СтрокаОшибки.ТекстОшибки = "" + ЗаявкаОбъект.Ссылка + " СуммаОплачено: "  + СтрокаДолги.СуммаОплачено 
				+ " по строке Долги: "   + СтрокаДолги.НаименованиеДолг + " Дата Долг: " + СтрокаДолги.ДатаДолг
				+ " не равно Итого СуммаОплаты в Распределении Оплат: " + ИтогоСуммаОплаты;	
		КонецЕсли;
	КонецЦикла;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиЗаявкиТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Элемент.ТекущиеДанные;

ПараметрыФормы = Новый Структура("Ключ", ТД.ЗаявкаНаБронирование); 
ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры

//
&НаКлиенте
Процедура ПроверитьКассовыйДокумент(Команда)
	ПроверитьКассовыйДокументНаСервере();
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ОшибкиКассовыйДокумент;
КонецПроцедуры

&НаСервере
Процедура ПроверитьКассовыйДокументНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КассовыйДокумент.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.КассовыйДокумент КАК КассовыйДокумент
                      |ГДЕ
                      |	КассовыйДокумент.ПометкаУдаления = ЛОЖЬ
                      |	И КассовыйДокумент.ДатаОплаты >= &ДатаС
                      |	И КассовыйДокумент.ДатаОплаты <= &ДатаПо");	

Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_ДокументыОплаты = Запрос.Выполнить().Выгрузить();

ПроверитьДокументыОплаты(ТЗ_ДокументыОплаты, ОшибкиКассовыйДокументТаблица, "КассовыйДокумент");
КонецПроцедуры

&НаСервере
Процедура ПроверитьДокументыОплаты(ТЗ_ДокументыОплаты, ОшибкиТаблица, ИмяДокумента)
Для Каждого СтрокаДокументыОплаты Из ТЗ_ДокументыОплаты Цикл
	ДокументыОплатыОбъект = СтрокаДокументыОплаты.Ссылка.ПолучитьОбъект();
	
	ДолгиОплата = ДокументыОплатыОбъект.ДолгиОплата.Выгрузить(,"ДокументДолг, Сумма");
	ДолгиОплата.Свернуть("ДокументДолг", "Сумма");
	Для Каждого СтрокаДолгиОплата Из ДолгиОплата Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаДолгиОплата.ДокументДолг) Тогда
			СтрокаОшибки = ОшибкиТаблица.Добавить();
			СтрокаОшибки[ИмяДокумента] = СтрокаДокументыОплаты.Ссылка;
			СтрокаОшибки.ТекстОшибки = "" + СтрокаДокументыОплаты.Ссылка 
				+ " Не заполнен ДокументДолг в ДолгиОплаты";
			
			Продолжить;
		КонецЕсли;
		
		ДокументДолгОбъект = СтрокаДолгиОплата.ДокументДолг.ПолучитьОбъект();
		Если ДокументДолгОбъект = Неопределено Тогда
			СтрокаОшибки = ОшибкиТаблица.Добавить();
			СтрокаОшибки[ИмяДокумента] = СтрокаДокументыОплаты.Ссылка;
			СтрокаОшибки.ТекстОшибки = "" + СтрокаДокументыОплаты.Ссылка 
				+ " Ошибочная ссылка на ДокументДолг в ДолгиОплаты";
			
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаДолгиОплата.ДокументДолг) = Тип("ДокументСсылка.ЗаявкаНаБронирование") Тогда
			ОтборСтроки = Новый Структура("ДокументОплаты", СтрокаДокументыОплаты.Ссылка);
			ТЗ = ДокументДолгОбъект.СчетаДетальноОплаты.Выгрузить(ОтборСтроки, "СуммаРаспределено");
			ИтогоСуммаРаспределено = ТЗ.Итог("СуммаРаспределено");
			
			Если СтрокаДолгиОплата.Сумма <> ИтогоСуммаРаспределено ТОгда
				СтрокаОшибки = ОшибкиТаблица.Добавить();
				СтрокаОшибки[ИмяДокумента] = СтрокаДокументыОплаты.Ссылка;
				СтрокаОшибки.ТекстОшибки = "" + СтрокаДокументыОплаты.Ссылка + " Заявка: " + СтрокаДолгиОплата.ДокументДолг 
					+ " Сумма в ДолгиОплата: " + СтрокаДолгиОплата.Сумма 
					+ " НЕ равна ИтогоСуммаРаспределено: " + ИтогоСуммаРаспределено + " в СчетаДетальноОплаты";
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтрокаДолгиОплата.ДокументДолг) = Тип("ДокументСсылка.ГрупповыеСчета") Тогда
			ОтборСтроки = Новый Структура("ДокументОплаты", СтрокаДокументыОплаты.Ссылка);
			ТЗ = ДокументДолгОбъект.ДокументыОплаты.Выгрузить(ОтборСтроки, "СуммаРаспределено");
			ИтогоСуммаРаспределено = ТЗ.Итог("СуммаРаспределено");
			
			Если СтрокаДолгиОплата.Сумма <> ИтогоСуммаРаспределено ТОгда
				СтрокаОшибки = ОшибкиТаблица.Добавить();
				СтрокаОшибки[ИмяДокумента] = СтрокаДокументыОплаты.Ссылка;
				СтрокаОшибки.ТекстОшибки = "" + СтрокаДокументыОплаты.Ссылка + " Групповой Счет: " + СтрокаДолгиОплата.ДокументДолг 
					+ " Сумма в ДолгиОплата: " + СтрокаДолгиОплата.Сумма 
					+ " НЕ равна ИтогоСуммаРаспределено: " + ИтогоСуммаРаспределено + " в ДокументыОплаты";
			КонецЕсли;
			
			
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
                        |	ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка КАК ДокументДолг
                        |ИЗ
                        |	Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                        |ГДЕ
                        |	ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты = &ДокументОплаты");
	
	Запрос.УстановитьПараметр("ДокументОплаты", СтрокаДокументыОплаты.Ссылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Если ТЗ.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Для Каждого Строка Из ТЗ Цикл
		ОтборСтроки = Новый Структура("ДокументДолг", Строка.ДокументДолг);
		НайденныеСтроки = ДокументыОплатыОбъект.ДолгиОплата.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаОшибки = ОшибкиТаблица.Добавить();
			СтрокаОшибки[ИмяДокумента] = СтрокаДокументыОплаты.Ссылка;
			СтрокаОшибки.ТекстОшибки = "" + СтрокаДокументыОплаты.Ссылка 
					+ " Заявка : " + Строка.ДокументДолг + ". Найдена ссылка на документ оплаты, отсутствующая в ДолгиОплата.";
		КонецЕсли;
	КонецЦикла;
		
	
	Запрос = Новый Запрос("ВЫБРАТЬ
                        |	ГрупповыеСчетаДокументыОплаты.Ссылка КАК ДокументДолг
                        |ИЗ
                        |	Документ.ГрупповыеСчета.ДокументыОплаты КАК ГрупповыеСчетаДокументыОплаты
                        |ГДЕ
                        |	ГрупповыеСчетаДокументыОплаты.ДокументОплаты = &ДокументОплаты");
	
	Запрос.УстановитьПараметр("ДокументОплаты", СтрокаДокументыОплаты.Ссылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Если ТЗ.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	Для Каждого Строка Из ТЗ Цикл
		ОтборСтроки = Новый Структура("ДокументДолг", Строка.ДокументДолг);
		НайденныеСтроки = ДокументыОплатыОбъект.ДолгиОплата.НайтиСтроки(ОтборСтроки);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаОшибки = ОшибкиТаблица.Добавить();
			СтрокаОшибки[ИмяДокумента] = СтрокаДокументыОплаты.Ссылка;
			СтрокаОшибки.ТекстОшибки = "" + СтрокаДокументыОплаты.Ссылка 
					+ " Групповой счет : " + Строка.ДокументДолг + ". Найдена ссылка на документ оплаты, отсутствующая в ДолгиОплата.";
		КонецЕсли;
	КонецЦикла;
	
КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ОшибкиКассовыйДокументТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Элемент.ТекущиеДанные;

ПараметрыФормы = Новый Структура("Ключ", ТД.КассовыйДокумент); 
ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ПроверитьВыписки(Команда)
	ПроверитьВыпискиНаСервере();
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ОшибкиВыпискаБанка;
КонецПроцедуры

&НаСервере
Процедура ПроверитьВыпискиНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ПометкаУдаления = ЛОЖЬ
                      |	И ВыпискаБанка.ДатаОплаты >= &ДатаС
                      |	И ВыпискаБанка.ДатаОплаты <= &ДатаПо");	

Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТЗ_ДокументыОплаты = Запрос.Выполнить().Выгрузить();

ПроверитьДокументыОплаты(ТЗ_ДокументыОплаты, ОшибкиВыпискаБанкаТаблица, "ВыпискаБанка");
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиВыпискиТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТД = Элемент.ТекущиеДанные;

ПараметрыФормы = Новый Структура("Ключ", ТД.ВыпискаБанка); 
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры
//

