Перем ТЗЦен;

//
&НаКлиенте
Процедура КнопкаСформироватьНажатие___(Кнопка)
	//ОбновитьТЗЦен();
	//ЗапросПроживаний=Новый Запрос("ВЫБРАТЬ
	//                              |	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживание,
	//                              |	ЕжедневныйАудитПроданныеНомера.Клиент,
	//                              |	ЕжедневныйАудитПроданныеНомера.НомерВРезерв,
	//                              |	ЕжедневныйАудитПроданныеНомера.Бронь,
	//                              |	НАЧАЛОПЕРИОДА(ЕжедневныйАудитПроданныеНомера.Ссылка.Дата, ДЕНЬ) КАК Дата,
	//                              |	ЕжедневныйАудитПроданныеНомера.Тариф
	//                              |ИЗ
	//                              |	Документ.ЕжедневныйАудит.ПроданныеНомера КАК ЕжедневныйАудитПроданныеНомера
	//                              |ГДЕ
	//                              |	ЕжедневныйАудитПроданныеНомера.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
	//                              |
	//                              |УПОРЯДОЧИТЬ ПО
	//                              |	ЕжедневныйАудитПроданныеНомера.Ссылка.Дата");
	//
	//ЗапросПроживаний.УстановитьПараметр("ДатаС",ПериодС);
	//ЗапросПроживаний.УстановитьПараметр("ДатаПо",ПериодПо);
	//ТЗПроживаний=ЗапросПроживаний.Выполнить().Выгрузить();
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//Макет=ПолучитьМакет("Макет");
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//СпецТариф=Справочники.Тариф.НайтиПоНаименованию("ВЫСОКИЙ СЕЗОН +300 и +500");
	//Для каждого СтрПр Из ТЗПроживаний Цикл
	//	ПоискЦ=ТЗЦен.НайтиСтроки(Новый Структура("ДатаЦены,Двухместный,Категория",СтрПр.Дата,?(СтрПр.Бронь.КолВоЧеловек>1,Истина,Ложь),СтрПр.НомерВРезерв.КатегорияНомера));
	//		Если СтрПр.НомерВРезерв.КатегорияНомера.Наименование="Стандартный" тогда
	//			БТ=Константы.БазовыйТарифБудни.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходные.Получить();		
	//			БТ_2=Константы.БазовыйТарифБудниДвух.Получить();
	//			БТ_Вых_2=Константы.БазовыйТарифВыходныеДвух.Получить();		
	//		ИначеЕсли СтрПр.НомерВРезерв.КатегорияНомера.Наименование="Полулюкс" тогда
	//			БТ=Константы.БазовыйТарифБудниПолулюкс.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходныеПолулюкс.Получить();	
	//			БТ_2=Константы.БазовыйТарифБудниПолулюксДвух.Получить();
	//			БТ_Вых_2=Константы.БазовыйТарифВыходныеПолулюксДвух.Получить();	
	//		ИначеЕсли СтрПр.НомерВРезерв.КатегорияНомера.Наименование="Люкс" тогда
	//			БТ=Константы.БазовыйТарифБудниЛюкс.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходныеЛюкс.Получить();		
	//			БТ_2=Константы.БазовыйТарифБудниЛюксДвух.Получить();
	//			БТ_Вых_2=Константы.БазовыйТарифВыходныеЛюксДвух.Получить();	
	//		КонецЕсли;	
	//        ЦенаДня=?(ДеньНедели(СтрПр.Дата)<5,ОкруглитьЦену(?(СтрПр.Бронь.КолВоЧеловек>1,БТ_2,БТ)),ОкруглитьЦену(?(СтрПр.Бронь.КолВоЧеловек>1,БТ_Вых_2,БТ_Вых)));
	//	    ЦенаДня=?(ДеньНедели(СтрПр.Дата)<5,ОкруглитьЦену(БТ),ОкруглитьЦену(БТ_Вых));

	//	Если ПоискЦ.Количество()>0 тогда
	//		ЦенаДня=ЦенаДня+ПоискЦ[0].ПроцентИзменения;
	//	конецесли;
	//Если НЕ СтрПр.Бронь.Оплачивает.Категория.Пустая() тогда
	//	ЦенаДня=ОкруглитьЦену(ЦенаДня-ЦенаДня*(СтрПр.Бронь.Оплачивает.Категория.Скидка/100));
	//конецесли;
	//    ДельтаЦены=СтрПр.СуммаЗаПроживание-ЦенаДня;
	//	
	//	Если (ДельтаЦены>100 или СтрПр.Тариф.ПринадлежитЭлементу(СпецТариф)) и СтрПр.СуммаЗаПроживание>0 тогда
	//		Обл=Макет.ПолучитьОбласть("Строка");
	//		//Дата	Номер	Клиент	СтоимостьБазовая	СтоимостьПродажи	Наценка
	//		Обл.Параметры.Дата=Формат(СтрПр.Дата, "ДФ=dd.MM.yy");
	//		Обл.Параметры.Номер=СтрПр.НомерВРезерв;
	//		Обл.Параметры.Клиент=СтрПр.Клиент;
	//		Обл.Параметры.СтоимостьБазовая=ЦенаДня;
	//		Обл.Параметры.СтоимостьПродажи=СтрПр.СуммаЗаПроживание;
	//		Обл.Параметры.Наценка=СтрПр.СуммаЗаПроживание-ЦенаДня;
	//		ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//	КонецЕсли;
	//	
	//
	//КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКоманда(Команда)
	СформироватьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандаНаСервере()
	ОбновитьТЗЦен();
	ЗапросПроживаний=Новый Запрос("ВЫБРАТЬ
	                              |	ЕжедневныйАудитПроданныеНомера.СуммаЗаПроживание,
	                              |	ЕжедневныйАудитПроданныеНомера.Клиент,
	                              |	ЕжедневныйАудитПроданныеНомера.НомерВРезерв,
	                              |	ЕжедневныйАудитПроданныеНомера.Бронь,
	                              |	НАЧАЛОПЕРИОДА(ЕжедневныйАудитПроданныеНомера.Ссылка.Дата, ДЕНЬ) КАК Дата,
	                              |	ЕжедневныйАудитПроданныеНомера.Тариф_НеИспользуется
	                              |ИЗ
	                              |	Документ.ЕжедневныйАудит.ПроданныеНомера КАК ЕжедневныйАудитПроданныеНомера
	                              |ГДЕ
	                              |	ЕжедневныйАудитПроданныеНомера.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
	                              |
	                              |УПОРЯДОЧИТЬ ПО
	                              |	ЕжедневныйАудитПроданныеНомера.Ссылка.Дата");
	
	ЗапросПроживаний.УстановитьПараметр("ДатаС",Отчет.ПериодС);
	ЗапросПроживаний.УстановитьПараметр("ДатаПо",Отчет.ПериодПо);
	ТЗПроживаний=ЗапросПроживаний.Выполнить().Выгрузить();
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	//Макет=ПолучитьМакет("Макет");
	Макет=Отчеты.ПроданыеСНаценкой_OLD.ПолучитьМакет("Макет");
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	// + ПСН
	//СпецТариф=Справочники.Тариф.НайтиПоНаименованию("ВЫСОКИЙ СЕЗОН +300 и +500");
	СпецТариф=Справочники.Тариф_НеИспользуется.НайтиПоНаименованию("3. ВЫСОКИЙ СЕЗОН");
	// - ПСН
	Для каждого СтрПр Из ТЗПроживаний Цикл
		//ПоискЦ=ТЗЦен.НайтиСтроки(Новый Структура("ДатаЦены,Двухместный,Категория",СтрПр.Дата,?(СтрПр.Бронь.КолВоЧеловек>1,Истина,Ложь),СтрПр.НомерВРезерв.КатегорияНомера));
		ПоискЦ=ТЗЦен.НайтиСтроки(Новый Структура("ДатаЦены,Двухместный,Категория",СтрПр.Дата
			,?(СтрПр.Бронь.КолВоЧеловек>1,Истина,Ложь),СтрПр.КатегорияНомера));
	//		Если СтрПр.НомерВРезерв.КатегорияНомера.Наименование="Стандартный" тогда
	//			БТ=Константы.БазовыйТарифБудни_XXX.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходные.Получить();		
	//			БТ_2=Константы.БазовыйТарифБудниДвух.Получить();
	//			БТ_Вых_2=Константы.БазовыйТарифВыходныеДвух.Получить();		
	//		ИначеЕсли СтрПр.НомерВРезерв.КатегорияНомера.Наименование="Полулюкс" тогда
	//			БТ=Константы.БазовыйТарифБудниПолулюкс.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходныеПолулюкс.Получить();	
	//			БТ_2=Константы.БазовыйТарифБудниПолулюксДвух.Получить();
	//			БТ_Вых_2=Константы.БазовыйТарифВыходныеПолулюксДвух.Получить();	
	//		ИначеЕсли СтрПр.НомерВРезерв.КатегорияНомера.Наименование="Люкс" тогда
	//			БТ=Константы.БазовыйТарифБудниЛюкс.Получить();
	//			БТ_Вых=Константы.БазовыйТарифВыходныеЛюкс.Получить();		
	//			БТ_2=Константы.БазовыйТарифБудниЛюксДвух.Получить();
	//			БТ_Вых_2=Константы.БазовыйТарифВыходныеЛюксДвух.Получить();	
	//		КонецЕсли;	
	//        ЦенаДня=?(ДеньНедели(СтрПр.Дата)<5,ОкруглитьЦену(?(СтрПр.Бронь.КолВоЧеловек>1,БТ_2,БТ)),ОкруглитьЦену(?(СтрПр.Бронь.КолВоЧеловек>1,БТ_Вых_2,БТ_Вых)));
	//	    ЦенаДня=?(ДеньНедели(СтрПр.Дата)<5,ОкруглитьЦену(БТ),ОкруглитьЦену(БТ_Вых));

	//	Если ПоискЦ.Количество()>0 тогда
	//		ЦенаДня=ЦенаДня+ПоискЦ[0].ПроцентИзменения;
	//	конецесли;
	//	
	//	Если НЕ СтрПр.Бронь.Оплачивает.Категория.Пустая() тогда
	//		ЦенаДня=ОкруглитьЦену(ЦенаДня-ЦенаДня*(СтрПр.Бронь.Оплачивает.Категория.Скидка/100));
	//	конецесли;
	//
	//	ДельтаЦены=СтрПр.СуммаЗаПроживание-ЦенаДня;
	//	
	//	// + ПСН
	//	Если НЕ СтрПр.Тариф_НеИспользуется.Пустая() тогда
	//	// - ПСН
	//		Если (ДельтаЦены>100 или СтрПр.Тариф_НеИспользуется.ПринадлежитЭлементу(СпецТариф)) и СтрПр.СуммаЗаПроживание>0 тогда
	//			Обл=Макет.ПолучитьОбласть("Строка");
	//			//Дата	Номер	Клиент	СтоимостьБазовая	СтоимостьПродажи	Наценка
	//			Обл.Параметры.Дата=Формат(СтрПр.Дата, "ДФ=dd.MM.yy");
	//			Обл.Параметры.Номер=СтрПр.НомерВРезерв;
	//			Обл.Параметры.Клиент=СтрПр.Клиент;
	//			Обл.Параметры.СтоимостьБазовая=ЦенаДня;
	//			Обл.Параметры.СтоимостьПродажи=СтрПр.СуммаЗаПроживание;
	//			Обл.Параметры.Наценка=СтрПр.СуммаЗаПроживание-ЦенаДня;
	//			
	//			//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//			ПолеОтчета.Вывести(Обл);
	//			
	//		КонецЕсли;
	//	КонецЕсли;	
	//	
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Функция ОбновитьТЗЦен()
	ЗапросЦен=Новый Запрос("ВЫБРАТЬ
	                       |	ЦеныПоДатам.ДатаЦены,
	                       |	ЦеныПоДатам.Тариф_НеИспользуется,
	                       |	ЦеныПоДатам.ПроцентИзменения,
	                       |	ЦеныПоДатам.Двухместный,
	                       |	ЦеныПоДатам.Категория
	                       |ИЗ
	                       |	РегистрСведений.ЦеныПоДатам КАК ЦеныПоДатам
	                       |ГДЕ
	                       |	ЦеныПоДатам.ДатаЦены МЕЖДУ &ДатаС И &ДатаПо");
	ЗапросЦен.УстановитьПараметр("ДатаС",Отчет.ПериодС);
	ЗапросЦен.УстановитьПараметр("ДатаПо",Отчет.ПериодПо);
	ТЗЦен=ЗапросЦен.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ОкруглитьЦену(Цена)
	 
    Сотен = 100 * Цел(Цена/100);
    Рублей = Цена - Сотен;
    Если Рублей>=75 Тогда
        Рублей = 100;
    ИначеЕсли Рублей >= 25 Тогда
        Рублей = 50;
    Иначе
        Рублей = 0;        
    КонецЕсли;
    Возврат Сотен+Рублей;
КонецФункции
