
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаОтчета = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
СформироватьОтчетНаСервере();
КонецПроцедуры               

&НаСервере
Процедура СформироватьОтчетНаСервере()
Макет = Отчеты.ОтчетВТрэвелЛайн.ПолучитьМакет("Макет");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КатегорииНомеров.Ссылка КАК КатегорияНомера,
                      |	Номера.ВсегоНомеров КАК ВсегоНомеров
                      |ИЗ
                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			НомернойФонд.КатегорияНомера КАК КатегорияНомера,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК ВсегоНомеров
                      |		ИЗ
                      |			Справочник.НомернойФонд КАК НомернойФонд
                      |		ГДЕ
                      |			НомернойФонд.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			НомернойФонд.КатегорияНомера) КАК Номера
                      |		ПО КатегорииНомеров.Ссылка = Номера.КатегорияНомера
                      |ГДЕ
                      |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ");

ТЗКатегории = Запрос.Выполнить().Выгрузить();

ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
ПолеОтчета.Вывести(ОбластьШапка);

Дата_П = ДатаОтчета;
ДатаКонец = Дата_П + 61 * 24 * 60 * 60;
Пока Дата_П < ДатаКонец Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КатегорииНомеров.Ссылка КАК КатегорияНомера,
	                      |	ЕСТЬNULL(Данные.Заезд, 0) КАК Заезд,
	                      |	ЕСТЬNULL(Данные.Проживает, 0) КАК Проживает,
	                      |	Данные.Сумма КАК Сумма,
	                      |	Данные.СуммаБезСкидки КАК СуммаБезСкидки
	                      |ИЗ
	                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ЗаявкаНаБронирование.КатегорияНомера КАК КатегорияНомера,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронирование.РезервС = &Дата
	                      |						ТОГДА 1
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ) КАК Заезд,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронирование.РезервС < &Дата
	                      |							И ЗаявкаНаБронирование.РезервПо > &Дата
	                      |						ТОГДА 1
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ) КАК Проживает,
	                      |			СУММА(Продажи.Сумма) КАК Сумма,
	                      |			СУММА(Продажи.СуммаБезСкидки) КАК СуммаБезСкидки
	                      |		ИЗ
	                      |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                      |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |					ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	                      |					СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма,
	                      |					СУММА(ЗаявкаНаБронированиеПроживание.СуммаБезСкидки) КАК СуммаБезСкидки
	                      |				ИЗ
	                      |					Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                      |				
	                      |				СГРУППИРОВАТЬ ПО
	                      |					ЗаявкаНаБронированиеПроживание.Ссылка) КАК Продажи
	                      |				ПО ЗаявкаНаБронирование.Ссылка = Продажи.Ссылка
	                      |		ГДЕ
	                      |			ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	                      |			И ЗаявкаНаБронирование.РезервС <= &Дата
	                      |			И ЗаявкаНаБронирование.РезервПо > &Дата
	                      |			И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
	                      |			И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
	                      |			И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ЗаявкаНаБронирование.КатегорияНомера) КАК Данные
	                      |		ПО КатегорииНомеров.Ссылка = Данные.КатегорияНомера
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КатегорииНомеров.Номер_пп");

	Запрос.УстановитьПараметр("Дата", Дата_П);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ЭтоПерваяСтрока = Истина;
	Для Каждого Строка Из ТЗ Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		ОбластьСтрока.Параметры.Дата = Формат(Дата_П, "ДФ=dd.MM.yyyy");;	
		ОбластьСтрока.Параметры.ТипНомера = Строка.КатегорияНомера;
		
		ОбластьСтрока.Параметры.ЗаездНомеров = Строка.Заезд;
		ОбластьСтрока.Параметры.ПроживаетНомеров = Строка.Проживает;
		
		ПрогнозЗанятыхНомеров = Строка.Заезд + Строка.Проживает;
		ОбластьСтрока.Параметры.ПрогнозЗанятыхНомеров = ПрогнозЗанятыхНомеров;
		
		ОтборСтрок = Новый Структура("КатегорияНомера", Строка.КатегорияНомера);
		НайденныеСтроки = ТЗКатегории.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ВсегоНомеров = НайденныеСтроки[0].ВсегоНомеров;	
			ОбластьСтрока.Параметры.ВсегоНомеров = ВсегоНомеров;	
			
			Если ВсегоНомеров > 0 Тогда
				ПроцентЗанятыхНомеров = Окр(ПрогнозЗанятыхНомеров / ВсегоНомеров); 
				ОбластьСтрока.Параметры.ПроцентЗанятыхНомеров = ПроцентЗанятыхНомеров;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ЭтоПерваяСтрока Тогда
			Обл = ОбластьСтрока.Область(,1,,10);
			Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			Обл.ГраницаСверху = Линия;
			
			ЭтоПерваяСтрока = Ложь;
		КонецЕсли;
		
		СвободноНомеров = ВсегоНомеров - ПрогнозЗанятыхНомеров;
		ОбластьСтрока.Параметры.СвободноНомеров = СвободноНомеров;
		
		ОбластьСтрока.Параметры.Продажи = Строка.СуммаБезСкидки;
		ОбластьСтрока.Параметры.Доходы = Строка.Сумма;
		
		ПолеОтчета.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	Дата_П = Дата_П + 24 * 60 * 60;
КонецЦикла;	

ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
Обл = ОбластьСтрока.Область(,1,,10);
Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
Обл.ГраницаСверху = Линия;

Обл = ОбластьСтрока.Область(,10,,10);
Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
Обл.ГраницаСправа = Линия;

ПолеОтчета.Вывести(ОбластьСтрока);
	
КонецПроцедуры

&НаСервере
Функция ОтчетВТревелЛайнНаСервере()
ТабДок = Новый ТабличныйДокумент;	
	
Макет = Отчеты.ОтчетВТрэвелЛайн.ПолучитьМакет("МакетEXEL");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КатегорииНомеров.Ссылка КАК КатегорияНомера,
                      |	Номера.ВсегоНомеров КАК ВсегоНомеров
                      |ИЗ
                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			НомернойФонд.КатегорияНомера КАК КатегорияНомера,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК ВсегоНомеров
                      |		ИЗ
                      |			Справочник.НомернойФонд КАК НомернойФонд
                      |		ГДЕ
                      |			НомернойФонд.ПометкаУдаления = ЛОЖЬ
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			НомернойФонд.КатегорияНомера) КАК Номера
                      |		ПО КатегорииНомеров.Ссылка = Номера.КатегорияНомера
                      |ГДЕ
                      |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ");

ТЗКатегории = Запрос.Выполнить().Выгрузить();


ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок1");  
ДТ = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy HH:mm:ss");    
ДТ = Лев(ДТ, СтрДлина(ДТ) - 3);
ОбластьЗаголовок.Параметры.ДатаОтчета = ДТ;
ТабДок.Вывести(ОбластьЗаголовок);   

ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок2"); 
ТабДок.Вывести(ОбластьЗаголовок);

ДатаКонец = ДатаОтчета + 61 * 24 * 60 * 60;
ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок3");   
ОбластьЗаголовок.Параметры.От = Формат(ДатаОтчета, "ДФ=dd.MM.yyyy"); 
ОбластьЗаголовок.Параметры.По = Формат(ДатаКонец, "ДФ=dd.MM.yyyy"); 
ТабДок.Вывести(ОбластьЗаголовок);

ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(ОбластьШапка);

Дата_П = ДатаОтчета;
//ДатаКонец = Дата_П + 61 * 24 * 60 * 60;
Пока Дата_П < ДатаКонец Цикл
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	КатегорииНомеров.Ссылка КАК КатегорияНомера,
	//                      |	ЕСТЬNULL(Данные.Заезд, 0) КАК Заезд,
	//                      |	ЕСТЬNULL(Данные.Проживает, 0) КАК Проживает,
	//                      |	Данные.Сумма КАК Сумма,
	//                      |	Данные.СуммаБезСкидки КАК СуммаБезСкидки
	//                      |ИЗ
	//                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//                      |			ЗаявкаНаБронирование.КатегорияНомера КАК КатегорияНомера,
	//                      |			СУММА(ВЫБОР
	//                      |					КОГДА ЗаявкаНаБронирование.РезервС = &Дата
	//                      |						ТОГДА 1
	//                      |					ИНАЧЕ 0
	//                      |				КОНЕЦ) КАК Заезд,
	//                      |			СУММА(ВЫБОР
	//                      |					КОГДА ЗаявкаНаБронирование.РезервС < &Дата
	//                      |							И ЗаявкаНаБронирование.РезервПо > &Дата
	//                      |						ТОГДА 1
	//                      |					ИНАЧЕ 0
	//                      |				КОНЕЦ) КАК Проживает,
	//                      |			СУММА(Продажи.Сумма) КАК Сумма,
	//                      |			СУММА(Продажи.СуммаБезСкидки) КАК СуммаБезСкидки
	//                      |		ИЗ
	//                      |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                      |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//                      |					ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	//                      |					СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма,
	//                      |					СУММА(ЗаявкаНаБронированиеПроживание.СуммаБезСкидки) КАК СуммаБезСкидки
	//                      |				ИЗ
	//                      |					Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	//                      |				
	//                      |				СГРУППИРОВАТЬ ПО
	//                      |					ЗаявкаНаБронированиеПроживание.Ссылка) КАК Продажи
	//                      |				ПО ЗаявкаНаБронирование.Ссылка = Продажи.Ссылка
	//                      |		ГДЕ
	//                      |			ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	//                      |			И ЗаявкаНаБронирование.РезервС <= &Дата
	//                      |			И ЗаявкаНаБронирование.РезервПо > &Дата
	//                      |			И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
	//                      |			И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
	//                      |			И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
	//                      |		
	//                      |		СГРУППИРОВАТЬ ПО
	//                      |			ЗаявкаНаБронирование.КатегорияНомера) КАК Данные
	//                      |		ПО КатегорииНомеров.Ссылка = Данные.КатегорияНомера
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	КатегорииНомеров.Номер_пп");

	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КатегорииНомеров.Ссылка КАК КатегорияНомера,
	                      |	ЕСТЬNULL(Данные.Заезд, 0) КАК Заезд,
	                      |	ЕСТЬNULL(Данные.Проживает, 0) КАК Проживает,
	                      |	ЕСТЬNULL(Данные.ЗаездГости, 0) КАК ЗаездГости,
	                      |	ЕСТЬNULL(Данные.ПроживаетГости, 0) КАК ПроживаетГости,
	                      |	Данные.Сумма КАК Сумма,
	                      |	Данные.СуммаБезСкидки КАК СуммаБезСкидки
	                      |ИЗ
	                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ЗаявкаНаБронирование.КатегорияНомера КАК КатегорияНомера,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронирование.РезервС = &Дата
	                      |						ТОГДА 1
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ) КАК Заезд,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронирование.РезервС < &Дата
	                      |							И ЗаявкаНаБронирование.РезервПо > &Дата
	                      |						ТОГДА 1
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ) КАК Проживает,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронирование.РезервС = &Дата
	                      |						ТОГДА ЗаявкаНаБронирование.КолВоЧеловек
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ) КАК ЗаездГости,
	                      |			СУММА(ВЫБОР
	                      |					КОГДА ЗаявкаНаБронирование.РезервС < &Дата
	                      |							И ЗаявкаНаБронирование.РезервПо > &Дата
	                      |						ТОГДА ЗаявкаНаБронирование.КолВоЧеловек
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ) КАК ПроживаетГости,
	                      |			СУММА(Продажи.Сумма) КАК Сумма,
	                      |			СУММА(Продажи.СуммаБезСкидки) КАК СуммаБезСкидки
	                      |		ИЗ
	                      |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                      |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |					ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	                      |					СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма,
	                      |					СУММА(ЗаявкаНаБронированиеПроживание.СуммаБезСкидки) КАК СуммаБезСкидки
	                      |				ИЗ
	                      |					Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	                      |				
	                      |				СГРУППИРОВАТЬ ПО
	                      |					ЗаявкаНаБронированиеПроживание.Ссылка) КАК Продажи
	                      |				ПО ЗаявкаНаБронирование.Ссылка = Продажи.Ссылка
	                      |		ГДЕ
	                      |			ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	                      |			И ЗаявкаНаБронирование.РезервС <= &Дата
	                      |			И ЗаявкаНаБронирование.РезервПо > &Дата
	                      |			И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
	                      |			И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)
	                      |			И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ЗаявкаНаБронирование.КатегорияНомера) КАК Данные
	                      |		ПО КатегорииНомеров.Ссылка = Данные.КатегорияНомера
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КатегорииНомеров.Номер_пп");
	
	Запрос.УстановитьПараметр("Дата", Дата_П);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ЭтоПерваяСтрока = Истина;
	Для Каждого Строка Из ТЗ Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		ОбластьСтрока.Параметры.Дата = Формат(Дата_П, "ДФ=dd.MM.yyyy");;	
		ОбластьСтрока.Параметры.ТипНомера = Строка.КатегорияНомера;
		
		ОбластьСтрока.Параметры.ЗаездНомеров = Строка.Заезд;
		ОбластьСтрока.Параметры.ПроживаетНомеров = Строка.Проживает;
		
		ЗанятоНомеров = Строка.Заезд + Строка.Проживает;
		ОбластьСтрока.Параметры.ЗанятоНомеров = ЗанятоНомеров;
		
		ОтборСтрок = Новый Структура("КатегорияНомера", Строка.КатегорияНомера);
		НайденныеСтроки = ТЗКатегории.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ВсегоНомеров = НайденныеСтроки[0].ВсегоНомеров;	
			ОбластьСтрока.Параметры.ВсегоНомеров = ВсегоНомеров;	
			
			Если ВсегоНомеров > 0 Тогда
				ПроцентЗанятыхНомеров = Окр((ЗанятоНомеров / ВсегоНомеров) * 100); 
				ОбластьСтрока.Параметры.ПроцентЗанятыхНомеров = ПроцентЗанятыхНомеров;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ЭтоПерваяСтрока Тогда
			//Обл = ОбластьСтрока.Область(,1,,10);
			//Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			//Обл.ГраницаСверху = Линия;
			
			ЭтоПерваяСтрока = Ложь;
		КонецЕсли;
		
		СвободноНомеров = ВсегоНомеров - ЗанятоНомеров;
		ОбластьСтрока.Параметры.СвободноНомеров = СвободноНомеров;
		
//		
		ОбластьСтрока.Параметры.ЗаездГости = Строка.ЗаездГости;
		ОбластьСтрока.Параметры.ПроживаетГости = Строка.ПроживаетГости;
		
		ПрогнозГости = Строка.ЗаездГости + Строка.ПроживаетГости;
		ОбластьСтрока.Параметры.ПрогнозГости = ПрогнозГости;
//		
		ОбластьСтрока.Параметры.Продажи = Строка.СуммаБезСкидки;
		ОбластьСтрока.Параметры.Доходы = Строка.Сумма;
		
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	Дата_П = Дата_П + 24 * 60 * 60;
КонецЦикла;	

//ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
//Обл = ОбластьСтрока.Область(,1,,10);
//Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
//Обл.ГраницаСверху = Линия;

//Обл = ОбластьСтрока.Область(,10,,10);
//Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
//Обл.ГраницаСправа = Линия;

//ТабДок.Вывести(ОбластьСтрока);

ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
ТабДок.Вывести(ОбластьИтоги);

Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВEXEL(Команда)  
ПолноеИмяФайла = ВыборФайла();
Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда Возврат; КонецЕсли;

ТекстСообщения = "Формирование файла EXEL
			|
			|ПОДОЖДИТЕ ...";	
ПараметрыФормы = Новый Структура("ТекстСообщения", ТекстСообщения);
Форма = ОткрытьФорму("ОбщаяФорма.СообщениеОперация", ПараметрыФормы,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
ТабДок = ОтчетВТревелЛайнНаСервере(); 	
ПолеОтчетаEXEL = ТабДок;  

Форма.Закрыть();

ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ПолеОтчетаEXEL;  

ТабДок.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
КонецПроцедуры

 &НаКлиенте
Функция ВыборФайла()
СтандартнаяОбработка=ложь;
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
Диалог.Заголовок = "Выберите файл";

Каталог = "C:\Desktop\";
ИмяФайла = "Отчет в Тревел Лайн.xlsx"; 
Диалог.ПолноеИмяФайла = Каталог + ИмяФайла;

Фильтр = "XLSX (*.xlsx)|*.xlsx"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = "C:\Desktop\";
Если Диалог.Выбрать() Тогда
	Возврат Диалог.ПолноеИмяФайла;
КонецЕсли;

Возврат Неопределено;
КонецФункции    

/////
&НаКлиенте
Процедура ВыгрузитьВEXELДействие(ПолноеИмяФайла)
ПолноеИмяФайла = ВыборФайла();
Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда Возврат; КонецЕсли;

ТекстСообщения = "Формирование файла EXEL
			|
			|ПОДОЖДИТЕ ...";	
ПараметрыФормы = Новый Структура("ТекстСообщения", ТекстСообщения);
Форма = ОткрытьФорму("ОбщаяФорма.СообщениеОперация", ПараметрыФормы,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
ТабДок = ОтчетВТревелЛайнНаСервере(); 	

Ячейка = ТабДок.Область(1,1,1,1);
Если НЕ ЗначениеЗаполнено(Ячейка.Текст) Тогда Возврат; КонецЕсли;

Excel = Новый COMОбъект("Excel.Application"); //подключение к Excel
Книга = Excel.WorkBooks.Add();  //добавление книги
Лист = Книга.Worksheets.add(); //добавление листа
Лист.Name = "Отчет"; //имя листа (без проблелов)
Excel.displayAlerts = 0; //отключить модальное окно Excel на перезапись файла

Excel.Visible = Ложь;

ВсегоСтрок = ТабДок.ВысотаТаблицы;
ВсегоКолонок = ТабДок.ШиринаТаблицы;

НачальнаяСтрока = 4;

Колонка = 1;
Пока Колонка <= ВсегоКолонок Цикл 		
	ЯчейкаОтчета = ТабДок.Область(1, Колонка, 1, Колонка);
	
	СтрокаEXEL = НачальнаяСтрока;
	ЯчейкаEXEL =  Лист.Cells(СтрокаEXEL, Колонка);	
	
	Value = ЯчейкаОтчета.Текст;
	Value = СтрЗаменить(Value, Символы.ПС, " ");
	
	ЯчейкаEXEL.Value = Value;
	
	Колонка = Колонка + 1;
КонецЦикла;

Строка = 2;
Пока Строка < ВсегоСтрок Цикл
	Колонка = 1;
	Пока Колонка <= ВсегоКолонок Цикл 		
		ЯчейкаОтчета = ТабДок.Область(Строка, Колонка, Строка, Колонка);
		
		СтрокаEXEL = НачальнаяСтрока + Строка - 1;
		ЯчейкаEXEL =  Лист.Cells(СтрокаEXEL, Колонка);	
		
		Если Колонка > 2 Тогда
			Value = ОбщийФункционалКлиентСервер.ПолучитьЧисло(ЯчейкаОтчета.Текст);
		Иначе	
			Value = ЯчейкаОтчета.Текст;
		КонецЕсли;
		ЯчейкаEXEL.Value = Value;
		
		Колонка = Колонка + 1;
	КонецЦикла;
	
	Строка = Строка + 1;	
КонецЦикла;

Попытка
	Книга.SaveAs(ПолноеИмяФайла); //сохранения файла
Исключение
	Сообщить("Нет доступа к файлу " + ПолноеИмяФайла);	
КонецПопытки;
Книга.Close(); //закрытие книги
Excel.Quit(); //закрытие COM

Форма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВEXELДействие_НеИспользуется(ПолноеИмяФайла)
ПолноеИмяФайла = ВыборФайла();
Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда Возврат; КонецЕсли;

ТекстСообщения = "Формирование файла EXEL
			|
			|ПОДОЖДИТЕ ...";	
ПараметрыФормы = Новый Структура("ТекстСообщения", ТекстСообщения);
Форма = ОткрытьФорму("ОбщаяФорма.СообщениеОперация", ПараметрыФормы,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
ТабДок = ОтчетВТревелЛайнНаСервере(); 	

Ячейка = ТабДок.Область(1,1,1,1);
Если НЕ ЗначениеЗаполнено(Ячейка.Текст) Тогда Возврат; КонецЕсли;

Excel = Новый COMОбъект("Excel.Application"); //подключение к Excel
Книга = Excel.WorkBooks.Add();  //добавление книги
Лист = Книга.Worksheets.add(); //добавление листа
Лист.Name = "Отчет"; //имя листа (без проблелов)
Excel.displayAlerts = 0; //отключить модальное окно Excel на перезапись файла

Excel.Visible = Ложь;

ВсегоСтрок = ТабДок.ВысотаТаблицы;
ВсегоКолонок = ТабДок.ШиринаТаблицы;

НачальнаяСтрока = 4;

Колонка = 1;
Пока Колонка <= ВсегоКолонок Цикл 		
	ЯчейкаОтчета = ТабДок.Область(1, Колонка, 1, Колонка);
	
	СтрокаEXEL = НачальнаяСтрока;
	ЯчейкаEXEL =  Лист.Cells(СтрокаEXEL, Колонка);	
	
	Value = ЯчейкаОтчета.Текст;
	Value = СтрЗаменить(Value, Символы.ПС, " ");
	
	ЯчейкаEXEL.Value = Value;
	
	Колонка = Колонка + 1;
КонецЦикла;

Строка = 2;
Пока Строка < ВсегоСтрок Цикл
	Колонка = 1;
	Пока Колонка <= ВсегоКолонок Цикл 		
		ЯчейкаОтчета = ТабДок.Область(Строка, Колонка, Строка, Колонка);
		
		СтрокаEXEL = НачальнаяСтрока + Строка - 1;
		ЯчейкаEXEL =  Лист.Cells(СтрокаEXEL, Колонка);	
		
		Если Колонка > 2 Тогда
			Value = ОбщийФункционалКлиентСервер.ПолучитьЧисло(ЯчейкаОтчета.Текст);
		Иначе	
			Value = ЯчейкаОтчета.Текст;
		КонецЕсли;
		ЯчейкаEXEL.Value = Value;
		
		Колонка = Колонка + 1;
	КонецЦикла;
	
	Строка = Строка + 1;	
КонецЦикла;

Попытка
	Книга.SaveAs(ПолноеИмяФайла); //сохранения файла
Исключение
	Сообщить("Нет доступа к файлу " + ПолноеИмяФайла);	
КонецПопытки;
Книга.Close(); //закрытие книги
Excel.Quit(); //закрытие COM

Форма.Закрыть();
КонецПроцедуры
/////
