//
&НаКлиенте
Процедура ПриОткрытии___()
	//
	//Выбор = Ложь;
	//ТаблицаОМД.Колонки.Добавить("Значение");
	//
	//ДобавитьОМД(Метаданные.Справочники, 0);
	//ДобавитьОМД(Метаданные.Документы, 1);
	//ДобавитьОМД(Метаданные.ПланыОбмена, 2);
	//ДобавитьОМД(Метаданные.ПланыВидовХарактеристик, 3);
	//ДобавитьОМД(Метаданные.ПланыСчетов, 4);
	//ДобавитьОМД(Метаданные.ПланыВидовРасчета, 5);
	//ДобавитьОМД(Метаданные.РегистрыРасчета, 6);
	//ДобавитьОМД(Метаданные.РегистрыСведений, 7);
	//ДобавитьОМД(Метаданные.РегистрыНакопления, 8);
	//ДобавитьОМД(Метаданные.РегистрыБухгалтерии, 9);
	//ДобавитьОМД(Метаданные.БизнесПроцессы, 10);
	//ДобавитьОМД(Метаданные.Задачи, 11);
	//
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Выбор = Ложь;
	
	Если Параметры.Свойство("СписокОМД") Тогда
		Параметры.Свойство("СписокОМД", СписокОМД); 	
	КонецЕсли;
	
	ДобавитьОМД(Метаданные.Справочники, БиблиотекаКартинок.Справочник);
	ДобавитьОМД(Метаданные.Документы, БиблиотекаКартинок.Документ);
	ДобавитьОМД(Метаданные.ПланыОбмена, БиблиотекаКартинок.ПланОбмена);
	ДобавитьОМД(Метаданные.ПланыВидовХарактеристик, БиблиотекаКартинок.ПланВидовХарактеристик);
	ДобавитьОМД(Метаданные.ПланыСчетов, БиблиотекаКартинок.ПланСчетов);
	ДобавитьОМД(Метаданные.ПланыВидовРасчета, БиблиотекаКартинок.ПланВидовРасчета);
	ДобавитьОМД(Метаданные.РегистрыРасчета, БиблиотекаКартинок.РегистрРасчета);
	ДобавитьОМД(Метаданные.РегистрыСведений, БиблиотекаКартинок.РегистрСведений);
	ДобавитьОМД(Метаданные.РегистрыНакопления, БиблиотекаКартинок.РегистрНакопления);
	ДобавитьОМД(Метаданные.РегистрыБухгалтерии, БиблиотекаКартинок.РегистрБухгалтерии);
	ДобавитьОМД(Метаданные.БизнесПроцессы, БиблиотекаКартинок.БизнесПроцесс);
	ДобавитьОМД(Метаданные.Задачи, БиблиотекаКартинок.Задача);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОМД__(ОбъектыМетаданных, ТипКартинки) 
	//
	//Для Каждого ОМД Из ОбъектыМетаданных Цикл
	//	
	//	Если ОМД.ПолнотекстовыйПоиск = Метаданные.СвойстваОбъектов.ИспользованиеПолнотекстовогоПоиска.Использовать Тогда
	//		НоваяСтрока = ТаблицаОМД.Добавить();
	//		НоваяСтрока.Значение = ОМД;
	//		Если СписокОМД.НайтиПоЗначению(ОМД) = Неопределено Тогда
	//			НоваяСтрока.Отбор = Ложь;
	//		Иначе
	//			НоваяСтрока.Отбор = Истина;
	//		КонецЕсли;	
	//		НоваяСтрока.НазваниеОМД = Строка(ОМД);
	//		НоваяСтрока.ТипКартинки = ТипКартинки;
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//
КонецПроцедуры

&НаСервере
Процедура ДобавитьОМД(ОбъектыМетаданных, ТипКартинки) 
	
	Для Каждого ОМД Из ОбъектыМетаданных Цикл
		
		Если ОМД.ПолнотекстовыйПоиск = Метаданные.СвойстваОбъектов.ИспользованиеПолнотекстовогоПоиска.Использовать Тогда
			
			НоваяСтрока = ТаблицаОМД.Добавить();
			
			НоваяСтрока.Значение = ОМД.ПолноеИмя();
			Если СписокОМД.НайтиПоЗначению(НоваяСтрока.Значение) = Неопределено Тогда
				НоваяСтрока.Отбор = Ложь;
			Иначе
				НоваяСтрока.Отбор = Истина;
			КонецЕсли;	
			НоваяСтрока.НазваниеОМД = Строка(ОМД);
			
			НоваяСтрока.ТипКартинки = ТипКартинки;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ТаблицаОМДПриВыводеСтроки___(Элемент, ОформлениеСтроки, ДанныеСтроки)
	//ОформлениеСтроки.Ячейки.КолонкаКартинки.ИндексКартинки = ДанныеСтроки.ТипКартинки;
	//ОформлениеСтроки.Ячейки.КолонкаКартинки.ОтображатьКартинку = Истина;
КонецПроцедуры
//

&НаКлиенте
Процедура ОК(Команда)
	ОК = Истина;
	Результат = Новый Структура("ОК, ТаблицаОМД", ОК, ТаблицаОМД);  
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаКоманда(Команда)
	ОК = Ложь;
	Результат = Новый Структура("ОК, ТаблицаОМД", ОК, Неопределено);  
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОМДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОМДПередУдалением(Элемент, Отказ)
Отказ = Истина;
КонецПроцедуры




