

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("Клиент", Клиент);
Параметры.Свойство("Дата_С", Дата_С);
Параметры.Свойство("Дата_По", Дата_По);
Параметры.Свойство("КатегорияНомера", КатегорияНомера);

Параметры.Свойство("ИсходящийНомер", ИсходящийНомер);
Параметры.Свойство("ИсходящяяДата", КатегорияНомера);

Параметры.Свойство("Отель", Отель);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСправки(Команда)
Если ЗначениеЗаполнено(ИсходящийНомер) И ЗначениеЗаполнено(ИсходящийНомер) Тогда	
	СправкаОПроживании();
Иначе 
	ПоказатьПредупреждение(, "Исходящие данные - пусто");
КонецЕсли;
КонецПроцедуры

//
&НаКлиенте
Процедура СправкаОПроживании()
//Если ЭтаФорма.Модифицированность Тогда	
//	Если ЭтотОбъектЗаписатьНаКлиенте() Тогда Возврат; КонецЕсли;
//КонецЕсли;

МойДокументВДвоичныхДанных = ПолучитьМакетСправкаОПроживанииВДвоичныхДанных();

ИмяВрем = ПолучитьИмяВременногоФайла(".doc");
МойДокументВДвоичныхДанных.Записать(ИмяВрем);

//Если НастройкиСервер.ЭтоРеноме() Тогда
	ПечатьСправкаОПроживанииДействие(ИмяВрем);
//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСправкаОПроживанииДействие(ИмяВрем)
Word = Новый COMОбъект("Word.Application");
Документ = Word.Documents.Add(ИмяВрем);
 
ОбщСт=0;

сч=1;

СтруктураРеквизитов = ПолучитьСтруктуруРеквизитовСправкаОПроживанииНаСервере();

Для Каждого Элемент из СтруктураРеквизитов Цикл
	Замена = Документ.Content.Find;
	Замена.Execute("<" + Элемент.Ключ + ">", Ложь, Истина, Ложь, , , Истина, , Ложь, Элемент.Значение);
КонецЦикла;
	
Word.Visible = Истина;
Word.Activate();
Документ.ActiveWindow.Caption = "Договор";

//	//Получим путь во временной директории для сохранения туда файла
//	ИмяВрем = ПолучитьИмяВременногоФайла(".doc");
//	//Сохраним туда файл
//	Документ.SaveAs(ИмяВрем);
//	
//	//Закроем Word
//	Word.Application.Quit();
//	//УдалитьФайлы(ИмяВрем);
//			
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетСправкаОПроживанииВДвоичныхДанных()
	Макет = ПечатьСервер.ПолучитьМакетДокументаЗаявкаНаБронирование("СправкаОПроживании");
	
	ИмяВрем = ПолучитьИмяВременногоФайла(".doc");
	Макет.Записать(ИмяВрем);
	
	МойДокументВДвоичныхДанных = Новый ДвоичныеДанные(ИмяВрем);
	Возврат МойДокументВДвоичныхДанных;			
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруРеквизитовСправкаОПроживанииНаСервере()
Ответ = Новый Структура;

Ответ.Вставить("ИсходящийНомер", ИсходящийНомер);
Ответ.Вставить("ИсходящяяДата", Формат(Дата_По, "ДФ=dd.MM.yyyy"));

Ответ.Вставить("ФИО", Клиент.Наименование);
Ответ.Вставить("Дата_С", Формат(Дата_С, "ДФ=dd.MM.yyyy"));
Ответ.Вставить("Дата_По", Формат(Дата_По, "ДФ=dd.MM.yyyy"));
//Ответ.Вставить("Категория", КатегорияНомера.Наименование);
//Если КатегорияНомера.ТолькоОдноместный Тогда
//	Ответ.Вставить("ТипНомераМест", "одноместный");
//Иначе
//	Ответ.Вставить("ТипНомераМест", "двухместный");
//КонецЕсли;	
Ответ.Вставить("Отель", Отель);

Возврат Ответ;
КонецФункции	
//

&НаКлиенте
Процедура Выход(Команда)
Закрыть();
КонецПроцедуры
//
