
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ФизЛицоСчет = Истина;
ЮрЛицоСчет = Истина;
ЮрЛицоГрупповойСчет = Истина;
Турагентство = Истина;

ФизЛицоПредоплата = Ложь;
ЮрЛицоПредоплата = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
ДатыПроверка(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
ДатыПроверка(Истина);
КонецПроцедуры

&НаКлиенте
Функция ДатыПроверка(Проверка)
Если НЕ ЗначениеЗаполнено(ДатаС) ИЛИ НЕ ЗначениеЗаполнено(ДатаПо) Тогда
	
	Возврат Истина;
КонецЕсли;	
	
Если НачалоМесяца(ДатаС) <> НачалоМесяца(ДатаПо) Тогда
	ПоказатьПредупреждение(, "Месяц Дата С <> Месяц Дата По");
	
	Возврат Истина;
КонецЕсли;	

Если Проверка Тогда
	Если НачалоМесяца(ДатаПо) < '20250301' Тогда
		ПоказатьПредупреждение(, "ВНИМАНИЕ !!! Месяц Дата По < 03.2025");
		
		Возврат Ложь;
	КонецЕсли;	
КонецЕсли;	
	
Возврат Ложь;
КонецФункции

&НаКлиенте
Асинх Процедура ВыгрузитьДанные(Команда)
Если НЕ ЗначениеЗаполнено(ДатаС) ИЛИ НЕ ЗначениеЗаполнено(ДатаПо) Тогда
	ПоказатьПредупреждение(, "Дата С или Дата По - пусто");
	
	Возврат;
КонецЕсли;	
	
Если ДатыПроверка(Ложь) Тогда Возврат; КонецЕсли;

Если НачалоМесяца(ДатаПо) < '20250301' Тогда
	Ответ = Ждать ВопросАсинх("ВНИМАНИЕ !!! Месяц Дата По < 03.2025
						|
						|ПРОДОЛЖИТЬ ?"
		, РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.Отмена); 
		
	Если Ответ = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;		
КонецЕсли;

ТипыСчетов = Новый Структура("ФизЛицоСчет, ЮрЛицоСчет, ЮрЛицоГрупповойСчет, Турагентство"	
	+ ", ФизЛицоКоворкингСчет, ЮрЛицоКоворкингСчет" 
	+ ", ФизЛицоПредоплата, ЮрЛицоПредоплата" 
	, ФизЛицоСчет, ЮрЛицоСчет, ЮрЛицоГрупповойСчет, Турагентство 
	, ФизЛицоКоворкингСчет, ЮрЛицоКоворкингСчет 
	, ФизЛицоПредоплата, ЮрЛицоПредоплата
	);	
				
ОбменБухгалтерияНДС.ЗаписатьФайлСообщение(ДатаС, ДатаПо, ТипыСчетов);
КонецПроцедуры



