
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = Истина;	
	
Параметры.Свойство("СписокКонтрагентов", СписокКонтрагентов);
Если СписокКонтрагентов.Количество() > 0 Тогда ЕстьСписокКонтрагентов = Истина; КонецЕсли;

Параметры.Свойство("ОтмененныйДокументДолг", ОтмененныйДокументДолг);
Если НЕ ЗначениеЗаполнено(ОтмененныйДокументДолг) Тогда 
	ВсеЗаписи = Истина;
	Элементы.ВсеЗаписи.ТолькоПросмотр = Истина;
КонецЕсли;	

УстановитьВидимостьОтКогоНаименованиеЮрЛица();

Параметры.Свойство("СуммаКОплате", СуммаКОплате);

УстановитьПараметрыОтбора();
КонецПроцедуры

&НаСервере                       
Процедура УстановитьПараметрыОтбора()
Список.Параметры.УстановитьЗначениеПараметра("ЕстьСписокКонтрагентов", ЕстьСписокКонтрагентов);
Список.Параметры.УстановитьЗначениеПараметра("СписокКонтрагентов", СписокКонтрагентов);
Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаписи", ВсеЗаписи);
Список.Параметры.УстановитьЗначениеПараметра("ОтмененныйДокументДолг", ОтмененныйДокументДолг);
КонецПроцедуры

&НаСервере 
Процедура УстановитьВидимостьОтКогоНаименованиеЮрЛица()
Если ВсеЗаписи Тогда
	Элементы.ОтКогоНаименованиеЮрЛица.Видимость = Истина;
Иначе
	Видимость_П = Ложь;
	Для Каждого Строка Из СписокКонтрагентов Цикл
		Если КлиентыСервер.ЭтоЮрЛицо(Строка.Значение) Тогда
			Видимость_П = Истина;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Элементы.ОтКогоНаименованиеЮрЛица.Видимость = Видимость_П;
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВсеЗаписиПриИзменении(Элемент)
УстановитьВидимостьОтКогоНаименованиеЮрЛица();
	
УстановитьПараметрыОтбора();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Результат = ВыбраннаяСтрока;	

Закрыть(Результат);
КонецПроцедуры

