
&НаКлиенте
Процедура КнопкаВыполнитьНажатие__(Кнопка)
	//ТекстЗапроса="SELECT * FROM  hostelarh WHERE stolen <>  '' and TimeUnix>='"+Формат(ПериодС, "ДФ=yyyy-MM-dd")+"' and TimeUnix<='"+Формат(ПериодПо, "ДФ=yyyy-MM-dd")+"'";
	//ТЗ=ЗапросMySQL(ТекстЗапроса);
	//Макет=ПолучитьМакет("Макет");
	//Обл=Макет.ПолучитьОбласть("Шапка");
	//ЭлементыФормы.ПолеОтчета.Очистить();
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//Полотенца=Новый Структура("ПБ,ПР,ПН,Х,С",0,0,0,0,0);
	//Для Каждого Стр из ТЗ Цикл 
	//	Обл=Макет.ПолучитьОбласть("Строка");
	//	СтрНомер=Число(Стр.Nomer);
	//	НазвНомер="Номер "+?(СтрНомер>=10,Строка(СтрНомер),"0"+Строка(СтрНомер));
	//	СпрНомер=Справочники.НомернойФонд.НайтиПоНаименованию(НазвНомер);
	//	Если СпрНомер.Пустая() тогда
	//		Продолжить;
	//	конецесли;
	//	СтрВремя=Стр.TimeUnix;
	//	Если СтрВремя=Null тогда
	//		СтрВремя=ПолучитьДату(Стр.Time);
	//	иначе
	//		//	Сообщить("Тест");
	//	конецесли;
	//	Тек=ПолучитьПолотенца(Стр.stolen);
	//	Полотенца.ПБ=Полотенца.ПБ+Тек.ПБ;
	//	Полотенца.ПР=Полотенца.ПР+Тек.ПР;
	//	Полотенца.ПН=Полотенца.ПН+Тек.ПН;
	//	Полотенца.Х=Полотенца.Х+Тек.Х;
	//	Полотенца.С=Полотенца.ПБ+Тек.С;
	//	
	//	Обл.Параметры.ДТ=СтрВремя;
	//	Обл.Параметры.Номер=СпрНомер;
	//	Обл.Параметры.Заполнить(Тек);
	//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	//КонецЦикла;	
	//Обл=макет.ПолучитьОбласть("Итог");
	//Обл.Параметры.Заполнить(Полотенца);
	//	ЭлементыФормы.ПолеОтчета.Вывести(Обл);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманда(Команда)
	ВыполнитьКомандаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандаНаСервере()
	ТекстЗапроса="SELECT * FROM  hostelarh WHERE stolen <>  '' and TimeUnix>='"+Формат(ПериодС, "ДФ=yyyy-MM-dd")+"' and TimeUnix<='"+Формат(ПериодПо, "ДФ=yyyy-MM-dd")+"'";
	ТЗ=ЗапросMySQL(ТекстЗапроса);
	
	//Макет=ПолучитьМакет("Макет");
	Макет=Обработки.ОтчетПоПропавшимПолотенцам.ПолучитьМакет("Макет");
	
	Обл=Макет.ПолучитьОбласть("Шапка");
	
	//ЭлементыФормы.ПолеОтчета.Очистить();
	ПолеОтчета.Очистить();
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
	
	Полотенца=Новый Структура("ПБ,ПР,ПН,Х,С",0,0,0,0,0);
	Для Каждого Стр из ТЗ Цикл 
		Обл=Макет.ПолучитьОбласть("Строка");
		СтрНомер=Число(Стр.Nomer);
		НазвНомер="Номер "+?(СтрНомер>=10,Строка(СтрНомер),"0"+Строка(СтрНомер));
		СпрНомер=Справочники.НомернойФонд.НайтиПоНаименованию(НазвНомер);
		Если СпрНомер.Пустая() тогда
			Продолжить;
		конецесли;
		СтрВремя=Стр.TimeUnix;
		Если СтрВремя=Null тогда
			СтрВремя=ПолучитьДату(Стр.Time);
		иначе
			//	Сообщить("Тест");
		конецесли;
		Тек=ПолучитьПолотенца(Стр.stolen);
		Полотенца.ПБ=Полотенца.ПБ+Тек.ПБ;
		Полотенца.ПР=Полотенца.ПР+Тек.ПР;
		Полотенца.ПН=Полотенца.ПН+Тек.ПН;
		Полотенца.Х=Полотенца.Х+Тек.Х;
		Полотенца.С=Полотенца.ПБ+Тек.С;
		
		Обл.Параметры.ДТ=СтрВремя;
		Обл.Параметры.Номер=СпрНомер;
		Обл.Параметры.Заполнить(Тек);
		
		//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
		ПолеОтчета.Вывести(Обл);
	КонецЦикла;	
	Обл=макет.ПолучитьОбласть("Итог");
	Обл.Параметры.Заполнить(Полотенца);
	
	//ЭлементыФормы.ПолеОтчета.Вывести(Обл);
	ПолеОтчета.Вывести(Обл);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДату(Стр)
	ВремСтр=Стр;
	//"01.31.13 08:46:59";
	гСек=Число(Прав(ВремСтр,2));
	ВремСтр=Лев(ВремСтр,СтрДлина(ВремСтр)-3);
	гМин=Число(Прав(ВремСтр,2));
	ВремСтр=Лев(ВремСтр,СтрДлина(ВремСтр)-3);
	гЧас=Число(Прав(ВремСтр,2));
	ВремСтр=Лев(ВремСтр,СтрДлина(ВремСтр)-3);
	гГод=2000+Число(Прав(ВремСтр,2));
	ВремСтр=Лев(ВремСтр,СтрДлина(ВремСтр)-3);
	гДень=Число(Прав(ВремСтр,2));
	ВремСтр=Лев(ВремСтр,СтрДлина(ВремСтр)-3);
	гМес=Число(Прав(ВремСтр,2));
	
	Возврат Дата(гГод,гМес,гДень,гЧас,гМин,гСек);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПолотенца(Стр)
	сч=1;
	Полотенца=Новый Структура("ПБ,ПР,ПН,Х,С",0,0,0,0,0);
	//Для  по сч=СтрДлина(Стр)-1 цикл
	Пока сч<=СтрДлина(Стр) цикл
		Попытка
			Ном=Число(Сред(Стр,Сч,1));
		исключение
			Прервать;
		КонецПопытки;
		Если Ном>0 тогда
			Если сч=1 тогда
				Полотенца.ПБ=Ном;
			иначеесли сч=2 тогда
				Полотенца.ПР=Ном;
			иначеесли сч=3 тогда
				Полотенца.ПН=Ном;
			иначеесли сч=4 тогда
				Полотенца.Х=Ном;
			иначеесли сч=5 тогда
				Полотенца.С=Ном;
				
			конецесли;
			
		конецесли;
		сч=сч+1;
	конеццикла;
	Возврат Полотенца;	
КонецФункции

//
&НаСервереБезКонтекста
Функция ЗапросMySQL (ТекстЗапроса)
	//Соединение = Новый COMОбъект("ADODB.Connection");
	//Соединение.ConnectionString ="DRIVER={MySQL ODBC 5.2a Driver};OPTION=3;DATABASE=artemis;PWD=wertyu;PORT=3306;SERVER=127.0.0.1;UID=artemis;";
	//// инициализируем набор записей и комманду
	//НаборЗаписей = Новый COMОбъект("ADODB.Recordset");
	//Команда = Новый COMОбъект("ADODB.Command");
	//Попытка
	//	Соединение.Open();
	//Исключение
	//	Сообщить(ОписаниеОшибки());
	//КонецПопытки;
	//Table=Соединение.execute(ТекстЗапроса);	  
	//ТЗ=СКЛ_ТЗ(Table);
	//Возврат ТЗ;
	
	
	Table= Неопределено; // Соединение.execute(ТекстЗапроса);	  
	ТЗ=СКЛ_ТЗ(Table);
	Возврат ТЗ;
	
КонецФункции

&НаСервереБезКонтекста
Функция СКЛ_ТЗ(Результ) 
	ТЗ=Новый ТаблицаЗначений;
	Если Результ<>неопределено тогда
		
		
		Для сч=0 По Результ.Fields.Count-1 Цикл
			ТЗ.Колонки.Добавить(Результ.Fields(сч).Name);	
		КонецЦикла; 
		Пока Результ.EOF()=0 Цикл
			Нов=ТЗ.Добавить();
			Для сч=0 По Результ.Fields.Count-1 Цикл
				Нов[Результ.Fields(сч).Name]=Результ.Fields(сч).Value;				
			КонецЦикла; 
			
			Результ.MoveNext();			
		конеццикла;
		
	конецесли;
	Возврат ТЗ;
КонецФункции
//