
////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.Тест.Видимость = НастройкиСервер.ТекущийПользовательКодРавноАдминистратор();	
	
РаботаСИнтерфейсомСервер_УстановитьТолькоПросмотр = РаботаСИнтерфейсомСервер.УстановитьТолькоПросмотр(ЭтаФорма);
Если РаботаСИнтерфейсомСервер_УстановитьТолькоПросмотр Тогда 
	Элементы.Закрыто.ТолькоПросмотр = Истина;
КонецЕсли;

Если НЕ НастройкиСервер.ЭтоАдминистратор() Тогда
	Элементы.Закрыто.ТолькоПросмотр = Истина;
КонецЕсли;

Если РаботаСИнтерфейсомСервер_УстановитьТолькоПросмотр 
ИЛИ Объект.Закрыто
Тогда ЭтаФорма.ТолькоПросмотр = Истина; КонецЕсли;

ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Объект.Контрагент);

ЭтаФормаНастройка();
КонецПроцедуры
 
&НаСервере
Процедура ЭтаФормаНастройка()
//Элементы.ФормаНаличные.Доступность = НЕ ЮрЛицо;	
//Элементы.ФормаБезнал.Доступность = ЮрЛицо;

ТипГрупповогоСчета = Объект.ТипГрупповогоСчета;

Если ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ГруппаЗаявок Тогда 
	Элементы.ИтогоКОплате.Видимость = Истина;
	
	Элементы.ГруппаКомиссияДанные.Видимость = Ложь;
	
	Элементы.ГруппаНамДолжны.Видимость = Истина;
	Элементы.ИтогоДолгКЗачету.Видимость = Ложь;
	
	Элементы.ГруппаМыДолжны.Видимость = Ложь;
	Элементы.ИтогоКомиссияКЗачету.Видимость = Ложь;
	          
	Элементы.СтраницаДокументыДолги.Видимость = Истина;
	Элементы.СтраницаКомииссия.Видимость = Ложь;
	
	Элементы.СтраницаДокументыОплаты.Видимость = Истина;
	Элементы.ДокументыОплаты.КоманднаяПанель.ПодчиненныеЭлементы.ДокументыОплатыДобавитьОплатуЗачет.Видимость = Ложь;
	Элементы.ДокументыОплаты.КоманднаяПанель.ПодчиненныеЭлементы.ДокументыОплатыДобавитьСписаниеДолги.Видимость = Истина;

	Элементы.СтраницаРаспределениеОплат.Видимость = Истина;
	
	Элементы.СтраницаПлатежиКонтрагенту.Видимость = Ложь;
			
ИначеЕсли ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ТурагентствоВзаимозачет Тогда 
	Элементы.ИтогоКОплате.Видимость = Истина;
	
	Элементы.ГруппаКомиссияДанные.Видимость = Истина;
	
	Элементы.СуммаОстатокВзаимозачета.Видимость = Истина;
	 
	Элементы.ГруппаНамДолжны.Видимость = Истина;
	Элементы.ИтогоДолгКЗачету.Видимость = Истина;
	
	Элементы.ГруппаМыДолжны.Видимость = Истина;
	Элементы.ИтогоКомиссияКЗачету.Видимость = Истина;

	Элементы.СтраницаДокументыДолги.Видимость = Истина;
	Элементы.СтраницаКомииссия.Видимость = Истина;
	
	Элементы.СтраницаДокументыОплаты.Видимость = Истина;
	Элементы.ДокументыОплаты.КоманднаяПанель.ПодчиненныеЭлементы.ДокументыОплатыДобавитьОплатуЗачет.Видимость = Истина;
	Элементы.ДокументыОплаты.КоманднаяПанель.ПодчиненныеЭлементы.ДокументыОплатыДобавитьСписаниеДолги.Видимость = Истина;

	Элементы.СтраницаРаспределениеОплат.Видимость = Истина;
	
	Элементы.СтраницаПлатежиКонтрагенту.Видимость = Истина;
	
ИначеЕсли ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ТурагентствоДолги Тогда 
	Элементы.ИтогоКОплате.Видимость = Ложь;
	
	Элементы.ГруппаКомиссияДанные.Видимость = Истина;
	Элементы.СуммаОстатокВзаимозачета.Видимость = Истина;
	 
	Элементы.ГруппаНамДолжны.Видимость = Истина;
	Элементы.ИтогоДолгКЗачету.Видимость = Ложь;
	
	Элементы.ГруппаМыДолжны.Видимость = Истина;
	Элементы.ИтогоКомиссияКЗачету.Видимость = Ложь;
	          
	Элементы.СтраницаДокументыДолги.Видимость = Истина;
	Элементы.СтраницаКомииссия.Видимость = Истина;
	
	Элементы.СтраницаДокументыОплаты.Видимость = Истина;
	Элементы.ДокументыОплаты.КоманднаяПанель.ПодчиненныеЭлементы.ДокументыОплатыДобавитьОплатуЗачет.Видимость = Ложь;
	Элементы.ДокументыОплаты.КоманднаяПанель.ПодчиненныеЭлементы.ДокументыОплатыДобавитьСписаниеДолги.Видимость = Истина;
	
	Элементы.СтраницаПлатежиКонтрагенту.Видимость = Истина;
	
	Элементы.СтраницаРаспределениеОплат.Видимость = Истина;
Иначе
	Элементы.ИтогоКОплате.Видимость = Ложь;
	
	Элементы.ГруппаКомиссияДанные.Видимость = Ложь;
	 
	Элементы.ГруппаНамДолжны.Видимость = Ложь;
	
	Элементы.ГруппаМыДолжны.Видимость = Ложь;
	          
	Элементы.СтраницаДокументыДолги.Видимость = Ложь;
	Элементы.СтраницаКомииссия.Видимость = Ложь;
	
	Элементы.СтраницаДокументыОплаты.Видимость = Ложь;
	
	Элементы.СтраницаПлатежиКонтрагенту.Видимость = Ложь;
	
	Элементы.СтраницаРаспределениеОплат.Видимость = Ложь;
КонецЕсли;
	
Конецпроцедуры	

&НаСервере
Процедура ФормаРеквизитыТолькоПросмотр()
ТолькоПросмотр_П = НЕ ((Объект.ДокументыДолги.Количество() = 0) 
					И (Объект.КомиссияДокументыДолги.Количество() = 0)) ;
	
Элементы.ТипГрупповогоСчета.ТолькоПросмотр = ТолькоПросмотр_П;
Элементы.Контрагент.ТолькоПросмотр = ТолькоПросмотр_П;	
	
ЕстьПрочиеОплаты = ЕстьПрочиеОплатыВзаимозачет(); 
Элементы.СуммаКомиссииКонтрагента.ТолькоПросмотр = ЕстьПрочиеОплаты; 
Элементы.СуммаОстатокВзаимозачета.ТолькоПросмотр = ЕстьПрочиеОплаты; 
КонецПроцедуры	

&НаСервере
Функция ЕстьПрочиеОплатыВзаимозачет()
ЕстьПрочиеОплаты = Ложь;
Для Каждого Строка Из Объект.ДокументыОплаты Цикл
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда 
		Если Строка.ДокументОплаты.ВидОперации = Справочники.ВидыОпераций.Взаимозачет Тогда 
			ЕстьПрочиеОплаты = Истина;
			Прервать;
		КонецЕсли;
	КонецЕсли;
КонецЦикла;

Возврат ЕстьПрочиеОплаты;                
КонецФункции
////

&НаКлиенте
Процедура ЗакрытоПриИзменении(Элемент)
Если Закрыто Тогда 
	ДанныеОбъект = Объект;		
	ГрупповойСчетКЗакрытию = ЗакрытиеСервер.ГрупповойСчетКЗакрытию(ДанныеОбъект);
	
	Если НЕ ГрупповойСчетКЗакрытию.ГрупповойСчетКЗакрытию Тогда
		Оповещение = Новый ОписаниеОповещения("ЗавершениеВопроса_ПодтвердитеГрупповогоСчета", ЭтаФорма);
		ТекстВопроса = "ВНИМАНИЕ ! ";
		Если ГрупповойСчетКЗакрытию.ДолгКОплате Тогда
			ТекстВопроса = ТекстВопроса + "Долг к оплате <> 0.";
		КонецЕсли;
		
		Если ГрупповойСчетКЗакрытию.КомиссияПлатежиКОплате Тогда
			Если СтрНайти(ТекстВопроса, "Долг") <> 0 Тогда
				ТекстВопроса = ТекстВопроса + Символы.ПС;
			КонецЕсли;
			ТекстВопроса = ТекстВопроса + "Комиссия платежи к оплате к оплате <> 0.";
		КонецЕсли;
		
		ТекстВопроса = ТекстВопроса + Символы.ПС + Символы.ПС
			+ "ПОДТВЕРДИТЕ ЗАКРЫТИЕ ЗАЯВКИ ...";
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
КонецЕсли;

ОткрытьЗакрытьГрупповойСчет();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопроса_ПодтвердитеГрупповогоСчета(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда 
	Закрыто = Не Закрыто;
	
	Возврат; 
КонецЕсли;
	
ОткрытьЗакрытьГрупповойСчет();	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗакрытьГрупповойСчет() 
Объект.Закрыто = Закрыто;

Если Объект.Закрыто Тогда
	Объект.ДатаЗакрытия = ТекущаяДата();	
Иначе	
	Объект.ДатаЗакрытия = Неопределено;	
КонецЕсли;

ЭтаФорма.Записать(Новый Структура(РежимЗаписиДокумента.Проведение));
ЭтаФорма.ТолькоПросмотр = Закрыто;
КонецПроцедуры


//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
ОбновитьДанные();

ЗагрузкаДеревоСчетДетально();

ФормаРеквизитыТолькоПросмотр();

ВывестиОшибки(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ВывестиОшибки(ТекущийОбъект)
Ответ = ДокументыСервер.ПроверитьГрупповойСчет(ТекущийОбъект);

ТекстОшибки = Ответ.ТекстОшибки;
ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки, Ответ.ТекстПредупреждения, Символы.ПС); 

Если ТекстОшибки = "" Тогда
	Элементы.ТекстОшибки.Видимость = Ложь;
Иначе
	Элементы.ТекстОшибки.Видимость = Истина;
	ЧислоСтрок = СтрЧислоСтрок(ТекстОшибки);
	Элементы.ТекстОшибки.МаксимальнаяВысота = ЧислоСтрок + 1 ;
КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
ОбновитьДанные();

ЗагрузкаДеревоСчетДетально();

ФормаРеквизитыТолькоПросмотр();

ВывестиОшибки(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
ОбновитьДанныеКолонокДокументыДолги();
ОбновитьДанныеКолонокДокументыОплаты();
ОбновитьДанныеКолонокКомиссияДокументыДолги();
ОбновитьДанныеКолонокПлатежиКонтрагенту();

ОбновитьДанныеКолонокРаспределениеОплат();

ОбновитьДанныеШапки();

ОбновитьЗакрыто();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗакрыто()
Закрыто = Объект.Закрыто; 	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКолонокДокументыДолги()
ИтогоДокументыДолгиСуммаДолг = 0;
ИтогоДокументыДолгиСуммаОплачено = 0;

Если Объект.ДокументыДолги.Количество() = 0 Тогда Возврат; КонецЕсли; 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронированиеСчета.Ссылка КАК Ссылка,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД КАК СчетГУИД,
                      |	ЗаявкаНаБронированиеСчета.Контрагент КАК Контрагент,
                      |	ЗаявкаНаБронированиеСчета.Клиент КАК Клиент,
                      |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
                      |	ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета,
                      |	ЗаявкаНаБронированиеСчета.ТолькоПроживание КАК ТолькоПроживание,
                      |	ЗаявкаНаБронированиеСчета.ТолькоУслуги КАК ТолькоУслуги,
                      |	СУММА(ЕСТЬNULL(Долги.СуммаДолг, 0)) КАК СуммаДолг,
                      |	СУММА(ЕСТЬNULL(Оплаты.СуммаОплаты, 0)) КАК СуммаОплачено,
                      |	ЗаявкаНаБронированиеСчета.ДатаС КАК ДатаС,
                      |	ЗаявкаНаБронированиеСчета.ДатаПо КАК ДатаПо
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК Долги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = Долги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = Долги.СчетГУИД
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеРаспределениеОплатДолги.СуммаОплаты) КАК СуммаОплаты
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка,
                      |			ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД) КАК Оплаты
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = Оплаты.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = Оплаты.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД В(&СписокСчетГУИД)
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЗаявкаНаБронированиеСчета.Ссылка,
                      |	ЗаявкаНаБронированиеСчета.СчетГУИД,
                      |	ЗаявкаНаБронированиеСчета.Контрагент,
                      |	ЗаявкаНаБронированиеСчета.Клиент,
                      |	ЗаявкаНаБронированиеСчета.НомерСчета,
                      |	ЗаявкаНаБронированиеСчета.ДатаСчета,
                      |	ЗаявкаНаБронированиеСчета.ТолькоПроживание,
                      |	ЗаявкаНаБронированиеСчета.ТолькоУслуги,
                      |	ЗаявкаНаБронированиеСчета.ДатаС,
                      |	ЗаявкаНаБронированиеСчета.ДатаПо"
);

Запрос.УстановитьПараметр("СписокСчетГУИД", Объект.ДокументыДолги.Выгрузить().ВыгрузитьКолонку("СчетГУИД"));
ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Возврат; КонецЕсли; 

Для Каждого Строка Из Объект.ДокументыДолги Цикл
	НайденнаяСтрока = ТЗ.Найти(Строка.СчетГУИД, "СчетГУИД");
    Если НайденнаяСтрока <> Неопределено  Тогда
        Строка.Контрагент = НайденнаяСтрока.Контрагент;
        Строка.Клиент = НайденнаяСтрока.Клиент;
        Строка.НомерСчета = НайденнаяСтрока.НомерСчета;
        Строка.ДатаСчета = НайденнаяСтрока.ДатаСчета;
        Строка.СуммаДолг = НайденнаяСтрока.СуммаДолг;
        Строка.СуммаОплачено = НайденнаяСтрока.СуммаОплачено;
		
        Строка.СчетДата_С = НайденнаяСтрока.ДатаС;
        Строка.СчетДата_По = НайденнаяСтрока.ДатаПо;
		
		Строка.ТолькоПроживание = НайденнаяСтрока.ТолькоПроживание;
		Строка.ТолькоУслуги = НайденнаяСтрока.ТолькоУслуги;
    КонецЕсли;
	
	ИтогоДокументыДолгиСуммаДолг = ИтогоДокументыДолгиСуммаДолг + Строка.СуммаДолг;
	ИтогоДокументыДолгиСуммаОплачено = ИтогоДокументыДолгиСуммаОплачено + Строка.СуммаОплачено;
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКолонокКомиссияДокументыДолги()
ИтогоКомиссияСуммаДолг = 0; ИтогоКомиссияСуммаПроживание = 0; ИтогоКомиссияСуммаОплачено = 0;
ИтогоКомиссияСуммаКомиссииРасчет = 0; ИтогоКомиссияСуммаКомиссииКонтрагент = 0; 

Если Объект.КомиссияДокументыДолги.Количество() = 0 Тогда Возврат; КонецЕсли; 

Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СуммаДолги.СуммаДолг, 0) КАК СуммаДолг,
	|	ЕСТЬNULL(СуммаДолги.СуммаОплачено, 0) КАК СуммаОплачено,
	|	ЕСТЬNULL(СуммаПроживание.Сумма, 0) КАК СуммаПроживание,
	|	ЕСТЬNULL(СуммаПроживание.СуммаБезСкидки, 0) КАК СуммаБезСкидки
	|ИЗ
	|	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
	|			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг) КАК СуммаДолг,
	|			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаОплачено) КАК СуммаОплачено
	|		ИЗ
	|			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка) КАК СуммаДолги
	|		ПО ЗаявкаНаБронирование.Ссылка = СуммаДолги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаявкаНаБронированиеПроживание.Ссылка КАК Ссылка,
	|			СУММА(ЗаявкаНаБронированиеПроживание.Сумма) КАК Сумма,
	|			СУММА(ЗаявкаНаБронированиеПроживание.СуммаБезСкидки) КАК СуммаБезСкидки
	|		ИЗ
	|			Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаявкаНаБронированиеПроживание.Ссылка) КАК СуммаПроживание
	|		ПО ЗаявкаНаБронирование.Ссылка = СуммаПроживание.Ссылка
	|ГДЕ
	|	ЗаявкаНаБронирование.Ссылка В(&МассивДокументДолг)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаБронирование.Ссылка,
	|	СуммаДолги.СуммаДолг,
	|	СуммаДолги.СуммаОплачено,
	|	СуммаПроживание.Сумма,
	|	СуммаПроживание.СуммаБезСкидки");

Запрос.УстановитьПараметр("МассивДокументДолг", Объект.КомиссияДокументыДолги.Выгрузить().ВыгрузитьКолонку("ДокументДолг"));
ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Возврат; КонецЕсли; 

Для Каждого Строка Из Объект.КомиссияДокументыДолги Цикл
	НайденнаяСтрока = ТЗ.Найти(Строка.ДокументДолг, "Ссылка");
    Если НайденнаяСтрока <> Неопределено  Тогда
        Строка.СуммаПроживание = НайденнаяСтрока.СуммаПроживание;
        Строка.СуммаДолг = НайденнаяСтрока.СуммаДолг;
        Строка.СуммаОплачено = НайденнаяСтрока.СуммаОплачено;
		
		ПроцентКомиссии = ДокументыСервер.ПроцентКомиссииКлиента(Строка.ДокументДолг.Бронирует, Строка.ДокументДолг.РезервС); //, Строка.ДокументДолг.В2В);
		Строка.ПроцентКомиссии = ПроцентКомиссии; 
		
		СуммаКомиссии = ДокументыСервер.СуммаКомиссии(Строка.ДокументДолг, НайденнаяСтрока.СуммаБезСкидки
			, Строка.ДокументДолг.Счета, Строка.ДокументДолг.СчетаДетальноДолги, Строка.ДокументДолг.ДопУслуги, ПроцентКомиссии);

		Строка.СуммаКомиссииРасчет = СуммаКомиссии; 
			
		ИтогоКомиссияСуммаДолг = ИтогоКомиссияСуммаДолг + Строка.СуммаДолг; 
		ИтогоКомиссияСуммаПроживание = ИтогоКомиссияСуммаПроживание + Строка.СуммаПроживание; 
		ИтогоКомиссияСуммаОплачено = ИтогоКомиссияСуммаОплачено + Строка.СуммаОплачено; 
		
		ИтогоКомиссияСуммаКомиссииРасчет = ИтогоКомиссияСуммаКомиссииРасчет + Строка.СуммаКомиссииРасчет; 
		
		Если Строка.СуммаКомиссииКонтрагент = 0 Тогда
			ИтогоКомиссияСуммаКомиссииКонтрагент = ИтогоКомиссияСуммаКомиссииКонтрагент + Строка.СуммаКомиссииРасчет;
		Иначе			
			ИтогоКомиссияСуммаКомиссииКонтрагент = ИтогоКомиссияСуммаКомиссииКонтрагент + Строка.СуммаКомиссииКонтрагент;
		КонецЕсли;
	КонецЕсли;
КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКолонокДокументыОплаты()
МассивДокументовДолг = Новый Массив;
Для Каждого Строка Из Объект.ДокументыДолги Цикл
	МассивДокументовДолг.Добавить(Строка.ДокументДолг);	
КонецЦикла;

СуммаРаспределеноИтогоОплаты = 0;

//ОплатыОбщееСервер.ОбновитьДанныеКолонокДокументыОплаты(СуммаРаспределеноИтогоОплаты
//	, Объект.ДокументыОплаты, Объект.Ссылка, МассивДокументовДолг);	
ОплатыОбщееСервер.ОбновитьДанныеКолонокДокументыОплаты(СуммаРаспределеноИтогоОплаты
	, Объект.ДокументыОплаты, Объект, МассивДокументовДолг);	
	
Для Каждого Строка Из Объект.ДокументыОплаты Цикл
	ДокументОплаты = Строка.ДокументОплаты;
	Строка.ДатаОплаты = ДокументОплаты.ДатаОплаты;
	
	Строка.ВидОперации= ДокументОплаты.ВидОперации;

	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
		Строка.Аванс = ДокументОплаты.Аванс;	
	КонецЕсли;	
КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКолонокПлатежиКонтрагенту()
ИтогоКомиссияПлатежиОплачено = 0;	
Для Каждого Строка Из Объект.ДокументыПлатежиКонтрагенту Цикл
	ДокументПлатежа = Строка.ДокументПлатежа;
	Строка.СуммаПлатежаДокумент = ДокументПлатежа.Сумма;
	
	ИтогоКомиссияПлатежиОплачено = ИтогоКомиссияПлатежиОплачено + Строка.СуммаПлатежаДокумент;
	
	//Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
	//	Строка.Аванс = ДокументОплаты.Аванс;	
	//КонецЕсли;	
КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКолонокРаспределениеОплат()
ИтогоДокументыРаспределениеОплатСуммаОплачено = 0;

Если Объект.РаспределениеОплат.Количество() = 0 Тогда Возврат; КонецЕсли; 

Для Каждого Строка Из Объект.РаспределениеОплат Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
	                      |ГДЕ
	                      |	ЗаявкаНаБронированиеСчета.Ссылка = &Ссылка
	                      |	И ЗаявкаНаБронированиеСчета.СчетГУИД = &СчетГУИД");
	
	Запрос.УстановитьПараметр("Ссылка", Строка.ДокументДолг );
	Запрос.УстановитьПараметр("СчетГУИД", Строка.СчетГУИД );
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Строка.НомерСчета = Выборка.НомерСчета;
	КонецЕсли;
КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеШапки()
СуммаЗачетаОплачено = 0;
Для Каждого Строка Из Объект.ДокументыОплаты Цикл
	Если ТипЗнч(Строка.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
		Если Строка.ДокументОплаты.ВидОперации = Справочники.ВидыОпераций.Взаимозачет Тогда 
			СуммаЗачетаОплачено = СуммаЗачетаОплачено + Строка.СуммаРаспределено;
		КонецЕсли;
	КонецЕсли;
КонецЦикла;
	
ИтогоДолг = ИтогоДокументыДолгиСуммаДолг;
ИтогоКомиссия = Объект.СуммаКомиссииКонтрагента;

Если Объект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ТурагентствоВзаимозачет") Тогда
	НащДолгКонтрагенту = ИтогоКомиссия + Объект.СуммаОстатокВзаимозачета;
	
	Если НащДолгКонтрагенту <= ИтогоДолг Тогда  
		ИтогоДолгКОплате = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
		ИтогоДолгКЗачету = 0;
		
		ИтогоКомиссияКЗачету = НащДолгКонтрагенту - СуммаЗачетаОплачено;
		ИтогоКомиссияПлатежиКОплате = 0;

		ИтогоКОплате = ИтогоДолгКОплате;	
	Иначе
		ИтогоДолгКОплате = 0;
		ИтогоДолгКЗачету = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
		
		ИтогоКомиссияПлатежиКОплате = НащДолгКонтрагенту - ИтогоКомиссияПлатежиОплачено - ИтогоДолгКЗачету - СуммаЗачетаОплачено;
		ИтогоКомиссияКЗачету = ИтогоДолгКЗачету;	
		
		ИтогоКОплате = ИтогоКомиссияПлатежиКОплате;	
	КонецЕсли;
	
ИначеЕсли Объект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ТурагентствоДолги") Тогда
	
	НащДолгКонтрагенту = ИтогоКомиссия + Объект.СуммаОстатокВзаимозачета;
	
	ИтогоДолгКОплате = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
	ИтогоДолгКЗачету = 0;
	
	ИтогоКомиссияПлатежиКОплате = НащДолгКонтрагенту - СуммаЗачетаОплачено - ИтогоКомиссияПлатежиОплачено;
	ИтогоКомиссияКЗачету = 0;	
	
	//ИтогоКОплате = ИтогоДолгКОплате;	

ИначеЕсли Объект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ГруппаЗаявок") Тогда
	
	НащДолгКонтрагенту = ИтогоКомиссия + Объект.СуммаОстатокВзаимозачета;
	
	ИтогоДолгКОплате = ИтогоДолг - ИтогоДокументыДолгиСуммаОплачено;
	ИтогоДолгКЗачету = 0;
	
	ИтогоКомиссияПлатежиКОплате = НащДолгКонтрагенту - СуммаЗачетаОплачено - ИтогоКомиссияПлатежиОплачено;
	ИтогоКомиссияКЗачету = 0;	
	
	ИтогоКОплате = ИтогоДолгКОплате;
	
Иначе
	ИтогоДолгКОплате = 0;
	ИтогоДолгКЗачету = 0;
	
	ИтогоКомиссияПлатежиКОплате = 0;
	ИтогоКомиссияКЗачету = 0;	
	
	ИтогоКОплате = 0;
	
КонецЕсли;
КонецПроцедуры
//

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
ДанныеОбъект = Объект;	
ТекстПредупреждения = ТекстПредупрежденияПроверкаПередЗаписью(ДанныеОбъект, Символы.ПС);  	
Если ТекстПредупреждения <> "" Тогда
	ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Символы.ПС + "ЗАПИСЬ ДОКУМЕНТА ОТМЕНЯЕТСЯ !";

	ПоказатьПредупреждение(, ТекстПредупреждения);	
	
	Отказ = Истина;
	Возврат;
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТекстПредупрежденияПроверкаПередЗаписью(ТекущийОбъект, Разделитель)
ТекстПредупреждения = "";
Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда 
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ТипГрупповогоСчета) Тогда 
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			,"Не задан реквизит 'Тип группового счета'.", Разделитель);
	КонецЕсли;		

	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Контрагент) Тогда 
		ТекстПредупреждения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстПредупреждения
			,"Не задан реквизит 'Контрагент'.", Разделитель);
	КонецЕсли;		
КонецЕсли;

Возврат ТекстПредупреждения;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
ТекстПредупреждения = ТекстПредупрежденияПроверкаПередЗаписью(ТекущийОбъект, " ");  	
Если ТекстПредупреждения <> "" Тогда 
	ТекстПредупреждения = ТекстПредупреждения + " ЗАПИСЬ ДОКУМЕНТА ОТМЕНЯЕТСЯ !";
	Сообщить(ТекстПредупреждения);	
	
	Отказ = Истина;
	Возврат;
КонецЕсли;
	
Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ТекущийОбъект.СчетГУИД = Новый УникальныйИдентификатор();
	ТекущийОбъект.НомерСчета = ДокументыСервер.НовыйНомерГрупповогоСчета();
	ТекущийОбъект.ДатаСчета = ТекущаяДата();
КонецЕсли;

КонецПроцедуры


//
&НаСервере
Процедура ЗагрузкаДеревоСчетДетально()
Запрос = Новый Запрос(	
"ВЫБРАТЬ
|	ЗаявкаДолги.Ссылка КАК ЗаявкаСсылка,
|	ЗаявкаДолги.Услуга КАК Услуга,
|	ЗаявкаДолги.ДатаДолг КАК ДатаДолг,
|	ЗаявкаДолги.НаименованиеДолг КАК НаименованиеДолг,
|	ЗаявкаДолги.Количество КАК Количество,
|	ЗаявкаДолги.Цена КАК Цена,
|	ЗаявкаДолги.СуммаДолг КАК СуммаДолг,
|	ЗаявкаДолги.НомерВРезерв КАК НомерВРезерв,
|	ЗаявкаДолги.Клиент КАК Клиент,
|	ЗаявкаДолги.ТолькоПроживание КАК ТолькоПроживание,
|	ЗаявкаДолги.ТолькоУслуги КАК ТолькоУслуги,
|	ЗаявкаДолги.НомерСчета КАК НомерСчета,
|	ЗаявкаДолги.ДатаСчета КАК ДатаСчета
|ИЗ
|	Документ.ГрупповыеСчета.ДокументыДолги КАК ГрупповыеСчетаДокументыДолги
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
|			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
|			ЗаявкаНаБронированиеСчетаДетальноДолги.Услуга КАК Услуга,
|			ЗаявкаНаБронированиеСчетаДетальноДолги.ДатаДолг КАК ДатаДолг,
|			ЗаявкаНаБронированиеСчетаДетальноДолги.НаименованиеДолг КАК НаименованиеДолг,
|			ЗаявкаНаБронированиеСчетаДетальноДолги.Количество КАК Количество,
|			ЗаявкаНаБронированиеСчетаДетальноДолги.Цена КАК Цена,
|			ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаДолг КАК СуммаДолг,
|			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка.НомерВРезерв КАК НомерВРезерв,
|			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка.Клиент КАК Клиент,
|			ЗаявкаНаБронированиеСчета.ТолькоПроживание КАК ТолькоПроживание,
|			ЗаявкаНаБронированиеСчета.ТолькоУслуги КАК ТолькоУслуги,
|			ЗаявкаНаБронированиеСчета.НомерСчета КАК НомерСчета,
|			ЗаявкаНаБронированиеСчета.ДатаСчета КАК ДатаСчета
|		ИЗ
|			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
|				ПО ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
|					И ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД = ЗаявкаНаБронированиеСчета.СчетГУИД) КАК ЗаявкаДолги
|		ПО ГрупповыеСчетаДокументыДолги.ДокументДолг = ЗаявкаДолги.Ссылка
|			И ГрупповыеСчетаДокументыДолги.СчетГУИД = ЗаявкаДолги.СчетГУИД
|ГДЕ
|	ГрупповыеСчетаДокументыДолги.Ссылка = &Ссылка
|
|УПОРЯДОЧИТЬ ПО
|	ЗаявкаСсылка,
|	Услуга,
|	ДатаДолг
|ИТОГИ
|	СУММА(СуммаДолг)
|ПО
|	ЗаявкаСсылка");

Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

ДЗРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);

ЗначениеВРеквизитФормы(ДЗРезультат,"ДеревоСчетДетально");

ДеревоЭлементы = ДеревоСчетДетально.ПолучитьЭлементы();
Для Каждого СтрокаДерева Из ДеревоЭлементы Цикл
	УзелСтроки = СтрокаДерева.ПолучитьЭлементы();
	Если НЕ ЗначениеЗаполнено(УзелСтроки[0].ЗаявкаСсылка) Тогда Продолжить; КонецЕсли;
	
	Клиент = УзелСтроки[0].Клиент;
	НомерВРезерв = УзелСтроки[0].НомерВРезерв;

	МассивКУдалению = Новый Массив;
	Если Объект.СвернутьВСчете Тогда 
		
		ДатаМин = Дата('30000101');
		ДатаМакс = Дата('00010101');
		
		КоличествоСуток = 0;
		Для Каждого СтрокаУзла Из УзелСтроки Цикл
			Если НЕ СтрокаУзла.Услуга Тогда
				КоличествоСуток =  КоличествоСуток + СтрокаУзла.Количество;
			КонецЕсли;
			
			ДатаМин = Мин(СтрокаУзла.ДатаДолг, ДатаМин);
			ДатаМакс = Макс(СтрокаУзла.ДатаДолг, ДатаМакс);
			
			МассивКУдалению.Добавить(СтрокаУзла);	
		КонецЦикла;	
		
		Для Каждого Элемент Из МассивКУдалению Цикл
			УзелСтроки.Удалить(Элемент);	
		КонецЦикла;	
		
		СтрокаДерева.НаименованиеДолг = "Проживание " + Клиент.Наименование + " Номер " + НомерВРезерв 
			+ " с " + Формат(ДатаМин, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаМакс, "ДФ=dd.MM.yyyy");
			
		СтрокаДерева.Количество = КоличествоСуток;
		СтрокаДерева.Цена = ?(КоличествоСуток = 0, 0, Окр(СтрокаДерева.СуммаДолг/КоличествоСуток));  
			
	Иначе
		
		СтрокаДерева.НаименованиеДолг = Клиент.Наименование + " Номер " + НомерВРезерв;
		
		СуммаДолг = 0;
		Для Каждого СтрокаУзла Из УзелСтроки Цикл
			Если СтрокаУзла.ТолькоПроживание Тогда
				Если СтрокаУзла.Услуга Тогда 
					МассивКУдалению.Добавить(СтрокаУзла);
				КонецЕсли;
			Иначе	
				Если СтрокаУзла.Услуга Тогда 
					СуммаДолг = СуммаДолг + СтрокаУзла.СуммаДолг;
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаУзла.ТолькоУслуги Тогда
				Если НЕ СтрокаУзла.Услуга Тогда 
					МассивКУдалению.Добавить(СтрокаУзла);
				КонецЕсли;
			Иначе	
				Если НЕ СтрокаУзла.Услуга Тогда 
					СуммаДолг = СуммаДолг + СтрокаУзла.СуммаДолг;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаУзла.ЗаявкаСсылка = Неопределено;	
		КонецЦикла;	
		
		Для Каждого Элемент Из МассивКУдалению Цикл
			УзелСтроки.Удалить(Элемент);	
		КонецЦикла;	

		СтрокаДерева.СуммаДолг = СуммаДолг;
	КонецЕсли;	
	
КонецЦикла;	

КонецПроцедуры
//

////
&НаКлиенте
Процедура СвернутьВСчетеПриИзменении(Элемент)
Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецЕсли;
КонецПроцедуры

//
&НаКлиенте
Функция ЕстьДокументыПредупреждение()
Если Объект.ДокументыДолги.Количество() > 0 
ИЛИ Объект.КомиссияДокументыДолги.Количество() > 0 
Тогда 
	Текст = "Есть документы (долги и/или комиссия)
			|
			|ИЗМЕНЕНИЕ НЕ РАЗРЕШЕНО ...";
	ПоказатьПредупреждение(, Текст);
	
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции


&НаКлиенте
Процедура ТипГрупповогоСчетаПриИзменении(Элемент)
Если ЕстьДокументыПредупреждение() Тогда 
	
	ТипГрупповогоСчета_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "ТипГрупповогоСчета");
	Объект.ТипГрупповогоСчета = ТипГрупповогоСчета_OldValue;
	
	Возврат;
КонецЕсли;

Объект.Контрагент = Неопределено;
//Элементы.Контрагент.ОбновитьТекстРедактирования();

ЭтаФормаНастройка();

Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецЕсли;
КонецПроцедуры
//
	

//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 	
	Если ЕстьДокументыПредупреждение() Тогда 
		Контрагент_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "Контрагент");
		Объект.Контрагент = Контрагент_OldValue;
		
		Возврат;
	КонецЕсли;

	Если ПроверкаКонтрагента() Тогда
		Контрагент_OldValue = ОбщийФункционалСервер.ЗначениеРеквизитаНаСервере(Объект.Ссылка, "Контрагент");
		Объект.Контрагент = Контрагент_OldValue;
		
		ПоказатьПредупреждение(, "Контрагент не подходит для отбора");
		
		Возврат;
	КонецЕсли;
КонецЕсли;

ЮрЛицо = КлиентыСервер.ЭтоЮрЛицо(Объект.Контрагент);

ЭтаФормаНастройка();

Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаКонтрагента()
ПараметрыОтбора	= КонтрагентНачалоВыбораПараметрыОтбора(Объект.ТипГрупповогоСчета);

Если Объект.Контрагент.Турагентство <> ПараметрыОтбора.Турагентство Тогда Возврат Истина; КонецЕсли;

СписокЗначенийТипыОплатыСчета = Неопределено;
Если ПараметрыОтбора.Свойство("СписокЗначенийТипыОплатыСчета", СписокЗначенийТипыОплатыСчета) Тогда
	Для Каждого Элемент Из СписокЗначенийТипыОплатыСчета Цикл
		Возврат Ложь;				
	КонецЦикла;
	
	Возврат Истина;				
КонецЕсли;

Возврат Ложь;				
КонецФункции

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

Если НЕ ЗначениеЗаполнено(Объект.ТипГрупповогоСчета) Тогда Возврат; КонецЕсли;

ПараметрыФормы = КонтрагентНачалоВыбораПараметрыОтбора(Объект.ТипГрупповогоСчета);
Если НЕ ПараметрыФормы.Свойство("Турагентство") Тогда Возврат; КонецЕсли;

ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаВыбораКонтрагента", ПараметрыФормы, Элементы.Контрагент
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентНачалоВыбораПараметрыОтбора(ТипГрупповогоСчета)
ПараметрыФормы = Новый Структура;
Если ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ГруппаЗаявок Тогда
	ПараметрыФормы.Вставить("Турагентство", Ложь);
	
ИначеЕсли ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ТурагентствоВзаимозачет Тогда
	ПараметрыФормы.Вставить("Турагентство", Истина);
	
	СписокЗначенийТипыОплатыСчета = Новый СписокЗначений;
	СписокЗначенийТипыОплатыСчета.Добавить(Перечисления.ТипОплатыСчета.Взаимозачет);
	
	ПараметрыФормы.Вставить("СписокЗначенийТипыОплатыСчета", СписокЗначенийТипыОплатыСчета);
	
ИначеЕсли ТипГрупповогоСчета = Перечисления.ТипыГрупповогоСчета.ТурагентствоДолги Тогда
	ПараметрыФормы.Вставить("Турагентство", Истина);
	
 	СписокЗначенийТипыОплатыСчета = Новый СписокЗначений;
	СписокЗначенийТипыОплатыСчета.Добавить(Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой);
	СписокЗначенийТипыОплатыСчета.Добавить(Перечисления.ТипОплатыСчета.ПолнаяОплатаТурагентствомСВозвратомКомиссии);
	
	ПараметрыФормы.Вставить("СписокЗначенийТипыОплатыСчета", СписокЗначенийТипыОплатыСчета);
Иначе
	
КонецЕсли;

Возврат ПараметрыФормы;
КонецФункции

&НаКлиенте
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
Если НЕ ЗначениеЗаполнено(Текст) Тогда Возврат; КонецЕсли;	
	
ПараметрыОтбора = КонтрагентНачалоВыбораПараметрыОтбора(Объект.ТипГрупповогоСчета);	
ДанныеВыбора = КонтаргентДанныеВыбора(Текст, ПараметрыОтбора);
СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
Если НЕ ЗначениеЗаполнено(Текст) Тогда Возврат; КонецЕсли;	
	
ПараметрыОтбора = КонтрагентНачалоВыбораПараметрыОтбора(Объект.ТипГрупповогоСчета);	
ДанныеВыбора = КонтаргентДанныеВыбора(Текст, ПараметрыОтбора);
СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтаргентДанныеВыбора(Наименование, ПараметрыОтбора)
ДанныеВыбора = Новый СписокЗначений();

Если НЕ ПараметрыОтбора.Свойство("Турагентство") Тогда Возврат ДанныеВыбора; КонецЕсли;	
	
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Ссылка,
                      |	Клиенты.Наименование КАК Наименование
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты
                      |ГДЕ
                      |	Клиенты.ПометкаУдаления = ЛОЖЬ
                      |	И Клиенты.Турагентство = &Турагентство
                      |	И Клиенты.Наименование ПОДОБНО &Наименование";

Если ПараметрыОтбора.Свойство("СписокЗначенийТипыОплатыСчета") Тогда
	Запрос.Текст = Запрос.Текст + "
		| И Клиенты.ТипОплатыСчета В (&Список)";
	
	Запрос.УстановитьПараметр("Список", ПараметрыОтбора.СписокЗначенийТипыОплатыСчета); 
КонецЕсли;	

Запрос.УстановитьПараметр("Турагентство", ПараметрыОтбора.Турагентство);
Запрос.УстановитьПараметр("Наименование", "%" + Наименование+ "%");

Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
	
	ДанныеВыбора.Добавить(Выборка.Ссылка);	
КонецЦикла;
			
Возврат ДанныеВыбора;	
КонецФункции

//

//// + ДокументыДолги

//
&НаКлиенте
Процедура ДокументыДолгиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыДолгиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТекущиеДанные = Элемент.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина); 
ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ДокументДолг); 

ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
//

// + Удаление ДокументыДолги
&НаКлиенте
Процедура ДокументыДолгиПередУдалением(Элемент, Отказ)
ТД = Объект.ДокументыДолги.НайтиПоИдентификатору(Элементы.ДокументыДолги.ТекущаяСтрока);

Если ЕстьГрупповыеОплатыЗаявкаСчет(ТД.ДокументДолг, ТД.СчетГУИД) Тогда
	ПоказатьПредупреждение(, "Есть групповая оплата Заявки.
	| 
	|УДАЛЕНИЕ НЕ РАЗРЕШЕНО ..."); 
	
	Отказ = Истина;
	Возврат;
КонецЕсли;

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдалениеДокументДолги", ЭтаФорма);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ...", РежимДиалогаВопрос.ОКОтмена);
Отказ = Истина;
КонецПроцедуры

&НаСервере
Функция ЕстьГрупповыеОплатыЗаявкаСчет(ДокументДолг, СчетГУИД)
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД КАК СчетГУИД
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.РаспределениеОплатДолги КАК ЗаявкаНаБронированиеРаспределениеОплатДолги
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.СчетаДетальноОплаты КАК ЗаявкаНаБронированиеСчетаДетальноОплаты
                      |		ПО ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = ЗаявкаНаБронированиеСчетаДетальноОплаты.Ссылка
                      |			И ЗаявкаНаБронированиеРаспределениеОплатДолги.ДокументОплаты = ЗаявкаНаБронированиеСчетаДетальноОплаты.ДокументОплаты
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчетаДетальноОплаты.ГрупповаяОплата = ИСТИНА
                      |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.Ссылка = &ДокументДолг
                      |	И ЗаявкаНаБронированиеРаспределениеОплатДолги.СчетГУИД = &СчетГУИД");
Запрос.УстановитьПараметр("ДокументДолг", ДокументДолг); 
Запрос.УстановитьПараметр("СчетГУИД", СчетГУИД); 
Запрос.УстановитьПараметр("ГрупповойСчет", Объект.Ссылка); 

РезультатЗапроса = Запрос.Выполнить();
Возврат НЕ РезультатЗапроса.Пустой(); 
КонецФункции

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдалениеДокументДолги(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ТекущиеДанные = Объект.ДокументыДолги.НайтиПоИдентификатору(Элементы.ДокументыДолги.ТекущаяСтрока);
ДокументДолг = ТекущиеДанные.ДокументДолг;
СчетГУИД = ТекущиеДанные.СчетГУИД;

УдалениеДокументДолгиНаСервере(ДокументДолг, СчетГУИД);
КонецПроцедуры	

&НаСервере
Процедура УдалениеДокументДолгиНаСервере(ДокументДолг, СчетГУИД)
НачатьТранзакцию();

ГрупповойСчетСервер.УдалитьДокументДолгГрупповойСчет(ДокументДолг, СчетГУИД);

ТекущиеДанные = Объект.ДокументыДолги.НайтиПоИдентификатору(Элементы.ДокументыДолги.ТекущаяСтрока);
Объект.ДокументыДолги.Удалить(ТекущиеДанные);	

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры
// - Удаление ДокументыДолги

//
&НаКлиенте
Процедура ДобавитьДокументДолги(Команда)
ДобавитьДокументДолгиДействие(Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДокументДолгиТолькоПроживание(Команда)
ДобавитьДокументДолгиДействие(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДокументДолгиТолькоУслуг(Команда)
ДобавитьДокументДолгиДействие(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДокументДолгиДействие(ТолькоПроживание, ТолькоУслуги)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;
	
ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);	
ПараметрыФормы.Вставить("Контрагент", Объект.Контрагент); 
ПараметрыФормы.Вставить("ГрупповойСчет", Объект.Ссылка); 

ПараметрыФормы.Вставить("ТолькоПроживание", ТолькоПроживание); 
ПараметрыФормы.Вставить("ТолькоУслуги", ТолькоУслуги); 

ПараметрыФормы.Вставить("ДатаС", Объект.ДатаС);
ПараметрыФормы.Вставить("ДатаПо", Объект.ДатаПо); 

ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаПодбораГруппаЗаявок", ПараметрыФормы, Элементы.ДокументыДолги
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыДолгиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

Результат = ДобавитьСчетЗаявкиВДокументДолгиИзОбработкаВыбора(ВыбранноеЗначение);
Если Результат Тогда 
	ПоказатьПредупреждение(, "Выбранный счет заявки - пустой");
КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ДобавитьСчетЗаявкиВДокументДолгиИзОбработкаВыбора(ВыбранноеЗначение)
СтандартнаяОбработка = Ложь;

ДокументДолг = ВыбранноеЗначение.ЗаявкаСсылка;	
СчетГУИД = ВыбранноеЗначение.СчетГУИД;

ТолькоПроживание = ВыбранноеЗначение.ТолькоПроживание;
ТолькоУслуги = ВыбранноеЗначение.ТолькоУслуги;

НачатьТранзакцию();

Результат = ДобавитьСчетЗаявкиВДокументДолгиНаСервере(ДокументДолг, СчетГУИД, Объект, Объект.Ссылка, ТолькоПроживание, ТолькоУслуги);	
Если НЕ Результат Тогда
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецЕсли;

ЗафиксироватьТранзакцию();

Возврат Результат;
КонецФункции

&НаСервере
Функция ДобавитьСчетЗаявкиВДокументДолгиНаСервере(ДокументДолг, СчетГУИД, ГрупповойСчетОбъект, ГрупповойСчетСсылка
	, ТолькоПроживание, ТолькоУслуги)
	
ОтборСтроки = Новый Структура("ДокументДолг, СчетГУИД", ДокументДолг, СчетГУИД);
НайденныеСтроки = Объект.ДокументыДолги.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда Возврат Истина; КонецЕсли; 
	
ГрупповойСчетСервер.ДобавитьСчетЗаявкиВГрупповомСчете(ДокументДолг, СчетГУИД
	, ГрупповойСчетОбъект, ГрупповойСчетСсылка, ТолькоПроживание, ТолькоУслуги); 
	
Возврат Ложь;	
КонецФункции
//

//
&НаКлиенте
Процедура ЗаполнитьДокументДолги(Команда)
ЗаполнитьЗаявкиДействие(Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументДолгиТолькоПроживание(Команда)
ЗаполнитьЗаявкиДействие(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументДолгиТолькоУслуги(Команда)
ЗаполнитьЗаявкиДействие(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаявкиДействие(ТолькоПроживание, ТолькоУслуги)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ВызовИзДокумента", Истина);

ПараметрыФормы.Вставить("Контрагент", Объект.Контрагент);
ПараметрыФормы.Вставить("ТипГрупповогоСчета", Объект.ТипГрупповогоСчета);

ПараметрыФормы.Вставить("ТолькоПроживание", ТолькоПроживание);
ПараметрыФормы.Вставить("ТолькоУслуги", ТолькоУслуги);

ПараметрыФормы.Вставить("ДатаС", Объект.ДатаС); 
ПараметрыФормы.Вставить("ДатаПо", Объект.ДатаПо);

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыФормаОтборЗаявок", ЭтаФорма);

ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаОтборГруппаЗаявок", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыФормаОтборЗаявок(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
МассивЗаявок = Результат.МассивЗаявок;
ТолькоПроживание_П = Результат.ТолькоПроживание;
ТолькоУслуги_П = Результат.ТолькоУслуги;

Если ДобавитьЗаявкиИзЗаполненияЗаявок(МассивЗаявок, ТолькоПроживание_П, ТолькоУслуги_П) Тогда 
	ПоказатьПредупреждение(, "Выбранные заявки - пустые");
	Возврат; 
КонецЕсли;

Элементы.ДокументыДолги.Обновить();
КонецПроцедуры

&НаСервере
Функция ДобавитьЗаявкиИзЗаполненияЗаявок(МассивЗаявок, ТолькоПроживание_П, ТолькоУслуги_П)
НачатьТранзакцию();

Если ДобавитьМассивЗаявокНаСервере(МассивЗаявок, Объект, Объект.Ссылка, ТолькоПроживание_П, ТолькоУслуги_П) Тогда
	ОтменитьТранзакцию();
	
	Возврат Истина;
Иначе 
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ЗафиксироватьТранзакцию();

	Возврат Ложь;
КонецЕсли;
КонецФункции

&НаСервере
Функция ДобавитьМассивЗаявокНаСервере(МассивЗаявок, ГрупповойСчетОбъект, ГрупповойСчетСсылка
	, ТолькоПроживание, ТолькоУслуги)
// + Заполнение Группового Счета
НетЗаявок = Истина;
Для Каждого СтрокаЗаявка Из МассивЗаявок Цикл
	ДокументДолг = СтрокаЗаявка.ЗаявкаСсылка;
	СчетГУИД = СтрокаЗаявка.СчетГУИД;

	Результат = ДобавитьСчетЗаявкиВДокументДолгиНаСервере(ДокументДолг, СчетГУИД, ГрупповойСчетОбъект, ГрупповойСчетСсылка
		, ТолькоПроживание, ТолькоУслуги);
	Если Результат Тогда  Продолжить; КонецЕсли;
	
	НетЗаявок = Ложь;
КонецЦикла;
// - Заполнение Группового Счета

Возврат НетЗаявок;
КонецФункции
//
//// - ДокументыДолги


//// + КомиссияДокументыДолги

//
&НаКлиенте
Процедура КомиссияДокументыДолгиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомиссияДокументыДолгиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТекущиеДанные = Элемент.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

//Если Поле.Имя = "КомиссияДокументыДолгиКомментарий"  
//ИЛИ Поле.Имя = "КомиссияДокументыДолгиСуммаКомиссииКонтрагент" Тогда 
Если (НЕ Поле.ТолькоПросмотр) И Поле.Доступность
И (Поле.Вид = ВидПоляФормы.ПолеВвода ИЛИ Поле.Вид = ВидПоляФормы.ПолеФлажка)
Тогда 	
	//СтандартнаяОбработка = Ложь;	
	Возврат;
КонецЕсли;

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ДокументДолг); 

ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура КомиссияДокументыДолгиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры
//

// + Удаление КомиссияДокументыДолги
&НаКлиенте
Процедура КомиссияДокументыДолгиПередУдалением(Элемент, Отказ)
Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдалениеКомиссияДокументДолги", ЭтаФорма);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ УДАЛЕНИЕ ...", РежимДиалогаВопрос.ОКОтмена);
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдалениеКомиссияДокументДолги(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

УдалениеКомиссияДокументДолгиНаСервере();
КонецПроцедуры	

&НаСервере
Процедура УдалениеКомиссияДокументДолгиНаСервере()
//НачатьТранзакцию();

//ОбщийФункционалСервер.УдалитьТекущуюСтрокуТаблицыДокумента(Элементы.КомиссияДокументыДолги, Объект.КомиссияДокументыДолги);
ТекущаяСтрока = Элементы.КомиссияДокументыДолги.ТекущаяСтрока;
ТекущиеДанные = Объект.КомиссияДокументыДолги.НайтиПоИдентификатору(ТекущаяСтрока);
Объект.КомиссияДокументыДолги.Удалить(ТекущиеДанные);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
//ЗафиксироватьТранзакцию();
КонецПроцедуры
// - Удаление КомиссияДокументыДолги

//
&НаКлиенте
Процедура ДобавитьКомиссияДокументДолги(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;
	
ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);	
ПараметрыФормы.Вставить("КонтрагентОтбор", Объект.Контрагент); 
ПараметрыФормы.Вставить("ДатаСОтбор", Объект.ДатаС); 
ПараметрыФормы.Вставить("ДатаПоОтбор", Объект.ДатаПо); 

ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаПодбораКомиссия", ПараметрыФормы, Элементы.КомиссияДокументыДолги
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КомиссияДокументыДолгиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ДобавитьЗаявкуВКомиссияИзОбработкаВыбора(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаявкуВКомиссияИзОбработкаВыбора(ВыбранноеЗначение)
СтандартнаяОбработка = Ложь;

ДокументДолг = ВыбранноеЗначение.ЗаявкаСсылка;	

//НачатьТранзакцию();
Результат = ДобавитьЗаявкуВКомиссияНаСервере(ДокументДолг);	
Если Результат Тогда Возврат; КонецЕсли; 

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
//ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере
Функция ДобавитьЗаявкуВКомиссияНаСервере(ДокументДолг)
ОтборСтроки = Новый Структура("ДокументДолг", ДокументДолг);
НайденныеСтроки = Объект.КомиссияДокументыДолги.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда Возврат Истина; КонецЕсли; 
	
НоваяСтрока = Объект.КомиссияДокументыДолги.Добавить();
НоваяСтрока.ДокументДолг = ДокументДолг;

Возврат Ложь;
КонецФункции
//

//
&НаКлиенте
Процедура ЗаполнитьКомиссияДокументДолги(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;

ЗаполнитьКомиссияДокументДолгиДействие();
КонецПроцедуры
 
&НаКлиенте
Процедура ЗаполнитьКомиссияДокументДолгиДействие()
Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыФормаОтборКомиссия", ЭтаФорма);

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ВызовИзДокумента", Истина);

ПараметрыФормы.Вставить("Бронирует", Объект.Контрагент);
ПараметрыФормы.Вставить("ДатаСОтбор", Объект.КомиссияДатаС);
ПараметрыФормы.Вставить("ДатаПоОтбор", Объект.КомиссияДатаПо);

ОткрытьФорму("Документ.ГрупповыеСчета.Форма.ФормаОтборКомиссия", ПараметрыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыФормаОтборКомиссия(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
МассивЗаявок = Результат.МассивЗаявок;

Если ДобавитьКомиссияДокументДолгиИзЗаполнения(МассивЗаявок) Тогда 
	ПоказатьПредупреждение(, "В выбранных заявках нет строк для добавления в групповой счет");
	Возврат; 
КонецЕсли;

Элементы.КомиссияДокументыДолги.Обновить();
КонецПроцедуры

&НаСервере
Функция ДобавитьКомиссияДокументДолгиИзЗаполнения(МассивЗаявок)
НачатьТранзакцию();
Результат = ДобавитьМассивКомиссияДокументДолгиНаСервере(МассивЗаявок, Объект, Объект.Ссылка);
Если Результат Тогда
	ОтменитьТранзакцию();
	
	Возврат Истина;
Иначе 
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ЗафиксироватьТранзакцию();

	Возврат Ложь;
КонецЕсли;
КонецФункции

&НаСервере
Функция ДобавитьМассивКомиссияДокументДолгиНаСервере(МассивЗаявок, ГрупповойСчетОбъект, ГрупповойСчетСсылка)
// + Заполнение Группового Счета
НетЗаявок = Истина;
Для Каждого СтрокаЗаявка Из МассивЗаявок Цикл
	ДокументДолг = СтрокаЗаявка.ЗаявкаСсылка;

	Результат = ДобавитьЗаявкуВКомиссияНаСервере(ДокументДолг);
	Если Результат Тогда  Продолжить; КонецЕсли;
	
	НетЗаявок = Ложь;
КонецЦикла;
// - Заполнение Группового Счета

Возврат НетЗаявок;
КонецФункции
//
//// - КомиссияДокументыДолги

//// + Комиссия Зачет
&НаКлиенте
Процедура ДобавитьОплатуЗачет(Команда)
Если ЕстьПрочиеОплатыВзаимозачет() Тогда 
	ПоказатьПредупреждение(, "Оплата зачетом уже добавлена.
		|Есть прочие оплаты группового счета.
		|
		|ДОБАВЛЕНИЕ ОПЛАТЫ НЕ РАЗРЕШЕНО ...
		|
		|Для обновления комисии удалите 'Прочие оплаты' ..." 
		);	
	
	Возврат;
КонецЕсли;

//Если ИтогоДолгКЗачету_1 <> 0 Тогда
//	СуммаОплаты = ИтогоДолгКЗачету_1;
//	
//	Приход = Ложь;
//Иначе
Если ИтогоКомиссияКЗачету <> 0 Тогда 	
	СуммаОплаты = ИтогоКомиссияКЗачету;
	
	Приход = Истина;
Иначе
	ПоказатьПредупреждение(, "Нечего добавлять ...
		|
		|Комиссия к зачету = 0");
	
	Возврат; 
КонецЕсли;

Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;

ДобавитьОплатуЗачетНаСервере(СуммаОплаты, Приход);
КонецПроцедуры

&НаСервере
Процедура ДобавитьОплатуЗачетНаСервере(СуммаОплаты, Приход)
НачатьТранзакцию();	

ПрочиеОплатыСсылка = ГрупповойСчетСервер.ДобавитьОплатаЗачет(СуммаОплаты, Приход, Объект);

ДобавитьОплатаНаСервере(ПрочиеОплатыСсылка);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();	
КонецПроцедуры
//// - Комиссия Зачет 



//// + РаспределениеОплат

//
&НаКлиенте
Процедура РаспределениеОплатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТекущиеДанные = Элемент.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина); 
ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ДокументДолг); 

ОткрытьФорму("Документ.ЗаявкаНаБронирование.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
//
//// - РаспределениеОплат


//// + Оплаты
&НаКлиенте
Процедура ДокументыОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТекущиеДанные = Элемент.ТекущиеДанные;	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

ОплатыОбщееКлиент.ОткрытьДокументОплаты(ЭтаФорма, ТекущиеДанные.ДокументОплаты, Истина, Неопределено);


//ПараметрыФормы = Новый Структура;
//ПараметрыФормы.Вставить("ТолькоПросмотр", Истина); 
//ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ДокументОплаты); 

//Если ТипЗнч(ТекущиеДанные.ДокументОплаты) = Тип("ДокументСсылка.ВыпискаБанка") Тогда
//	ФормаИмя = "Документ.ВыпискаБанка.Форма.ФормаДокумента";
//ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументОплаты) = Тип("ДокументСсылка.КассовыйДокумент") Тогда
//	ФормаИмя = "Документ.КассовыйДокумент.Форма.ФормаДокумента";
//ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументОплаты) = Тип("ДокументСсылка.ПрочиеОплаты") Тогда
//	ФормаИмя = "Документ.ПрочиеОплаты.Форма.ФормаДокумента";
//Иначе	
//	ФормаИмя = "";
//КонецЕсли;

//Если ФормаИмя = "" Тогда Возврат; КонецЕсли;

//ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтаФорма
//	,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ДокументыОплатыПередУдалением(Элемент, Отказ)
ТекущиеДанные = Элемент.ТекущиеДанные;  	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;	

Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдалениеОплаты", ЭтаФорма);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ ОТМЕНУ ОПЛАТЫ ...", РежимДиалогаВопрос.ОКОтмена);

Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдалениеОплаты(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

ТекущиеДанные = Элементы.ДокументыОплаты.ТекущиеДанные; 

Результат = УдалитьДокументыОплатыНаСервере(ТекущиеДанные.ДокументОплаты);
Если Результат Тогда
	Объект.ДокументыОплаты.Удалить(ТекущиеДанные);
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция УдалитьДокументыОплатыНаСервере(ДокументОплаты)
ДокументОплатыОбъект = ДокументОплаты.ПолучитьОбъект();
Если ДокументОплатыОбъект = Неопределено Тогда Возврат Истина; КонецЕсли;
	
НачатьТранзакцию();

// + Удаление оплат из Заявок
УдалитьДокументОплатыИзДокументДолги(ДокументОплаты);
// - Удаление оплат из Заявок

// + Удаление Документа оплаты
ОплатыОбщееСервер.УдалитьДокументОплатыДолгОплатыИДокументОплаты(ДокументОплаты, Объект.Ссылка, Объект.СчетГУИД);
// - Удаление Документа оплаты

// + Удаление оплат из Группового счета
ОтборСтрокиРаспределениеОплат = Новый Структура("ДокументОплаты", ДокументОплаты);
ОбщийФункционалСервер.УдалитьСтрокиОтборСтроки(ОтборСтрокиРаспределениеОплат, Объект.РаспределениеОплат);

СтрокаТаблицы = Объект.ДокументыОплаты.НайтиПоИдентификатору(Элементы.ДокументыОплаты.ТекущаяСтрока);
Объект.ДокументыОплаты.Удалить(СтрокаТаблицы);
// - Удаление оплат из Группового счета

// + Перераспределение остатков оплат 
ПерераспределитьОплатыНаСервере();
// - Перераспределение остатков оплат 

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();

Возврат Ложь;
КонецФункции
//

&НаСервере
Процедура УдалитьДокументОплатыИзДокументДолги(ДокументОплаты)
ГрупповойСчетСервер.УдалитьДокументОплатыИзДокументДолги(ДокументОплаты, Объект);
КонецПроцедуры

//
&НаКлиенте
Процедура ПерераспределитьОплаты(Команда)
ПерераспределитьОплатыНаСервереТранзакция();
Конецпроцедуры

&НаСервере
Процедура ПерераспределитьОплатыНаСервереТранзакция()
НачатьТранзакцию();

ПерераспределитьОплатыНаСервере();

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры 

&НаСервере
Процедура ПерераспределитьОплатыНаСервере()
ГрупповойСчетСервер.ПерераспределитьОплаты(Объект);    
КонецПроцедуры
//

//
&НаКлиенте
Процедура Чек(Команда)
Если ОплатыОбщееСервер.ЕстьОстаткиОплатКассаКонтрагент(Объект.Контрагент) Тогда
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВопрос_ЕстьКассовыеОстаткиОплат", ЭтаФорма);
	
	ПоказатьВопрос(ОписаниеОповещения, "Есть кассовые остатки оплат для контрагента
										|
										|ПРОДОЛЖИТЬ ?"
					, РежимДиалогаВопрос.ОКОтмена);
						
	Возврат;				
КонецЕсли;

ЧекОплатыДействие(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопрос_ЕстьКассовыеОстаткиОплат(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;
	
ЧекОплатыДействие(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЧекОплатыДействие(Счет)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;
	
ДопПараметры = Новый Структура;
ДопПараметры.Вставить("Счет", Счет);

ДопПараметры.Вставить("ЭтоЧекНаАванс", Ложь);

ДопПараметры.Вставить("ЭтоГрупповойСчет", Истина); 
ДопПараметры.Вставить("ДокументДолгОбъектДанные", Объект);  

ДопПараметрыОповещения = Новый Структура;
ОповещениеЗавершениеЧекОплаты = Новый ОписаниеОповещения("ОповещениеЗавершениеЧекОплаты", ЭтаФорма, ДопПараметрыОповещения);
ДопПараметры.Вставить("ОповещениеЗавершениеЧек", ОповещениеЗавершениеЧекОплаты);

ОплатыЧекКлиент.ЧекОплаты(ДопПараметры, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗавершениеЧекОплаты(Результат, ДополнительныеПараметры) Экспорт
ЭтаФорма.Прочитать();	
КонецПроцедуры	
//

//
&НаКлиенте
Процедура ВозвратОплаты(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;

ПараметрыФормы = Новый Структура(); 

СписокЗначенийКонтрагенты = Новый СписокЗначений;
СписокЗначенийКонтрагенты.Добавить(Объект.Контрагент);
ПараметрыФормы.Вставить("КонтрагентыОтбор", СписокЗначенийКонтрагенты);

ПараметрыФормы.Вставить("ДокументДолг", Объект.Ссылка);

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормы_ЧекВозврат", ЭтаФорма);   
ОткрытьФорму("ОбщаяФорма.ЧекВозврат", ПараметрыФормы, ЭтаФорма
	,,,,Оповещение , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_ЧекВозврат(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли; 	

ОчиститьСообщения();  

ФУ_Клиент.ПоказатьПодтверждениеСообщение(Результат);

ЭтаФорма.Прочитать();	
КонецПроцедуры
//

//// + Добавить Остатки Оплаты

// + КассаОтмененные
&НаКлиенте
Процедура ДобавитьОплатуКассаОтмененные(Команда)
ОткрытьФормаВыбораОстаткиОплаты(Объект.Ссылка, Ложь);	
КонецПроцедуры
// - КассаОтмененные

// + Добавить Касса Остатки Оплаты
&НаКлиенте
Процедура ДобавитьОплатаКассаОстатки(Команда)
ОткрытьФормаВыбораОстаткиОплаты(Неопределено, Истина);	
КонецПроцедуры
// - Добавить Касса Остатки Оплаты

// + Добавить Остатки 
&НаКлиенте
Процедура ОткрытьФормаВыбораОстаткиОплаты(ОтмененныйДокументДолг, ОплатаОтВсехКонтрагентов)
Если НЕ ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;	
	
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);

//СписокКонтрагентов = Новый СписокЗначений;
//СписокКонтрагентов.Добавить(Объект.Контрагент);
//ПараметрыФормы.Вставить("СписокКонтрагентов", СписокКонтрагентов);

СписокКонтрагентов = Новый СписокЗначений;
Если НЕ ОплатаОтВсехКонтрагентов Тогда
	СписокКонтрагентов.Добавить(Объект.Контрагент);
КонецЕсли;
ПараметрыФормы.Вставить("СписокКонтрагентов", СписокКонтрагентов);

СуммаКОплате = СуммаКОплате(); 
ПараметрыФормы.Вставить("СуммаКОплате", СуммаКОплате);
Если СуммаКОплате = 0 Тогда Возврат; КонецЕсли; 

ПараметрыФормы.Вставить("ОтмененныйДокументДолг", ОтмененныйДокументДолг);

ДопПараметры = Новый Структура;
ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытиеФормы_ФормаВыбораОплатыОстатки", ЭтаФорма, ДопПараметры);
	
ОткрытьФорму("Документ.КассовыйДокумент.Форма.ФормаВыбораОстаткиОплаты", ПараметрыФормы, ЭтаФорма 
	,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаСервере
Функция СуммаКОплате()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	СУММА(СчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка КАК Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД КАК СчетГУИД,
                      |			СУММА(ЗаявкаНаБронированиеСчетаДетальноДолги.СуммаКЗакрытию) КАК СуммаКЗакрытию
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование.СчетаДетальноДолги КАК ЗаявкаНаБронированиеСчетаДетальноДолги
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.Ссылка,
                      |			ЗаявкаНаБронированиеСчетаДетальноДолги.СчетГУИД) КАК СчетаДетальноДолги
                      |		ПО ЗаявкаНаБронированиеСчета.Ссылка = СчетаДетальноДолги.Ссылка
                      |			И ЗаявкаНаБронированиеСчета.СчетГУИД = СчетаДетальноДолги.СчетГУИД
                      |ГДЕ
                      |	ЗаявкаНаБронированиеСчета.ГрупповойСчет = &ГрупповойСчет");	

Запрос.УстановитьПараметр("ГрупповойСчет", Объект.Ссылка);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	Возврат 0;
Иначе
	Возврат ТЗ[0].СуммаКЗакрытию;
КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура ЗакрытиеФормы_ФормаВыбораОплатыОстатки(Результат, ДополнительныеПараметры) Экспорт
Если НЕ ЗначениеЗаполнено(Результат) Тогда Возврат; КонецЕсли;

ДобавитьОплатаНаСервереТранзакция(Результат);

КонецПроцедуры
//            

//
&НаСервере
Процедура ДобавитьОплатаНаСервереТранзакция(ДокументОплаты)
НачатьТранзакцию();

ДобавитьОплатаНаСервере(ДокументОплаты);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере
Процедура ДобавитьОплатаНаСервере(ДокументОплаты)
СуммаКРаспределению = ОплатыОбщееСервер.ОплатаОстатокКРаспределению(ДокументОплаты, Объект);

ГрупповойСчетСервер.ДобавитьИЗаполнитьДокументОплатыВГрупповойСчетОбъект(ДокументОплаты, Объект, СуммаКРаспределению);
КонецПроцедуры
//
// - Добавить Остатки 
//// - Добавить Остатки Оплаты

// + Отправить в Pay Keeper
&НаКлиенте
Процедура ОтправитьВPayKeeper(Команда)
ОтправитьВPayKeeperДействие();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВPayKeeperДействие()
	
Если ЗначениеЗаполнено(ЭтаФорма.УникальныйИдентификатор) Тогда
	УникальныйИдентификатор_П = ЭтаФорма.УникальныйИдентификатор;		
Иначе
	УникальныйИдентификатор_П = Новый УникальныйИдентификатор();
КонецЕсли;

ДопПараметры = Новый Структура;
ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеФормы_ОтправкаPayKeeper", ЭтотОбъект, ДопПараметры);

ОбъектДанные = Объект;
PayKeeperКлиент.ОтправитьВPayKeeperДолг(ОбъектДанные, Неопределено, УникальныйИдентификатор_П
	, ЭтаФорма, ОповещениеОЗавершении);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормы_ОтправкаPayKeeper(Результат, ДополнительныеПараметры) Экспорт
Ответ = ДополнительныеПараметры.Результат;	
ИД_Платежа = Ответ.ИД_Платежа;

ПоказатьПредупреждение(, "Платеж отправлен в Pay Keeper");
КонецПроцедуры
// - Отправить в Pay Keeper

&НаКлиенте
Процедура ПроверитьОплатуPayKeepr(Команда)
 
Ответ = PayKeeperКлиентСервер.СписокПлатежейPayKeeper();
Если Ответ.Ошибка Тогда 
	ПоказатьПредупреждение(, Ответ.ОписаниеОшибки); 
	Сообщить(Ответ.ОписаниеОшибки);
	
	Возврат;
КонецЕсли;

СписокПлатежей = Ответ.СписокПлатежей;	

ЕстьОплаты = Ложь;
НомерСчетаPayKeeper = НомерСчетаPayKeeper();
Для Каждого СтрокаПлатежа Из СписокПлатежей Цикл 
	                      
	Если СтрокаПлатежа.orderid <> НомерСчетаPayKeeper Тогда Продолжить; КонецЕсли; 
	
	Если СтрокаПлатежа.status <> "success" Тогда  Продолжить; КонецЕсли; 
	
	ИД_ПлатежаСтрока = СтрокаПлатежа.id;
	ИД_Платежа = ОбщийФункционалКлиентСервер.ПолучитьЧисло(ИД_ПлатежаСтрока);
	
	СуммаПлатежаСтрока = СтрокаПлатежа.pay_amount;
	СуммаПлатежа = ОбщийФункционалКлиентСервер.ПолучитьЧисло(СуммаПлатежаСтрока);
	
	ПоказатьПредупреждение(, "Успешная оплата счета: " + НомерСчетаPayKeeper + " на сумму: " + Строка(СуммаПлатежа));
	ЕстьОплаты = Истина;

	//Строка = Новый Структура("ИД_платежа, Плательщик, НомерСчета, СуммаПлатежа, Статус"
	//		 , ИД_Платежа, СтрокаПлатежа.clientid, СтрокаПлатежа.orderid, СуммаПлатежа, СтрокаПлатежа.status); 
	//		 
	//ДатаОплатыСтрока = СтрокаПлатежа.success_datetime;
	//Если ЗначениеЗаполнено(ДатаОплатыСтрока) Тогда
	//	//ДатаОплатыСтрока = СтрЗаменить(ДатаОплатыСтрока ,"-" ,".");
	//	ДатаОплаты = ОбщийФункционалКлиентСервер.ПолучитьДату(ДатаОплатыСтрока);
	//Иначе
	//	ДатаОплаты = Неопределено;
	//КонецЕсли;

	//НаборЗаписей = PayKeeperСервер.ОбновитьPayKeeperПлатежи(Строка, Неопределено, ДатаОплаты);
	//
	//СтрокаНабора = НаборЗаписей[0];	
	//	
	//PayKeeperСервер.СвязатьPayKeeperПлатежи(СтрокаНабора.ИД_Платежа);  
КонецЦикла;

Если НЕ ЕстьОплаты Тогда
	ПоказатьПредупреждение(, "Нет оплаты счета: " + НомерСчетаPayKeeper);
КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НомерСчетаPayKeeper()
ТД = Неопределено;

Ответ = PayKeeperСервер.НомерСчета(Объект, Неопределено);
НомерСчетаPayKeeper = Ответ.НомерСчетаPayKeeper;

Возврат НомерСчетаPayKeeper;
КонецФункции



//// + Безнал
&НаКлиенте
Процедура ДобавитьОплатаБезнал(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;

ПараметрыФормы = Новый Структура();
//ПараметрыФормы.Вставить("ОтКого", Объект.Контрагент);

КонтрагентыОтбор = Новый СписокЗначений;
КонтрагентыОтбор.Добавить(Объект.Контрагент);
ПараметрыФормы.Вставить("ОтКого", КонтрагентыОтбор);

ПараметрыФормы.Вставить("КонтрагентТолькоПросмотр", Истина);

//ДанныеОбъект = Объект;
//СуммаКОплате = ГрупповойСчетСервер.СуммаКОплатеГрупповойСчет(ДанныеОбъект);
//СуммаКОплате = СуммаКОплатеГрупповойСчет();
СуммаКОплате = СуммаКОплате();
ПараметрыФормы.Вставить("СуммаКОплате", СуммаКОплате);	

Если СуммаКОплате = 0 Тогда Возврат; КонецЕсли;

Оповещение = Новый ОписаниеОповещения("ЗавершениеФормаВыбораОплата", ЭтаФорма);
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаВыбораОплата", ПараметрыФормы , ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы .БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормаВыбораОплата(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

ДобавитьОплатаНаСервереТранзакция(Результат);
Конецпроцедуры
//// - Безнал

//// + Списание
&НаКлиенте
АСИНХ Процедура ДобавитьСписаниеДолги(Команда)
//ТекущийПользовательАдмин = НастройкиСервер.ЭтоАдмин();
//Если НЕ ТекущийПользовательАдмин Тогда 
Если НЕ НастройкиСервер.ЭтоАдминистратор() Тогда 
	ПоказатьПредупреждение(, "Вы не являетесь администратором программы.
							|
							|СПИСАНИЕ ДОЛГА НЕ РАЗРЕШЕНО ...");
	Возврат; 
КонецЕсли;
	
СуммаКСписанию = СуммаКСписанию();	
Если СуммаКСписанию = 0 Тогда 
	ПоказатьПредупреждение(,"Нечего списывать ...");
	
	Возврат;
КонецЕсли;

СуммаКСписанию_П = СуммаКСписанию;
Обещание = ВвестиЧислоАсинх(СуммаКСписанию_П, "Сумма к списанию");
Результат = Ждать Обещание;

Если Результат = Неопределено Тогда Возврат; КонецЕсли;

Если Результат > СуммаКСписанию Тогда  
	ПоказатьПредупреждение(, "Сумма к списанию должна быть меньше либо равна " + СуммаКСписанию);
	
	Возврат;	
КонецЕсли;

Если Результат <= 0  Тогда  
	ПоказатьПредупреждение(, "Сумма к списанию должна быть больше 0. ");
	
	Возврат;	
КонецЕсли;
	
ДобавитьСписаниеДолгиНаСервере(Результат);
КонецПроцедуры

&НаСервере
Процедура ДобавитьСписаниеДолгиНаСервере(СуммаСписания)
НачатьТранзакцию();	
	
ДокументОплаты = ОплатыОбщееСервер.СоздатьПрочиеОплатыСписание(Объект.Контрагент, Объект.Ссылка, СуммаСписания
	, Справочники.ВидыОпераций.Списание);
	
ДобавитьОплатаНаСервере(ДокументОплаты);

ЗафиксироватьТранзакцию();	
КонецПроцедуры

&НаСервере
Функция СуммаКСписанию()
ОстатокДолга = 0;
Для Каждого Строка Из Объект.ДокументыДолги Цикл
	ОстатокДолга = ОстатокДолга + Строка.СуммаДолг - Строка.СуммаОплачено;
КонецЦикла;

Если ОстатокДолга < 0 Тогда ОстатокДолга = 0; КонецЕсли; 

Возврат ОстатокДолга;
КонецФункции
//// - Списание

//// + Платежи контрагенту
&НаКлиенте
Процедура ДобавитьПлатежКонтрагенту(Команда)
Если НЕ ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда Возврат; КонецЕсли;	

Если Объект.ТипГрупповогоСчета = ПредопределенноеЗначение("Перечисление.ТипыГрупповогоСчета.ТурагентствоВзаимозачет") Тогда
	Если ИтогоКомиссияКЗачету <> 0 	
	Тогда
		ПоказатьПредупреждение(, "ВНИМАНИЕ! У турагентства есть незакрытые долги.
							|
							|ДОБАВЬТЕ ЗАЧЕТ ОПЛАТЫ ...");
		
		Возврат; 
	КонецЕсли;
КонецЕсли;

ПараметрыФормы = Новый Структура;	
ПараметрыФормы.Вставить("ЭтоПлатежКонтрагенту", Истина);
ПараметрыФормы.Вставить("ОтКого", Объект.Контрагент);

Сумма = ИтогоКомиссияПлатежиКОплате - ИтогоДолгКОплате; 
ПараметрыФормы.Вставить("Сумма", Сумма);

Если Сумма = 0 Тогда
	ПоказатьПредупреждение(, "Сумма к оплате = 0.
						|
						|ДОБАВЛЕНИЕ ОТМЕНЯЕТСЯ ...");
	
	Возврат; 
КонецЕсли;

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_ВыпискаБанкаФормаДокумента", ЭтаФорма);
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма 
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы_ВыпискаБанкаФормаДокумента(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

Если НЕ ЗначениеЗаполнено(Результат) Тогда Возврат; КонецЕсли;

ДобавитьПлатежКонтрагентуНаСервере(Результат);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаСервере
Процедура ДобавитьПлатежКонтрагентуНаСервере(Результат)
НоваяСтрока = Объект.ДокументыПлатежиКонтрагенту.Добавить();

НоваяСтрока.ДокументПлатежа = Результат; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПлатежиКонтрагентуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ПараметрыФормы = Новый Структура;

ЭтоАдминистратор = НастройкиСервер.ЭтоАдминистратор();
ПараметрыФормы.Вставить("ТолькоПросмотр", НЕ ЭтоАдминистратор);
ПараметрыФормы.Вставить("Ключ", Элемент.ТекущиеДанные.ДокументПлатежа);
	
ОткрытьФорму("Документ.ВыпискаБанка.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//
&НаКлиенте
Процедура ДокументыПлатежиКонтрагентуПередУдалением(Элемент, Отказ)
ТекущиеДанные = Элемент.ТекущиеДанные;  	
Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;	

ДопПараметры = Новый Структура();
ДопПараметры.Вставить("ДокументПлатежа", ТекущиеДанные.ДокументПлатежа);
Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеУдалениеПлатежа", ЭтаФорма, ДопПараметры);
ПоказатьВопрос(Оповещение, "ПОДТВЕРДИТЕ ОТМЕНУ ОПЛАТЫ ...", РежимДиалогаВопрос.ОКОтмена);
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеУдалениеПлатежа(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;

УдалитьДокументыПлатежпНаСервере(ДополнительныеПараметры.ДокументПлатежа);
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументыПлатежпНаСервере(ДокументПлатежа)
НачатьТранзакцию();

ДокументПлатежаОбъект = ДокументПлатежа.ПолучитьОбъект();
ДокументПлатежаОбъект.Удалить();

СтрокаТаблицы = Объект.ДокументыПлатежиКонтрагенту.НайтиПоИдентификатору(Элементы.ДокументыПлатежиКонтрагенту.ТекущаяСтрока);
Объект.ДокументыПлатежиКонтрагенту.Удалить(СтрокаТаблицы);

ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
ЗафиксироватьТранзакцию();
КонецПроцедуры
//
//// - Платежи контрагенту


// + Печать
&НаКлиенте
Процедура ПечатьСчета(Команда)
Ответ = ДокументыСервер.ПроверитьГрупповойСчет(Объект.Ссылка);

Если Ответ.ТекстОшибки <> "" Тогда 
	ПоказатьПредупреждение(, "Есть ошибки в групповом счете
		|
		|ПЕЧАТЬ ОТМЕНЯЕТСЯ ...");
	
	Возврат;
КонецЕсли;		
	
ДанныеОбъект = Объект;	
ТабличныйДокумент = ПечатьСервер.ПечатьГрупповогоСчета(ДанныеОбъект);	
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

ПечатьКлиент.ОткрытьФормуПечатьСчетаИПодтверждения(ЭтаФорма, Объект.Ссылка, Неопределено, Объект.Контрагент
	, ТабличныйДокумент, Истина);
//ТабличныйДокумент.Показать("Счет");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАкта(Команда)
Ответ = ДокументыСервер.ПроверитьГрупповойСчет(Объект.Ссылка);

Если Ответ.ТекстОшибки <> "" Тогда 
	ПоказатьПредупреждение(, "Есть ошибки в групповом счете
		|
		|ПЕЧАТЬ ОТМЕНЯЕТСЯ ...");
	
	Возврат;
КонецЕсли;		
	
ДанныеОбъект = Объект;	
ТабличныйДокумент = ПечатьСервер.ПечатьГрупповогоАкта(ДанныеОбъект);	
Если ТабличныйДокумент = Неопределено Тогда Возврат; КонецЕсли;	

ТабличныйДокумент.Показать("Акт");
КонецПроцедуры

&НаКлиенте
Процедура Подтверждение(Команда)
Если ТекстОшибки <> "" Тогда
	ПоказатьПредупреждение(, "Есть ошибки в групповом счете
		|
		|ПЕЧАТЬ ОТМЕНЯЕТСЯ ...");
	
	Возврат;
КонецЕсли;	
	
ТабличныйДокумент = Неопределено;

Счет = Объект.Ссылка;
Контрагент = Объект.Контрагент;      
ПечатьКлиент.ОткрытьФормуПечатьСчетаИПодтверждения(ЭтаФорма, Счет, Неопределено, Контрагент
	, ТабличныйДокумент, Истина);
КонецПроцедуры
// - Печать

&НаКлиенте
Процедура Тест(Команда)
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора()
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетаФактуры(Команда)
Ответ = ДокументыСервер.ПроверитьГрупповойСчет(Объект.Ссылка);	
	
Если Ответ.ТекстОшибки <> "" Тогда
	ПоказатьПредупреждение(, "Есть ошибки в групповом счете
		|
		|ПЕЧАТЬ ОТМЕНЯЕТСЯ ...");
	
	Возврат;
КонецЕсли;	

Если Ответ.ТекстПредупреждения <> "" Тогда
	ПоказатьПредупреждение(, "ВНИМАНИЕ !!! " + Ответ.ТекстПредупреждения + "
		|
		|Счет-фактура выводится только на заявки со статусом 'Выехал'.");
	
	Возврат;
КонецЕсли;	

ДанныеОбъект = Объект;	
ТабДок = Новый ТабличныйДокумент;

ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(ДанныеОбъект);
Номер = ГрупповойСчетНомерДата.Номер;
Дата = ГрупповойСчетНомерДата.Дата;

ПечатьСервер.ПечатьГрупповогоСчетаФактуры(ТабДок, Номер, Дата, ДанныеОбъект);	
Если ТабДок = Неопределено Тогда Возврат; КонецЕсли;	

ТабДок.Показать("Счет-фактура");
КонецПроцедуры

&НаСервере
Функция ГрупповойСчетСчетаДетальноДолги(ГрупповойСчетОбъект)
МассивСчетаДетальноДолги = Новый Массив;

Заявки = ГрупповойСчетОбъект.ДокументыДолги.Выгрузить();
Заявки.Сортировать("ДокументДолг");

//
ТолькоПроживание = Ложь;
ТолькоУслуги = Ложь;


НомерСчета = ГрупповойСчетОбъект.НомерСчета;
ДатаСчета = ГрупповойСчетОбъект.ДатаСчета;

СчетГУИД = ГрупповойСчетОбъект.СчетГУИД;
//

сч = 0;
СуммаДляПечатиОбщая = 0;
Для Каждого СтрокаТаблицы Из Заявки Цикл
	ДокументДолг = СтрокаТаблицы.ДокументДолг;
	СчетГУИД = СтрокаТаблицы.СчетГУИД;
	
	ОтборСтроки = Новый Структура("СчетГУИД", СчетГУИД); 
	НайденныеСтроки = ДокументДолг.Счета.НайтиСтроки(ОтборСтроки); 
	Если НайденныеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли; 
	Счет = НайденныеСтроки[0]; 
	
	СчетаДетальноДолги_М = ДокументДолг.СчетаДетальноДолги.НайтиСтроки(ОтборСтроки); 
	
	Если ДокументДолг.Оплачивает.Турагентство Тогда
		Клиент = ДокументДолг.Клиент;	
		Клиент2 = ДокументДолг.Клиент2;
	Иначе
		Если Счет.РазделитьСчет Тогда
			Клиент = Счет.Клиент;	
			Клиент2 = Неопределено;
		Иначе
			Клиент = Счет.Клиент;	
			Клиент2 = ДокументДолг.Клиент2;
		КонецЕсли;
	КонецЕсли;

	ТоварКлиент = "" + Клиент;
	Если ЗначениеЗаполнено(Клиент2) Тогда 
		Если Клиент <> Клиент2 Тогда 
			ТоварКлиент = ТоварКлиент + ", " + Клиент2;
		КонецЕсли;
	КонецЕсли;
	ТоварКлиент = ТоварКлиент + ". ";
	
	Если НЕ ТолькоУслуги Тогда 
		Для каждого Строка Из СчетаДетальноДолги_М Цикл
			Если Строка.Услуга Тогда Продолжить; КонецЕсли;
		
			СтрокаСчетаДетальноДолги = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента(
							"ЗаявкаНаБронирование", "СчетаДетальноДолги");;
			ЗаполнитьЗначенияСвойств(СтрокаСчетаДетальноДолги, Строка);
			
			СтрокаСчетаДетальноДолги.НаименованиеДолг = ТоварКлиент + " " 
				+ СтрокаСчетаДетальноДолги.НаименованиеДолг;
			
			МассивСчетаДетальноДолги.Добавить(СтрокаСчетаДетальноДолги);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ТолькоПроживание Тогда 
		Для каждого Строка Из СчетаДетальноДолги_М Цикл
			Если НЕ Строка.Услуга Тогда Продолжить; КонецЕсли;
			
			СтрокаСчетаДетальноДолги = ОбщийФункционалСервер.СтруктураИзТабличнаяЧастьДокумента(
							"ЗаявкаНаБронирование", "СчетаДетальноДолги");;
			ЗаполнитьЗначенияСвойств(СтрокаСчетаДетальноДолги, Строка);
			
			НаименованиеТовара = ?(ЗначениеЗаполнено(Строка.НазваниеДляЧека)
				, Строка.НазваниеДляЧека, Строка.НаименованиеДолг);
			СтрокаСчетаДетальноДолги.НаименованиеДолг = ТоварКлиент + " " + НаименованиеТовара;
				
			МассивСчетаДетальноДолги.Добавить(СтрокаСчетаДетальноДолги);
		КонецЦикла; 
	КонецЕсли;
КонецЦикла;	

Возврат  МассивСчетаДетальноДолги;
КонецФункции

&НаКлиенте
Процедура ОтправкаАктаИСчетаФактуры(Команда)  
Ответ = ДокументыСервер.ПроверитьГрупповойСчет(Объект.Ссылка);

Если Ответ.ТекстОшибки <> "" Тогда 
	ПоказатьПредупреждение(, "Есть ошибки в групповом счете
		|
		|ПЕЧАТЬ ОТМЕНЯЕТСЯ ...");
	
	Возврат;
КонецЕсли;		
	
ДанныеОбъект = Объект;	
ТабДокАкт = ПечатьСервер.ПечатьГрупповогоАкта(ДанныеОбъект);	
//Если ТабДокАкт = Неопределено Тогда Возврат; КонецЕсли;	
	
ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(ДанныеОбъект);
Номер = ГрупповойСчетНомерДата.Номер;
Дата = ГрупповойСчетНомерДата.Дата;

ДокументАкт = "Акт " + Строка(Номер) + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");
	
ТабДокСчетФактура = Новый ТабличныйДокумент;

ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(ДанныеОбъект);
Номер = ГрупповойСчетНомерДата.Номер;
Дата = ГрупповойСчетНомерДата.Дата;

ПечатьСервер.ПечатьГрупповогоСчетаФактуры(ТабДокСчетФактура, Номер, Дата, ДанныеОбъект);	
//Если ТабДок = Неопределено Тогда Возврат; КонецЕсли;	

ДокументСчетФактура = "Счет-фактура " + Строка(Номер) + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");

//	
//	
//ТС = Элементы.Счета.ТекущаяСтрока;	
//Если ТС = Неопределено Тогда Возврат; КонецЕсли;

//ТД = Элементы.Счета.ТекущиеДанные;	

//ДанныеОбъект = Объект;
//ТабДокАкт = ПечатьСервер.ПечатьАктаСчетНаСервере(Ложь, ТС, ДанныеОбъект);	

//ДанныеОбъект = Объект;
//НомерАктаДатаАкта = ПечатьСервер.НомерДатаДокумента(ДанныеОбъект, ТД.НомерСчета, ТД.ДатаПо);
//НомерАкта = НомерАктаДатаАкта.Номер;
//ДатаАкта = НомерАктаДатаАкта.Дата;

//ДокументАкт = "Акт " + Строка(НомерАктаДатаАкта.Номер) + " от " + Формат(ДатаАкта, "ДФ=dd.MM.yyyy");

//ТабДокСчетФактура = ПечатьСервер.ПечатьСчетаФактураНаСервере(ТС, ДанныеОбъект);	

//ДокументСчетФактура = "Счет-фактура " + Строка(НомерАктаДатаАкта.Номер) + " от " + Формат(ДатаАкта, "ДФ=dd.MM.yyyy");

ПараметрыФормы = Новый Структура("ТабДокАкт, ТабДокСчетФактура, Контрагент, ДокументАкт, ДокументСчетФактура"
	 , ТабДокАкт, ТабДокСчетФактура, Объект.Контрагент, ДокументАкт, ДокументСчетФактура);
	 
ОткрытьФорму("ОбщаяФорма.ОтправкаАктаИСчетаФактуры", ПараметрыФормы,,,
	,,, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры

// 

&НаКлиенте
Процедура ПечатьУПД(Команда)
Ответ = ДокументыСервер.ПроверитьГрупповойСчет(Объект.Ссылка);	
	
Если Ответ.ТекстОшибки <> "" Тогда
	ПоказатьПредупреждение(, "Есть ошибки в групповом счете
		|
		|ПЕЧАТЬ ОТМЕНЯЕТСЯ ...");
	
	Возврат;
КонецЕсли;	

Если Ответ.ТекстПредупреждения <> "" Тогда
	ПоказатьПредупреждение(, "ВНИМАНИЕ !!! " + Ответ.ТекстПредупреждения + "
		|
		|УПД выводится только на заявки со статусом 'Выехал'.");
	
	Возврат;
КонецЕсли;	

ДанныеОбъект = Объект;	
ТабДок = Новый ТабличныйДокумент;

ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(ДанныеОбъект);
Номер = ГрупповойСчетНомерДата.Номер;
Дата = ГрупповойСчетНомерДата.Дата;

ПечатьСервер.ПечатьГрупповогоУПД(ТабДок, Номер, Дата, ДанныеОбъект);	
Если ТабДок = Неопределено Тогда Возврат; КонецЕсли;	

ТабДок.Показать("УПД");
КонецПроцедуры


&НаКлиенте
Процедура ОтправкаУПД(Команда) 
	
ДанныеОбъект = Объект;	
ТабДокУПД = Новый ТабличныйДокумент;

ГрупповойСчетНомерДата = ПечатьСервер.ГрупповойСчетНомерДата(ДанныеОбъект);
Номер = ГрупповойСчетНомерДата.Номер;
Дата = ГрупповойСчетНомерДата.Дата;

ПечатьСервер.ПечатьГрупповогоУПД(ТабДокУПД, Номер, Дата, ДанныеОбъект);	
Если ТабДокУПД = Неопределено Тогда Возврат; КонецЕсли;		

ДокументУПД = "УПД " + Строка(Номер) + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");



//ТС = Элементы.Счета.ТекущаяСтрока;	
//Если ТС = Неопределено Тогда Возврат; КонецЕсли;

//ТД = Элементы.Счета.ТекущиеДанные;	

//ДанныеОбъект = Объект;
//ТабДокУПД = ПечатьСервер.ПечатьУПДНаСервере(ТС, ДанныеОбъект);	

//ДанныеОбъект = Объект;
//НомерАктаДатаАкта = ПечатьСервер.НомерДатаДокумента(ДанныеОбъект, ТД.НомерСчета, ТД.ДатаПо);
//НомерАкта = НомерАктаДатаАкта.Номер;
//ДатаАкта = НомерАктаДатаАкта.Дата;

//ДокументУПД = "УПД " + Строка(НомерАктаДатаАкта.Номер) + " от " + Формат(ДатаАкта, "ДФ=dd.MM.yyyy");

//ТабДокСчетФактура = ПечатьСервер.ПечатьСчетаФактураНаСервере(ТС, ДанныеОбъект);	

//ДокументСчетФактура = "Счет-фактура " + Строка(НомерАктаДатаАкта.Номер) + " от " + Формат(ДатаАкта, "ДФ=dd.MM.yyyy");

ПараметрыФормы = Новый Структура("ТабДокУПД, Контрагент, ДокументУПД"
	 , ТабДокУПД, Объект.Контрагент, ДокументУПД);
	 
ОткрытьФорму("ОбщаяФорма.ОтправкаУПД", ПараметрыФормы,,,
	,,, РежимОткрытияОкнаФормы.Независимый); 
КонецПроцедуры

// +++++++++++++++++++++++++++++++++++


