//
//ТекущийРодитель = "";
//ОбщийФункционалСервер.ПолнаяПапкаРодитель(Объект.Ссылка, ТекущийРодитель);
//ПолнаяПапкаРодитель = ТекущийРодитель;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ИННОтбор", ИННОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Если ИННОтбор <> "" Тогда
	ОтборПоИНН(Неопределено);		
КонецЕсли;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтборПоИНН(Команда)
ОтборКлиентов();
КонецПроцедуры

&НаСервере
Процедура ОтборКлиентов()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Клиент,
                      |	Клиенты.ИНН КАК ИНН,
                      |	Клиенты.КПП КАК КПП,
                      |	Клиенты.ПометкаУдаления КАК ПометкаУдаления,
                      |	Заявки.ЗаявкиКоличество КАК ЗаявкиКоличество,
                      |	ГрупповыеСчета.ГрупповыеСчетаКоличество КАК ГрупповыеСчетаКоличество,
                      |	Выписки.ВыпискиКоличество КАК ВыпискиКоличество
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК ЗаявкиКоличество
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронирование.Оплачивает) КАК Заявки
                      |		ПО Клиенты.Ссылка = Заявки.Оплачивает
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчета.Контрагент КАК Контрагент,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчета.Ссылка) КАК ГрупповыеСчетаКоличество
                      |		ИЗ
                      |			Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчета.Контрагент) КАК ГрупповыеСчета
                      |		ПО Клиенты.Ссылка = ГрупповыеСчета.Контрагент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ОтКого КАК ОтКого,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыпискаБанка.Ссылка) КАК ВыпискиКоличество
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ОтКого) КАК Выписки
                      |		ПО Клиенты.Ссылка = Выписки.ОтКого
                      |ГДЕ
                      |	Клиенты.ИНН = &ИНН
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Клиенты.Наименование");

Запрос.УстановитьПараметр("ИНН", ИННОтбор);
ТЗ = Запрос.Выполнить().Выгрузить();

ТаблицаОтбор.Очистить();
Для Каждого Строка Из ТЗ Цикл
	НоваяСтрока = ТаблицаОтбор.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	ТекущийРодитель = "";
	ОбщийФункционалСервер.ПолнаяПапкаРодитель(Строка.Клиент, ТекущийРодитель);
	НоваяСтрока.ПолнаяПапкаРодитель = ТекущийРодитель;
	
КонецЦикла;

КонецПроцедуры
//

//
&НаКлиенте
Процедура ДобавитьКлиента(Команда)
ПараметрыФормы = Новый Структура();	
//ПараметрыФормы.Вставить("РежимВыбора", Истина);
ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);

ОткрытьФорму("Обработка.КлиентыОбъединиение.Форма.ФормаВыбораКлиентов", ПараметрыФормы, Элементы.ТаблицаОтбор
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

ТаблицаОтборОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ТаблицаОтборОбработкаВыбораНаСервере(ВыбранноеЗначение)
ОтборСтроки = Новый Структура("Клиент", ВыбранноеЗначение);	
НайденныеСтроки = ТаблицаОтбор.НайтиСтроки(ОтборСтроки);
Если НайденныеСтроки.Количество() > 0 Тогда Возврат; КонецЕсли; 

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	Клиенты.Ссылка КАК Клиент,
                      |	Клиенты.ИНН КАК ИНН,
                      |	Клиенты.КПП КАК КПП,
                      |	Клиенты.ПометкаУдаления КАК ПометкаУдаления,
                      |	Заявки.ЗаявкиКоличество КАК ЗаявкиКоличество,
                      |	ГрупповыеСчета.ГрупповыеСчетаКоличество КАК ГрупповыеСчетаКоличество,
                      |	Выписки.ВыпискиКоличество КАК ВыпискиКоличество
                      |ИЗ
                      |	Справочник.Клиенты КАК Клиенты
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ЗаявкаНаБронирование.Оплачивает КАК Оплачивает,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаБронирование.Ссылка) КАК ЗаявкиКоличество
                      |		ИЗ
                      |			Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЗаявкаНаБронирование.Оплачивает) КАК Заявки
                      |		ПО Клиенты.Ссылка = Заявки.Оплачивает
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГрупповыеСчета.Контрагент КАК Контрагент,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрупповыеСчета.Ссылка) КАК ГрупповыеСчетаКоличество
                      |		ИЗ
                      |			Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ГрупповыеСчета.Контрагент) КАК ГрупповыеСчета
                      |		ПО Клиенты.Ссылка = ГрупповыеСчета.Контрагент
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ВыпискаБанка.ОтКого КАК ОтКого,
                      |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыпискаБанка.Ссылка) КАК ВыпискиКоличество
                      |		ИЗ
                      |			Документ.ВыпискаБанка КАК ВыпискаБанка
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ВыпискаБанка.ОтКого) КАК Выписки
                      |		ПО Клиенты.Ссылка = Выписки.ОтКого
                      |ГДЕ
                      |	Клиенты.Ссылка = &Ссылка");

Запрос.УстановитьПараметр("Ссылка", ВыбранноеЗначение);
ТЗ = Запрос.Выполнить().Выгрузить();
СтрокаТЗ = ТЗ[0];

НоваяСтрока = ТаблицаОтбор.Добавить();
НоваяСтрока.Клиент = СтрокаТЗ.Клиент;

НоваяСтрока.ИНН = СтрокаТЗ.ИНН;
НоваяСтрока.КПП = СтрокаТЗ.КПП;
НоваяСтрока.ПометкаУдаления = СтрокаТЗ.ПометкаУдаления;

ТекущийРодитель = "";
ОбщийФункционалСервер.ПолнаяПапкаРодитель(СтрокаТЗ.Клиент, ТекущийРодитель);
НоваяСтрока.ПолнаяПапкаРодитель = ТекущийРодитель;

НоваяСтрока.ЗаявкиКоличество = СтрокаТЗ.ЗаявкиКоличество;
НоваяСтрока.ГрупповыеСчетаКоличество = СтрокаТЗ.ГрупповыеСчетаКоличество;
НоваяСтрока.ВыпискиКоличество = СтрокаТЗ.ВыпискиКоличество;
КонецПроцедуры
//

//
&НаКлиенте
Процедура УстановитьКлиентРезультат(Команда)
ТД = Элементы.ТаблицаОтбор.ТекущиеДанные;
Если ТД = Неопределено Тогда Возврат; КонецЕсли;

ТД.Отметка = Ложь;
КлиентРезультат = ТД.Клиент;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбъединитьКлиентов(Команда)
Если НЕ ЗначениеЗаполнено(КлиентРезультат) Тогда Возврат; КонецЕсли;
	
Оповещение = Новый ОписаниеОповещения("ЗавершениеВопросаПодтвердитеОбъединениеКлиентов", ЭтаФорма);	
ПоказатьВопрос(Оповещение, "Подтвердите объединение клиентов
|
|Клиент результат: " + КлиентРезультат, РежимДиалогаВопрос.ОКОтмена); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВопросаПодтвердитеОбъединениеКлиентов(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодвозвратаДиалога.Отмена Тогда Возврат; КонецЕсли;	

ТД = Элементы.ТаблицаОтбор.ТекущиеДанные;
Для Каждого Строка Из ТаблицаОтбор Цикл
	Если ТД.Клиент = КлиентРезультат Тогда ТД.Отметка = Ложь; КонецЕсли;
КонецЦикла;

ОбъединитьКлиентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъединитьКлиентовНаСервере()
НачатьТранзакцию();

Для Каждого Строка Из ТаблицаОтбор Цикл
	Если НЕ Строка.Отметка Тогда Продолжить; КонецЕсли;
	
	Результат = ЗаменитьКлиента(Строка.Клиент);
	Сообщить("Заменено в заявках: " + Результат.ЗамененоЗаявки 
			+ ", заменено в групповых счетах: " + Результат.ЗамененоГрупповыеСчета 
			+ ", заменено в выписках: " + Результат.ЗамененоВыписки);  
	           
КонецЦикла;

ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере
Функция ЗаменитьКлиента(Контрагент)
// + Заявки

//Запрос = Новый Запрос("ВЫБРАТЬ
//                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
//                      |ИЗ
//                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
//                      |ГДЕ
//                      |	(ЗаявкаНаБронирование.Оплачивает = &Контрагент
//                      |			ИЛИ ЗаявкаНаБронирование.Клиент = &Контрагент
//                      |			ИЛИ ЗаявкаНаБронирование.Бронирует = &Контрагент)");

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Счета КАК ЗаявкаНаБронированиеСчета
                      |		ПО ЗаявкаНаБронирование.Ссылка = ЗаявкаНаБронированиеСчета.Ссылка
                      |ГДЕ
                      |	(ЗаявкаНаБронирование.Оплачивает = &Контрагент
                      |			ИЛИ ЗаявкаНаБронирование.Клиент = &Контрагент
                      |			ИЛИ ЗаявкаНаБронирование.Бронирует = &Контрагент
                      |			ИЛИ ЗаявкаНаБронирование.Турагентство = &Контрагент
                      |			ИЛИ ЗаявкаНаБронированиеСчета.Клиент = &Контрагент
                      |			ИЛИ ЗаявкаНаБронированиеСчета.Контрагент = &Контрагент)
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЗаявкаНаБронирование.Ссылка");

Запрос.УстановитьПараметр("Контрагент", Контрагент); 
ТЗ = Запрос.Выполнить().Выгрузить();

ЗамененоЗаявки = 0;
Для Каждого Строка Из ТЗ Цикл
	ЗаявкаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	Если ЗаявкаОбъект.Бронирует = Контрагент Тогда 
		ЗаявкаОбъект.Бронирует = КлиентРезультат;
 	КонецЕсли;	
	
	Если ЗаявкаОбъект.Турагентство = Контрагент Тогда 
		ЗаявкаОбъект.Турагентство = КлиентРезультат;
 	КонецЕсли;	
	
	Оплачивает_OldValue = ЗаявкаОбъект.Оплачивает;
	Если ЗаявкаОбъект.Оплачивает = Контрагент Тогда 
		ЗаявкаОбъект.Оплачивает = КлиентРезультат;
 	КонецЕсли;	
	
	Клиент_OldValue = ЗаявкаОбъект.Клиент;
	Если ЗаявкаОбъект.Клиент = Контрагент Тогда 
		ЗаявкаОбъект.Клиент = КлиентРезультат;
 	КонецЕсли;	
	
	Для Каждого Счет Из ЗаявкаОбъект.Счета Цикл
		Если Счет.Контрагент = Контрагент Тогда 
			Счет.Контрагент = КлиентРезультат;
		КонецЕсли;
		
		Если Счет.Клиент = Контрагент Тогда 
			Счет.Клиент = КлиентРезультат;
		КонецЕсли;
	КонецЦикла;
	
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗамененоЗаявки = ЗамененоЗаявки + 1;
КонецЦикла;
	
НаборЗаписей = РегистрыСведений.ИсторияКлиента.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.Клиент.Установить(Контрагент);    
НаборЗаписей.Прочитать();

МенеджерЗаписи = РегистрыСведений.ИсторияКлиента.СоздатьМенеджерЗаписи();
Для Каждого ТекЗапись Из НаборЗаписей Цикл
    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекЗапись);
    МенеджерЗаписи.Прочитать();
    МенеджерЗаписи.Клиент = КлиентРезультат;
    МенеджерЗаписи.Записать();
КонецЦикла;

НаборЗаписей = РегистрыСведений.ИсторияКлиентаДопПожелания.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.Клиент.Установить(Контрагент);    
НаборЗаписей.Прочитать();

МенеджерЗаписи = РегистрыСведений.ИсторияКлиентаДопПожелания.СоздатьМенеджерЗаписи();
Для Каждого ТекЗапись Из НаборЗаписей Цикл
    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекЗапись);
    МенеджерЗаписи.Прочитать();
    МенеджерЗаписи.Контрагент = КлиентРезультат;
    МенеджерЗаписи.Записать();
КонецЦикла;
// - Заявки


// + Групповые Счета
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГрупповыеСчета.Ссылка КАК Ссылка
                      |ИЗ
                      |	Документ.ГрупповыеСчета КАК ГрупповыеСчета
                      |ГДЕ
                      |	ГрупповыеСчета.ПометкаУдаления = ЛОЖЬ
                      |	И ГрупповыеСчета.Контрагент = &Контрагент");

Запрос.УстановитьПараметр("Контрагент", Контрагент); 
ТЗ = Запрос.Выполнить().Выгрузить();

ЗамененоГрупповыеСчета = 0;
Для Каждого Строка Из ТЗ Цикл
	ГрупповойСчетОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	ГрупповойСчетОбъект.Контрагент = КлиентРезультат;
	
	ГрупповойСчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗамененоГрупповыеСчета = ЗамененоГрупповыеСчета + 1;
КонецЦикла;
// - Групповые Счета

//// + Рабочие места Счета
//Запрос = Новый Запрос("ВЫБРАТЬ
//                      |	РабочееМестоСчета.Ссылка КАК Ссылка
//                      |ИЗ
//                      |	Документ.РабочееМестоСчета КАК РабочееМестоСчета
//                      |ГДЕ
//                      |	РабочееМестоСчета.ПометкаУдаления = ЛОЖЬ
//                      |	И (РабочееМестоСчета.Клиент = &Клиент
//                      |			ИЛИ РабочееМестоСчета.Оплачивает = &Клиент)");

//Запрос.УстановитьПараметр("Клиент", Клиент); 
//ТЗ = Запрос.Выполнить().Выгрузить();

//ЗамененоРабочиеМестаСчета = 0;
//Для Каждого Строка Из ТЗ Цикл
//	РабочееМестоСчетаОбъект = Строка.Ссылка.ПолучитьОбъект();
//	
//	Если РабочееМестоСчетаОбъект.Клиент = Клиент Тогда 
//		РабочееМестоСчетаОбъект.Клиент = КлиентРезультат;
//	КонецЕсли;	
//	
//	Если РабочееМестоСчетаОбъект.Оплачивает = Клиент Тогда 
//		РабочееМестоСчетаОбъект.Оплачивает = КлиентРезультат;
//	КонецЕсли;
//	
//	РабочееМестоСчетаОбъект.Записать(РежимЗаписиДокумента.Проведение);
//	
//	Если РабочееМестоСчетаОбъект.Клиент = Клиент ИЛИ РабочееМестоСчетаОбъект.Оплачивает = Клиент Тогда 
//		ЗамененоРабочееМестоСчета = ЗамененоРабочееМестоСчета + 1;
//	КонецЕсли;
//КонецЦикла;
//// - Рабочие места  Счета


// + Выписки
ЗамененоВыписки = 0;
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ВыпискаБанка.Ссылка КАК Ссылка 
                      |ИЗ
                      |	Документ.ВыпискаБанка КАК ВыпискаБанка
                      |ГДЕ
                      |	ВыпискаБанка.ОтКого = &ОтКого");

Запрос.УстановитьПараметр("ОтКого", Контрагент); 
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ВыпискаОбъект = Строка.Ссылка.ПолучитьОбъект();
	
	ВыпискаОбъект.ОтКого = КлиентРезультат;
	
	ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗамененоВыписки = ЗамененоВыписки + 1;
КонецЦикла;
// - Выписки

МассивСсылок = Новый Массив;
МассивСсылок.Добавить(Контрагент);
ТаблицаСсылок = НайтиПоСсылкам(МассивСсылок);
Для Каждого Ссылка из ТаблицаСсылок Цикл
	Сообщить ("Есть ссылка на клиента: " + Контрагент + ", ссылка: " + СокрЛП(Ссылка[0]) + " " + СокрЛП(Ссылка[1]));
КонецЦикла;

Если ТаблицаСсылок.Количество() = 0 Тогда
	КлиентОбъект = Контрагент.ПолучитьОбъект();
	КлиентОбъект.ПометкаУдаления=Истина;
	
	КлиентОбъект.Записать();
КонецЕсли;

Результат = Новый Структура("ЗамененоЗаявки, ЗамененоГрупповыеСчета, ЗамененоВыписки"
	, ЗамененоЗаявки, ЗамененоГрупповыеСчета, ЗамененоВыписки); 
Возврат Результат;
КонецФункции
//

&НаКлиенте
Процедура ТаблицаОтборОтметкаПриИзменении(Элемент)
ТД = Элементы.ТаблицаОтбор.ТекущиеДанные;	

Если ТД.Клиент = КлиентРезультат Тогда ТД.Отметка = Ложь; КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборПередУдалением(Элемент, Отказ)
//Отказ = Истина;
КонецПроцедуры




