
////
Функция ТекущийКаталогФТП()
Возврат "/exchange1c";	
КонецФункции	
////

//
Функция ПолучитьДанныеУзлаОбмена(КодУзлаОбмена) Экспорт 
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГостиницыНастройкиОбмена.КодУзлаОбмена КАК КодУзлаОбмена,
                      |	ГостиницыНастройкиОбмена.АдресФТП КАК АдресФТП,
                      |	ГостиницыНастройкиОбмена.ИмяПользователя КАК ИмяПользователя,
                      |	ГостиницыНастройкиОбмена.Пароль КАК Пароль,
                      |	ГостиницыНастройкиОбмена.КаталогОбменаFTP КАК КаталогОбменаFTP
                      |ИЗ
                      |	РегистрСведений.ГостиницыНастройкиОбмена КАК ГостиницыНастройкиОбмена
                      |ГДЕ
                      |	ГостиницыНастройкиОбмена.КодУзлаОбмена = &КодУзлаОбмена");

Запрос.УстановитьПараметр("КодУзлаОбмена", КодУзлаОбмена);

ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	Возврат Неопределено;
Иначе
	Возврат ТЗ[0];
КонецЕсли;
КонецФункции

Функция ПолучитьИмяФайлаОбменаФТП(УзелИсточник, УзелПриемник, КаталогОбменаFTP) Экспорт
// Сформировать полное имя файла обмена.
ИмяФайла = КаталогОбменаFTP + "Message_" + СокрЛП(УзелИсточник.Код) 
	+ "_" + СокрЛП(УзелПриемник.Код) + ".xml";

Возврат ИмяФайла;
КонецФункции

Функция ПолучитьИмяФайлаОбмена_Пример(УзелИсточник, УзелПриемник) Экспорт
// Сформировать полное имя файла обмена.
Каталог = Константы.КаталогОбмена_ДляТеста.Получить();
ИмяФайла = Каталог + ?(Прав(Каталог, 1) = "\","", "\") + "Message_" +
	СокрЛП(УзелИсточник.Код) + "_" + СокрЛП(УзелПриемник.Код) + ".xml";

Возврат ИмяФайла;
КонецФункции
//

//
Функция ЗаписатьФТПФайл_TECT(Источник, Получатель) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	

КопироватьФайл(Источник,Получатель);

Возврат Результат;
КонецФункции

Функция ЗаписатьФТПФайл(Источник, Получатель, АдресФТП, ИмяПользователя, Пароль) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	

Ответ = ПодключитьсяКFTPСерверу(АдресФТП, ИмяПользователя, Пароль);
Если Ответ.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = Ответ.КодОшибки;
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
	
	Возврат Результат; 
КонецЕсли;

Соединение = Ответ.Соединение;
Попытка	
	ТекущийКаталогФТП = ТекущийКаталогФТП();
	Соединение.УстановитьТекущийКаталог(ТекущийКаталогФТП);
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -2;
	Результат.ОписаниеОшибки = "Ошибка установки текущего каталога: " + ОписаниеОшибки();
	
	Возврат Результат; 
КонецПопытки;

Попытка	
	Соединение.Записать(
	        Источник, // что записываем
	        Получатель);  
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 10;
	Результат.ОписаниеОшибки = "Ошибка записи файла: " + ОписаниеОшибки();
	
	Возврат Результат; 
КонецПопытки;

Возврат Результат;
КонецФункции
//

//

Функция ПолучитьФТПФайл_TECT(Источник, Получатель, АдресФТП, ИмяПользователя, Пароль) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	

КопироватьФайл(Источник,Получатель);

Возврат Результат;
КонецФункции

Функция ПолучитьФТПФайл(Источник, Получатель, АдресФТП, ИмяПользователя, Пароль) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	

Ответ = ПодключитьсяКFTPСерверу(АдресФТП, ИмяПользователя, Пароль);
Если Ответ.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = Ответ.КодОшибки;
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
	
	Возврат Результат; 
КонецЕсли;

Соединение = Ответ.Соединение;
Попытка	
	ТекущийКаталогФТП = ТекущийКаталогФТП();
	Соединение.УстановитьТекущийКаталог(ТекущийКаталогФТП);
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -2;
	Результат.ОписаниеОшибки = "Ошибка установки текущего каталога: " + ОписаниеОшибки();
	
	Возврат Результат; 
КонецПопытки;

Источник_П = СтрЗаменить(Источник, "\", "/");
Массив = Соединение.НайтиФайлы(Источник_П);
Если Массив.Количество() = 0 Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 1;
	Результат.ОписаниеОшибки = "Файл с полученными данными не найден";
	
	Возврат Результат;
КонецЕсли;

Попытка	
	Соединение.Получить(
         Источник, // что качаем
         Получатель // куда качаем
    );
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 20;
	Результат.ОписаниеОшибки = "Ошибка получения файла: " + ОписаниеОшибки();
КонецПопытки;

Возврат Результат;
КонецФункции
//


Функция УдалитьФТПФайл(ИмяФайла, АдресФТП, ИмяПользователя, Пароль) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	

Ответ = ПодключитьсяКFTPСерверу(АдресФТП, ИмяПользователя, Пароль);
Если Ответ.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = Ответ.КодОшибки;
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
	
	Возврат Результат; 
КонецЕсли;

Соединение = Ответ.Соединение;
Попытка	
	ТекущийКаталогФТП = ТекущийКаталогФТП();
	Соединение.УстановитьТекущийКаталог(ТекущийКаталогФТП);
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -2;
	Результат.ОписаниеОшибки = "Ошибка установки текущего каталога: " + ОписаниеОшибки();
	
	Возврат Результат; 
КонецПопытки;

Попытка	
	ИмяФайла_П = СтрЗаменить(ИмяФайла, "\", "/");

	Соединение.Удалить(ИмяФайла_П);
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 30;
	Результат.ОписаниеОшибки = "Ошибка удаления файла: " + ОписаниеОшибки();
КонецПопытки;

Возврат Результат;
КонецФункции

//
Функция ПодключитьсяКFTPСерверу(АдресФТП, ИмяПользователя, ПарольПользователя) Экспорт
	
//Соединение = Новый FTPСоединение(
//    "212.176.32.173", // адрес ftp сервера
//    21, // порт сервера
//    "INVINA/streg", // имя пользователя
//    "mnbvcxz*279", // пароль пользователя
//    Неопределено, // прокси не используется
//    Истина, // пассивный режим работы
//    0, // таймаут (0 - без ограничений)
//    Неопределено // незащищенное соединение
//);
 
// Для случаев, когда у ftp сервера нет возможности
// обращаться к нам (мы находимся за межсетевым экраном)
// следует использовать пассивный режим работы.
////////////////////////////////////////////////////////

 
Результат = Новый Структура("Соединение, Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");
Попытка 
	Соединение = Новый FTPСоединение(
	    АдресФТП, // адрес ftp сервера
	    21, // порт сервера
	    ИмяПользователя, // имя пользователя
		ПарольПользователя, // пароль пользователя
	    Неопределено, // прокси не используется
	    Истина, // пассивный режим работы
	    5, // таймаут (0 - без ограничений)
	    Неопределено // незащищенное соединение
	);
	
	Результат.Соединение = Соединение; 
Исключение
	Результат.Соединение = Соединение; 
	
	Результат.Ошибка = Истина; 
	Результат.КодОшибки = -1; 
	
	Результат.ОписаниеОшибки = "Ошибка открытия соединения: " + ОписаниеОшибки(); 
КонецПопытки;

Возврат Результат;
КонецФункции
//

//
Функция ЗаписатьФТПФайлВКаталог(Источник, Получатель, КаталогФТП, АдресФТП, ИмяПользователя, Пароль) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	

Ответ = ПодключитьсяКFTPСерверу(АдресФТП, ИмяПользователя, Пароль);
Если Ответ.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = Ответ.КодОшибки;
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
	
	Возврат Результат; 
КонецЕсли;

Соединение = Ответ.Соединение;
Попытка	
	Соединение.УстановитьТекущийКаталог(КаталогФТП);
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -2;
	Результат.ОписаниеОшибки = "Ошибка установки текущего каталога: " + ОписаниеОшибки();
	
	Возврат Результат; 
КонецПопытки;
	
Попытка	
	Соединение.Записать(
	        Источник, // что записываем
	        Получатель);  
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 10;
	Результат.ОписаниеОшибки = "Ошибка записи файла: " + ОписаниеОшибки();
	
	Возврат Результат; 
КонецПопытки;

Возврат Результат;
КонецФункции

Функция ПолучитьФТПФайлИзКаталога(Источник, Получатель, КаталогФТП, АдресФТП, ИмяПользователя, Пароль) Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	

Ответ = ПодключитьсяКFTPСерверу(АдресФТП, ИмяПользователя, Пароль);
Если Ответ.Ошибка Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = Ответ.КодОшибки;
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
	
	Возврат Результат; 
КонецЕсли;

Соединение = Ответ.Соединение;
Попытка	
	Соединение.УстановитьТекущийКаталог(КаталогФТП);
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -2;
	Результат.ОписаниеОшибки = "Ошибка установки текущего каталога: " + ОписаниеОшибки();
	
	Возврат Результат; 
КонецПопытки;

Источник_П = СтрЗаменить(Источник, "\", "/");
Массив = Соединение.НайтиФайлы(Источник_П);
Если Массив.Количество() = 0 Тогда 
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 1;
	Результат.ОписаниеОшибки = "Файл с полученными данными не найден";
	
		Возврат Результат;
КонецЕсли;

Попытка	
	Соединение.Получить(
         Источник, // что качаем
         Получатель // куда качаем
    );
Исключение
	Результат.Ошибка = Истина;
	Результат.КодОшибки = 20;
	Результат.ОписаниеОшибки = "Ошибка получения файла: " + ОписаниеОшибки();
КонецПопытки;
 
Возврат Результат;
КонецФункции

// ++++++++++++++++++++++++
//
