
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТолькоНовые = Истина;	

Список.Параметры.УстановитьЗначениеПараметра("ТолькоНовые", ТолькоНовые); 
	
УсловноеОформлениеУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоНовыеПриИзменении(Элемент)
Список.Параметры.УстановитьЗначениеПараметра("ТолькоНовые", ТолькоНовые);
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеУстановить() 
УО = ЭтаФорма.УсловноеОформление; 
УО.Элементы.Очистить(); 

ЭлементУО = УО.Элементы.Добавить(); 
УсловноеОформлениеПолеДобавить(ЭлементУО, "Список", "Список.ЕстьЗаявкаНаБронирование", Истина, ВидСравненияКомпоновкиДанных.Равно);
ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеПолеДобавить(ЭлементУО, ИмяПоля, ИмяЛевогоЗначения, ПравоеЗначение, ВидСравнения) 
    
Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить(); 
Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
Оформляемоеполе.Использование = ИСТИНА;  

ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементУсловия.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных(ИмяЛевогоЗначения);
ЭлементУсловия.ПравоеЗначение = ПравоеЗначение;
ЭлементУсловия.ВидСравнения    = ВидСравнения;   
ЭлементУсловия.Использование   = Истина;    
        
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьБронирования(Команда)
Если ПроверитьДаты()  Тогда Возврат; КонецЕсли;

ЗагрузитьБронированияНаСервере(ДатаБронированияС, ДатаБронированияПо);

Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДаты()
Если НЕ (ЗначениеЗаполнено(ДатаБронированияС) И ЗначениеЗаполнено(ДатаБронированияПо)) Тогда Возврат Истина; КонецЕсли; 	

Если ДатаБронированияС > ДатаБронированияПо Тогда
	ПоказатьПредупреждение(, "Дата бронирования с > Дата бронирования по");
	Возврат Истина; 
КонецЕсли;

Возврат Ложь;
КонецФункции

&НаСервере
Процедура ЗагрузитьБронированияНаСервере(ДатаС, ДатаПо)
АдресСервера = АдресСервера();	
Если АдресСервера = "" Тогда Возврат; КонецЕсли;

ДанныеБронирования = ОбменСайт.ПолучитьДанныеБронирования(АдресСервера, ДатаС, ДатаПо);  

Если ДанныеБронирования.Ошибка Тогда 
	Сообщить(ДанныеБронирования.ОписаниеОшибки);
	Возврат;
КонецЕсли;

МассивДанных = ДанныеБронирования.ДанныеJSON;
Для Каждого Строка Из МассивДанных Цикл
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаСайт.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ЗаявкаСайт КАК ЗаявкаСайт
	                      |ГДЕ
	                      |	ЗаявкаСайт.ИДСайт = &ИДСайт");
	
	Запрос.УстановитьПараметр("ИДСайт", Строка.id); 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаявкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
	    ЗаявкаОбъект.ДатаОбновления = ТекущаяДата();
	Иначе
		ЗаявкаОбъект = Документы.ЗаявкаСайт.СоздатьДокумент();
	    ЗаявкаОбъект.Дата = ТекущаяДата();
	    ЗаявкаОбъект.ИДСайт = Строка.id;
	    ЗаявкаОбъект.ДатаЗагрузки = ТекущаяДата();
	КонецЕсли;
	
	ТекстОшибки = "";
	ТекстОшибкиДополнительно = "";
	
    ЗаявкаОбъект.ДатаБронирования = ДатаИзСтроки(Строка.ДатаБронирования);
	
	//ЗаявкаОбъект.ДатаЗаезда = Строка.ДатаЗаезда;
	ДатаИзСтроки = ДатаИзСтроки(Строка.ДатаЗаезда);
	Если ЗначениеЗаполнено(ДатаИзСтроки) Тогда
		ЗаявкаОбъект.ДатаЗаезда = ДатаИзСтроки;
	Иначе	
		ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки
			, "Ошибка в дате заезда: " + Строка.ДатаЗаезда, Символы.ПС);
	КонецЕсли;
	
	ВремяЗаездаВыезда = ВремяЗаездаВыезда("ВремяЗаезда", Строка.ДатаЗаезда); 
	Если ЗначениеЗаполнено(ВремяЗаездаВыезда) Тогда
		ЗаявкаОбъект.ВремяЗаезда = ВремяЗаездаВыезда;
	Иначе	
		ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки
			, "Ошибка в дате заезда (время заезда): " + Строка.ДатаЗаезда, Символы.ПС);
	КонецЕсли;
	
	//ЗаявкаОбъект.ДатаВыезда = Строка.ДатаВыезда;           
	ДатаИзСтроки = ДатаИзСтроки(Строка.ДатаВыезда);
	Если ЗначениеЗаполнено(ДатаИзСтроки) Тогда
		ЗаявкаОбъект.ДатаВыезда = ДатаИзСтроки;
	Иначе	
		ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки
			, "Ошибка в дате выезда: " + Строка.ДатаВыезда, Символы.ПС);
	КонецЕсли;
	
	ВремяЗаездаВыезда = ВремяЗаездаВыезда("ВремяВыезда", Строка.ДатаВыезда); 
	Если ЗначениеЗаполнено(ВремяЗаездаВыезда) Тогда
		ЗаявкаОбъект.ВремяВыезда = ВремяЗаездаВыезда;
	Иначе	
		ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки
			, "Ошибка в дате выезда (время выезда): " + Строка.ДатаВыезда, Символы.ПС);
	КонецЕсли;
	

	ЗаявкаОбъект.Имя = Строка.Имя;
	ЗаявкаОбъект.Фамилия = Строка.Фамилия;
	Если ЗначениеЗаполнено(СокрЛП(Строка.Имя + Строка.Фамилия)) Тогда 
		ЗаявкаОбъект.Имя = Строка.Имя;
		ЗаявкаОбъект.Фамилия = Строка.Фамилия;
	Иначе
		ТекстОшибки = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки
			, "Фамилия и Имя - пусто", Символы.ПС);
	КонецЕсли;

	ЗаявкаОбъект.Телефон = Строка.Телефон;
	
	ЗаявкаОбъект.КатегорияНомераСайт = Строка.КатегорияНомера;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КатегорииНомеровСайт.КатегорияНомера КАК КатегорияНомера
	                      |ИЗ
	                      |	Справочник.КатегорииНомеровСайт КАК КатегорииНомеровСайт
	                      |ГДЕ
	                      |	КатегорииНомеровСайт.ПометкаУдаления = ЛОЖЬ
	                      |	И КатегорииНомеровСайт.КатегорияНомераСайт = &КатегорияНомераСайт");

	Запрос.УстановитьПараметр("КатегорияНомераСайт", Строка.КатегорияНомера);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда
		ЗаявкаОбъект.КатегорияНомера = ТЗ[0].КатегорияНомера;
	Иначе
		ТекстОшибкиДополнительно = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибкиДополнительно
					, "Не найдена категория номера " + Строка.КатегорияНомера, Символы.ПС);
	КонецЕсли;
	
	ЗаявкаОбъект.Одноместный = (Строка.МестВНомере = 1);
	
	ЗаявкаОбъект.РаздельныеКровати = (Строка.РаздельныеКровати = 2);
	ЗаявкаОбъект.Завтрак = (Строка.Завтрак = 1);
	
	ЗаявкаОбъект.КоличествоЧеловек = Строка.ПланируемоеКоличествоПроживающих;
	
	ЗаявкаОбъект.Комментарий = Строка.Комментарий;
	
	ЗаявкаОбъект.СуммаОплаченнаяКлиентом = Строка.СуммаОплаченнаяКлиентом;
	ЗаявкаОбъект.Тариф = Строка.Тариф;
	ЗаявкаОбъект.ТипОплаты = Строка.ТипОплаты;
	//ЗаявкаОбъект.ФлагОплаты = Строка.ФлагОплаты;
	
	ЗаявкаОбъект.ОбщаяСтоимостьПроживания = Строка.ОбщаяСтоимостьПроживания;
	
	СтоимостьПроживанияПоДням = Строка.СтоимостьПроживанияПоДням; 
	Проживание = ЗаявкаОбъект.Проживание;
	Для Каждого СтрокаПроживание Из СтоимостьПроживанияПоДням Цикл
		НоваяСтрока = Проживание.Добавить();
		
		ДатаИзСтроки = ДатаИзСтроки(СтрокаПроживание.ДатаПроживания);
		Если ЗначениеЗаполнено(ДатаИзСтроки) Тогда
			НоваяСтрока.ДатаПроживания = ДатаИзСтроки;
		Иначе	
			ТекстОшибкиДополнительно = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибкиДополнительно
				, "Ошибка в дате проживания: " + СтрокаПроживание.ДатаПроживания, Символы.ПС);
				
			Продолжить;
		КонецЕсли;

		НоваяСтрока.ДатаПроживания = ДатаИзСтроки;
		НоваяСтрока.СуммаЗаДень = СтрокаПроживание.СуммаЗаДень;
	КонецЦикла;
	
	ЗаявкаОбъект.EMail = Строка.EMail;
	
	//ТекстОшибки = "ТекстОшибки";
	//ТекстОшибкиДополнительно = "ТекстОшибкиДополнительно";
	
	ТекстСообщения = "";
	Если ТекстОшибки = "" Тогда
		Если ТекстОшибкиДополнительно <> "" Тогда
			ТекстСообщения = ТекстОшибкиДополнительно;
		КонецЕсли;
	Иначе
		ТекстСообщения = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТекстОшибки   
			, ТекстОшибкиДополнительно, Символы.ПС);
	КонецЕсли;
	Если ТекстСообщения <> "" Тогда 	
		ТекстСообщения = "Заявка от " + Строка.ДатаБронирования	+ " " + Строка.Фамилия + " " + Строка.Имя
			+ " содержит ошибки:" + Символы.ПС +ТекстСообщения; 
		Сообщить(ТекстСообщения);
	КонецЕсли;
	
	Если ТекстОшибки <> "" Тогда Продолжить; КонецЕсли;

	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;
КонецПроцедуры

&НаСервере
Функция АдресСервера()
//Чехов - chekhov.welcome96.ru
//Реноме - renome.welcome96.ru
//Стрит-арт - streetart.welcome96.ru

АдресСервера = "";
Если НастройкиСервер.ЭтоРеноме() Тогда	
	АдресСервера = "renome.welcome96.ru";
ИначеЕсли НастройкиСервер.ЭтоЧехов() Тогда	
	АдресСервера = "chekhov.welcome96.ru";
ИначеЕсли НастройкиСервер.ЭтоСтритАрт() Тогда	
	АдресСервера = "streetart.welcome96.ru";
Иначе
	АдресСервера = "";
КонецЕсли;
	
Возврат АдресСервера; 
КонецФункции

&НаСервере
Функция ДатаИзСтроки(Строка)
//2024-08-01 09:50"	
//1234567890123456
ГодСтрока = Лев(Строка, 4);
Год = ОбщийФункционалКлиентСервер.ПолучитьЧисло(ГодСтрока);

МесяцСтрока = Сред(Строка, 6, 2);
Месяц = ОбщийФункционалКлиентСервер.ПолучитьЧисло(МесяцСтрока);

ДеньСтрока = Сред(Строка, 9, 2);
День = ОбщийФункционалКлиентСервер.ПолучитьЧисло(ДеньСтрока);

Если СтрДлина(Строка) = 16 Тогда
	ЧасСтрока = Сред(Строка, 12, 2);
	Час = ОбщийФункционалКлиентСервер.ПолучитьЧисло(ЧасСтрока);

	МинСтрока = Сред(Строка, 15, 2); 
	Мин = ОбщийФункционалКлиентСервер.ПолучитьЧисло(МинСтрока);
Иначе
	Час = 0; 
	Мин = 0; 
КонецЕсли;	
Сек = 0;

Попытка
	ДатаИзСтроки = Дата(Год, Месяц, День, Час, Мин, Сек);
Исключение
	ДатаИзСтроки = Неопределено;
КонецПопытки;

Возврат ДатаИзСтроки;
КонецФункции

&НаСервере
Функция ВремяЗаездаВыезда(ИмяПеречисления, Строка)
//2024-08-01 09:50"	
//1234567890123467

ВремяСтрока = Сред(Строка, 12, 5);
ВремяЗаездаВыезда =  ЗначениеПеречисленияПоСинониму(ИмяПеречисления, ВремяСтрока) ;

Возврат ВремяЗаездаВыезда; 	
КонецФункции

&НаСервере
Функция ЗначениеПеречисленияПоСинониму(ИмяПеречисления, ЗначениеСинонимаТекст)
    ЭлементПеречисления = Неопределено;
    Для каждого ТекЭлемент Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл
        Если ТекЭлемент.Синоним = ЗначениеСинонимаТекст Тогда
            ЭлементПеречисления = Перечисления[ИмяПеречисления][ТекЭлемент.Имя];
            Прервать;
        КонецЕсли;
    КонецЦикла; 
    
      Возврат ЭлементПеречисления; // возвращаем значение перечисления или Неопределено
КонецФункции; 



