
Процедура ПередЗаписью(Отказ)
НомерГорничные_OldValue = ЭтотОбъект.Ссылка.НомерГорничные; 	
//Если ТекущийОбъект.НомерГорничные = ТекущийОбъект.Ссылка.НомерГорничные Тогда Возврат; КонецЕсли;

ОбновитьГорничныеНомера(НомерГорничные_OldValue, ЭтотОбъект);

ОбменСГорничными = Константы.ОбменСГорничными.Получить();	
Если НЕ ОбменСГорничными Тогда Возврат; КонецЕсли; 

Папка_Горничные = Константы.Папка_Горничные.Получить();
Если НЕ ЗначениеЗаполнено(Папка_Горничные) Тогда Возврат; КонецЕсли;  

Соединение = ОбменГорничныеСервер.Соединение();
Если Соединение = Неопределено Тогда Возврат; КонецЕсли;

НомерДанные = Новый Структура;
НомерДанные.Вставить("НомерГорничные", ЭтотОбъект.НомерГорничные);
НомерДанные.Вставить("ПометкаУдаления", ЭтотОбъект.ПометкаУдаления);
НомерДанные.Вставить("Наименование", ЭтотОбъект.Наименование);

Попытка 
	Соединение.ОбменГорничныеСервер.ОбновитьНомерГорничные(НомерГорничные_OldValue, НомерДанные);
Исключение
	Сообщить("Ошибка записи в БД Горничные. ОбновитьГорничныеНомераНомер. " + ОписаниеОшибки());   	
КонецПопытки;
КонецПроцедуры

Процедура ОбновитьГорничныеНомера(НомерГорничные_OldValue, ТекущийОбъект)
ГорничныеНомераОбъект = Неопределено;

Если ЗначениеЗаполнено(НомерГорничные_OldValue) Тогда
	ГорничныеНомераСсылка = Справочники.ГорничныеНомера.НайтиПоРеквизиту("НомерГорничные", НомерГорничные_OldValue);
	Если ЗначениеЗаполнено(ГорничныеНомераСсылка) Тогда 
		ГорничныеНомераОбъект = ГорничныеНомераСсылка.ПолучитьОбъект();
	КонецЕсли;
ИначеЕсли ЗначениеЗаполнено(ТекущийОбъект.НомерГорничные) Тогда
	ГорничныеНомераСсылка = Справочники.ГорничныеНомера.НайтиПоРеквизиту("НомерГорничные", ТекущийОбъект.НомерГорничные);
	Если ЗначениеЗаполнено(ГорничныеНомераСсылка) Тогда 
		ГорничныеНомераОбъект = ГорничныеНомераСсылка.ПолучитьОбъект();
	КонецЕсли;
Иначе			
	Возврат;
КонецЕсли;

Если ГорничныеНомераОбъект = Неопределено Тогда 
	ГорничныеНомераОбъект = Справочники.ГорничныеНомера.СоздатьЭлемент();
КонецЕсли;

ГорничныеНомераОбъект.НомерГорничные = ТекущийОбъект.НомерГорничные;
ГорничныеНомераОбъект.Наименование = ТекущийОбъект.Наименование;
ГорничныеНомераОбъект.ПометкаУдаления = ТекущийОбъект.ПометкаУдаления;
ГорничныеНомераОбъект.Записать();

КонецПроцедуры
