
//
&НаСервере
Процедура ПриСозданииНаСервере()
УстановитьЭлементыФормы();

НаименованиеОтеляАналитика = "Трэвел лайн";    

Если НастройкиСервер.ЭтоЛайв() Тогда 
	Элементы.БезЗавтрака.Видимость = Ложь;
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлементыФормы()
Если НастройкиСервер.ТекущийПользовательКодРавноАдминистратор() Тогда 
	Элементы.ФормаТест.Видимость = Истина;
	Возврат; 
КонецЕсли;

ТекПол = ПараметрыСеанса.ТекущийПользователь;
Если ТекПол.ТолькоПросмотр ИЛИ (НЕ ТекПол.Админ) тогда
	Элементы.ФормаИзменитьДолгосрочныеЦены.Доступность=Ложь;
	Элементы.ФормаИзменитьВыбранные.Доступность=Ложь;
	Элементы.ФормаИзменитьБазовыеТарифы.Доступность = Ложь;
конецесли;
КонецПроцедуры
//

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Форма = ОткрытьФорму("Обработка.КалендарьЦен.Форма.СообщениеЗагрузка", , ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
ЗагрузкаДанных();

Форма.Закрыть();
КонецПроцедуры

//
&НаСервере
Процедура ЗагрузкаДанных()
ПроцентСкидкиБезЗавтрака_OLD = ДокументыСервер_Старый.ПроцентСкидкиБезЗавтрака();

Для Сч=0 По 7 Цикл
	Элементы.Год.СписокВыбора.Добавить(Год(ТекущаяДата()) - 3 + сч, Формат(Год(ТекущаяДата()) - 3 + сч, "ЧГ="));	
КонецЦикла; 

//
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КатегорииНомеров.Ссылка КАК Ссылка,
                      |	КатегорииНомеров.Код КАК Код,
                      |	КатегорииНомеров.Наименование КАК Наименование,
                      |	КатегорииНомеров.БазовыйТарифВыходные КАК БазовыйТарифВыходные,
                      |	КатегорииНомеров.БазовыйТарифБудниБезЗавтрака КАК БазовыйТарифБудниБезЗавтрака,
                      |	КатегорииНомеров.БазовыйТарифВыходныеБезЗавтрака КАК БазовыйТарифВыходныеБезЗавтрака,
                      |	КатегорииНомеров.БазовыйТарифБудниДвух КАК БазовыйТарифБудниДвух,
                      |	КатегорииНомеров.БазовыйТарифВыходныеДвух КАК БазовыйТарифВыходныеДвух,
                      |	КатегорииНомеров.БазовыйТарифБудниДвухБезЗавтрака КАК БазовыйТарифБудниДвухБезЗавтрака,
                      |	КатегорииНомеров.БазовыйТарифВыходныеДвухБезЗавтрака КАК БазовыйТарифВыходныеДвухБезЗавтрака,
                      |	КатегорииНомеров.Стандартный КАК Стандартный
                      |ИЗ
                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                      |ГДЕ
                      |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КатегорииНомеров.Номер_пп,
                      |	КатегорииНомеров.Наименование");

ВыборкаКатегорииНомеров = Запрос.Выполнить().Выбрать(); 

ТЗКатегорииНомеров_OLD.Очистить();
Пока ВыборкаКатегорииНомеров.Следующий() цикл
	Если СокрЛП(ВыборкаКатегорииНомеров.Наименование)="" тогда Продолжить; КонецЕсли;
	
	Строка = ТЗКатегорииНомеров_OLD.Добавить();
	ЗаполнитьЗначенияСвойств(Строка, ВыборкаКатегорииНомеров);  
КонецЦикла;
//

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КатегорииНомеров.Ссылка КАК Ссылка,
                      |	КатегорииНомеров.Код КАК Код,
                      |	КатегорииНомеров.Наименование КАК Наименование,
                      |	КатегорииНомеров.Стандартный КАК Стандартный
                      |ИЗ
                      |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                      |ГДЕ
                      |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КатегорииНомеров.Номер_пп,
                      |	КатегорииНомеров.Наименование");

ВыборкаКатегорииНомеров = Запрос.Выполнить().Выбрать(); 

ТЗКатегорииНомеров.Очистить();
Пока ВыборкаКатегорииНомеров.Следующий() цикл
	Если СокрЛП(ВыборкаКатегорииНомеров.Наименование)="" тогда Продолжить; КонецЕсли;
	
	Элементы.КатегорияНомера.СписокВыбора.Добавить(ВыборкаКатегорииНомеров.Ссылка, ВыборкаКатегорииНомеров.Наименование);
	
	Строка = ТЗКатегорииНомеров.Добавить();
	ЗаполнитьЗначенияСвойств(Строка, ВыборкаКатегорииНомеров);  
КонецЦикла;

Если ТЗКатегорииНомеров.Количество() > 0 Тогда
	ОтборСтроки = Новый Структура("Стандартный", Истина);
	НайденныеСтроки = ТЗКатегорииНомеров.НайтиСтроки(ОтборСтроки); 
	Если НайденныеСтроки.Количество() = 0 Тогда	
		Объект.КатегорияНомера = ТЗКатегорииНомеров[0].Ссылка;
	Иначе	
		Объект.КатегорияНомера = НайденныеСтроки[0].Ссылка;
	КонецЕсли;
КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КонкурентыОтели.Ссылка КАК Отель
                      |ИЗ
                      |	Справочник.КонкурентыОтели КАК КонкурентыОтели
                      |ГДЕ
                      |	КонкурентыОтели.ПометкаУдаления = ЛОЖЬ
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КонкурентыОтели.Номер_пп");

ВыборкаОтели = Запрос.Выполнить().Выбрать(); 

ТЗОтели.Очистить();
Пока ВыборкаОтели.Следующий() цикл
	НоваяСтрока = ТЗОтели.Добавить();
	
	НоваяСтрока.Отель = ВыборкаОтели.Отель;  
КонецЦикла;

ВидЦеныДолгосрочная = Перечисления.КалендарьЦенВидЦены.ДолгосрочнаяЦена;
ВидЦеныТекущая = Перечисления.КалендарьЦенВидЦены.ТекущаяЦена;

Объект.Год = Год(ТекущаяДата());	

ЗаполнитьТЗАналитика(Объект.Год);

Сдвиг = Сдвиг();

ОбновитьГод(Объект.Год);
КонецПроцедуры

&НаСервере
Функция ДатаПГПоДеньНедели(Дата)
ДеньНедели = ДеньНедели(Дата);

Год = Год(Дата) - 1;
Месяц = Месяц(Дата);
День = День(Дата);

Попытка 
	ДатаПрошлыйГод = Дата(Год, Месяц, День); 
Исключение
	Месяц_П = Месяц + 1;
	ДатаПрошлыйГод = Дата(Год, Месяц_П, 1);
КонецПопытки;

//Если ДатаПрошлыйГод = Неопределено Тогда Возврат Неопределено; КонецЕсли;

ДеньНедели_ПГ = ДеньНедели(ДатаПрошлыйГод);

Если ДеньНедели_ПГ > ДеньНедели Тогда
	Разница = ДеньНедели_ПГ - ДеньНедели;
ИначеЕсли ДеньНедели_ПГ < ДеньНедели Тогда
	Разница = ДеньНедели + ДеньНедели_ПГ - 1;
Иначе
	Разница = 0;
КонецЕсли;

ДатаПГПоДеньНедели = ДатаПрошлыйГод + 86400 * (-Разница);

Возврат ДатаПГПоДеньНедели;
КонецФункции

&НаСервере
Процедура ЗаполнитьТЗАналитика(Знач Год)

ГодОбновления = Год;
Начало=?(Объект.ПоказатьПрошлыеДаты, 1 ,Месяц(ТекущаяДата()));
Конец =  12 + Начало - 1;

Если Конец > 12 Тогда
	ГодОбновления_П = ГодОбновления + 1;
	Месяц_П = Конец - 11;
Иначе
	ГодОбновления_П = ГодОбновления;
	Месяц_П = Конец;
КонецЕсли;
ДатаС = Дата(ГодОбновления, Начало, 1); 
ДатаПо = НачалоДня(КонецМесяца(Дата(ГодОбновления_П, Месяц_П, 1)));

ТЗ = Новый ТаблицаЗначений;                      
м= Новый Массив;
м.Добавить(Тип("Дата"));
ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("День", Новый ОписаниеТипов(м,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
//Переберем все даты за период 
ТекДат = НачалоДня(ДатаС);
Пока ТекДат <= НачалоДня(ДатаПо) Цикл 
	//Добавим текущую дату в таблицу периодов
	НовСтр = ТЗ.Добавить();
	НовСтр.День = ТекДат;
	
	ТекДат = ТекДат + 86400; //Добавим 1 День
КонецЦикла;

ТЗАналитикаЗапросТекст = КалендарьЦен.ТЗАналитикаЗапросТекст();
Запрос = Новый Запрос(ТЗАналитикаЗапросТекст);
					  
Запрос.УстановитьПараметр("ТабДата", ТЗ);
Запрос.УстановитьПараметр("ПериодНачало",ДатаС);
Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ДатаПо));
Запрос.УстановитьПараметр("Номер", Справочники.НомернойФонд.НайтиПоНаименованию("Переговорная", Истина));
Запрос.УстановитьПараметр("ТипБронирования",Справочники.ТипБронирования.Ремонт);

Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

ТЗАналитика.Очистить();
ТЗАналитикаКатегории.Очистить();
Пока Выборка.Следующий() Цикл
	//ВыборкаДва = Выборка.Выбрать();
	
	Если Выборка.ПериодДень = '20240604' Тогда
		  ш= 1;
	КонецЕсли;
		
	НоваяТЗАналитика = ТЗАналитика.Добавить();
	НоваяТЗАналитика.Дата = Выборка.ПериодДень;
	НоваяТЗАналитика.ДатаМесяц = НачалоМесяца(Выборка.ПериодДень);
	
	НоваяТЗАналитика.ДеньНедели = ДеньНедели(Выборка.ПериодДень);
	
	НоваяТЗАналитика.ОбщееКоличество = Выборка.ОбщееКоличество;
	
	ИтогЗанятo = Окр(100 * Выборка.ЗанятыеНомера / Выборка.ОбщееКоличество, 1);
	НоваяТЗАналитика.ИтогЗанято = ИтогЗанятo;
	
	//НоваяТЗАналитика.ГлубинаБронирования = Выборка.ГлубинаБрони;
	Если Выборка.КоличествоГлубинаБрони > 0 Тогда
		НоваяТЗАналитика.ГлубинаБронирования = Окр(Выборка.СуммаГлубинаБрони / Выборка.КоличествоГлубинаБрони, 1) ;
	КонецЕсли;
	
	//НоваяТЗАналитика.СреднийADR = Окр(Выборка.ADR);
	Если Выборка.ЗанятыеНомера > 0 Тогда
		НоваяТЗАналитика.СреднийADR = Окр(Выборка.СуммаADR / Выборка.ЗанятыеНомера);
	КонецЕсли;
		
	//ВыборкаДва.Сбросить();
	ВыборкаДва = Выборка.Выбрать();
	
	Пока ВыборкаДва.Следующий() Цикл
		НоваяТЗАналитикаКатегории = ТЗАналитикаКатегории.Добавить();
		НоваяТЗАналитикаКатегории.Дата = Выборка.ПериодДень;
		НоваяТЗАналитикаКатегории.Категория = ВыборкаДва.КатегорияНомера;
		
		КатегорияЗабронировано = Окр(100 * ВыборкаДва.ЗанятыеНомера /ВыборкаДва.ОбщееКоличество, 1);
		НоваяТЗАналитикаКатегории.КатегорияЗабронировано = КатегорияЗабронировано;
		
		//НоваяТЗАналитикаКатегории.КатегорияADR = Окр(ВыборкаДва.ADR);
		Если ВыборкаДва.ЗанятыеНомера > 0 Тогда
			НоваяТЗАналитикаКатегории.КатегорияADR = Окр(ВыборкаДва.СуммаADR / ВыборкаДва.ЗанятыеНомера);
		КонецЕсли;

	КонецЦикла;
КонецЦикла;

// + Предыдущий год

ДатаС_П = ДатаПГПоДеньНедели(ДатаС);
//ДатаПо_П = КонецМесяца(ДатаПГПоДеньНедели(ДатаПо));
ДатаПо_П = ДатаПГПоДеньНедели(ДатаПо);

Тз.Очистить();
ТекДат = НачалоДня(ДатаС_П);
Пока ТекДат <= НачалоДня(ДатаПо_П) Цикл 
	//Добавим текущую дату в таблицу периодов
	НовСтр = Тз.Добавить();
	НовСтр.День = ТекДат;
	
	ТекДат = ТекДат + 86400; //Добавим 1 День
КонецЦикла;

Запрос.УстановитьПараметр("ТабДата", ТЗ);
Запрос.УстановитьПараметр("ПериодНачало",ДатаС_П);
Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ДатаПо_П));
Запрос.УстановитьПараметр("Номер", Справочники.НомернойФонд.НайтиПоНаименованию("Переговорная", Истина));
Запрос.УстановитьПараметр("ТипБронирования",Справочники.ТипБронирования.Ремонт);

Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

ЗапросКатегория = Новый Запрос("ВЫБРАТЬ
                               |	КатегорииНомеров.Ссылка КАК Ссылка
                               |ИЗ
                               |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                               |ГДЕ
                               |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ
                               |	И КатегорииНомеров.Базовый = ИСТИНА");

ВыборкаКатегория = ЗапросКатегория.Выполнить().Выбрать(); 
Если ВыборкаКатегория.Следующий() Тогда
	КатегорияНомераСтандартный = ВыборкаКатегория.Ссылка;
Иначе	
	КатегорияНомераСтандартный = Неопределено;
КонецЕсли;

Индекс = 0;
Пока Выборка.Следующий() Цикл
	Если Индекс > ТЗАналитика.Количество() - 1 Тогда Прервать; КонецЕсли;
	
	//Если Выборка.ПериодДень = '20240301' Тогда
	//	ш = 1;
	//КонецЕсли;
	
	Если КатегорияНомераСтандартный <> Неопределено Тогда 
		БазоваяЦена = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(Выборка.ПериодДень, КатегорияНомераСтандартный, Ложь, Ложь);  
		ТЗАналитика[Индекс].БазоваяЦена_ПГ = БазоваяЦена;	
	КонецЕсли;
	
	Загрузка = ?(Выборка.ЗанятыеНомера = 0, "-"
		, Окр(100 * (Выборка.ЗанятыеНомера / Выборка.ОбщееКоличество), 1));	
	ТЗАналитика[Индекс].Загрузка_ПГ = Загрузка;	
	
	Дата_ПГ = Выборка.ПериодДень;
	ТЗАналитика[Индекс].Дата_ПГ = Дата_ПГ;	
	
	ДеньНедели_ПГ = ДеньНедели(Выборка.ПериодДень);
	ТЗАналитика[Индекс].ДеньНедели_ПГ = ДеньНедели_ПГ;	
	
	Индекс = Индекс + 1;
КонецЦикла;


// - Предыдущий год

//// + Конкуренты

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентов.Дата КАК Дата,
                      |	СРЕДНЕЕ(ЦеныКонкурентов.Цена) КАК Цена
                      |ИЗ
                      |	РегистрСведений.ЦеныКонкурентов КАК ЦеныКонкурентов
                      |ГДЕ
                      |	ЦеныКонкурентов.Дата >= &ДатаС
                      |	И ЦеныКонкурентов.Дата <= &ДатаПо
                      |
                      |СГРУППИРОВАТЬ ПО
                      |	ЦеныКонкурентов.Дата
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Дата");

Запрос.УстановитьПараметр("ДатаС", ДатаС);					  
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);					  
//Запрос.УстановитьПараметр("НаименованиеОтеля", НаименованиеОтеляАналитика);					  

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ОтборСтроки = Новый Структура("Дата", Строка.Дата);
	НайденныеСтроки = ТЗАналитика.НайтиСтроки(ОтборСтроки);
	НайденнаяСтрока = НайденныеСтроки[0]; 
	НайденнаяСтрока.ЦенаКонкурентов = Строка.Цена;
КонецЦикла;
// - Цена

//// + Цена Средние цены
//Запрос = Новый Запрос("ВЫБРАТЬ
//                      |	ЦеныКонкурентовАналитика.ДатаЗадания КАК ДатаЗадания,
//                      |	ЦеныКонкурентовАналитика.Дата КАК Дата,
//                      |	ЦеныКонкурентовАналитика.Цена КАК Цена,
//                      |	ЦеныКонкурентовАналитика.СреднийADR КАК СреднийADR,
//                      |	ЦеныКонкурентовАналитика.ЗанятоПроцент КАК ЗанятоПроцент
//                      |ИЗ
//                      |	РегистрСведений.ЦеныКонкурентовАналитика КАК ЦеныКонкурентовАналитика
//                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//                      |			МАКСИМУМ(ЦеныКонкурентовАналитика.ДатаЗадания) КАК ДатаЗадания,
//                      |			ЦеныКонкурентовАналитика.Дата КАК Дата
//                      |		ИЗ
//                      |			РегистрСведений.ЦеныКонкурентовАналитика КАК ЦеныКонкурентовАналитика
//                      |		
//                      |		СГРУППИРОВАТЬ ПО
//                      |			ЦеныКонкурентовАналитика.Дата) КАК ДатаЗаданияМакс
//                      |		ПО ЦеныКонкурентовАналитика.Дата = ДатаЗаданияМакс.Дата
//                      |			И ЦеныКонкурентовАналитика.ДатаЗадания = ДатаЗаданияМакс.ДатаЗадания
//                      |ГДЕ
//                      |	ЦеныКонкурентовАналитика.Дата >= &ДатаС
//                      |	И ЦеныКонкурентовАналитика.Дата <= &ДатаПо
//                      |
//                      |УПОРЯДОЧИТЬ ПО
//                      |	Дата,
//                      |	ДатаЗадания");
//					  
//Запрос.УстановитьПараметр("ДатаС", ДатаС);					  
//Запрос.УстановитьПараметр("ДатаПо", ДатаПо);					  

//ТЗ = Запрос.Выполнить().Выгрузить();

//Для Каждого Строка Из ТЗ Цикл
//	ОтборСтроки = Новый Структура("Дата", Строка.Дата);
//	НайденныеСтроки = ТЗАналитика.НайтиСтроки(ОтборСтроки);
//	НайденнаяСтрока = НайденныеСтроки[0]; 
//	НайденнаяСтрока.ЦенаКонкурентовАналитика = Строка.Цена;
//КонецЦикла;
//// - Цена Средние цены

// + Цена Средние цены
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Дата КАК Дата,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Цена КАК Цена,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Отель КАК Отель,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.ПродажиЗакрыты КАК ПродажиЗакрыты
                      |ИЗ
                      |	Документ.ЦеныКонкурентовАналитика.ДанныеОтели КАК ЦеныКонкурентовАналитикаДанныеОтели
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			МАКСИМУМ(ЦеныКонкурентовАналитика.Ссылка.ДатаЗадания) КАК ДатаЗадания,
                      |			ЦеныКонкурентовАналитика.Дата КАК Дата
                      |		ИЗ
                      |			Документ.ЦеныКонкурентовАналитика.ДанныеОтели КАК ЦеныКонкурентовАналитика
                      |		
                      |		СГРУППИРОВАТЬ ПО
                      |			ЦеныКонкурентовАналитика.Дата) КАК ДатаЗаданияМакс
                      |		ПО ЦеныКонкурентовАналитикаДанныеОтели.Дата = ДатаЗаданияМакс.Дата
                      |			И ЦеныКонкурентовАналитикаДанныеОтели.Ссылка.ДатаЗадания = ДатаЗаданияМакс.ДатаЗадания
                      |ГДЕ
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЦеныКонкурентовАналитикаДанныеОтели.Дата >= &ДатаС
                      |	И ЦеныКонкурентовАналитикаДанныеОтели.Дата <= &ДатаПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Дата,
                      |	ДатаЗаданияМакс.ДатаЗадания");


Запрос.УстановитьПараметр("ДатаС", ДатаС);					  
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);					  

ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Если Строка.Отель <> Справочники.КонкурентыОтели.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
	
	ОтборСтроки = Новый Структура("Дата", Строка.Дата);
	НайденныеСтроки = ТЗАналитика.НайтиСтроки(ОтборСтроки);
	НайденнаяСтрока = НайденныеСтроки[0]; 
	НайденнаяСтрока.ЦенаКонкурентовАналитика = Строка.Цена;
КонецЦикла;

Для Каждого Строка Из ТЗ Цикл
	Если Строка.Отель = Справочники.КонкурентыОтели.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
	
	ОтборСтроки = Новый Структура("Отель", Строка.Отель);
	НайденныеСтроки = ТЗОтели.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда Продолжить; КонецЕсли;
	
	НоваяСтрока = ТЗАналитикаОтели.Добавить();
	
	НоваяСтрока.Отель = Строка.Отель;
	НоваяСтрока.Дата = Строка.Дата;
	НоваяСтрока.Цена = Строка.Цена;
	НоваяСтрока.ПродажиЗакрыты = Строка.ПродажиЗакрыты;
КонецЦикла;


// - Цена Средние цены


// + Активность
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	АктивностиКалендарь.Дата КАК Дата,
                      |	АктивностиКалендарь.АктивностьКалендарь КАК АктивностьКалендарь
                      |ИЗ
                      |	РегистрСведений.АктивностиКалендарь КАК АктивностиКалендарь
                      |ГДЕ
                      |	АктивностиКалендарь.Дата >= &ДатаС
                      |	И АктивностиКалендарь.Дата <= &ДатаПо
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	Дата" );
					  
Запрос.УстановитьПараметр("ДатаС", ДатаС);					  
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);					  
					  
ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	ОтборСтроки = Новый Структура("Дата", Строка.Дата);
	НайденныеСтроки = ТЗАналитика.НайтиСтроки(ОтборСтроки);
	НайденнаяСтрока = НайденныеСтроки[0]; 
	НайденнаяСтрока.АктивностьКалендарь = Строка.АктивностьКалендарь;
КонецЦикла;
	
// - Активность
//// - Конкуренты



КонецПроцедуры
//

//
&НаКлиенте
Процедура ОбновитьКоманда(Команда)
ЗаполнитьТЗАналитика(Объект.Год);
	
ОбновитьГод(Объект.Год);	
КонецПроцедуры
//

//
&НаКлиенте
Процедура ГодПриИзменении(Элемент)
ЗаполнитьТЗАналитика(Объект.Год);

ОбновитьГод(Объект.Год);
КонецПроцедуры
//

//
&НаКлиенте
Процедура КатегорияНомераПриИзменении(Элемент)
ОбновитьГод(Объект.Год);
КонецПроцедуры
//

//
&НаКлиенте
Процедура БезЗавтракаПриИзменении(Элемент)
УстановитьЭлементыФормы();

ОбновитьГод(Объект.Год);
КонецПроцедуры
//


//// + Обновить ПолеОтчета 
&НаСервере
Функция ОбновитьТЗБазовыеЦены_OLD()
ДатаЦеныНачалоГода = Дата(Объект.Год, 1, 1);	
КалендарьЦен_Старый.ЗаполнитьТЗБазовыеЦены(ТЗБазовыеЦены_OLD, ДатаЦеныНачалоГода, Объект.КатегорияНомера, Объект.БезЗавтрака
	, ПроцентСкидкиБезЗавтрака_OLD); 
КонецФункции                                        

&НаСервере
Функция ОбновитьТЗЦен_OLD()
ДатаЦеныНачалоГода = Дата(Объект.Год, 1, 1);
КалендарьЦен_Старый.ЗаполнитьТЗЦен(ТЗЦен_OLD, ДатаЦеныНачалоГода , Объект.КатегорияНомера, Объект.БезЗавтрака
	, ПроцентСкидкиБезЗавтрака_OLD); 
КонецФункции

//
&НаСервере
Функция ОбновитьГод(Знач ГодОбновления)
СписВыбранных.Очистить();

ПолеОтчета.Очистить();
Если НЕ ЗначениеЗаполнено(Объект.КатегорияНомера) Тогда Возврат Неопределено; КонецЕсли;

ОбновитьТЗБазовыеЦены_OLD();
ОбновитьТЗЦен_OLD();

ТабДок=Новый ТабличныйДокумент;

ИмяОбработки = ОбщийФункционалКлиентСервер.ИмяОбработки(ЭтаФорма);
Макет = Обработки[ИмяОбработки].ПолучитьМакет("МакетОсновной");

КатегорияНомера = Объект.КатегорияНомера;

Обл=Макет.ПолучитьОбласть("Шапка|ШапкаВерх");
ТабДок.Присоединить(Обл);

Для сч=1 По 6 Цикл
	Обл=Макет.ПолучитьОбласть("Шапка|Неделя");
	ТабДок.Присоединить(Обл);
КонецЦикла; 

ПолеОтчета.Вывести(ТабДок, 0);

Начало=?(Объект.ПоказатьПрошлыеДаты,1,Месяц(ТекущаяДата()));

ВысотаПолеОтчетаМинимум = 2;
ВысотаПоляОтчетаМаксимум = 0;

ШиринаПоляОтчетаМаксимум = 2;

//Для сч = Начало По 12 Цикл
Конец =  12 + Начало - 1;
Для сч = Начало По Конец Цикл
	
	Если сч > 12 Тогда
		ГодОбновления_П = ГодОбновления + 1;
		Месяц_П = сч - 12;
	Иначе
		ГодОбновления_П = ГодОбновления;
		Месяц_П = сч;
	КонецЕсли;
	
	ТабДок_Разделитель = Новый ТабличныйДокумент;
	Обл = Макет.ПолучитьОбласть("Разделитель");
	Обл.Параметры.Месяц = ПолучитьМесяц(Месяц_П)+ " " + Формат(ГодОбновления_П, "ЧГ=");

	ТабДок_Разделитель.Вывести(Обл);
	ПолеОтчета.Вывести(ТабДок_Разделитель);
	
	ТабДок = Новый ТабличныйДокумент;
	
	Обл=Макет.ПолучитьОбласть("Строка|ШапкаВерх");
	Обл.Параметры.Месяц = ПолучитьМесяц(Месяц_П)+ " " + Формат(ГодОбновления_П, "ЧГ=");
	ТабДок.Вывести(Обл);

	Для сч2 = 1 По 6 Цикл
		
		Обл=Макет.ПолучитьОбласть("Строка|Неделя");
		ДатыНедели = НеделяМесяца(Дата(ГодОбновления_П, Месяц_П, 1), сч2);
		Если ДатыНедели<>Неопределено тогда
			ДТН=ДатыНедели.ДТН;
			ДТК=ДатыНедели.ДТК;
			
			Пока ДТН<=ДТК цикл
				НетЗаполненияДаты = Истина;
				
				Обл.Параметры["Д"+ДеньНедели(ДТН)]=ДТН;
				
				ЗаполнитьЯчейкиОтчета(ДТН, Обл);
				
				ДТН=ДТН+86400;
			КонецЦикла;				
		конецесли;
		
		ТабДок.Присоединить(Обл);
	КонецЦикла; 
	
	ГруппаОткрыта = (сч - Начало < 2);
	ПолеОтчета.НачатьГруппуСтрок(ГруппаОткрыта, ГруппаОткрыта);
	ПолеОтчета.Вывести(ТабДок);

	ТабДок2 = Новый ТабличныйДокумент;
	
	ДатаС = НачалоДня(Дата(ГодОбновления_П, Месяц_П, 1));
	ДатаПо = НачалоДня(КонецМесяца(ДатаС));
	
	ПолеОтчета.НачатьГруппуСтрок(, Ложь);
	//СформироватьАналитика(ТабДок2, ДатаС, ДатаПо);
	СформироватьАналитикаОтчет(ТабДок2, ДатаС, ДатаПо);
	
	ПолеОтчета.Вывести(ТабДок2);
	ПолеОтчета.ЗакончитьГруппуСтрок();
	
	ПолеОтчета.ЗакончитьГруппуСтрок();
	
	//ВысотаПоляОтчетаМаксимум = ВысотаПоляОтчетаМаксимум + 3;		
	ВысотаПоляОтчетаМаксимум = ВысотаПоляОтчетаМаксимум + 4 + Сдвиг;		
КонецЦикла; 

ШиринаПолеОтчета.Очистить();
ШиринаПоляОтчетаМаксимум = 6*7 + 1;
Для НомерСтроки = ВысотаПолеОтчетаМинимум По ВысотаПоляОтчетаМаксимум Цикл
	
	СтрокаШиринаПолеОтчета = ШиринаПолеОтчета.Добавить();
	СтрокаШиринаПолеОтчета.НомерСтроки = НомерСтроки;
	
	ЭтоСтрокаДата = ЭтоСтрокаДата(НомерСтроки, Сдвиг); 
	Если ЭтоСтрокаДата Тогда 
		СтрокаШиринаПолеОтчета.ШиринаПолеОтчетаМинимум = 2;
		СтрокаШиринаПолеОтчета.ШиринаПоляОтчетаМаксимум = 1;
	Иначе	
		СтрокаШиринаПолеОтчета.ШиринаПолеОтчетаМинимум = 0;
		СтрокаШиринаПолеОтчета.ШиринаПоляОтчетаМаксимум = 0;
		Продолжить; 
	КонецЕсли;
	
	НетЗаполненияДаты = Истина;
	Для НомерСтолбца =  2 По ШиринаПоляОтчетаМаксимум Цикл
	    ДанныеОбласти = "R" + Строка(НомерСтроки) + "C" + Строка(НомерСтолбца);
		
		Если ЗначениеЗаполнено(ПолеОтчета.Область(ДанныеОбласти).Текст) Тогда
			НетЗаполненияДаты = Ложь;
			СтрокаШиринаПолеОтчета.ШиринаПоляОтчетаМаксимум = СтрокаШиринаПолеОтчета.ШиринаПоляОтчетаМаксимум + 1;
		Иначе	
			Если НетЗаполненияДаты Тогда
				СтрокаШиринаПолеОтчета.ШиринаПолеОтчетаМинимум = СтрокаШиринаПолеОтчета.ШиринаПолеОтчетаМинимум + 1;
				СтрокаШиринаПолеОтчета.ШиринаПоляОтчетаМаксимум = СтрокаШиринаПолеОтчета.ШиринаПоляОтчетаМаксимум + 1;
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;		
КонецЦикла;

ПолеОтчета.ФиксацияСверху=1;
ПолеОтчета.ФиксацияСлева=1;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМесяц(М)
	Если М=1 тогда
		Возврат "Январь";
	ИначеЕсли М=2 тогда
		Возврат "Февраль";
	ИначеЕсли М=3 тогда
		Возврат "Март";
	ИначеЕсли М=4 тогда
		Возврат "Апрель";
	ИначеЕсли М=5 тогда
		Возврат "Май";
	ИначеЕсли М=6 тогда
		Возврат "Июнь";
	ИначеЕсли М=7 тогда
		Возврат "Июль";
	ИначеЕсли М=8 тогда
		Возврат "Август";
	ИначеЕсли М=9 тогда
		Возврат "Сентябрь";
	ИначеЕсли М=10 тогда
		Возврат "Октябрь";
	ИначеЕсли М=11 тогда
		Возврат "Ноябрь";
	ИначеЕсли М=12 тогда
		Возврат "Декабрь";
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция НеделяМесяца(НачМес,Нед)
	ДТН=Макс(НачалоНедели(НачМес+7*(НЕД-1)*86400),НачМес);
	Если Месяц(ДТН)<>Месяц(НачМес) тогда
		возврат Неопределено
	конецесли;
	ДТК=МИН(КонецМесяца(НачМес),КонецНедели(ДТН));
	Возврат Новый Структура("ДТН,ДТК",ДТН,ДТК);
КонецФункции
//

//
&НаСервере
Процедура СформироватьАналитикаОтчет(ТаблицаВывод, ДатаС, ДатаПо)
Макет = Обработки.КалендарьЦен.ПолучитьМакет("МакетОсновной");

ТабДок = Новый ТабличныйДокумент;

ТабДокЗаголовки = Новый ТабличныйДокумент;
ЗаголовкиОтступ = Макет.ПолучитьОбласть("ШапкаВерх|Отступ");
ТабДокЗаголовки.Вывести(ЗаголовкиОтступ);
		
ГруппаКатегории = Новый ТабличныйДокумент;

ГруппаКатегории.НачатьГруппуСтрок(, Ложь);
ЗаголовкиКатегории = Макет.ПолучитьОбласть("ШапкаВерх|Категории");

//Пока ВыборкаДва.Следующий() Цикл
Для Каждого Строка Из ТЗКатегорииНомеров Цикл
	ЗаголовкиКатегории.Параметры.Категория = Строка.Ссылка.Наименование;
	ГруппаКатегории.Вывести(ЗаголовкиКатегории);
КонецЦикла;
ГруппаКатегории.ЗакончитьГруппуСтрок();

ТабДокЗаголовки.Вывести(ГруппаКатегории);

ТабДок.Присоединить(ТабДокЗаголовки);

ДеньНедели = ДеньНедели(ДатаС);
День = ДеньНедели - 1;
Пока День > 0 Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ТабДок.Присоединить(ТабДокДата);
	
	День = День - 1;
КонецЦикла;

ОтборСтроки = Новый Структура("ДатаМесяц", ДатаС);
НайденныеСтрокиТЗАналитика = ТЗАналитика.НайтиСтроки(ОтборСтроки);
Для Каждого СтрокаТЗАналитика Из НайденныеСтрокиТЗАналитика Цикл
	
	ТабДокДата = Новый ТабличныйДокумент;
	ДатаШапка = Макет.ПолучитьОбласть("Дата|Отступ");
	
	ДатаШапка.Параметры.ИтогЗанято = ?(СтрокаТЗАналитика.ИтогЗанято = 0, "-", СтрокаТЗАналитика.ИтогЗанято);
	ТабДокДата.Вывести(ДатаШапка);
	
	ОтборСтроки = Новый Структура("Дата", СтрокаТЗАналитика.Дата);
	НайденныеСтрокиКатегории = ТЗАналитикаКатегории.НайтиСтроки(ОтборСтроки);	
	Для Каждого НайденнаяСтрокаКатегории Из НайденныеСтрокиКатегории Цикл 
		ДатаКатегории = Макет.ПолучитьОбласть("Дата|Категории");
		
		ДатаКатегории.Параметры.КатегорияЗабронировано = ?(НайденнаяСтрокаКатегории.КатегорияЗабронировано = 0, "-"
			, НайденнаяСтрокаКатегории.КатегорияЗабронировано);
		ТабДокДата.Вывести(ДатаКатегории);
	КонецЦикла;

	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;

ТаблицаВывод.Вывести(ТабДок);

//// + ADR
ТабДок = Новый ТабличныйДокумент;

ТабДокЗаголовки = Новый ТабличныйДокумент;
ЗаголовкиОтступ = Макет.ПолучитьОбласть("ШапкаВерх|ОтступADR");
ТабДокЗаголовки.Вывести(ЗаголовкиОтступ);
		
ГруппаКатегории = Новый ТабличныйДокумент;

ГруппаКатегории.НачатьГруппуСтрок(, Ложь);
ЗаголовкиКатегории = Макет.ПолучитьОбласть("ШапкаВерх|КатегорииADR");
Для Каждого Строка Из ТЗКатегорииНомеров Цикл
	ЗаголовкиКатегории.Параметры.Категория = Строка.Наименование;
	ГруппаКатегории.Вывести(ЗаголовкиКатегории);
КонецЦикла;
ГруппаКатегории.ЗакончитьГруппуСтрок();
ТабДокЗаголовки.Вывести(ГруппаКатегории);

ЗаголовкиПодвал = Макет.ПолучитьОбласть("ШапкаВерх|ПодвалADR");
ТабДокЗаголовки.Вывести(ЗаголовкиПодвал);

ТабДок.Присоединить(ТабДокЗаголовки);

ДеньНедели = ДеньНедели(ДатаС);

День = ДеньНедели - 1;

Пока День > 0 Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ТабДок.Присоединить(ТабДокДата);
	
	День = День - 1;
КонецЦикла;

//ОтборСтроки = Новый Структура("ДатаМесяц", ДатаС);
//НайденныеСтрокиТЗАналитика = ТЗАналитика.НайтиСтроки(ОтборСтроки);
Для Каждого СтрокаТЗАналитика Из НайденныеСтрокиТЗАналитика Цикл

	ТабДокДата = Новый ТабличныйДокумент;
	ДатаШапка = макет.ПолучитьОбласть("Дата|ОтступADR");
	ДатаШапка.Параметры.СреднийADR = СтрокаТЗАналитика.СреднийADR;
	ТабДокДата.Вывести(ДатаШапка);
	
	ОтборСтроки = Новый Структура("Дата", СтрокаТЗАналитика.Дата);
	НайденныеСтрокиКатегории = ТЗАналитикаКатегории.НайтиСтроки(ОтборСтроки);	
	Для Каждого НайденнаяСтрокаКатегории Из НайденныеСтрокиКатегории Цикл		
		ДатаКатегории = Макет.ПолучитьОбласть("Дата|КатегорииADR");
		ДатаКатегории.Параметры.КатегорияADR = НайденнаяСтрокаКатегории.КатегорияADR ;
		ТабДокДата.Вывести(ДатаКатегории);
	КонецЦикла;
	
	ДатаПодвал = Макет.ПолучитьОбласть("Дата|ПодвалADR");
	ДатаПодвал.Параметры.ГлубинаБронирования = ?(СтрокаТЗАналитика.ГлубинаБронирования = 0, "-", СтрокаТЗАналитика.ГлубинаБронирования);
	ТабДокДата.Вывести(ДатаПодвал);

	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;

ТаблицаВывод.Вывести(ТабДок);
//// - ADR

// + Предыдущий Год
ТабДок = Новый ТабличныйДокумент;

ТабДокЗаголовки = Новый ТабличныйДокумент;
ЗаголовкиОтступ = Макет.ПолучитьОбласть("ШапкаВерх|ПредыдущийГод");
ТабДокЗаголовки.Вывести(ЗаголовкиОтступ);

ТабДок.Присоединить(ТабДокЗаголовки);

ДеньНедели = ДеньНедели(ДатаС);
День = ДеньНедели - 1;
Пока День > 0 Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ТабДок.Присоединить(ТабДокДата);
	
	День = День - 1;
КонецЦикла;

ЗапросКатегория = Новый Запрос("ВЫБРАТЬ
                               |	КатегорииНомеров.Ссылка КАК Ссылка
                               |ИЗ
                               |	Справочник.КатегорииНомеров КАК КатегорииНомеров
                               |ГДЕ
                               |	КатегорииНомеров.ПометкаУдаления = ЛОЖЬ
                               |	И КатегорииНомеров.Базовый = ИСТИНА");

ВыборкаКатегория = ЗапросКатегория.Выполнить().Выбрать(); 
Если ВыборкаКатегория.Следующий() Тогда
	КатегорияНомераСтандартный = ВыборкаКатегория.Ссылка;
Иначе	
	КатегорияНомераСтандартный = Неопределено;
КонецЕсли;

Для Каждого СтрокаТЗАналитика Из НайденныеСтрокиТЗАналитика Цикл
	
	ТабДокДата = Новый ТабличныйДокумент;
	ДатаШапка = Макет.ПолучитьОбласть("Дата|ПредыдущийГод");
	
	ДатаШапка.Параметры.ДеньНедели = Формат(СтрокаТЗАналитика.Дата_ПГ, "ДФ=dd.MM.yy");
		
	Если КатегорияНомераСтандартный <> Неопределено Тогда 
		//БазоваяЦена = ДокументыСервер.ПолучитьЦенуПоЦеновойПолитике(ДатаПрошлыйГод, КатегорияНомераСтандартный, Ложь, Ложь);  
		ДатаШапка.Параметры.БазоваяЦена = СтрокаТЗАналитика.БазоваяЦена_ПГ;
	КонецЕсли;
	
	ДатаШапка.Параметры.Загрузка = ?(СтрокаТЗАналитика.Загрузка_ПГ = 0, "-"
		, СтрокаТЗАналитика.Загрузка_ПГ);	
		
	ТабДокДата.Вывести(ДатаШапка);

	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;

ТаблицаВывод.Вывести(ТабДок);
// + Предыдущий Год


//// + Конкуренты
//ТабДок = Новый ТабличныйДокумент;

//ТабДокЗаголовки = Новый ТабличныйДокумент;
//ЗаголовкиОтступ = Макет.ПолучитьОбласть("ШапкаВерх|Конкуренты");
//ТабДокЗаголовки.Вывести(ЗаголовкиОтступ);

//ТабДок.Присоединить(ТабДокЗаголовки);

//ДеньНедели = ДеньНедели(ДатаС);
//День = ДеньНедели - 1;
//Пока День > 0 Цикл
//	ТабДокДата = Новый ТабличныйДокумент;
//	
//	//ДатаШапка = макет.ПолучитьОбласть("Дата|Отступ");
//	//ТабДокДата.Вывести(ДатаШапка);			
//	//
//	//ВыборкаДва.Сбросить();
//	//Пока ВыборкаДва.Следующий() Цикл
//	//	ДатаКатегории = Макет.ПолучитьОбласть("Дата|Категории");
//	//	ТабДокДата.Вывести(ДатаКатегории);
//	//КонецЦикла;
//	//
//	//ДатаПодвал = Макет.ПолучитьОбласть("Дата|Подвал");
//	//ТабДокДата.Вывести(ДатаПодвал);
//	
//	ТабДок.Присоединить(ТабДокДата);
//	
//	День = День - 1;
//КонецЦикла;

//Для Каждого СтрокаТЗАналитика Из НайденныеСтрокиТЗАналитика Цикл
//	
//	ТабДокДата = Новый ТабличныйДокумент;
//	ДатаСтрока = Макет.ПолучитьОбласть("Дата|Конкуренты");
//	
//	ДатаСтрока.Параметры.Цена = СтрокаТЗАналитика.ЦенаКонкурентов;
//	
//	РасшифровкаЦенаДата = Новый Структура("Расшифровка, Дата", "РасшифровкаЦенаДата", СтрокаТЗАналитика.Дата); 
//	ДатаСтрока.Параметры.РасшифровкаЦенаДата = РасшифровкаЦенаДата;
//	
//	ДатаСтрока.Параметры.ЦенаАналитика = СтрокаТЗАналитика.ЦенаКонкурентовАналитика;
//	
//	РасшифровкаЦенаАналитика = Новый Структура("Расшифровка, Дата", "РасшифровкаЦенаАналитика", СтрокаТЗАналитика.Дата); 
//	ДатаСтрока.Параметры.РасшифровкаЦенаАналитика = РасшифровкаЦенаАналитика;
//	
//	Если СтрокаТЗАналитика.ЦенаКонкурентовАналитика > 0 Тогда
//		ДатаСтрока.Область(2, 1, 2, 1).ЦветФона = Новый Цвет(0, 255, 255);
//	КонецЕсли;
//		
//	Если  СтрокаТЗАналитика.АктивностьКалендарь = "" Тогда
//		ДатаСтрока.Параметры.Активность = "-";
//	Иначе
//		ДатаСтрока.Параметры.Активность = СтрокаТЗАналитика.АктивностьКалендарь;
//	КонецЕсли;
//	
//	ТабДокДата.Вывести(ДатаСтрока);

//	ТабДок.Присоединить(ТабДокДата);
//КонецЦикла;

//
ТабДок = Новый ТабличныйДокумент;

ТабДокЗаголовки = Новый ТабличныйДокумент;
ЗаголовкиОтступ = Макет.ПолучитьОбласть("ШапкаВерх|Конкуренты");
ТабДокЗаголовки.Вывести(ЗаголовкиОтступ);

ТабДок.Присоединить(ТабДокЗаголовки);

ДеньНедели = ДеньНедели(ДатаС);
День = ДеньНедели - 1;
Пока День > 0 Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ТабДок.Присоединить(ТабДокДата);
	
	День = День - 1;
КонецЦикла;

Для Каждого СтрокаТЗАналитика Из НайденныеСтрокиТЗАналитика Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	ДатаСтрока = Макет.ПолучитьОбласть("Дата|Конкуренты");
	
	ДатаСтрока.Параметры.Цена = СтрокаТЗАналитика.ЦенаКонкурентов;
	
	РасшифровкаЦенаДата = Новый Структура("Расшифровка, Дата", "РасшифровкаЦенаДата", СтрокаТЗАналитика.Дата); 
	ДатаСтрока.Параметры.РасшифровкаЦенаДата = РасшифровкаЦенаДата;
	
	ТабДокДата.Вывести(ДатаСтрока);
	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;
ТаблицаВывод.Вывести(ТабДок);
//


//
ТабДок = Новый ТабличныйДокумент;

ТабДокЗаголовки = Новый ТабличныйДокумент;
ЗаголовкиОтступ = Макет.ПолучитьОбласть("ШапкаВерх|ТрэвелЛайн");
ТабДокЗаголовки.Вывести(ЗаголовкиОтступ);

ГруппаОтели = Новый ТабличныйДокумент;

ГруппаОтели.НачатьГруппуСтрок(, Ложь);
ЗаголовкиОтели = Макет.ПолучитьОбласть("ШапкаВерх|ТрэвелЛайнОтели");
Для Каждого Строка Из ТЗОтели Цикл
	ЗаголовкиОтели.Параметры.Отель = Строка.Отель.Наименование;
	ГруппаОтели.Вывести(ЗаголовкиОтели);
КонецЦикла;
ГруппаОтели.ЗакончитьГруппуСтрок();
ТабДокЗаголовки.Вывести(ГруппаОтели);

ТабДок.Присоединить(ТабДокЗаголовки);

ДеньНедели = ДеньНедели(ДатаС);
День = ДеньНедели - 1;
Пока День > 0 Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ТабДок.Присоединить(ТабДокДата);
	
	День = День - 1;
КонецЦикла;

Для Каждого СтрокаТЗАналитика Из НайденныеСтрокиТЗАналитика Цикл
	Если СтрокаТЗАналитика.Дата = '20240902' Тогда
		ш = 1;
	КонецЕсли;
		
	
	ТабДокДата = Новый ТабличныйДокумент;
	ДатаСтрока = Макет.ПолучитьОбласть("Дата|ТрэвелЛайн");
	
	ОтборСтроки = Новый Структура("Дата", СтрокаТЗАналитика.Дата);
	СтрокиОтели = ТЗАналитикаОтели.НайтиСтроки(ОтборСтроки);
	
	//Цена = 0; Количество = 0;
	//Для Каждого Строка Из СтрокиОтели Цикл
	//	Если Строка.Цена = 0 Тогда Продолжить; КонецЕсли;
	//	
	//	Цена = Цена + Строка.Цена;
	//	Количество = Количество + 1;
	//КонецЦикла;
	//
	//Если Количество = 0	Тогда
	//	ЦенаКонкурентовАналитика = СтрокаТЗАналитика.ЦенаКонкурентовАналитика;
	//Иначе
	//	ЦенаКонкурентовАналитика = Окр(Цена / Количество);
	//КонецЕсли;	
	
	ЦенаКонкурентовАналитика = КалендарьЦен.СредняяЦенаКонкурентовАналитика(СтрокиОтели, СтрокаТЗАналитика.ЦенаКонкурентовАналитика);

	ДатаСтрока.Параметры.ЦенаАналитика = ЦенаКонкурентовАналитика;
	
	РасшифровкаЦенаАналитика = Новый Структура("Расшифровка, Дата", "РасшифровкаЦенаАналитика", СтрокаТЗАналитика.Дата); 
	ДатаСтрока.Параметры.РасшифровкаЦенаАналитика = РасшифровкаЦенаАналитика;
	
	Если ЦенаКонкурентовАналитика > 0 Тогда
		ДатаСтрока.Область(1, 1, 1, 1).ЦветФона = Новый Цвет(0, 255, 255);
	КонецЕсли;
	
	ТабДокДата.Вывести(ДатаСтрока);
	
	Для Каждого СтрокаОтели Из ТЗОтели Цикл		
		ДатаОтели = Макет.ПолучитьОбласть("Дата|ТрэвелЛайнОтели");
		
		ОтборСтроки = Новый Структура("Дата, Отель", СтрокаТЗАналитика.Дата, СтрокаОтели.Отель);
		НайденныеСтрокиОтели = ТЗАналитикаОтели.НайтиСтроки(ОтборСтроки);
		//Если НайденныеСтрокиОтели.Количество() > 0 Тогда
		//	НайденнаяСтрокаОтели = НайденныеСтрокиОтели[0];
		//	Если НайденнаяСтрокаОтели.ПродажиЗакрыты Тогда
		//		ДатаОтели.Параметры.ЦенаОтель = "Х";
		//	Иначе	
		//		ДатаОтели.Параметры.ЦенаОтель = НайденныеСтрокиОтели[0].Цена;
		//	КонецЕсли;
		//КонецЕсли;
		
		Если НайденныеСтрокиОтели.Количество() > 0 Тогда
			ДатаОтели.Параметры.ЦенаОтель = КалендарьЦен.ОтчетЦенаОтель(НайденныеСтрокиОтели[0]);
		КонецЕсли;
		
		ТабДокДата.Вывести(ДатаОтели);
	КонецЦикла;
	
	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;
ТаблицаВывод.Вывести(ТабДок);
//

//
ТабДок = Новый ТабличныйДокумент;

ТабДокЗаголовки = Новый ТабличныйДокумент;
ЗаголовкиОтступ = Макет.ПолучитьОбласть("ШапкаВерх|Активность");
ТабДокЗаголовки.Вывести(ЗаголовкиОтступ);

ТабДок.Присоединить(ТабДокЗаголовки);

ДеньНедели = ДеньНедели(ДатаС);
День = ДеньНедели - 1;
Пока День > 0 Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ТабДок.Присоединить(ТабДокДата);
	
	День = День - 1;
КонецЦикла;

Для Каждого СтрокаТЗАналитика Из НайденныеСтрокиТЗАналитика Цикл
	
	//
	ТабДокДата = Новый ТабличныйДокумент;
	ДатаСтрока = Макет.ПолучитьОбласть("Дата|Активность");
	
	ДатаСтрока = Макет.ПолучитьОбласть("Дата|Активность");
	
	Если  СтрокаТЗАналитика.АктивностьКалендарь = "" Тогда
		ДатаСтрока.Параметры.Активность = "-";
	Иначе
		ДатаСтрока.Параметры.Активность = СтрокаТЗАналитика.АктивностьКалендарь;
	КонецЕсли;
	
	ТабДокДата.Вывести(ДатаСтрока);
	
	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;
ТаблицаВывод.Вывести(ТабДок);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЯчейкиОтчета(ДТН, Обл)
Если ДТН < ДокументыСервер.ДатаПереходаНаНовыйКалендарьЦен() Тогда
	ЗаполнитьЯчейкиОтчета_OLD(ДТН, Обл);
	
	Возврат;	
КонецЕсли;

Если ДТН = '20240706' Тогда
	ш = 1;
КонецЕсли;

Результат = ПолучитьЦены(ДТН);

БазоваяЦенаДняОдноместный = Результат.БазоваяЦенаДняОдноместный;
БазоваяЦенаДняДвухместный = Результат.БазоваяЦенаДняДвухместный;
ИзменениеБазовойЦены = Результат.ИзменениеБазовойЦены;

ДолгосрочнаяЦенаДняОдноместный = Результат.ДолгосрочнаяЦенаДняОдноместный;
ДолгосрочнаяЦенаДняДвухместный = Результат.ДолгосрочнаяЦенаДняДвухместный;
ИзменениеДолгосрочнойЦеныДня = Результат.ИзменениеДолгосрочнойЦеныДня;

ТекущаяЦенаДняОдноместный = Результат.ТекущаяЦенаДняОдноместный;
ТекущаяЦенаДняДвухместный = Результат.ТекущаяЦенаДняДвухместный;
ИзменениеТекущейЦеныДня = Результат.ИзменениеТекущейЦеныДня;

Если Объект.КатегорияНомера.ТолькоОдноместный Тогда
	Обл.Параметры["БЦ"+ДеньНедели(ДТН)] = Формат(БазоваяЦенаДняОдноместный, "ЧГ="); 							
	Обл.Параметры["ДЦ"+ДеньНедели(ДТН)] = Формат(ДолгосрочнаяЦенаДняОдноместный, "ЧГ="); 							
	Обл.Параметры["ТЦ"+ДеньНедели(ДТН)] = Формат(ТекущаяЦенаДняОдноместный, "ЧГ="); 							
Иначе	
	Обл.Параметры["БЦ"+ДеньНедели(ДТН)] = Формат(БазоваяЦенаДняОдноместный, "ЧГ=")+" / "+Формат(БазоваяЦенаДняДвухместный, "ЧГ="); 							
	Обл.Параметры["ДЦ"+ДеньНедели(ДТН)] = Формат(ДолгосрочнаяЦенаДняОдноместный, "ЧГ=")+" / "+Формат(ДолгосрочнаяЦенаДняДвухместный, "ЧГ="); 							
	Обл.Параметры["ТЦ"+ДеньНедели(ДТН)] = Формат(ТекущаяЦенаДняОдноместный, "ЧГ=")+" / "+Формат(ТекущаяЦенаДняДвухместный, "ЧГ="); 							
КонецЕсли;
	
ОбластьСтрока = Обл.Область(1,ДеньНедели(ДТН), 3, ДеньНедели(ДТН));
ОбластьДата = Обл.Область(1, ДеньНедели(ДТН), 1, ДеньНедели(ДТН));
ОбластьБазоваяЦена = Обл.Область(2, ДеньНедели(ДТН), 2, ДеньНедели(ДТН));
ОбластьДолгосрочнаяЦена = Обл.Область(3, ДеньНедели(ДТН), 3, ДеньНедели(ДТН));
ОбластьТекущаяЦена = Обл.Область(4, ДеньНедели(ДТН), 4, ДеньНедели(ДТН));

УстановитьЦветЯчеек(ДТН, БазоваяЦенаДняОдноместный, ТекущаяЦенаДняОдноместный
	, ИзменениеБазовойЦены, ИзменениеДолгосрочнойЦеныДня, ИзменениеТекущейЦеныДня
	, ОбластьСтрока, ОбластьДата, ОбластьБазоваяЦена, ОбластьДолгосрочнаяЦена, ОбластьТекущаяЦена);

РасшифровкаДолгосрочнаяЦена = Новый Структура("Расшифровка, Дата, КатегорияНомера, БезЗавтрака, ВидЦены"
	, "РасшифровкаДолгосрочнаяЦена", ДТН, Объект.КатегорияНомера, Объект.БезЗавтрака, ВидЦеныДолгосрочная ); 
	
ОбластьДолгосрочнаяЦена.Расшифровка = РасшифровкаДолгосрочнаяЦена;

РасшифровкаТекущаяЦена = Новый Структура("Расшифровка, Дата, КатегорияНомера, БезЗавтрака, ВидЦены"
	, "РасшифровкаТекущаяЦена", ДТН, Объект.КатегорияНомера, Объект.БезЗавтрака, ВидЦеныТекущая);
	
ОбластьТекущаяЦена.Расшифровка = РасшифровкаТекущаяЦена;
КонецПроцедуры

&НаСервере
Функция ПолучитьЦены(ДТН)
//МодульОбработки = Обработки.КалендарьЦен1;
МодульОбработки = КалендарьЦен; 

// + Базовая цена
РезультатБазоваяЦена = МодульОбработки.ПолучитьБазоваяЦенаДня(ДТН, Объект.КатегорияНомера, Объект.БезЗавтрака);
БазоваяЦенаДняОдноместный = РезультатБазоваяЦена.БазоваяЦенаДняОдноместный;
БазоваяЦенаДняДвухместный = РезультатБазоваяЦена.БазоваяЦенаДняДвухместный;
БазоваяДоплатаЗаКатегорию = РезультатБазоваяЦена.БазоваяДоплатаЗаКатегорию;
ИзменениеБазовойЦены = Ложь;

БазоваяЦенаДняОдноместный = БазоваяЦенаДняОдноместный + БазоваяДоплатаЗаКатегорию;
БазоваяЦенаДняДвухместный = БазоваяЦенаДняДвухместный + БазоваяДоплатаЗаКатегорию;
// - Базовая цена

// + Долгосрочная Базовая цена
РезультатДолгосрочнаяЦена = МодульОбработки.ПолучитьДолгосрочнаяЦенаДня(ДТН, Объект.КатегорияНомера, Объект.БезЗавтрака);
ДолгосрочнаяЦенаДняОдноместный = РезультатДолгосрочнаяЦена.ДолгосрочнаяЦенаДняОдноместный;
ДолгосрочнаяЦенаДняДвухместный = РезультатДолгосрочнаяЦена.ДолгосрочнаяЦенаДняДвухместный;
ДолгосрочнаяДоплатаЗаКатегорию = РезультатДолгосрочнаяЦена.ДолгосрочнаяДоплатаЗаКатегорию;
ИзменениеДолгосрочнойЦеныДня = РезультатДолгосрочнаяЦена.ИзменениеДолгосрочнойЦеныДня;

ДолгосрочнаяЦенаДняОдноместный = ДолгосрочнаяЦенаДняОдноместный + ДолгосрочнаяДоплатаЗаКатегорию;
ДолгосрочнаяЦенаДняДвухместный = ДолгосрочнаяЦенаДняДвухместный + ДолгосрочнаяДоплатаЗаКатегорию;
// - Долгосрочная Базовая цена

// + Текущая Базовая цена
РезультатЦенаДня = МодульОбработки.ПолучитьТекущаяЦенаДня(ДТН, Объект.КатегорияНомера, Объект.БезЗавтрака);
ТекущаяЦенаДняОдноместный = РезультатЦенаДня.ТекущаяЦенаДняОдноместный;
ТекущаяЦенаДняДвухместный = РезультатЦенаДня.ТекущаяЦенаДняДвухместный;
ИзменениеТекущейЦеныДня = РезультатЦенаДня.ИзменениеТекущейЦеныДня;
// - Текущая Базовая цена

Строка = "БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный, ИзменениеБазовойЦены"
		+ ", ДолгосрочнаяЦенаДняОдноместный, ДолгосрочнаяЦенаДняДвухместный, ИзменениеДолгосрочнойЦеныДня"
		+ ", ТекущаяЦенаДняОдноместный, ТекущаяЦенаДняДвухместный, ИзменениеТекущейЦеныДня";
Результат = Новый Структура(Строка
	,БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный, ИзменениеБазовойЦены
	, ДолгосрочнаяЦенаДняОдноместный, ДолгосрочнаяЦенаДняДвухместный, ИзменениеДолгосрочнойЦеныДня
	, ТекущаяЦенаДняОдноместный, ТекущаяЦенаДняДвухместный, ИзменениеТекущейЦеныДня);  
	
Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьЦветЯчеек(ДТН, БазоваяЦенаОдноместный, ТекущаяЦенаОдноместный
		, ИзменениеБазовойЦены, ИзменениеДолгосрочнойЦеныДня, ИзменениеТекущейЦеныДня
		, ОбластьСтрока, ОбластьДата, ОбластьБазоваяЦена, ОбластьДолгосрочнаяЦена, ОбластьТекущаяЦена)
//Если ДТН = '20240304' Тогда
//	ш = 1;
//КонецЕсли;
	
Если СписВыбранных.НайтиПоЗначению(ДТН) <> Неопределено тогда
	ОбластьСтрока.ЦветФона=Новый Цвет(102, 144, 198);
	
	Возврат;
Иначе	
	ОбластьДата.ЦветФона=Новый Цвет(240, 240, 24);
КонецЕсли;	
	
//Если ИзменениеБазовойЦены Тогда	
//	ОбластьБазоваяЦена.ЦветФона = Новый Цвет(255, 200, 180);
//Иначе
//	ОбластьБазоваяЦена.ЦветФона = Новый Цвет(255, 255, 255);
//КонецЕсли;
ОбластьБазоваяЦена.ЦветФона = Новый Цвет(255, 255, 255);

Если ИзменениеДолгосрочнойЦеныДня Тогда	
	ОбластьДолгосрочнаяЦена.ЦветФона = Новый Цвет(230, 230, 255);
Иначе
	ОбластьДолгосрочнаяЦена.ЦветФона = Новый Цвет(255, 255, 255);
КонецЕсли;

Если БазоваяЦенаОдноместный > ТекущаяЦенаОдноместный Тогда
	ОбластьТекущаяЦена.ЦветФона = Новый Цвет(235, 255, 230);
ИначеЕсли ТекущаяЦенаОдноместный > БазоваяЦенаОдноместный Тогда
	ОбластьТекущаяЦена.ЦветФона = Новый Цвет(255, 215, 205);
Иначе	
	ОбластьТекущаяЦена.ЦветФона = Новый Цвет(255, 255, 255);
КонецЕсли;	

//Если ИзменениеТекущейЦеныДня Тогда	
//	ОбластьТекущаяЦена.ЦветФона = Новый Цвет(230, 230, 255);
//Иначе
//	Если ИзменениеДолгосрочнойЦеныДня Тогда	
//		ОбластьТекущаяЦена.ЦветФона = Новый Цвет(204, 255, 204);
//	Иначе
//		ОбластьТекущаяЦена.ЦветФона = Новый Цвет(255, 255, 255);
//	КонецЕсли;
//КонецЕсли
КонецПроцедуры
//

//
&НаСервере
Процедура ЗаполнитьЯчейкиОтчета_OLD(ДТН, Обл)
	//Если дтн = '20230705' Тогда 
	//	ш = 1;
	//КонецЕсли;
	
// + Базовая цена
Результат = КалендарьЦен_Старый.ПолучитьБазоваяЦенаДня(ДТН, ТЗБазовыеЦены_OLD, БТ_OLD, БТ_Вых_OLD
	, Объект.КатегорияНомера, Объект.БезЗавтрака, Ложь, ПроцентСкидкиБезЗавтрака_OLD);
БазоваяЦенаДняОдноместный = Результат.БазовыйТарифДатаЦены;

Результат = КалендарьЦен_Старый.ПолучитьБазоваяЦенаДня(ДТН, ТЗБазовыеЦены_OLD, БТ_2_OLD, БТ_Вых_2_OLD
	, Объект.КатегорияНомера, Объект.БезЗавтрака, Истина, ПроцентСкидкиБезЗавтрака_OLD);
БазоваяЦенаДняДвухместный = Результат.БазовыйТарифДатаЦены;

Обл.Параметры["БЦ"+ДеньНедели(ДТН)] = Формат(БазоваяЦенаДняОдноместный, "ЧГ=")+" / "+Формат(БазоваяЦенаДняДвухместный, "ЧГ="); 							
// - Базовая цена

РезультатЦенаДня = КалендарьЦен_Старый.ЦенаДня(ДТН, ТЗЦен_OLD, Объект.КатегорияНомера, Объект.БезЗавтрака, ПроцентСкидкиБезЗавтрака_OLD
	, БазоваяЦенаДняОдноместный, БазоваяЦенаДняДвухместный);
	
ЦенаДня = РезультатЦенаДня.ЦенаДняОдноместный;
ЦенаДня2 = РезультатЦенаДня.ЦенаДняДвухместный;
Обл.Параметры["ТЦ"+ДеньНедели(ДТН)]=Формат(ЦенаДня, "ЧГ=")+" / "+Формат(ЦенаДня2, "ЧГ="); 							

ОбластьСтрока = Обл.Область(1,ДеньНедели(ДТН), 3, ДеньНедели(ДТН));
ОбластьБазоваяЦена = Обл.Область(2, ДеньНедели(ДТН), 2, ДеньНедели(ДТН));
УстановитьЦветЯчеек_OLD(ДТН, РезультатЦенаДня, ОбластьСтрока, ОбластьБазоваяЦена);
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветЯчеек_OLD(ДТН, РезультатЦенаДня, ОбластьСтрока, ОбластьБазоваяЦена)
ИзменениеЦеныОдноместный = РезультатЦенаДня.ИзменениеЦеныОдноместный;
ИзменениеЦеныДвухместный = РезультатЦенаДня.ИзменениеЦеныДвухместный;	
	
Если ИзменениеЦеныОдноместный > 0 тогда							
	ОбластьСтрока.ЦветФона=Новый Цвет(117, 253, 79);
ИначеЕсли ИзменениеЦеныОдноместный < 0 тогда
	ОбластьСтрока.ЦветФона=Новый Цвет(255, 208, 198);
ИначеЕсли ИзменениеЦеныДвухместный > 0 тогда	
	ОбластьСтрока.ЦветФона=Новый Цвет(117, 253, 79);
ИначеЕсли ИзменениеЦеныДвухместный < 0 тогда
	ОбластьСтрока.ЦветФона=Новый Цвет(255, 208, 198);
Иначе
	ОбластьСтрока.ЦветФона=Новый Цвет(255,255,255);
КонецЕсли;

Если СписВыбранных.НайтиПоЗначению(ДТН) <> Неопределено тогда
	ОбластьСтрока.ЦветФона=Новый Цвет(102, 144, 198);
иначеЕсли ДТН=НачалоДня(ТекущаяДата()) тогда
	ОбластьСтрока.ЦветФона=Новый Цвет(255, 210, 0);	  
КонецЕсли;

ТочноеСоответствие = ТочноеСоответствиеДатаБазовойЦены(ДТН);
Если ТочноеСоответствие Тогда
	ОбластьБазоваяЦена.ЦветФона = Новый Цвет(255, 180, 255);
КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТочноеСоответствиеДатаБазовойЦены(ДатаЦены)
Если Объект.БезЗавтрака И ПроцентСкидкиБезЗавтрака_OLD <> 0 Тогда
	БезЗавтрака_П = Ложь;
Иначе
	БезЗавтрака_П = Объект.БезЗавтрака;
КонецЕсли;
	
ОтборСтроки = Новый Структура("ДатаЦены , КатегорияНомера, БезЗавтрака", ДатаЦены, Объект.КатегорияНомера, БезЗавтрака_П );
НайденныеСтроки = ТЗБазовыеЦены_OLD.НайтиСтроки(ОтборСтроки);
	
ТочноеСоответствие = НайденныеСтроки.Количество() <> 0;
Возврат ТочноеСоответствие;
КонецФункции
//
//// - Обновить ПолеОтчета 


//// + Отметка Измение данных
&НаКлиенте
Процедура ПолеОтчетаВыбор(Элемент, Область, СтандартнаяОбработка)
ОбластьИмя = Область.Имя;	
ПолеОтчетаВыборНаСервере(ОбластьИмя);
КонецПроцедуры

&НаСервере
Процедура ПолеОтчетаВыборНаСервере(ОбластьИмя)
ТекПол = ПараметрыСеанса.ТекущийПользователь;
Если ТекПол.ТолькоПросмотр Тогда Возврат; КонецЕсли; 	
	
Область = ПолеОтчета.Область(ОбластьИмя);

Попытка
	Если Область.верх = 1 тогда // пн вт ..
		//Для Сч=1 По 12 Цикл
		ш =1;
		Для Сч = 0 По 11 Цикл
			//ОбластьПоиск=ПолеОтчета.Область(2 + сч * 4, Область.Лево, 2 + сч * 4, Область.Лево);
			ОбластьПоиск=ПолеОтчета.Область(2 + сч * 4 + (сч + 1) * 1 + Сч * Сдвиг, Область.Лево, 2 + сч * 4 + (сч + 1) * 1 + Сч * Сдвиг, Область.Лево);
			
			ДТ=ОбластьПоиск.Значение;
			
			Если ЗначениеЗаполнено(ДТ) тогда
				Если ДТ < ДокументыСервер.ДатаПереходаНаНовыйКалендарьЦен() Тогда
					Продолжить;
				КонецЕсли;	
				
				ПоискЗНЧ=СписВыбранных.НайтиПоЗначению(ДТ);
				Если ПоискЗНЧ=Неопределено тогда
					СписВыбранных.Добавить(ДТ);
					ПолеОтчета.Область(ОбластьПоиск.Верх,ОбластьПоиск.Лево,ОбластьПоиск.Верх + 3,ОбластьПоиск.Лево).ЦветФона=Новый Цвет(102, 144, 198);
				иначе
					СписВыбранных.Удалить(ПоискЗНЧ);
					
					УстановитьЦветЯчеекВыбор(ДТ, ОбластьПоиск);
				конецесли;	
			КонецЕсли;
		КонецЦикла; 
		
	иначеЕсли Область.лево=1 тогда // месяц целиком
		ш =1;
	
		Для Сч=1 По 35 Цикл
			ОбластьПоиск=ПолеОтчета.Область(Область.Верх,сч+1,Область.Верх,сч+1);
			
			ДТ=ОбластьПоиск.Значение;
			
			Если ЗначениеЗаполнено(ДТ) тогда
				
				Если ДТ < ДокументыСервер.ДатаПереходаНаНовыйКалендарьЦен() Тогда
					Возврат;
				КонецЕсли;
			
				ПоискЗНЧ=СписВыбранных.НайтиПоЗначению(ДТ);
				Если ПоискЗНЧ=Неопределено тогда
					СписВыбранных.Добавить(ДТ);
					
					ПолеОтчета.Область(ОбластьПоиск.Верх,ОбластьПоиск.Лево,ОбластьПоиск.Верх + 3,ОбластьПоиск.Лево).ЦветФона=Новый Цвет(102, 144, 198);
				иначе
					СписВыбранных.Удалить(ПоискЗНЧ);
					
					УстановитьЦветЯчеекВыбор(ДТ, ОбластьПоиск);
				конецесли;	
			КонецЕсли;
		КонецЦикла; 
	иначе
		
		Если ЭтоСтрокаДата(Область.верх, Сдвиг) тогда
			ДТ=Область.Значение;
			
			Если ЗначениеЗаполнено(ДТ) тогда
				Если ДТ < ДокументыСервер.ДатаПереходаНаНовыйКалендарьЦен() Тогда
					Возврат;
				КонецЕсли;	
				
				ПоискЗНЧ=СписВыбранных.НайтиПоЗначению(ДТ);
				Если ПоискЗНЧ=Неопределено тогда
					СписВыбранных.Добавить(ДТ);
					
					ПолеОтчета.Область(Область.Верх,Область.Лево,Область.Верх + 3,Область.Лево).ЦветФона=Новый Цвет(102, 144, 198);
				иначе
					СписВыбранных.Удалить(ПоискЗНЧ);

					УстановитьЦветЯчеекВыбор(ДТ, Область);
				конецесли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
Исключение
	
КонецПопытки; 
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветЯчеекВыбор(ДТ, Область)
Результат = ПолучитьЦены(ДТ);
ИзменениеБазовойЦены = Результат.ИзменениеБазовойЦены;
ИзменениеДолгосрочнойЦеныДня = Результат.ИзменениеДолгосрочнойЦеныДня;
ИзменениеТекущейЦеныДня = Результат.ИзменениеТекущейЦеныДня;

ОбластьСтрока = ПолеОтчета.Область(Область.Верх, Область.Лево, Область.Верх + 2, Область.Лево);
ОбластьДата = ПолеОтчета.Область(Область.Верх, Область.Лево, Область.Верх, Область.Лево);
ОбластьБазоваяЦена = ПолеОтчета.Область(Область.Верх + 1, Область.Лево, Область.Верх + 1, Область.Лево);
ОбластьДолгосрочнаяЦена = ПолеОтчета.Область(Область.Верх + 2, Область.Лево, Область.Верх + 2, Область.Лево);
ОбластьТекущаяЦена = ПолеОтчета.Область(Область.Верх + 3, Область.Лево, Область.Верх + 3, Область.Лево);

УстановитьЦветЯчеек(ДТ, Результат.БазоваяЦенаДняОдноместный, Результат.ТекущаяЦенаДняОдноместный
		, ИзменениеБазовойЦены, ИзменениеДолгосрочнойЦеныДня, ИзменениеТекущейЦеныДня
		, ОбластьСтрока, ОбластьДата, ОбластьБазоваяЦена, ОбластьДолгосрочнаяЦена, ОбластьТекущаяЦена)
КонецПроцедуры
//

&НаСервере
Функция Сдвиг()
Сдвиг_1 = 1 + ТЗКатегорииНомеров.Количество();
Сдвиг_2 = 2 + ТЗКатегорииНомеров.Количество();
Сдвиг_3 = 3;
Сдвиг_4 = 1;
Сдвиг_5 = 1 + ТЗОтели.Количество();
Сдвиг_6 = 1;

Сдвиг = Сдвиг_1 + Сдвиг_2 + Сдвиг_3 + Сдвиг_4  + Сдвиг_5 + Сдвиг_6;

Возврат Сдвиг;
КонецФункции
//

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоСтрокаДата(НомерСтроки, Сдвиг)
НомерСтроки_П = НомерСтроки - 1;

Сдвиг_П = Сдвиг + 5;

НомерСтроки_П1 = Цел(НомерСтроки_П/Сдвиг_П) * Сдвиг_П + 2;

Если НомерСтроки_П = НомерСтроки_П1 тогда
	Возврат Истина;
иначе
	Возврат Ложь;
КонецЕсли;
КонецФункции
//

&НаКлиенте
Процедура ИзменитьВыбранные(Команда)
Если СписВыбранных.Количество()= 0 тогда Возврат; КонецЕсли;

СписВыбранных.СортироватьПоЗначению(НаправлениеСортировки.Возр);

Если РазныеБазовыеЦеныВСписВыбранных() Тогда
	ПоказатьПредупреждение(, "Разные текущие базовые цены в выбранных датах.
		|
		|ИЗМЕНЕНИЕ ОТМЕНЯЕТСЯ ...");
	
	Возврат;
КонецЕсли;

ПараметыФормы = Новый Структура;
ПараметыФормы.Вставить("БезЗавтрака", Объект.БезЗавтрака);

МассивВыбранных = Новый Массив;
Для Каждого Элемент Из СписВыбранных Цикл
	МассивВыбранных.Добавить(Элемент.Значение);
КонецЦикла;

ПараметыФормы.Вставить("МассивВыбранных", МассивВыбранных);

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыКалендарьЦенЦены", ЭтаФорма);

ИмяОбработки = ОбщийФункционалКлиентСервер.ИмяОбработки(ЭтаФорма);
ОткрытьФорму("Обработка." + ИмяОбработки + ".Форма.УстановитьЦены", ПараметыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыКалендарьЦенЦены(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

ИзменитьВыбранныеНаСервере(Результат);
КонецПроцедуры

&НаСервере
Процедура ИзменитьВыбранныеНаСервере(Результат)

Автор = ПараметрыСеанса.ТекущийПользователь;

Для каждого СтрДТЦ Из СписВыбранных Цикл
	ДатаЦены = СтрДТЦ.Значение;
	//Выходной = (ДеньНедели(ДатаЦены) > 4);
	
	КалендарьЦенБазовая = РегистрыСведений.КалендарьЦенБазовый.СоздатьНаборЗаписей();	
	КалендарьЦенБазовая.Отбор["ДатаЦены"].Значение = ДатаЦены;
	КалендарьЦенБазовая.Отбор["ДатаЦены"].Использование = Истина;
	КалендарьЦенБазовая.Отбор["ВидЦены"].Значение = ВидЦеныТекущая;
	КалендарьЦенБазовая.Отбор["ВидЦены"].Использование = Истина;
	
	КалендарьЦенБазовая.Прочитать();
	КалендарьЦенБазовая.Очистить();	
	
	Если Результат.БазоваяЦенаИсходная <> Результат.БазоваяЦенаТекущая Тогда
		НоваяСтрока = КалендарьЦенБазовая.Добавить();
		НоваяСтрока.ДатаЦены = ДатаЦены;
		НоваяСтрока.ТипЦены = Перечисления.КалендарьЦенТипЦены.БазоваяЦена;
		
		НоваяСтрока.ВидЦены = ВидЦеныТекущая;
		
		НоваяСтрока.ЦенаДоплата = Результат.БазоваяЦенаТекущая;
		
		НоваяСтрока.Автор = Автор;
		НоваяСтрока.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
		
	Если Результат.ДоплатаЗаДвухместныйИсходная <> Результат.ДоплатаЗаДвухместныйТекущая Тогда
		НоваяСтрока = КалендарьЦенБазовая.Добавить();
		НоваяСтрока.ДатаЦены = ДатаЦены;
		НоваяСтрока.ТипЦены = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный;
		
		НоваяСтрока.ВидЦены = ВидЦеныТекущая;
	
		НоваяСтрока.ЦенаДоплата = Результат.ДоплатаЗаДвухместныйТекущая;
		
		НоваяСтрока.Автор = Автор;
		НоваяСтрока.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
	Если Результат.ДоплатаЗаЗавтракИсходная <> Результат.ДоплатаЗаЗавтракТекущая Тогда
		НоваяСтрока = КалендарьЦенБазовая.Добавить();
		НоваяСтрока.ДатаЦены = ДатаЦены;
		НоваяСтрока.ТипЦены = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак;
		
		НоваяСтрока.ВидЦены = ВидЦеныТекущая;
	
		НоваяСтрока.ЦенаДоплата = Результат.ДоплатаЗаЗавтракТекущая;
		
		НоваяСтрока.Автор = Автор;
		НоваяСтрока.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	КалендарьЦенБазовая.Записать();
	
	КалендарьЦенКатегории = РегистрыСведений.КалендарьЦенКатегории.СоздатьНаборЗаписей();	
	КалендарьЦенКатегории.Отбор["ДатаЦены"].Значение = ДатаЦены;
	КалендарьЦенКатегории.Отбор["ДатаЦены"].Использование = Истина;
	КалендарьЦенКатегории.Отбор["ВидЦены"].Значение = ВидЦеныТекущая;
	КалендарьЦенКатегории.Отбор["ВидЦены"].Использование = Истина;
	
	КалендарьЦенКатегории.Прочитать();
	КалендарьЦенКатегории.Очистить();		
	Для Каждого Строка Из Результат.ЦеныКатегорииНомеров Цикл	
		Если Строка.ДоплатаЗаКатегориюИсходная = Строка.ДоплатаЗаКатегориюТекущая Тогда Продолжить; КонецЕсли;
		
		ЗаписатьКалендарьЦенКатегорииИстория(ДатаЦены, Автор, Строка.КатегорияНомера, ВидЦеныТекущая
				, Строка.ДоплатаЗаКатегориюТекущая, Строка.ДоплатаЗаКатегориюИсходная); 

		НоваяСтрока = КалендарьЦенКатегории.Добавить();
		НоваяСтрока.ВидЦены = ВидЦеныТекущая;
		
		НоваяСтрока.ДатаЦены = ДатаЦены;
		НоваяСтрока.КатегорияНомера = Строка.КатегорияНомера;
		НоваяСтрока.ДоплатаЗаКатегорию = Строка.ДоплатаЗаКатегориюТекущая;
		
		НоваяСтрока.Автор = Автор;
		НоваяСтрока.ДатаИзменения = ТекущаяДата();
	КонецЦикла;	
	КалендарьЦенКатегории.Записать();
	
	// + КалендарьЦенБазовый История
	ЗаписатьКалендарьЦенБазовыйИстория(ДатаЦены, Автор, Перечисления.КалендарьЦенТипЦены.БазоваяЦена, ВидЦеныТекущая
		, Результат.БазоваяЦенаТекущая, Результат.БазоваяЦенаИсходная);
	ЗаписатьКалендарьЦенБазовыйИстория(ДатаЦены, Автор, Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный, ВидЦеныТекущая
		, Результат.ДоплатаЗаДвухместныйТекущая, Результат.ДоплатаЗаДвухместныйИсходная);
	ЗаписатьКалендарьЦенБазовыйИстория(ДатаЦены, Автор, Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак, ВидЦеныТекущая
		, Результат.ДоплатаЗаЗавтракТекущая, Результат.ДоплатаЗаЗавтракИсходная);
	// - КалендарьЦенБазовый История
КонецЦикла;			

СписВыбранных=Новый СписокЗначений;
//ОбновитьТЗЦен();
ОбновитьГод(Объект.Год);
КонецПроцедуры                   

&НаСервере
Процедура ЗаписатьКалендарьЦенБазовыйИстория(ДатаЦены, Автор, ТипЦены, ВидЦены, ЦенаДоплатаТекущая, ЦенаДоплатаИсходная)
Если ЦенаДоплатаТекущая = ЦенаДоплатаИсходная Тогда Возврат; КонецЕсли;

КалендарьЦенБазовыйИстория = РегистрыСведений.КалендарьЦенБазовыйИстория.СоздатьМенеджерЗаписи();	
КалендарьЦенБазовыйИстория.ВидЦены = ВидЦены;

КалендарьЦенБазовыйИстория.ДатаЦены = ДатаЦены;
КалендарьЦенБазовыйИстория.ТипЦены = ТипЦены;
КалендарьЦенБазовыйИстория.ЦенаДоплата = ЦенаДоплатаТекущая;

КалендарьЦенБазовыйИстория.ДатаВремяИзменения = ТекущаяДата();
КалендарьЦенБазовыйИстория.Автор = Автор;

КалендарьЦенБазовыйИстория.Записать();
КонецПроцедуры                   

&НаСервере
Процедура ЗаписатьКалендарьЦенКатегорииИстория(ДатаЦены, Автор, КатегорияНомера, ВидЦены, ДоплатаЗаКатегориюТекущая, ДоплатаЗаКатегориюИсходная)  
Если ДоплатаЗаКатегориюТекущая = ДоплатаЗаКатегориюИсходная Тогда Возврат; КонецЕсли;

КалендарьЦенКатегорииИстория = РегистрыСведений.КалендарьЦенКатегорииИстория.СоздатьМенеджерЗаписи();	
КалендарьЦенКатегорииИстория.ВидЦены = ВидЦены;

КалендарьЦенКатегорииИстория.ДатаЦены = ДатаЦены;
КалендарьЦенКатегорииИстория.КатегорияНомера = КатегорияНомера;
КалендарьЦенКатегорииИстория.ДоплатаЗаКатегорию = ДоплатаЗаКатегориюТекущая;

КалендарьЦенКатегорииИстория.ДатаВремяИзменения = ТекущаяДата();
КалендарьЦенКатегорииИстория.Автор = Автор;

КалендарьЦенКатегорииИстория.Записать();
КонецПроцедуры                   

&НаСервере
Функция РазныеБазовыеЦеныВСписВыбранных()
Если СписВыбранных.Количество()= 0 тогда Возврат Ложь; КонецЕсли;

СписВыбранных.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
Дата = СписВыбранных[0].Значение; 	
Результат = ПолучитьБазовыеЦеныНаДень(Дата);

БазоваяЦена = Результат.БазоваяЦена;
ДоплатаЗаДвухместный = Результат.ДоплатаЗаДвухместный;
ДоплатаЗаЗавтрак = Результат.ДоплатаЗаЗавтрак;
ДоплатыЗаКатегории = Результат.ДоплатыЗаКатегории;

ЕстьОтклонения = Ложь;
Для Каждого Элемент Из СписВыбранных Цикл
	Дата = Элемент.Значение; 	

	Результат = ПолучитьБазовыеЦеныНаДень(Дата);
	Если НЕ Сравнить_Две_Таблицы_Значений(ДоплатыЗаКатегории, Результат.ДоплатыЗаКатегории) Тогда 
	
		ЕстьОтклонения = Истина;
		Прервать;
	КонецЕсли;
	
	Если БазоваяЦена = Результат.БазоваяЦена 
	И ДоплатаЗаДвухместный = Результат.ДоплатаЗаДвухместный
	И ДоплатаЗаЗавтрак = Результат.ДоплатаЗаЗавтрак
	Тогда Продолжить; КонецЕсли;

	ЕстьОтклонения = Истина;
	Прервать;
КонецЦикла;	

Возврат ЕстьОтклонения;
КонецФункции

&НаСервере
Функция Сравнить_Две_Таблицы_Значений(ТЗn1, ТЗn2) 

   // Данный метод программно сравнивает две таблицы значений по всем признакам
  Если ТипЗнч(ТЗn1) <> Тип("ТаблицаЗначений")  Тогда
       Сообщить("Параметр N1 не является Таблицой значений");
       Возврат Ложь;
   КонецЕсли;

   Если ТипЗнч(ТЗn2) <> Тип("ТаблицаЗначений") Тогда
       Сообщить("Параметр N2 не является Таблицой значений");
       Возврат Ложь;
   КонецЕсли;

   Если ТЗn1.Количество() <> ТЗn2.Количество() Тогда
       Сообщить("Количество строк у таблиц значений различное");
       Возврат Ложь;
   КонецЕсли;

   Если ТЗn1.Колонки.Количество() <> ТЗn2.Колонки.Количество() Тогда
       Сообщить("Количество колонок у таблиц значений различное");
       Возврат Ложь;
   КонецЕсли;

   // Предварительно сортируем обе таблицы по одному и тому же уникальному ключу
  ТЗn1.Сортировать("КатегорияНомера Возр");   // прим. УникКлюч - свой идентиф.
  ТЗn2.Сортировать("КатегорияНомера Возр");

   // Преобразуем
   СтрВнутрТЗn1 = ЗначениеВСтрокуВнутр(ТЗn1.Скопировать());
   СтрВнутрТЗn2 = ЗначениеВСтрокуВнутр(ТЗn2.Скопировать());

   Если СтрВнутрТЗn1 <> СтрВнутрТЗn2 Тогда
       Возврат Ложь;
   Иначе
       Возврат Истина;
   КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьБазовыеЦеныНаДень(Дата) 
//МодульОбработки = Обработки.КалендарьЦен1;	
МодульОбработки = КалендарьЦен;	

ТЗ_БазовыеЦены = МодульОбработки.ПолучитьТЗБазовыеЦены(Дата); 

Если ТЗ_БазовыеЦены.Количество() = 0 Тогда
	БазоваяЦена = 0;	
	ДоплатаЗаЗавтрак = 0;	
	ДоплатаЗаДвухместный = 0;
	
	ДоплатыЗаКатегории = Новый ТаблицаЗначений;
Иначе
	Строка = ТЗ_БазовыеЦены[0];
	
	БазоваяЦена = Строка.БазоваяЦена;	
	ДоплатаЗаЗавтрак = Строка.ДоплатаЗаЗавтрак;	
	ДоплатаЗаДвухместный = Строка.ДоплатаЗаДвухместный;
	
	ДоплатыЗаКатегории = Строка.ДоплатыЗаКатегории;
КонецЕсли;

Результат = Новый Структура("БазоваяЦена, ДоплатаЗаДвухместный, ДоплатаЗаЗавтрак, ДоплатыЗаКатегории"
 ,БазоваяЦена ,ДоплатаЗаДвухместный, ДоплатаЗаЗавтрак, ДоплатыЗаКатегории); 
 
Возврат Результат;
КонецФункции
//

//
&НаКлиенте
Процедура ИзменитьДолгосрочныеЦены(Команда)
ПараметыФормы = Новый Структура;

Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормы_УстановитьДолгосрочныеЦены", ЭтаФорма);

ИмяОбработки = ОбщийФункционалКлиентСервер.ИмяОбработки(ЭтаФорма);
ОткрытьФорму("Обработка." + ИмяОбработки + ".Форма.УстановитьДолгосрочныеЦены", ПараметыФормы, ЭтаФорма
	,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормы_УстановитьДолгосрочныеЦены(Результат, ДополнительныеПараметры) Экспорт
Если Результат = Неопределено Тогда Возврат; КонецЕсли;

ИзменитьДолгосрочныеЦеныНаСервере(Результат);
КонецПроцедуры

&НаСервере
Процедура ИзменитьДолгосрочныеЦеныНаСервере(Результат)

Автор = ПараметрыСеанса.ТекущийПользователь;

ДатаС_П = Результат.ДатаС;
ДатаПо_П = Результат.ДатаПо;

Дата_П = ДатаС_П; 
Пока Дата_П <= ДатаПо_П Цикл
	
	ДатаЦены = Дата_П;
	
	Если Результат.БазоваяЦенаИсходная <> Результат.БазоваяЦенаТекущая Тогда
		КалендарьЦенБазовая = РегистрыСведений.КалендарьЦенБазовый.СоздатьНаборЗаписей();	
		КалендарьЦенБазовая.Отбор["ДатаЦены"].Значение = ДатаЦены;
		КалендарьЦенБазовая.Отбор["ДатаЦены"].Использование = Истина;
		КалендарьЦенБазовая.Отбор["ВидЦены"].Значение = ВидЦеныДолгосрочная;
		КалендарьЦенБазовая.Отбор["ВидЦены"].Использование = Истина;
		КалендарьЦенБазовая.Отбор["ТипЦены"].Значение = Перечисления.КалендарьЦенТипЦены.БазоваяЦена;
		КалендарьЦенБазовая.Отбор["ТипЦены"].Использование = Истина;
		
		КалендарьЦенБазовая.Прочитать();
		КалендарьЦенБазовая.Очистить();			
		
		НоваяСтрока = КалендарьЦенБазовая.Добавить();
		НоваяСтрока.ДатаЦены = ДатаЦены;
		НоваяСтрока.ТипЦены = Перечисления.КалендарьЦенТипЦены.БазоваяЦена;
		
		НоваяСтрока.ВидЦены = ВидЦеныДолгосрочная;
		
		НоваяСтрока.ЦенаДоплата = Результат.БазоваяЦенаТекущая;
		
		НоваяСтрока.Автор = Автор;
		НоваяСтрока.ДатаИзменения = ТекущаяДата();
		
		КалендарьЦенБазовая.Записать();	
	КонецЕсли;
		
	Если Результат.ДоплатаЗаДвухместныйИсходная <> Результат.ДоплатаЗаДвухместныйТекущая Тогда
		КалендарьЦенБазовая = РегистрыСведений.КалендарьЦенБазовый.СоздатьНаборЗаписей();	
		КалендарьЦенБазовая.Отбор["ДатаЦены"].Значение = ДатаЦены;
		КалендарьЦенБазовая.Отбор["ДатаЦены"].Использование = Истина;
		КалендарьЦенБазовая.Отбор["ВидЦены"].Значение = ВидЦеныДолгосрочная;
		КалендарьЦенБазовая.Отбор["ВидЦены"].Использование = Истина;
		КалендарьЦенБазовая.Отбор["ТипЦены"].Значение = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный;
		КалендарьЦенБазовая.Отбор["ТипЦены"].Использование = Истина;
		
		НоваяСтрока = КалендарьЦенБазовая.Добавить();
		НоваяСтрока.ДатаЦены = ДатаЦены;
		НоваяСтрока.ТипЦены = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный;
		
		НоваяСтрока.ВидЦены = ВидЦеныДолгосрочная;
		
		НоваяСтрока.ЦенаДоплата = Результат.ДоплатаЗаДвухместныйТекущая;
		
		НоваяСтрока.Автор = Автор;
		НоваяСтрока.ДатаИзменения = ТекущаяДата();
		
		КалендарьЦенБазовая.Записать();	
	КонецЕсли;
	
	Если Результат.ДоплатаЗаЗавтракИсходная <> Результат.ДоплатаЗаЗавтракТекущая Тогда
		КалендарьЦенБазовая = РегистрыСведений.КалендарьЦенБазовый.СоздатьНаборЗаписей();	
		КалендарьЦенБазовая.Отбор["ДатаЦены"].Значение = ДатаЦены;
		КалендарьЦенБазовая.Отбор["ДатаЦены"].Использование = Истина;
		КалендарьЦенБазовая.Отбор["ВидЦены"].Значение = ВидЦеныДолгосрочная;
		КалендарьЦенБазовая.Отбор["ВидЦены"].Использование = Истина;
		КалендарьЦенБазовая.Отбор["ТипЦены"].Значение = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак;
		КалендарьЦенБазовая.Отбор["ТипЦены"].Использование = Истина;
		
		НоваяСтрока = КалендарьЦенБазовая.Добавить();
		НоваяСтрока.ДатаЦены = ДатаЦены;
		НоваяСтрока.ТипЦены = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак;
		
		НоваяСтрока.ВидЦены = ВидЦеныДолгосрочная;
		
		НоваяСтрока.ЦенаДоплата = Результат.ДоплатаЗаЗавтракТекущая;
		
		НоваяСтрока.Автор = Автор;
		НоваяСтрока.ДатаИзменения = ТекущаяДата();
		
		КалендарьЦенБазовая.Записать();	
	КонецЕсли;
	
	Для Каждого Строка Из Результат.ЦеныКатегорииНомеров Цикл	
		Если Строка.ДоплатаЗаКатегориюИсходная = Строка.ДоплатаЗаКатегориюТекущая Тогда Продолжить; КонецЕсли;
			
		//КалендарьЦенКатегории = РегистрыСведений.КалендарьЦенКатегории.СоздатьНаборЗаписей();	
		//КалендарьЦенКатегории.Отбор["ДатаЦены"].Значение = ДатаЦены;
		//КалендарьЦенКатегории.Отбор["ДатаЦены"].Использование = Истина;
		//КалендарьЦенКатегории.Отбор["ВидЦены"].Значение = ВидЦеныДолгосрочная;
		//КалендарьЦенКатегории.Отбор["ВидЦены"].Использование = Истина;
		//КалендарьЦенКатегории.Отбор["КатегорияНомера"].Значение = Строка.КатегорияНомера;
		//КалендарьЦенКатегории.Отбор["КатегорияНомера"].Использование = Истина;
		//
		//КалендарьЦенКатегории.Прочитать();
		//КалендарьЦенКатегории.Очистить();			
		//
		//НоваяСтрока = КалендарьЦенКатегории.Добавить();
		//НоваяСтрока.ДатаЦены = ДатаЦены;
		//НоваяСтрока.КатегорияНомера = Строка.КатегорияНомера;
		//
		//НоваяСтрока.ВидЦены = ВидЦеныДолгосрочная;
		//
		//НоваяСтрока.ДоплатаЗаКатегорию = Строка.ДоплатаЗаКатегориюТекущая;
		//
		//НоваяСтрока.Автор = Автор;
		//НоваяСтрока.ДатаИзменения = ТекущаяДата();
		
		КалендарьЦенКатегории = РегистрыСведений.КалендарьЦенКатегории.СоздатьМенеджерЗаписи();	
		//КалендарьЦенКатегории.Отбор["ДатаЦены"].Значение = ДатаЦены;
		//КалендарьЦенКатегории.Отбор["ДатаЦены"].Использование = Истина;
		//КалендарьЦенКатегории.Отбор["ВидЦены"].Значение = ВидЦеныДолгосрочная;
		//КалендарьЦенКатегории.Отбор["ВидЦены"].Использование = Истина;
		//КалендарьЦенКатегории.Отбор["КатегорияНомера"].Значение = Строка.КатегорияНомера;
		//КалендарьЦенКатегории.Отбор["КатегорияНомера"].Использование = Истина;
		//
		//КалендарьЦенКатегории.Прочитать();
		//КалендарьЦенКатегории.Очистить();			
		//
		//НоваяСтрока = КалендарьЦенКатегории.Добавить();
		
		КалендарьЦенКатегории.ДатаЦены = ДатаЦены;
		КалендарьЦенКатегории.КатегорияНомера = Строка.КатегорияНомера;
		
		КалендарьЦенКатегории.ВидЦены = ВидЦеныДолгосрочная;
		
		КалендарьЦенКатегории.ДоплатаЗаКатегорию = Строка.ДоплатаЗаКатегориюТекущая;
		
		КалендарьЦенКатегории.Автор = Автор;
		КалендарьЦенКатегории.ДатаИзменения = ТекущаяДата();
		
		КалендарьЦенКатегории.Записать();
		
		ЗаписатьКалендарьЦенКатегорииИстория(ДатаЦены, Автор, Строка.КатегорияНомера, ВидЦеныДолгосрочная 
			, Строка.ДоплатаЗаКатегориюТекущая, Строка.ДоплатаЗаКатегориюИсходная); 
	КонецЦикла;	
	
	// + КалендарьЦенБазовый История
	ЗаписатьКалендарьЦенБазовыйИстория(ДатаЦены, Автор, Перечисления.КалендарьЦенТипЦены.БазоваяЦена, ВидЦеныДолгосрочная
		, Результат.БазоваяЦенаТекущая, Результат.БазоваяЦенаИсходная);
	ЗаписатьКалендарьЦенБазовыйИстория(ДатаЦены, Автор, Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный, ВидЦеныДолгосрочная
		, Результат.ДоплатаЗаДвухместныйТекущая, Результат.ДоплатаЗаДвухместныйИсходная);
	ЗаписатьКалендарьЦенБазовыйИстория(ДатаЦены, Автор, Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак, ВидЦеныДолгосрочная
		, Результат.ДоплатаЗаЗавтракТекущая, Результат.ДоплатаЗаЗавтракИсходная);
	// - КалендарьЦенБазовый История

	Дата_П = Дата_П + 24 * 60 * 60;	
КонецЦикла;			

СписВыбранных=Новый СписокЗначений;
//ОбновитьТЗЦен();
ОбновитьГод(Объект.Год);   
КонецПроцедуры                   
//



// + Отбор дат
&НаКлиенте
Процедура ОтборДат(Команда)
ДанныеВыбора = ПолеОтчета.ТекущаяОбласть.Имя;

МассивЧисел = НайтиЧислаВСтроке(ДанныеВыбора);

Если МассивЧисел.Количество() = 2 Тогда
	МассивЧисел.Добавить(МассивЧисел[0]);	
	
	МассивЧисел.Добавить(МассивЧисел[1]);	
КонецЕсли;	

НомерСтроки = МассивЧисел[0]; 
НачалоНомерСтолбца = МассивЧисел[1];
КонецНомерСтолбца = МассивЧисел[3];

НомерСтроки = МассивЧисел[0]; 
НачалоНомерСтолбца = МассивЧисел[1];
КонецНомерСтолбца = МассивЧисел[3];

ОграничениеНомераСтроки = (НомерСтроки >= ВысотаПолеОтчетаМинимум) И  (НомерСтроки <= ВысотаПоляОтчетаМаксимум);

Если ОграничениеНомераСтроки Тогда

	СтрокаШиринаПолеОтчета = ШиринаПолеОтчета[НомерСтроки - ВысотаПолеОтчетаМинимум]; 

	ОграничениеНомераСтолбца = (НачалоНомерСтолбца >= СтрокаШиринаПолеОтчета.ШиринаПолеОтчетаМинимум) 
							И  (КонецНомерСтолбца <=  СтрокаШиринаПолеОтчета.ШиринаПоляОтчетаМаксимум);

	ЭтоСтрокаДата = ЭтоСтрокаДата(МассивЧисел[0], Сдвиг);
	Если ОграничениеНомераСтроки И ОграничениеНомераСтолбца
	И ЭтоСтрокаДата 
	И МассивЧисел[0] = МассивЧисел[2]	
	Тогда

		ДатаС_ОтборДат = ПолеОтчета.Область("R" + Строка(НомерСтроки) + "C" +  Строка(МассивЧисел[1])).Текст;
		ДатаПо_ОтборДат = ПолеОтчета.Область("R" + Строка(НомерСтроки) + "C" +  Строка(МассивЧисел[3])).Текст;
		
		Элементы.ПолеОтчетаКонтекстноеМенюОтборДат.Видимость = Истина;
	
	Иначе	
		ДатаС_ОтборДат = "***";
		ДатаПо_ОтборДат = "***";
		
		Возврат;
	КонецЕсли;	
Иначе
	ДатаС_ОтборДат = "***";
	ДатаПо_ОтборДат = "***";
	
	Возврат;
КонецЕсли;

Для НомерСтолбца = НачалоНомерСтолбца По КонецНомерСтолбца Цикл
	Область = ПолеОтчета.Область(НомерСтроки, НомерСтолбца, НомерСтроки, НомерСтолбца);  
	
	ДТ=Область.Значение;
	Если ЗначениеЗаполнено(ДТ) тогда
		
		Если ДТ < ДокументыСервер.ДатаПереходаНаНовыйКалендарьЦен() Тогда
			Продолжить;
		КонецЕсли;
		
		ПоискЗНЧ=СписВыбранных.НайтиПоЗначению(ДТ);
		Если ПоискЗНЧ=Неопределено тогда
			СписВыбранных.Добавить(ДТ);
			
			ПолеОтчета.Область(Область.Верх,Область.Лево,Область.Верх + 3,Область.Лево).ЦветФона=Новый Цвет(102, 144, 198);
		иначе
			СписВыбранных.Удалить(ПоискЗНЧ);
			Если ДТ=НачалоДня(ТекущаяДата()) тогда
				ПолеОтчета.Область(Область.Верх,Область.Лево+ 1, Область.Верх + 3, Область.Лево).ЦветФона=Новый Цвет(220, 248, 88);	
			иначе
				ПолеОтчета.Область(Область.Верх + 1, Область.Лево, Область.Верх + 3, Область.Лево).ЦветФона=Новый Цвет(255, 255, 255);
			КонецЕсли;
			ПолеОтчета.Область(Область.Верх, Область.Лево, Область.Верх, Область.Лево).ЦветФона=Новый Цвет(240, 240, 24);
		конецесли;	
	КонецЕсли;
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПолеОтчетаПриАктивизации(Элемент)
ДанныеВыбора = ПолеОтчета.ТекущаяОбласть.Имя;

МассивЧисел = НайтиЧислаВСтроке(ДанныеВыбора);

Если МассивЧисел.Количество() = 2 Тогда
	МассивЧисел.Добавить(МассивЧисел[0]);	
	
	МассивЧисел.Добавить(МассивЧисел[1]);	
КонецЕсли;	

//Если МассивЧисел[0] <> МассивЧисел[2] Тогда
//		
//	Возврат;	
//КонецЕсли;	

НомерСтроки = МассивЧисел[0]; 
НачалоНомерСтолбца = МассивЧисел[1];
КонецНомерСтолбца = МассивЧисел[3];

ОграничениеНомераСтроки = (НомерСтроки >= ВысотаПолеОтчетаМинимум) И  (НомерСтроки <= ВысотаПоляОтчетаМаксимум);

Если ОграничениеНомераСтроки Тогда

	СтрокаШиринаПолеОтчета = ШиринаПолеОтчета[НомерСтроки - ВысотаПолеОтчетаМинимум]; 

	ОграничениеНомераСтолбца = (НачалоНомерСтолбца >= СтрокаШиринаПолеОтчета.ШиринаПолеОтчетаМинимум) 
							И  (КонецНомерСтолбца <=  СтрокаШиринаПолеОтчета.ШиринаПоляОтчетаМаксимум);

	ЭтоСтрокаДата = ЭтоСтрокаДата(МассивЧисел[0], Сдвиг); 
	Если ОграничениеНомераСтроки И ОграничениеНомераСтолбца
	И ЭтоСтрокаДата 
	И МассивЧисел[0] = МассивЧисел[2]	
	Тогда

		ДатаС_ОтборДат = ПолеОтчета.Область("R" + Строка(НомерСтроки) + "C" +  Строка(МассивЧисел[1])).Текст;
		ДатаПо_ОтборДат = ПолеОтчета.Область("R" + Строка(НомерСтроки) + "C" +  Строка(МассивЧисел[3])).Текст;
		
		Элементы.ПолеОтчетаКонтекстноеМенюОтборДат.Видимость = Истина;
	
	Иначе	
		ДатаС_ОтборДат = "***";
		ДатаПо_ОтборДат = "***";
		
		Элементы.ПолеОтчетаКонтекстноеМенюОтборДат.Видимость = Ложь;
	КонецЕсли;	
Иначе
	ДатаС_ОтборДат = "***";
	ДатаПо_ОтборДат = "***";
	
	Элементы.ПолеОтчетаКонтекстноеМенюОтборДат.Видимость = Ложь;
КонецЕсли;	
	
//Элементы.ПолеОтчетаКонтекстноеМенюПолеОтчетаКонтекст.Видимость = ОграничениеНомераСтроки И ОграничениеНомераСтолбца;
КонецПроцедуры

&НаКлиенте
Функция НайтиЧислаВСтроке(Строка) 

МассивЧисел = Новый Массив; // сюда поместим все найденные числа. В данном примере в массив должно попасть 3 числа: 234224, 555 и 1

СтрокаЧисел = "";
Для Индекс = 1 По СтрДлина(Строка) Цикл
	Символ = Сред(Строка, Индекс, 1); // Перебираем все сиволы из нашей строки

	Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
		СтрокаЧисел = СтрокаЧисел + Символ;
	ИначеЕсли СтрДлина(СтрокаЧисел) > 0 Тогда
		МассивЧисел.Добавить(Число(СтрокаЧисел));
	  	СтрокаЧисел = "";
	КонецЕсли;
КонецЦикла;

Если СтрДлина(СтрокаЧисел) > 0 Тогда
	МассивЧисел.Добавить(Число(СтрокаЧисел));
КонецЕсли;

Возврат МассивЧисел;

КонецФункции
// - Отбор дат

//// Отметка - Измение данных


//// + РасчитатьПроживание
&НаКлиенте
Процедура РасчитатьПроживание(Команда)
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("КатегорияНомера", Объект.КатегорияНомера);
ОткрытьФорму("Обработка.РасчетПроживания.Форма.Форма", ПараметрыФормы,
	,,,,, РежимОткрытияОкнаФормы .БлокироватьОкноВладельца);
КонецПроцедуры
//// - РасчитатьПроживание

//
&НаКлиенте
Процедура ОтчетПоИзменениюЦен(Команда)
ОткрытьФорму("Обработка.КалендарьЦен.Форма.ФормаОтчетПоИзменениям",, ЭтаФорма
	,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//

//
&НаКлиенте
Процедура ПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
СтандартнаяОбработка= Ложь;

Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	
	Если Расшифровка.Расшифровка = "РасшифровкаДолгосрочнаяЦена" 
	ИЛИ Расшифровка.Расшифровка = "РасшифровкаТекущаяЦена" 
	Тогда
	
		ТабДок = ПолучитьТабДокРасшифровки(Расшифровка);
			
		ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Расшифровка цены");
			
		ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
	ИначеЕсли Расшифровка.Расшифровка = "РасшифровкаЦенаДата" Тогда
		
		ТабДок = ПолучитьТабДокРасшифровкаКонкурентыЦенаДата(Расшифровка);
		
		ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Цены конкурентов");
			
		ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли Расшифровка.Расшифровка = "РасшифровкаЦенаАналитика" Тогда
		
		ТабДок = КалендарьЦен.ПолучитьТабДокРасшифровкаКонкурентыЦенаАналитика(Расшифровка.Дата, ТЗОтели);
		
		ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТабДок, "Цены конкурентов");
			
		ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ЭтаФорма
			,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТабДокРасшифровки(Расшифровка)
ВидЦены = Расшифровка.ВидЦены;	
ДатаЦены = Расшифровка.Дата;
КатегорияНомера_П = Расшифровка.КатегорияНомера;
БезЗавтрака_П = Расшифровка.БезЗавтрака;

МодульОбработки = КалендарьЦен; 

ТЗ_БазовыеЦены = МодульОбработки.ПолучитьТЗБазовыеЦены(ДатаЦены);
Если ТЗ_БазовыеЦены.Количество() = 0 Тогда
	БазоваяЦена = 0;	
	ДоплатаЗавтрак = 0;	
	ДоплатаДвухместный = 0;
	
	ДоплатаКатегория = 0;
	
	АвторБазоваяЦена = Справочники.Пользователи.ПустаяСсылка();
	ДатаИзмененияБазоваяЦена = '00010101';
Иначе
	Строка = ТЗ_БазовыеЦены[0];
	
	БазоваяЦена = Строка.БазоваяЦена;	
	ДоплатаЗавтрак = Строка.ДоплатаЗаЗавтрак;	
	ДоплатаДвухместный = Строка.ДоплатаЗаДвухместный;
	
	ДоплатыЗаКатегории = Строка.ДоплатыЗаКатегории;
	ОтборСтроки = Новый Структура("КатегорияНомера", КатегорияНомера_П); 	
	НайденныеСтроки = ДоплатыЗаКатегории.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		ДоплатаКатегория = 0;
	Иначе
		ДоплатаКатегория = НайденныеСтроки[0].ДоплатаЗаКатегорию;
	КонецЕсли;	
	
	АвторБазоваяЦена = Строка.Автор;
	ДатаИзмененияБазоваяЦена = Строка.ДатаИзменения;
КонецЕсли;

ТЗ_КалендарьЦенБазовый = МодульОбработки.ПолучитьКалендарьЦенБазовый(ДатаЦены, ВидЦены);

БазоваяЦенаИзменения = Неопределено;
ДоплатаДвухместныйИзменения = Неопределено;
ДоплатаЗавтракИзменения = Неопределено;           

Если ТЗ_КалендарьЦенБазовый.Количество() > 0 Тогда

	Для Каждого Строка Из ТЗ_КалендарьЦенБазовый Цикл
		Если Строка.ТипЦены = Перечисления.КалендарьЦенТипЦены.БазоваяЦена Тогда
			БазоваяЦенаИзменения = Строка.ЦенаДоплата;
			АвторБазоваяЦенаИзменения = Строка.Автор;
			ДатаИзмененияБазоваяЦенаИзменения = Строка.ДатаИзменения;
		ИначеЕсли Строка.ТипЦены =Перечисления.КалендарьЦенТипЦены.ДоплатаЗаДвухместный Тогда
		    ДоплатаДвухместныйИзменения = Строка.ЦенаДоплата;
			АвторДоплатаДвухместныйИзменения = Строка.Автор;
			ДатаИзмененияДоплатаДвухместныйИзменения = Строка.ДатаИзменения;
		ИначеЕсли Строка.ТипЦены = Перечисления.КалендарьЦенТипЦены.ДоплатаЗаЗавтрак Тогда
		    ДоплатаЗавтракИзменения = Строка.ЦенаДоплата;
			АвторДоплатаЗавтракИзменения = Строка.Автор;
			ДатаИзмененияДоплатаЗавтракИзменения = Строка.ДатаИзменения;
		КонецЕсли;		
	КонецЦикла;
КонецЕсли;

ТЗ_КалендарьЦенКатегории = КалендарьЦен.ПолучитьТЗКалендарьЦенКатегории(ДатаЦены, КатегорияНомера_П, ВидЦены);

ДоплатаКатегорияИзменения = Неопределено;
Если ТЗ_КалендарьЦенКатегории.Количество() > 0 Тогда
	Строка = ТЗ_КалендарьЦенКатегории[0];
	
	ДоплатаКатегорияИзменения = Строка.ДоплатаЗаКатегорию;
	АвторДоплатаКатегорияИзменения = Строка.Автор;
	ДатаИзмененияДоплатаКатегорияИзменения = Строка.ДатаИзменения;
КонецЕсли;
 
//
Макет = Обработки.КалендарьЦен.ПолучитьМакет("РасшифровкаЦены");
ТабДок = Новый ТабличныйДокумент;
 
ТабДок1 = Новый ТабличныйДокумент;
Макет1 = Обработки.КалендарьЦен.ПолучитьМакет("РасшифровкаЦеныИтоги");

ШрифтИзменения = Новый Шрифт("Arial", 8, Истина);
ЦветТекстаИзменения = Новый Цвет(150, 50,0);

//
Область = Макет1.ПолучитьОбласть("Заголовок");
СтрокаЗаголовок = "Вид цены: " + ВидЦены + " Дата цены: " + Формат(ДатаЦены, "ДФ=dd.MM.yy") + " Категория: " + Объект.КатегорияНомера;
Если Объект.БезЗавтрака Тогда
	СтрокаЗаголовок = СтрокаЗаголовок + " Без завтрака";
Иначе	
	СтрокаЗаголовок = СтрокаЗаголовок + " Завтрак";
КонецЕсли;	
Область.Параметры.СтрокаЗаголовок = СтрокаЗаголовок;	
ТабДок1.Вывести(Область);
//

Область = Макет1.ПолучитьОбласть("Шапка"); 
ТабДок1.Вывести(Область);

ШиринаТаблицы = Область.ШиринаТаблицы;

//
Область = Макет1.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Базовая цена одноместный";

Цена = 0;
//Если БазоваяЦенаИзменения = Неопределено Тогда
//	Область.Параметры.БазоваяЦена = БазоваяЦена;	
//	Цена = Цена + БазоваяЦена;	
//Иначе
//	Область.Параметры.БазоваяЦена = БазоваяЦенаИзменения;	
//	Цена = Цена + БазоваяЦенаИзменения;	
//КонецЕсли;
Область.Параметры.БазоваяЦена = БазоваяЦена;	
Цена = Цена + БазоваяЦена;	

//Если НЕ Объект.БезЗавтрака Тогда
//	Если ДоплатаЗавтракИзменения = Неопределено Тогда
//		Область.Параметры.ДоплатаЗавтрак = ДоплатаЗавтрак;	
//		Цена = Цена + ДоплатаЗавтрак;	
//	Иначе	
//		Область.Параметры.ДоплатаЗавтрак = ДоплатаЗавтракИзменения;	
//		Цена = Цена + ДоплатаЗавтракИзменения;	
//	КонецЕсли;
//КонецЕсли;
Если НЕ Объект.БезЗавтрака Тогда
	Область.Параметры.ДоплатаЗавтрак = ДоплатаЗавтрак;	
	Цена = Цена + ДоплатаЗавтрак;	
КонецЕсли;

Область.Параметры.ДоплатаКатегория = ДоплатаКатегория;	
Цена = Цена + ДоплатаКатегория;	

Область.Параметры.Цена = Цена;
ТабДок1.Вывести(Область);
//

//
Область = Макет1.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Текущая цена одноместный";

Цена = 0;
Если БазоваяЦенаИзменения = Неопределено Тогда
	Область.Параметры.БазоваяЦена = БазоваяЦена;	
	Цена = Цена + БазоваяЦена;	
Иначе
	Область.Параметры.БазоваяЦена = БазоваяЦенаИзменения;	
	Цена = Цена + БазоваяЦенаИзменения;	
КонецЕсли;

Если НЕ Объект.БезЗавтрака Тогда
	Если ДоплатаЗавтракИзменения = Неопределено Тогда
		Область.Параметры.ДоплатаЗавтрак = ДоплатаЗавтрак;	
		Цена = Цена + ДоплатаЗавтрак;	
	Иначе	
		Область.Параметры.ДоплатаЗавтрак = ДоплатаЗавтракИзменения;	
		Цена = Цена + ДоплатаЗавтракИзменения;	
	КонецЕсли;
КонецЕсли;

Если ДоплатаКатегорияИзменения = Неопределено Тогда
	Область.Параметры.ДоплатаКатегория = ДоплатаКатегория;	
	Цена = Цена + ДоплатаКатегория;	
Иначе
	Область.Параметры.ДоплатаКатегория = ДоплатаКатегорияИзменения;	
	Цена = Цена + ДоплатаКатегорияИзменения;	
КонецЕсли;
	
Область.Параметры.Цена = Цена;

Область.Область(1,1,1, ШиринаТаблицы).Шрифт = ШрифтИзменения;
Область.Область(1,1,1, ШиринаТаблицы).ЦветТекста = ЦветТекстаИзменения;

ТабДок1.Вывести(Область);
//

//
Область = Макет1.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Базовая цена двухместный";

Цена = 0;
//Если БазоваяЦенаИзменения = Неопределено Тогда
//	Область.Параметры.БазоваяЦена = БазоваяЦена;	
//	Цена = Цена + БазоваяЦена;	
//Иначе
//	Область.Параметры.БазоваяЦена = БазоваяЦенаИзменения;	
//	Цена = Цена + БазоваяЦенаИзменения;	
//КонецЕсли;
Область.Параметры.БазоваяЦена = БазоваяЦена;	
Цена = Цена + БазоваяЦена;	

//Если НЕ Объект.БезЗавтрака Тогда
//	Если ДоплатаЗавтракИзменения = Неопределено Тогда
//		Область.Параметры.ДоплатаЗавтрак = 2 * ДоплатаЗавтрак;	
//		Цена = Цена + 2 * ДоплатаЗавтрак;	
//	Иначе	
//		Область.Параметры.ДоплатаЗавтрак = 2 * ДоплатаЗавтракИзменения;	
//		Цена = Цена + 2 * ДоплатаЗавтракИзменения;	
//	КонецЕсли;
//КонецЕсли;
Если НЕ Объект.БезЗавтрака Тогда
	Область.Параметры.ДоплатаЗавтрак = 2 * ДоплатаЗавтрак;	
	Цена = Цена + 2 * ДоплатаЗавтрак;	
КонецЕсли;

//Если ДоплатаДвухместныйИзменения = Неопределено Тогда
//	Область.Параметры.ДоплатаДвухместный = ДоплатаДвухместный;	
//	Цена = Цена + ДоплатаДвухместный;	
//Иначе
//	Область.Параметры.ДоплатаДвухместный = ДоплатаДвухместныйИзменения;	
//	Цена = Цена + ДоплатаДвухместныйИзменения;
//КонецЕсли;
Область.Параметры.ДоплатаДвухместный = ДоплатаДвухместный;	
Цена = Цена + ДоплатаДвухместный;	

Область.Параметры.ДоплатаКатегория = ДоплатаКатегория;	
Цена = Цена + ДоплатаКатегория;	

Область.Параметры.Цена = Цена;
ТабДок1.Вывести(Область);
//

//
Область = Макет1.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Текущая цена двухместный";

Цена = 0;
Если БазоваяЦенаИзменения = Неопределено Тогда
	Область.Параметры.БазоваяЦена = БазоваяЦена;	
	Цена = Цена + БазоваяЦена;	
Иначе
	Область.Параметры.БазоваяЦена = БазоваяЦенаИзменения;	
	Цена = Цена + БазоваяЦенаИзменения;	
КонецЕсли;

Если НЕ Объект.БезЗавтрака Тогда
	Если ДоплатаЗавтракИзменения = Неопределено Тогда
		Область.Параметры.ДоплатаЗавтрак = 2 * ДоплатаЗавтрак;	
		Цена = Цена + 2 * ДоплатаЗавтрак;	
	Иначе	
		Область.Параметры.ДоплатаЗавтрак = 2 * ДоплатаЗавтракИзменения;	
		Цена = Цена + 2 * ДоплатаЗавтракИзменения;	
	КонецЕсли;
КонецЕсли;

Если ДоплатаДвухместныйИзменения = Неопределено Тогда
	Область.Параметры.ДоплатаДвухместный = ДоплатаДвухместный;	
	Цена = Цена + ДоплатаДвухместный;	
Иначе
	Область.Параметры.ДоплатаДвухместный = ДоплатаДвухместныйИзменения;	
	Цена = Цена + ДоплатаДвухместныйИзменения;
КонецЕсли;

Если ДоплатаКатегорияИзменения = Неопределено Тогда
	Область.Параметры.ДоплатаКатегория = ДоплатаКатегория;	
	Цена = Цена + ДоплатаКатегория;	
Иначе
	Область.Параметры.ДоплатаКатегория = ДоплатаКатегорияИзменения;	
	Цена = Цена + ДоплатаКатегорияИзменения;	
КонецЕсли;

Область.Параметры.Цена = Цена;

Область.Область(1,1,1, ШиринаТаблицы).Шрифт = ШрифтИзменения;
Область.Область(1,1,1, ШиринаТаблицы).ЦветТекста = ЦветТекстаИзменения;
ТабДок1.Вывести(Область);

Область = Макет1.ПолучитьОбласть("Подножие");
ТабДок1.Вывести(Область);
//

//
Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

ШиринаТаблицы = Область.ШиринаТаблицы;

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Базовая цена";
Область.Параметры.Стоимость = БазоваяЦена;
Область.Параметры.Автор = АвторБазоваяЦена;
Область.Параметры.ДатаИзменения = ДатаИзмененияБазоваяЦена;
ТабДок.Вывести(Область);

Если БазоваяЦенаИзменения <> Неопределено Тогда
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.Наименование = "Базовая цена изменения";
	Область.Параметры.Стоимость = БазоваяЦенаИзменения;
	Область.Параметры.Автор = АвторБазоваяЦена;
	Область.Параметры.ДатаИзменения = ДатаИзмененияБазоваяЦена;
	
	Область.Область(1, 1, 1, ШиринаТаблицы).Шрифт = ШрифтИзменения;
	Область.Область(1, 1, 1, ШиринаТаблицы).ЦветТекста = ЦветТекстаИзменения;
	ТабДок.Вывести(Область);
КонецЕсли;	

Область = Макет.ПолучитьОбласть("Строка");
Область.Параметры.Наименование = "Доплата двухместный";
Область.Параметры.Стоимость = ДоплатаДвухместный;
Область.Параметры.Автор = АвторБазоваяЦена;
Область.Параметры.ДатаИзменения = ДатаИзмененияБазоваяЦена;
ТабДок.Вывести(Область);

Если ДоплатаДвухместныйИзменения <> Неопределено Тогда
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.Наименование = "Доплата двухместный изменения";
	Область.Параметры.Стоимость = ДоплатаДвухместныйИзменения;
	Область.Параметры.Автор = АвторДоплатаДвухместныйИзменения;
	Область.Параметры.ДатаИзменения = ДатаИзмененияДоплатаДвухместныйИзменения;
	
	Область.Область(1, 1, 1, ШиринаТаблицы).Шрифт = ШрифтИзменения;
	Область.Область(1, 1, 1, ШиринаТаблицы).ЦветТекста = ЦветТекстаИзменения;
	ТабДок.Вывести(Область);
КонецЕсли;	

Если НЕ Объект.БезЗавтрака Тогда
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.Наименование = "Доплата за завтрак";
	Область.Параметры.Стоимость = ДоплатаЗавтрак;
	Область.Параметры.Автор = АвторБазоваяЦена;
	Область.Параметры.ДатаИзменения = ДатаИзмененияБазоваяЦена;
	ТабДок.Вывести(Область);

	Если ДоплатаЗавтракИзменения <> Неопределено Тогда
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Наименование = "Доплата за завтрак изменения";
		Область.Параметры.Стоимость = ДоплатаЗавтракИзменения;
		Область.Параметры.Автор = АвторДоплатаЗавтракИзменения;
		Область.Параметры.ДатаИзменения = ДатаИзмененияДоплатаЗавтракИзменения;
		
		Область.Область(1, 1, 1, ШиринаТаблицы).Шрифт = ШрифтИзменения;
		Область.Область(1, 1, 1, ШиринаТаблицы).ЦветТекста = ЦветТекстаИзменения;
		ТабДок.Вывести(Область);
	КонецЕсли;
КонецЕсли;

Если НЕ Объект.КатегорияНомера.Базовый Тогда
	Область = Макет.ПолучитьОбласть("Строка");
	Область.Параметры.Наименование = "Доплата за категорию";
	Область.Параметры.Стоимость = ДоплатаКатегория;
	Область.Параметры.Автор = АвторБазоваяЦена;
	Область.Параметры.ДатаИзменения = ДатаИзмененияБазоваяЦена;
	ТабДок.Вывести(Область);

	Если ДоплатаКатегорияИзменения <> Неопределено Тогда
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Наименование = "Доплата за категорию изменения";
		Область.Параметры.Стоимость = ДоплатаКатегорияИзменения;
		Область.Параметры.Автор = АвторДоплатаКатегорияИзменения;
		Область.Параметры.ДатаИзменения = ДатаИзмененияДоплатаКатегорияИзменения;
		
		Область.Область(1, 1, 1, ШиринаТаблицы).Шрифт = ШрифтИзменения;
		Область.Область(1, 1, 1, ШиринаТаблицы).ЦветТекста = ЦветТекстаИзменения;
		ТабДок.Вывести(Область);
	КонецЕсли;
КонецЕсли;

Область = Макет.ПолучитьОбласть("Подножие");
ТабДок.Вывести(Область);
//

//ОбщийФункционалСервер.ВставитьТабличныйДокумент(ТабДок, ТабДок1);
//Возврат ТабДок;                                                                      

ОбщийФункционалСервер.ВставитьТабличныйДокумент(ТабДок1, ТабДок);
Возврат ТабДок1;                                                                      
КонецФункции

&НаСервере
Функция ПолучитьТабДокРасшифровкаКонкурентыЦенаДата(Расшифровка)
Дата = Расшифровка.Дата;	
	
Макет = Обработки.КалендарьЦен.ПолучитьМакет("РасшифровкаКонкуренты");
ТабДок = Новый ТабличныйДокумент;

Область = Макет.ПолучитьОбласть("Заголовок");
Область.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yy");
ТабДок.Вывести(Область);

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентов.Дата КАК Дата,
                      |	ЦеныКонкурентов.НаименованиеОтеля КАК НаименованиеОтеля,
                      |	ЦеныКонкурентов.Цена КАК Цена
                      |ИЗ
                      |	РегистрСведений.ЦеныКонкурентов КАК ЦеныКонкурентов
                      |ГДЕ
                      |	ЦеныКонкурентов.Дата = &Дата
                      |	И ЦеныКонкурентов.НаименованиеОтеля <> &НаименованиеОтеля
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	НаименованиеОтеля");

Запрос.УстановитьПараметр("Дата", Дата);
Запрос.УстановитьПараметр("НаименованиеОтеля", НаименованиеОтеляАналитика);


ТЗ = Запрос.Выполнить().Выгрузить();

Для Каждого Строка Из ТЗ Цикл
	Область = Макет.ПолучитьОбласть("Строка");
	
	Область.Параметры.Отель = Строка.НаименованиеОтеля;
	Область.Параметры.Цена = Строка.Цена;
	
	ТабДок.Вывести(Область);
КонецЦикла;

Возврат ТабДок;	
КонецФункции

&НаСервере
Функция ПолучитьТабДокРасшифровкаКонкурентыЦенаАналитика_1(Расшифровка)
ДатаРасшифровка = Расшифровка.Дата;	
	
Макет = Обработки.КалендарьЦен.ПолучитьМакет("РасшифровкаКонкурентыАналитика");
ТабДок = Новый ТабличныйДокумент;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ЦеныКонкурентовАналитикаДанныеДата.Ссылка.ДатаЗадания КАК ДатаЗадания,
                      |	ЦеныКонкурентовАналитикаДанныеДата.ЗанятоПроцент КАК ЗанятоПроцент,
                      |	ЦеныКонкурентовАналитикаДанныеДата.СреднийADR КАК СреднийADR,
                      |	ЦеныКонкурентовАналитикаДанныеДата.ГлубинаБронирования КАК ГлубинаБронирования,
                      |	ЦеныКонкурентовАналитикаДанныеДата.НашаЦена КАК НашаЦена,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Отель КАК Отель,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.Цена КАК Цена,
                      |	ЦеныКонкурентовАналитикаДанныеОтели.ПродажиЗакрыты КАК ПродажиЗакрыты
                      |ИЗ
                      |	Документ.ЦеныКонкурентовАналитика.ДанныеДата КАК ЦеныКонкурентовАналитикаДанныеДата
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЦеныКонкурентовАналитика.ДанныеОтели КАК ЦеныКонкурентовАналитикаДанныеОтели
                      |		ПО ЦеныКонкурентовАналитикаДанныеДата.Ссылка = ЦеныКонкурентовАналитикаДанныеОтели.Ссылка
                      |			И ЦеныКонкурентовАналитикаДанныеОтели.Дата = ЦеныКонкурентовАналитикаДанныеДата.Дата
                      |ГДЕ
                      |	ЦеныКонкурентовАналитикаДанныеДата.Ссылка.ПометкаУдаления = ЛОЖЬ
                      |	И ЦеныКонкурентовАналитикаДанныеДата.Дата = &Дата");


Запрос.УстановитьПараметр("Дата", ДатаРасшифровка);

ТЗ = Запрос.Выполнить().Выгрузить();

ТабДокДата = Новый ТабличныйДокумент;

Область = Макет.ПолучитьОбласть("Заголовок|Заголовки");
Область.Параметры.ДатаРасшифровка = Формат(ДатаРасшифровка, "ДФ=dd.MM.yy");
ТабДокДата.Вывести(Область);

ОбластьЗаголовки = Макет.ПолучитьОбласть("Строка|Заголовки");
ТабДокДата.Вывести(ОбластьЗаголовки);

ОбластьЗаголовки = Макет.ПолучитьОбласть("ОтелиШапка|Заголовки");
ТабДокДата.Вывести(ОбластьЗаголовки);

Для Каждого Строка Из ТЗОтели Цикл
	ОбластьЗаголовки = Макет.ПолучитьОбласть("ОтелиСтрока|Заголовки");
	ОбластьЗаголовки.Параметры.Отель = Строка.Отель;
	
	ТабДокДата.Вывести(ОбластьЗаголовки);
КонецЦикла;
ТабДок.Присоединить(ТабДокДата);

ОтборСтроки = Новый Структура("Отель", Справочники.КонкурентыОтели.ПустаяСсылка());
ТЗДаты = ТЗ.Скопировать(ОтборСтроки);
ТЗДаты.Свернуть("ДатаЗадания, ЗанятоПроцент, СреднийADR, ГлубинаБронирования, НашаЦена, Цена");  

Для Каждого Строка Из ТЗДаты Цикл
	ТабДокДата = Новый ТабличныйДокумент;
	
	ОбластьДата = Макет.ПолучитьОбласть("Заголовок|Дата");
	ТабДокДата.Вывести(ОбластьДата);
	
	ОбластьДата = Макет.ПолучитьОбласть("Строка|Дата");
	ОбластьДата.Параметры.Дата = Формат(Строка.ДатаЗадания, "ДФ=dd.MM.yy");
	ОбластьДата.Параметры.ЗагрузкаПроцент = Строка.ЗанятоПроцент;
	ОбластьДата.Параметры.СреднийADR = Строка.СреднийADR;
	ОбластьДата.Параметры.НашаЦена = Строка.НашаЦена;
	ОбластьДата.Параметры.ГлубинаБронирования = Строка.ГлубинаБронирования;
	
	ЦенаТравелЛайн = КалендарьЦен.СредняяЦенаКонкурентовАналитика(ТЗ, Строка.Цена);
 
	ОбластьДата.Параметры.ЦенаТравелЛайн = ЦенаТравелЛайн;

	ТабДокДата.Вывести(ОбластьДата);
		
	ОбластьДата = Макет.ПолучитьОбласть("ОтелиШапка|Дата");
	ТабДокДата.Вывести(ОбластьДата);
	Для Каждого СтрокаОтель Из ТЗ Цикл
		Если ЗначениеЗаполнено(СтрокаОтель.Отель) Тогда
			ОбластьДата = Макет.ПолучитьОбласть("ОтелиСтрока|Дата");
			ОбластьДата.Параметры.Цена = КалендарьЦен.ОтчетЦенаОтель(СтрокаОтель);
			                                                                                                  
			ТабДокДата.Вывести(ОбластьДата);
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Присоединить(ТабДокДата);
КонецЦикла;

Возврат ТабДок;	
КонецФункции

&НаСервере
Функция ПолучитьОбластьСтрокаЦеныОдноместный(Макет, БазоваяЦена, БазоваяЦенаИзменения
	, ДоплатаЗавтрак, ДоплатаЗавтракИзменения, ДоплатаКатегория)
Область = Макет.ПолучитьОбласть("СтрокаЦены");

СтрокаЦены = "Базовая цена одноместный: ";
Цена = 0; 
Если БазоваяЦенаИзменения = Неопределено Тогда
	СтрокаЦены = СтрокаЦены + БазоваяЦена;	
	Цена = Цена + БазоваяЦена;	
Иначе
	СтрокаЦены = СтрокаЦены + БазоваяЦенаИзменения;	
	Цена = Цена + БазоваяЦенаИзменения;	
КонецЕсли;

Если НЕ Объект.БезЗавтрака Тогда
	Если ДоплатаЗавтракИзменения = Неопределено Тогда
		СтрокаЦены = СтрокаЦены + " + " + ДоплатаЗавтрак;
		Цена = Цена + ДоплатаЗавтрак;	
	Иначе	
		СтрокаЦены = СтрокаЦены + " + " + ДоплатаЗавтрак;
		Цена = Цена + ДоплатаЗавтрак;	
	КонецЕсли;
КонецЕсли;
	
СтрокаЦены = СтрокаЦены + " + " + ДоплатаКатегория;
Цена = Цена + ДоплатаКатегория;	

СтрокаЦены = СтрокаЦены + " = " + Цена;

Область = Макет.ПолучитьОбласть("СтрокаЦены");
Область.Параметры.СтрокаЦены = СтрокаЦены;

Возврат Область;
//
КонецФункции

&НаСервере
Функция ПолучитьОбластьСтрокаЦеныДвухместный(Макет, СтрокаЦены, БазоваяЦена, БазоваяЦенаИзменения
	, ДоплатаДвухместный, ДоплатаДвухместныйИзменения, ДоплатаЗавтрак, ДоплатаЗавтракИзменения, ДоплатаКатегория)
Область = Макет.ПолучитьОбласть("СтрокаЦены");

СтрокаЦены = "Базовая цена одноместный: ";
Цена = 0; 
Если БазоваяЦенаИзменения = Неопределено Тогда
	СтрокаЦены = СтрокаЦены + БазоваяЦена;	
	Цена = Цена + БазоваяЦена;	
Иначе
	СтрокаЦены = СтрокаЦены + БазоваяЦенаИзменения;	
	Цена = Цена + БазоваяЦенаИзменения;	
КонецЕсли;

Если НЕ Объект.БезЗавтрака Тогда
	Если ДоплатаЗавтракИзменения = Неопределено Тогда
		СтрокаЦены = СтрокаЦены + " + " + ДоплатаЗавтрак;
		Цена = Цена + ДоплатаЗавтрак;	
	Иначе	
		СтрокаЦены = СтрокаЦены + " + " + ДоплатаЗавтрак;
		Цена = Цена + ДоплатаЗавтрак;	
	КонецЕсли;
КонецЕсли;
	
СтрокаЦены = СтрокаЦены + " + " + ДоплатаКатегория;
Цена = Цена + ДоплатаКатегория;	

СтрокаЦены = СтрокаЦены + " = " + Цена;

Область = Макет.ПолучитьОбласть("СтрокаЦены");
Область.Параметры.СтрокаЦены = СтрокаЦены;

Возврат Область;
//
КонецФункции
//

//
&НаКлиенте
Процедура ИзменитьБазовыеТарифы(Команда)
ОткрытьФорму("Справочник.БазовыеЦены.ФормаСписка",,ЭтаФорма
	,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
//

////////++++++++++++++++++++++++++++++++++++ /////////////////////

			  
&НаКлиенте
Процедура Тест(Команда)
//ЗабронированоМесяц();
//ЗабронированоНаДату();

//ТаблицаВывод = Новый ТабличныйДокумент;
//СформироватьТест(ТаблицаВывод);

//ПараметрыФормы = Новый Структура("ПолеОтчета, ЗаголовокОтчета", ТаблицаВывод, "ыыыыы");
//ОткрытьФорму("ОбщаяФорма.ВыводОтчета", ПараметрыФормы, ЭтаФорма); 

ДатаС = '20240501';
ДатаПо = '20240531';
ТаблицаВывод = Неопределено;
//ЗаполнитьТЗАналитика(ДатаС, ДатаПо)
ЗаполнитьТЗАналитика(2024);

КонецПроцедуры








