
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

ТабДокАкт = Параметры.ТабДокАкт;
ТабДокСчетФактура = Параметры.ТабДокСчетФактура;
Контрагент = Параметры.Контрагент;

ДокументАкт = СтрЗаменить(Параметры.ДокументАкт, "/", "-");
ДокументСчетФактура = СтрЗаменить(Параметры.ДокументСчетФактура, "/", "-");

////
ЭтаФорма.АвтоЗаголовок = Ложь;
Заголовок = "Отправка Акта и счета-фактуры для ";	
ЭтаФорма.Заголовок = Заголовок + Контрагент;

Почта = Контрагент.ЭлПочта;

ПочтаТема = ПочтаТема();
ПочтаТекстСообщения = ПочтаТекстСообщения();
КонецПроцедуры

&НаСервере
Функция ПочтаТема()
ПочтаТема = ПечатьСервер.ОрганизацияНаименование() + ". Акт и Счет-фактура для " + Контрагент;

Возврат ПочтаТема;
КонецФункции

&НаСервере
Функция ПочтаТекстСообщения() 
ПочтаТекстСообщения = "Уважаемые коллеги!!!";
ПочтаТекстСообщения = "" + ПочтаТекстСообщения + Символы.ПС  + Символы.ПС;

ПочтаТекстСообщения = "" + ПочтаТекстСообщения
	+ "Во вложении к письму направляем Вам образы  закрывающих документов за проживание: Акт выполненных работ и счет-фактуру." 
	+ Символы.ПС;
 
ПочтаТекстСообщения = "" + ПочтаТекстСообщения  
	+ "Если по оформлению все подходит, готовы предоставить оригиналы по ЭДО или Почтой России, пожалуйста, сообщите удобный способ." 
	+ Символы.ПС
	+ Символы.ПС;
 
ПочтаТекстСообщения = "" + ПочтаТекстСообщения + "Благодарим Вас за сотрудничество!" + Символы.ПС;
ПочтаТекстСообщения = "" + ПочтаТекстСообщения + "Ждем новых гостей!";

Возврат ПочтаТекстСообщения;
КонецФункции 


&НаКлиенте
Асинх Процедура ПриОткрытии(Отказ)
ПочтаПриИзменении(Неопределено);
КонецПроцедуры

//
&НаКлиенте
Процедура ПочтаПриИзменении(Элемент)
//ЕстьПочта = ЗначениеЗаполнено(Почта);
//Элементы.ФормаОтправитьНаПочту.Доступность = ЕстьПочта;
//Элементы.ПочтаТема.Доступность = ЕстьПочта;
//Элементы.ПочтаТекстСообщения.Доступность = ЕстьПочта;
КонецПроцедуры
//

//
&НаКлиенте
Процедура ОтправитьНаПочту(Команда)
Получатели = Новый СписокЗначений;
Получатели.Добавить(Почта);

Файлы = Новый Массив;

ПолноеИмяФайла = ПолноеИмяФайлаАкт();
Ответ = СохранитьДокументPDF(ТабДокАкт, ПолноеИмяФайла);
Если Ответ.Ошибка Тогда 
	Текст = "Ошибка сохранения Акта "; 
	
	ПоказатьПредупреждение(, Текст + Символы.ПС + Ответ.ОписаниеОшибки);
	
	//Сообщить(Текст + Ответ.ОписаниеОшибки + ". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	Возврат;
КонецЕсли;
ПолноеИмяФайлаPDF = ПолноеИмяФайла + ".PDF"; 
Файлы.Добавить(ПолноеИмяФайлаPDF);

ПолноеИмяФайла = ПолноеИмяФайлаСчетФактура();
Ответ = СохранитьДокументPDF(ТабДокСчетФактура, ПолноеИмяФайла);
Если Ответ.Ошибка Тогда 
	Текст = "Ошибка сохранения Счета-фактуры "; 
	
	ПоказатьПредупреждение(, Текст  + Символы.ПС + Ответ.ОписаниеОшибки);
	
	//Сообщить(Текст + Ответ.ОписаниеОшибки + ". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	Возврат;
КонецЕсли;
ПолноеИмяФайлаPDF = ПолноеИмяФайла + ".PDF"; 
Файлы.Добавить(ПолноеИмяФайлаPDF);

Если ЭтаФорма.КлючУникальности = Неопределено Тогда
	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор();
Иначе
	УникальныйИдентификаторФормы = Новый УникальныйИдентификатор(ЭтаФорма.КлючУникальности);
КонецЕсли;	
ФайлыКУдалению = Файлы;
СлужебныеКлиент.ОтправитьEmail(ПочтаТема, Файлы, Получатели, ПочтаТекстСообщения, ФайлыКУдалению, УникальныйИдентификаторФормы);
КонецПроцедуры

Функция TASKKILL_EXEL() 
// Путь к PowerShell.exe
ПутьКPowerShell = "powershell.exe";

// Команда, которую нужно выполнить.
Команда = "TASKKILL /IM EXCEL.exe";

// Вызов функции ЗапуститьПриложение
КодВозврата = Неопределено;
ЗапуститьПриложение(ПутьКPowerShell + " -Command """ + Команда + """", "", Истина, КодВозврата);

//// Обработка результата
//Если Результат Тогда
//    Сообщить("Команда успешно выполнена.");
//    // Здесь можно обработать результат выполнения команды, если он требуется.
//    // Например, считать вывод команды, если он был перенаправлен в файл.
//    // Или обработать код возврата.
//    Если КодВозврата <> 0 Тогда
//        Сообщить("Ошибка при выполнении команды. Код возврата: " + КодВозврата);
//    КонецЕсли;
//Иначе
//    Сообщить("Не удалось запустить команду PowerShell.");
//КонецЕсли;
КонецФункции


&НаКлиенте
Функция СохранитьДокументPDF(ТабДок, ПолноеИмяФайла)
Ответ = Новый Структура("Ошибка, ОписаниеОшибки", Ложь, Истина);

ПолноеИмяФайлаPDF = ПолноеИмяФайла + ".PDF";
Попытка 
	ТабДок.Записать(ПолноеИмяФайлаPDF, ТипФайлаТабличногоДокумента.PDF);
Исключение
	Ответ.Ошибка = Истина;
	//Ответ.ОписаниеОшибки = ОписаниеОшибки();
	Ответ.ОписаниеОшибки = "Закройте файл " + ПолноеИмяФайлаPDF;
	
	Возврат Ответ;
КонецПопытки;

Возврат Ответ; 
КонецФункции

&НаКлиенте
Функция СохранитьДокументPDF_1(ТабДок, ПолноеИмяФайла)
Ответ = Новый Структура("Ошибка, ОписаниеОшибки", Ложь, Истина);

ПолноеИмяФайлаXLS = ПолноеИмяФайла + ".XLS";

//ТабДок = Новый ТабличныйДокумент;
Попытка 
	ТабДок.Записать(ПолноеИмяФайлаXLS, ТипФайлаТабличногоДокумента.XLS);
Исключение
	
	Ответ.Ошибка = Истина;
	Ответ.ОписаниеОшибки = ОписаниеОшибки();
	
	Возврат Ответ;
КонецПопытки;	
	
MSExcel = Новый COMОбъект("Excel.Application");	   
Книга = MSExcel.WorkBooks.Open(ПолноеИмяФайлаXLS);

MSExcel.Application.DisplayAlerts = False; 

xlTypePDF =	0; //	"PDF" — файл в формате PDF (PDF)

ПолноеИмяФайлаPDF = ПолноеИмяФайла + ".PDF";
Попытка 
	Книга.ExportAsFixedFormat (xlTypePDF , ПолноеИмяФайлаPDF);
Исключение
	Ответ.Ошибка = Истина;
	Ответ.ОписаниеОшибки = ОписаниеОшибки();
	
	Возврат Ответ;
КонецПопытки;

Попытка
	MSExcel.Quit();
	MSExcel = Неопределено;
Исключение
	Ответ.Ошибка = Истина;
	Ответ.ОписаниеОшибки = ОписаниеОшибки();
	
	Возврат Ответ;
КонецПопытки;

Возврат Ответ; 
КонецФункции

//

////
&НаКлиенте
Функция ПроверитьСчет()
//Если ПолноеИмяФайлаСчет = "" Тогда 	
//    ПоказатьПредупреждение(,"Счет не сохранен");
//	Возврат Истина;
//КонецЕсли;

//ФайлНаДиске = Новый Файл(ПолноеИмяФайлаСчет);
//Если НЕ ФайлНаДиске.Существует() Тогда
//    ПоказатьПредупреждение(,"Файл счета отсутствует");
//	Возврат Истина;
//КонецЕсли;	

//Возврат Ложь;
КонецФункции
////

&НаКлиенте
Функция ПолноеИмяФайлаАкт()
//КаталогВременныхФайлов = КаталогВременныхФайлов();
КаталогВременныхФайлов = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("ПАПКА_Подтверждения");

ПолноеИмяФайлаАкт = КаталогВременныхФайлов + ДокументАкт;

Возврат ПолноеИмяФайлаАкт;
КонецФункции

&НаКлиенте
Функция ПолноеИмяФайлаСчетФактура()
//КаталогВременныхФайлов = КаталогВременныхФайлов();
КаталогВременныхФайлов = ОбщийФункционалСервер.ПолучитьЗначениеКонстанты("ПАПКА_Подтверждения");

ПолноеИмяФайлаСчетФактура = КаталогВременныхФайлов + ДокументСчетФактура;

Возврат ПолноеИмяФайлаСчетФактура;
КонецФункции
 
&НаКлиенте
Процедура ОткрытьАкт(Команда)
ПолноеИмяФайлаАкт = ПолноеИмяФайлаАкт();	
Ответ = СохранитьДокументPDF(ТабДокАкт, ПолноеИмяФайлаАкт);
Если Ответ.Ошибка Тогда 
	Текст = "Ошибка сохранения Акта "; 
	
	ПоказатьПредупреждение(, Ответ.ОписаниеОшибки);
	
	//Сообщить(Текст + Ответ.ОписаниеОшибки + ". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	Возврат;
КонецЕсли;

ПолноеИмяФайлаАкт = ПолноеИмяФайлаАкт + ".PDF"; 
ЗапуститьПриложение(ПолноеИмяФайлаАкт);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСчетФактура(Команда)
ПолноеИмяФайлаСчетФактура = ПолноеИмяФайлаСчетФактура();
Ответ = СохранитьДокументPDF(ТабДокСчетФактура, ПолноеИмяФайлаСчетФактура);
Если Ответ.Ошибка Тогда 
	Текст = "Ошибка сохранения счета-фактуры "; 
	
	ПоказатьПредупреждение(, Ответ.ОписаниеОшибки);
	
	//Сообщить(Текст + Ответ.ОписаниеОшибки + ". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ");
	Возврат;
КонецЕсли;

ПолноеИмяФайлаСчетФактура = ПолноеИмяФайлаСчетФактура + ".PDF"; 
ЗапуститьПриложение(ПолноеИмяФайлаСчетФактура);
КонецПроцедуры
//////// +++++++++++++++++++++++++++++++++ 







