
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("ЗаявкаНаБронирование", ЗаявкаНаБронирование);
НомерВРезерв = ЗаявкаНаБронирование.НомерВРезерв;

ТолькоПросмотр_П = Параметры.ТолькоПросмотр;
Элементы.ЗаполнитьДопУслуги.Доступность = НЕ ТолькоПросмотр_П; 
	
ОбновитьСостояниеНаСервере();
//ОбновитьДанныеНаФорме();                         
КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеНаФорме()
НомерГорничные = НомерВРезерв.НомерГорничные; 	
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеНомера.РаздельныеКровати КАК РаздельныеКровати,
                      |	ГорничныеНомера.ДопМесто_1_ТипДопМеста КАК ДопМесто_1_ТипДопМеста,
                      |	ГорничныеНомера.ДопМесто_2_ТипДопМеста КАК ДопМесто_2_ТипДопМеста,
                      |	ГорничныеНомера.ТекущееДополнительноеОборудование.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		ДопОборудование КАК ДопОборудование
                      |	) КАК ТекущееДополнительноеОборудование
                      |ИЗ
                      |	Справочник.ГорничныеНомера КАК ГорничныеНомера
                      |ГДЕ
                      |	ГорничныеНомера.НомерГорничные = &НомерГорничные");	
					  
Запрос.УстановитьПараметр("НомерГорничные", НомерГорничные);	
ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Возврат Истина; КонецЕсли; 

Данные = ТЗ[0];
ЗаполнитьЗначенияСвойств(ЭтаФорма, Данные,,"ТекущееДополнительноеОборудование");

ПоказатьДопМесто(Данные.ДопМесто_1_ТипДопМеста, ДопМесто_1_ТипДопМестаНадпись);
ПоказатьДопМесто(Данные.ДопМесто_2_ТипДопМеста, ДопМесто_2_ТипДопМестаНадпись);

ТекущееДополнительноеОборудование.Очистить();
Для Каждого Строка Из Данные.ТекущееДополнительноеОборудование Цикл
	НоваяСтрока = ТекущееДополнительноеОборудование.Добавить(); 
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеОбслуживаниеНомера.Ссылка КАК Ссылка,
                      |	ГорничныеОбслуживаниеНомера.ДатаОбслуживания КАК ДатаОбслуживания,
                      |	ГорничныеОбслуживаниеНомера.ТехническиеНеисправности.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		ТехническаяНеисправность КАК ТехническаяНеисправность
                      |	) КАК ТехническиеНеисправности,
                      |	ГорничныеОбслуживаниеНомера.ТехническиеНеисправностиПримечание КАК ТехническиеНеисправностиПримечание,
                      |	ГорничныеОбслуживаниеНомера.УщербНомеру КАК УщербНомеру,
                      |	ГорничныеОбслуживаниеНомера.ЗабытыеВещи КАК ЗабытыеВещи,
                      |	ГорничныеОбслуживаниеНомера.Комментарий КАК Комментарий
                      |ИЗ
                      |	Документ.ГорничныеОбслуживаниеНомера КАК ГорничныеОбслуживаниеНомера
                      |ГДЕ
                      |	(ГорничныеОбслуживаниеНомера.ЗаявкаНаБронирование = &ЗаявкаНаБронирование
                      |			ИЛИ ГорничныеОбслуживаниеНомера.ЗаявкаНаБронирование = ЗНАЧЕНИЕ(Документ.ЗаявкаНаБронирование.ПустаяСсылка)
                      |				И ГорничныеОбслуживаниеНомера.ДатаОбслуживания = &ЗаявкаНаБронированиеРезервПо)
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаОбслуживания,
                      |	ГорничныеОбслуживаниеНомера.НомерОбслуживания_пп");	

Запрос.УстановитьПараметр("ЗаявкаНаБронирование", ЗаявкаНаБронирование);
Запрос.УстановитьПараметр("ЗаявкаНаБронированиеРезервПо", ЗаявкаНаБронирование.РезервПо);

ТехническиеНеисправности = "";

УщербНомеру = "";
ЗабытыеВещи = "";
Комментарий = "";
ТЗ = Запрос.Выполнить().Выгрузить();
Для Каждого Строка Из ТЗ Цикл
	//Если ЗначениеЗаполнено(Строка.ТехническиеНеисправности) Тогда
	Если Строка.ТехническиеНеисправности.Количество() > 0 ИЛИ ЗначениеЗаполнено(Строка.ТехническиеНеисправностиПримечание) Тогда
		ТехническиеНеисправности_П = ГорничныеОбслуживаниеНомераСервер.ПолучитьТехническиеНеисправности(
		    Строка.ТехническиеНеисправности, Строка.ТехническиеНеисправностиПримечание);
		ТекстДобавление = Формат(Строка.ДатаОбслуживания, "ДФ=dd.MM.yy") + ": " + ТехническиеНеисправности_П;
		ТехническиеНеисправности = ОбщийФункционалКлиентСервер.ДобавитьТекст(ТехническиеНеисправности, ТекстДобавление, Символы.ПС); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТехническиеНеисправности) Тогда
		Элементы.ГруппаТехническиеНеисправности.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.УщербНомеру) Тогда
		ТекстДобавление = Формат(Строка.ДатаОбслуживания, "ДФ=dd.MM.yy") + ": " + Строка.УщербНомеру;
		УщербНомеру = ОбщийФункционалКлиентСервер.ДобавитьТекст(УщербНомеру, ТекстДобавление, Символы.ПС); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.ЗабытыеВещи) Тогда
		ТекстДобавление = Формат(Строка.ДатаОбслуживания, "ДФ=dd.MM.yy") + ": " + Строка.ЗабытыеВещи;
		ЗабытыеВещи = ОбщийФункционалКлиентСервер.ДобавитьТекст(ЗабытыеВещи, ТекстДобавление, Символы.ПС); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.Комментарий) Тогда
		ТекстДобавление = Формат(Строка.ДатаОбслуживания, "ДФ=dd.MM.yy") + ": " + Строка.Комментарий;
		Комментарий = ОбщийФункционалКлиентСервер.ДобавитьТекст(Комментарий, ТекстДобавление, Символы.ПС); 
	КонецЕсли;
КонецЦикла;

ТЗКоличество = ТЗ.Количество();
ДатаОбслуживанияМаксимум = ?(ТЗКоличество > 0, ТЗ[ТЗКоличество - 1].ДатаОбслуживания, Неопределено);

// + Минибар
Запрос = Новый Запрос( "ВЫБРАТЬ ПЕРВЫЕ 1
                       |	ЗаявкаНаБронирование.Ссылка КАК Заявка
                       |ИЗ
                       |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
                       |ГДЕ
                       |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
                       |	И ЗаявкаНаБронирование.РезервС >= &РезервС
                       |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(перечисление.СтатусБрони.ОтменаБронирования)
                       |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(перечисление.СтатусБрони.ОтказОтБронирования)
                       |
                       |УПОРЯДОЧИТЬ ПО
                       |	ЗаявкаНаБронирование.РезервС");

Запрос.УстановитьПараметр("РезервС", ЗаявкаНаБронирование.РезервПо);  
ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда
	СледующаяЗаявка = Документы.ЗаявкаНаБронирование.ПустаяСсылка();
Иначе
	СледующаяЗаявка =  ТЗ[0].Заявка;
КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ГорничныеОбслуживаниеНомера.Ссылка КАК Ссылка,
                      |	ГорничныеОбслуживаниеНомера.ДатаОбслуживания КАК ДатаОбслуживания,
                      |	ГорничныеОбслуживаниеНомера.НомерОбслуживания_пп КАК НомерОбслуживания_пп
                      |ИЗ
                      |	Документ.ГорничныеОбслуживаниеНомера КАК ГорничныеОбслуживаниеНомера
                      |ГДЕ
                      |	ГорничныеОбслуживаниеНомера.ПометкаУдаления = ЛОЖЬ
                      |	И ГорничныеОбслуживаниеНомера.ЗаявкаНаБронирование = ЗНАЧЕНИЕ(Документ.ЗаявкаНаБронирование.ПустаяСсылка)
                      |	И ГорничныеОбслуживаниеНомера.НомерВРезерв = &НомерВРезерв
                      |	И ГорничныеОбслуживаниеНомера.ДатаОбслуживания >= &ДатаОбслуживанияМин
                      |	И ГорничныеОбслуживаниеНомера.ДатаОбслуживания <= &ДатаОбслуживанияМакс
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ДатаОбслуживания,
                      |	НомерОбслуживания_пп");

Запрос.УстановитьПараметр("НомерВРезерв", ЗаявкаНаБронирование.НомерВРезерв);
Запрос.УстановитьПараметр("ДатаОбслуживанияМин", ЗаявкаНаБронирование.РезервПо);

Если ЗначениеЗаполнено(СледующаяЗаявка) Тогда
	ДатаОбслуживанияМакс = СледующаяЗаявка.РезервС;	
Иначе
	ДатаОбслуживанияМакс = '30010101';
КонецЕсли;
Запрос.УстановитьПараметр("ДатаОбслуживанияМакс", ДатаОбслуживанияМакс);

ТЗ =  Запрос.Выполнить().Выгрузить();

СписокСледующиеОбслуживания = Новый СписокЗначений;
Если ТЗ.Количество() > 0 Тогда
	//ДатаОбслуживания_П = ТЗ[0].ДатаОбслуживания;

	Для Каждого Строка Из ТЗ Цикл
		//Если Строка.ДатаОбслуживания <> ДатаОбслуживания_П Тогда Прервать; КонецЕсли;
		
		СписокСледующиеОбслуживания.Добавить(Строка.Ссылка); 
	КонецЦикла;
КонецЕсли;

Запрос = Новый Запрос("ВЫБРАТЬ
                  |	ГорничныеОбслуживаниеНомераМинибар.НоменклатураМинибара КАК НоменклатураМинибара,
                  |	ГорничныеОбслуживаниеНомераМинибар.НоменклатураМинибараНаименованиеВыгрузка КАК НоменклатураМинибараНаименованиеВыгрузка,
                  |	ГорничныеОбслуживаниеНомераМинибар.Количество КАК Количество,
                  |	ГорничныеОбслуживаниеНомераМинибар.НоменклатураМинибара.Цена КАК НоменклатураМинибараЦена,
                  |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.ДатаОбслуживания КАК ДатаОбслуживания
                  |ИЗ
                  |	Документ.ГорничныеОбслуживаниеНомера.Минибар КАК ГорничныеОбслуживаниеНомераМинибар
                  |ГДЕ
                  |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.ПометкаУдаления = ЛОЖЬ
                  |	И (ГорничныеОбслуживаниеНомераМинибар.Ссылка.ЗаявкаНаБронирование = &ЗаявкаНаБронирование
                  |			ИЛИ ГорничныеОбслуживаниеНомераМинибар.Ссылка.ЗаявкаНаБронирование = ЗНАЧЕНИЕ(Документ.ЗаявкаНаБронирование.ПустаяСсылка)
                  |				И ГорничныеОбслуживаниеНомераМинибар.Ссылка В (&СписокСледующиеОбслуживания))
                  |
                  |УПОРЯДОЧИТЬ ПО
                  |	ГорничныеОбслуживаниеНомераМинибар.Ссылка.ДатаОбслуживания");

Запрос.УстановитьПараметр("ЗаявкаНаБронирование", ЗаявкаНаБронирование);
Запрос.УстановитьПараметр("СписокСледующиеОбслуживания", СписокСледующиеОбслуживания);

ТЗ_МинибарЗаявки = Запрос.Выполнить().Выгрузить();
	
Для Каждого Строка Из ТЗ_МинибарЗаявки Цикл
	НоваяСтрока = Минибар.Добавить();
	НоваяСтрока.НоменклатураМинибара = Строка.НоменклатураМинибара; 
	НоваяСтрока.НоменклатураМинибараГорничные = Строка.НоменклатураМинибараНаименованиеВыгрузка; 
	
	НоваяСтрока.ДатаОбслуживания = Строка.ДатаОбслуживания;
	
	Если ЗначениеЗаполнено(Строка.НоменклатураМинибара) Тогда
		НоваяСтрока.НоменклатураМинибараНаименование = Строка.НоменклатураМинибара.Наименование;
	Иначе 
		НоваяСтрока.НоменклатураМинибараНаименование = "* " + Строка.НоменклатураМинибараНаименованиеВыгрузка;		
	КонецЕсли;
		
	НоваяСтрока.Цена = Строка.НоменклатураМинибараЦена; 
	НоваяСтрока.Количество = Строка.Количество;
	
	НоваяСтрока.Сумма = Строка.Количество * НоваяСтрока.Цена;
	
	//ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Минибар.Сортировать("ДатаОбслуживания, НоменклатураМинибараНаименование");
// - Минибар

МинибарИтоги_П = Минибар.Выгрузить();

МинибарИтоги_П.Свернуть("ДатаОбслуживания, НоменклатураМинибараГорничные, Цена, НоменклатураМинибара, НоменклатураМинибараНаименование", "Количество, Сумма");
МинибарИтоги_П.Сортировать("ДатаОбслуживания, НоменклатураМинибараНаименование");

МинибарИтоги.Очистить();
Для Каждого Строка Из МинибарИтоги_П Цикл
	НоваяСтрока = МинибарИтоги.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;
МинибарИтогиСумма = МинибарИтоги.Итог("Сумма");

Возврат Ложь;
КонецФункции

&НаСервере
Процедура ПоказатьДопМесто(ДопМесто, ДопМестоНадпись)
Если ДопМесто = 0 Тогда 
	ДопМестоНадпись = "Нет";
ИначеЕсли ДопМесто = 1 Тогда 
	ДопМестоНадпись = "Кровать";
ИначеЕсли ДопМесто = 2 Тогда 
	ДопМестоНадпись = "Манеж";
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояние(Команда)
ОбновитьСостояниеНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеНаСервере()
ДатаОбслуживание_По = ЗаявкаНаБронирование.РезервПо + 3 * 24*60*60;	
	
ОбменГорничныеСервер.ЗагрузитьОбслуживаниеНомеров(ЗаявкаНаБронирование.РезервС, ДатаОбслуживание_По, ЗаявкаНаБронирование.НомерВРезерв.НомерГорничные);
ОбновитьДанныеНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДопУслуги(Команда)
Закрыть(МинибарИтоги);	
КонецПроцедуры


