
 //День(КонецМесяца(НашаДата))
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаС = НачалоМесяца(ТекущаяДата());
ДатаПо = КонецМесяца(ТекущаяДата());

Элементы.Реквизит1.ФорматРедактирования = Формат("ЧЦ=3; ЧДЦ=2; ЧРД=.");     
//"ЧЦ=3; ЧДЦ=2; ЧРД=.; ЧН=Пусто"
ДобавитьРеквизитыТабель();
КонецПроцедуры

&НаСервере
Функция ИмяРеквизитаТабельДата(Дата)
Имя = "Количество_" + Строка(День(Дата)) + Строка(Месяц(Дата)); 

Возврат Имя; 
КонецФункции
	
 &НаСервере
Процедура ДобавитьРеквизитыТабель()
// + Доп. реквизиты
ДобавляемыеРеквизиты	= Новый Массив;

Если НЕ ЗначениеЗаполнено(ДатаС) Тогда Возврат; КонецЕсли;
Если НЕ ЗначениеЗаполнено(ДатаПо) Тогда Возврат; КонецЕсли;

//ОписаниеЧисло_10_2 = Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(10, 2)); 
ОписаниеЧисло_3_1 = Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(3, 1)); 

Дата = ДатаС;
Пока Истина Цикл
	Имя = ИмяРеквизитаТабельДата(Дата);
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Имя, ОписаниеЧисло_3_1, "Табель"));
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Имя, ОписаниеЧисло_3_1, "Табель_OldValue"));
	
	Дата = Дата + 24 * 60 * 60;
	Если Дата > ДатаПо Тогда Прервать; КонецЕсли;
КонецЦикла;

// Добавим новые реквизиты в форму
ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

Дата = ДатаС;
Пока Истина Цикл
	Имя = ИмяРеквизитаТабельДата(Дата);
	
	ИмяНаФорме = "Табель" + Имя;
	НовыйЭлемент = Элементы.Добавить(ИмяНаФорме, Тип("ПолеФормы"), Элементы.Табель);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Табель." + Имя;
	НовыйЭлемент.Ширина = 7;
	НовыйЭлемент.Заголовок = Формат(Дата,"ДФ=dd.MM.yy");
	НовыйЭлемент.ТолькоПросмотр = Ложь;
	//НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент.ФорматРедактирования = Формат("ЧЦ=3; ЧДЦ=1; ЧРД=/"); 
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр; 
	НовыйЭлемент.КнопкаВыбора = Ложь; 
	
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Табель_ПриИзменении");
	
	Дата = Дата + 24 * 60 * 60;
	Если Дата > ДатаПо Тогда Прервать; КонецЕсли;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Табель_ПриИзменении(Элемент)
ТС = Элемент.Родитель.ТекущаяСтрока;		
ТД = Табель.НайтиПоИдентификатору(ТС);

Имя = Элемент.Имя;
//Табель
//123456
Имя = Сред(Имя, 7);
  
Значение = ТД[Имя];

ДЧасть = Значение - Цел(Значение);

Если НЕ (ДЧасть = 0.1 ИЛИ ДЧасть = 0.2) Тогда
	ПоказатьПредупреждение(, "Номер смены д. б. 1 или 2");
	
	Строка_OldValue = Табель_OldValue[0];
	ТД[Имя] = Строка_OldValue[Имя];
	
	Возврат;
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельПриАктивизацииСтроки(Элемент)
ТС = Элемент.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ЗапомнитьТабельСтрока(ТС);	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьТабельСтрока(ТС)
ТД = Табель.НайтиПоИдентификатору(ТС);	

ОтборСтроки = Новый Структура("Администратор", Неопределено);
ТЗ = Табель.Выгрузить(ОтборСтроки);

Табель_OldValue.Очистить();
СтрокаТабель_OldValue = Табель_OldValue.Добавить(); 

Для Каждого Колонка Из ТЗ.Колонки Цикл              
	СтрокаТабель_OldValue[Колонка.Имя] = ТД[Колонка.Имя];
КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТабель(Команда)
ЗаполнитьТабельНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабельНаСервере()
Запрос = Новый Запрос( "ВЫБРАТЬ
                       |	Администраторы.Ссылка КАК Администратор
                       |ИЗ
                       |	Справочник.Администраторы КАК Администраторы
                       |ГДЕ
                       |	Администраторы.ПометкаУдаления = ЛОЖЬ
                       |	И Администраторы.НеРаботает = ЛОЖЬ");

Администраторы = Запрос.Выполнить().Выгрузить(); 	
	
Запрос = Новый Запрос(	"ВЫБРАТЬ
                      	|	АдминистраторыТабель.Администратор КАК Администратор,
                      	|	АдминистраторыТабель.Дата КАК Дата,
                      	|	АдминистраторыТабель.Часы КАК Часы
                      	|ИЗ
                      	|	РегистрСведений.АдминистраторыТабель КАК АдминистраторыТабель
                      	|ГДЕ
                      	|	АдминистраторыТабель.Дата МЕЖДУ &ДатаС И &ДатаПо");
	
Запрос.УстановитьПараметр("ДатаС", ДатаС);
Запрос.УстановитьПараметр("ДатаПо", ДатаПо);

ТекущийТабель = Запрос.Выполнить().Выгрузить();

Табель.Очистить();
Для Каждого Строка Из Администраторы Цикл
	НоваяСтрока = Табель.Добавить();
	НоваяСтрока.Администратор = Строка.Администратор;
	
	ОтборСтроки = Новый Структура("Администратор", Строка.Администратор); 
	НайденныеСтроки = ТекущийТабель.НайтиСтроки(ОтборСтроки); 
	Для Каждого СтрокаТабель Из НайденныеСтроки	Цикл
		Имя = ИмяРеквизитаТабельДата(СтрокаТабель.Дата);
		НоваяСтрока[Имя] = СтрокаТабель.Часы;
	КонецЦикла;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТабель(Команда)
СохранитьТабельНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьТабельНаСервере()
Для Каждого Строка Из Табель Цикл
	Дата = ДатаС;
	Пока Истина Цикл
		Имя = ИмяРеквизитаТабельДата(Дата);
		Часы = Строка[Имя];
		
		МенеджерЗаписи = РегистрыСведений.АдминистраторыТабель.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Администратор = Строка.Администратор; 
		МенеджерЗаписи.Дата = Дата; 
		МенеджерЗаписи.Часы = Часы; 
		МенеджерЗаписи.Записать();
		
		Дата = Дата + 24 * 60 * 60;
		Если Дата > ДатаПо Тогда Прервать; КонецЕсли;
	КонецЦикла;
КонецЦикла;	
КонецПроцедуры



