
&НаСервере
Процедура ОбновитьБиблиотекуТОНаСервере()
//МенеджерОборудованияВызовСервераПереопределяемый.ОбновлениеБиблиотеки();

ОбновлениеИнформационнойБазыБПО.ОбновитьПоставляемыеДрайвера();
ОбновлениеИнформационнойБазыБПО.ОбновитьСправочникДрайвера();
ОбновлениеИнформационнойБазыБПО.ОбновитьПодключаемоеОборудование();
//ОбновлениеИнформационнойБазыБПО.ОбновитьПоставляемыеДрайвера();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБиблиотекуТО(Команда)
	ОбновитьБиблиотекуТОНаСервере();
КонецПроцедуры
