
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Параметры.Свойство("Номер", Номер);	
ОбновитьСостояниеНаСервере();	
ОбновитьДанныеНаФорме();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаФорме()
ОписаниеНомера = Номер.ОписаниеНомера;

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	НомернойФонд.Ссылка КАК Ссылка,
                      |	ГорничныеНомера.ДатаПредыдущейСменыБелья КАК ДатаПредыдущейСменыБелья,
                      |	ГорничныеНомера.РаздельныеКровати КАК РаздельныеКровати,
                      |	ГорничныеНомера.ДопМесто_1_ТипДопМеста КАК ДопМесто_1_ТипДопМеста,
                      |	ГорничныеНомера.ДопМесто_2_ТипДопМеста КАК ДопМесто_2_ТипДопМеста,
                      |	ГорничныеНомера.ТекущееДополнительноеОборудование.(
                      |		ДопОборудование КАК ДопОборудование
                      |	) КАК ТекущееДополнительноеОборудование,
                      |	ГорничныеОбслуживание.ГорничныеНомер КАК ГорничныеНомер,
                      |	ГорничныеОбслуживание.ДатаОбслуживания КАК ДатаОбслуживания,
                      |	ГорничныеОбслуживание.НомерОбслуживания_пп КАК НомерОбслуживания_пп,
                      |	ГорничныеОбслуживание.ТипУборки КАК ТипУборки,
                      |	ГорничныеОбслуживание.ТипКомплектации КАК ТипКомплектации,
                      |	ГорничныеОбслуживание.Температура КАК Температура,
                      |	ГорничныеОбслуживание.КоличествоПроживающих КАК КоличествоПроживающих,
                      |	ГорничныеОбслуживание.ТехническиеНеисправности.(
                      |		Ссылка КАК Ссылка,
                      |		НомерСтроки КАК НомерСтроки,
                      |		ТехническаяНеисправность КАК ТехническаяНеисправность
                      |	) КАК ТехническиеНеисправности,
                      |	ГорничныеОбслуживание.ТехническиеНеисправностиПримечание КАК ТехническиеНеисправностиПримечание,
                      |	ГорничныеОбслуживание.УщербНомеру КАК УщербНомеру,
                      |	ГорничныеОбслуживание.Курит КАК Курит,
                      |	ГорничныеОбслуживание.ЗабытыеВещи КАК ЗабытыеВещи,
                      |	ГорничныеОбслуживание.Комментарий КАК Комментарий,
                      |	ГорничныеОбслуживание.ВремяУборки КАК ВремяУборки,
                      |	ГорничныеОбслуживание.РаздельныеКроватиОбработка КАК РаздельныеКроватиОбработка,
                      |	ГорничныеОбслуживание.ДополнительнаяКроватьОбработка КАК ДополнительнаяКроватьОбработка,
                      |	ГорничныеОбслуживание.ДетскаяКроватьОбработка КАК ДетскаяКроватьОбработка
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд
                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГорничныеНомера КАК ГорничныеНомера
                      |		ПО НомернойФонд.НомерГорничные = ГорничныеНомера.НомерГорничные
                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |			ГорничныеОбслуживаниеНомера.Ссылка КАК Ссылка,
                      |			ГорничныеОбслуживаниеНомера.ГорничныеНомер КАК ГорничныеНомер,
                      |			ГорничныеОбслуживаниеНомера.ДатаОбслуживания КАК ДатаОбслуживания,
                      |			ГорничныеОбслуживаниеНомера.НомерОбслуживания_пп КАК НомерОбслуживания_пп,
                      |			ГорничныеОбслуживаниеНомера.ТипУборки КАК ТипУборки,
                      |			ГорничныеОбслуживаниеНомера.ТипКомплектации КАК ТипКомплектации,
                      |			ГорничныеОбслуживаниеНомера.Температура КАК Температура,
                      |			ГорничныеОбслуживаниеНомера.КоличествоПроживающих КАК КоличествоПроживающих,
                      |			ГорничныеОбслуживаниеНомера.УщербНомеру КАК УщербНомеру,
                      |			ГорничныеОбслуживаниеНомера.Курит КАК Курит,
                      |			ГорничныеОбслуживаниеНомера.ЗабытыеВещи КАК ЗабытыеВещи,
                      |			ГорничныеОбслуживаниеНомера.Комментарий КАК Комментарий,
                      |			ГорничныеОбслуживаниеНомера.ВремяУборки КАК ВремяУборки,
                      |			ГорничныеОбслуживаниеНомера.РаздельныеКроватиОбработка КАК РаздельныеКроватиОбработка,
                      |			ГорничныеОбслуживаниеНомера.ДополнительнаяКроватьОбработка КАК ДополнительнаяКроватьОбработка,
                      |			ГорничныеОбслуживаниеНомера.ДетскаяКроватьОбработка КАК ДетскаяКроватьОбработка,
                      |			ГорничныеОбслуживаниеНомера.ТехническиеНеисправности.(
                      |				Ссылка КАК Ссылка,
                      |				НомерСтроки КАК НомерСтроки,
                      |				ТехническаяНеисправность КАК ТехническаяНеисправность
                      |			) КАК ТехническиеНеисправности,
                      |			ГорничныеОбслуживаниеНомера.ТехническиеНеисправностиПримечание КАК ТехническиеНеисправностиПримечание
                      |		ИЗ
                      |			Документ.ГорничныеОбслуживаниеНомера КАК ГорничныеОбслуживаниеНомера
                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |					ГорничныеОбслуживаниеНомера.ГорничныеНомер КАК ГорничныеНомер,
                      |					ГорничныеОбслуживаниеНомера.ДатаОбслуживания КАК ДатаОбслуживания,
                      |					МАКСИМУМ(ГорничныеОбслуживаниеНомера.НомерОбслуживания_пп) КАК НомерОбслуживания_пп
                      |				ИЗ
                      |					Документ.ГорничныеОбслуживаниеНомера КАК ГорничныеОбслуживаниеНомера
                      |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                      |							ГорничныеОбслуживаниеНомера.ГорничныеНомер КАК ГорничныеНомер,
                      |							МАКСИМУМ(ГорничныеОбслуживаниеНомера.ДатаОбслуживания) КАК ДатаОбслуживания
                      |						ИЗ
                      |							Документ.ГорничныеОбслуживаниеНомера КАК ГорничныеОбслуживаниеНомера
                      |						
                      |						СГРУППИРОВАТЬ ПО
                      |							ГорничныеОбслуживаниеНомера.ГорничныеНомер) КАК МаксимумДата
                      |						ПО ГорничныеОбслуживаниеНомера.ГорничныеНомер = МаксимумДата.ГорничныеНомер
                      |							И ГорничныеОбслуживаниеНомера.ДатаОбслуживания = МаксимумДата.ДатаОбслуживания
                      |				
                      |				СГРУППИРОВАТЬ ПО
                      |					ГорничныеОбслуживаниеНомера.ГорничныеНомер,
                      |					ГорничныеОбслуживаниеНомера.ДатаОбслуживания) КАК ГорничныеМаксимум
                      |				ПО ГорничныеОбслуживаниеНомера.ГорничныеНомер = ГорничныеМаксимум.ГорничныеНомер
                      |					И ГорничныеОбслуживаниеНомера.ДатаОбслуживания = ГорничныеМаксимум.ДатаОбслуживания
                      |					И ГорничныеОбслуживаниеНомера.НомерОбслуживания_пп = ГорничныеМаксимум.НомерОбслуживания_пп) КАК ГорничныеОбслуживание
                      |		ПО НомернойФонд.НомерГорничные = ГорничныеОбслуживание.ГорничныеНомер.НомерГорничные
                      |ГДЕ
                      |	НомернойФонд.Ссылка = &Ссылка");	

Запрос.УстановитьПараметр("Ссылка", Номер);
ТЗ = Запрос.Выполнить().Выгрузить();
Если ТЗ.Количество() = 0 Тогда Отказ = Истина; Возврат; КонецЕсли;

Данные = ТЗ[0];

ЗаполнитьЗначенияСвойств(ЭтаФорма, Данные,,"ТекущееДополнительноеОборудование, ТехническиеНеисправности");

ТекущееДополнительноеОборудование.Очистить();
Для Каждого Строка Из Данные.ТекущееДополнительноеОборудование Цикл
	НоваяСтрока = ТекущееДополнительноеОборудование.Добавить(); 
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

ТехническиеНеисправности.Очистить();
Для Каждого Строка Из Данные.ТехническиеНеисправности Цикл
	НоваяСтрока = ТехническиеНеисправности.Добавить(); 
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
КонецЦикла;

Если ТехническиеНеисправности.Количество() > 0 Тогда
	Элементы.ГруппаТехническиеНеисправности.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
КонецЕсли;

ПоказатьДопМесто(Данные.ДопМесто_1_ТипДопМеста, ДопМесто_1_ТипДопМестаНадпись);
ПоказатьДопМесто(Данные.ДопМесто_2_ТипДопМеста, ДопМесто_2_ТипДопМестаНадпись);
КонецПроцедуры

&НаСервере
Процедура ПоказатьДопМесто(ДопМесто, ДопМестоНадпись)
Если ДопМесто = 0 Тогда 
	ДопМестоНадпись = "Нет";
ИначеЕсли ДопМесто = 1 Тогда 
	ДопМестоНадпись = "Кровать";
ИначеЕсли ДопМесто = 2 Тогда 
	ДопМестоНадпись = "Манеж";
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояние(Команда)
ОбновитьСостояниеНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеНаСервере()
//ДатаС = НачалоДня(ТекущаяДата() - 24* 60 * 60);	
ДатаС = НачалоДня(ТекущаяДата());	
ОбменГорничныеСервер.ЗагрузитьОбслуживаниеНомеров(ДатаС, НачалоДня(ТекущаяДата()), Номер.НомерГорничные);
ОбновитьДанныеНаФорме();
КонецПроцедуры


