
&НаКлиенте
Процедура ДоплатыЗаКатегорииПриАктивизацииСтроки(Элемент)
ТС = Элемент.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ДоплатыЗаКатегорииПриАктивизацииСтрокиНаСервере(ТС);
КонецПроцедуры

&НаСервере
Процедура ДоплатыЗаКатегорииПриАктивизацииСтрокиНаСервере(ТС)
ТД = Объект.ДоплатыЗаКатегории.НайтиПоИдентификатору(ТС);	
Элементы.ДоплатыЗаКатегорииДоплатаЗаКатегорию.Доступность 
	= НЕ (ТД.КатегорияНомера.Базовый 
			ИЛИ ТД.КатегорияНомера = Справочники.КатегорииНомеров.ПустаяСсылка());
КонецПроцедуры


&НаКлиенте
Процедура ДоплатыЗаКатегорииКатегорияНомераПриИзменении(Элемент)
ТС = Элемент.Родитель.ТекущаяСтрока;
Если ТС = Неопределено Тогда Возврат; КонецЕсли;

ДоплатыЗаКатегорииКатегорияНомераПриИзмененииНаСервере(ТС);
КонецПроцедуры

&НаСервере
Процедура ДоплатыЗаКатегорииКатегорияНомераПриИзмененииНаСервере(ТС)
ТД = Объект.ДоплатыЗаКатегории.НайтиПоИдентификатору(ТС);	

Защита = ТД.КатегорияНомера.Базовый 
	ИЛИ ТД.КатегорияНомера = Справочники.КатегорииНомеров.ПустаяСсылка();
Элементы.ДоплатыЗаКатегорииДоплатаЗаКатегорию.Доступность = НЕ Защита;

Если Защита Тогда ТД.ДоплатаЗаКатегорию = 0; КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
ТекущийОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
ТекущийОбъект.ДатаИзменения = ТекущаяДата();
КонецПроцедуры







