

Функция ЗаписатьСообщениеСИзменениями() Экспорт
УзелИсточник = ПланыОбмена.ОбменГостиницы.ЭтотУзел();	
Результат = ОбменГостиницы.ЗаписатьСообщениеСИзменениями(УзелИсточник, ЭтотОбъект);

Возврат Результат;
КонецФункции

Функция ПрочитатьСообщениеСИзменениями() Экспорт
УзелПриемник = ПланыОбмена.ОбменГостиницы.ЭтотУзел();	
Результат = ОбменГостиницы.ПрочитатьСообщениеСИзменениями(ЭтотОбъект, УзелПриемник);

Возврат Результат;
КонецФункции
//////


Функция ЗаписатьСообщениеПодтверждения() Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	
	
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Выгрузка в узел " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();

// Получить имя файла обмена.
//ИмяФайла = ОбменВыписка.ПолучитьИмяФайлаОбмена(ПланыОбмена.Выписка.ЭтотУзел(), Ссылка);
ИмяФайла = ПолучитьИмяВременногоФайла("xml"); 

// Создать объект записи XML.
// *** ЗаписьXML-документов.
ЗаписьXML = Новый ЗаписьXML;
ЗаписьXML.ОткрытьФайл(ИмяФайла);
ЗаписьXML.ЗаписатьОбъявлениеXML();

// *** Инфраструктура сообщений.
ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Ссылка);

// Записать соответствие пространств имен для сокращения размера файла сообщения
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsd", "http://www.w3.org/2001/XMLSchema");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/data");

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = " Номер сообщения: " + ЗаписьСообщения.НомерСообщения;
Сообщение.Сообщить();

ЗаписьСообщения.ЗакончитьЗапись();
ЗаписьXML.Закрыть();

// + ПСН 
// Получить имя файла обмена.
//ИмяФайлаФТП = ОбменВыписка.ПолучитьИмяФайлаОбменаФТП(ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), Ссылка);
ИмяФайлаФТП = "C:\_Base1C\Обмен_Подтверждения.xml"; 

Ответ = ФТПСервер.ЗаписатьФТПФайл_TECT(ИмяФайла, ИмяФайлаФТП); 
Если Ответ.Ошибка Тогда 
	Сообщить("Ошибка записи файла обмена по FTP. " + Ответ.ОписаниеОшибки + 
		". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
	
	 Результат = Ответ;
КонецЕсли;

 ~ВЫХОД:
УдалитьФайлы(ИмяФайла);
// - ПСН 

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец выгрузки ------------";
Сообщение.Сообщить();

Возврат Результат;
КонецФункции

Функция ПрочитатьСообщениеПодтверждения() Экспорт
Результат = Новый Структура("Ошибка, КодОшибки, ОписаниеОшибки", Ложь, 0, "");	
	
ДанныеУзлаОбмена = ФТПСервер.ПолучитьДанныеУзлаОбмена(Ссылка.Код);

ИмяФайла = ПолучитьИмяВременногоФайла("xml");

//ИмяФайлаФТП = ОбменГостиницы.ПолучитьИмяФайлаОбменаФТП(Ссылка, ПланыОбмена.ВГ_ВыпискаГостиницы.ЭтотУзел(), ДанныеУзлаОбмена.КаталогОбменаFTP);
//Результат = ОбщийМодульФТП.ПолучитьФТПФайл(ИмяФайлаФТП, ИмяФайла
//	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
	
ИмяФайлаФТП = "C:\_Base1C\Обмен_Подтверждения_1.xml"; 
КопироватьФайл(ИмяФайлаФТП, ИмяФайла);

//Результат = ФТПСервер.ЗаписатьФТПФайл_TECT(ИмяФайлаФТП, ИмяФайла);
//Если Результат.КодОшибки < 0 Тогда 
//	Сообщить("Ошибка чтения файла обмена по FTP: " + Результат.ОписаниеОшибки + 
//	". ОБРАТИТЕСЬ К АДМИНИСТРАТОРУ ПРОГРАММЫ.");
//ИначеЕсли Результат.КодОшибки > 0 Тогда 
//	Возврат;
//КонецЕсли;

Файл = Новый Файл(ИмяФайла);

//Если Не Файл.Существует() Тогда
//	Возврат;
//КонецЕсли;

// Попытаться открыть файл.
// *** Чтение документов XML.
ЧтениеXML = Новый ЧтениеXML;
Попытка
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
Исключение
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Невозможно открыть файл обмена данными.";
	Сообщение.Сообщить();
	
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -10;;
	Результат.ОписаниеОшибки = "Невозможно открыть файл обмена данными.";

	Возврат Результат;
КонецПопытки;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Загрузка из " + Строка(ЭтотОбъект) + " ------------";
Сообщение.Сообщить();
Сообщение.Текст = " – Считывается файл " + ИмяФайла;
Сообщение.Сообщить();

// Загрузить данные из найденного файла.
// *** Инфраструктура сообщений.
ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();

// Прочитать заголовок сообщения обмена данными – файла XML.
ЧтениеСообщения.НачатьЧтение(ЧтениеXML);

// Проверить, что сообщение предназначено для этого узла.
Если ЧтениеСообщения.Отправитель <> Ссылка Тогда
	//ВызватьИсключение "Неверный узел";
	Результат.Ошибка = Истина;
	Результат.КодОшибки = -20;
	Результат.ОписаниеОшибки = "Неверный узел.";
	
	Возврат Результат;
КонецЕсли;

// Удалить регистрацию изменений для узла-отправителя сообщения.
// *** Служба регистрации изменений.
//ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, Неопределено);

ЧтениеСообщения.ЗакончитьЧтение();
ЧтениеXML.Закрыть();

УдалитьФайлы(ИмяФайла);

//Результат = ОбщийМодульФТП.УдалитьФТПФайл(ИмяФайлаФТП
//	, ДанныеУзлаОбмена.АдресФТП, ДанныеУзлаОбмена.ИмяПользователя, ДанныеУзлаОбмена.Пароль); 
//Если Результат.ЕстьОшибки Тогда
//	Сообщить("Ошибка удаления файла FTP: " + Результат.ОписаниеОшибки);
//КонецЕсли;

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "-------- Конец загрузки ------------";
Сообщение.Сообщить();

Возврат Результат;
КонецФункции
// +++++++++++++++++++++++++++++++++++++
