
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
ОбновитьПриход();	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
ОбновитьПриход(); 
КонецПроцедуры

&НаСервере
Процедура ОбновитьПриход()
Для Каждого Строка Из Объект.Приход Цикл
	ОбновитьСтрокаПриход(Строка)
КонецЦикла;

СуммаИтого = Объект.Приход.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокаПриход(Строка)
Строка.Сумма = Окр(Строка.Количество * Строка.Цена, 2);	
КонецПроцедуры

//
&НаКлиенте
Процедура ПриходПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
Строка = Элемент.ТекущиеДанные;
Строка.Сумма = Окр(Строка.Количество * Строка.Цена, 2);	

СуммаИтого = Объект.Приход.Итог("Сумма");
КонецПроцедуры
//

