
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТолькоПросмотр = РаботаСИнтерфейсомСервер.ПользовательТолькоПросмотр();
ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр; 
	
ОбновитьСписок();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
ЭлементОтбораПометкаУдаления = Неопределено;

ПометкаУдаления = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
Для Каждого Строка Из Список.Отбор.Элементы Цикл
	Если Строка.ЛевоеЗначение = ПометкаУдаления Тогда
		ЭлементОтбораПометкаУдаления = Строка;
		Прервать;
	КонецЕсли;
КонецЦикла;
	
Если Все Тогда
	Если ЭлементОтбораПометкаУдаления <> Неопределено Тогда Список.Отбор.Элементы.Удалить(Строка); КонецЕсли;
	
Иначе
	Если ЭлементОтбораПометкаУдаления <> Неопределено Тогда
		ЭлементОтбора = ЭлементОтбораПометкаУдаления;
	Иначе
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Ложь;	
	
КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ВсеПриИзменении(Элемент)
ОбновитьСписок();
КонецПроцедуры
