&НаКлиенте
Функция ПроверкаДат()
Если НЕ ЗначениеЗаполнено(ДатаС) 
ИЛИ НЕ ЗначениеЗаполнено(ДатаПо) 
Тогда
	ПоказатьПредупреждение(, "Пустая дата");
	
	Возврат Истина;
КонецЕсли;

Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
Если ПроверкаДат() Тогда Возврат; КонецЕсли;	
	
ПолеОтчета = СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоНомеров
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд
                      |ГДЕ
                      |	НомернойФонд.ПометкаУдаления = ЛОЖЬ");	

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда 
	КоличествоНомеров = Выборка.КоличествоНомеров;
Иначе
	Возврат Неопределено;
КонецЕсли;

ТабДок = Новый ТабличныйДокумент;
Макет = Обработки.ГлубинаБронирования.ПолучитьМакет("Макет");

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

Дата_П = ДатаС; 

Пока Дата_П <= ДатаПо Цикл
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаявкаНаБронирование.Номер КАК Номер,
		                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
		                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
		                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
		                      |	ЗаявкаНаБронирование.Дата КАК Дата,
		                      |	ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь) КАК ЭтоБронь,
		                      |	ЗаявкаНаБронирование.РезервС < &ТекущаяДата
		                      |		И ЗаявкаНаБронирование.РезервПо > &ТекущаяДата КАК ПроживанияСЗаездомРаньше,
		                      |	РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Дата, ЗаявкаНаБронирование.РезервС, ДЕНЬ) КАК РазностьДат
		                      |ИЗ
		                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
		                      |ГДЕ
		                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
		                      |	И (ЗаявкаНаБронирование.РезервС = &ТекущаяДата
		                      |			ИЛИ ЗаявкаНаБронирование.РезервС < &ТекущаяДата
		                      |				И ЗаявкаНаБронирование.РезервПо > &ТекущаяДата)
		                      |	И ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
		                      |	И ЗаявкаНаБронирование.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
		                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
		                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)");

	
	//Дата_П = '20250110';
	Запрос.УстановитьПараметр("ТекущаяДата", Дата_П);
	ТЗ = Запрос.Выполнить().Выгрузить();
	//ТЗ.Свернуть("Номер, Ссылка, РезервС, РезервПо, Дата, РазностьДат, ЭтоБронь, ПроживанияСЗаездомРаньше");  
	ТЗ.Свернуть("Номер, Ссылка, РезервС, РезервПо, Дата, РазностьДат, ПроживанияСЗаездомРаньше");  
	ИтогоНомеров = 0;
	Глубина_0_1	= 0;
	Глубина_2_3	= 0;
	Глубина_4_7	= 0;
	Глубина_8_14 = 0;	
	Глубина_15_30 = 0;
	Глубина_31_60 = 0;
	Глубина_60 = 0;	
	ПроживанияЗаездРаньше = 0;
	//Мероприятия
	Для Каждого Строка Из ТЗ Цикл
		ИтогоНомеров = ИтогоНомеров + 1;
		
		Если Строка.ПроживанияСЗаездомРаньше Тогда
			ПроживанияЗаездРаньше = ПроживанияЗаездРаньше + 1;
		
		Иначе
			РазницаДаты = Строка.РазностьДат; 
			Если РазницаДаты < 0 Тогда 
				РазницаДаты = 0; 
			КонецЕсли;	
			
			Если РазницаДаты < 2 Тогда 
				Глубина_0_1 = Глубина_0_1 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 1 
			И РазницаДаты < 4 
			Тогда 
				Глубина_2_3 = Глубина_2_3 + 1;
			КонецЕсли;

			Если РазницаДаты > 3 
			И РазницаДаты < 8 
			Тогда 
				Глубина_4_7 = Глубина_4_7 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 7 
			И РазницаДаты < 15 
			Тогда 
				Глубина_8_14 = Глубина_8_14 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 14 
			И РазницаДаты < 31 
			Тогда 
				Глубина_15_30 = Глубина_15_30 + 1;
			КонецЕсли;

			Если РазницаДаты > 30 
			И РазницаДаты < 61 
			Тогда 
				Глубина_31_60 = Глубина_31_60 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 60 
			Тогда 
				Глубина_60 = Глубина_60 + 1;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	ПрогнозЗагрузки = Окр((ИтогоНомеров / КоличествоНомеров) * 100);
	
	ЗапросМероприятия = Новый Запрос("ВЫБРАТЬ
	                                 |	Мероприятия.Ссылка КАК Ссылка,
	                                 |	Мероприятия.Наименование КАК Наименование,
	                                 |	Мероприятия.ДатаС КАК ДатаС,
	                                 |	Мероприятия.ДатаПо КАК ДатаПо,
	                                 |	Мероприятия.ТипМероприятия КАК ТипМероприятия,
	                                 |	Мероприятия.Мероприятие КАК Мероприятие
	                                 |ИЗ
	                                 |	Справочник.Мероприятия КАК Мероприятия
	                                 |ГДЕ
	                                 |	Мероприятия.ПометкаУдаления = ЛОЖЬ
	                                 |	И Мероприятия.ДатаС <= &Дата
	                                 |	И Мероприятия.ДатаПо >= &Дата
	                                 |
	                                 |УПОРЯДОЧИТЬ ПО
	                                 |	ДатаС");
	
	ЗапросМероприятия.УстановитьПараметр("Дата", Дата_П);
	ТЗМероприятия = ЗапросМероприятия.Выполнить().Выгрузить();
	Мероприятия = "";
	Для Каждого Строка Из ТЗМероприятия Цикл
		Мероприятие = ?(ЗначениеЗаполнено(Строка.Мероприятие), Строка.Мероприятие, Строка.Наименование);
		Мероприятия = Мероприятия + Мероприятие + Символы.ПС;
	КонецЦикла;
	Если Мероприятия <> "" Тогда 
		Мероприятия = Лев(Мероприятия, СтрДлина(Мероприятия) - 1);
	КонецЕсли; 
	
	Область = Макет.ПолучитьОбласть("Строка");	 
	ОбластьПараметры = Область.Параметры;
	
	ОбластьПараметры.Дата = Формат(Дата_П, "ДФ=dd.MM.yy");
	ДеньНедели = ОбщийФункционалКлиентСервер.ДеньНеделиСтрока(ДеньНедели(Дата_П)); 
	ОбластьПараметры.ДеньНедели = ДеньНедели;	
	
	ОбластьПараметры.ИтогоНомеров = ИтогоНомеров;	
	ОбластьПараметры.ПрогнозЗагрузки = ПрогнозЗагрузки;	
	ОбластьПараметры.Глубина_0_1 = Глубина_0_1;	
	ОбластьПараметры.Глубина_2_3 = Глубина_2_3;	
	ОбластьПараметры.Глубина_4_7 = Глубина_4_7;	
	ОбластьПараметры.Глубина_8_14 = Глубина_8_14;	
	ОбластьПараметры.Глубина_15_30 = Глубина_15_30;	
	ОбластьПараметры.Глубина_31_60 = Глубина_31_60;	          
	ОбластьПараметры.Глубина_60 = Глубина_60;	
	ОбластьПараметры.ПроживанияЗаездРаньше = ПроживанияЗаездРаньше;	
	
	ОбластьПараметры.Мероприятия = Мероприятия;	
	//ПрогнозЗагрузки	Глубина_0_1	Глубина_2_3	Глубина_4_7	Глубина_6_7	Глубина_8_14	Глубина_11_14	Глубина_15_30	Глубина_31_60	Глубина_60	ПроживанияЗаездРаньше	Меропрятия
	
	ТабДок.Вывести(Область);
	
	Дата_П = Дата_П + 24* 60 * 60;	 
КонецЦикла;

Возврат ТабДок; 
КонецФункции

&НаСервере
Функция СформироватьНаСервере_3()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоНомеров
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд
                      |ГДЕ
                      |	НомернойФонд.ПометкаУдаления = ЛОЖЬ");	

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда 
	КоличествоНомеров = Выборка.КоличествоНомеров;
Иначе
	Возврат Неопределено;
КонецЕсли;

ТабДок = Новый ТабличныйДокумент;
Макет = Обработки.ГлубинаБронирования.ПолучитьМакет("Макет");

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

Дата_П = ДатаС; 

Пока Дата_П <= ДатаПо Цикл
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаявкаНаБронирование.Номер КАК Номер,
		                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
		                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
		                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
		                      |	ЗаявкаНаБронирование.Дата КАК Дата,
		                      |	ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь) КАК ЭтоБронь,
		                      |	ЗаявкаНаБронирование.РезервС < &ТекущаяДата
		                      |		И ЗаявкаНаБронирование.РезервПо > &ТекущаяДата КАК ПроживанияСЗаездомРаньше,
		                      |	РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Дата, ЗаявкаНаБронирование.РезервС, ДЕНЬ) КАК РазностьДат
		                      |ИЗ
		                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
		                      |ГДЕ
		                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
		                      |	И (ЗаявкаНаБронирование.РезервС = &ТекущаяДата
		                      |			ИЛИ ЗаявкаНаБронирование.РезервС < &ТекущаяДата
		                      |				И ЗаявкаНаБронирование.РезервПо > &ТекущаяДата)
		                      |	И ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
		                      |	И ЗаявкаНаБронирование.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
		                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
		                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)");

	
	//Дата_П = '20250110';
	Запрос.УстановитьПараметр("ТекущаяДата", Дата_П);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Свернуть("Номер, Ссылка, РезервС, РезервПо, Дата, РазностьДат, ЭтоБронь");  
	ИтогоНомеров = 0;
	Глубина_0_1	= 0;
	Глубина_2_3	= 0;
	Глубина_4_7	= 0;
	Глубина_8_14 = 0;	
	Глубина_15_30 = 0;
	Глубина_31_60 = 0;
	Глубина_60 = 0;	
	ПроживанияЗаездРаньше = 0;
	//Мероприятия
	Для Каждого Строка Из ТЗ Цикл
		ИтогоНомеров = ИтогоНомеров + 1;
		
		Если Строка.ЭтоБронь Тогда
			РазницаДаты = Строка.РазностьДат; 
			Если РазницаДаты < 0 Тогда 
				РазницаДаты = 0; 
			КонецЕсли;	
			
			Если РазницаДаты < 2 Тогда 
				Глубина_0_1 = Глубина_0_1 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 1 
			И РазницаДаты < 4 
			Тогда 
				Глубина_2_3 = Глубина_2_3 + 1;
			КонецЕсли;

			Если РазницаДаты > 3 
			И РазницаДаты < 8 
			Тогда 
				Глубина_4_7 = Глубина_4_7 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 7 
			И РазницаДаты < 15 
			Тогда 
				Глубина_8_14 = Глубина_8_14 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 14 
			И РазницаДаты < 31 
			Тогда 
				Глубина_15_30 = Глубина_15_30 + 1;
			КонецЕсли;

			Если РазницаДаты > 30 
			И РазницаДаты < 61 
			Тогда 
				Глубина_31_60 = Глубина_31_60 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 60 
			Тогда 
				Глубина_60 = Глубина_60 + 1;
			КонецЕсли;
			
		Иначе	
			ПроживанияЗаездРаньше = ПроживанияЗаездРаньше + 1;
		КонецЕсли;
	КонецЦикла;

	ПрогнозЗагрузки = Окр((ИтогоНомеров / КоличествоНомеров) * 100);
	
	ЗапросМероприятия = Новый Запрос("ВЫБРАТЬ
	                                 |	Мероприятия.Ссылка КАК Ссылка,
	                                 |	Мероприятия.Наименование КАК Наименование,
	                                 |	Мероприятия.ДатаС КАК ДатаС,
	                                 |	Мероприятия.ДатаПо КАК ДатаПо,
	                                 |	Мероприятия.ТипМероприятия КАК ТипМероприятия,
	                                 |	Мероприятия.Мероприятие КАК Мероприятие
	                                 |ИЗ
	                                 |	Справочник.Мероприятия КАК Мероприятия
	                                 |ГДЕ
	                                 |	Мероприятия.ПометкаУдаления = ЛОЖЬ
	                                 |	И Мероприятия.ДатаС <= &Дата
	                                 |	И Мероприятия.ДатаПо >= &Дата
	                                 |
	                                 |УПОРЯДОЧИТЬ ПО
	                                 |	ДатаС");
	
	ЗапросМероприятия.УстановитьПараметр("Дата", Дата_П);
	ТЗМероприятия = ЗапросМероприятия.Выполнить().Выгрузить();
	Мероприятия = "";
	Для Каждого Строка Из ТЗМероприятия Цикл
		Мероприятие = ?(ЗначениеЗаполнено(Строка.Мероприятие), Строка.Мероприятие, Строка.Наименование);
		Мероприятия = Мероприятия + Мероприятие + Символы.ПС;
	КонецЦикла;
	Если Мероприятия <> "" Тогда 
		Мероприятия = Лев(Мероприятия, СтрДлина(Мероприятия) - 1);
	КонецЕсли; 
	
	Область = Макет.ПолучитьОбласть("Строка");	 
	ОбластьПараметры = Область.Параметры;
	
	ОбластьПараметры.Дата = Формат(Дата_П, "ДФ=dd.MM.yy");
	ДеньНедели = ОбщийФункционалКлиентСервер.ДеньНеделиСтрока(ДеньНедели(Дата_П)); 
	ОбластьПараметры.ДеньНедели = ДеньНедели;	
	
	ОбластьПараметры.ИтогоНомеров = ИтогоНомеров;	
	ОбластьПараметры.ПрогнозЗагрузки = ПрогнозЗагрузки;	
	ОбластьПараметры.Глубина_0_1 = Глубина_0_1;	
	ОбластьПараметры.Глубина_2_3 = Глубина_2_3;	
	ОбластьПараметры.Глубина_4_7 = Глубина_4_7;	
	ОбластьПараметры.Глубина_8_14 = Глубина_8_14;	
	ОбластьПараметры.Глубина_15_30 = Глубина_15_30;	
	ОбластьПараметры.Глубина_31_60 = Глубина_31_60;	          
	ОбластьПараметры.Глубина_60 = Глубина_60;	
	ОбластьПараметры.ПроживанияЗаездРаньше = ПроживанияЗаездРаньше;	
	
	ОбластьПараметры.Мероприятия = Мероприятия;	
	//ПрогнозЗагрузки	Глубина_0_1	Глубина_2_3	Глубина_4_7	Глубина_6_7	Глубина_8_14	Глубина_11_14	Глубина_15_30	Глубина_31_60	Глубина_60	ПроживанияЗаездРаньше	Меропрятия
	
	ТабДок.Вывести(Область);
	
	Дата_П = Дата_П + 24* 60 * 60;	 
КонецЦикла;

Возврат ТабДок; 
КонецФункции

&НаСервере
Функция СформироватьНаСервере_2()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоНомеров
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд
                      |ГДЕ
                      |	НомернойФонд.ПометкаУдаления = ЛОЖЬ");	

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда 
	КоличествоНомеров = Выборка.КоличествоНомеров;
Иначе
	Возврат Неопределено;
КонецЕсли;

ТабДок = Новый ТабличныйДокумент;
Макет = Обработки.ГлубинаБронирования.ПолучитьМакет("Макет");

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

Дата_П = ДатаС; 

Пока Дата_П <= ДатаПо Цикл
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаявкаНаБронирование.Номер КАК Номер,
		                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
		                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
		                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
		                      |	ЗаявкаНаБронирование.Дата КАК Дата,
		                      |	ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь) КАК ЭтоБронь,
		                      |	ЗаявкаНаБронирование.РезервС < &ТекущаяДата
		                      |		И ЗаявкаНаБронирование.РезервПо > &ТекущаяДата КАК ПроживанияСЗаездомРаньше,
		                      |	РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Дата, ЗаявкаНаБронирование.РезервС, ДЕНЬ) КАК РазностьДат
		                      |ИЗ
		                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
		                      |ГДЕ
		                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
		                      |	И ВЫБОР
		                      |			КОГДА ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
		                      |				ТОГДА ЗаявкаНаБронирование.РезервС = &ТекущаяДата
		                      |			ИНАЧЕ ЗаявкаНаБронирование.РезервС < &ТекущаяДата
		                      |					И ЗаявкаНаБронирование.РезервПо > &ТекущаяДата
		                      |		КОНЕЦ
		                      |	И ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
		                      |	И ЗаявкаНаБронирование.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
		                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
		                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)");

	
	//Дата_П = '20250110';
	Запрос.УстановитьПараметр("ТекущаяДата", Дата_П);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Свернуть("Номер, Ссылка, РезервС, РезервПо, Дата, РазностьДат, ЭтоБронь");  
	ИтогоНомеров = 0;
	Глубина_0_1	= 0;
	Глубина_2_3	= 0;
	Глубина_4_7	= 0;
	Глубина_8_14 = 0;	
	Глубина_15_30 = 0;
	Глубина_31_60 = 0;
	Глубина_60 = 0;	
	ПроживанияЗаездРаньше = 0;
	//Мероприятия
	Для Каждого Строка Из ТЗ Цикл
		ИтогоНомеров = ИтогоНомеров + 1;
		
		Если Строка.ЭтоБронь Тогда
			РазницаДаты = Строка.РазностьДат; 
			Если РазницаДаты < 0 Тогда 
				РазницаДаты = 0; 
			КонецЕсли;	
			
			Если РазницаДаты < 2 Тогда 
				Глубина_0_1 = Глубина_0_1 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 1 
			И РазницаДаты < 4 
			Тогда 
				Глубина_2_3 = Глубина_2_3 + 1;
			КонецЕсли;

			Если РазницаДаты > 3 
			И РазницаДаты < 8 
			Тогда 
				Глубина_4_7 = Глубина_4_7 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 7 
			И РазницаДаты < 15 
			Тогда 
				Глубина_8_14 = Глубина_8_14 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 14 
			И РазницаДаты < 31 
			Тогда 
				Глубина_15_30 = Глубина_15_30 + 1;
			КонецЕсли;

			Если РазницаДаты > 30 
			И РазницаДаты < 61 
			Тогда 
				Глубина_31_60 = Глубина_31_60 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 60 
			Тогда 
				Глубина_60 = Глубина_60 + 1;
			КонецЕсли;
			
		Иначе	
			ПроживанияЗаездРаньше = ПроживанияЗаездРаньше + 1;
		КонецЕсли;
	КонецЦикла;

	ПрогнозЗагрузки = Окр((ИтогоНомеров / КоличествоНомеров) * 100);
	
	ЗапросМероприятия = Новый Запрос("ВЫБРАТЬ
	                                 |	Мероприятия.Ссылка КАК Ссылка,
	                                 |	Мероприятия.Наименование КАК Наименование,
	                                 |	Мероприятия.ДатаС КАК ДатаС,
	                                 |	Мероприятия.ДатаПо КАК ДатаПо,
	                                 |	Мероприятия.ТипМероприятия КАК ТипМероприятия,
	                                 |	Мероприятия.Мероприятие КАК Мероприятие
	                                 |ИЗ
	                                 |	Справочник.Мероприятия КАК Мероприятия
	                                 |ГДЕ
	                                 |	Мероприятия.ПометкаУдаления = ЛОЖЬ
	                                 |	И Мероприятия.ДатаС <= &Дата
	                                 |	И Мероприятия.ДатаПо >= &Дата
	                                 |
	                                 |УПОРЯДОЧИТЬ ПО
	                                 |	ДатаС");
	
	ЗапросМероприятия.УстановитьПараметр("Дата", Дата_П);
	ТЗМероприятия = ЗапросМероприятия.Выполнить().Выгрузить();
	Мероприятия = "";
	Для Каждого Строка Из ТЗМероприятия Цикл
		Мероприятие = ?(ЗначениеЗаполнено(Строка.Мероприятие), Строка.Мероприятие, Строка.Наименование);
		Мероприятия = Мероприятия + Мероприятие + Символы.ПС;
	КонецЦикла;
	Если Мероприятия <> "" Тогда 
		Мероприятия = Лев(Мероприятия, СтрДлина(Мероприятия) - 1);
	КонецЕсли; 
	
	Область = Макет.ПолучитьОбласть("Строка");	 
	ОбластьПараметры = Область.Параметры;
	
	ОбластьПараметры.Дата = Формат(Дата_П, "ДФ=dd.MM.yy");
	ДеньНедели = ОбщийФункционалКлиентСервер.ДеньНеделиСтрока(ДеньНедели(Дата_П)); 
	ОбластьПараметры.ДеньНедели = ДеньНедели;	
	
	ОбластьПараметры.ИтогоНомеров = ИтогоНомеров;	
	ОбластьПараметры.ПрогнозЗагрузки = ПрогнозЗагрузки;	
	ОбластьПараметры.Глубина_0_1 = Глубина_0_1;	
	ОбластьПараметры.Глубина_2_3 = Глубина_2_3;	
	ОбластьПараметры.Глубина_4_7 = Глубина_4_7;	
	ОбластьПараметры.Глубина_8_14 = Глубина_8_14;	
	ОбластьПараметры.Глубина_15_30 = Глубина_15_30;	
	ОбластьПараметры.Глубина_31_60 = Глубина_31_60;	          
	ОбластьПараметры.Глубина_60 = Глубина_60;	
	ОбластьПараметры.ПроживанияЗаездРаньше = ПроживанияЗаездРаньше;	
	
	ОбластьПараметры.Мероприятия = Мероприятия;	
	//ПрогнозЗагрузки	Глубина_0_1	Глубина_2_3	Глубина_4_7	Глубина_6_7	Глубина_8_14	Глубина_11_14	Глубина_15_30	Глубина_31_60	Глубина_60	ПроживанияЗаездРаньше	Меропрятия
	
	ТабДок.Вывести(Область);
	
	Дата_П = Дата_П + 24* 60 * 60;	 
КонецЦикла;

Возврат ТабДок; 
КонецФункции

&НаСервере
Функция СформироватьНаСервере_1()
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомернойФонд.Ссылка) КАК КоличествоНомеров
                      |ИЗ
                      |	Справочник.НомернойФонд КАК НомернойФонд
                      |ГДЕ
                      |	НомернойФонд.ПометкаУдаления = ЛОЖЬ");	

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда 
	КоличествоНомеров = Выборка.КоличествоНомеров;
Иначе
	Возврат Неопределено;
КонецЕсли;

ТабДок = Новый ТабличныйДокумент;
Макет = Обработки.ГлубинаБронирования.ПолучитьМакет("Макет");

Область = Макет.ПолучитьОбласть("Шапка");
ТабДок.Вывести(Область);

Дата_П = ДатаС; 

Пока Дата_П <= ДатаПо Цикл
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ЗаявкаНаБронирование.Номер КАК Номер,
	//                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
	//                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
	//                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
	//                      |	ЗаявкаНаБронирование.Дата КАК Дата,
	//                      |	РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Дата, ЗаявкаНаБронирование.РезервС, ДЕНЬ) КАК РазностьДат
	//                      |ИЗ
	//                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	//                      |		ПО ЗаявкаНаБронирование.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
	//                      |ГДЕ
	//                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	//                      |	И (ВЫБОР
	//                      |				КОГДА ЗаявкаНаБронирование.РезервС > &ТекущаяДата
	//                      |					ТОГДА ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	//                      |				ИНАЧЕ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Неустойка)
	//                      |			КОНЕЦ
	//                      |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает)
	//                      |			ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал))
	//                      |	И ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
	//                      |	И ЗаявкаНаБронирование.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
	//                      |	И ЗаявкаНаБронированиеПроживание.ДеньПроживания = &ДеньПроживания
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	Номер");
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ЗаявкаНаБронирование.Номер КАК Номер,
	//                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
	//                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
	//                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
	//                      |	ЗаявкаНаБронирование.Дата КАК Дата,
	//                      |	РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Дата, ЗаявкаНаБронирование.РезервС, ДЕНЬ) КАК РазностьДат
	//                      |ИЗ
	//                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаБронирование.Проживание КАК ЗаявкаНаБронированиеПроживание
	//                      |		ПО ЗаявкаНаБронирование.Ссылка = ЗаявкаНаБронированиеПроживание.Ссылка
	//                      |ГДЕ
	//                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	//                      |	И ВЫБОР
	//                      |			КОГДА ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	//                      |				ТОГДА ЗаявкаНаБронирование.РезервС = &ТекущаяДата
	//                      |			ИНАЧЕ ВЫБОР
	//                      |					КОГДА ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает)
	//                      |							ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
	//                      |						ТОГДА ЗаявкаНаБронирование.РезервС = &ТекущаяДата
	//                      |								ИЛИ ЗаявкаНаБронирование.РезервС < &ТекущаяДата
	//                      |									И ЗаявкаНаБронирование.РезервПо > &ТекущаяДата
	//                      |				КОНЕЦ
	//                      |		КОНЕЦ
	//                      |	И ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
	//                      |	И ЗаявкаНаБронирование.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
	//                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
	//                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаявкаНаБронирование.Номер КАК Номер,
	                      |	ЗаявкаНаБронирование.Ссылка КАК Ссылка,
	                      |	ЗаявкаНаБронирование.РезервС КАК РезервС,
	                      |	ЗаявкаНаБронирование.РезервПо КАК РезервПо,
	                      |	ЗаявкаНаБронирование.Дата КАК Дата,
	                      |	РАЗНОСТЬДАТ(ЗаявкаНаБронирование.Дата, ЗаявкаНаБронирование.РезервС, ДЕНЬ) КАК РазностьДат
	                      |ИЗ
	                      |	Документ.ЗаявкаНаБронирование КАК ЗаявкаНаБронирование
	                      |ГДЕ
	                      |	ЗаявкаНаБронирование.ПометкаУдаления = ЛОЖЬ
	                      |	И ВЫБОР
	                      |			КОГДА ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Бронь)
	                      |				ТОГДА ЗаявкаНаБронирование.РезервС = &ТекущаяДата
	                      |			ИНАЧЕ ВЫБОР
	                      |					КОГДА ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Проживает)
	                      |							ИЛИ ЗаявкаНаБронирование.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусБрони.Выехал)
	                      |						ТОГДА ЗаявкаНаБронирование.РезервС = &ТекущаяДата
	                      |								ИЛИ ЗаявкаНаБронирование.РезервС < &ТекущаяДата
	                      |									И ЗаявкаНаБронирование.РезервПо > &ТекущаяДата
	                      |					ИНАЧЕ ЛОЖЬ
	                      |				КОНЕЦ
	                      |		КОНЕЦ
	                      |	И ЗаявкаНаБронирование.БонШанс = ЛОЖЬ
	                      |	И ЗаявкаНаБронирование.ТипБронирования <> ЗНАЧЕНИЕ(Справочник.ТипБронирования.Ремонт)
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтменаБронирования)
	                      |	И ЗаявкаНаБронирование.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусБрони.ОтказОтБронирования)");

	
	//Дата_П = '20250110';
	Запрос.УстановитьПараметр("ТекущаяДата", Дата_П);
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Свернуть("Номер, Ссылка, РезервС, РезервПо, Дата, РазностьДат");  
	ИтогоНомеров = 0;
	Глубина_0_1	= 0;
	Глубина_2_3	= 0;
	Глубина_4_7	= 0;
	Глубина_8_14 = 0;	
	Глубина_15_30 = 0;
	Глубина_31_60 = 0;
	Глубина_60 = 0;	
	ПроживанияЗаездРаньше = 0;
	//Мероприятия
	Для Каждого Строка Из ТЗ Цикл
		ИтогоНомеров = ИтогоНомеров + 1;
		
		Если Дата_П > Строка.РезервС И Дата_П < Строка.РезервПо Тогда
			ПроживанияЗаездРаньше = ПроживанияЗаездРаньше + 1;
		Иначе		
			РазницаДаты = Строка.РазностьДат; 
			Если РазницаДаты < 0 Тогда 
				РазницаДаты = 0; 
			КонецЕсли;	
			
			Если РазницаДаты < 2 Тогда 
				Глубина_0_1 = Глубина_0_1 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 1 
			И РазницаДаты < 4 
			Тогда 
				Глубина_2_3 = Глубина_2_3 + 1;
			КонецЕсли;

			Если РазницаДаты > 3 
			И РазницаДаты < 8 
			Тогда 
				Глубина_4_7 = Глубина_4_7 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 7 
			И РазницаДаты < 15 
			Тогда 
				Глубина_8_14 = Глубина_8_14 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 14 
			И РазницаДаты < 31 
			Тогда 
				Глубина_15_30 = Глубина_15_30 + 1;
			КонецЕсли;

			Если РазницаДаты > 30 
			И РазницаДаты < 61 
			Тогда 
				Глубина_31_60 = Глубина_31_60 + 1;
			КонецЕсли;
			
			Если РазницаДаты > 60 
			Тогда 
				Глубина_60 = Глубина_60 + 1;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	ПрогнозЗагрузки = Окр((ИтогоНомеров / КоличествоНомеров) * 100);
	
	ЗапросМероприятия = Новый Запрос("ВЫБРАТЬ
	                                 |	Мероприятия.Ссылка КАК Ссылка,
	                                 |	Мероприятия.Наименование КАК Наименование,
	                                 |	Мероприятия.ДатаС КАК ДатаС,
	                                 |	Мероприятия.ДатаПо КАК ДатаПо,
	                                 |	Мероприятия.ТипМероприятия КАК ТипМероприятия,
	                                 |	Мероприятия.Мероприятие КАК Мероприятие
	                                 |ИЗ
	                                 |	Справочник.Мероприятия КАК Мероприятия
	                                 |ГДЕ
	                                 |	Мероприятия.ПометкаУдаления = ЛОЖЬ
	                                 |	И Мероприятия.ДатаС <= &Дата
	                                 |	И Мероприятия.ДатаПо >= &Дата
	                                 |
	                                 |УПОРЯДОЧИТЬ ПО
	                                 |	ДатаС");
	
	ЗапросМероприятия.УстановитьПараметр("Дата", Дата_П);
	ТЗМероприятия = ЗапросМероприятия.Выполнить().Выгрузить();
	Мероприятия = "";
	Для Каждого Строка Из ТЗМероприятия Цикл
		Мероприятие = ?(ЗначениеЗаполнено(Строка.Мероприятие), Строка.Мероприятие, Строка.Наименование);
		Мероприятия = Мероприятия + Мероприятие + Символы.ПС;
	КонецЦикла;
	Если Мероприятия <> "" Тогда 
		Мероприятия = Лев(Мероприятия, СтрДлина(Мероприятия) - 1);
	КонецЕсли; 
	
	Область = Макет.ПолучитьОбласть("Строка");	 
	ОбластьПараметры = Область.Параметры;
	
	ОбластьПараметры.Дата = Формат(Дата_П, "ДФ=dd.MM.yy");
	ДеньНедели = ОбщийФункционалКлиентСервер.ДеньНеделиСтрока(ДеньНедели(Дата_П)); 
	ОбластьПараметры.ДеньНедели = ДеньНедели;	
	
	ОбластьПараметры.ИтогоНомеров = ИтогоНомеров;	
	ОбластьПараметры.ПрогнозЗагрузки = ПрогнозЗагрузки;	
	ОбластьПараметры.Глубина_0_1 = Глубина_0_1;	
	ОбластьПараметры.Глубина_2_3 = Глубина_2_3;	
	ОбластьПараметры.Глубина_4_7 = Глубина_4_7;	
	ОбластьПараметры.Глубина_8_14 = Глубина_8_14;	
	ОбластьПараметры.Глубина_15_30 = Глубина_15_30;	
	ОбластьПараметры.Глубина_31_60 = Глубина_31_60;	          
	ОбластьПараметры.Глубина_60 = Глубина_60;	
	ОбластьПараметры.ПроживанияЗаездРаньше = ПроживанияЗаездРаньше;	
	
	ОбластьПараметры.Мероприятия = Мероприятия;	
	//ПрогнозЗагрузки	Глубина_0_1	Глубина_2_3	Глубина_4_7	Глубина_6_7	Глубина_8_14	Глубина_11_14	Глубина_15_30	Глубина_31_60	Глубина_60	ПроживанияЗаездРаньше	Меропрятия
	
	ТабДок.Вывести(Область);
	
	Дата_П = Дата_П + 24* 60 * 60;	 
КонецЦикла;

Возврат ТабДок; 
КонецФункции
