
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(ТекущаяДата()));	
	
УстановитьПользовательскийОтборДинамическогоСписка(Список, "НеАктуальный", Ложь, ВидСравненияКомпоновкиДанных.Равно
	, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля, Значение, ВидСравнения, РежимОтображения)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				 Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НовыйЭлементОтбора = Неопределено Тогда
			НовыйЭлементОтбора = ПользовательскийОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
	
		НовыйЭлементОтбора.ВидСравнения = ВидСравнения;
		НовыйЭлементОтбора.Использование = Истина;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		//НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		НовыйЭлементОтбора.РежимОтображения = РежимОтображения;
		НовыйЭлементОтбора.ПравоеЗначение = Значение;
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СброситьПользовательскийОтборДинамическогоСписка(Список, ИмяПоля)
Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ПользовательскийОтбор = ЭлементОтбора.Элементы;
		
		НовыйЭлементОтбора = Неопределено;
		Для Каждого СуществующийЭлементОтбора Из ПользовательскийОтбор Цикл
			Если СуществующийЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				НовыйЭлементОтбора = СуществующийЭлементОтбора;
				
				 Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НовыйЭлементОтбора = Неопределено Тогда Возврат; КонецЕсли;
		ПользовательскийОтбор.Удалить(НовыйЭлементОтбора);
	КонецЕсли;                                                  
КонецЦикла;
КонецПроцедуры



