
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЭтаФорма.ТолькоПросмотр = НастройкиСервер.ФормаТолькоПросмотр(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
ТекущаяСтрока = Элемент.ТекущаяСтрока;

ТаблицаРеквизит = ТаблицаДолгиОплата;
СписокПриАктивизацииСтрокиНаСервере(ТекущаяСтрока, ТаблицаРеквизит);
КопироватьДанныеФормы(ТаблицаРеквизит, ТаблицаДолгиОплата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриАктивизацииСтрокиНаСервере(ТекущаяСтрока, ТаблицаРеквизит)
ТаблицаЗначение = ДанныеФормыВЗначение(ТаблицаРеквизит, Тип("ТаблицаЗначений"));	

Если ТекущаяСтрока = Неопределено Тогда 
	ТаблицаЗначение.Очистить();
Иначе	
	ТекущийОбъект = ТекущаяСтрока.ПолучитьОбъект();
	ТаблицаЗначение.Очистить();
	Для Каждого Строка Из ТекущийОбъект.ДолгиОплата Цикл
		НоваяСтрока = ТаблицаЗначение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
КонецЕсли;	

ЗначениеВДанныеФормы(ТаблицаЗначение, ТаблицаРеквизит);
КонецПроцедуры




