
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		// регистр ОстаткиПродукции Приход
		Если ТекСтрокаТовары.Расхождение=0 тогда
			Продолжить;
		конецесли;
		
		Движение = Движения.ОстаткиПродукции.Добавить();
		Если ТекСтрокаТовары.Расхождение>0 тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Товар = ТекСтрокаТовары.Товар;
			Движение.Количество = ТекСтрокаТовары.КоличествоФакт-ТекСтрокаТовары.КоличествоУчет;	
		иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = ТекСтрокаТовары.Товар;
			Движение.Количество = -1*(ТекСтрокаТовары.КоличествоФакт-ТекСтрокаТовары.КоличествоУчет);	
		конецесли;
		
		
		
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
