
//// + Цены, Суммы

// + ПСН
Функция ОкруглитьЦену(Цена) Экспорт
Возврат Цел(Цена);
КонецФункции

Функция ОкруглитьЦену_25(Цена) Экспорт
    Сотен = 100 * Цел(Цена/100);
    Рублей = Цена - Сотен;
    Если Рублей>=75 Тогда
        Рублей = 100;
    ИначеЕсли Рублей >= 25 Тогда
        Рублей = 50;
    Иначе
        Рублей = 0;        
    КонецЕсли;
    Возврат Сотен+Рублей;
КонецФункции

Функция ОкруглитьСумма(Сумма) Экспорт
//  Возврат Цел(Сумма);
Возврат Окр(Сумма, 2);
КонецФункции
// - ПСН

//
Функция ЦенаПроцентСкидкиБезЗавтрака(Цена, ПроцентСкидкиБезЗавтрака) Экспорт
Цена_П = Цена * (100.00 - ПроцентСкидкиБезЗавтрака)/100.00; 
Цена_П = ОкруглитьЦену(Цена_П);

Возврат Цена_П;	
КонецФункции
//
Функция ПолучитьБонШансЦена(ДатаЦены)
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	ЦеныБонШанс.Цена КАК Цена
                      |ИЗ
                      |	РегистрСведений.ЦеныБонШанс КАК ЦеныБонШанс
                      |ГДЕ
                      |	ЦеныБонШанс.ДатаЦены <= &ДатаЦены
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	ЦеныБонШанс.ДатаЦены УБЫВ");
Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены); 

Выборка = Запрос.Выполнить().Выбрать();

Если Выборка.Следующий() Тогда 
	Возврат Выборка.Цена;
Иначе 
	БонШансЦена = Константы.БонШансЦена.Получить();
	Возврат БонШансЦена;
КонецЕсли;
КонецФункции

// + ЗаполнитьТаблицуПроживания_Таблица 
Функция ЗаполнитьТаблицуПроживания_Таблица(Объект, Двухместный) Экспорт
Массив = Новый Массив();
ТЗ = Объект.Проживание.Выгрузить(Массив);

Если Объект.РезервС = Объект.РезервПо Тогда
	Если Объект.БонШанс Тогда
		НовДТ = ТЗ.Добавить();
		
		НовДТ.ДеньПроживания = Объект.РезервС;
		НовДТ.Количество = 1;
		
		Цена = ПолучитьБонШансЦена(НовДТ.ДеньПроживания);
		НовДТ.Цена = Цена;
		НовДТ.СуммаБезСкидки = НовДТ.Цена * НовДТ.Количество;
		НовДТ.Сумма = НовДТ.Цена * НовДТ.Количество;
		
	Иначе
		НовДТ = ТЗ.Добавить();
		
		НовДТ.ДеньПроживания = Объект.РезервС;
		
		НовДТ.Количество = 1;
		
		//Если Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр0 Тогда
		//	НовДТ.Количество = 2;
		//ИначеЕсли Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр6 Тогда
		//	НовДТ.Количество = 1.5;
		//Иначе
		//	НовДТ.Количество = 1;
		//КонецЕсли;		
		//
		//Если Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр18 Тогда	
		//	НовДТ.Количество = НовДТ.Количество + 0.5;
		//ИначеЕсли Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр0 Тогда	
		//	НовДТ.Количество = НовДТ.Количество + 1;
		//КонецЕсли;		
		
		ЗаполнитьЦенаСуммыСтрокаПроживание(НовДТ, Объект, Двухместный);
	КонецЕсли;		
	
Иначе

	ДТН=НачалоДня(Объект.РезервС);

	Пока ДТН<=НачалоДня(Объект.РезервПо - 86400) Цикл 
		НовДТ = ТЗ.Добавить();
		
		НовДТ.ДеньПроживания=ДТН;
		
		Если ДТН=НачалоДня(Объект.РезервС) Тогда 
			Если Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр0 Тогда
				НовДТ.Количество = 2;
			ИначеЕсли Объект.ВремяЗаезда=Перечисления.ВремяЗаезда.Вр6 Тогда
				НовДТ.Количество = 1.5;
			Иначе
				НовДТ.Количество = 1;
			КонецЕсли;		
		ИначеЕсли ДТН=НачалоДня(Объект.РезервПо-86400) Тогда // дата выезда
			Если Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр18 Тогда	
				НовДТ.Количество = 1.5;
			ИначеЕсли Объект.ВремяВыезда=Перечисления.ВремяВыезда.Вр0 Тогда	
				НовДТ.Количество = 2;
			Иначе	
				НовДТ.Количество = 1;
			КонецЕсли;
		Иначе 
			НовДТ.Количество=1;
		КонецЕсли;
		
		ЗаполнитьЦенаСуммыСтрокаПроживание(НовДТ, Объект, Двухместный);
		
		ДТН=ДТН+86400;
	КонецЦикла;
КонецЕсли;

Возврат ТЗ;
КонецФункции

Процедура ЗаполнитьЦенаСуммыСтрокаПроживание(Строка, Объект, Двухместный) Экспорт
	ТарифныйПлан = Объект.ТарифныйПлан;
	
	Если ЗначениеЗаполнено(ТарифныйПлан) Тогда
		Цена =  ЦенаНаДеньТарифныйПлан(Строка.ДеньПроживания, ТарифныйПлан
			, Объект.КатегорияНомера, Объект.БезЗавтрака, Двухместный);
			
		Если Цена = 0 Тогда Перейти ~ЦЕНОВАЯ_ПОЛИТИКА; КонецЕсли;	

		Строка.Цена =  Цена;	
		Строка.СуммаБезСкидки = Строка.Цена * Строка.Количество;		
		
		Строка.Сумма = Строка.СуммаБезСкидки;
		
		Возврат;
	КонецЕсли;
	
~ЦЕНОВАЯ_ПОЛИТИКА:	
	Строка.Цена =  ЦенаНаДень(Строка.ДеньПроживания, Объект.КатегорияНомера
		, Объект.БезЗавтрака, Двухместный);

	Строка.СуммаБезСкидки = Строка.Цена * Строка.Количество;
	
	ЗаполнитьСтрокаПроживаниеСкидкаСумма(Строка, Объект);
КонецПроцедуры

Процедура ЗаполнитьСтрокаПроживаниеСкидкаСумма(Строка, Объект) Экспорт
	Строка.ПроцентСкидкиКлиента = ИтогоСкидка(Объект);
	ЗаполнитьСуммаСоСкидкойСтрокаПроживание(Строка);
КонецПроцедуры

Процедура ЗаполнитьСуммаСоСкидкойСтрокаПроживание(Строка) Экспорт
Строка.Сумма = ОкруглитьСумма((Строка.СуммаБезСкидки * (1 - (Строка.ПроцентСкидкиКлиента/100))));
КонецПроцедуры	

Функция ЦенаНаДень(ДТН, КатегорияНомера, БезЗавтрака, Двухместный) Экспорт
Цена = ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомера, БезЗавтрака, Двухместный);
Возврат Цена;
КонецФункции	

Функция ПолучитьЦенуПоЦеновойПолитике(ДТН, КатегорияНомера, БезЗавтрака, Двухместный) Экспорт
ПроцентСкидкиБезЗавтрака = ПроцентСкидкиБезЗавтрака();	
ЕстьПроцентСкидкиБезЗавтрака = ПроцентСкидкиБезЗавтрака <> 0;	
	
БазоваяЦена = ПолучитьБазовуюЦену(ДТН, КатегорияНомера, БезЗавтрака, Двухместный, ПроцентСкидкиБезЗавтрака) ;

ИзменениеЦены = ПолучитьИзменениеЦеныНаДату(ДТН, КатегорияНомера, БезЗавтрака, Двухместный, ЕстьПроцентСкидкиБезЗавтрака);

Цена = ОкруглитьЦену(БазоваяЦена + ИзменениеЦены); 

Если БезЗавтрака Тогда 
	Если ЕстьПроцентСкидкиБезЗавтрака Тогда
		Цена = Цена * (100.00 - ПроцентСкидкиБезЗавтрака)/100.00; 
		Цена = ОкруглитьЦену(Цена);
	КонецЕсли;
КонецЕсли;

Возврат Цена;
КонецФункции

Функция ПолучитьБазовуюЦену(ДТН, КатегорияНомера, Знач БезЗавтрака, Двухместный, ПроцентСкидкиБезЗавтрака) 
Если НЕ ЗначениеЗаполнено(КатегорияНомера) Тогда Возврат 0; КонецЕсли; 

Если Двухместный = Неопределено Тогда Возврат 0; КонецЕсли;	

НачальныеБазовыеЦены = КалендарьЦен_Старый.НачальныеБазовыеЦены(КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака);
БТ			= НачальныеБазовыеЦены.БТ;
БТ_Вых		= НачальныеБазовыеЦены.БТ_Вых;		
БТ_2		= НачальныеБазовыеЦены.БТ_2;
БТ_Вых_2	= НачальныеБазовыеЦены.БТ_Вых_2;

Если Двухместный Тогда 
	БТ_П = БТ_2; 
	БТ_Вых_П = БТ_Вых_2; 
Иначе
	БТ_П = БТ; 
	БТ_Вых_П = БТ_Вых; 
КонецЕсли;

ДатаЦеныНачалоГода = НачалоГода(ДТН);
ТЗБазоваяЦенаДня = КалендарьЦен_Старый.ПолучитьТЗБазовыеЦены(ДатаЦеныНачалоГода, КатегорияНомера, БезЗавтрака, ПроцентСкидкиБезЗавтрака);

Результат = КалендарьЦен_Старый.ПолучитьБазоваяЦенаДня(ДТН, ТЗБазоваяЦенаДня, БТ_П, БТ_Вых_П
	, КатегорияНомера, БезЗавтрака, Двухместный, ПроцентСкидкиБезЗавтрака);      
БазоваяЦенаДня = Результат.БазовыйТарифДатаЦены;

Возврат БазоваяЦенаДня;
КонецФункции

Функция ЦенаНаДеньТарифныйПлан(ДТН, ТарифныйПлан, КатегорияНомера
			, Знач БезЗавтрака, Двухместный) Экспорт
	Если НЕ ЗначениеЗаполнено(ТарифныйПлан) Тогда Возврат 0; КонецЕсли; 
	
	Если Двухместный = Неопределено Тогда Возврат 0; КонецЕсли;	

	ПроцентСкидкиБезЗавтрака = ПроцентСкидкиБезЗавтрака();	
	ЕстьПроцентСкидкиБезЗавтрака = ПроцентСкидкиБезЗавтрака <> 0;	
	
	//ВыходнойДень = ДеньНедели(ДТН) < 5;
	ВыходнойДень = ДеньНедели(ДТН) > 4;
	
	Если ЕстьПроцентСкидкиБезЗавтрака Тогда
		БезЗавтракаПараметр = Ложь;	
	Иначе
		БезЗавтракаПараметр = БезЗавтрака;	
	КонецЕсли;	
	
	ТарифныйПланСтроки = ТарифныйПлан.ТарифныйПланСтроки.Выгрузить();
	
	ТарифныйПланСтроки.Сортировать("ДатаТарифаС, ДатаТарифаПо");
	
	СтрокаТарифа = Неопределено;
	Для Каждого Строка Из ТарифныйПланСтроки Цикл
		Если ЗначениеЗаполнено(Строка.ДатаТарифаС) Тогда
			Если Строка.ДатаТарифаС > ДТН Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Строка.ДатаТарифаПо) Тогда
			Если Строка.ДатаТарифаПо < ДТН Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.КатегорияНомера) Тогда
			Если Строка.КатегорияНомера <> КатегорияНомера Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;           
		
		СтрокаТарифа = Строка;
		Прервать;
	КонецЦикла;
	
	Если СтрокаТарифа = Неопределено Тогда Возврат 0; КонецЕсли;	
	
	Если ВыходнойДень И Двухместный И БезЗавтракаПараметр  Тогда
		ЦенаВыходныеДвухБезЗавтрака = ?(СтрокаТарифа.ЦенаВыходныеДвухБезЗавтрака = 0
			, СтрокаТарифа.ЦенаВыходныеДвух, СтрокаТарифа.ЦенаВыходныеДвухБезЗавтрака); 
		
		Цена	= ЦенаВыходныеДвухБезЗавтрака;
	ИначеЕсли ВыходнойДень И Двухместный И (НЕ БезЗавтракаПараметр) Тогда
		Цена	= СтрокаТарифа.ЦенаВыходныеДвух;
		
	ИначеЕсли ВыходнойДень И (НЕ Двухместный) И БезЗавтракаПараметр  Тогда
		ЦенаВыходныеБезЗавтрака = ?(СтрокаТарифа.ЦенаВыходныеБезЗавтрака = 0
			, СтрокаТарифа.ЦенаВыходные, СтрокаТарифа.ЦенаВыходныеБезЗавтрака); 
		
		Цена	= ЦенаВыходныеБезЗавтрака;
	ИначеЕсли ВыходнойДень И (НЕ Двухместный) И (НЕ БезЗавтракаПараметр) Тогда
		Цена	= СтрокаТарифа.ЦенаВыходные;
		
//		
	ИначеЕсли (НЕ ВыходнойДень) И Двухместный И БезЗавтракаПараметр  Тогда
		ЦенаБудниДвухБезЗавтрака = ?(СтрокаТарифа.ЦенаБудниДвухБезЗавтрака = 0
			, СтрокаТарифа.ЦенаБудниДвух, СтрокаТарифа.ЦенаБудниДвухБезЗавтрака); 
			
		Цена	= ЦенаБудниДвухБезЗавтрака;
	ИначеЕсли (НЕ ВыходнойДень) И Двухместный И (НЕ БезЗавтракаПараметр) Тогда
		Цена	= СтрокаТарифа.ЦенаБудниДвух;
		
	ИначеЕсли (НЕ ВыходнойДень) И (НЕ Двухместный) И БезЗавтракаПараметр  Тогда
		ЦенаБудниБезЗавтрака = ?(СтрокаТарифа.ЦенаБудниБезЗавтрака = 0
			, СтрокаТарифа.ЦенаБудни, СтрокаТарифа.ЦенаБудниБезЗавтрака); 
		
		Цена	= ЦенаБудниБезЗавтрака;
	ИначеЕсли (НЕ ВыходнойДень) И (НЕ Двухместный) И (НЕ БезЗавтракаПараметр) Тогда
		Цена	= СтрокаТарифа.ЦенаБудни;
	КонецЕсли;
	
	Если БезЗавтрака Тогда 
		Если ЕстьПроцентСкидкиБезЗавтрака Тогда
			Цена = Цена * (100.00 - ПроцентСкидкиБезЗавтрака)/100.00; 
			Цена = ОкруглитьЦену(Цена);
		КонецЕсли;
	КонецЕсли;

	Возврат Цена;
КонецФункции

Функция ПолучитьИзменениеЦеныНаДату(ДТН, КатегорияНомера, БезЗавтрака, Двухместный, ЕстьПроцентСкидкиБезЗавтрака) 
	Если НЕ ЗначениеЗаполнено(КатегорияНомера) Тогда Возврат 0; КонецЕсли; 
	
	Если Двухместный = Неопределено Тогда Возврат 0; КонецЕсли;	
	
	ЗапросЦен=Новый Запрос("ВЫБРАТЬ
	                       |	ЦеныПоДатам.ДатаЦены,
	                       |	ЦеныПоДатам.ПроцентИзменения
	                       |ИЗ
	                       |	РегистрСведений.ЦеныПоДатам КАК ЦеныПоДатам
	                       |ГДЕ
	                       |	ЦеныПоДатам.ДатаЦены = &ДатаЦены
	                       |	И ЦеныПоДатам.Категория = &Категория
	                       |	И ЦеныПоДатам.БезЗавтрака = &БезЗавтрака
	                       |	И ЦеныПоДатам.Двухместный = &Двухместный");
	ЗапросЦен.УстановитьПараметр("ДатаЦены",ДТН);
	ЗапросЦен.УстановитьПараметр("Категория",КатегорияНомера);
	Если ЕстьПроцентСкидкиБезЗавтрака Тогда  
		ЗапросЦен.УстановитьПараметр("БезЗавтрака",Ложь)
	Иначе	
		ЗапросЦен.УстановитьПараметр("БезЗавтрака",БезЗавтрака)
	КонецЕсли;
	ЗапросЦен.УстановитьПараметр("Двухместный",Двухместный);

	ТЗЦ=ЗапросЦен.Выполнить().Выгрузить();
	Если ТЗЦ.Количество()=0 тогда
		Возврат 0;
	Иначе 
		Возврат ТЗЦ[0].ПроцентИзменения;
	КонецЕсли;
КонецФункции

Функция ИтогоСкидка(Объект) Экспорт
ИтогоСкидка = 0;
Если ЗначениеЗаполнено(Объект.Бронирует) Тогда 
	Если Объект.Бронирует.Турагентство Тогда 
		Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда
			Если Объект.Бронирует = Объект.Оплачивает Тогда 		
				Если Объект.Оплачивает.ТипОплатыСчета = Перечисления.ТипОплатыСчета.Взаимозачет
				ИЛИ Объект.Оплачивает.ТипОплатыСчета = Перечисления.ТипОплатыСчета.ОплатаТурагентствомСоСкидкой 
				Тогда
					//ИтогоСкидка=Объект.Оплачивает.ПроцентКомиссии;
					ИтогоСкидка = ПроцентКомиссииКлиента(Объект.Оплачивает, Объект.РезервС);
				Иначе	
					ИтогоСкидка=Объект.Оплачивает.Категория.Скидка;
				КонецЕсли;		
			Иначе
				ИтогоСкидка=Объект.Оплачивает.Категория.Скидка;
			КонецЕсли;
		Иначе
			ИтогоСкидка=Объект.Клиент.Категория.Скидка;
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда
			ИтогоСкидка=Объект.Оплачивает.Категория.Скидка;
		Иначе
			ИтогоСкидка=Объект.Клиент.Категория.Скидка;
		КонецЕсли;		
	КонецЕсли;	
Иначе
	Если ЗначениеЗаполнено(Объект.Оплачивает) Тогда
		ИтогоСкидка=Объект.Оплачивает.Категория.Скидка;
	Иначе
		ИтогоСкидка=Объект.Клиент.Категория.Скидка;
	КонецЕсли;		
КонецЕсли;		

Возврат ИтогоСкидка;
КонецФункции	

Функция ПроцентКомиссииКлиента(Клиент, ДатаНачалаДействия) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	КлиентыПроцентыКомиссии.ПроцентКомиссии КАК ПроцентКомиссии
                      |ИЗ
                      |	Справочник.Клиенты.ПроцентыКомиссии КАК КлиентыПроцентыКомиссии
                      |ГДЕ
                      |	КлиентыПроцентыКомиссии.Ссылка = &Клиент
                      |	И КлиентыПроцентыКомиссии.ДатаНачалаДействия <= &ДатаНачалаДействия
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	КлиентыПроцентыКомиссии.ДатаНачалаДействия УБЫВ");

Запрос.УстановитьПараметр("Клиент", Клиент);
Запрос.УстановитьПараметр("ДатаНачалаДействия", НачалоДня(ДатаНачалаДействия));
ТЗ = Запрос.Выполнить().Выгрузить();

Если ТЗ.Количество() = 0 Тогда
	Возврат Клиент.ПроцентКомиссии;
Иначе
	Возврат ТЗ[0].ПроцентКомиссии;
КонецЕсли;
	
КонецФункции

Функция СуммаСоСкидкой(Сумма, Объект) Экспорт
ИтогоСкидка = ИтогоСкидка(Объект);
СуммаСоСкидкой=СуммаСоСкидкойСкидка(Сумма, ИтогоСкидка); 

Возврат СуммаСоСкидкой;
КонецФункции

Функция СуммаСоСкидкойСкидка(Сумма, Скидка) Экспорт
СуммаСоСкидкой=ОкруглитьСумма(Сумма - Сумма*(Скидка/100));

Возврат СуммаСоСкидкой;
КонецФункции

Функция ПроцентСкидкиБезЗавтрака() Экспорт
Организация = Константы.Организация.Получить();
Возврат Организация.ПроцентСкидкиБезЗавтрака;
КонецФункции	
// - ЗаполнитьТаблицуПроживания_Таблица 

