
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;

Если НЕ ТекущийПользователь.Админ Тогда  
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = Истина;
КонецЕсли;

ТипУборкиСписокВыбора = Элементы.ТипУборки.СписокВыбора;  
ТипУборкиВыборка = Справочники.ТипыУборок.Выбрать(); 
Пока ТипУборкиВыборка.Следующий() Цикл
	Если ТипУборкиВыборка.ПометкаУдаления Тогда Продолжить; КонецЕсли;
	
	ТипУборкиСписокВыбора.Добавить(ТипУборкиВыборка.Наименование);
КонецЦИкла;

ТипКомплектацииСписокВыбора = Элементы.ТипКомплектации.СписокВыбора;  
ТипКомплектацииВыборка = Справочники.ТипыКомплектаций.Выбрать(); 
Пока ТипКомплектацииВыборка.Следующий() Цикл
	Если ТипКомплектацииВыборка.ПометкаУдаления Тогда Продолжить; КонецЕсли;
	
	ТипКомплектацииСписокВыбора.Добавить(ТипКомплектацииВыборка.Наименование);
КонецЦИкла;

ТипДопМестаСписокВыбораЗаполнить(Элементы.ДопМесто_1_ТипДопМеста.СписокВыбора);
ТипДопМестаСписокВыбораЗаполнить(Элементы.ДопМесто_2_ТипДопМеста.СписокВыбора);

КонецПроцедуры

&НаСервере
Процедура ТипДопМестаСписокВыбораЗаполнить(СписокВыбора)  Экспорт
СписокВыбора.Добавить(0, "Нет");
СписокВыбора.Добавить(1, "Доп. кр.");
СписокВыбора.Добавить(2, "Манеж");
Конецпроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
Для Каждого Строка Из Объект.Минибар Цикл
	Строка.Сумма = Строка.Количество * Строка.Цена;	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТипУборкиПриИзменении(Элемент)
	ТипУборкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипУборкиПриИзмененииНаСервере()
ТипУборкиСсылка = Справочники.ТипыУборок.НайтиПоНаименованию(Объект.ТипУборки, Истина);
Если ЗначениеЗаполнено(ТипУборкиСсылка) Тогда 
	Объект.ТипУборкиПризнак = ТипУборкиСсылка.ТипУборкиПризнак;
Иначе	
	Объект.ТипУборкиПризнак = "";
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Если НЕ РучноеИзменение_Изменение Тогда  	
	Объект.РучноеИзменение = Истина;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РучноеИзменениеПриИзменении(Элемент)
РучноеИзменение_Изменение = Истина;	
КонецПроцедуры

//

&НаКлиенте
Процедура МинибарПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
ТекущиеДанные = Элемент.ТекущиеДанные;
ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;	
КонецПроцедуры


&НаКлиенте
Процедура МинибарНоменклатураМинибараПриИзменении(Элемент)
ТекущаяСтрока = Элементы.Минибар.ТекущаяСтрока;
МинибарНоменклатураМинибараПриИзмененииНаСервере(ТекущаяСтрока);
КонецПроцедуры


&НаСервере
Процедура МинибарНоменклатураМинибараПриИзмененииНаСервере(ТекущаяСтрока)
ТекущиеДанные = Объект.Минибар.НайтиПоИдентификатору(ТекущаяСтрока);	

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	НоменклатураМиниБара.Цена КАК Цена
                      |ИЗ
                      |	Справочник.НоменклатураМиниБара КАК НоменклатураМиниБара
                      |ГДЕ
                      |	НоменклатураМиниБара.Ссылка = &Ссылка");

Запрос.УстановитьПараметр("Ссылка", ТекущиеДанные.НоменклатураМинибара);

Выборка = Запрос.Выполнить().Выбрать();

Если Выборка.Следующий() Тогда
	ТекущиеДанные.Цена = Выборка.Цена;
Иначе
	ТекущиеДанные.Цена = 0;
КонецЕсли;
КонецПроцедуры








